[
    {
        "post_name": "Best Actor",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we gave him an Oscar, would he finally consider his purpose fulfilled and fuck off?",
                "author": "TheImpossible1"
            },
            {
                "raw_content": "Beautiful. I'm tearing up. Dropped my tendies. I stand with Ukraine",
                "author": "InterloperKO"
            },
            {
                "raw_content": "So he does own a suit?",
                "author": "xkgb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇺🇸 USAF Gen. James B. Hecker warns former NATO pilots to avoid 🇨🇳 CCP-backed aviation companies",
        "score": 481,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's pathetic is these military veterans don't get charged with treason",
                "author": "durianpear"
            },
            {
                "raw_content": "All our targeting systems and gps tracking are all made with Chinese parts anyway. They can pull whatever data they want. “Well we’re gonna hire some unqualified sheboons to fly a 757 and don’t you dare work for a Chinese owned company!” says the Chinese owned government.",
                "author": "MAGATRON2020"
            },
            {
                "raw_content": "Chyna Flyrus!! 🇨🇳",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pizza restaurant kicks out republicans in Minnesota.",
        "score": 470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minnesota is a shit hole, so that checks out.",
                "author": "Marat1792"
            },
            {
                "raw_content": "\"Tolerant left\"",
                "author": "ModelMinority"
            },
            {
                "raw_content": "Maybe we should call this Pizzagate and see what related news gets discussed.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We should spend less time worrying about Putin, and more time worrying about migrant rape gangs, drug lords, murderers, and people from mental institutions entering our Country - So that we don’t end up like Europe!",
        "score": 1675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What has Vladimir Putin done that negatively impacts me or my community? What has GloboHomo done that's negatively impacted me or my community? If I'm asked to \"pick a side\", my answer is \"please leave me alone\"",
                "author": "business_narwhall"
            },
            {
                "raw_content": "At this point, I really dont care about El Chapo across the border. I care about the multinational child trafficking criminal cartel that has our government compromised. Clean this country up first, and start with this corrupted rotting government.",
                "author": "BidenIsAChicomAgent"
            },
            {
                "raw_content": "I have spent exactly 0 seconds of my life worrying about Putin.",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I found you.",
        "score": 1636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Extremely cute he thinks anyone anti-Trump is the majority in this country. At best there a SEVERE minority",
                "author": "DingleBalls"
            },
            {
                "raw_content": "\"American majority\" is crazy, considering president Trump won the *popular* vote.",
                "author": "-Evspra"
            },
            {
                "raw_content": "> I'm the majority! *loses election*",
                "author": "Mountaineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Big brother loses his eye in UK...",
        "score": 1965,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A glimmer of hope for the Brits.",
                "author": "NwrrHandshakeAccount"
            },
            {
                "raw_content": "The ONLY way we ever get \"zero emission\" or \"net zero\" is to abandon all modern technology, go back to being hunter/gatherers and love in caves. It's a pipe dream.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "way to go ya blokes!",
                "author": "Deplorable556"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exciting news! The Treasury Department has announced that they are suspending all enforcement of the outrageous and invasive Beneficial Ownership Information (BOI) reporting requirement for U.S. Citizens. This Biden rule has been an absolute disaster for Small Businesses Nationwide.",
        "score": 1316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone please explain this to me like I'm five and a retard. Thanks in advance.",
                "author": "AsaNisiMAGA"
            },
            {
                "raw_content": "Lol I've been putting this off for months, kind of with him doing this in the back of my head. Who says procrastination doesn't pay??",
                "author": "Litterboxer1"
            },
            {
                "raw_content": "It was a measure put in place supposedly to stop shell owning shell shell owning shell shell owning shell shell owning shell kind of rabbit hole so people know who is behind a particular company. While that might sound good, it's an invasion of privacy. Why don't we just straight up stop letting foreign actors and individuals start companies inside this nation unless they declare who they are with the government? Or stop it altogether?",
                "author": "BigBadMagaMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now I get it",
        "score": 2011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bingo!! You broke the code! The \"great replacement\" continues! White Europeans are gonna be going extinct.",
                "author": "StumpJumper52"
            },
            {
                "raw_content": "\"to kill white men\" On point. The left/globohomos want to eradicate most whites and enslave the rest. It's sad how many whites don't know their history, because it's repeating itself.",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "That clicks. Fucking NPCs. Hard to believe \"war isn't the answer\" is now a right-wing extremist view. Sad.....",
                "author": "Kermit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A new Missouri bill would reward citizens with $1,000 for each illegal alien they report, provided it leads to an arrest",
        "score": 1403,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It should only be if it leads to a deportation.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "This is the way.",
                "author": "MAGATRON2020"
            },
            {
                "raw_content": "Good, but we need more. Allow citizens to bounty hunt these criminals and deliver directly to ICE.",
                "author": "redredwine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well, seems like at least Secretary Hegseth is mimicking President Trump's pace. Hopefully the DOJ can start posting some victories....",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US military finally being used to defend US borders for once. An actual proper use for the US military.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "I like that our military is defending our borders. Seems like a really obvious use. Like why hasn't this been standard?.......o ya, we are run by corrupt idiots",
                "author": "half-blacktrump"
            },
            {
                "raw_content": "On a side note I hate the Osprey! When I was trying to rest between nonstop medevac missions, these guys would fly in, and sit at idle for hrs. At idle the the blade vertices make a crazy amount of noise. Typical war time, no shit, there I was story",
                "author": "SaltyAv8er"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There seems to be a large presence of sex offenders at the Dolby Theater in Hollywood,CA, tonight.",
        "score": 1233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hollywood is a woke trash propaganda factory. Look into S Korean cinema and TV shows for entertainment. Light years better than anything coming out of Hollywood over the last few decades.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "What is that, the Oscars?",
                "author": "Tele_Plus"
            },
            {
                "raw_content": "That's funny.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hahahahahahaha",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, those people aren't gonna fight on behalf of the UK. They will, however, fight to take over the UK.",
                "author": "BeerPongAmerica"
            },
            {
                "raw_content": "Religion of dominance. Once the population reaches a tipping point all other religions will be outlawed under penalty of death. UK is so fucking stupid.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Your forefathers are rolling in the graves. You dumb fucks lost the crusades in the long run.",
                "author": "Addison2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not the Bee: Canadian Prime Minister Justin Trudeau will meet with King Charles III, the country’s head of state, on Monday where he will discuss U.S. President Donald Trump’s threats to make Canada the 51st state. The king has come under criticism in Canada for being silent,",
        "score": 907,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Daddy, make the orange man stop being mean to us!",
                "author": "OTher55"
            },
            {
                "raw_content": "Didn't this faggot resign or something? Feel free to leave. Douchedeau.",
                "author": "FRENS"
            },
            {
                "raw_content": "Threats? Trump made a joke and these retards took it as a declaration of war. Believe me, we don't want Canada as a state.",
                "author": "America1stAndOnly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MIKE MYERS ON SNL. WHAT A FAGGOT!",
        "score": 1356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Canada is a country that wouldn’t even exist without living in our protective shadow all this time. Perhaps we should let Russia run roughshod over the whole place? Fuck Canada. Not the trucker protestors and the decent folk but the country and the scum that run it.",
                "author": "Kektacular75"
            },
            {
                "raw_content": "Don't worry, we're not buying it, not when we can take it for free.",
                "author": "Godan"
            },
            {
                "raw_content": "Canada snot for sale",
                "author": "TinfoilHardhat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of Defense Pete Hegseth: The President’s desire to end the bloodshed in Ukraine will not be deterred. Norway says it will keep supplying fuel to US Navy after company calls for boycott.",
        "score": 1792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck Norway and fuck NATO. We should pull out of that useless organization. Put all of the money we spend on NATO into our own national defense. Secure this country.",
                "author": "forth2win"
            },
            {
                "raw_content": "The whole world is bonkers, it began with the Pooh-Flu, and now this Ukraine madness. The US president and the Ukrainian Penist have a quarrel on TV, and they boycott the Navy in Norway. Still not sure what is happening to the world.",
                "author": "Meister_Bockmist"
            },
            {
                "raw_content": "Punish them. They got their headlines and the liberals get to rub it in. Not fucking good enough, there needs to be retribution.",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MASSIVE STORY DEVELOPING: President Javier Milei has agreed to open Argentina's archives so the world can finally see how Swiss banks helped fund and coordinate Nazis escaping Europe after the war.",
        "score": 766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Operation Paperclip anyone ? The Nazis came here too",
                "author": "Snoman"
            },
            {
                "raw_content": "The Nazi's weren't guilty of \"the worst crimes in human history\". They were merely trying to protect their nation from similar forces that tear ours apart today.",
                "author": "business_narwhall"
            },
            {
                "raw_content": "Next do the Vatican.",
                "author": "papagiorgio-g"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UKRAINE'S ZELENSKIY: WE ARE READY TO SIGN THE MINERALS DEAL AND I BELIEVE THE U.S. WOULD BE READY AS WELL",
        "score": 1806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He said this three fucking times before and then basically tried to be an asshole on national TV in front of everybody. That's what people don't understand he was there to sign the deal they agreed upon the asshole backed out in real time. The fucker think he's Darth Vader and can alter a deal in real time but he's nothing more than that stupid fucking ewok.",
                "author": "TOPDAWG23"
            },
            {
                "raw_content": "AKA we saw what Europe was capable of and we're sorry America, please save us",
                "author": "Jghou"
            },
            {
                "raw_content": "66% now, MF.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One ICE Raid Leaker ID'd: Congressional Reporter for Vanity Fair - \"Pablo Manriquez, Congressional reporter for Vanity Fair, posted leaked information on ICE raids planned for the D.C. suburbs of Northern Virginia\"",
        "score": 1699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this pos getting advanced info?",
                "author": "Pederella"
            },
            {
                "raw_content": "Traitor. Speedy trial, death penalty.",
                "author": "Dashmoomoo"
            },
            {
                "raw_content": "who leaked it to him?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS IS HOW IT SHOULD BE DONE.. NO WHINING OR REEEEING.... EVER.",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone think of CC'ing this to Barbie??",
                "author": "StumpJumper52"
            },
            {
                "raw_content": "Blond Bondi doesn't have the chops for it. Great disappointment.",
                "author": "Donsabai"
            },
            {
                "raw_content": "Ughh, this is why they continue to do it. No consequences. Put a few ain handcuffs and perp walk them for obstruction.",
                "author": "Counterwhat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bishop Athanasius Schneider speaks very clearly: \"They are not refugees, they are invaders who want to Islamize Europe! They want to destroy historical culture in Europe!\"",
        "score": 2216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After they take over, you can expect the destruction of all medieval churches and holy sites. Eliminating the competition is the only method they have to ensure growth. [Bamiyan](https://en.wikipedia.org/wiki/Buddhas_of_Bamiyan)",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Make him Pope",
                "author": "Serp-Patriot"
            },
            {
                "raw_content": "Make Istanbul Constantinople Again",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "First $549 GeForce RTX 5070 confirmed for March 5 launch, Radeon RX 9070 arriving at the same price the next day",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The real question is if there will actually be any in stock. Doesn’t matter what the price is if you only release a few hundred world wide.",
                "author": "lonestar-rasbryjamco"
            },
            {
                "raw_content": "Nvidia's mission is to use the minimum amount of wafers to not lose market share. Datacenter pays an order of magnitude more.",
                "author": "crazy_goat"
            },
            {
                "raw_content": "will probably be missing ROPS like the rest and have 4060 performance levels, no thanks.",
                "author": "l1qq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why do graphics card manufacturers not list the maximum configurable power limit in the specifications?",
        "score": 33,
        "text_content": "Am I the only one frustrated by this? I think this figure tells a lot about the VRM quality and the card's overclocking potential, and I always need to search for reviews of each specific card to get it. The worst thing is that not even all reviews have it.",
        "comments": [
            {
                "raw_content": "just read techpowerup and youre good! then you can make your own chart",
                "author": "Psyclist80"
            },
            {
                "raw_content": "There are a lot of people in this thread who don't understand what power limit is. It's usually a percentage over base spec TDP that you can set your card to use up to with overclocking software. It's not voltage and is perfectly safe to increase so long as all your other stats are fine. It absolutely should be listed with the standard specs of the card, probably right next to TDP.",
                "author": "aimlessdrivel"
            },
            {
                "raw_content": "(Admittedly cynical) speculation on my part - they have little to gain by advertising it in the first place. \"A bajillion VRM phases\" or \"a fourth fan on the back for MORE COOLING\" sticks more in the average consumer's mind than \"can go to 450w vs competitor 400w\". The folks who are including maximum power limit in their purchasing decisions are likely to already do much more research than the people writing the GPU product pages would really like you to do, and will find this information anyway. (although that's more difficult this time around since many 50 series models have not even been delivered to reviewers in the first place - what a shitshow) And then you have situations like my own 3080, where TDP is up out of the box from 320w to 340w, but the card is limited to 350w tops. Including that information could only hurt sales, anybody who knows what that means knows that it's limited compared to quite a few other 3080s.",
                "author": "1-800-KETAMINE"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm VP on Snapdragon and Intel: 'We're going to lead much faster on the innovation front'",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they need to figure out a non-garbage GPU first",
                "author": "trololololo2137"
            },
            {
                "raw_content": "After the bullshit lawsuit from ARM they had to deal with, Qualcomm will not be sleeping on RISC-V.",
                "author": "3G6A5W338E"
            },
            {
                "raw_content": "Arm big cores aren't innovating that much - they're just throwing more resources at them and making them fatter. They will run into scaling issues sooner or later.",
                "author": "basil_elton"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Amazon Web Services announces a new quantum computing chip",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of Quantum chips seem to be coming in now",
                "author": "SmashStrider"
            },
            {
                "raw_content": "Hell ..made at $intc just because",
                "author": "martylardy"
            },
            {
                "raw_content": "All of them are what we call in the industry: F.A.K.E",
                "author": "hardBoiled_Weiners"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The switch 2 will have games",
        "score": 356,
        "text_content": "Game s 🧟‍♂️",
        "comments": [
            {
                "raw_content": "Lil bro thinks we belive him🥀🤣💔",
                "author": "Vivid-Dust2888"
            },
            {
                "raw_content": "Source?",
                "author": "saint_marat"
            },
            {
                "raw_content": "![gif](giphy|6JB4v4xPTAQFi|downsized)",
                "author": "Wavenstein1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 ui concept i made :3",
        "score": 153,
        "text_content": "Like it?",
        "comments": [
            {
                "raw_content": "Wow the absolute ROAST at the end",
                "author": "Chickenlord278"
            },
            {
                "raw_content": "I think this belongs over in r/baduibattles",
                "author": "Darth_Thor"
            },
            {
                "raw_content": "#LET'S GO GAMBLING‼️‼️‼️‼️ Aw, dang it Aw, dang it Aw, dang it Aw, dang it",
                "author": "MeMeWhenWhenTheWhen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As an act to bring back miiverse to the second switch , lets pretend the comment section is a miiverse board (you can all go wild)",
        "score": 250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice water",
                "author": "AzureBeornVT"
            },
            {
                "raw_content": "https://preview.redd.it/qvnx2a6a3cme1.jpeg?width=990&format=pjpg&auto=webp&s=73e2a8e8c51e4a2b94f33f84b863e8e62d9a72bd",
                "author": "JIMMYJAWN"
            },
            {
                "raw_content": "damn https://preview.redd.it/hlwu79ru6bme1.jpeg?width=736&format=pjpg&auto=webp&s=34fd2471ac585b2d199ff52c06c2e65a6cea03a6",
                "author": "MYSTERIOUSPEIS"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Which UI concept do you think is the best and why?",
        "score": 52,
        "text_content": "Credit to: Next handheld (leaker from Twitter) u/_Luner u/Triforce_Hunter_1 u/maricthehedgehog",
        "comments": [
            {
                "raw_content": "I like the first one.",
                "author": "Josephalopod"
            },
            {
                "raw_content": "Well, I’m obviously gonna be biased towards the [the one I made](https://www.reddit.com/r/NintendoSwitch2/comments/1ioymrh/my_switch_2_ui_concept_v3/) myself being my favorite, but I really like the first one in the list of images here, and I also like [this one by PalmTree\\_04](https://www.reddit.com/r/NintendoSwitch2/comments/1i036n2/since_the_ui_leaks_were_disappointing_heres_a/).",
                "author": "thisSubIsAtrocious"
            },
            {
                "raw_content": "The Mario Odyssey one hurt my eyes. The second one had the cleanest appearance.",
                "author": "vs-188"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Would look cool or?",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think this with colored grips would be cool.",
                "author": "SuperMarioOdyssey64"
            },
            {
                "raw_content": "You forgot the \"C\" button",
                "author": "Hornyles_j"
            },
            {
                "raw_content": "The rings around the sticks are giving me Stadia controller vibes. Not a bad look, but...",
                "author": "HowlingHipster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Any recommendations for more niche Nintendo Youtube channels to watch while we wait for switch 2?",
        "score": 9,
        "text_content": "I've just seen the same faces over and over again and I'm looking for some new content. You know which people I'm talking about. They're not bad, they just dominate the Nintendo discussion a bit too much imo (except Arlo. I love Arlo) Just curious if anyone can recommend some youtuber I've not seen yet cause the Switch 2 Youtube obsession is REALLLL",
        "comments": [
            {
                "raw_content": "MockRock, Nintendo Forecast, and (sometimes) The Geek Critique are all excellent less known channels",
                "author": "PikaPhantom_"
            },
            {
                "raw_content": "(just to clarify, they don't specifically have to be making content about switch 2, just generally Nintendo fond content)",
                "author": "Sirlink360"
            },
            {
                "raw_content": "I mean, Failboat has branched out to more general content, But he still plays a lot of Nintendo content along with having a large backlog of the Nintendo content he does (his animal crossing and miitopia content is wild) and does live stream reactions to almost every direct. And his friend Jaymoji is pretty awesome too",
                "author": "just_someone27000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Draw a Nintendo switch",
        "score": 20,
        "text_content": "Show yours in the comments!",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/vi7dgaw2ydme1.png?width=1215&format=png&auto=webp&s=58fa0f752803fb059894e74f5b7f04032d1bd9b8",
                "author": "JamiePz1101"
            },
            {
                "raw_content": "https://preview.redd.it/xkeneywjudme1.png?width=1067&format=png&auto=webp&s=f33cea635fd268a1eeecc33a3a3cb38b3ff32fd4",
                "author": "almacenedu"
            },
            {
                "raw_content": "https://preview.redd.it/1oq6b0ccpdme1.png?width=835&format=png&auto=webp&s=7fb34fcaccbbe9822e4acc203ea086ed6eada52e",
                "author": "p3apod1987"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A small hope for the switch 2.",
        "score": 6,
        "text_content": "I hope that unlike the switch 1, when you're playing with the Joy-Cons separately, you get to use the SL and SR buttons as extra buttons. They can only be used when you're using a single Joy-con, and I think it would be fun to have access to SL and SR with your fingers like those extra back buttons on those pro line controllers.",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bioware Austin appears to be closed, when checking Google maps",
        "score": 373,
        "text_content": "https://maps.app.goo.gl/U45sdA5XJzvr5pHy5",
        "comments": [
            {
                "raw_content": "Google maps leak was not on my bingo card",
                "author": "Legospacememe"
            },
            {
                "raw_content": "The public can suggest edits on Google Maps, so maybe a former member of staff marked it as closed but I wouldn't take this as confirmation or anything",
                "author": "m1n3c7afty"
            },
            {
                "raw_content": "A studio that big doesn’t vanish quietly, likely just some Google fuckery",
                "author": "AnotherScoutTrooper"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel Ultimate Alliance showing up on the Steam store",
        "score": 558,
        "text_content": "Was browsing Steam and, to my surprise, saw [Ultimate Alliance recommended to me](https://imgur.com/a/ahwIuOC). It still has the removed from Steam label when you click on it but this is the first time I've seen a delisted game actually recommended on the store. This also coincides with the games [randomly showing up on Amazon](https://xcancel.com/Wario64/status/1895528872852193786) a couple days ago.",
        "comments": [
            {
                "raw_content": "Recently a few delisted games have shown up on Amazon. They were selling copies of Dark Souls Prepare to Die Edition a few days ago for $20.",
                "author": "EmeraldJunkie"
            },
            {
                "raw_content": "I hope these games return and if they do, I hope the Deadpool game follows.",
                "author": "Anonymous-Internaut"
            },
            {
                "raw_content": "Removed games can be randomly recommended, this is neither new nor is it limited to Activision games. As for Activision/Microsoft, there were leaks a few months ago about Microsoft looking to renew license for past Activision games, like Transformers, Deadpool, etc, so hopefully they’ll all get sold once again in the near future.",
                "author": "DarthWeezy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "9070 XT cheat sheet",
        "score": 1332,
        "text_content": "I have created this Google Sheets document for 9070XT cards (minus white/limited editions) available at launch. You can group and sort by clicking views button (arrow). I will update it with more data as it becomes available. Will include benchmark scores, temps, real power usage, as the reviews come in. It’s going to be a specially useful comparison for those who want to get one on launch day at a store and will have limited options to choose from. Here is the link: https://docs.google.com/spreadsheets/d/18eQRucHX41A-O4OsoV96Qw2gFw1Qs2N7f6qQQs3kXx4/edit?usp=sharing",
        "comments": [
            {
                "raw_content": "3.6 slots? wtf, soon we'll be inserting the entire pc inside a gpu, not the other way around.",
                "author": "alexzhivil"
            },
            {
                "raw_content": "That PowerColor Reaper seems like the card for me. 2 slot, 2x8pin power connectors, clock speeds and MSRP.",
                "author": "jrutz"
            },
            {
                "raw_content": "I suggest adding which are confirmed to be using phase change TIM",
                "author": "averagegoat43"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "I know I'm 6 years late to the party.. but finally got my dream GPU Radeon VII!!",
        "score": 469,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really like the look of the Radeon VII. I wish recent cards looked like that.",
                "author": "RippiHunti"
            },
            {
                "raw_content": "I got the Radeon Vii 50th edition still and it runs like a champ to this day for my purposes",
                "author": "Z-God_13"
            },
            {
                "raw_content": "always wanted the frontier blue 16gb gpu they are so good looking",
                "author": "ryzenat0r"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Got a 7900XTX, joined AMD.",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|2kUEoTOLFfsoeQBDsQ|downsized)",
                "author": "DogeTiger2021"
            },
            {
                "raw_content": "I was like he got a job at AMD or something.",
                "author": "soru_baddogai"
            },
            {
                "raw_content": "Bought the same card myself this week. Def a monster in raw performance.",
                "author": "SplitBoots99"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "XFX launches first dual-fan Radeon RX 9070 XT graphics card",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">**Announced in China.** ![gif](giphy|FJG7MthoTMhoQ3WELH)",
                "author": "john_weiss"
            },
            {
                "raw_content": "2 fan but so thick... who is this for?",
                "author": "cp_carl"
            },
            {
                "raw_content": "I was looking at all the 9070XT and I need this one!",
                "author": "prototypenguin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First $549 GeForce RTX 5070 confirmed for March 5 launch, Radeon RX 9070 arriving at the same price the next day",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yes yes, the 550$ 5070! Just like the 1200€ 5080! People should really stop using the nvidia msrp for anything but unicorn stories.",
                "author": "TopdeckIsSkill"
            },
            {
                "raw_content": "So many people hating on the 9070 $550 price. As you should but AMD knows what they’re doing. People will go for the XTs, maybe inventory will last for a couple of hours or a few days if we’re lucky, then those sell out. Now what’re people going to do? They’ll spend $550 begrudgingly on the only card left around. In a few months AMD will slash pricing when supply outpaces demand.",
                "author": "BumHound"
            },
            {
                "raw_content": "The RX9070 is a product to sell slightly defective RX9070xt. Chips that have manufactering defects will have those cores disabled. There may be 1 9070 for every 5 9070XT available. Look at the 6800.",
                "author": "lordfappington69"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "YESTON unveils Radeon RX 9070 XT SAKURA & SAKURA Atlantis graphics cards",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once I upgrade its gonna be Yeston",
                "author": "Nerina23"
            },
            {
                "raw_content": "I'm buying one.",
                "author": "AtlasPrevail"
            },
            {
                "raw_content": "Waifus on my GPUs Feel like it's 2005 again. Next thing you know, crossfire will make a comeback!",
                "author": "FLMKane"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "All AMD budget build for my daughter",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i think this needs more RGB. joking aside, your daughter has a cool dad.",
                "author": "parental92"
            },
            {
                "raw_content": "Its running a used Ryzen 7 7700 with a 5500XT I had sitting in a closet collecting dust. Mostly made from spare parts, the motherboard, CPU cooler, and the case were the only things I spent money on putting this together.",
                "author": "Deadly_Fire_Trap"
            },
            {
                "raw_content": "Why so many fans in a budget build?",
                "author": "Awkward-Loquat2228"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New build with 7900XT",
        "score": 49,
        "text_content": "Went from 3080ti to 7900XT Ryzen 9 7900X XFX Quicksilver 7900XT G.Skill Ripjaws S5 DDR5 6000MHz (2 x 32GB) MSI B650 Gaming Plus WiFi Thermalright AIO",
        "comments": [
            {
                "raw_content": "Where'd you get the power connector? I dig the 90 degree connector!",
                "author": "No-Chain3835"
            },
            {
                "raw_content": "K11 enjoyer",
                "author": "EvilMilton"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "02 March 2025 - Daily /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "So seems like he’s going to take crypto up ~1000%. If every teenager-to-80-year-old becomes a multi-millionaire off crypto and stocks, should I expect house prices to double during this administration? I personally know of three 20 something year olds that are buying ~$800k houses on cash from their gains off tsla and scamcoins.",
                "author": "Lojic_team"
            },
            {
                "raw_content": "What happens to the buying power of a dollar if the U.S. goes all in on crypto reserves? 🤔",
                "author": "rentvent"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Housing Market Is a Bubble Full of Fraud, and It’s Going To Pop",
        "score": 450,
        "text_content": "[https://www.strongtowns.org/journal/2024/8/19/the-housing-market-is-a-bubble-full-of-fraud-and-its-going-to-pop](https://www.strongtowns.org/journal/2024/8/19/the-housing-market-is-a-bubble-full-of-fraud-and-its-going-to-pop) Curious what people think of this article and the Strong Towns approach to the housing crisis more broadly- I don't see it mentioned much (if at all?) in this sub. TLDR: Financialization of the housing market is propping up home values, and the federal government is very unlikely to take concrete steps to reform it if it will result in price decreases (more affordability). Strong Towns advocates very strongly for the easing of local land use regulations that have stymied new home builds, especially the \"starter home\" variety",
        "comments": [
            {
                "raw_content": "That’s interesting because I just had somebody reach out to me about refinancing and I explained to them that I just had a child and started my own business so I could stay home with him and I’m not making a ton of money yet. They told me I could do a non-income stated loan for a refinance and I was like what 😱 that just reminds me of 2008.",
                "author": "jules13131382"
            },
            {
                "raw_content": "The main issue is that there is no descentivization to own all the single family homes as a for-profit company or an LLC. There needs to be stricter regulation and it escalating cost of owning multiple single-family home or apartment complexes.",
                "author": "TheAarj"
            },
            {
                "raw_content": "I was told by billionaires only poor people commit fraud so I don't believe it.",
                "author": "czarofangola"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pair of Manhattan Offices to Sell for 68% Discount to 2017 Price",
        "score": 46,
        "text_content": "https://www.bloomberg.com/news/articles/2025-02-28/pair-of-manhattan-offices-to-sell-for-68-discount-to-2017-price Two Manhattan office buildings are trading hands at a steep discount as lenders look to cut their losses. Empire Capital Holdings agreed to buy the properties — at 229 W. 36th St. and 256 W. 38th St. — for less than $50 million, according to people familiar with the matter. That price would be at least 68% below the roughly $157 million the buildings last sold for, in 2017. The deal was a short sale, meaning owner Investcorp and lenders agreed to sell the properties for less than the outstanding amount on the mortgage, the people said, asking not to be named citing private details. Doug Middleton and Jack Stillwagon of CBRE Group Inc. are handling the sale. A representative for the company didn’t immediately respond to a request for comment. Spokespeople for Empire Capital and Investcorp declined to comment. Short sales have become more common as office values have plummeted, often below loan amounts. Last year, Empire Capital and a partner purchased a West 44th Street office building in a short sale. While demand for high-quality, newly built or renovated offices near transit hubs has been high in Manhattan, older properties are struggling. Owners have had to keep up with mounting costs and higher interest rates, while dealing with rising vacancies. The 151,204-square-foot (14,050-square-meter) building at 229 W. 36th St. was constructed in 1921. The second property, on West 38th Street, was completed in 1924. The buyer is considering either keeping the sites as offices or turning them into storage properties for now, according to one of the people. The buildings are located within a rezoning district, which may allow for a potential residential conversion down the line, the person said.",
        "comments": [
            {
                "raw_content": "Now this is some trickle down I can get excited for. When's this get to a Florida near me?",
                "author": "jahoosawa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans delay home improvements in latest blow to US housing market",
        "score": 355,
        "text_content": "https://www.ft.com/content/24959793-7828-4ddc-9379-376d3590c718 Comprising about 4 per cent of US GDP, residential remodelling and home construction have been hit hard by the Federal Reserve’s decision to keep interest rates higher for longer.",
        "comments": [
            {
                "raw_content": "I'm looking to replace my tankless water heater. Four different quotes all $4,000. The tank itself is $1300, so that means contractors are charging $2500+ for a 3-5 hour job. Can't even imagine what remodeling costs are.",
                "author": "Brs76"
            },
            {
                "raw_content": "I mean… so many people remodeled during the pandemic years. I believe 2020 and 2021 were the best 2 years for the industry. Home Depot made record profits those 2 years. Everyone jacked up prices including suppliers and contractors to take advantage of the homeowners. There are only so many kitchens, showers, driveways, decks, or floorings to replace. People will be holding onto their newly remodeled low interest homes for a while.",
                "author": "moonsion"
            },
            {
                "raw_content": "Every time I contact someone to do work I look at the price quote and then pick up my tools bag and do it myself. It feels like everything is 10K plus. For 10k I can watch a few YouTube videos and do it myself.",
                "author": "Kingkongcrapper"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "If you see houses being painted this color in your area, it means prices are about to skyrocket",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The gray trend peaked years ago and has been in decline. Whites and beiges with a bit of color for accent are more on trend currently",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "yeah crazy.. if large swaths of people in your area are investing in improving real estate the value of local real estate goes up.",
                "author": "None"
            },
            {
                "raw_content": "Is this article really acting like gray is still the big thing ? Cool neighborhoods have moved past this.",
                "author": "trailtwist"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How Much is the U.S. Housing Market Worth?",
        "score": 30,
        "text_content": "https://awealthofcommonsense.com/2025/02/how-much-is-the-u-s-housing-market-worth/ According to Redfin, the U.S. housing market is now worth a stone’s throw from $50 trillion Depending on the day, that puts the housing market roughly on par with the total value of the U.S. stock market. In the past decade alone the total value of the housing market has more than doubled (from $23 trillion in 2014). Considering mortgage rates averaged nearly 7% in 2024, it’s hard to believe housing prices were up another 5% in 2024. That gain follows annual housing returns of +19%, +6%, +6% and +4% from 2021-2024. When you throw in the fact that 70% of that $50 trillion is equity, Americans are sitting on some healthy housing gains.",
        "comments": [
            {
                "raw_content": "Less than it's currently listed for, that's for sure.",
                "author": "LadPro"
            },
            {
                "raw_content": "According to their data the collective worth of US housing in 2000 was about $11 trillion. As of their most recent data, it is currently worth about $49.7 trillion. This represents an annualized growth rate of approximately 7.12% per year. Traditionally U.S. housing has returned between 3% and 4% per year. This is a bubble.",
                "author": "ColorMonochrome"
            },
            {
                "raw_content": "It’s worth that much on paper, but only translates to a dollar figure when it’s sold. The question is, will that value continue to be sustainable into the future? We haven’t experienced a recession yet, immigration has been slowing down, Americans having less kids, and older boomers reaching their golden years. Will that market value still be the same 10-15 years from now? We shall see.",
                "author": "alienofwar"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Geoffrey Hinton, \"Godfather of AI\", calls for Elon Musk to be expelled from the British Royal Society",
        "score": 2969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How did he get into the Royal Society in the first place?",
                "author": "OttoKretschmer"
            },
            {
                "raw_content": "I bet Musk is pushing for the title of co-godfather of AI.",
                "author": "iamamemeama"
            },
            {
                "raw_content": "Why the hell was even a member in the first place? The guy is a bullshit artist and a marketing guy. Not an actual scientist.",
                "author": "JackFisherBooks"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists discover a protein that reverses cellular aging. \"The results were very intriguing,\" said Shinji Deguchi, senior author of the study. \"Suppressing AP2A1 in older cells reversed senescence and promoted cellular rejuvenation, while ΑΡ2Α1 oνerexpression in young cells advanced senescence.",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> in Japan Of course that's where it was discovered",
                "author": "coolredditor3"
            },
            {
                "raw_content": "ACCELERAAAAAAATE PLEAAAASE",
                "author": "After_Sweet4068"
            },
            {
                "raw_content": "Just because headlines like this usually never amount to anything, let's see where progress for this is in 2 years. !remindme 2 years",
                "author": "MasterYI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"AI won't replace accountants\"",
        "score": 271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s one of the first jobs I see being taken over by AI…",
                "author": "RationalOpinions"
            },
            {
                "raw_content": "There may come a certain point where reliability ceases to be a concern. Like if you pass it through three different LLMs, and they get the same answer, you may not need a human evaluator. All you need is either A) the individual costs of running LLMs to go down massively so you can check it thousands of times at say a 70% reliability, or large improvements in capabilities for a few times at a 99% reliability.",
                "author": "Valuable-Village1669"
            },
            {
                "raw_content": "I don't think these people realize AI technology is doubling in intelligence and capacity yearly. It will inevitably take over everything.",
                "author": "cpt_ugh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Roleplay with Sesame's new Voice AI feels like the future of everything",
        "score": 593,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shiiit you are so fast on your thinking that is hard to tell who is the AI, I can see that becoming a competitive game",
                "author": "loiolaa"
            },
            {
                "raw_content": "18 year old reddit account? I feel like I’m among royalty.",
                "author": "Ronster619"
            },
            {
                "raw_content": "Just a couple quick things on this: 1) I did cut out the very top of our convo where I told it to act like an angry boss who I was going to confront with a secret. I also told it to get more confrontational a couple of times. 2) I added the waveforms and subtitles myself (and trimmed a few of my stumbles) 3) It's Sunday morning here so pls forgive my relatively terrible improv skills -- I def misspoke a few times but figured leaving those in could be fun. Demo is available here to try if you haven't yet: [https://www.sesame.com/research/crossing\\_the\\_uncanny\\_valley\\_of\\_voice#demo](https://www.sesame.com/research/crossing_the_uncanny_valley_of_voice#demo) PS, I'm one-half of a weekly podcast called AI For Humans where we try to do stuff like this with AI and explain the AI news of the week. If that sounds interesting to you at all pls check out out here on YT of wherever you get your podcasts: [https://www.youtube.com/@AIForHumansShow](https://www.youtube.com/@AIForHumansShow)",
                "author": "gavinpurcell"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-4.5 Preview takes first place in the Elimination Game Benchmark, which tests social reasoning (forming alliances, deception, appearing non-threatening, and persuading the jury).",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm starting to think people underestimated this model a lot just because it's not a reasoning model",
                "author": "adarkuccio"
            },
            {
                "raw_content": "More information: [https://github.com/lechmazur/elimination\\_game/](https://github.com/lechmazur/elimination_game/) Video of a few games: [https://www.youtube.com/watch?v=SzmeHecHYzM](https://www.youtube.com/watch?v=SzmeHecHYzM) It is rarely voted out during the first or second round. It performs well when presenting its case to the jury of six eliminated LLMs, although o3-mini does slightly better. It is not often betrayed. Similar to o1 and o3-mini, it rarely betrays its private chat partner. https://preview.redd.it/hkmhkp9nsdme1.png?width=1200&format=png&auto=webp&s=4fb9fc43e735ecf7ffc832d84e995b9de22b2b94 However, GPT-4.5 Preview does not perform well on the reasoning-oriented Step Game benchmark, where reasoning models hold all top six spots: [https://github.com/lechmazur/step\\_game](https://github.com/lechmazur/step_game)",
                "author": "zero0_one1"
            },
            {
                "raw_content": "lol what is this game and how does it work? They literally made a survivor like benchmark ?",
                "author": "Grond26"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The past 18 months have seen the most rapid change in human written communication ever",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't worry, I read the paper in full. Here is the section you are all looking for: \"Perhaps the biggest limitation in our study is that we cannot reliably detect language that was generated by LLMs, but was either heavily edited by humans or was generated by models that imitate very well human writing\" And yes, I get how hilarious it is that the last sentence reads so awkwardly.",
                "author": "Rychek_Four"
            },
            {
                "raw_content": "How did they determine if it was LLM writing? Even the bible gets detected as machine generated lol",
                "author": "Aegontheholy"
            },
            {
                "raw_content": "I've found that if you use correct grammar, your work will get flagged. Also, inclusion of facts, with correct sourcing or otherwise, will also result in a flag. Is there anything else you would like help with today?",
                "author": "Bombauer-"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LMArena's mysterious \"experimental-router\" has been released. LMArena researchers developed a model that dynamically determines the best model for each prompt.",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Automatic model selection from prompt keywords will be a great way to improve efficiency and latency speed.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Github: [https://github.com/lmarena/p2l](https://github.com/lmarena/p2l) Research paper: [https://arxiv.org/abs/2502.14855](https://arxiv.org/abs/2502.14855) Model weights: [https://huggingface.co/collections/lmarena-ai/prompt-to-leaderboard-67bcf7ddf6022ef3cfd260cc](https://huggingface.co/collections/lmarena-ai/prompt-to-leaderboard-67bcf7ddf6022ef3cfd260cc) Chatbot Arena demo: [https://lmarena.ai/?p2l](https://lmarena.ai/?p2l)",
                "author": "RenoHadreas"
            },
            {
                "raw_content": "Neat, but this is the wrong line of development. As anyone who has submitted helpdesk tickets routed by people who don't understand the content knows. And if they do understand the content you don't need routing.",
                "author": "sdmat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I averaged the performance of Claude 3.7 and GPT-4.5 across 11 different benchmarks and here are the results",
        "score": 48,
        "text_content": "*1st.* Claude-3.7-Sonnet-Thinking | (76.10+77.2+46.4+50.19+98.27+95.5+33.5+64+86.1+75.0+61.3)/11 = **69.4145** *2nd.* GPT-4.5-Preview | (68.95+71.4+34.5+59.29+98.07+98.8+33.7+68+85.1+74.4+36.7)/11 = **66.2645** *3rd.* Claude-3.7-Sonnet | (65.56+65.6+44.9+51.99+98.12+95.6+18.9+59+83.2+71.8+23.3)/11 = **61.6336** I averaged their scores across these 11 Benchmarks and will link each one below: [https://livebench.ai/#/](https://livebench.ai/#/) \\- tests math, reasoning, coding, language, etc., best leaderboard [https://simple-bench.com/](https://simple-bench.com/) \\- tests common sense and trick questions [https://huggingface.co/spaces/DontPlanToEnd/UGI-Leaderboard](https://huggingface.co/spaces/DontPlanToEnd/UGI-Leaderboard) \\- tests censorship [https://huggingface.co/spaces/vectara/leaderboard](https://huggingface.co/spaces/vectara/leaderboard) \\- tests hallucination rates when summarizing [https://github.com/lechmazur/generalization](https://github.com/lechmazur/generalization) \\- tests generalization abilities [https://github.com/lechmazur/nyt-connections/](https://github.com/lechmazur/nyt-connections/) \\- tests NYT connection puzzles [https://github.com/lechmazur/elimination\\_game](https://github.com/lechmazur/elimination_game) \\- tests manipulation, social intelligence, and persuasion GPQA (doesn't have a website) - tests science such as physics, biology, chemistry MMMLU (doesn't have a website) - tests multilingual MMMU (doesn't have a website) - tests multimodal visual reasoning AIME'24 (doesn't have a website) - tests competition math the above 4 don't have websites, but I pulled their scores from their model announcement pages: [https://openai.com/index/introducing-gpt-4-5/](https://openai.com/index/introducing-gpt-4-5/) [https://www.anthropic.com/news/claude-3-7-sonnet](https://www.anthropic.com/news/claude-3-7-sonnet)",
        "comments": [
            {
                "raw_content": "Now it's important to note that Claude 3.7 nonthinking is still like 10x cheaper than GPT-4.5, and you obviously don't get 10x improvement in benchmarks. Hey though, at least it's better, some people have been saying its worse than GPT-4.5 while also being more expensive. Would be kinda crazy if it was so much more expensive and still dumber. This price will come done very rapidly very soon too, after all GPT-4.5 is still in its early experimental research preview stage, so I guess we'll just have to wait and see.",
                "author": "pigeon57434"
            },
            {
                "raw_content": "Would like to see this for o3-mini-high",
                "author": "Overflame"
            },
            {
                "raw_content": "Thanks for this. It shows that even if it is an expansive model, it's the best non thinking model out there. And compared to the leap of 3.5 to 4 I don't even think there's diminishing returns",
                "author": "IslSinGuy974"
            }
        ],
        "subreddit": "singularity"
    }
]