[
    {
        "post_name": "President Trump PARDONS Rudy Giuliani",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They deserve not only the pardon, but the full restitution of the legal expenses they have incurred.",
                "author": "eclectic22"
            },
            {
                "raw_content": "Deport the Kebab Mayor and Reinstall Rudy Giuliani as the mayor of NYC.",
                "author": "DT170x"
            },
            {
                "raw_content": "will he be dis-disbarred?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AHAHAHAHAHAHAHAHA",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is something I will require a source for, as a quick propaganda (Google) search did not yield any results and I do not recognize this account.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "Guys a fag. Roof drop",
                "author": "LookFatty"
            },
            {
                "raw_content": "No sauce =you are a dumb faggot.",
                "author": "General_Specific"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's midnight degenerates. Happy birthday. Blast the hymn as loud as you can.",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1 2 3 4 God Bless The Marine Corp !!!!! 💕 😘 ❤️",
                "author": "LookFatty"
            },
            {
                "raw_content": "Happy birthday!! Semper Fi!!",
                "author": "EdBuck"
            },
            {
                "raw_content": "I enjoyed my time as a Marine. Kicked off my adulthood with a bang. Happy Birthday fellow Marines!",
                "author": "GenWashington"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GN",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hanged. Fixed it for you 🙂",
                "author": "LookFatty"
            },
            {
                "raw_content": "Isn’t his party directly responsible for people not affording healthcare?",
                "author": "Deltamyass"
            },
            {
                "raw_content": "Rope party for this dildo",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NewsMax host goes Nuclear: \"This is why I hate liberal women...\"",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "based",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Feminism is cancer.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Lookin at you, 19th amendment ...",
                "author": "iirc_life"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DEAL REACHED to REOPEN the U.S. government...",
        "score": 1341,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shame, I wanted the shutdown to continue.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Which way from Sunday are we getting screwed?",
                "author": "MickHigan2"
            },
            {
                "raw_content": "My initial read here, and I do hope that I am right is this: the Democrats lost this one, and they needed an \"out\" that made it look like they got something. Like Iran being able to \"punch back\" and hit a few patches of dirt. I'm aware of rose-colored glasses, and the GOP has stabbed us in the back too many times to trust, but this looks like a pretty big win.",
                "author": "lemonparty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lawmakers in Congress are increasingly worried and planning for the possibility that Senator Adam Schiff will be indicted for mortgage fraud, Politico reports",
        "score": 1382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prosecutors should take a look at his hard drive while they're at it.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Needs to be indicted, tried, and imprisoned for a hell of a lot more than mortgage fraud.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "I don't give a flying fuck about mortgage fraud - he needs to be tried as a traitor. Where are the Trump admin's balls in going after these criminal fucks for the crimes they actually committed instead of some bullshit mortgage fraud claim? I don't fucking care. Pencil neck should be fitted for a fucking rope.",
                "author": "KEK_1776_KEK"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GN, Frens...",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good Night 🐸",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "But thay wasnt real communism",
                "author": "FlushFive"
            },
            {
                "raw_content": "\"Oooops, burnt the souffle again!\"",
                "author": "Lol_Garrus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It wasn't SNAP it wasn't ACA it was this",
        "score": 616,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was all for the phony SHAM elections we just had in New Jersey and New York.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I can't wait for that schmuck to be gone",
                "author": "WarCry"
            },
            {
                "raw_content": "Still we need to do something about the snap fraud",
                "author": "KnobGoblin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals boo as Trump swears in U.S. Military members at the Commanders game. Absolutely disgusting. Democrats have no respect for our brave troops who put their lives on the line to protect our country. Democrats hate America.",
        "score": 1260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Greater DC metro",
                "author": "perma-maga"
            },
            {
                "raw_content": "Who cares. Leftists hate us and Trump, big surprise. I'd boo a leftist given the chance.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Liberals should all be catapulted into an active volcano.",
                "author": "PyroSphere"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Muslims furiously yelling ‘looking for White people’ Yelling where’s the rest of you “white fuckers at, huh? Where the rest of you white pieces of shit at” He then says “I’ve been waiting for this”",
        "score": 569,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Carry always and always carry...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "What is he even talking about? Low IQ stuff.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Where?",
                "author": "CounterStrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC gentlemen’s clubs are about to get wild 🪩𓃚",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ooh, if this was my forum, I'd sticky the living hell out of this clip! LOL!!",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Yalllah Ha-Bee-Bee!",
                "author": "TooBright"
            },
            {
                "raw_content": "Wtf I love AI now",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why have men lost interest in dating? It's a total mystery.",
        "score": 941,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now she's a meme for the ages.",
                "author": "harryparatestes"
            },
            {
                "raw_content": "It’s hoeflation. Gotta work 5x as hard to get a woman 1/10th as good as your grandad had it..",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "\"Dating\" has been feminist code for casual sex the whole time. It's just a neologism women use to delude themselves and avoid truth. Men are interested in courtship and marriage. Weak beta males are interested in \"dating\" some slut.",
                "author": "Ch3f4554551n"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 HOLY CRAP! ICE is now conducting raids on the Hawaiian island of Kauai",
        "score": 1379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This will be a nice test, if there is any democratic state that locals hate outsiders, it is Hawaii",
                "author": "Sp3nce321"
            },
            {
                "raw_content": "HOLY CRAP! I didn't know the US Government had the ability to travel to each state to enforce the law!",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Jesus, even Kauai is infested with these vermin?",
                "author": "victory2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dems just can't stop losing",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is just the cloture vote \"end debate\", not the vote on the actual law. However, that vote is a formality at this point. There are some rules that let Senators stall a little (fucking Rand Paul). Then it goes back to the House where they have to pass it. That only requires a simple majority, but Republicans might find a way to mess that up.",
                "author": "fskfsk"
            },
            {
                "raw_content": "Imagine shutting down the government for over a month only to cave on literally everything you shut it down over. Even coming off winning elections less than a week ago, Dems are fucking pathetic.",
                "author": "DatTrumpDoh"
            },
            {
                "raw_content": "Wanted the shutdown to continue. It was proof of we don't need most of the fed gov.",
                "author": "armyofpedes4usa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Outgoing NYC Mayor Eric Adams to allow fired COVID workers to get jobs back",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We sure do have a lot of government employees",
                "author": "MeMargie"
            },
            {
                "raw_content": "Trying save face.",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "recent eric adams searches reveal resumè padding how to blend into muslim society dress suggestions for met gala burqa?",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bernie",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also Bernie - Please buy me another house.",
                "author": "Ryunnsun"
            },
            {
                "raw_content": "\"Let's be clear!\". -Any politician [Warning Alarm INTENSIFIES]",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "I'll give him this, his grift has always been consistent, I mean total commiefag, but consistent nonetheless.",
                "author": "WarCry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Before she became CIA Director, Gina Haspel used to be the Head of CIA's London Station. So she is the most likely candidate to give orders to British intelligence who used the BBC to dirty up President Trump.",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to news of 4 years ago",
                "author": "Monsieur_Novembre"
            },
            {
                "raw_content": "Scarf lady like that scamdemic bitch Birx.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Remember when retards claimed she died in a shootout in a data center in Italy?",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: They ripped the hell out of the Rainforest of Brazil to build a four lane highway for Environmentalists to travel. It’s become a big scandal! 100,000 Amazon trees cut for highway leading to U.N. climate summit.",
        "score": 1402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Climate summits are just another way for the ultra rich to feel good about themselves. They’re basically jacking themselves off.",
                "author": "Exsultate"
            },
            {
                "raw_content": "Environmentalists don't give a shit about the environment, just like PETA doesn't give a shit about animals. More at 11.",
                "author": "MakingArrowsOrange"
            },
            {
                "raw_content": "I love posts like this from Trump. What does he mean? Is he pro or anti-environment here?",
                "author": "Executarian2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Crooked Media",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She is so hot. I wonder if she is single. Anyone?",
                "author": "BeauHD"
            },
            {
                "raw_content": "Christmas genes are the best genes.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "the women of the right: unapologetically hot women of the left: undefinably not",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SanDisk reportedly jacks up flash prices by 50% as memory makers cash in on AI-fueled demand",
        "score": 526,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So fucking sick of this shit",
                "author": "PXLShoot3r"
            },
            {
                "raw_content": "Looking at my paycheck, and my current PC, how many years are we looking at without upgrades? Any bets?",
                "author": "capybooya"
            },
            {
                "raw_content": ">The report cites market sources who say SanDisk's pricing update sent a shockwave through the storage supply chain, prompting module makers such as Transcend, Innodisk, and Apacer Technology to pause shipments and re-evaluate quotes. Transcend, in particular, suspended quoting and deliveries starting November 7, anticipating \"continued favorable market conditions.\" Translation: \"prices are likely going higher before they settle down.\"",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung teases radical new modular SSD design with swappable NAND and SSD controller that can be detached independently",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But why? SSD's are already a module that can be swapped out. I can't think of any use case for this.",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "Is it the memory controller or the flash storage that's the limit these days? I know heat is an issue for the controllers but if those use a newer node is the controller still an issue?",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "I'd be more excited about this if the price of SSDs hadn't suddenly shot up so much.",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Budget-Builds Official] I Bought the PS5s Graphics Card!",
        "score": 35,
        "text_content": "Interesting to see gfx1013 (PS5's Oberon SoC) binned down for mining use that they've called 'AMD-BC250.'",
        "comments": [
            {
                "raw_content": "Mind you testing down wasn't perfect. These were made for a rack and taping a fan against the block obviously isn't the way to do it lol. There is also quirks which isn't surprising but regardless performance isn't quite as bad and I'd be very interested to see FSR4 tested",
                "author": "Noble00_"
            },
            {
                "raw_content": "Good to see these getting more and more love and attention which means better support. I bought a 4U rack with 12 of them + PSUs + fans for $324 shipped to door when they were considered 'ewaste'. Figured even without GPU support, it's more powerful than a raspberry pi for budget hosting/etc. Even after they're no longer viable for gaming, still will be good for VM, app hosting, etc.",
                "author": "PVPicker"
            },
            {
                "raw_content": "It's amazing Linux hasn't figured out how to boot without looking like you're hacking into the mainframe yet. That installer is ugly too.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Everyone giving up on Kirby Air Riders after playing the Test Ride be like:",
        "score": 1003,
        "text_content": "",
        "comments": [
            {
                "raw_content": "people just got disappointed because they thought it was a Mario Kart with a Kirby skin, when it’s actually a Smash with a Mario Kart skin.",
                "author": "TelephoneDense4447"
            },
            {
                "raw_content": "It seems that all the hate is being placed on the Rowdy Charge Tank item. The way that it functions is NOT a glitch, as it's supposed to make your Air Ride machine \"run amok\", just like in the original game.",
                "author": "MnSG"
            },
            {
                "raw_content": "At first i was like wtf, then i was like mhmmm, then i soared like an eagle as starGOAT, then i preordered",
                "author": "g_u_m_i_b_e_a_r"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo has released a new website to check Nintendo Switch 2 Compatibility Information",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "need another category for describing games that are patched for nintendo switch 2 like the galaxy games,ark,splatoon etc, as opposed to those that have switch 2 edition",
                "author": "No-Operation-6554"
            },
            {
                "raw_content": "Nier Automata needs to be fixed soon, it's wild it isn't yet. Either squeenix or nintendo should do something, it's a very high profile title",
                "author": "superamigo987"
            },
            {
                "raw_content": "It's not even accurate. I looked up Super Mario Galaxy 2 and it says it's \"consistent with Nintendo Switch\" when it's actually enhanced on Switch 2.",
                "author": "GarionOrb"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dragon Ball Sparking Zero will be releasing in 3 more days.",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was probably the biggest waste of 150 dollars I’ve ever made in my life. Was so excited for it even got my friend on board and then I put in 17 hours and he 21. And I say this as the biggest DB fan",
                "author": "SuperSaiyanIR"
            },
            {
                "raw_content": "Anybody speaking about this game objectively knows it didn’t live up to its hype and is not worth full price , let alone at 30 fps on the switch 2 .. 99% of people interested in this game should wait for a sale IMO",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "The game is not great",
                "author": "Bredtaking"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders Global Test Ride Weekend #1 has come to an end",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Definitely playing again next weekend! The chaotic shenanigans are so insane I can feel every single one of my neurons firing simultaneously. It's everything I wanted out of an Air Ride 2.",
                "author": "ValorStrikesBack"
            },
            {
                "raw_content": "Had a wedding to attend yesterday so bummed I didn't play more. I wish the times weren't so sporadic!",
                "author": "hop3less"
            },
            {
                "raw_content": "Had fun with it but also got the feeling I could get my fill over the course of the Test Ride's. Might check FB Marketplace and such to scoop up a used buyers-remorse copy once it launches but I can't justify full price.",
                "author": "MXC_Vic_Romano"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me waiting for the global test of Kirby Air Ride to open again.",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m waiting for the game to release",
                "author": "BlueDergOrd"
            },
            {
                "raw_content": "Soon you won't have to wait for tests to open anymore.",
                "author": "Williekins"
            },
            {
                "raw_content": "Can anyone tell me who is in this meme?",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wait this game actually is feeling veey good",
        "score": 530,
        "text_content": "",
        "comments": [
            {
                "raw_content": "only control i didnt really like was the wiggling the control stick to spin. I want to see if they have an alternate control for that, it would be very helpful. i just had a hard time moving the control stick like that at the right time. But, the game overall seems like its going to be a ton of fun. Looking forward to getting all the collectables and that kind of stuff. Pretty sure theres a whole lotta stuff to collect.",
                "author": "KorokSeedJr"
            },
            {
                "raw_content": "I don’t have ADHD but this game makes me feel like I have it lol",
                "author": "idontplaypolo"
            },
            {
                "raw_content": "Am I just old now. I feel like it’s too overstimulating now",
                "author": "stickypooboi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "this game is great!!",
        "score": 128,
        "text_content": "was a bit worried after seeing the directs, especially after Mario Kart World just came out. but oh wow this rocks. completely different gameplay, looks incredible, and never drops a frame even in the most chaotic moments. also THE MUSIC!! please try it out, i'm sold!",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hkgb26bvp90g1.png?width=720&format=png&auto=webp&s=ca7ccfb93083204c416557436c8a7e79adebedb6",
                "author": "Vargstein"
            },
            {
                "raw_content": "I played the original back then and it honestly felt like i never left. The controls are so familiar to me and i love the fact that the game is so fast and snappy Love the chaos in city trial ! So addicting to me",
                "author": "Funnycom"
            },
            {
                "raw_content": "Yeah there’s nothing else like this. It’s wild. Once you learn a little more how to play there’s really a hidden depth to it amongst the chaos. Can’t wait for the full game to come out now.",
                "author": "peter-man-hello"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SadlyItsBradley: The new Steam Controller will look like this when it launches",
        "score": 545,
        "text_content": "https://xcancel.com/SadlyItsBradley/status/1987644108765380813 > The new Steam Controller will look like this when it launches > Im told that it can also detect how far your hands are from the handles using a simple capsense feature > Similar to the index controllers, but not full finger tracking in the grips [Photo](https://pbs.twimg.com/media/G5WHxj7acAA112U.jpg?name=orig) Why does the photo look like that? https://xcancel.com/SadlyItsBradley/status/1987653596025176550 >Yes. It’s an AI slop photo. Trained on a real image of the new controller > It was just a fast and easy to do it this way > I was not going to post the original one just in case it reveals any sensitive info from the source",
        "comments": [
            {
                "raw_content": "Close enough, welcome back The Duke",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "\"It looks ergonomically terrible\" - me, looking at the steam deck, a device I later bought and found just fine ergonomically and quite comfortable. I'm done with vibechecking ergonomics from pictures alone.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "Yep, looks like a controller",
                "author": "beti88"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SadlyItsBradley: Steam Frame information likely this wednesday",
        "score": 191,
        "text_content": "\\*\\*Reposting With Imgur link Per Mod Guidance\\*\\* [https://imgur.com/a/t9L4Byg](https://imgur.com/a/t9L4Byg) This comes from comments in Brad Lynch's Discord (which obviously I can't link). I'd share a screenshot but no images in this sub. So here's the quote: \"I'm just going to flat out say it. I was told by a few sources, across a few weeks, to keep an eye out for this week. More specifically on Wednesday. And it doesn't seem to be out of the question for valve to choose that day to just \\*\\*announce\\*\\* it I have no idea but i get the impression they will need a week or two to explain the device to people before opening orders anyway\" This lines up with his earlier comments about something happening on the 12th last week.",
        "comments": [
            {
                "raw_content": "\\>\"I have no idea but i get the impression they will need a week or two to explain the device to people before opening orders anyway\" And gee, wouldn't that land us around November 18th, which would line up perfectly with that other post about the mysterious gap in scheduled Steam banners?",
                "author": "Small_Bipedal_Cat"
            },
            {
                "raw_content": "Do we know what this is supposed to be exactly?",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "And Half Life X as a launch title right 🔥🔥",
                "author": "Jedi_Pacman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Mario Galaxy Movie renders and elements leaked from Pillsbury cookies",
        "score": 515,
        "text_content": "https://shop.topsmarkets.com/store/tops-markets/products/83425108-pillsbury-ready-to-bake-yoshi-egg-sugar-cookie-dough-9-1-oz Mainly the SMG2 one on the back, plus it likely confirms Bowser Jr. and Rosalina’s inclusions in the film Also further proves the Old Spice ones are legit from this previous leak: https://www.reddit.com/r/GamingLeaksAndRumours/s/eeou8yQufY",
        "comments": [
            {
                "raw_content": "Pillsbury Tier 1 leaker",
                "author": "Toricitycondor"
            },
            {
                "raw_content": "Cookie Dough leak? That’s new",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "So Pillsbury is selling Yoshi's cookies?",
                "author": "SteveMightSay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The trophies for the Valley of Memory DLC of AC Mirage have already appeared online (via TrueAchievements)",
        "score": 96,
        "text_content": "With a release date set for the 18th, the expansion has already appeared in the Xbox achievements database (for a change). Beware of **SPOILERS**: Screenshots: https://xcancel.com/AccessTheAnimus/status/1987606013479198936#m Source: https://www.trueachievements.com/game/Assassins-Creed-Mirage/achievements",
        "comments": [
            {
                "raw_content": "this game is getting an expansion after shadows already came out? interesting",
                "author": "Loxnaka"
            },
            {
                "raw_content": "Cant wait",
                "author": "a34fsdb"
            },
            {
                "raw_content": "Official. Normal.",
                "author": "Ok-Potato1693"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Laid-off Intel employee allegedly steals 'Top Secret' files, then disappears",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would love to know why he is able to connect an external storage drive to his company PC?",
                "author": "MahaloMerky"
            },
            {
                "raw_content": "Let me guess, this person flew to a country whose name starts with C.",
                "author": "voiceipR"
            },
            {
                "raw_content": "lol was he even an ‘employee’ in the first place? Seems to me he worked for someone else and quickly bailed.",
                "author": "Elysium_nz"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "50 Year? Dreams and a Win Win fulfilled!",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "50 year mortgages implies there will be 75 year mortgages in the future. Can you imagine?",
                "author": "coldshowerss"
            },
            {
                "raw_content": "Idk how much more obvious you can make it that you are just paying to \"rent\" money from the bank. Sure you own the house but stop paying your mortgage rent payment and see what happens to \"your\" house. You'll find out who really owns it lol",
                "author": "StrebLab"
            },
            {
                "raw_content": "You will own nothing, and be thankful.",
                "author": "Select_Asparagus3451"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "DFW (Dallas Forth Worth) area sees large spike in debt and families behind in bills",
        "score": 39,
        "text_content": "NBC News from Dallas portrays grim picture of rising debt collections and families falling behind in past few months far exceeding previous 5 years. https://youtu.be/Q8FnnbPwXns?si=_aDT9OYh4O2PsgkZ In fact southern cities seem to dominate list of cities (especially from Texas as Austin and Houston are also in top 10) that have seen largest rise “in collection” accounts",
        "comments": [
            {
                "raw_content": "Orly? Can confirm.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Rinse and Repeat.... California saw tremendous growth and got too expensive, while many fled to Arizona. Then Arizona has got too expensive so many decided to move to Texas...and now Texas has gotten too expensive. Sound like Texas grew too fast which is why a low tax State cannot last long without raising taxes.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Housing Sale Prices and Mortgage Payments",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Median sale price to household income at the same level in 2024 as 2013? That doesn't make sense. 2013 seemed way more affordable than 2024 did.",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "30% household income goes to mortgage: this has to be a bubble, right?",
                "author": "Strength_Various"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "2026 EOY Survey",
        "score": 9,
        "text_content": "It seems the daily is now dead beyond rejuvenation and has turned into a weekly thread so posting in the main sub for the annual survey: Now that we're heading into the winter holidays another year has come and gone 🎉 Surveying until EOY for the 26' consensus as we're turning the page to yr 7 of the unfolding affordability crisis: https://www.reddit.com/r/REBubble/s/RqRrHuB66Q 2025 looks to be a repeat of 2024 with mass layoffs and equity markets on fire 🔥🔥🔥📈📈📈🚀🚀🚀 all while rates are dropping into the 5-6% range bringing relief to sidelined buyers and sold hoom 🏘 prices per FHFA and Case-Shiller are once again up YoY. Any predictions on the major catalysts to look out for as we head into 2026? Here is a retrospective of the top catalysts called for each year in r/REBubble history: 2020 - lumbar crisis, forebearance inventory tsunami 2021 - Evergrande, student and auto loans, builder inventory tsunami 2022 - 4% interest rates, inflation, most qualified buyers 2023 - mass layoffs, recessions, crypto boobles, bank failures 2024 - mass layoffs, auto sales, stock market rally, 8% interest rates, full employment strong economy rate crisis, rate cuts, Evergrande, soft landing 2025 - Higher mortgage rates less qualified buyers, supply chain labor shortages, stagnant real hoom values 2026 - 🔮??? layoffs, politics, 2022 seller capitulation, 50yr mortgages Congrats to all that have been here since the beginning, and I hope everyone is winding down for the holidays 🍾",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "everything points to spring 2026 being the blood bath",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "I expect modest price moments in either direction, and the semi frozen market to continue. From an investor perspective, I believe activity will be muted, and in most SFH markets new landlord owned units will mostly come online from accidental landlording. It is my conjecture that intentional landlording will very slowly shrink as there are few good deals out there. Investor money will be more concentrated in special situations, Mobile homes, rehabs, apartments, and in some markets commercial.",
                "author": "JLandis84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano banana 2 vs Nano banana - comparison output",
        "score": 895,
        "text_content": "If you didn't know, nano-banana 2 was available for a couple hours on [media.io](http://media.io) yesterday (despite a lot of people thinking it's fake) and there was a lot of testing. The model is extremely powerful, a huge step up from nano-banana 1 and this output was extremely impressive to me. Nano-banana 2 still makes a few errors but it is almost perfect in text rendering with a correct solution. Nano-banana 1 on the other hand is pretty bad at this prompt. You can tell the model has somewhat of a correct answer but the text rendering is awful making the whole image incomprehensible. Hopefully this comparison will put to rest the doubters.",
        "comments": [
            {
                "raw_content": "Not even a year ago any text was complete gibberish and now this, I don't even know what to say anymore",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "This is such an objectively insane thing to now be comparing image generators on, things are moving faster and faster.",
                "author": "nanoobot"
            },
            {
                "raw_content": "I will be posting a larger collection of images on Tuesday from a much newer checkpoint",
                "author": "ThunderBeanage"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 3 out before November 2026",
        "score": 160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably 2-3 more models will be released before GTA sees a release. I'm not saying these models will have the ability to make games by then, but I'd say that gap is closing every month.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "if AI went crazy enough we could have GTA 7 before GTA 6 😂",
                "author": "LessRespects"
            },
            {
                "raw_content": "Rockstar hasn't even begun development on GTA 6 yet. They're waiting until AI can develop it in 1 prompt.",
                "author": "hydrangers"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Algorithmic Turn: The Emerging Evidence On AI Tutoring That's Hard to Ignore",
        "score": 77,
        "text_content": "TL;DR: A carefully engineered AI tutor (built on GPT-4) outperformed in-class active learning in a randomized trial (~200 physics students). Median learning gains were dramatically higher, most students finished faster, and the system worked best as a first-pass “bootstrapping” tutor before human-led activities. ——— If instruction is largely algorithmic, and AI starts doing it better, what, precisely, remains uniquely human in teaching? Motivation, belonging, identity, ethics? Have you been using it as a tutor? What are your experiences?",
        "comments": [
            {
                "raw_content": "If we are talking about all teaching, then babysitting in lower education. Nobody wants to admit that the biggest value teachers provide to society is babysitting. This isn’t how I feel, this is how society actually values teachers. It couldn’t be more clear that this was the case then when parents biggest complaints with Covid and remote learning wasn’t the potential for their children to receive sub par education but because they had no child care now. Until we eliminate all work, we will always need baby sitters. Unless you want the robots to watch children too but that’s pretty futuristic imo rather than the immediate possiblility of being able to replace teaching with AI tutors.",
                "author": "brett_baty_is_him"
            },
            {
                "raw_content": "The paper revolves around this observation: >does the emergence of artificial intelligence mean that teaching itself is fundamentally algorithmic, that what **we’ve long considered an irreducible human art** is actually a computable process? Since when has “teaching” ever been an “irreducible human art”? I’d argue most people would consider poetry, music, and art much more “irreducible human art” than teaching. And studies have already shown that people often prefer AI generated poetry, music, and art (well, until they know it’s AI).",
                "author": "AppropriateScience71"
            },
            {
                "raw_content": "For those few kids motivated to learn on their own, they will use AI tutoring to leave their peers in the dust. Those students, however, are very few. The vast majority of us only ever learned anything because of the social pressure put on us by schools, families, friends, and teachers. Very few of us would actually WANT to spontaneously learn algebra as a 13 year old without the social pressure to do so and succeed. This is why AI is not likely to replace schools and teachers, but will become a very important tool for them. Learning and school is, fundamentally, a social endeavor. (See Social Learning Theory).",
                "author": "Samvega_California"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Whats your prediction for Gemini 3?",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has to be better or it will be seen as a failure",
                "author": "strangescript"
            },
            {
                "raw_content": "My prediction is ![gif](giphy|2PVXDd9w3C5a2EuLmr)",
                "author": "Deciheximal144"
            },
            {
                "raw_content": "I've only had glimpses of it in AI Studio A/B testing, but what I've seen was brilliant in planning and creative writing tasks. I expect it to be way ahead of everything else in non-coding tasks, and possibly on par with Claude 4.5 in coding.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Xpeng's Humanoid Robot",
        "score": 362,
        "text_content": "Xpeng's Humanoid Robot Is Taking the Spotlight!",
        "comments": [
            {
                "raw_content": "This was months ago, a different robot. The one that walks like a female model has a different structure with a movable hip. Amazing how it learned to walk like that and also they've shown it learning a dance routine. Who would think after graphic designers the next people impacted by technology would be dancers",
                "author": "Kiwodasu"
            },
            {
                "raw_content": "I'm out of the loop with this company. Didn't they reveal a robot that could walk without looking weird like this?",
                "author": "Cheap-Ambassador-304"
            },
            {
                "raw_content": "Can someone explain how it balances without tits?",
                "author": "PineappleLocal5528"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The only reason why I want AGI",
        "score": 82,
        "text_content": "I’ve always wanted a future almost exactly like Star Trek where we come together and travel the stars as one species and AI is our companion not our master, this is the ideal future in my eyes. Before the AI hype I thought I’d never see this in my lifetime but this AGI/ASI talk is giving me a slither of hope.",
        "comments": [
            {
                "raw_content": "At every stage of humanity, people have been at constant war with each other, usually over stupid things like which imaginary god you believe in, or the colour of your skin. It's hard to imagine us finally all coming together to achieve greatness. A benevolent AI super power that fixes all of our problems, and prevents us from continuing to murder each other en masse, is about the best case scenario I can imagine.",
                "author": "Dadoftwingirls"
            },
            {
                "raw_content": "It's coming fam",
                "author": "f00gers"
            },
            {
                "raw_content": "Let's be real. Only robots gonna be traveling across the galaxies",
                "author": "xp3rf3kt10n"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Developer Tasks That Are Too Complex for AI or Vibe Coding.",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Half the battle is defining the task, and then discovering the edge/cases and gotchas where the task needs further redefining.",
                "author": "Putrumpador"
            },
            {
                "raw_content": "Novel engineering problems in languages with little to no documentation. Also, system design.",
                "author": "Snoo-82132"
            },
            {
                "raw_content": "Literally every day I encounter things that Codex and Claude are stumped by, and that I can do in under 10 minutes. They will get there, but they sure as fuck are not there yet. Yes, daily, because we are currently testing out a “try it with AI first” dev philosophy and finding out what it can and can’t do effectively Biggest successes so far are hunting down clearly defined bugs, fixing gaps in testing and documentation, etc. I rarely need to intervene with those. Anything like a new feature the code quality is, at best, like a new hire straight out of school with zero thought to maintainability, testability, or anything besides functional correctness (even that is unreliable). Maybe folks have different experiences in smaller orgs or simpler code bases/domains",
                "author": "FreshestCremeFraiche"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Are US companies sleepwalking into dependency on Chinese open-source AI?",
        "score": 166,
        "text_content": "Something weird is happening in production AI that not many people really talking about. Over the last 6 months, there's been a quiet exodus from US models to Chinese open-source alternatives. Not because of ideology or politics, just pure economics and performance. Airbnb's CEO publicly stated they're running on Qwen models because they're \"faster and cheaper than OpenAI.\" Jensen Huang called them \"the best among open-source AI models.\" Jack Dorsey wants to build on them. Amazon's allegedly using them for humanoid robot control. The numbers are stark: 600M+ downloads, 30% of all Hugging Face downloads in 2024, 7 models in the global top 10. Here's what makes this interesting: we spent years worried about China \"stealing\" AI technology, but what if they just... out-executed us on the open-source strategy? While OpenAI and Anthropic went closed-source and expensive, Alibaba went Apache 2.0 and dirt cheap (roughly 1/3 the API cost). When you're running billions of inference calls, that cost difference isn't academic. It's existential to your unit economics. And the performance gap has essentially closed on many benchmarks. This feels like a textbook innovator's dilemma playing out. US companies optimized for margin and control. Chinese labs optimized for adoption and ecosystem. Now US companies are choosing Chinese infrastructure because it makes business sense. The question isn't whether this is good or bad. It's whether we're building a dependency. What happens when critical US infrastructure runs on models we don't control? What happens to the \"AI safety\" conversation when the models powering half of Silicon Valley are outside our regulatory reach? Are we thinking about this at all, or are we just letting market forces play out and hoping it works out?",
        "comments": [
            {
                "raw_content": ">What happens when critical US infrastructure runs on models we don't control? Wdym \"we don't control\"? Nowhere has the deployer as much control over the model as in open source. The developer has no say in how their models end up being finetuned / used and it frankly shouldn't be their business / responsibility either.",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "I feel “open source” is misunderstood by OP",
                "author": "FeralPsychopath"
            },
            {
                "raw_content": "China has far more regulations around AI than we do. Also, what do you mean by dependency? The models are open source. You don’t depend on anyone.",
                "author": "Cryptizard"
            }
        ],
        "subreddit": "singularity"
    }
]