[
    {
        "post_name": "When a Libertarian sees drug smuggling gang bangers.",
        "score": 985,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish the Libertarian party leaned conservative and not stupid.",
                "author": "CyanScales"
            },
            {
                "raw_content": "Clearly, this idea is ridiculous. But I do think they government should have to provide at least some degree of evidence that they are what we claim they are afterwards when we’re blasting random people off the face of the earth.",
                "author": "HoganT"
            },
            {
                "raw_content": "If we're able to bomb terrorists in the middle east without due process, we should be able to bomb terrorists off the coast of America.",
                "author": "kestral"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She wants all of you to stop saying the “R word.”",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She looks like a fucking retard how can anybody fucking look at this retard and think yeah her stupid ass retarded opinion is really fucking retarded. There's a whole bunch of retards out there nowadays everywhere you retarded go.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "I don't know what R-word she is referring to but i do think she is retarded",
                "author": "ComfyAF"
            },
            {
                "raw_content": "ok retard",
                "author": "TruculentGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who is paying at dinner?",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TAXPAYERS",
                "author": "TEXinLA"
            },
            {
                "raw_content": "the last thing your business sees before moving to Miami",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "We are.",
                "author": "Simon_Jester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": ":D",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love Trump, and I can't wait for JD in 2028. NO FUCKING BREAKS",
                "author": "Rickshawrick"
            },
            {
                "raw_content": "Don’t want to die? Don’t do illegal shit. Also fuck you. If you think this is meant for you it is. If you think it’s not. It’s not.",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Vance has the same attitude and willingness to say the truth Trump has with a decent amount of USMC seasoning added.",
                "author": "Prof_Smith"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti-Trump \"free DC\" protestors were just spotted loading INTO BUSES to travel out of the city because they don't live there. The left said these \"mass protests\" were \"sporadic,\" but they were PAID and mass-transported in.",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was in 2020 in Philly but I said to one protester, \"We all know you're paid.\" They looked shocked, like how did you know?",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "If you are being paid to protest then you are an agitator not a protestor. I don't think 1st amendment should apply. Just my opinion.",
                "author": "WolfsDragoons"
            },
            {
                "raw_content": "Track each individual down and identify them so we can keep track of how many of these paid for, \" rent-a-crowd \" events they participate in and FOLLOW THE MONEY. Who are the puppetmasters?",
                "author": "BenDoverAssho"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Silence and Outrage",
        "score": 1423,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats worship blacks after they enslaved them. It’s like the Jews who get away with everything, up to and including genocide, because of their Holocaust narrative.",
                "author": "Region"
            },
            {
                "raw_content": "Never relax",
                "author": "GodSaveTheWest"
            },
            {
                "raw_content": "Whats the story on the left picture?",
                "author": "HairOfTheDoge"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ChatGP1, why is my electric bill so high? ⚡️📈",
        "score": 914,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Data centers need to pay an extra fee and subsidize the cost for normal use, plain and simple.",
                "author": "Doritalos"
            },
            {
                "raw_content": "Its because democrats made everything else illegal and nobody stopped them from weaponixing energy",
                "author": "Krat"
            },
            {
                "raw_content": "Is this not just an inflation graph",
                "author": "bejeavis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ben Bergquam: Chicago ICE Facilities and Federal Buildings Being Fenced and Boarded Up Ahead of Expected Violence Over ICE Raids as Hundreds of Agents Stationed at Naval Base",
        "score": 738,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fuck this bring in the Marines....",
                "author": "quiznossucks1"
            },
            {
                "raw_content": "This could be a self fullfilling psy op - DHS could post - \"we will be conducting operations in SW Town Chicago - do not interfere\" meanwhile setup a dragnet somewhere else. (i.e. just boarding this stuff up could cause some self deports)",
                "author": "BruddahIz"
            },
            {
                "raw_content": "WTF? bring in the fucking marines and the tanks. No need to board up like bunch of pussies. let them FAFO",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LAPD yanks cops off Kamala Harris’ mansion after uproar over diverted patrols",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are these idiots talking about LAPD while showing a CHP car. haha.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "The dirty cunt wanted to defund the police and incited burn loot and murder on innocent Americans during Biden/Harris stolen election. Yet, she wants to be protected at her mansion & expects the tax payers to pay for it. She can burn in hell.",
                "author": "MajorClark"
            },
            {
                "raw_content": "she should be paying for her own private security",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator Rand Paul unleashes on JD Vance, FUMES after Vance said \"I don't give a sht\" to Brian Krassenstein claiming it was wrong to take out the cartel boat coming from Venezuela.",
        "score": 685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rand, we aren't holding a trial for some drug smugglers on a boat, get off it.",
                "author": "FuckReddit4545"
            },
            {
                "raw_content": "I knew the lobertarians would come out against this. Always the liberals and lolbertarians. When somebody is sending a missle your way, you shoot it down, you don't wait to go to trial. These are weapons of mass destruction and should be treated accordingly. If someone's house was on fire with the family in need of help and danger of burning up, Rand would walk on by, so as to not violate the homeowner's 4th amendment rights.",
                "author": "dontdisrespectpotus"
            },
            {
                "raw_content": "Rand's brand of conscientious conservatism would see us all dead just so we could occupy the moral high ground in his eyes. When you've got the Chinese shipping entire boatloads of precursor chemicals to drug cartels, this is not a criminal matter, it is war, and it needs to be treated as such.",
                "author": "DestroyerofCobwebs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There is no magic dirt",
        "score": 1408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They shit in the streets. They shit in the drinkable water. They don't wash their hands. They use shit as a food seasoning. We don't. They can't ever be part of us, because they're shit and we're not.",
                "author": "Kaarous"
            },
            {
                "raw_content": "You should see Little Mogadishu, MN",
                "author": "RealityIsAPsyOp"
            },
            {
                "raw_content": "Weird, white people went to new places and those places all got better for humans to live in.",
                "author": "Icepck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Panera Bread was purchased by a Private Equity Firm and ever since their prices have never stopped going up “Just in case you don't think we've lost our minds. This cup of soup at Panera was $9.50” Again, this tiny cup of soup cost $9.50. Insane.",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So stop eating there? The companies aren't going to lower their prices because people complained on the internet. Go somewhere else for your reheated soup and overcooked bread.",
                "author": "VoidWanderer"
            },
            {
                "raw_content": "Private Equity Firms are cancer.",
                "author": "aloha_snackbar22"
            },
            {
                "raw_content": "For the love of God, people, LEARN HOW TO COOK!",
                "author": "frenacrossthepond"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Peter Navarro: \"The Federal Reserve is totally out of touch with reality...Powell, he's a Republican but he's so anti-Trump it's unsettling...if you look at the arc of Powell's decisions everything he's done since he got appointed has been against President Trump.\"",
        "score": 1053,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet he's still employed.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Our side just sounds stupid with this shit. The reason rates are still high is because government hasn't cut spending in any meaningful way whatsoever. That means the government is still spending over 2 trillion a year more than it generates in revenue. That requires money printing to pay for. There are only 2 ways money is created in the U.S. under the idiotic Federal Reserve scheme, and private loans are the other way. So if the federal government is going to continue spending 8% of the entire GLOBAL GDP, then there's only one way to offset that, restrict private sector loans, and you do that with higher interest rates. 75% of all spending is on the so called \"safety net\". So in simple terms, either eliminate the leftist gibs programs, or we only have 2 possible paths: - Lower interest rates anyway and get very high inflation - Or don't lower interest rates and have an abysmal economy. Without massive spending cuts, that's the deal. Republicans see the polls that show 70% of moronic Americans still support the gibsmedats, so they don't have the balls to eliminate those programs, even though it's the ONLY sane way forward.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "The Federal Reserve is in touch with reality. The reality is that the Federal Reserve outranks the President and Congress. They're politically untouchable.",
                "author": "fskfsk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Be grateful for the missile we dodged",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; An inch closer towards President Trump's head and we'd have this fool, for 6 months, tops. &#65038; ( We'd be dead from nuclear Armageddon by now. ) &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "I don’t believe I’ve ever been more annoyed by a personality in my entire life than hers.",
                "author": "PatGarrett"
            },
            {
                "raw_content": "Pentagon has left the chat",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Los Angeles is the 2nd SAFEST city in the Country guys. SmartAsset says so!",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why we stopped listening to experts and their studies.",
                "author": "sleepyspar"
            },
            {
                "raw_content": "Any city is safe if you don't report the crimes.",
                "author": "LBTrumplican2"
            },
            {
                "raw_content": "why dont they post links to the study? thats web 1.0 shit",
                "author": "SHILL_DETECTOR"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Kennedy: Glad to see The Campbell's Company @thecampbellsco take action—removing synthetic dyes from their food and beverage portfolio by 2026. I urge other companies to follow their lead. Together, we will Make America Healthy Again.",
        "score": 1177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My friend is a consultant for Campbells. This is a very nice person who never says anything bad about anyone including her ex husband who got another woman pregnant while they were still married….Campbells was the most fucked up terrible company she’s ever worked with.",
                "author": "Greenhills"
            },
            {
                "raw_content": "The number of foods that had needless dyes and synthetic poisons is way too numerous to be coincidental. Who the fuck gives a shit about the color of food?",
                "author": "Modernturnkey"
            },
            {
                "raw_content": "I'd be happier if they removed all dyes from food products, but I am happy for this victory. This is part of what I voted for.",
                "author": "Washington_Redskins"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Department Of War",
        "score": 1046,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm somewhat happy with this change, but not for message it sends. More for the fact that he's starting to touch/reverse FDR's legacy. Yet, at the same time. \"Department of Defense\" was a lie to begin with, so yeah... I'm warming up to this.",
                "author": "tuaris"
            },
            {
                "raw_content": "Joshua played thermonuclear war....not thermonuclear defense!",
                "author": "VirTW"
            },
            {
                "raw_content": "🌶️",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Constitutional Amendments dont apply to non-citizens",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And just because you are standing on American soil, that does not qualify you.",
                "author": "Tradstew"
            },
            {
                "raw_content": "Constitutional Rights should not apply to foreign invaders. However, basic laws of the land DO apply. Crime is still crime.",
                "author": "skuts"
            },
            {
                "raw_content": "The right of the people to be secure in their persons, houses, papers, and effects, against unreasonable searches and seizures, shall not be violated, and no Warrants shall issue, but upon probable cause, supported by Oath or affirmation, and particularly describing the place to be searched, and the persons or things to be seized",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY CR*P 🚨 Robert F Kennedy Jr reveals that CDC Chiefs have been ordering scientists to DESTROY DATA for decades showing vaccines cause autism, then publish false findings",
        "score": 1775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These people should go before a firing squad to pay for all the death and suffering they have caused.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "They need to be jailed.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "So when are we going to pull the CDC schedule for 0-36 month olds !?!? Schools require them, Pediatricians require them, daycares require them ALL BECAUSE OF THE CDC SCHEDULE!",
                "author": "TrumpIsMyyPresident"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What a pussy -",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This little bitch supports terrorists.",
                "author": "RealityIsAPsyOp"
            },
            {
                "raw_content": "STFU Assenstein.",
                "author": "here2red"
            },
            {
                "raw_content": "We should start eliminating faggots.",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[News] TSMC to Implement a Significant Price Hike",
        "score": 225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If zen 6 is on 2nm I wonder how the pricing is going to be.",
                "author": "dabocx"
            },
            {
                "raw_content": ">Reports indicate that starting in 2026, TSMC plans to raise prices by 5-10% for advanced nodes below 5nm, including the 2nm process scheduled for mass production by late 2025. Currently, 3nm wafers are priced at around USD 20,000 each, while 2nm wafers are expected to cost at least 50% more—exceeding USD 30,000 per wafer—with further increases possible. TSMC has already notified key clients of its pricing strategy. In contrast, the company may consider lowering prices for mature nodes, where cost pressures are less pronounced.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "And this is why Samsung and Intel have to continue developing leading edge nodes.",
                "author": "EJ19876"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm CEO says Intel ‘not an option’ for chip production — yet",
        "score": 249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not surprising since they’re trying to take a piece of the pie from Intel. If panther lake with 18A improves on the efficiency of lunar lake (TSMC N3B), windows on ARM is pretty much left for dead, given lunar lake already beats the one big advantage of Snapdragon (battery life)",
                "author": "Touma_Kazusa"
            },
            {
                "raw_content": "What's holding intel back from fabbing for customers? Bad salesmanship, or something else? Surely intel should be able to offer some value proposition even if they're behind TSMC?",
                "author": "cegras"
            },
            {
                "raw_content": "Hello Geddagod! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[The Verge] Legion Go 2 official: Lenovo’s new flagship handheld costs $1,099 — and up",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait for $2000 handhelds",
                "author": "ExplodingFistz"
            },
            {
                "raw_content": "Legion Go 1 Owner. Got mine for 500. Absolutely not upgrading. How could a handheld be worth that much when you can Z1E handhelds for half the price? Not worth at all, Z2E isn't that big of an upgrade. You don't even get FSR4. The Z2E handhelds really don't seem like it. Hopefully next gen of handhelds can involve some Qualcomm+Nvidia, FSR4 Compatible AMD, and more Intel offerings. Upscaling tech is INSANELY useful on a small screen like that. Edited to say \"next gen 'of handhelds' \"",
                "author": "XenonBlitz"
            },
            {
                "raw_content": "1080g for a handheld device is insanity even if it has an 8.8\" screen. People have complained that the Switch2 (7.9\") at 535g is too heavy. This weighs just over 2X the Switch2. As for competitors, the Steam Deck OLED (7.4\") is 630g, and the Asus ROG Ally X (7\") is 680g. Doubly idiotic is that they're sticking with a 16:10 aspect ratio when virtually all games are designed for 16:9, and switching to 16:10 actually _reduces_ viewable area because the vertical viewing range is locked. This is equivalent to those 4kg laptops that have the best specs but are completely impractical for most use cases. Lenovo has the Legion Go S (8\" 730g) and Legion Tab (8.8\" 350g tablet) that are less powerful but are more practical for everyday use.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Future of Memory: Limits and Opportunities",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't see how this essentially differs from a private cache, or why it would need 2.5D or 3D anything.",
                "author": "nanonan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RISC-V and MIT license vs. GNU, or copy left in general",
        "score": 10,
        "text_content": "So something I've been thinking about when looking at the arguments for different ISAs is that. Broadly speaking, yeah, historically RISC-V is still the most successful open license ISA in general, and I know companies don't like copyleft, and don't feel comfortable with sharing their IP. But something I've thought about with a handful of projects where I've heard of custom ISA extensions is that part of the point of an ISA is uniformity, and avoiding fragmentation, as opposed to every design being custom and, in some ways that's an advantage historically to legacy ISAs that control their own licensing like Intel. And the thing I thought of is that I assume a more copy left ISA would prevent that? I completely understand why no company on earth would want to have to make public their uArch, the specific implementation, the specific CPU or whatever core. Obviously if the terms of the license said they had to do that, the license would have no shot. But everyone is always talking about how micro architecture and the instruction set architecture are different. The Linux kernel stuck with GPL-2, because devices with the Linux kernel embedded in them and their included operating system, like Android and Chromebooks and some smart TVs didn't necessarily have to release every single piece of their software, and. It makes sense that there might be disagreements between some other companies with some of the official extensions, and how they implement things, and companies should have the freedom to extend the ISA how and if they like. But wouldn't it be better to make any of those custom extensions. Public? So, if there does end up being a custom extension that's better overall, it can have a broader install base? Ensuring better compatibility? Because my understanding is that. It's entirely possible for someone to still make a completely proprietary offshoot of RISC-V. Maybe that's more of a problem for the future, given how little adoption RISC-V presently has, but. It's something that occurred to me.",
        "comments": [
            {
                "raw_content": "No commercial company would adopt a copy left license for hardware, even if it’s just ISA. You’d essentially be locked into releasing any proprietary IP with no choice, even if you wanted to make extensions for yourself. You’d also be committed to supporting your extensions even if you had no plans to. Once it’s out there , you can’t change it or take it back like you could if you left it undocumented.",
                "author": "dagmx"
            },
            {
                "raw_content": "I understand where you're coming from, though I think it's not really an issue in practice. Proprietary ISA is only really an advantage if you're the incumbent. There are a number of RISC-V companies doing custom ISA, but in most cases, it's just a play to get ahead of the standards body and maybe force their hand to adopt it as the standard. At worst, it's something they never intend broad compiler support for, just targeted libraries. I don't think anyone's really interested in hoarding ISA. Hell, even for Apple, their early matmul ISA just became ARM AMX.",
                "author": "Exist50"
            },
            {
                "raw_content": "It doesn’t solve the fragmentation issue Hardware isn’t software Even if everyone released the details of their customization what matters (and what potentially causes the fragmentation) is what is actually implemented in the released hardware And to be clear this is really only an issue for CPUs Anything else doesn’t matter as much as programmers access add in hardware using libraries and the OS just needs a device driver",
                "author": "ghenriks"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I absolutely cannot WAIT for this port after seeing the awesome job Ubisoft did with SW: Outlaws",
        "score": 404,
        "text_content": "Assassin’s Creed: Shadows is a great game and I loved it on Ps5 Pro, but I’d love to have this one in portable form especially with cross save support! Considering what Ubi managed to do with Outlaws, I think this one has the potential to really shine on the console and considering that AC is their breadwinner, I think they will work even harder on this port job. Nvidia cooked so hard with this little console, and Ubisoft really popped out and showed developers that this little console is super capable! 3rd Party Support for this thing is gonna be amazing!",
        "comments": [
            {
                "raw_content": "I’m happy to see some genuine excitement on here. Who knows, maybe getting SW Outcasts and this AC game on the switch looking good will have a snowball effect on other developers. More games being available on switch I think is a win for players.",
                "author": "Ironic-username-232"
            },
            {
                "raw_content": "I've never seen someone so enthusiastic about ubisoft. Especially not on reddit",
                "author": "NecroticOverlord"
            },
            {
                "raw_content": "Odyssey would be cool",
                "author": "thewoodulator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws Screenshots",
        "score": 205,
        "text_content": "Game is really fun imo, people just love to hate",
        "comments": [
            {
                "raw_content": "I'm having such a great time with it. I didn't realise it received such hate until I made a post about it earlier and had people accusing me of working in advertising at Ubisoft. The internet is a strange place, man 😂 EDIT: Downvote all you want, whatever makes you feel better about not understanding that people might enjoy things that you don't. I've got your back.",
                "author": "Sergeant-Politeness"
            },
            {
                "raw_content": "Tbf, while people do love to hate, Outlaws did initially launch in a very poor state before patches came to fix it up. It just never got a second shot at re-evaluation like Cyberpunk did for whatever reason.",
                "author": "ChefDeezy"
            },
            {
                "raw_content": "These are all docked btw",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo has now fixed another wave of Switch 1 games for backwards compatibility on Switch 2",
        "score": 565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Beat ‘Em Up Collection (QUByte Classics) Bright Memory: Infinite Gold Edition Guilty Gear XX Accent Core Plus R Killing Time: Resurrected Love Clear Melty Blood: Type Lumina Mon-Yu: Defeat Monsters And Gain Strong Weapons And Armor. You May Be Defeated, But Don’t Give Up. Become Stronger. I Believe There Will Be A Day When The Heroes Defeat The Devil King. [only Japanese version confirmed fixed currently] Monster Rancher 1 & 2 DX [only applies to Japanese version currently] Phantasy Star Online 2 New Genesis Cloud Powerful Pro Baseball 2024-2025 Touhou Artificial Dream in Arcadia",
                "author": "skahthaks"
            },
            {
                "raw_content": "Patiently waiting on Nier Automata and Tokyo Xanadu still",
                "author": "projected_cornbread"
            },
            {
                "raw_content": "pls nintendo, nier automata, i need it on my switch again",
                "author": "myghostflower"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nvidia's DLSS (AI image upscaling) is really helping the Switch 2 punch above its weight and Star Wars Outlaws is early proof.",
        "score": 292,
        "text_content": "The image courtesy of [nintendoeverything.com] Upscaling from such low internal resolutions to a display output that's full HD or higher and having the final output look so close to native resolution is a testament to the skill of the engineers at Nvidia/Nintendo as well as software engineers like at ubisoft etc. I can't be the only one impressed by this tech specifically in the compact tablet...?",
        "comments": [
            {
                "raw_content": "We just need Nintendo themselves to start using it lol",
                "author": "OVO_ZORRO"
            },
            {
                "raw_content": "It looks great in docked.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "\"Some menus run at 60 fps\" well that's an achievement I guess",
                "author": "IceTeaDestroyer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yelp Another Star Wars Outlaws post",
        "score": 200,
        "text_content": "Was gonna wait for the inevitable sale but seen it was £42 in Smyths and comes with the season pass so I'll make the sale wait for me and trade it in when I want something else. My impressions are positive don't regret the purchase I'm only an hour or so into the game not played handheld yet but docked mode has been cool way better than I expected I think this is a game I will play right the way through and enjoy it, makes me excited to see assassin's creed shadows on the switch 2 as it uses the same engine. Im still fiddling with display settings to try get the best picture and whether HDR is worth it or not but if your on the fence and you can get it physically give it a go. And if you are a star wars fan it's probably a must play",
        "comments": [
            {
                "raw_content": "I can say playing handheld has been very enjoyable and no issues at all. I’m several hours into the game and really enjoying the gameplay, music, mechanics, gunplay and stealth aspects of the game. Looks great in handheld, which I play 99%of the time.",
                "author": "Ill-Lab-6124"
            },
            {
                "raw_content": "These kind of pictures just show how much of a massive leap the Switch 2 is to the Switch 1. I’m browsing Reddit and these type of posts pop up and I had to do a double take that it’s on a Nintendo console.",
                "author": "ApprehensiveLuck4029"
            },
            {
                "raw_content": "You should definitely find it a try, I love being able to sit in the couch or easy chair in handheld and when the wife wants something I can just go and come back to it so easily. When she got her hair styled the other day and I’ve was sitting in the truck, she was back so soon I didn’t get too far with the S2 version of Kirby’s Forgotten Land. This handheld is so much fun and looks great!",
                "author": "Ill-Lab-6124"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do I need to play Hollow Knight before Silksong?",
        "score": 59,
        "text_content": "I'm interested in Silksong, but haven't ever played Hollow Knight. Should I get play HK first, or can I go straight to Silksong? Edit: Thank you all for you comments! I've decided to start with Hollow Knight and get Silksong later on.",
        "comments": [
            {
                "raw_content": "I'd recommend it only because silksong is harder and it would be a lot easier to get the hang of it if you are already experienced with HK late game difficulty",
                "author": "mking098"
            },
            {
                "raw_content": "It’s not necessary, but I recommend it.",
                "author": "twili-midna"
            },
            {
                "raw_content": "Thank you all for you comments! I've decided to start with Hollow Knight and get Silksong later on.",
                "author": "Training_Project1971"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just started Star Wars Outlaws. Great game so far. You can get some cool shots in Photo Mode.",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im 15 hours in and still loving it, this game got a lot of hate at OG launch but I don’t see any issues",
                "author": "AbbreviationsOk4532"
            },
            {
                "raw_content": "looks really nice on the Switch 2! better than expected!",
                "author": "No_Plankton7982"
            },
            {
                "raw_content": "I've played about 2-3 hours in handheld mode and another 5-6 hours in docked and I'm having an absolute blast with this game. Makes me happy to see analysts and YouTube personalities update their impressions and speak favorably of the Switch 2 version. It also seems to be selling well too. This is how hard work should be rewarded. Cheers.",
                "author": "GoldenAgeGamer72"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The NS2 eshop finally looks like a modern console and its just the first 3 months.",
        "score": 258,
        "text_content": "I was casually browsing the eshop and was looking at the featured and best sellers, I was so happy to see that we are now seeing an influx of AAA games charting on the eshop. Instead of seeing a lot of indies (not to shit on them) and shovelware pushed down my throat. Like the dreaded H games. Lol Star Wars Outlaws, Cronos, SF6, Cyberpunk, The annual sports games. At one point I thought I was looking at my PS5. Felt it was a solid launch window for 3rd parties than we got on Switch 1... for petes sake the first fighting game we had during that time was a port of 30 year old Street Fighter game. I hope i can finally say \"I dont need my PS5 anymore\" because handheld is all I care these days. Please, just make a competent port and your games I will buy here instead because of portablity",
        "comments": [
            {
                "raw_content": "I think the first 3 months of Switch 2 have been really impressive. The first 3 months of the original Switch had my mostly just playing Zelda and MK8 with a bit of Spectre of torment.",
                "author": "kookalamanza"
            },
            {
                "raw_content": "I don’t mind indies at all and have a pretty big collection of them. It’s the shovelware that’s a problem.",
                "author": "DreadnaughtHamster"
            },
            {
                "raw_content": "I may be in the minority here but I think the switch 2 library is awesome so far. It’s also refreshing to have an eshop that doesn’t take a while to load - but the bar is in hell on that one.",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Soulcalibur 7 to be announced next week at Nintendo Direct?",
        "score": 321,
        "text_content": "https://xcancel.com/theswitchforce/status/1964454888399917341?s=46 ”Not a ”soul” has guessed the correct combo yet. What are your picks?” I think Switchforce hinting at Soulcalibur 7",
        "comments": [
            {
                "raw_content": "That's right it's Dark Souls 7 coming to Switch 2",
                "author": "Outside_Narwhal8008"
            },
            {
                "raw_content": "Im trusting your word out of cope",
                "author": "ZEKE307"
            },
            {
                "raw_content": "Soul Caliber 7 with link coming back",
                "author": "GrouchyMembership876"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EXCLUSIVE: Amazon's ‘God Of War’ Series Set To Begin Filming In March 2026 in Vancouver",
        "score": 456,
        "text_content": "https://www.nexuspointnews.com/post/exclusive-god-of-war-series-set-to-begin-filming-in-march-2026 Amazon’s God of War series finally has a filming date. The series will begin filming in March 2026 in Vancouver, sources tell Nexus Point News. Ronald D. Moore will serve as the showrunner for God of War. The writers' room also includes: Matthew Graham (Electric Dreams and Spanish Princess) Stephanie Shannon (For All Mankind and Outlander) Narendra K. Shankar (The Expanse and For All Mankind) Joe Menosky (For All Mankind and Star Trek: Discovery) Marc D. Bernardin (The Continental and Star Trek: Picard) Tania Lotia (The Witcher and The Mighty Nein)",
        "comments": [
            {
                "raw_content": "Where's the casting.",
                "author": "Hunk4thSurvivor"
            },
            {
                "raw_content": "Ronald Moore has a fantastic track record so I do have fairly high hopes for this!",
                "author": "Tribalwarsnorge"
            },
            {
                "raw_content": "This is the writer's room I would have liked to see for their Mass Effect show. Stacked with sci-fi talent.",
                "author": "firesyrup"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill X Fortnite coming soon",
        "score": 164,
        "text_content": ">\"Silent Hill is planned to come to Fortnite soon! >This information comes from several insiders that have correctly leaked info on Season 3 & 4.\" [source](http://xcancel.com/Wensoing/status/1964429203899638030)",
        "comments": [
            {
                "raw_content": "In my restless dreams, I see that town... *Tomato Town...*",
                "author": "FoxJ100"
            },
            {
                "raw_content": "what the fuck that would be something lol",
                "author": "superamigo987"
            },
            {
                "raw_content": "special weapon: pillow",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nights possibly revealed as a DLC character in Sonic Racing Crossworld via pre-order case leak",
        "score": 225,
        "text_content": "A reddit user on r/SonicTheHedgehog found a pre-order case containing a never been seen art of Nights alongside Joker and Ichiban advised as one of free DLC characters https://www.reddit.com/r/SonicTheHedgehog/s/yYjz5uepau Edit: Note that an AIAi themed car and Nights themed extreme gear both were accidently revealed on TailsTube 13# https://www.reddit.com/r/SonicTheHedgehog/s/Y0GDBMS9JY https://youtu.be/GiYfo0Wy2NA?feature=shared",
        "comments": [
            {
                "raw_content": "I'm waiting for Ristar to be in the game.",
                "author": "GasEnvironmental6966"
            },
            {
                "raw_content": "Oh hey thats my leak. I had no idea this was gonna gain any traction. And as far as im aware, yes, this is real. I found it just in the shelf of an eb games in New Zealand.",
                "author": "Any_Skill_6710"
            },
            {
                "raw_content": "My favourite Purple flying thing being mentioned!! ![gif](giphy|lPuW5AlR9AeWzSsIqi)",
                "author": "Emergency_Climate_65"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "We Were Here for PS5",
        "score": 163,
        "text_content": "A co-op adventure released back in 2021 on PS4, an entry for a native PS5 version of the game has now been published on the PSN backend. The release date is likely **15th September 2025**. No indication yet if there will be an upgrade from the existing PS4 version, or if this version will require a new purchase. TitleId: PPSA28775_00 ConceptId: 10001633 https://vulcan.dl.playstation.net/ap/rnd/202008/3107/Yq4l4Iahas3v9ESc6m1nzZ4U.png",
        "comments": [
            {
                "raw_content": "to the point. neat.",
                "author": "ayyybro123"
            },
            {
                "raw_content": "Oh wow. Thanks for being concise.",
                "author": "nulljudone"
            },
            {
                "raw_content": "Really fun games. Highly recommend if you’re looking for something to play with a significant other or a friend.",
                "author": "Mattx603"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel finally releases Application Optimization (APO) update adding 15 new games",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a really odd list. Mostly older games and some not even very good ones. Not sure what the criteria for selection is.",
                "author": "MaverickPT"
            },
            {
                "raw_content": "KSP2 is on that list. Probably could have used that effort to better effect with another title.",
                "author": "GrumpyRob"
            },
            {
                "raw_content": "Anyone who thinks it's an odd list: there are very specific cases where games can benefit from what Intel is doing here, it's not that the effort could be put in other more popular games, it's that these games answer the specific conditions that have any potential to begin with to unlock more performance. This is why the list is always odd.",
                "author": "thatnitai"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Qualcomm CEO says Intel ‘not an option’ for chip production — yet",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ironic for QCOM to be saying this. Just like how their Snapdragon X is “not an option” for the general public",
                "author": "Saranhai"
            },
            {
                "raw_content": "Lmao hit article… He didn’t say that exactly. He said the power consumption of 18a is too high for their mobile chips. 18-ap and 14a address this. There always short sighted articles and then actual full context of what was said. People are so gullible.",
                "author": "jbh142"
            },
            {
                "raw_content": "Of course, Intel is finished.",
                "author": "Illustrious_Bank2005"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Patents Smart Cache Memory Cleaning System To Massively Boost Processor Performance",
        "score": 596,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fascinating, I wonder if it will be toggleable in the bios, that way we'd get comparisons with it off and on.",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": "I would have thought cache management would be a mature science with well known algorithms... but then a few weeks ago read about different approximations (or implementations) of the problem. Not as mature as I would have thought",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "I wish it come to AM4 system too",
                "author": "Hasbkv"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "1800$ 5080 Build!",
        "score": 191,
        "text_content": "**CPU:** AMD Ryzen 7 7800X3D 8-Core Processor **CPU Cooler:** ARCTIC Liquid Freezer III Pro A-RGB 360mm AIO **Motherboard:** ASUS TUF GAMING B650E-E WIFI ATX AM5 **Memory:** Crucial Pro 32GB (2 x 16GB) DDR5-6400 CL38 **Storage:** KLEVV CRAS C910 2TB NVMe PCIe 4.0 SSD **GPU:** MSI GeForce RTX 5080 Gaming Trio OC 16GB **Case:** Lian Li O11 Dynamic Mini V2 Flow ATX Mini Tower **PSU:** MSI MPG A850GS PCIE5 850W 80+ Gold Fully Modular **OS:** Windows 11 Pro OEM",
        "comments": [
            {
                "raw_content": "Only complaint is the RAM isn't DDR5 6000 CL30 so maybe return that RAM if you can",
                "author": "blackflagnirvana"
            },
            {
                "raw_content": "Slick for $1800 5080",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Is this the price with taxes? In my country only the GPU and CPU will cost $1800 (including taxes) and that's the cheapest I could find, damn...",
                "author": "RadiantAbility8854"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "XFX says its Radeon RX 9060 XT GPUs with Samsung GDDR6 memory run 10°C cooler than Hynix-based - VideoCardz.com",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's awesome. Shame, I have an XFX 9060 XT (v1 I guess?) as well as a Sapphire 9070XT. One of my big concerns is that the high memory temps will affect the cards' longevity.",
                "author": "BeerGogglesFTW"
            },
            {
                "raw_content": "And 20w less power draw.",
                "author": "MichiganRedWing"
            },
            {
                "raw_content": "It's also a lower clocked chip. I love my XFX 9070XT, but there's too much difference between cards to judge that it's the memory, and even less that it's the manufacturer of the memory. Even if everything else is exactly the same, Samsung has had inconsistent memory controllers over the years for SSDs and RAM. My Hynix drives are going on a decade old and are still working great. My experience is that Hynix memory products are not top of the line, but they're workhorse products that last. Now, I'm going to go play some games on my very reliable and not particularly loud or hot XFX 9070XT that is presumably running Hynix memory.",
                "author": "omniuni"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 5 9500F CPU officially released in China",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The average price of electricity per Kilowatt-hour in the United States. This is unsustainable.",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "U ain’t seen nothing yet!",
                "author": "ElGatoMeooooww"
            },
            {
                "raw_content": "I thought those data centers were required to create their own sustainable energy and not hoard it from the grid. Texas is gonna freeze again this year and the ERCOT is going to cut power and/or charge 100x the rate isn’t it?",
                "author": "LetMePushTheButton"
            },
            {
                "raw_content": "Go look at the price per kWh in San Diego, I’ll wait…",
                "author": "Nomad_moose"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes are crumbling across the nation, and owners don't have cash to fix them",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“a trash-can-sized hole in her ceiling” lmao what?",
                "author": "wbg777"
            },
            {
                "raw_content": "The first person in the article bought the house in 2001 for $75k and is still paying ~$1000/month for mortgage and utilities? If she's been paying that since 2001 that's $288k. How does that happen?",
                "author": "canyoucamus"
            },
            {
                "raw_content": "This has been a long term problem in my area, going back to some degree for forty years. It’s extremely frustrating because a lot of housing stock has basically been destroyed through lack of maintenance. It also intersects with other deeply imbedded social problems.",
                "author": "JLandis84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Homebuyer on a $3K Budget Has Gained $22K in Purchasing Power Since June As Rates Drop to Lowest Level in 11 Months",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If lowering the monthly payment 100-150 dollars is going to make the mortgage barely affordable and leave you cash poor every month you probably shouldn't be buying right now. Next thing you know your insurance and real estate taxes will go up and that interest rate savings did nothing. Home prices and rates both need to come down.",
                "author": "MikeGLC"
            },
            {
                "raw_content": "Blah blah, drop the prices and buyers will come out. I’m currently looking and being extremely picky.",
                "author": "random_phisherman"
            },
            {
                "raw_content": "Awesome. Now the median home price needs to drop by at least 50% to be 3X the median income, per historic norms.",
                "author": "Boo_Randy_II"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fresh blow for 'dying' tourist hub as its housing market stumbles (IIRC, Las Vegas was one of the early casualties of the 2007 housing bubble bust)",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Within the last year my parents bought a house out near Vegas. We all told them it was a dumb idea. They live like 5 hours from the nearest family/ relative. My mom had a crippling gambling addiction, my step dad is a recovering alcoholic. Literally the worst place in the world for them to move to.",
                "author": "blehbleh1122"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New home inventories in the US south are now above their pre-GFC peak (Fear not, frens - CNBC and the NAR assure me that Everything is Awesome!)",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s bad by my friends place investors basically bought up all the homes in a new construction lot a year ago. Now all those units are up for rent or sale and sitting vacant. He bikes thru them and he tells me it’s like scene from a zombie apocalypse just rows and rows of homes with just barely a few occupied..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Fed chart of housing inventory in the southern census region. [https://fred.stlouisfed.org/series/ETOTALSOQ176N](https://fred.stlouisfed.org/series/ETOTALSOQ176N)",
                "author": "Boo_Randy_II"
            },
            {
                "raw_content": "NE ftw",
                "author": "lucidpet"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Thank you to everyone who tried my free Re:Venture clone!",
        "score": 12,
        "text_content": "Just wanted to give a shoutout to this community for being the biggest adopters and users of the free real estate analytics tool I've built -- I've had countless supportive comments and messages from people who've wanted access to this data but never wanted or could pay for other solutions like this before. For those of you are seeing my post for the first time, my friends and I made a free version of Re:Venture, using the same data sources (and some improved ones!). It's not as good as his app (I'm still working on historical data), but it has basically all of the key metrics you'd want to assess the housing market. I also wanted to share that the data has been updated to the latest month (July 2025!) -- And if any of you have comments or other suggestions keep them coming!",
        "comments": [
            {
                "raw_content": "Thank you for building it!! Note, when I used it with brave browser the other day a login loop popup issue hit. But with safari worked fine. It is amazing seeing the demographic shift in my area, and how pretty much 30% of the area is foreign born.",
                "author": "telmnstr"
            },
            {
                "raw_content": "This is great work, I really appreciate the breakdown of apartment prices by size. One feature I'd love to see is a filter breakdown of all housing types between condos, townhomes and SFHs. My metro has a big mix of all of these within the different zip codes and they are all their own market dynamics. I know that this might be an issue with sourcing the data which contains this context.",
                "author": "CallerNumber4"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "ClockBench: A visual AI benchmark focused on reading analog clocks",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/bq2cczk8tmnf1.jpeg?width=1200&format=pjpg&auto=webp&s=dcb095e22081f641c22d285a02dedadb46d8cb00 Sample from the benchmark",
                "author": "Fabulous_Pollution10"
            },
            {
                "raw_content": "These models still don’t have robust reasoning about the physical world.",
                "author": "Curious-Adagio8595"
            },
            {
                "raw_content": "https://x.com/alek_safar/status/1964383077792141390 I feel like vision is the area that's most sorely lacking for LLMs. It doesn't matter if it can differentiate between a billion different bird species if a simple trick fumbles it. Vision and a world model is what I think are stopping LLMs from reaching their full potential. How good is a robot that can juggle chainsaws, knives and balloons at the same time if it can't walk a few meters? Asking it for out of box thinking, which I usually do, is mostly useless because it just doesn't have that real world sense that is needed to understand how things work together. If it can do all these word wizardry but fail simple visual questions then it's only as good as its weakest link for me. Big improvements in vision would be a game changer for cameras, especially if the cost is low.",
                "author": "CheekyBastard55"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Seahorse Paranoia\" is real.",
        "score": 123,
        "text_content": "[Context: There seems to be a meltdown with ChatGPT and seahorse emojis.](https://www.reddit.com/r/ChatGPT/comments/1n9vts3/does_a_seahorse_emoji_exist/) Turns out, I think it is Al cross-platform: For your entertainment, I present you Qwen3-Max-Preview seahorse meltdown. (Small world - I mean training dataset - huh?)",
        "comments": [
            {
                "raw_content": "This is pretty cool though. A real good example of self reflection. Thank you. I’ll try it out too. Edit: GPT-5 thinking said there is none. But it did search Reddit so it might have known about all this. GPT-5 instant has some paranoia but just not as much.",
                "author": "Advanced_Poet_7816"
            },
            {
                "raw_content": "Copilot had a similar breakdown, then asked if I wanted ASCII art of a seahorse. It gave me this. https://preview.redd.it/r7inue2zeonf1.jpeg?width=478&format=pjpg&auto=webp&s=c4ff3764a073e4c43894110ed2b30b59cb9389c8",
                "author": "Sirspen"
            },
            {
                "raw_content": "Can confirm, I just tried this out myself. Very interesting",
                "author": "FUThead2016"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk said that Optimus will create 80% of Tesla's value. Gen3 prototype will be available by the end of this year.",
        "score": 532,
        "text_content": "The Optimus v3's hand appears ready to serve as a bionic prosthetic for anyone who needs it.",
        "comments": [
            {
                "raw_content": "He also said he plays path of exile",
                "author": "jetstobrazil"
            },
            {
                "raw_content": "2028: “we’re pivoting to building hyperspace drives instead”",
                "author": "exbusinessperson"
            },
            {
                "raw_content": "https://preview.redd.it/8u0thpgooknf1.png?width=186&format=png&auto=webp&s=550a5ce13bb81b58adb4feb204156e979d6e7183",
                "author": "nel-E-nel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Research from Meta Superintelligence Labs. Big deal?",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If this technique actually works as well as this paper indicates, it’s a pretty nice improvement on RAG. Not going to get us to AGI or anything, but looks like you get sizable speed and context size improvements without trading off accuracy. We’ll have to see if further testing by other labs confirms the quality of this method.",
                "author": "topical_soup"
            },
            {
                "raw_content": "> without loss in perplexity Isn’t a higher perplexity a bad thing since it’s a measure of loss?",
                "author": "Vibes_And_Smiles"
            },
            {
                "raw_content": "[https://arxiv.org/pdf/2509.01092](https://arxiv.org/pdf/2509.01092) The paper.",
                "author": "ezjakes"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Dario Amodei believes in 1-3 years AI models could go beyond the frontier of human knowledge and things could go crazy!",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny how a year ago posts like this would be filled with comments like “feel the Agi”. Now every other comment is something negative.",
                "author": "eldragon225"
            },
            {
                "raw_content": "same dude who said 90% of code would be written by AI by now. dan melcher is not trustworthy",
                "author": "icecoffee888"
            },
            {
                "raw_content": "RemindMe! 3 years",
                "author": "CommandObjective"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gen A is growing up in a world where AI is synonymous with the internet.",
        "score": 58,
        "text_content": "In their mental map there are humans, animals, and AIs. It’s an always-on copilot. Parents say “just ask AI” when something’s unknown. Prompting and verification feel like basic skills, like reading a map. The “smart” kids don’t stand out for pure recall, they stand out for orchestration. Less “know the facts”, and more so “specify the task, judge the output, iterate.” The things that teacher's consider \"proof of understanding\" is shifting from final answers to kids who can explain the path to their solution. One concerning aspect is that many of them struggle with empathy. These kids practice empathy and power dynamics with agents that don't feel pain. Without guidance, it gets easy to treat people as instruments. Manners have also changed with AI machines. kids test power dynamics on a thing that can't be actually hurt. Some learn by practicing please/thank you. Some learn that ignoring or bulldozing works fine. Which lesson sticks depends a lot on adults modeling the difference. Another thing is that there is a widening gap between households who can afford subscriptions to AI tools. There is also great disparity between children of pro and anti-AI parents. Some grow up AI-literate, while other inherit the \"AI is bad\" mentality. There are arguments among them about which is the better, and the proportion of pro-AI students is rapidly becoming a majority. There remains a stark gap between parents that co-use the tech, and parents that either outright ban the tech or hand it over with no guidance to their children. Many of them also struggle with identity. Filters, face edits, and voice clones are present in their lives before a stable self-image is. Deepfakes, grooming attempts, and scams using cloned videos and voices, have made them hypersensitive and hyperaware about what is real or \"AI-generated\". Live streaming has seen an explosion in young viewership for the \"authenticity\" factor. Expectations are changing too. Kids ask “Can the AI come to the park with me?” and “Why can’t AI do X for me?” Their frustration tolerance is thinner. I think this is because things like \"make-believe\" used to be one-way. Now, the stuffed animal talks back to them, drawings animate and complete themsleves, game worlds expand on command, and anything feels possible. Creativity levels up, but patience gets less practice. They also start saying “we did it” instead of “I did it” when AI is involved. Many apps (not just social) now have an AI-bot they can interact with and generate content with. But there are real upsides in my opinion. It can be a patient tutor that can never get bored, an instant feedback loop that accelerates learning, and a creative multiplier.",
        "comments": [
            {
                "raw_content": "I think a lot of people want to ignore what AI could do to children’s development but humans really are quite adaptable, especially children who are sponges, and adaptation isn’t always good, that’s why we have “maladaptive” thinking too.. You give a kid an iPad and endless access to YouTube entertainment and they’re probably gonna have some problems with attention span, motivation, etc. You give a kid endless access to talk to ChatGPT and we don’t know what comes of that yet. Clearly in controlled, scholastic environments it can be augmenting and helpful, but without pretty careful monitoring I think the impacts are much less predictable.",
                "author": "garden_speech"
            },
            {
                "raw_content": "well it's not baked into EVERY PART OF DAILY LIFE from partying to cleaning toilets?",
                "author": "Professional-Stay709"
            },
            {
                "raw_content": "In speech act theory there is something called illocutionary force. This is all the ways we signal, which we speak or write, our subtle intentions at a pre-verbal and pre-rational level. Empathy is one such force in communication that can be expressed by words but often is contained by signals built into the words such as stress and tone. What exactly human beings are communicating at the illocutionary level is itself mysterious. This will be a new development since machines cannot do this well beyond life-coach like over-cliches. Will be sufficient for many, who will speak that language universally, whatever it is.",
                "author": "Tholian_Bed"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introductory Undergraduate Mathematics Benchmark(IUMB)",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/AcerFur/status/1964360057589485684 >The introductory undergraduate mathematics benchmark tests models on finding explicit values, constructions and counterexamples to problems testing various undergraduate-level concepts.",
                "author": "CheekyBastard55"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's 2025 and I cannot get the latest ChatGPT 5 or Gemini 2.5 Pro to organise a spreadsheet according to a template I provide.",
        "score": 9,
        "text_content": "Maybe office jobs are safe for a while to come. I must say I'm pretty disappointed. It can answer questions, but fucking SUCKS at doing any useful work in a damn spreadsheet. I'm asking for a super basic task that a primary school kid could do, and it fails over and over in so many ways. Edit: I basically have a spreadsheet organising daily info about diet, excessive, diary entries etc. It's currently one row per day with multiple columns. That's too long horizontally, I want it to be readable in portrait. I gave it a template where a day will take up multiple rows to better fit in A4 format. ChatGPT cannot do it at all. Not even close. I use thinking, also tried agents. It can technically edit spreadsheets and export in the format I need, but it's jumbled garbage no matter how I ask. Gemini is by far the best. It can't export any sheet formats, but it will organise it in a column that lets you send that to google sheets. But only sometimes! Other times you will get some other table that can't export to sheets, and it's just random. One time it got really close to doing it almost right, but then stopped half way. When I asked it to continue, it now does the rest differently... ffs.",
        "comments": [
            {
                "raw_content": "What are you trying to do exactly?",
                "author": "Seventh_Letter"
            },
            {
                "raw_content": "What's the year got to do with anything?",
                "author": "Any-Weight-2404"
            },
            {
                "raw_content": "Right now AI is a useful tool for making work easier, but you still have to check its work because it will make bizarre, foolish mistakes (and then double-down on those mistakes). It has to get a lot better than what it is currently to meaningfully replace people in my department. Not that companies wouldn’t just do it anyway out of greed. Given its foolish mistakes and refusal to admit mistakes were made, I’d say it’s upper management material currently.",
                "author": "spread_the_cheese"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Ultrasound system for precise neuromodulation of human deep brain circuits\"",
        "score": 35,
        "text_content": "[https://www.nature.com/articles/s41467-025-63020-1](https://www.nature.com/articles/s41467-025-63020-1) \"We introduce an advanced transcranial ultrasound stimulation (TUS) system for precise deep brain neuromodulation, featuring a 256-element helmet-shaped transducer array (555 kHz), stereotactic positioning, individualised planning, and real-time fMRI monitoring. Experiments demonstrated selective modulation of the lateral geniculate nucleus (LGN) and connected visual cortex regions. Participants showed significantly increased visual cortex activity during concurrent TUS and visual stimulation, with high cross-individual reproducibility. A theta-burst TUS protocol produced robust neuromodulatory effects, decreasing visual cortex activity for at least 40 min post-stimulation. Control experiments confirmed these effects were specific to the targeted LGN. Our findings reveal this system’s potential to non-invasively modulate deep brain circuits with unprecedented precision and specificity, offering new avenues for studying brain function and developing targeted therapies for neurological and psychiatric disorders, with transformative potential for both research and clinical applications.\"",
        "comments": [
            {
                "raw_content": "This has been studied for a while and has the potential to be a real breakthrough. There is already something called deep TMS (dTMS) which has been approved by the FDA for both depression and OCD, and it uses a magnetic coil to send pulses to specific brain regions. But it's very loud, and is not *nearly* as precise as ultrasound (US) can be. So people have been studying how they can use US to achieve the same results. I am hopeful that in several years' time (perhaps longer depending on regulatory roadblocks), many mental health disorders that are currently treated with many sessions of therapy and CBT or with lifelong medications that have a slew of side effects due to off target actions (like SSRIs), will be treatable with simple outpatient procedures. dTMS right now is applied as ~20-30 sessions over the course of a month or so.",
                "author": "garden_speech"
            },
            {
                "raw_content": "FYI, there is a [528hz version freely available online](https://www.youtube.com/watch?v=bOG0ZSgb9tU) that functions similarly as long as you are using headphones for the entire 60 minute duration.",
                "author": "TorchForge"
            }
        ],
        "subreddit": "singularity"
    }
]