[
    {
        "post_name": "New report regarding the mass shooting tonight at Nashua Country Club. A witness claims the shooter yelled “Free Palestine” before opening fire. If confirmed, it will add to a pattern of at least half a dozen violent attacks where the perpetrator used that exact phrase.",
        "score": 991,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, because that's how you convince people to see things your way, by opening fire on randos at a social event. Fucking retards.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Listen, if you want to free Palestine so bad you want to shoot people, I will pay for your ticket to Palestine and you can kill whenever you want when you get there.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "I am so sick of the violent left and the crazed Islamist \"free Palestine\" murderous a-holes.",
                "author": "Smurfection"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The REAL Superman, Charlie Kirk !",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a very hard time believing this post.",
                "author": "NADSAQ"
            },
            {
                "raw_content": "As an actual surgeon who has worked trauma cases on actual murder victims, I can 100% guarantee you this conversation is fictional. If he managed to talk to \"the\" surgeon \"who worked on Charlie\" (there would have been three), the only thing he would have been told is, \"I cannot comment. You are welcome to request the post-mortem report when it comes in.\" There is no surgeon on this planet who would risk his license and losing his liability insurance for the HIPAA and family firestorm that would explode on him if he opened his yap like this on any case, to say nothing of such a high profile murder. He would be buried up to his eyeballs in uninsurable tort claims for damages, infliction of emotional distress, and spoiliation of justice.",
                "author": "BoricuaPede"
            },
            {
                "raw_content": "\"I've seen wounds from this caliber many times\" said the surgeon who worked on Charlie. I know a Fed script when I see one.",
                "author": "fluffykitten"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump has announced he is awarding Dr. Ben Carson the Presidential Medal of Freedom! Well deserved!",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To my knowledge, Ben Carson never betrayed Trump. I wish he was still a part of the administration, although I suspect he may have turned an offer down.",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Dr Carson is a Role Model, loving mother raised him.",
                "author": "MeMargie"
            },
            {
                "raw_content": "&#65038; Can someone please take it away from that alleged vote rigger Ruby and her daughter. Maybe the U.S. Marshals? &#65038; Their possession of it belittles it's true value. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🙏🏼 I just want everyone to Pray tonight for Erika and for America.",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love you Erica and your family. ❤️🇺🇲❤️",
                "author": "NotADemThang"
            },
            {
                "raw_content": "Bless this young woman and her children. Bless this nation. And, God, please don't let Charlie die in vain. Guide us to do the righteous and strike down the evil in this world. 🙏",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "AmErika!",
                "author": "ReturnOfSmarm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shape up or ship out Bondi!!!",
        "score": 1739,
        "text_content": "",
        "comments": [
            {
                "raw_content": "PRESIDENT TRUMP PLEASE, please.... get rid of pam bondi and replace her with Senator ERIC SCHMITT from MISSOURI!!!",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "The \"it just takes time\" simps just got wrecked. We gave her time, she FAILED. End of story. Fire the do-nothing bitch and put in somebody who will actually do something.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "He's starting to push her - good.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOW: MASSIVE non-scalable fencing is going up around the site of Charlie Kirk’s memorial in Arizona, where 100K people are expect",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another \"mostly peaceful\" protest anticipated?",
                "author": "26magarat"
            },
            {
                "raw_content": "What makes that non scalable? Doesn't look particularly difficult to scale with a running start.",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "Attention Antifa, the Phoenix PD is not like the Seattle PD. They will knock out your teeth and curb stomp you. I am hoping for good vids out of this.",
                "author": "Pikes985"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pray for Safety!",
        "score": 1561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dig up that social media before the wipe!",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "Jeez, with those looks that guy really would have had me fooled. He looks like every cop I've ever met.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "[Same thing happened in 2024, Senate or House staffer was caught sneaking in ammunition to plant ahead of an event](https://www.zerohedge.com/political/democrat-staffer-carrying-ammunition-arrested-us-capitol). He was not intending to be a later suspect, he only wanted to drop off weapons or hide them so that someone else would come in there and do it. This happened when they did that bullshit about Trump not being eligible for SS detail because he wasn't the nominee yet when bitch ass Nimrata Haley stalled the R nomination for 2 months. There was also the RFK attempted shooting with a police officer with fake credentials was caught before he did anything.",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ABC shooter is Anti-Trump Anibal Hernandez-Santana. He previously worked as a legislative director for the California Federation of Teachers",
        "score": 1545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His whole X account is verbatim hate screed narrative of the enemedia. MSM script as if reading it from their own teleprompter.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Imagine that.... more leftist violence. Who would have thought?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Commiefornia Federation of Teachers. No surprise",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For any Pede's going tomorrow...",
        "score": 1437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember that we have to do this at a FUNERAL because leftists are TERRORISTS.",
                "author": "Region"
            },
            {
                "raw_content": "I wouldn't go anywhere near it, but I respect those who do. Stay safe everyone",
                "author": "Sea_Still"
            },
            {
                "raw_content": "I had my hopes up and read that as \"no bag limit\" on leftist terrorists. Silly me...",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CRAZY VIDEO from an Indian woman with dramatic sound effects - \" Who's going to run your Google and your Microsoft? If we all leave, who's going to run your tech industry? We literally run your country's economyyyy. You need us, silly beans, you need us.\"",
        "score": 1291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We don't need you. Go back.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Goddamn I would love a world with no Google or Microsoft.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Jeets have a GROSS inflation of their intelligence or worth. They're nowhere near as brilliant as they think they are.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Catturd: I can't take it anymore...",
        "score": 610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wondered how long the influencers would be patient. She should have never been put in that position.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "When even catturd finds his balls and disagrees with Trump, you know its gotten BAD!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Catturd is right. That woman is no good for that position right now. Get her out of there fast. Our time is limited.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shit is getting real, Trump publicly tells Pam Bondi: “JUSTICE MUST BE SERVED NOW”",
        "score": 887,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire her. Her past before this admin indicates that she is not going to help MAGA in any way at all. I'd happily deal with no AG for a couple months than to have pam for 3.5 years more. If he can fire her and then cram an actual new AG that's not like Barr or Bondi into the Trump Admin hirees backlog then DO IT.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Imagine that, he's realized what many of us did months ago. Fire that do-nothing bitch already!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Do. Your. Job.",
                "author": "rugburnd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP PUSHING PAM BONDI FOR ACCOUNTABILITY",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If I didn't just get fucked in the ass from H1B rape I would be excited about this do-nothing lip service",
                "author": "blockchain-the-vote"
            },
            {
                "raw_content": "7 months in and Goldilocks has done squat.She sucks.Traitors need hanging.",
                "author": "LibsRcrazy"
            },
            {
                "raw_content": "Stop your version of DEI hires Mr President",
                "author": "Salty_Sailor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Since the Senate has the nuclear option now might I suggest Matt Gates?",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want someone who's never been to DC in their life and owes no favors.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "Find the meanest, motherfucker you can find and ram him through.",
                "author": "brutustyberius"
            },
            {
                "raw_content": "Even with the option..too many GOP cucks would kill it",
                "author": "RandoBudster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Gavin Newsom's press office referred to the Secret Service for \"full threat assessment\" after they made this statement. \"Kristi Noem is going to have a bad day today. You’re welcome, America,\" Newsom's office said.",
        "score": 1810,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their cute little edgy implied threats need to fucking stop already once and for all. Make some examples out of these demons for a change.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Gavin is the gayest name ever, he has just about enough brain cells to not shit in the yard. Even a chicken has more intelligence as this gay lord.",
                "author": "Primebeef"
            },
            {
                "raw_content": "We need drug tests for politicians. We make factory workers and mail carriers and others take them. Newscum has been hopped up on something on camera a few times",
                "author": "gorilla_grip"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No liberal has EVER, had to sit quietly in a meeting or Zoom call and listened to conservative coworkers wishing death on President Biden or announcing openly how much they hate his voters and are glad they don't have to work with any. Conservatives in mainstream corps have had to do that daily.....",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "absolutely true. and really just any type of social environment in general. their propaganda bubble gave them the idea that they are by far the majority and that there aren't very many against them and the ones who are must be stupid and insane. because of this, they've had the idea that it's appropriate to spout off anything, at any time. we've had the opposite... large numbers of people gaslit into thinking there aren't many of us... or at least too afraid of retaliation to speak up. It may sound crass, though I don't mean it that way at all... but Charlie Kirk's murder has really set that dynamic off its kilter. There is a real opportunity to regain balance or even flip the dynamic on them. we've got to move on that, and hard.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "https://x.com/KeenanPeachy/status/1969441681914413213",
                "author": "SweetBeef"
            },
            {
                "raw_content": "very true too. I work in the SF Bay area. It was extremely commonplace to have to hear people hating on president Trump openly. But when it was Biden? I could only vent my frustrations to close friends.",
                "author": "CatsGoWoof"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No words",
        "score": 554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That moment of knowing you are going to die and being unable to stop it. You poor baby.",
                "author": "thisperson"
            },
            {
                "raw_content": "I hate seeing this. Every time I see it the video plays in my head. That guy was evil pure and simple.",
                "author": "StCharlie"
            },
            {
                "raw_content": "Poor sweet heart. We should have stood up long ago. WE are being killed for no other reason than the crime of being white. When will enough actually be enough? It enrages me and makes me SICK to my stomach.",
                "author": "Covfefe_And_Justice"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Flights from India to the US have surged to $4500 USD because of all the people on \"vacation\" coming back. Except they're not on vacation, they've been illegally working out of India once they secured their H-1B. You have to understand how utterly corrupt these people are.\"",
        "score": 1035,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s no longer an annual fee, and no longer applies to the H1Bs who are traveling. Fuck. https://ibb.co/mFGJpvW8",
                "author": "tallon"
            },
            {
                "raw_content": "I have worked in IT (database engineer) for more than 30 years at many of the top companies. Oracle, Symantec, Microsoft, etc. This has been an open secret for YEARS. Once an Indian gets into any kind of decision making position, they only hire their own and they do everything they can to drive Caucasians out. It's pretty obvious when you're the last white guy on the team and they're openly hostile to you so you want to leave on your own. Their friends go through diploma-mills for a fake degree, get hired for $50K in the US because \"we can't fill skilled IT roles for half price\" and then they work remotely from their shitty country using Google to answer basic tech questions. I've literally caught them doing it during screensharing sessions, the lack of skill and knowledge is shocking. They are in control of an entire companies database and can't help but fuck it up at every turn. They should never be allowed to touch a keyboard.",
                "author": "Sarcastic_Otter"
            },
            {
                "raw_content": "They probably wouldn't even stop those flights for bomb threats. Would they?",
                "author": "AfterGlow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🎙️ BREAKING: Maxine Waters has threatened to REMOVE President Trump from office.",
        "score": 1523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if diarrhea had a face..",
                "author": "TrumpPatriot84"
            },
            {
                "raw_content": "That is basically a call to assassinate Trump to her supporters.",
                "author": "SupFrens"
            },
            {
                "raw_content": "This infected hemorrhoid is still alive?",
                "author": "Overtaxed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Upvote: If Scam Bondi has to go. Downvote: If you want to cut your dick off.",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously, what is up with the Bondi simps around here? lol. She's done nothing to speak of to drain the swamp. We've been wanting the swamp drained since 2016 and we're tired of no results. Trump is pissed at her and so are the vast majority of us.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "What if you dont have a dick but want Blondi to go?",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "She was just as (in)effective as FL's AG. Can't stand her. Everything about her is the power she has to destroy businesses that don't do what she wants.",
                "author": "Erkme73"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel Arc Pro B60 24GB professional GPU listed at $599, in stock and shipping - VideoCardz.com",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the card Intel should have released instead of the gaming version(s). Took them 2 years",
                "author": "Rocketman7"
            },
            {
                "raw_content": "Far more than I expected them to come out at. Damn.",
                "author": "Zenith251"
            },
            {
                "raw_content": "Not worth it at $599, slightly worth it at $499 This has 1/2 the memory bandwidth of a 3090 and 70% the compute performance.",
                "author": "DistanceSolar1449"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Best $300~ GPUs, Radeon vs. GeForce",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looking back, the 20 series aged incredibly well",
                "author": "Healthy_BrAd6254"
            },
            {
                "raw_content": "If I didn't need a laptop I'd still be running the 2070. Was such a beast.",
                "author": "Malygos_Spellweaver"
            },
            {
                "raw_content": "I don’t get why AMD would rather push an 8GB 9060XT for like $230–260 instead of a 9070XT at $650. Pretty sure the 9060XT still costs them significantly more than half of what the 9070xt does to make.",
                "author": "Boring_Paper_3572"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[NuclearNotebook] Lenovo LOQ 15 Essential (Gen 9) - Nuclear Review",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great review as always and shit laptop as usual.",
                "author": "Afganitia"
            },
            {
                "raw_content": "This review is wank, its a cheap laptop so of course its got cheap materials. The hinges are fine the guy provides zero evidence to say three screws aren't enough and yes PCB can be used as structural components to some degree they are made out of fiberglass after all. Cheap laptop criticised for being cheap...worlds gone mad.",
                "author": "Plank_With_A_Nail_In"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jarrod'sTech - RTX 5050 vs RTX 4050 - The Biggest Win for RTX 50 Laptop GPUs",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: Laptops tested: 1) Lenovo LOQ 15 (2024): CPU: Intel Core i7-13650HX GPU: Mobile RTX 4050 6GB DDR6 (35-140W) RAM: 16GB (2x8GB) DDR5-4800 MT/s 2) Lenovo LOQ 15 (2025): CPU: Intel Core i7-13650HX GPU: Mobile RTX 5050 8GB DDR7 (35-115W) RAM: 16GB (2x8GB) DDR5-4800 MT/s Benchmarks: - 1080P 25 game average (Ultra, High and Very High settings), both GPUs at 100W: Mobile RTX 5050 8GB is 18.32% faster - 1440P 25 game average (Ultra, High and Very High settings), both GPUs at 100W: Mobile RTX 5050 8GB is 21.74% faster 25 Game Average: - 1080P: Mobile RTX 5050: 72.94 FPS Mobile RTX 4050: 62.31 FPS - 1440P: Mobile RTX 5050: 52.59 FPS Mobile RTX 4050: 43.82 FPS",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New Nintendo Switch owner POV",
        "score": 2441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rabbids involves Ubisoft, the other games don't, that's the answer",
                "author": "revcr"
            },
            {
                "raw_content": "I've returned to the Nintendo ecosystem after a long time with the Switch 2. There has been one little sale so far where Nintendo first party games were on sale, 30% off I believe. I got Mario Odyssey and 3D World.",
                "author": "uchuskies08"
            },
            {
                "raw_content": "To be fair, Rabbids is a pretty fantastic game.",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "hmm",
        "score": 240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're talking to Donkey Kong who just inhaled all of the bananas and shared them with no one lol.",
                "author": "Rubysage3"
            },
            {
                "raw_content": "Meanwhile, players a game that’s all about gold and bananas",
                "author": "Rent-Man"
            },
            {
                "raw_content": "Everyone knows that... https://preview.redd.it/x28xg6vtlgqf1.png?width=1170&format=png&auto=webp&s=86e7842aa949f04557b56c79c208cdc6012542d5",
                "author": "almacenedu"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Screenshots of Galaxy 2 Running on Switch 2",
        "score": 144,
        "text_content": "So I came across an article from a journalist who’s got to sample Mario Galaxy 2 on Switch 2 and included a couple screenshots. And honestly I’m quite impressed. The new textures absolutely pop in 4K, it looks notably better than it did running on Switch 1 in the trailer. I’m pretty impressed Article : https://www.pcmag.com/news/i-played-the-super-mario-galaxy-2-remaster-and-its-still-out-of-this-world",
        "comments": [
            {
                "raw_content": "yep, looks like super mario galaxy 2",
                "author": "PacketLoss-Indicator"
            },
            {
                "raw_content": "Man, these heavily compressed images look so good.",
                "author": "SPDIF_0"
            },
            {
                "raw_content": "Pretty sure these screenshots aren’t in 4K AND are even higher compressed than every other footage out there. That means we still have to see really Switch 2 footage.",
                "author": "Hue_Boss"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem seems to be cheaper on Nintendo Switch 2 compared to PS5 and Xbox Series X",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Resident Evil games are essentially permanently on sale on the e-shop, so I would consider waiting on this on if you are not absolutely willing to jump in day one",
                "author": "KaiHavertzhatewatch"
            },
            {
                "raw_content": "I hope the Switch 2 version is complete and ported well...",
                "author": "EpicQuackering437"
            },
            {
                "raw_content": "I might get this on Switch 2 if it's a good version. I don't have any reason to over PS5, but I like the idea of trying it out.",
                "author": "The-student-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How Do You Choose Where to Play Cross-Platform Games?",
        "score": 15,
        "text_content": "Hey everyone! For those of you who own a PS5, Xbox, or PC alongside a Switch 2, what factors do you consider when deciding which console to play cross-platform games on? I have a PS5 and I can never decide which platform to play cross-platform games on. Thanks! :)",
        "comments": [
            {
                "raw_content": "If quality is the same I’ll buy it on Switch 2 so I have the option of handheld. Otherwise I’ll buy it on PS5 usually unless Xbox is cheaper",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "Scale of game? Long jrpgs are ideal on portable. Some games I'll risk it: Like Cronos can't run that poorly? Re9 - might as well stick to ps5. Odds are I get the open world and fighters on switch 2 are low.",
                "author": "Merisssss"
            },
            {
                "raw_content": "I got a PS5, PC and Switch 2. I play most games especially triple A games on PS5 especially if I plan to platinum (100%) the game. I only use Switch 2 for Switch 1/2 exclusives or games that are only PC/Switch but have Switch physical copies (so I can trade in when i'm finished with it as I typically do not replay games). I choose PC if its on Game Pass or if the specific game is a lot cheaper on Steam and if I don't plan to platinum it.",
                "author": "DivinityLight"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Radeon RX 9070 flashed with XT BIOS gets up to 10-20% boost",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMAO. an article about a reddit post",
                "author": "_sendbob"
            },
            {
                "raw_content": "Somehow, Vega 56 returned",
                "author": "Aarondo99"
            },
            {
                "raw_content": "Saving you a click: https://www.reddit.com/r/radeon/s/8NLhxTwb9y",
                "author": "gblandro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "2017 vs 2025",
        "score": 28,
        "text_content": "I was a day one Ryzen owner . Used to have an MSI Tomahawk with a R7 1700 and 16 GB of ram with a Watercooled GTX 1060 6 GB . Now in 2025 is a R7 5800x , 32 GB of Ram and a RX 9070 16 GB . Waiting for AMDs next CPU to upgrade from AM4 , what a goated Generation it was !",
        "comments": [
            {
                "raw_content": "That perfectly circle shaped dust on the radiator! How is it so fucking perfect in its shape!? The AM4 has served us well. I went from 1600 around launch and had that thing abused for years until i got 5600 and then a 5800x3d which i will abuse what feels like forever because of how good it is. Also recently paired it with 9070xt as a perfect combo.",
                "author": "WeirdoKunt"
            },
            {
                "raw_content": "Am4 is definitely one of the best generations till now. Used a 1600->3600-> 5700x3d and will just use it for the foreseeable future. The 5700x3d is a beast.",
                "author": "the-legit-Betalpha"
            },
            {
                "raw_content": "Love posts like this. Have you changed your AIOs coolant or added more to it? Other than that, amazing! Really cool you kept the case.",
                "author": "FrequentWrangler1439"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lennar, America's 2nd largest builder, has cut their average selling price 22% from the pandemic peak. And their most recent quarter's net sales prices is now lower than pre-pandemic",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep in mind they also throwing in ton of incentives my colleague bought new home last month and they offered over 50k in free upgrades along with a lower rate lockdown. This allows them to not cut home prices severely. Unfortunately those who bought new homes few years ago and have to sell are still in bad spot as they now have to compete with their home builder (often still building in same subdivision).",
                "author": "Dmoan"
            },
            {
                "raw_content": "here in san diego they build on landfills so good, hope they suffer",
                "author": "shadowmoses45"
            },
            {
                "raw_content": "This is true, and now they’re selling for less than used houses. But still, I toured some and they were just not for me. Granted, I’m sure there is a lot of variation. But I don’t really want to feel like I’m living in a high-end bar.",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tracking the inventory since October 2024",
        "score": 15,
        "text_content": "[Inventory](https://preview.redd.it/qfzup7nk2fqf1.png?width=900&format=png&auto=webp&s=a29154ca666803251e080407d73e339bc0ca2da2)",
        "comments": [
            {
                "raw_content": "I appreciate that you broke out the Apple II and Visicalc.",
                "author": "debauchasaurus"
            },
            {
                "raw_content": "Went looking at open houses today and in our region 3 of the 4 homes we looked at had offers at or over asking before their Sunday open house. It’s demoralizing 😭",
                "author": "P0ETAYT0E"
            },
            {
                "raw_content": "During the period spanning last 12 months, there were a total of 4.5 million unique listings, of which 1.6 million are still on the market. This suggests that sales over the past 12 months should be under 3 million, which, I guess historically would be quite low.",
                "author": "Cool-Transition-21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Prices are dropping: is now a good time to buy?!?",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "for REBubble No for Real Estate Investors Yes",
                "author": "Beginning-Fig-9089"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "xAI hired google deepmind core team member",
        "score": 22,
        "text_content": "Looks like Elon hired an actual 100x AI scientist. Part of the equity package must have been made up of gpus 🤣 https://x.com/dustinvtran/status/1969183617881686405?s=46",
        "comments": [
            {
                "raw_content": "Probably gets unlimited access to the Grok waifu.",
                "author": "peakedtooearly"
            },
            {
                "raw_content": "This is a strong hire for xAI. Bringing in core talent from DeepMind suggests they’re serious about pushing research forward, not just scaling compute. It’ll be interesting to see whether the focus is on fundamental breakthroughs or more applied competition with OpenAI/Google/Anthropic.",
                "author": "Physical-Reception23"
            },
            {
                "raw_content": "Deepmind still wins in the end.",
                "author": "EmptyRedData"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "An AI Stan Lee Hologram Will Speak With Fans at L.A. Comic Con",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m sure that will go over well.",
                "author": "MR_TELEVOID"
            },
            {
                "raw_content": "I think it's pretty shitty. Just leave dead people as they are, profiting off of them when they no longer have a say is fucked up. Even if their estate is cool with it, personally I still think it's wrong.",
                "author": "ExoTauri"
            },
            {
                "raw_content": "This sounds so fucking dumb and stupid. Let's see how many people on here love this idea lol.",
                "author": "Funkahontas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Albania's new AI minister delivered a bizarre address to parliament: \"I am not here to replace human beings... I have no ambitions.\"",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That sounds like exactly who should be in change of a government. No ambitions No payoffs No bribery No grift No fraud No rip-offs No extortion No gangs And no mafia",
                "author": "Puffin_fan"
            },
            {
                "raw_content": "I mean, I guess we get to see how this goes.",
                "author": "Princess_Actual"
            },
            {
                "raw_content": "What in the Command and Conquer cinematic is this",
                "author": "funky2002"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Zuck explains the mentality behind risking hundreds of billions in the race to super intelligence",
        "score": 385,
        "text_content": "Video from this twitter link: https://x.com/amitisinvesting/status/1969094789942718858",
        "comments": [
            {
                "raw_content": "If superintelligence is going to emerge, the last place it should come from is a company that treats humans as raw material for the algorithm.",
                "author": "_Divine_Plague_"
            },
            {
                "raw_content": "It's the classic prisoners dilemma. No one can stop as the payout matrix is essentially god or death.",
                "author": "benl5442"
            },
            {
                "raw_content": "In this clip he also talks about how OAI and Anthropic have more risk since they are relying on investor money as opposed to more of their own money like meta, and the fact that meta has other non-AI business, whereas they don’t. However, I’d imagine the worst possible thing that could happen to them if there is some kind of significant AI/macroeconomic slowdown is that they get bought out by the big tech companies already bankrolling their datacenter buildout.",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4 fast with 2M context window is available!",
        "score": 364,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was the Sonoma stealth model on OpenRouter btw [https://x.com/OpenRouterAI/status/1969185510641058245](https://x.com/OpenRouterAI/status/1969185510641058245)",
                "author": "kernelic"
            },
            {
                "raw_content": "I like that direction a lot. LLMs don't have to be expensive. Fast, cheap, powerful, add low cache read cost and it will flip the economics of companies like Lovable, Replit, and many businesses building on top of APIs overnight.",
                "author": "FullOf_Bad_Ideas"
            },
            {
                "raw_content": "Looking forward to needle in a haystack benchmark results. 2M context window is just marketing fluff without them.",
                "author": "Active-Play7630"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Deep researcher with test-time diffusion\"",
        "score": 75,
        "text_content": "Hate to help GDM toot its own horn, but this is interesting: [https://research.google/blog/deep-researcher-with-test-time-diffusion/](https://research.google/blog/deep-researcher-with-test-time-diffusion/) \"TTD-DR is designed to take a user query as input and then create a preliminary draft that serves as an evolving foundation to guide the research plan. This evolving draft is iteratively refined using a denoising with retrieval process (report-level refinement) that takes the information it finds and uses it to improve the draft at each step. This happens in a continuous loop that improves the report with each cycle. To top it all off, a self-evolution algorithm constantly enhances the entire process, from the initial plan to the final report. This powerful combination of refinement and self-improvement leads to a more coherent report writing process.\"",
        "comments": [
            {
                "raw_content": "Google will certainly be the winner on deep research.",
                "author": "Vegetable_Yak202"
            },
            {
                "raw_content": "So where is this available to the public? Gemini?",
                "author": "donotapologize"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"“AI will kill everyone” is not an argument. It’s a worldview.\"",
        "score": 52,
        "text_content": "Another response to Yudowsky: [https://www.vox.com/future-perfect/461680/if-anyone-builds-it-yudkowsky-soares-ai-risk](https://www.vox.com/future-perfect/461680/if-anyone-builds-it-yudkowsky-soares-ai-risk) \"A worldview is made of a few different parts, including foundational assumptions, evidence and methods for interpreting evidence, ways of making predictions, and, crucially, values. All these parts interlock to form a unified story about the world. When you’re just looking at the story from the outside, it can be hard to spot if one or two of the parts hidden inside might be faulty — if a foundational assumption is wrong, let’s say, or if a value has been smuggled in there that you disagree with. That can make the whole story look more plausible than it actually is.\"",
        "comments": [
            {
                "raw_content": "I really liked asteriskmag's review of this book. [More Was Possible: A Review of If Anyone Builds It, Everyone Dies](https://asteriskmag.com/issues/11/iabied) Yudkowsky's core argument that AI will likely go FOOM in a matter of seconds or hours was predicated on hand-crafted solutions if you read his early work on AI safety, it really does not line up with how contemporary AI works. The AI 2027 scenario is a lot more plausible given the systems we're building, and that take-off speed still gives us a lot of time (measured in months) before something dangerous comes online. It's still a very dangerous situation, mind you, but it gives us plenty of time to react and assess. The real question is whether we'll make the right choices during that critical period.",
                "author": "Mindrust"
            },
            {
                "raw_content": "the single best thing yudkowsky did was to play such an instrumental role in getting the best frontier labs started (even pushing thiel to fund the world’s first agi startup, deepmind), thereby further accelerating progress. for that, I am very grateful. now, in the endgame, he works even harder to undermine the doomers’ credibility. credit where credit is due.",
                "author": "c0l0n3lp4n1c"
            },
            {
                "raw_content": "Whatever it is, it's a legitimate possibility. I don't care how many people downplay it. The possibility is, though remote, legitimate.",
                "author": "WhenRomeIn"
            }
        ],
        "subreddit": "singularity"
    }
]