[
    {
        "post_name": "Samsung and SK Hynix are jacking up DRAM prices by as much as 70 percent",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The price hike is hitting Big Tech particularly hard They're the ones causing the fucking hike. The price doesn't matter to them, it's all magic mystery money that they're spending.",
                "author": "jenny_905"
            },
            {
                "raw_content": "I wonder how the budding handheld gaming industry is gonna navigate this DRAM/NAND situation... Stuff like the AYN Thor looks really cool, but I cannot imagine that the economics are gonna make any sense once prices reach an (as of yet undetermined) equilibrium",
                "author": "BigCityNewcomer"
            },
            {
                "raw_content": "I can survive temporary price increases until the situation stabilizes, but I fear one thing: the old prices will never return. Just like with GPU prices.",
                "author": "bonwerk"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake with Arc B390 takes on AMD Ryzen Strix Halo and GeForce RTX 4050 in our first gaming benchmarks",
        "score": 87,
        "text_content": "> Our comparison shows that the Intel Arc B390 can exceed the gaming performance of the AMD Radeon 890M by more than 80% in some games. Compared to the older Arc 140T, the Arc B390M is nearly 80% faster in certain titles. In Baldur's Gate 3, the iGPU delivers virtually the same performance as the dedicated Nvidia GeForce RTX 4050 Laptop GPU, but in Cyberpunk 2077 the Nvidia graphics card is 20% faster. AMD’s powerful Ryzen AI Max+ 395 with Radeon 8060S is twice as fast at times, although the chipset is also larger, more expensive and less power efficient.",
        "comments": [
            {
                "raw_content": "Solid product, nice foundation. Improve ST and intel will comfortably keep their mobile market",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "Strix halo is a commercial failure. Too expensive for any meaningful customer to adopt and have real mainstream products. Intel couldn't care less about that, they just need to be better than 890M and the game is done.",
                "author": "FitCress7497"
            },
            {
                "raw_content": "This is against a 50W TBP RTX 4050 Laptop (which should be more at ease around 90-100W) Not saying it's bad, but you can't compare Laptop performances without including TDP configuration and behavior.",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "dexxIT, together with ZTE, is bringing CXMT memory to Germany for the first time",
        "score": 16,
        "text_content": "German company dexxIT announced that it will be shipping AMD EPYC 9124–based servers equipped with 24 modules of 64 GB DDR5-5600 RAM made by CXMT. This makes dexxIT one of the first distributors to bring CXMT’s products to market Machine translation available here: https://www-dexxit-de.translate.goog/dexxit/dexxit-bringt-zusammen-mit-zte-erstmals-cxmt-speicher-nach-deutschland/?_x_tr_sl=de&_x_tr_tl=en&_x_tr_hl=en-US&_x_tr_pto=wapp",
        "comments": [
            {
                "raw_content": "Personally I‘m interested to see how their product is gonna perform, especially in regards to timings and sub-Timings. Hoping we get some crazy sys admins trying to OC these at some point The press statement also talks about quick delivery times, indicating decent availability",
                "author": "ThePresident44"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hands-On with DLSS 4.5 vs 4 Image Quality & 6X Dynamic Frame Gen",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looking forward to Tim’s full breakdown of DLSS4.5 upscaling. His recent DLSS/FSR/XESS analyses have been the gold standard for judging the gains, regressions, and comparisons of these techniques. That said, DLSS4.5 feels significantly more complex to evaluate properly. DLSS4.0-4.5 feels like a far messier transition than DLSS3-4.0, there's highly variable frametime cost depending on not just input/output res but GPU architecture as well, the per-game image quality improvements/regressions compared to DLSS4.0 seem wildly inconsistent, there's that odd pseudo-oversharpening artifact especially noticeable at 1080p, it's all rather unintuitive now compared to the rather simple duality of DLSS3CNN vs DLSS4-T. And so on. Hoping the full video manages to cover all these nuances.",
                "author": "KekeBl"
            },
            {
                "raw_content": "Glad to see Tim defend the concept of bumping frame interpolation ratios from 4 to 6 for 500Hz+ monitors. It's not surprising given his knowledge of motion portrayal coming from his experience testing monitors including very high refresh rate ones. But it's nice to see integrity where it would have been easy to pander to the audience and shit on frame generation.",
                "author": "2FastHaste"
            },
            {
                "raw_content": "I feel blessed for not able to really noticing the artifacts caused by both upscale and framegen, even with \"shitty\" FSR3. Sure if I intentionally look for it I can find it, but as soon as I play the game, all of that is no longer noticeable to me. And the input lag, as long as the base frame is good enough (around 45+ for me), framegen feel just as good as native.",
                "author": "ghostsilver"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] TSMC Reportedly Plans Mature-Node Tool Shift to Singapore, Accelerates Exit as Arizona Expands",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mature Node seeks experienced Asian benefactor for long term financial arrangement",
                "author": "scene_missing"
            },
            {
                "raw_content": "Are they diversify away from Taiwan? Or they were forced to move?",
                "author": "jwang274"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TweakTown] Minisforum BD395i MAX motherboard at CES 2026: built-in AMD Strix Halo APU, use your own GPU",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't see the point unless you really need an AI machine that can also game better? Get an X3D chip on AM5 if you're going with a dGPU.",
                "author": "kikimaru024"
            },
            {
                "raw_content": "Come to papa. So basically we just need to add a mini-itx case and power supply.Let's hope they don't go too crazy with pricing.",
                "author": "fatso486"
            },
            {
                "raw_content": "Only seeing the 128GB option for this board, so probably going to cost 2k+ with today’s memory chip prices. I already have the Strix Halo chip (Evo-X2) running a 5080 via OcuLink on the 2nd M.2 adapter. This gaming setup is 4K Heaven, and chews through MOE LLMs on the side. Honestly the onboard graphics 8060s is going to be more than fine for most people, I was playing 4K at 100+ fps (DLSS, FG, No RT) and it felt great. Then I tried Path-Tracing in Cyberpunk with the 5080 and couldn’t go back.",
                "author": "toomanypubes"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thunderobot Launches ZERO Air Gaming Laptops with Intel Panther Lake at CES 2026 [TechPowerup]",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the absolute fuck, this title is absolutely terrible lol, most confusing title I’ve seen in a while. It’s not that Thunderobot is not using Panther Lake, launching 0 models with the processor. They launched a new line of laptops using Panther Lake called ZERO…..",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "No pricing? Panther lake seem promising, and if it can get microsoft to fix up random OS level issues, I can see intel getting a bit of a centrino moment in the laptop space. Maybe intel can borrow a page from qualcomm's book and do something about the poor quality cam and mics often found in mobile devices.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "damn, a 15 inch laptop that only weighs 1.58kg which brands usually sell Thunderobot's laptops? really hope they sell the Air....",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "XIKII INDUSTRY FF11 Hardware Exhibition Test Bench Improvement Update",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo's official website confirms that Animal Crossing: New Horizons will get a free Switch 2 upgrade alongside the Nintendo Switch 2 Edition. It will increase resolution ONLY in portable mode.",
        "score": 412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Almost every switch 1 game should get this exact update. 720p stretched to a 1080p display just looks plain bad. It rendering at 1080p directly instead is gonna be a big improvement. Luckily Animal Crossing didn't already use upscaling on the switch 2, otherwise it would have looked horrible instead of just bad (looks at the Xenobalde games which _still_ haven't got an update to fix the handheld resolution)",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "Wait, free upgrade increases resolution in handheld only but paid increases resolution in docked and handheld?",
                "author": "temporary_location_"
            },
            {
                "raw_content": "Honestly what are Nintendo doing with their switch 2 upgrades, some are free, some are gate kept behind extra content costing more and some are half and half. I still can’t believe so many 1st party games don’t have updates either.",
                "author": "Dry-Cod9127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This would be my ideal version of the new joycons",
        "score": 121,
        "text_content": "I get that they want to differentiate the aesthetic from the Switch 1 and make it seem more mature, but not being able to see the colors on handheld besides the very little near the driftstick is a lil underwhelming. A minimalist gradient looks so much better and true to Nintendo while still feeling \"mature\" and classy.",
        "comments": [
            {
                "raw_content": "Now this I could get behind, do hope they go in this direction for the immediate Future.",
                "author": "Sea_Macaron_8789"
            },
            {
                "raw_content": "Color would fade on the controller, but the stark change to black would clash IMO with the console. I'd prefer solid colors for the buttons, black controllers. No fading anywhere. These are still cooler than what we have though lol",
                "author": "Fresh-Chemical-9084"
            },
            {
                "raw_content": "I would love it if also the buttons were in color.",
                "author": "SomewhatOptimal1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Will 2026 be the year?",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably gonna get insanely downvoted, but I feel the future of Star Fox should derive from Adventure and becoming something similar to Star Wars Outlaw.",
                "author": "Most-Handle9776"
            },
            {
                "raw_content": "Maybe I mean Look how long it took For another 3d donkey Kong Or the second Kirby air riders If Mario basketball gets announced this year Anything is oossibke",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "I sure hope so and if it isn't they should at least add the GameCube games to NSO this year",
                "author": "Mitchell231190"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Nintendo Switch 2 home",
        "score": 13,
        "text_content": "Our friend just made me the Link and Zelda crochet stuffies!",
        "comments": [
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "RDR1 looks great on Switch 2!",
        "score": 29,
        "text_content": "I just tried it, and the graphic doesn't look like the game from 15 years ago, also the frame rate is very stable. Definitely worth trying.",
        "comments": [
            {
                "raw_content": "I really love this era of graphics. Something about how detailed it was but the world wasn't cluttered by filler set dressing objects.",
                "author": "effhomer"
            },
            {
                "raw_content": "Keep seeing these screenshots and now need to buy.",
                "author": "dirtyoldmonk"
            },
            {
                "raw_content": "It runs at 720p DLSSed via 3.xx CNN to 1440p. at 60fps. Which actually ends up looking slightly better than native 1080p in this game style.",
                "author": "Many_Mechanic_1886"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Any hatsune miku fans? I would love a specially edition like this",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Me! Me! Would love those to be real",
                "author": "FIFTY_PES0"
            },
            {
                "raw_content": "I don't know what that is but these colors are sick",
                "author": "theclawl1ves"
            },
            {
                "raw_content": "Ooo, can the inner part that slots into the switch have the light grey from her shirt?",
                "author": "Untitled_One-Un_One"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Larian confirms Baldur's Gate 3 port on Switch 2 is NOT happening: \"we would have loved to but it's wasn't our decision to make.\"",
        "score": 403,
        "text_content": "Source, the AMA from today: https://www.reddit.com/r/Games/comments/1q870w5/comment/nylkog6/?context=3",
        "comments": [
            {
                "raw_content": "They’ve been pretty clear they’re done with BG3, they don’t own that IP. If anything it was a great job to get more eyes on their own series, which I actually prefer. Fun to play outside the D&D ruleset a bit",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "That's so unfortunate :(",
                "author": "Gleerok99"
            },
            {
                "raw_content": "I have an XBSX and PS5 but really wanted BG3 to be on Switch 2. I struggle to commit to huge games that I can’t take with me on the go, so I’ll have to pass on it which really sucks.",
                "author": "Toribobs"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 01/05/26❄️",
        "score": 53,
        "text_content": "[Kadoosh, Kadoosh, Kadoosh...](https://pbs.twimg.com/media/G-NNK5lXsAAD9uA?format=jpg&name=medium) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Microsoft eyes major January layoffs (between 11k-22k roles) as AI costs rise — Reports from workers point to Azure cloud teams, the Xbox unit, and global sales as key areas of focus.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6712z/microsoft_eyes_major_january_layoffs_between/) * [NVIDIA to announce DLSS 4.5 tomorrow, with “Dynamic Multi Frame Generation” & “2nd Gen Transformer Model”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q4lrva/nvidia_to_announce_dlss_45_tomorrow_with_dynamic/) * [New Vegas remake planned.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6h3fh/jez_new_vegas_remake_planned/) * [Potential GTA 6 plot leak](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q775cn/potential_gta_6_plot_leak/) * [Fallout 3 Remaster is a planned release](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6fi7t/natethehate_fallout_3_remaster_is_a_planned/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Just want to say I am so excited about fable, I remember looking at rumors back in 2018 about a possible reboot !",
                "author": "CartographerOk4564"
            },
            {
                "raw_content": "i rlly hope Stranger Than Heaven is this year",
                "author": "ZEKE307"
            },
            {
                "raw_content": "I’m going to be eating a double cheese burger later",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden [Xboxtwo]: Age of Empires is going to back in a big way\". Next title is under development with Unreal Engine due the difficult to adapt Essence Engine (proprietary Engine of RELIC Entertainment) to Age of Empires. Microsoft is interested to bring back StarCraft as RTS.",
        "score": 167,
        "text_content": "Source [https://www.youtube.com/live/-iRcYtswLDw?si=9H2V4m4beKIWO-vF](https://www.youtube.com/live/-iRcYtswLDw?si=9H2V4m4beKIWO-vF) (From 2:11:00 - 2:14:00) A really interesting episode of Xboxtwo by Jez Corden and he corroborate the recent rumors on next Age of empires title and also something info about the new StarCraft game, a third persone shooter: according to Jez who has seen a gameplay video, It looks Amazing and It could remind Space marine. About Age of empires and XBOX's efforts on Real time strategy Games. i don't know a great deal but i will say this \" i think it's being developed on Unreal Engine because one of the big issues they had with Age Of Empires 4, from what i heard, was Relic's Engine and this engine and development pipeline was very difficult for them to work with and to adapt to the Age of empires, what people expect from Age of Empires. So they (World's Edge) are moving to something more proprietary built on Unreal Engine though. Something more custom and things like that. i don't know who's building it but at least the bones are being made by World's Edge Studios. I would presume they're going to partner with another developer on it\". Again \"\"Age of Empires remains one of Microsoft's most prolifics IPs and they've really cornered that niche, the whikw real tielme Strategy that it doesn't have the same popularity that it did back in the day. But as Xbox moves deeper into PC gaming i do think like Age of Empires and games like it are definitely going to be a Major part of their purview. And another thing i'll say by the ways, is that they are interested in also bringing StarCraft back as an RTS altough the next StarCraft i expect will be the third person shooter wich i've actually seen gameplay footage of the next StarCraft and it looks stunning. if you enjoy games like Space Marine , the StarCraft fans are going to gave a lo look forward to. But they want to bring back StarCraft as an RTS as well. Microsoft obviously wants to continue cornering the RTS audience. Age of Empires is still a big deal for Microsoft and it's going to back in a big way\".",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Listen, free money = Age of Middle Earth.",
                "author": "burohm1919"
            },
            {
                "raw_content": "I am just waiting for them to put Warcraft 3 and Diablo 1,2 on Steam.",
                "author": "Demistr"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fallout New Vegas Remastered releasing imminently?",
        "score": 336,
        "text_content": "I got a reddit ad from BethesdaUK. It lists fallout games to start off with. Under New Vegas the platforms say PlayStation 5 and Series X. It is technically on Series X via backwards compatibility so that can be explained away but it's not on PlayStation 5 at all. https://www.reddit.com/user/BethesdaUK/comments/1q78ev9/guide_which_fallout_is_right_for_you/?p=1&utm_source=share&utm_medium=android_app&utm_name=androidcss&utm_term=1&utm_content=1",
        "comments": [
            {
                "raw_content": "What's interesting is that the ad just says \"Fallout: New Vegas\" Not Remastered or anything 🤔",
                "author": "kranitoko"
            },
            {
                "raw_content": "The PS3 version can be cloud streamed on PS5",
                "author": "drumjolter01"
            },
            {
                "raw_content": "I saw this a couple weeks ago... its nothing.",
                "author": "dreadsilence1000"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[NateTheHate] Larian would love to port Baldur's Gate 3 to Switch 2 but it's not happening due to \"not healthy relationship with Hasbro/Wizards of the Coast\"",
        "score": 948,
        "text_content": "Source: https://xcancel.com/NateTheHate2 >This is the unfortunate truth. >While Larian would love to bring Baldur's Gate 3 to the Switch 2... their relationship with Hasbro/Wizards of the Coast is not healthy. >Late last year, I heard BG3 for SW2 was not happening; but needed more sources to verify.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Have to click on the link to see what Nate is referencing, but the primary source is Larian themselves, from their Reddit AMA: https://www.reddit.com/r/Games/comments/1q870w5/comment/nylkog6/",
                "author": "Yamcha_is_dead"
            },
            {
                "raw_content": "Swen confirmed the was no BG3 Switch 2 port coming, but he didn't really say why. Nate added \"their relationship with Hasbro/Wizards of the Coast is not healthy.\" It depends on how you take the \"not healthy\" part, but it may imply there was more tension behind the scenes, rather than a mutual parting of ways.",
                "author": "VistaVick"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Playground Games is working on an undisclosed project (probably not Fable or FH6)",
        "score": 242,
        "text_content": "Spotted this on linkedIn. Jonathan Baker, an animator working at playground games, lists his current work as an **undisclosed project.** Since he just joined the studio this month, it's likely a third project or DLC (for FH6 or Fable). **Source:** [https://www.linkedin.com/in/skellybobbly/](https://www.linkedin.com/in/skellybobbly/)",
        "comments": [
            {
                "raw_content": "His description says \"Available March 26\". Maybe this means he is working with a short contract to finish FH6? Edit: could be working on live service stuff. It says its a contract for Playground games starting Jan 2026, and is for animation work. Or maybe just to make promotional stuff like trailers up to release. Those kind of things don't really need much familiarization with game engine, and would make sense for a short contract.",
                "author": "nukleabomb"
            },
            {
                "raw_content": "Crossing fingers for Table.",
                "author": "ThemosttrustedFries"
            },
            {
                "raw_content": "It is a trailer for either FH6 or Fable. Jonathan Baker does trailers. I doubt Playground Games has the capacity to start a 3rd project already, they have 400 employees, not all are developers and they are still working heavily on Forza Horizon 6 and Fable. It is an \"Undisclosed Project\" because the trailer hasn't been released yet.",
                "author": "Optimal-Fox-3875"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Talked with Jez Corden About Prototype IP, he denied it",
        "score": 0,
        "text_content": "Jez Corden:There's currently no plans for the Prototype IP as of right now, anyone who claims otherwise is sadly misinformed. Need to point that prototype subreddit modder partly against the conclusion that credits update meaning something about this franchise https://xcancel.com/DailyDeatholder/status/2009247584360059187#m",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "There’s really been no indication otherwise.",
                "author": "SoldierPhoenix"
            },
            {
                "raw_content": "Kinda nuts to me if no one comes up to do something with it, considering how much superhero(or antihero ig) media is popular in general rn.",
                "author": "ExAshura"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xe3P Nova Lake integrated graphics reportedly 20-25% faster than Panther Lake's - VideoCardz.com",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Panther lake igpu is already very good. 20-25% on top of that will be insane.",
                "author": "benjhoang"
            },
            {
                "raw_content": "2026 CES just completed And we are now getting rumors of a 2027 iGPU... talk about a time wrap",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Meanwhile Medusa Point (zen 6, 2027) is rumoured to use rdna3.5 with _REDUCED_ CU count btw",
                "author": "996forever"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Introducing the ASUS NUC 16 Pro - Faster, Smarter, More Secure for the AI-Driven World - Featuring up to Intel Core Ultra X9 CPU, up to 96GB LPDDR5X 9600 MT/s, up to Arc B390 GPU, NPU 5, Dual Fan Cooling, Dual LAN, Dual SSD, WiFi 7, BT6, Quad Display, vPro & fTPM 2.0",
        "score": 20,
        "text_content": "https://preview.redd.it/gl52we6qxdcg1.png?width=1920&format=png&auto=webp&s=e1b3d54a7f82a62dae94d954a74bc518dc809773 The new ASUS NUC 16 Pro is our fastest, smartest, and most secure commercial Mini PC yet. Powered by up to Intel Core Ultra X9 Series 3 Processor, it delivers up to 180 Platform TOPS to handle next-generation workloads in machine learning and data analytics. Its LPDDR5x memory is up to 33% faster than the previous generation for greater efficiency. With Dual 2.5G LAN ports, Intel Wi-Fi 7 connectivity, and a tool-less chassis for instant upgrades, the NUC 16 Pro ensures easy management and minimal downtime. Built with dTPM security and tested to U.S. MIL-STD-810H military standards, it sets a new benchmark for compact, secure, and AI-ready computing. With a slightly larger 5x4 chassis size, the ASUS NUC 16 Pro can focus on providing more cooling, dual M.2 slots, and dual LAN ports for higher and more sustained performance. The new ASUS NUC 16 Pro features a Dual-Fan cooling design, a dedicated DIMM fan (65W model), three heat pipes, and fin arrays on each side. https://preview.redd.it/tg8p2h4eydcg1.png?width=1920&format=png&auto=webp&s=328c7e08490fe172cbd1c6f6877545411db44412 We've discussed this before, but one reason to trust ASUS NUC products is because we put each NUC through a comprehensive testing process to test and back it with a 3 year warranty. This process involves system temperature and humidity testing, drop testing, and vibration testing. We also take a representative sample size of units and put them through simulation testing at 40C for 90 days to reach over a 50K hours MTBF. This leads to a low return rate of just 1%. For more information about the testing process and how we ensure outstanding durability and performance, please visit [https://www.asus.com/content/nuc-quality-test/](https://www.asus.com/content/nuc-quality-test/) **Key Features:** * **AI-Accelerated Hybrid Performance -** Unleash next-gen AI workloads with Intel Core Ultra X9, 12 Xe GPU cores, and NPU 5. Hybrid XPU architecture delivers up to 180 Platform TOPS, optimized for real-time Edge AI inference and machine learning tasks. * **Next-Gen Speed & Efficiency -** Up to 96 GB LPDDR5x 9600 MT/s, delivering up to 20% faster performance with 50% less power. Dual-fan thermal design ensures maximum CPU performance in a compact chassis. * **Hyper-Connected Workspace -** Intel Wi-Fi 7 and Bluetooth 6.0 enable low-latency wireless. Dual 2.5G LAN ensures network redundancy, Zero Trust security, and high throughput for enterprise and Edge AI workloads. * **Enterprise Security & Management -** Supports Intel vPro (select SKUs) and fTPM for hardware-based security. ASUS Control Center & Edge Suite enable centralized management, remote monitoring, and asset reporting. * **Optimized Form Factor & Expansion -** Compact 5x4 form factor (144x117x42mm) with Tool-less Chassis 2.0 allows upgrades to dual M.2 SSDs (Gen5/Gen4). Maximizes thermal headroom while maintaining flexibility and performance. * **Industrial Readiness & Long-Term Value -** Durable, modular design supports harsh environments and long-term deployment. Rich internal I/O (RS-232, PCIe x1) enables POS, IoT, and industrial automation expansion. https://preview.redd.it/nj1m49ijydcg1.png?width=2167&format=png&auto=webp&s=4350ba20429707aafe6e6d95f43c108b3fc6b4fa **Key Specs:** * **Configuration choices -** The ASUS NUC 16 Pro will be available in a complete Mini-PC package (with memory, storage, and OS) and barebone kits where you will need to supply memory, storage, and OS * **CPU -** Processor options start from the top at the Intel Core Ultra X9, and move down to the Intel Core Ultra 5. The Intel Core Ultra 7 and Core Ultra 5 will be available with vPro models. * **GPU -** Graphics options featuring the Intel Arc B390 will be available with Intel Arc 12Xe cores (up to 65W) and Intel Arc 4Xe cores (Up to 65W) * **Memory -** The Core Ultra X9 will feature soldered Dual Channel LPDDR5x 9600 MT/s memory up to 96GB, while other models will feature Dual Channel DDR5-7200 CSO-DIMM (Up to 128GB) * **Storage -** 2 x M.2 2280 key M slots (1x PCIe x4 Gen5, 1X PCIe x4 Gen4) support, 128GB\\~8TB NVMe SSDs * **I/O Ports -** 2x USB-C TBT4, 1x USB 3.2 Gen2x1 Type-C (10Gbps), 4x USB 3.2 Gen2 Type-A (10Gbps), 2x HDMI or 2x DP 2.1\\* * **Networking and Wireless -** WiFi 7 & BT6, 2x 2.5Gbps LAN * **Display Output -** Up to Quad display including Dual HDMI or Dual DP 2.1 ports, plus Dual TBT4 w/ DP 2.1 * **Audio -** Up to 7.1 multi-channel (or 8-channel) digital audio on HDMI and DP Type-C ports * **Internal Headers\\*\\* -** 2x USB 2.0 headers, 1x 2230 M.2 slot, 1x PCIe x1 Gen 2 connector, 1x Serial port header * **Expansion I/O Accessory\\*\\*\\* -** 1x VGA Exp. (Lid-based), 1x RS232 Exp. (Lid-based) * **OS Choices (Mini-PC) -** Windows 11 Home 64-bit, Windows 11 Pro 64-bit * **OS Support (Barebones Kit) -** Windows 11 Home 64-bit, Windows 11 Pro 64-bit; Windows 11 IoT Enterprise 64-bit; Windows 11 Pro Education 64-bit; Ubuntu 24.04 LTS 64-bit; RedHat Enterprise Linux 10.0 64-bit \\*HDMI supports CEC and persistent display, while DisplayPort supports headless operation and virtual display \\*\\*Barebones Kit / board only \\*\\*\\*Not available until Q2 The ASUS NUC 16 Pro is expected to be available late Q1 - Early Q2, though actual availability may vary by SKU. * Product page: [https://www.asus.com/displays-desktops/nucs/nuc-mini-pcs/asus-nuc-16-pro/](https://www.asus.com/displays-desktops/nucs/nuc-mini-pcs/asus-nuc-16-pro/) Here are a few images from our CES booth: https://preview.redd.it/iygzvmgsydcg1.jpg?width=1080&format=pjpg&auto=webp&s=3e4a89d5a1603beb7af307baef235f21f53458de https://preview.redd.it/wa54tikg1ecg1.png?width=2662&format=png&auto=webp&s=61001039960a3a28ba38809b8b4d4f4ccc9f893f https://preview.redd.it/eq64thf01ecg1.png?width=2658&format=png&auto=webp&s=a0db899b66d6f7f2ed685c453884e36d61835eea Let us know what you think about this new version of the ASUS NUC Pro in the comments below.",
        "comments": [
            {
                "raw_content": "> Memory - The Core Ultra X9 will feature soldered Dual Channel LPDDR5x 9600 MT/s memory up to 96GB 96GB of RAM? So it's $20,000?",
                "author": "inphamus"
            },
            {
                "raw_content": "Great, want one!",
                "author": "Latter_Aardvark_1733"
            },
            {
                "raw_content": "It will be very interesting to compare it with the Nuc 15 pro. I am currently reviewing this model with a U5 225H processor. And I know what this processor is capable of in combination with ARC 130T.",
                "author": "Fun_Masterpiece296"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel is 'going big time into 14A,' says CEO Lip-Bu Tan — 'serve the customer well' remark hints at external client",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD shows first renders of Ryzen AI 400 for AM5 socket",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if the \"AI\" cpus are gonna support something like \"smart access video\" or \"smart access memory\" -type processing with the npu...",
                "author": "Forsaken_Sundae_4315"
            },
            {
                "raw_content": "Could make for a pretty decent light, power efficient home server",
                "author": "niwtskeap"
            },
            {
                "raw_content": "I am having vison where widows demands a cpu that has stupid ai cores built just to run ai and wont run properly unless you have the ai cores it demands",
                "author": "lasthopel"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS finally puts Ryzen AI MAX+ 392 \"Strix Halo\" into gaming laptop - VideoCardz.com",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a horrible name on the CPU",
                "author": "CyberHaxer"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Minisforum shows desktop Mini-ITX board with Ryzen AI Max+ 395 “Strix Halo” and 128GB LPDDR5X memory",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "$1800 all white battle station",
        "score": 0,
        "text_content": "Spec list in comments. I think we got a pretty good value computer for the money",
        "comments": [
            {
                "raw_content": "Beautiful but share the specs dude?",
                "author": "lLoveTech"
            },
            {
                "raw_content": "Do you get some water gurgling noises from the tubes connecting to the rad being the top point of the AIO?",
                "author": "inferndd"
            },
            {
                "raw_content": "Needs more cowbell",
                "author": "Joifugi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans missed out on a 'once-in-a-lifetime' chance to buy a house—the 3 shifts it would take to make housing affordable are 'very unlikely'",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homes should not be “once in a lifetime” chances",
                "author": "d3v1ls4v0c4d0"
            },
            {
                "raw_content": "Bought in 2009.. That was once in a lifetime. Sold in 2019 and missed the boat in 2020 as I couldn't afford anything in my area.. Now I'll forever rent",
                "author": "UrCreepyUncle"
            },
            {
                "raw_content": "Even when rates were 3% or less people were saying the home prices were too high and not to buy.",
                "author": "ElBigKahuna"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Almost 40% of US homes do not have a mortgage.",
        "score": 221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And which age group holds these homes? Lol",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "West Virginia leads the list with 55%. A lot of them are in poor areas like West Virginia, Louisiana, Arkansas, Mississippi, etc. Probably many of them are mobile homes where the loans only cover 10 years and they have to lease the land.",
                "author": "lchoror"
            },
            {
                "raw_content": "Don't boomers own 60% of housing? With youngest at 60yrs old, I hope they pay down those notes before healthcare costs start up",
                "author": "1234nameuser"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates plummet to new lows at 5.99%",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up next month when they \"collapse\" to 5.98%",
                "author": "PooPooDooDooPants"
            },
            {
                "raw_content": "\"plummet\", ha",
                "author": "travelinzac"
            },
            {
                "raw_content": "This is excellent news. If MND reports 5.99%, you can get a rate that is 0.4-0.5% lower from credit unions such as PenFed.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates drop to lowest level in nearly 3 years as Trump orders buying of $200 billion in mortgage bonds",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello quantitative easing.",
                "author": "Topseykretts88"
            },
            {
                "raw_content": "home prices are prohibitive, it was never the mortgage rates that were the issue. Asking people to take out loans for 6x their salary over 20-40 years means insane interest already, but it also means people need to work to save up large sums of money. But housing being a business means that even renting, they're paying absurd prices just to survive. We need starter homes to be built, but builders make more off of $500k+ homes and so they don't build starter homes, which means more and more people are competing for less and less available homes, many of which are being held as rentals.",
                "author": "Practical-Ad-2387"
            },
            {
                "raw_content": "Mortgage rates have not dropped on this news and the president cannot order the federal reserve to do anything frankly",
                "author": "Thebrain3-5-0"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10 January 2026 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlas ends this year’s CES with a backflip",
        "score": 2224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm actually extremely impressed with it's ability to recover. That's probably a better advertisement than landing it smooth since a smooth backflip can be pre programed.",
                "author": "adj_noun_digit"
            },
            {
                "raw_content": "The 360 rotation on the legs is pretty cool. I think this might be my favorite robot. https://preview.redd.it/tt2q2w39egcg1.jpeg?width=1019&format=pjpg&auto=webp&s=9ca9cd833cbd3bde1e410fa4527588894c46986b",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "ill be the one to say it this is the literal only robot that looks like it's actually real and not vaporware the utilitarian design of the main parts but also the fact that its engineered to be better than a human in terms of mobility",
                "author": "ahspaghett69"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Report: Anthropic cuts off xAI’s access to Claude models for coding",
        "score": 377,
        "text_content": "**Report by Kylie: Coremedia** She is the one who reported in August 2025 that Anthropic cut off their access to OpenAi staffs internally. **Source: X Kylie** 🔗: https://x.com/i/status/2009686466746822731 [Tech Report](https://sherwood.news/tech/report-anthropic-cuts-off-xais-access-to-its-models-for-coding/)",
        "comments": [
            {
                "raw_content": "**Additionally she said** https://preview.redd.it/05jrmgf6khcg1.png?width=1080&format=png&auto=webp&s=9c8d167350f5cc5bd95669f2921c815b80aad448",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "rly",
                "author": "Lvxurie"
            },
            {
                "raw_content": "xAI claim they have the best models all the time, so why not use their own then?",
                "author": "lucellent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepSeek set to launch next-gen V4 model with strong Coding ability, Outperforms existing models",
        "score": 137,
        "text_content": "This points to a **real shift** in the coding model race. **DeepSeek V4** is positioned as more than an incremental update. The focus appears to be on long context code understanding logical rigor and reliability rather than narrow benchmark wins. If the internal results hold up under **external evaluation** this would put sustained pressure on US labs especially in practical software engineering workflows not just demos. The **bigger question** is whether this signals a durable shift in where top tier coding models are being built **or** just a short term leap driven by internal benchmarks. Set to **release** early Feb(2026). Source: The information(Exclusive) 🔗: https://www.theinformation.com/articles/deepseek-release-next-flagship-ai-model-strong-coding-ability",
        "comments": [
            {
                "raw_content": "It really all depends on agentic performance, because Claude code + Opus 4.5 is basically a god at this point. Opus just has *it*, that neither Gemini or Codex have (although Codex is still very good, Gemini is much further behind in agentic coding.",
                "author": "cyborgsid2"
            },
            {
                "raw_content": "I'm looking for that LTX generation of coding models that run on a single 5090 but produce results that compete with the major models.",
                "author": "fredandlunchbox"
            },
            {
                "raw_content": "![gif](giphy|368kN8LUwlr2|downsized)",
                "author": "Black_RL"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Waymo Will Now Pay You $20 a Pop to Close a Self-Driving Car's Door",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Japanese taxis have had automatic doors for decades. Surely Waymo can add that in.",
                "author": "Tkins"
            },
            {
                "raw_content": "Wonder if they could just quickly accelerate for a few feet backwards then quickly stop.",
                "author": "xesttub"
            },
            {
                "raw_content": "tesla robotaxis can close doors automatically despite model y doesnt, tesla enabled thrde robotaxis y models to do so",
                "author": "Distinct-Question-16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deepseek is cooking",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if they pass claude opus 4.5 we are truly accelerating",
                "author": "Big-Site2914"
            },
            {
                "raw_content": "Even if it's close that's good. Competition is *good* for us. They're products, not sports teams.",
                "author": "cfehunter"
            },
            {
                "raw_content": "Talk is cheap release the model",
                "author": "Ambitious_Subject108"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "one of the top submitters in the nvfp4 competition has never hand written GPU code before",
        "score": 1042,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sure that the guy is still smart AF programmer. Biggest gain I've had with AI models is the fact that I can focus on the actual problem from the logical side. I don't need to fight the programming language or environment. As an example: Never ever managed to grasp my head around shaders but now with LLM it took me like 1 hour to implement a proper Fog of War system because I knew how I wanted to approach the problem and how the GPU runs the code. Still can't write shaders at all but now it's not a blocker for me anymore.",
                "author": "JjyKs"
            },
            {
                "raw_content": "Ok that's actually pretty impressive. Didn't know much about the competition, but found a good blog post showing what goes into a 10th place submission, though with limited effort as there are a few unexplored future ideas in there (the author is a Staff Software Engineer at LinkedIn specializing in LLM inference optimization & CUDA kernel optimization). [https://yue-zhang-2025.github.io/2025/12/02/blackwell-nvfp4-kernel-hackathon-journey.html](https://yue-zhang-2025.github.io/2025/12/02/blackwell-nvfp4-kernel-hackathon-journey.html) For the first problem she placed ahead of shigao, for number 2 and 3 shigao is ranked higher. Optimizing kernels involves a lot of trial and error so AI likely has an advantage of being able to quickly iterate. But I didn't expect AI to know what to try by itself, at least not on that level because personally I haven't had too much luck with getting AI to generate performant CUDA kernels (specifically efficient 2d convolution with small <32px kernels).",
                "author": "dotpoint7"
            },
            {
                "raw_content": "LLM is a talent amplifier. Good devs can switch between stacks and frameworks well with the LLM help. Bad devs just generate BS.",
                "author": "Square_Poet_110"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The golden age of vaccine development - Works in Progress Magazine",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Angry Robert F Kennedy Jnr noises\"",
                "author": "Moscow__Mitch"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever had $4 billion of vested OpenAI equity in 2023",
        "score": 157,
        "text_content": ".",
        "comments": [
            {
                "raw_content": "That’s worth over 100 billion at 1 trillion ipo 🤯",
                "author": "Rxvi21"
            },
            {
                "raw_content": "His decision to leave probably did serious damage OpenAI long term",
                "author": "Main-Company-5946"
            },
            {
                "raw_content": "Wow I can’t believe the greedy capitalist Ilya tried to wrestle away power from poor little Sama who makes $76,000 a year from OpenAI with no equity. (Only half joking)",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    }
]