[
    {
        "post_name": "If there was ever a time to be optimistic, it’s right now.",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes but that doesnt make living with 40% or whatever it is of the population being infected with the mind virus suck any less",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "In a mere 14 days we will all see",
                "author": "LibertyisYuge"
            },
            {
                "raw_content": "I will be optimistic when I see the criminals and traitors hanged, and white men's lives no longer being destroyed.",
                "author": "TheGamerToTheRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chat GPT will create an image of gay Jesus but not of Muhammad. Acknowledges double standard and says it will not do it because Muslims would incite violence in the real world if it created that image.",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So sick of this shit. Muhammad was a pedo",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "Christians need to become more violent. They already hate us for no reason, I say we start giving them a good reason.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Can lie about Jesus but you can't say the truth about pederast scum Muhammad rofl",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "it never get old",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one questions RFK though. Yeah, there's money and seething partisans, useful idiots, and groomers. That's >19% of the population and we all know this now. Fuck them, this did not stop being war because we believe in the right to speak and redress. They were mutilating little kids and threatening parents. War.",
                "author": "Citizen_Bob"
            },
            {
                "raw_content": "I’m smart because TV said I was smart as long as I believed what TV told me.",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "We learned a lot about people in COVID didn't we?",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Franklin finds out the truth ...",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"The pipe of doom\"",
                "author": "fat50"
            },
            {
                "raw_content": "Franklin, NO! [breaking bad meme]",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "B- - - - -G Mike",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reddit mods need to be held accountable for the measurable damage they've done to America.",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And meanwhile they freely post fake news about Trump all the time",
                "author": "sovereign"
            },
            {
                "raw_content": "\"Anyone could make a YouTube video\" But if it exposed \"Republican fraud\" or showing incriminating evidence on white people then absolutely it would be allowed to stay and be up voted 100000 pts. The only \"journalistic standard\" is truth, not pushing an agenda or \"this is how you should feel\".",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Every state, city and local sub is nothing but left-wing talking points and downvoting/ banning anyone to the right of Mitt Romney. Even if your town voted 75% for Trump, your local reddit sub will basically be like this.",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GOING FULL BLACKHAWK DOWN: This is how much the Corporate Media wants to suppress Nick Shirley’s investigative reporting—that it’s legal for the Somalian’s to shoot him !!!!!!",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MSM and the Democrat Party want him dead.",
                "author": "GarbageLivesMatter"
            },
            {
                "raw_content": "GerSTEIN. Such a fine Christian name.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Enemy of the people. He's just jealous and a political hack.",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There it is: Audrey Hale, the trans kiIIer who kiIIed 6 in a Christian school, was targeting Christians and White kids. Biden's FBI buried this:",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Despite all the squawking about muh antisemitism, anti-Christian hatred is a far bigger issue.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "I think most already knew the target here was CHRISTIANS. Why is this stickied? John 15:19",
                "author": "diCenturion"
            },
            {
                "raw_content": "hated white adults, but targeted white kids?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Eight Indian-owned gas stations in the state of Texas have been supplied over $32 million in small business loans.",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Greg Abbot, John Cornyn, Ted Cruz, Dan Crenshaw. 330 mosques now. This is what you get.",
                "author": "Calumet57"
            },
            {
                "raw_content": "I've seen this one before. They run the business into the ground, never pay their creditors, their utilities or their loans back, then they file bankruptcy, get sued and run back to India a wealthy Prince.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "I wonder what would happen if I tried to get a business loan.",
                "author": "orange_kek_great"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Audrey Hale: black people I love, white people I hate.",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A white black supremacist. Clayton Bigsby was before his time.",
                "author": "utfanx2"
            },
            {
                "raw_content": "This is all old.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "So just your average leftist then.",
                "author": "duckduck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Columbus, OH: ANOTHER apparently fake Somali run child care center in Columbus, Ohio with no kids...",
        "score": 612,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear every time I see one of these fuckers it's the same face, like a retarded episode of Twilight Zone.",
                "author": "Mike0xquitelong"
            },
            {
                "raw_content": "They're all monsters.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "That is the stare of a retard. These stupid \"people\" didn't figure out how to do this on their own.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump FBI just released bombshell docs hidden by the Biden admin proving the TRANSGENDER Covenant Christian school shooter Audrey Hale *specifically* targeted WHITE PEOPLE.",
        "score": 1220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And she used federal aid funds to purchase the weapons used. That news came out today.",
                "author": "BadBrainsBuzzcocks"
            },
            {
                "raw_content": "Stephen Crowder released this information with the leaked manifesto how long ago?",
                "author": "EllisDee25"
            },
            {
                "raw_content": "Shut down reddit",
                "author": "America_No_1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump can turn this into a massive W if he provides credits effectively making taxes null for this year (ideally abolish) then use IRS resources to go after those who committed fraud nation-wide",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To fund Democrat voters",
                "author": "Cali_kid"
            },
            {
                "raw_content": "All wishful thinking",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "Why doesn't Theo send this text to Baron or Trump",
                "author": "UnknownUserName"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Independent journalists in Washington state just confronted people at an address listed as a Somali \"daycare center.\" The woman at the door says they have NEVER been a daycare. They received over $210,000 in taxpayer money this year. They're licensed for THREE kids.",
        "score": 574,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn dirty apes",
                "author": "Made-in-America"
            },
            {
                "raw_content": "What in the sweet fuck, $70,000 per kid?",
                "author": "Trump454748"
            },
            {
                "raw_content": "Wait until we discover the child trafficking going through these places.",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A group of men just threatened an independent journalist, Thomas Hern, and called him a \"terrorist\" after he began questioning their Columbus, Ohio Childcare Center.",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Carry. Chambered.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fuck illegals trying to record you to get you cancelled, arrested, or murdered later. This alone deserves a flight back to crapland",
                "author": "salbro"
            },
            {
                "raw_content": "What an odd way to react if you’re running a legitimate business. Can you imagine if McDonalds reacted this way if you came in and started asking questions?",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Retard of the Year?",
        "score": 536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He is still in power",
                "author": "Krat"
            },
            {
                "raw_content": "That isn’t accurate. Walz would have abandoned his post like he abandoned his men",
                "author": "charlesthehammer"
            },
            {
                "raw_content": "I dont get it, i am a tax paier too",
                "author": "TimWaltz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Health and Human Services Department Freezes All Childcare Payments to Minnesota as it Investigates Allegations of Widespread Fraud",
        "score": 1114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrat Judge orders payments to resume in 3.., 2…, 1…",
                "author": "Tcrlaf1"
            },
            {
                "raw_content": "Damn, they're actually doing something of substance. A step in the right direction, to be sure.",
                "author": "Froynlavenfroynlaven"
            },
            {
                "raw_content": "just waiting for MSDNC to tell me what to think about this.",
                "author": "TheUnicornDinosaur"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The polls are rigged even more than the writers. The real number is 64%, and why not, our Country is “hotter” than ever before. Isn’t it nice to have a STRONG BORDER, No Inflation, a powerful Military, and great Economy??? Happy New Year!",
        "score": 498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrests.",
                "author": "FuckCommies"
            },
            {
                "raw_content": "No inflation???? You have got to be kidding me. I guess he never goes to the grocery store. Great economy???? Sorry, I don't see that either.",
                "author": "ShitFromShinola"
            },
            {
                "raw_content": "We need far more deportations, a ban on H1Bs, grocery and rent deflation, and an end to foreign aid. Then I'll feel like a victory lap is justified.",
                "author": "RonPaulWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yep",
        "score": 757,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thank my LUCKY STRIPES every day I live in TN where the libturds have not taken over yet. They are trying to turn Chattanooga, TN blue, but I can assure you all these incoming Portlanders have weird STDs and will be dead within the end of Trump's second term.",
                "author": "Robert_Finwell-TN"
            },
            {
                "raw_content": "It's easier to hide\\steal votes in a very large city.",
                "author": "Corse46"
            },
            {
                "raw_content": "And all of that is fraud.",
                "author": "CharlieKirksSon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The real money maker",
        "score": 1425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "almost makes we wish I was an amoral, degenerate third-world pirate...but, then I remember that GOD exists and HIS holy vengeance and the wrath are equally real.",
                "author": "GhostOfTheRepublic"
            },
            {
                "raw_content": "I REALLY wish he spelled \"Daycare\" wrong.",
                "author": "CucumberExtract"
            },
            {
                "raw_content": "Heritage Americans live paycheck to paycheck while some shitbag Somalian that was probably dragging the bodies of dead American soldiers on the roads of Mogadishu in ‘93 is living in luxury. I don’t just want the money back. I want blood.",
                "author": "BasedCostanza91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GET FUCKED, PAJEETS",
        "score": 1319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"stranded at home\"",
                "author": "DeploraBen"
            },
            {
                "raw_content": "The amount of bacteria in that poor plane... YUCK!!!",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "It’s inevitable. This is a 95/5 issue. No one wants jeets and everyone wants their high paying jobs. I won’t be surprised to see the right candidate form an unholy alliance of tech bro/feminists with right wing nationalists to force isolationist immigration policies. We all think fems are suicidally empathic, but that’s when it personally doesn’t cost them anything. Let them connect losing their lazy girl jobs and they’ll form their own ss units.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive: China mandates 50% domestic equipment rule for chipmakers",
        "score": 288,
        "text_content": "SINGAPORE, Dec 30 (Reuters) - China is requiring chipmakers to use at least 50% domestically made equipment for adding new capacity, three people familiar with the matter said, as Beijing pushes to build a self-sufficient semiconductor supply chain. The policy is already yielding results, including in areas such as etching, a critical chip manufacturing step that involves removing materials from silicon wafers to carve out intricate transistor patterns, sources said. China's largest chip equipment group, Naura, is testing its etching tools on a cutting-edge 7nm (nanometre) production line of SMIC, two sources said. The early-stage milestone, which comes after Naura recently deployed etching tools on 14nm successfully, demonstrates how quickly domestic suppliers are advancing. \"Naura's etching results have been accelerated by the government requiring fabs to use at least 50% domestic equipment,\" one of the people told Reuters, adding that it was forcing the company to rapidly improve. Advanced etching tools had been predominantly supplied in China by foreign firms such as Lam Research [(LRCX.O)](https://www.reuters.com/markets/companies/LRCX.O) [, opens new tab](https://www.reuters.com/markets/companies/LRCX.O) and Tokyo Electron [(8035.T)](https://www.reuters.com/markets/companies/8035.T)[, opens new tab](https://www.reuters.com/markets/companies/8035.T), but are now being partially replaced by Naura and smaller rival Advanced Micro-Fabrication Equipment (AMEC) [(688012.SS)](https://www.reuters.com/markets/companies/688012.SS) [, opens new tab](https://www.reuters.com/markets/companies/688012.SS), sources say. Naura has also proven a key partner for Chinese memory chipmakers, supplying etching tools for advanced chips with more than 300 layers. It developed electrostatic chucks — devices that hold wafers during processing — to replace worn parts in Lam Research equipment that the company could no longer service after the 2023 restrictions, sources said. Naura filed a record 779 patents in 2025, more than double what it filed in 2020 and 2021, while AMEC filed 259, according to Anaqua's AcclaimIP database, and verified by Reuters. That's also translating into strong financial results. Naura's revenue for the first half of 2025 jumped 30% to 16 billion yuan. AMEC reported a 44% jump in first-half revenue to 5 billion yuan. Analysts estimate that China has now reached [roughly 50% self-sufficiency ](https://www.reuters.com/world/china/how-chinas-chip-equipment-manufacturing-sector-stacks-up-2025-05-13/)in photoresist-removal and cleaning equipment, a market previously dominated by Japanese firms, but now locally led by Naura. \"The domestic equipment market will be dominated by two to three major manufacturers, and Naura is definitely one of them,\" said a separate source.",
        "comments": [
            {
                "raw_content": "good way to get domestic tool makers to have cash flow to continue RnD",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Honestly, I get that China is trying to create their chips for internal use only and that they are behind the US companies, but it would be cool to see what they come out with for desktop (as I understand it, the main focus now is critical parts of the Chinese government, like AI, or cyber security). Of course China is subsidizing and forcing adoption but competition is always good I guess, maybe all of the sanctions by the US will only push this forward.",
                "author": "santtiavin"
            },
            {
                "raw_content": "first they will start replacing your old nodes tools, usually this is about 30% of chip market profit. when the leading chip industry lost that 30% revenue, their R&D fund will be affected and innovation will be slowed. China's tech company will move faster due to the increase fund from the 30%. Next they will go after the next slightly advance node (but not latest), you will lose that. At the end day you lost most of the older node profit except the latest ones. With lack of fat billions of profit, you will be willingly handing over your IP on a silver plate because you need more money to fund that billions of R&D. Sanction doesnt really help the tech companies, it just speeding up China to develop an alternatives. The tech companies CEO know this, they are against this; it is only the dumb politician thinks it is a good idea. Edit : Also from Jensen Huang, The west semiconductor is improving at 20-30% rate while China is catching up at doubling over and over (100%). So a simple math can figure out, it wont be long China is able to catch up.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US approves Samsung, SK Hynix chipmaking tool shipments to China for 2026, sources say",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well this is good for DRAM and NAND prices at least",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "Sounds like US is getting nervous about the euv development in China",
                "author": "PlaidSweaters"
            },
            {
                "raw_content": "why is the US meddling with korean companies?",
                "author": "Sopel97"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Much RAM Do Gamers Need, 2x8 16GB vs. 2x16 32GB vs. 2x32 64GB",
        "score": 205,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So don't let your gpu run out of VRAM.",
                "author": "JamesEdward34"
            },
            {
                "raw_content": "16GB is enough for almost anything if you close other RAM hogs while gaming, 32GB is enough for everything even with some memory hogs like browsers, discord etc. running, 64GB is massive overkill for gaming alone. There you go, saved you 15 minutes. Don't need benchmarks or a video for this one lol.",
                "author": "stonerbobo"
            },
            {
                "raw_content": "The title says gamers, not designers, because anyone who uses SolidWorks regularly knows that it laughs in the face of 32gb of ram.",
                "author": "Pknsko0l"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s Lisuan begins shipping 6nm 7G100 GPUs to early customers",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aren’t these powervr arch",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "More competition within the gpu markets would be fantastic! So, I hope they're successful with their initial launch.",
                "author": "DutchieTalking"
            },
            {
                "raw_content": "Good, but specifically in gaming, after what I saw with Intel and their driver struggles, I can't see any real competition for Nvidia and AMD for at least the next ten years.",
                "author": "osama518ars"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nexperia in no-man’s-land: how a chip company became caught between two world powers",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great read - it shows how mistrust becomes a self-fulfilling prophecy. Being denied expansion/subsidies in Europe and having limited control, the owner tried to expand in China instead and eventually take more control of the company, which was then looked at as a hostile move in the West. Acting in good faith has become increasingly difficult.",
                "author": "dabias"
            },
            {
                "raw_content": "Insanely well researched and cited article, would encourage reading to the end. The motivational nuances of all involved are nicely shown",
                "author": "ugene1980"
            },
            {
                "raw_content": "How dare Chinese 'steal' what they purchased!",
                "author": "TK3600"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] ASUS to Raise Prices on Selected PC Lines from Jan. 5 Amid Memory Cost Surge, Following Dell",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is going to suck. Consumer prices of storage and ram have gone through the roof over the past month.",
                "author": "Tasty-Traffic-680"
            },
            {
                "raw_content": "In other words, two corporations decided to partake in an easy grift and yet another opportunity to screw consumers.",
                "author": "CautiousHashtag"
            },
            {
                "raw_content": "I hope they make all computing inaccessible to the average person.",
                "author": "Independent_Ad_29"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Exynos Auto V720 to Power BMW's New iX3 Electric SUV",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it too early for making a joke about BMW’s thermal management meeting Exynos? >!Is a joke, pls don’t take it seriously!<",
                "author": "AbhishMuk"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Red Dead Redemption on the Switch 2 - I'm in awe",
        "score": 841,
        "text_content": "I just started playing Red Dead Redemption on the Switch 2 and I'm in awe. I had to stop and share my thoughts. It runs, looks and feels like a dream come true. Playing RDR 2 back in 2018 on the base PS4 was one of my favorite gaming experiences of all time, but I never came around playing the first one. Figured with the release of the Switch 2 version now would be the time. And boy is it amazing. I arrived on MacFarlanes Ranch and couldn't help but just wander around aimlessly and admire the world. I didn't know the first RDR was already this detailed. Just watching the NPCs go about their days, working in the smithy, washing their faces, carrying haystacks, talking to each other, underlined with a beautiful haunting soundtrack.. It brings me joy and back to playing RDR 2 for the first time. Combine this with playing it in this quality on a handheld console... Incredible. I can already tell this is going to be one hell of a ride. 🙏🏼",
        "comments": [
            {
                "raw_content": "Honestly I loved playing this in handheld. Genuinely sad I've finished it... Now hoping for RDR2 to arrive on the Switch 2 so I can replay that.",
                "author": "LowEfffort"
            },
            {
                "raw_content": "Picked it up last week and have already poured roughly 20 hours into it. It reminds me so much of GUN, which I played religiously on my GameCube back in the day. For anyone who's on the fence about this game: do it. It's perfect.",
                "author": "vruchtenhagel"
            },
            {
                "raw_content": "I loved RDR on my PS3, and it’s really been a trip replaying it on portable on my Switch 2, with higher frame rate and better graphics. Really makes me feel like a boomer but I guess that’s peak gaming to me now",
                "author": "morax"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you use your Switch 2 with or without a grip?",
        "score": 108,
        "text_content": "I find that grips cause much less wrist strain during long plays.",
        "comments": [
            {
                "raw_content": "No, but I have small hands, so that plays a role in it. It’s already just at the limit of being too big for me, wouldn’t want to add any more bulk to it. lol",
                "author": "ScherisMarie"
            },
            {
                "raw_content": "Grips were game changing.",
                "author": "Ok-Platypus-5949"
            },
            {
                "raw_content": "Raw dog the only way to go",
                "author": "Jimberwolf_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is absolutely insane, man!",
        "score": 388,
        "text_content": "Played through the FF7R demo during my flight. Can’t wait to buy the full game next month.",
        "comments": [
            {
                "raw_content": "I just got back from a vacation to the Caribbean and my Switch 2 was a delight to use in flight, and made the 6 hour flight go by much faster. My son and I were even using Gameshare with Hyrule Warriors, he was two seats over and I beamed it from my Switch 2 to his Switch OLED.... what a time to be alive!",
                "author": "ProdigyCorporation"
            },
            {
                "raw_content": "A fellow appreciator of flying with a Switch 2! Sensational",
                "author": "Ashamed_Round_9173"
            },
            {
                "raw_content": "Same, not only the graphics, it is so cool to experience the game again in modern fashion. It got me with the soundtrack.",
                "author": "RisingRapture"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Holy moly is Metroid Prime 4 excellent.",
        "score": 124,
        "text_content": "I have never played a Metroid game before this. I’ve only heard of Metroid, Samus, etc. from games like Smash Bros. I decided to buy this game for Christmas and was is it great so far. I’m not super far into the game, I’m still in Volt Forge, but I am having a great time. I’ve never played a game quite like this before, I mostly stick to Pokemon and Zelda. My only complaint is that the save station in Volt Forge was inaccessible for the whole of Tower 1, so when I died I had to do it all over again. I’m curious too this game stacks up against other Metroid Prime games, cause I might get another one after this.",
        "comments": [
            {
                "raw_content": "You should totally get Metroid Prime Remastered once you finish this one. Metroid Dread is amazing too but keep in mind it’s in 2D",
                "author": "badassewok"
            },
            {
                "raw_content": "Glad you liked it - fair warning, it does have a stronger first half then second. Metroid Prime Remastered is a better game in most ways so try that afterwards (Motion Controls in both is ideal)",
                "author": "SupremelyPerfect"
            },
            {
                "raw_content": "As somebody who hasn't beat it but is further than you. The game is enjoyable and I can see why a new fan would enjoy it so much. But it is a bit different compared to 1. You might still like 1, but they're different. If you like this game, try some of the 2d metroid games. They're all great.",
                "author": "buzzMO1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Im in the club now.",
        "score": 248,
        "text_content": "I planned to post this on Christmas but i forgor 😐 (Sorry for bad Pic, my phone sucks.)",
        "comments": [
            {
                "raw_content": "Did you take this picture underwater",
                "author": "Aranikus_17"
            },
            {
                "raw_content": "bro’s had the switch 2 since 2007",
                "author": "gravedigga1313"
            },
            {
                "raw_content": "Clean the lense of your phone camera, it will suck a lot less.",
                "author": "Neryuslu"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin’s Creed Shadows is super impressive on Switch 2",
        "score": 378,
        "text_content": "I don’t know how this game can run so smoothly on a tablet! On TV it is nice and sharp, while you get perfect gameplay in handheld mode due to VRR.",
        "comments": [
            {
                "raw_content": "Impressive docked. Handheld it’s decent.",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "Yes ! I'm having so much fun with the game too, they did a great job on that version of the game :)",
                "author": "BloomingTaiils"
            },
            {
                "raw_content": "Looks great, can't wait to play it, the Naoe segments of the game look actually good. It's just too bad I don't have free space on my Switch 2 or on any of my SD cards to play the game at the moment (T\\_T)",
                "author": "Murasakitsuyukusa"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo may have updated the Switch 2 screen",
        "score": 365,
        "text_content": "In one of the latest Digital Foundry clips, they talk about an updated screen benchmark tool called TestUFO 3.0. However, they also mention that a demo station in Japan for the Nintendo Switch 2 reportedly showed the system with different screens compared to the launch day model. DF says they're investigating this and don't know if it's a hardware or software change, but future Switch 2's in the production cycle may have better screens. [https://www.youtube.com/watch?v=wA-OtQigsIk](https://www.youtube.com/watch?v=wA-OtQigsIk)",
        "comments": [
            {
                "raw_content": "God I hope this is software based",
                "author": "Alickseff"
            },
            {
                "raw_content": "Oh god, here we go",
                "author": "barbietattoo"
            },
            {
                "raw_content": "This is extremely circumstantial. A Patreon subscriber to DF told them that he saw a demo unit in Japan and felt like motion handling was better. None of the DF crew saw it themselves and there’s no video proof of this at all.",
                "author": "goro-n"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Twitter account claims to have leaked information about the new Tomodachi Life Game",
        "score": 149,
        "text_content": "**Credit to u/ZachHasArrived on the Tomodachi Life subreddit for finding this. https://www.reddit.com/r/tomodachilife/s/rYrzdv9ZGf This should all be taken with a grain of salt of course. https://xcancel.com/tomodachibff This user has been reposting and translating posts from supposed leakers on Weibo. As of right now, they have not yet provided the account, but i will update if that changes. https://xcancel.com/i/status/1989544386011824234 Here are most of the things this leaker has claimed (there are a lot): - Release Date is April 2026 (https://xcancel.com/i/status/1989513329539518668) - Apartments are still in the game, just later on in the game (https://xcancel.com/i/status/1989576598660456546) - No need to worry, romance is still a core part of the game. Same sex relationships are also in the game. (https://xcancel.com/i/status/1989515696972140584) - However, Nintendo is apparently straying away from using terms related to \"marriage\" for some reason? Relationships are still explicitly romantic though. (https://xcancel.com/i/status/1989518127470895598) - Heavy focus on relationship drama, including gossip and island division. Apparently to teach kids the difference between healthy and unhealthy relationships. (https://xcancel.com/i/status/1989525512222359835) - The game will be less randomized, and you will be given more control over things than in the 3ds game (https://xcancel.com/i/status/1989529035253113208) - New \"friend groups\" or \"clicks\" (https://xcancel.com/i/status/1989541365949370702) - Two miis having kids is once again the technical \"end\" of the game, rolling the credits, however there are apparently alternate credits after completing a \"secret event\" (https://xcancel.com/i/status/1989588426031861948) - Your lookalike is the island's mayor. This is reflected in mii news event broadcasts, including a new beach volleyball tournament minigame. (https://xcancel.com/i/status/1989590691044102224) - Miis will be monogamous (https://xcancel.com/i/status/1992522924054761782) - Affairs will not be a part of the game, however mii can break up with another mii for someone else. (https://xcancel.com/i/status/1994651335850168674) - The game was supposed to be announced last year but was delayed to performance issues and to return to the old tts voices. The game originally had more modern it's voices before they decided to reverse the change. (https://xcancel.com/i/status/1989881356482982225) - There will be a bunch of miitopia references (https://xcancel.com/i/status/1989844865765511385) These are most of the things posted by this account. If you want to see the rest, I've linked his account above. I really want everyone to take all this with a heavy grain of salt, a lot of this seems realistic but I am very skeptical. Especially since one of the posts mentions a trailer was going to come out before the end of 2025, which clearly is not going to happen. (https://xcancel.com/i/status/1992002557225619818) I just wanted to share this here to spark some conversation and just in case any of this is true. I will update if I get any new info. Again, thank you to u/ZachHasArrived for finding this, and sharing it in the r/TomodachiLife community.",
        "comments": [
            {
                "raw_content": "I feel like this is all just guess-work. A lot of it seems really safe, or like things that someone could literally make up out of thin air.",
                "author": "OpeningConnect54"
            },
            {
                "raw_content": "Considering that this account also claimed last month that a new trailer for the game would be shown before the end of 2025, I'd take this with a massive grain of salt. Seems like it's just an account trying to make relatively safe predictions and claim they're leaks.",
                "author": "iceburg77779"
            },
            {
                "raw_content": "I do believe the same sex relationships bit, as Nintendo had said before that the next entry (This was when Tomodachi Life on 3DS was the most recent release) would have them, and Nintendo is actually quite an LGBT friendly company",
                "author": "smolgote"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to MP1st, Convallaria from PlayStation's China Hero Project could get cancelled after accusations of mismanagement",
        "score": 269,
        "text_content": "* Bo Bao, director of China Game Production at SIE, reveals in emails that they want Virtuos to take over development. * The game has been removed from the lineup of upcoming games on the CHP website * There are email screengrabs of the accusations from the devs. \\[[Source](https://mp1st.com/news/playstation-removes-mention-convallaria-china-hero-projects-execs-mismanagement)\\]",
        "comments": [
            {
                "raw_content": "now its time for people to switch up and say the game had potential",
                "author": "clouds999999"
            },
            {
                "raw_content": "I understand why PlayStation wanted to publish some of the projects in the west but this was no Lost Souls Aside. Cancel and pick up one of the other ones in dev instead.",
                "author": "SpaceGooV"
            },
            {
                "raw_content": "I’d say I’m disappointed but that would imply I remembered this game existed before this headline.",
                "author": "Straight-Ad6926"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Anyone try the \"Universal Intel Chipset Updater\" tool? Is using this tool to update the Intel chipset drivers a good idea?",
        "score": 7,
        "text_content": "There is an apparently new tool to update the Intel Chipset Drivers: [https://github.com/FirstEverTech/Universal-Intel-Chipset-Updater](https://github.com/FirstEverTech/Universal-Intel-Chipset-Updater) Here is a video about the tool: [https://www.youtube.com/watch?v=I0102muEa\\_Y&t=3s](https://www.youtube.com/watch?v=I0102muEa_Y&t=3s) Has anyone tried this tool? Would it be a good or bad idea to update the Intel chipset drivers using this tool?",
        "comments": [
            {
                "raw_content": "I wouldn't trust a random third party tool, but may caution doesn't mean the tool isn't safe and good.",
                "author": "Gears6"
            },
            {
                "raw_content": "Hello, These are usually downloaded from your motherboard manufacturer's support website, aren't they? Failing that, Intel does publish its own software to install its chipset drivers: https://www.intel.com/content/www/us/en/download/19347/chipset-inf-utility.html I'm not sure why you would need a third party tool to perform the same function. Regards, Aryeh Goretsky",
                "author": "goretsky"
            },
            {
                "raw_content": "Intel driver and support assistant use it then uninstall",
                "author": "damagemelody"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Leak suggests AMD Ryzen 7 9850X3D may land at a similar MSRP to the 9800X3D",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Wouldn't be surprising if AMD treats this as a \"stepping\" and just silently discontinues the 9800x3d, unless yield/binning still leaves a lot of lesser chips",
                "author": "TehWildMan_"
            },
            {
                "raw_content": "Bring back 5800x3d!",
                "author": "logica1one"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AOOSTAR launches Ryzen 9 9955HX3D MoDT Mini-ITX motherboard with full PCIe 5.0 support, costs $749",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "does that include built in ram? price makes no sense otherwise /s",
                "author": "GDude825"
            },
            {
                "raw_content": "WAY overpriced. One can have 9950X3D + great uATX MoBo for $50-ish more. And get a system with better VRM, more I/O, way more RAM bandwidth (8000+ MHz easily), greater TDP so higher sustained CLKs, more overclocking headroom, greater serviceability and expandability etc etc.",
                "author": "Standing_Wave_22"
            },
            {
                "raw_content": "This needs to be priced 100-150 cheaper to be competitive…",
                "author": "Krothic"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Historical Average Salary vs. Home Price",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So glad someone finally did this. Home prices have outpaced salaries at astronomical levels for over 5 decades. What are the reasons behind the home price surge?",
                "author": "Freudianslip1035"
            },
            {
                "raw_content": "That's appalling",
                "author": "Bitter-Culture-3103"
            },
            {
                "raw_content": "Why is it showing salaries dropping from $8k to $3k in 1950. That doesn’t seem right. I can’t find anything else that supports that.",
                "author": "Solar_MoonShot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tampa emerges as foreclosure hotspot, but this isn’t 2008",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And still no one is buying. The salaries and jobs can’t support it. During the panda, Tampa-St Pete tried to get a younger crowd in and they succeeded, but those people (and I’m one of them. A boomerang 30 year old who moved back to be near aging parents and family) can’t find jobs at the high remote salaries they once had and are stuck with the Florida reality of high insurance and taxes and lots of older homes that need TLC. Combine that with a lot of people from Canada packed up for political reasons, hurricanes clobbered us and scared off both tourists and residents, it’s not great. I’m a potential buyer and it’s still not affordable.",
                "author": "adotar"
            },
            {
                "raw_content": "Lose your home get promoted to CEO, only in America. “But I’m an expert on how to live through a foreclosure”",
                "author": "ObiGeekonXbox"
            },
            {
                "raw_content": "“The surge marks levels not seen since the 2008 housing collapse but housing experts stress that this time, the crisis looks different. Alvarez says … homeowners are falling behind, not because of adjustable-rate mortgages, but because of mounting household costs.” It’s the same thing! People can’t afford the costs of owning the home in both cases. You don’t need an “expert” to tell you that.",
                "author": "BayouBait"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case Shiller index Home prices have gone down for 4 straight months",
        "score": 42,
        "text_content": "Per latest data from CS US National home price index we have another dro, this makes it 4 straight months of decline. We saw similar trend in 2022 but the prices recovered heading into spring. [https://fred.stlouisfed.org/series/CSUSHPINSA#](https://fred.stlouisfed.org/series/CSUSHPINSA#)",
        "comments": [
            {
                "raw_content": "Yes, typical seasonality. Home prices generally peak in late Spring/early Summer then cool off and can dip in Fall/Winter months.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I posted same OP. Unless the source is Redfin or some industry group people don’t get it. Prices are retreating in some areas pretty noticeably. Throw a good amount of layoffs and rising unemployment and we have a party.",
                "author": "DorianGrayAndMirrors"
            },
            {
                "raw_content": "It’s dropping. I agree. The days of you watch Zillow shows this with your local listings (dependent on metro of course). The key question is will these small moderations and dips in pricing evolve into a market correction on affordability. That’s an employment issue.",
                "author": "bdd6911"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.4% year-over-year in October",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not shocking. Flat/frozen market that isn’t going anywhere (up or down) fast. Been that way for 4 years and I expect it will continue another year or so.",
                "author": "regaphysics"
            },
            {
                "raw_content": "National price index is almost useless. Real estate dynamics and trends are local, what matters is what is happening in the 50 mile radius of where you are looking to buy or sell. Even 50 miles radius may be too large is some areas.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "- The S&P Cotality Case-Shiller U.S. National Home Price NSA Index posted a 1.4% annual gain for October, up from a 1.3% rise in the previous month. - Regional divergence persists as Midwestern and Northeastern markets, led by Chicago (5.8%) and New York (5.0%), outpaced Sun Belt cities like Tampa (–4.2%) and Phoenix (–1.5%). - Sixteen of 20 markets declined month-over-month in October, signaling broad stagnation as high mortgage rates weigh on affordability and suppress price momentum. ANALYSIS “October’s data show the housing market settling into a much slower gear, with the National Composite Index up only about 1.4% year over year – among the weakest performances since mid-2023,” said Nicholas Godec, CFA, CAIA, CIPM, Head of Fixed Income Tradables & Commodities at S&P Dow Jones Indices. “This figure is essentially unchanged from September’s 1.3% annual gain and represents less than a third of the 5.1% average home price increase recorded in 2024. National home prices also continue to lag consumer inflation, as October’s CPI is estimated around 3.1% (based on a provisional index the U.S. Treasury announced due to the federal data shutdown) – roughly 1.8 percentage points higher than the latest housing appreciation. In real terms, that gap implies a slight decline in inflation-adjusted home values over the past year. “Regional performance underscores a striking geographic rotation. Chicago now leads all major markets with a 5.8% annual price gain, followed by New York at 5.0% and Cleveland at 4.1%. These traditionally stable Midwestern and Northeastern metros have sustained solid growth even as broader conditions soften. By contrast, Tampa home prices are down 4.2% year over year – the steepest drop among the 20 cities, marking Tampa’s 12th consecutive month of annual declines. Other former high-flyers in the Sun Belt are similarly struggling: Phoenix (-1.5%), Dallas (-1.5%), and Miami (-1.1%) all remain in negative territory. It’s a stark reversal from the pandemic boom, as the markets that were once ‘pandemic darlings’ are now seeing the sharpest corrections while more traditional metros continue to post modest gains. “Short-term momentum has essentially stalled. Sixteen of the 20 cities saw home prices decline in October (NSA) from the prior month, with Cleveland, Boston, Seattle, and Denver each falling roughly 0.8% to 1.0%. Only Phoenix, Miami, and San Francisco managed slight monthly upticks. Even after adjusting for normal seasonal lulls, the National Index was flat to only slightly positive in October (following a modest +0.2% after seasonal adjustment in September). This broad stagnation suggests that elevated mortgage rates – still hovering around the mid-6% range in late October – are finally overwhelming the market’s earlier supply-driven resilience. Would-be buyers are facing the highest borrowing costs in decades, and that affordability squeeze has curbed demand enough to erode price momentum across most of the country. “For context, this is the weakest annual home price growth since the March through July 2023 period, when the market was absorbing the initial shock of the Fed’s rapid rate hikes,” Godec concluded. “But today’s headwinds appear more entrenched. Elevated mortgage rates, paired with inflation that continues to outpace home price gains, have intensified affordability pressures, potentially setting a new equilibrium of minimal price appreciation or, in some markets, outright declines.” YEAR-OVER-YEAR The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 1.4% annual gain for October, up from a 1.3% rise in the previous month. The 10-City Composite showed an annual increase of 1.9%, down from a 2.0% increase in the previous month. The 20-City Composite posted a year-over-year increase of 1.3%, down from a 1.4% increase in the previous month. Chicago reported the highest annual gain among the 20 cities with a 5.8% increase in October, followed by New York and Cleveland with annual increases of 5.0% and 4.1%, respectively. Tampa posted the lowest return in October, falling 4.2%. MONTH-OVER-MONTH The pre-seasonally adjusted U.S. National, 10-City Composite, and 20-City Composite Indices continued to report negative month-over-month changes in October, posting a -0.3% drop for the 20-City Composite Index and -0.2% decreases for both the 10-City Composite and U.S. National Indices. After seasonal adjustment, the U.S. National Index reported a monthly increase of 0.4% and both the 10-City Composite and 20-City Composite Indices posted month-over-month gains of 0.3%. SUPPORTING DATA The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, which covers all nine U.S. census divisions, recorded a 1.4% annual increase in October 2025. The 10-City and 20-City Composites reported year-over-year increases of 1.9% and 1.3%, respectively. https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20251230-1481403/1481403_cshomeprice-release-1230.pdf",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Asking Rents in 33 Bigger Cities: Where they Spike, Rise more Slowly, or Fall. US Rents for Single-Family Homes Surge, Pull Further away from Multifamily",
        "score": 5,
        "text_content": "https://wolfstreet.com/2025/12/30/asking-rents-in-33-bigger-cities-where-they-spike-rise-more-slowly-or-fall-us-rents-for-single-family-homes-surge-pull-further-away-from-multifamily/ Rents spiked in Fan Francisco, Chicago, NY City, Rochester, Kansas City… rose more slowly in others… fell in Austin, Denver, San Antonio, Phoenix… By Wolf Richter for WOLF STREET.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FHFA: U.S. house prices rose 1.7% YoY; House prices rose 0.4% in October",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL the 2.7 inflation CPI said housing inflation is 0.",
                "author": "2starsucks2"
            },
            {
                "raw_content": "FHFA House Price Index Up 0.4 Percent in October; Up 1.7 Percent from Last Year Washington, D.C. – U.S. house prices rose 0.4 percent in October, according to the U.S. Federal Housing (FHFA) seasonally adjusted monthly House Price Index (FHFA HPI). House prices rose 1.7 percent from October 2024 to October 2025. The previously reported 0.0 percent price change in September was revised downward to a 0.1 percent decline. For the nine census divisions, seasonally adjusted monthly home price changes ranged from -0.4 percent in the East South Central division to +1.0 percent in the West South Central division. The 12-month changes ranged from -0.7 percent in the West South Central division to +5.3 percent in the Middle Atlantic division. The FHFA HPI is a comprehensive collection of publicly available house price indexes that measure changes in single-family home values based on data that extend back to the mid-1970s from all 50 states and over 400 American cities. It incorporates tens of millions of home sales and offers insights about house price changes at the national, census division, state, metro area, county, ZIP code, and census tract levels. FHFA uses a fully transparent methodology based upon a weighted, repeat-sales statistical technique to analyze house price transaction data. FHFA releases HPI data and reports quarterly and monthly. The flagship FHFA HPI uses seasonally adjusted, purchase-only data from Fannie Mae and Freddie Mac. Additional indexes use other data, including refinances, mortgages insured by the Federal Housing Administration, and real property records. All the indexes (including their historic values) and information about future HPI release dates are available on FHFA’s website: https://www.fhfa.gov/HPI. The next HPI report will be released on January 27, 2026, and will include monthly data through November 2025. https://www.fhfa.gov/document/MonthlyHPI_December2025.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Sure they did",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home prices are getting slightly more affordable.",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Article hours before said increase of 1.4%, now homes more affordable... Man, just talking heads unsure what to say at this rate.",
                "author": "Alexandratta"
            },
            {
                "raw_content": "Build more houses.",
                "author": "DizzyMajor5"
            },
            {
                "raw_content": "Only slightly. But the insurance companies are ready to gobble up any savings",
                "author": "KevinDean4599"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Claude code team shipping features written 100% by opus 4.5",
        "score": 444,
        "text_content": "[https://x.com/bcherny/status/2004897269674639461](https://x.com/bcherny/status/2004897269674639461)",
        "comments": [
            {
                "raw_content": "I know this isn't recursive self-improvement, but it's pretty damn incredible. Not sure where we'll be even 2 years from now based on all of this acceleration.",
                "author": "roiseeker"
            },
            {
                "raw_content": "Based on how to decipher “written 100% by Opus 4.5,” the implications in between have a huge gap. I have basically never written a line of code by hand this year so far, yet I still have to select exact lines of code and instruct the code agent precisely on what to do next. If I only give a grand goal without detailed guidance, the code agent can easily go miles away and never come back to the right track, which wastes a lot of tokens and renders the whole project unrecognizable. For me, I can safely say that AI has written 99% of my code, but the effectiveness it brings is truly limited. By the way, I have recently started working on a code agent project for learning purposes. Once you understand the internal mechanism of a code agent, you realize there’s no magic in it other than just pure engineering around file editing, grep, glob, and sometimes JSON repair. The path to a truly autonomous coding system that can scale to a vast scope is still a long run.",
                "author": "Worried-Warning-5246"
            },
            {
                "raw_content": "Opus 4.5 is a turning point where the majority of specs can be implemented without steering or intervention. His timeline is not surprising at all.",
                "author": "trmnl_cmdr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why can't the US or China make their own chips? Explained",
        "score": 1564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was explained that chip making is difficult but nowhere does he say why the US and China are not capable",
                "author": "LilBoneAir"
            },
            {
                "raw_content": "I’m curious who in the hell figured this all out.",
                "author": "Thatdewd57"
            },
            {
                "raw_content": "Knowledge, machinery, time, money There are very few suppliers of the super hitech manufacturering machines. The ROI of building the facility, training and recruiting staff, other things, is not there.",
                "author": "Feisty-Hope4640"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 Pro new SOTA on FrontierMath Tier 4 with 29.2%",
        "score": 289,
        "text_content": "I've use 5.2 Pro quite a lot now and can definitively say it's the best model for math by far, this just solidifies that.",
        "comments": [
            {
                "raw_content": "I thought OpenAI was dead. What happened? /s",
                "author": "NyaCat1333"
            },
            {
                "raw_content": "That's a big jump. OpenAI still got it.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "That xAI guy predicting super-human mathematician by June 2026 might be correct.",
                "author": "BagholderForLyfe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Futures Model (Dec 2025): Median forecast for fully automated coding shifts from 2027 to 2031",
        "score": 23,
        "text_content": "The sequel to the viral **AI 2027** forecast is here, and it delivers a sobering update for fast-takeoff assumptions. The **AI Futures Model** has updated its timelines and now shifts the median forecast for **fully automated coding** from around 2027 to **May 2031.** This is not framed as a **slowdown** in AI progress, but as a more realistic assessment of how quickly pre-automation research, evaluation & engineering workflows actually compound in practice. In the December 2025 update, model capability continues to scale exponentially, but the **human-led R&D phase before full automation** appears to introduce more friction than earlier projections assumed. Even so, task completion horizons are still shortening rapidly, with effective **doubling times measured in months, not years**. Under the same assumptions, the median estimate for **artificial superintelligence (ASI)** now lands around **2034**. The model explicitly accounts for synthetic data and expert in the loop strategies, but treats them as **partial mitigations,** not magic fixes for data or research bottlenecks. This work comes from the **AI Futures Project**, led by Daniel Kokotajlo, a **former OpenAI researcher** and is based on a **quantitative framework** that ties together compute growth, algorithmic efficiency, economic adoption and research automation rather than single-point predictions. Sharing because this directly informs the core debate here around **takeoff speed,** agentic bottlenecks and whether recent model releases materially change the trajectory. **Source: AI Futures Project** 🔗: https://blog.ai-futures.org/p/ai-futures-model-dec-2025-update",
        "comments": [
            {
                "raw_content": "Nice. 2031 for basically AGI is only 5 years and that's if we dont have breakthroughs in between. Also Stargate goes online in 2028 so if we cant achieve AGI by code, then brute force will be an option",
                "author": "RezGato"
            },
            {
                "raw_content": "Than they lose the race",
                "author": "Worldly_Evidence9113"
            },
            {
                "raw_content": "After the brief \"We are so back\" phase with Claude Code, we have now re-entered \"it's so over\"",
                "author": "SrafeZ"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Yes it is",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "gpt 5.2 in codex too.",
                "author": "Due_Plantain5281"
            },
            {
                "raw_content": "If you are talking about programming - yeah, maybe. It did a good job creating couple of PowerShell scripts for automation. But i generally prefer Gemini 3 for stupid questions and GPT-5.1 for creative writing (because it's yapping and yapping non-stop, instead of being turbo-condensed).",
                "author": "my_fav_audio_site"
            },
            {
                "raw_content": "As amazing as Opus 4.5 is, I use Composer 1 far more. So much faster and more efficient.",
                "author": "Nedshent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Softbank has fully funded $40 billion investment in OpenAI, sources tell CNBC",
        "score": 346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Back in Feb when the deal was signed](https://www.cnbc.com/2025/02/07/softbank-set-to-invest-40-billion-in-openai-at-260-billion-valuation-sources-say.html), it was said that \"SoftBank would pay out the funding over the next 12 to 24 months\", so it's pretty wild to see them getting the full $40 billion to OpenAI in just 10 months",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "And now Amazon is potentially putting in another $10 billion just to get OpenAI onto their trainium chips? OpenAI is basically collecting the infinity stones of tech partners: Microsoft (cloud), SoftBank (cash) and Amazon (chips)",
                "author": "jravi3028"
            },
            {
                "raw_content": "I'm honestly surprised. Beyond that, I know lots of \"It's a bubble\" people thought this money from SoftBank wouldn't actually appear",
                "author": "TFenrir"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: Capital raised and free cashflow (projected)",
        "score": 26,
        "text_content": "Source: Economist/PitchBook full article: [OpenAI faces a make-or-break year in 2026](https://archive.ph/KdFSJ) : One of the fastest-growing companies in history is in a perilous position",
        "comments": [
            {
                "raw_content": "I’m a big OpenAI believer but if I built a financial model with that FCF downslope then sudden complete reversal in ‘29 I’d be laughed at.",
                "author": "gggggmi99"
            },
            {
                "raw_content": "I, too, have a genius business plan: 1. capture x% of the global population 2. charge them $y 3. multiply those numbers 4. ??? 5. richest man in the known universe",
                "author": "Motor-District-3700"
            },
            {
                "raw_content": "https://preview.redd.it/t38b9bnx6hag1.jpeg?width=1184&format=pjpg&auto=webp&s=9c29af0dc2b6d7d619c290fee3ef93cd1ed7312f",
                "author": "MercurialBay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Looking back at xAI researcher Christian Szegedy's 2025 predictions",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/a5lxm9j33eag1.png?width=1072&format=png&auto=webp&s=d204fcf40fb33c5041b0a13cd369466d256f9a4d These are preliminary results.",
                "author": "Profanion"
            },
            {
                "raw_content": "What was the current ARC in Feb 2024?",
                "author": "Ijustdowhateva"
            },
            {
                "raw_content": "FYI: current ace in February was the acr 1. We are at 90.5% currently. There’s still a day left in the year, but unlikely something is released tomorrow. It seems like his prediction is close, but maybe a few months too optimistic. By April we’ll probably be there. I think the next grok is coming in January or February? And that one might get the 95%, it’s supposed to be pretty good. So all in all, with all the predictions I’ve seen: they are optimistic, but by no means off. So optimistic is maybe not even the right word. Because these things are happening. The predictions are just a tad early.",
                "author": "Longjumping_Kale3013"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Filtering AI content is kind of pointless.",
        "score": 20,
        "text_content": "When it comes down to it, you really can't prove that anything is made without AI anymore. Even process videos don't prove that something is real because that can be generated too. Sure some things are obviously AI, but some things you'd never know unless somebody told you. So assume everything is made using AI until proven otherwise. Idk how to explain it, but you'll see a beautiful video shot on film and all the comments will be like \"this is why we need to protect human artists\" when they were never at risk to begin with. AI does affect artists financially as most companies want to optimize for the cheapest, fastest way to get the biggest return - but it doesn't mean that art is worthless because you can't sell it for as much. Starry Night was worthless when it was painted, but it's one of the most iconic works of art in our time. People still recognize stories and respect skill. 3D animation has largely \"replaced\" traditional animation in filmmaking. Which makes traditional animation carry more prestige when it does pop up. Same idea with video games and pixel art. Idk, I think people are fighting the wrong battles in this AI thing. Like just enjoy things - or don't. I experiment here and there but I do most of my work without AI. Not because I have anything against it or think I'm better than those that do, I just like doing things the old way. If somebody makes artwork using AI good for them - I hope people love what they make. But it has nothing to do with me or what I choose to do. When there's a video with a bad AI slop voice with bad facts or whatever, I don't dislike it because it's AI slop - I dislike if because it's SLOP. I also kind of reject the whole \"AI art isn't art\" idea simply because having access to AI doesn't mean you make good things. If that were the case everyone with ChatGPT would have sold an award winning script, and everyone with Veo would have 1M followers or something. You have to have good creative direction to make something that people care about.",
        "comments": [
            {
                "raw_content": ">When it comes down to it, you really can't prove that anything is made without AI anymore. Even process videos don't prove that something is real because that can be generated too. Sure some things are obviously AI, but some things you'd never know unless somebody told you. Ultimately if AI and human work is truly indistinguishable, that would be amazing for me. It is surely already that way for many people. Right now, the chief hallmark of an AI work is a class of mistakes and lack of care that signal the work's creation by a mind that lacked passion and specific expertise and is making up for this by empty form. I don't mean an emotional passion. I mean a passion that signals an interest in the material sufficient to comprehend it, and to communicate it to an audience. **People who spam AI generated work often do not care about either the material they are trying to generate with AI, or the audience they are hoping eats their slop. They think that an AI can compensate for their ignorance and are satisfied with shallow impressions of competence. And this lack of care makes it identifiable.** I see many AI-enabled creators make works that do show they put some thought into how their work will be consumed and carefully curate what they show to their audience. That respect the limitations of their AI medium. There's no issue with those works. You can even call those things proper AI art. But I also reject that people with sufficient discrimination will be unable to distinguish AI art. The hallmark of AI slop is ultimately that it \\*reeks\\* of a lack of depth, a lack of care, a lack of skill.",
                "author": "YoAmoElTacos"
            },
            {
                "raw_content": "This thread about voiceover artists, graphic designers and other real stories of people who have lost their jobs or have had their roles drastically altered due to AI, keeps me up at night. “Hey people who lost their jobs to AI, what happened?” https://www.reddit.com/r/AskReddit/s/SChYKkz2RW",
                "author": "Greedy_Commercial961"
            },
            {
                "raw_content": "I think you're deeply misunderstanding the market and markets in general. I'll try to explain it as concisely and directly as I can. Yes, the best traditional artists will still do well. But a lot more artists won't be able to make a living. If companies and customers now get 50% of their stuff from AI, they realistically need 50% less traditional art. That means half as much money to potentially support traditional artists. It was already not a secure field to begin with so a lot of people will just no longer be able to afford to be an artist as their primary job, and the ones who do stick with traditional art will be poorer and more stressed as demand falls. I'm not anti AI, but we need to be realistic about the benefits and drawbacks of AI if we're going to make good choices about it. Pretending it doesn't cause any harm (as opposed to thinking the harm it dies is outweighed by the benefits) is not helpful.",
                "author": "MentionInner4448"
            }
        ],
        "subreddit": "singularity"
    }
]