[
    {
        "post_name": "I never realized how retarded Alex Soros is. He uses a large vocabulary to spew word salad: “One man, Donald Trump, literally came in and just took that, took that, took that all away. Ehm, you know so, ehm, you know…”",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One man, George Soros, literally came in and corrupted that AG, corrupted That AG, corrupted THAT AG, just took impartiality away from the justice system, you know so uh errm.... I don't know if this little twat is just doing what he thinks his father wants or if he's just as evil, but that family needs to be dealt with like the domestic terrorists they are. There's damn good reasons why they have been banned from other countries.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Imagine he is at that forum simply because he is a rich guys son.",
                "author": "CyanScales"
            },
            {
                "raw_content": "That's probably how he sounds as Huma is drilling him with a strap on. These types of fake intellectuals never say anything of substance. If you listen to any of these self proclaimed elites you come to realize just how far we have fallen for these fucks to be anywhere near levers of power or leadership. Hope someone memes the fuck out of this goobers spewing.MAGA AF ONLY",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump is evil...",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is that you, Bee? Because this is way too accurate.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Link - https://babylonbee.com/news/dems-warn-ice-crackdowns-will-make-illegal-immigrants-afraid-to-vote",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Not far away from a real article.",
                "author": "FBJ_WoodChipper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals in San Francisco jump and stomp on a Waymo vehicle that was in mid-transport taking a passenger to their destination:",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, I love living way out in the country!",
                "author": "SmartyPants"
            },
            {
                "raw_content": "The waymo staff should have just overrode and drove off….oops they broke it and it malfunctioned sorry they got squished",
                "author": "Nomad899"
            },
            {
                "raw_content": "Remove the savages from this soil.",
                "author": "MeMargie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "With over two decades in the intel community and former CIA Station Chief for Caracas, I watched administrations talk, appease, and retreat. I can tell you plainly: this is how you stabilize Venezuela. You don’t demand instant transformation or chase regime change. You align incentives.",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sorry, spook. don’t know why i even doubted you.",
                "author": "bearhugprolapse"
            },
            {
                "raw_content": "I am so tired of hearing everyone complain all the time about Donald Trump. All over the world and all over our country both red and blue all they do is complain. God put Donald Trump there for a reason and he is doing his part in the service of God. I would not call complaining constantly anything but the enemy of God. I believe this bible verse with all my heart that what man meant for evil God makes something good out of it for those who love him. Genesis 50:20 20 As for you, you meant evil against me, but God meant it for good, to bring it about that many people[a] should be kept alive, as they are today.",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "We know he must be telling the truth, because that approach has worked so well over the last two decades.",
                "author": "FriendOrFoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kaitlin Bennett was just charged and fined after refusing orders to leave a public area while interviewing Democrats in Florida. Conservatives are being charged for interviewing people in public while Don Lemon gets to break into churches.",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pam Bondi will ignore this too",
                "author": "awsure"
            },
            {
                "raw_content": "Boomer will be taking a forced retirement shortly for his false charges, violating the rights of conservative *journalist* Kaitlin Bennett.",
                "author": "peterthegreen"
            },
            {
                "raw_content": "Republicans are not a serious party. I'm ready to just check out of following politics completely because it's just too infuriating to watch the left constantly go nuts while the right twiddles their thumbs.",
                "author": "ionian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fire the hospital staff immediately.",
        "score": 1169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sue the hospital and the city of NY.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Shit, odds are they are ALL illegal H1B's anyway, we don't have any Americans working in the health care, Indians, Chinese, and Philippines, that is all. ALL my Doctor friends are getting the fuck out after Obama care kicked in",
                "author": "mikethemarine"
            },
            {
                "raw_content": "These fuckers gave my dad french fries when he was on dialysis. Damaged him permanently. We promptly moved him out of New York State, was only there because of his retirement healthcare.",
                "author": "OregonRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why mail in ballots must be banned:",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It violates chain of custody, and if the country weren't full of fucking retards it wouldn't even be a question.",
                "author": "terribletwos"
            },
            {
                "raw_content": "Mail in ballots are federally funded, left-wing, union voter fraud.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Several states have already enshrined mail in voting. Unless we ban it nationally, those states will always be within the clutches of the left.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hope that person got fired.",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're going to harm the dogs. This has to be shut down now.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Fired? Likely the employee will be promoted with a $500,000 donation via GoCuckMe",
                "author": "Doritalos"
            },
            {
                "raw_content": "They're eating the dogs",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A liberal judge has THROWN OUT the ONLY Republican U.S. Congressional seat in New York City",
        "score": 1136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Republicans are scared to do what democrats have already done. There will never be another republican senate or house which will then lead to no America. Way to go inactive old people",
                "author": "j2daeww"
            },
            {
                "raw_content": "Wow, l didn’t expect the Democrats to do EXACTLY WHAT THEY’VE BEEN DOING FOR THE LAST THREE DECADES.",
                "author": "Trump454748"
            },
            {
                "raw_content": "Commies going for the throat, RINOs going for optics.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"We must return to drawing inspiration from Greek philosophy, embrace Roman law, and go back to Christian values!\"",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“erupts” Really? He was reading in a normal tone and volume. There was no erupting. Really tired of the ***ridiculous*** words people use for click bait.",
                "author": "SaltyTitties4"
            },
            {
                "raw_content": "His accomplishments in Argentina have been beyond anything I could imagine. If he retains control long enough, they will boom beyond imagination.",
                "author": "Kolob64"
            },
            {
                "raw_content": "Shagadellic, baby!!",
                "author": "no_antifa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Immigration and Customs Enforcement 18 U.S.C. § 111 FAFO",
        "score": 667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would swear those directions were a parody 😂 \"find specific black and brown folks and let them know you are there to protect them.\" That's right, black people: you need a crowd of blue-haired Karens to defend you.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "White savior complex.",
                "author": "FromTheTopRope"
            },
            {
                "raw_content": "Judging from the black on White crime statistics, White folks have been 'putting' their bodies in harms way \"to make sure black folks are not subject to police violence\" for quite some time.",
                "author": "CaptRied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ben Garrison: Starfleet Learing Academy",
        "score": 902,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reminds me of the good old days of Mad Magazine before they went woke.",
                "author": "boredrandomguy"
            },
            {
                "raw_content": "The garbage can Enterprise...",
                "author": "Tookens"
            },
            {
                "raw_content": "They even used a failing comedian. Stephen Colbert is the Digital Dean of Starfleet Academy.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AWFUL",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rage bait. Don't take it.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "ugly cunt",
                "author": "etcetera"
            },
            {
                "raw_content": "The empty egg carton is just jealous",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Byron York nails Trump’s Greenland play: Classic Art of the Deal! “He asks for ten times what he wants, the other side freaks out, huge news cycle, back & forth, then they settle for what they could’ve had day one.”",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I said this myself a couple hours ago: it's classic Trump to intentionally escalate things to the brink, then \"settle\" for what he wanted, making the other side think they \"won\", despite the fact that they effectively handed him the thing he wanted from the start. Best part is, because they're all hopped up on globalist rhetoric and TDS, they don't even realize they got played. Trump just secured the entire northern border of the US from Russian aggression, plus probably mineral rights down the road, and all it took was a couple memes. It shows how retarded and up their own collective keisters the EU fops have become; no wonder they'll be a caliphate in a decade or two.",
                "author": "LabTech"
            },
            {
                "raw_content": "Of course. He wrote a book about it. Art of the Deal",
                "author": "Powhattan"
            },
            {
                "raw_content": "This doesn’t make sense to me we didn’t gain anything here. We build more bases we could have built anyways under the current agreements and we also spend money to defend the new bases… what exactly did America win here?",
                "author": "WhatTheActualFuckS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Gov. Newsom Davos Talk Canceled at the 11th hour. 😂🤣😂🤣😂😂🤣😂🤣",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's an idiot. His stupid meltdown was supposed to be some sort of leadership moment. He is just a wine soaked puppet in it for the perks of power.",
                "author": "shadypollster"
            },
            {
                "raw_content": "Remember when Trump canceled Pelosi’s airline trip as she was loading her luggage onto the bus. KEKKKKK",
                "author": "fthecoup"
            },
            {
                "raw_content": "Governor Trudeau was already there. We don't need another incompetent governor.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Read it and weep.",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’d prefer we left nato. Stand on our own. It’d be a lot cheaper if we did.",
                "author": "Filo76"
            },
            {
                "raw_content": "We always were. We are just subsidizing an ever increasing number of leeches and ingrates",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Leaving NATO could be the best favor we could do for them. They would have to cut some of their social programs they love so much and allocate it for defense. That would mean no more free rides for the rapefugees they love so much. Britain paid 5.4 billion on asylum support for refugees in 2023 - 24. It's projected to cost another $15 billion over the next decade according to the National Audit Office. They paid $60 billion on defense for the fiscal year 24 -25. It's looking to be about 73 billion by 28 -29 given the new 2% GDP guidelines. That money's gotta come from somewhere, and that's with us picking up most of the tab.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kek 😂🤣😂",
        "score": 1281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where's the satire?",
                "author": "45fan"
            },
            {
                "raw_content": "For the first time in a long time, I legit laughed out loud. 😂😂😂",
                "author": "McFatty7"
            },
            {
                "raw_content": "I, for one, am certain that this is not AI. This is exactly how this cuck should be treated every where he goes.",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You can point this out with empirical evidence and the commies will call you a liar.",
        "score": 1556,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, you mean the Brown Bomber actually did something right for once?",
                "author": "MythArcana"
            },
            {
                "raw_content": "I remember thinking that was a bad thing at the time. All depends on who's steering the ship.",
                "author": "airborne3502"
            },
            {
                "raw_content": "[COURT SIDES WITH DHS: Federal court OVERTURNS activist judge who tried to ban federal agents from using necessary force to repel obstructionist leftists in MN](https://x.com/EricLDaugh/status/2014064414660448569)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Under Greenland deal, Denmark would give the United States sovereignty over small pockets of Greenlandic land where the United States could build military bases, according to three senior officials familiar with the discussion — NYT",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like the same deal we already had",
                "author": "Cali_kid"
            },
            {
                "raw_content": "So we build bases and defend it for nothing?",
                "author": "PapaPepe"
            },
            {
                "raw_content": "That's literally the current deal.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California lawmakers push back against offshore oil drilling",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck them. I hope gas in Californistan goes to $14.00 per gallon.",
                "author": "pookiee68"
            },
            {
                "raw_content": "California lawmakers love pushing back against anything they can find. I'm sure it's a whole orientation out there.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "They can have all the feefees they want. It’s not California’s decision.",
                "author": "Snek_Plissken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft CEO warns that we must 'do something useful' with AI or they'll lose 'social permission' to burn electricity on it",
        "score": 1673,
        "text_content": "All the b200s in the world won't convince someone that AI is good if their electric bill triples in a couple of years.",
        "comments": [
            {
                "raw_content": "Here are some ideas. Put data centers near peoples house so they cant sleep in peace they have to pay higher electricity bill and water bill. Buy up all the silicon so normal people cant buy anything like RAM, SSD. People will have to pay more for everything. Shove AI down everyones throat. Put AI on everything. Make all the software worse. Lay off thousands of people.",
                "author": "ar1fur"
            },
            {
                "raw_content": "Maybe they should work at replacing CEOs with AI first, to offer the most value back to the shareholders. Let's trade in the highest paid employee (one who doesn't make good decisions) to prove that AI can bring value to the company, by having the AI also make poor decisions ( but for less money). Everyone wins.",
                "author": "AvailableProduce5241"
            },
            {
                "raw_content": "Hopefully the first of many such statements to come signaling that the party is over.",
                "author": "TwoTimeHollySurvivor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "'NVIDIA Contacted Anna’s Archive to Secure Access to Millions of Pirated Books' - TorrentFreak",
        "score": 665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "modaF-- Anna's Archive literally had a domain seizure a few days ago. (Because piracy). It's all over their subreddit. If it's legal for NVIDIA to use the data curated there, for commercial purposes, it should be legal for the rest of us too, for educational and non commercial use.",
                "author": "StayingUp4AFeeling"
            },
            {
                "raw_content": "Literally the most valuable company on the planet and easily has the money to pay for legitimate access without breaching copyright but is too lazy, cheap and lacking of respect for copyright holders ability to say \"no\" to consider putting that much effort in.",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "I really don't care about copyright protection, but this spelling trouble for Anna's Archive would be very unfortunate",
                "author": "LockingSlide"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NotebookCheck: \"NexPhone puts Android smartphone, Windows Phone and Windows 11 PC in one device\"",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's such a cool concept but I fail to come up with any legitimate use I would have for windows on a phone, especially one with such a dated CPU.",
                "author": "Tasty-Traffic-680"
            },
            {
                "raw_content": "Hello Dakhil! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kioxia exec says the AI boom means the era of the cheap 1TB SSD is over —company's NAND supply is sold out for this year and likely through 2027",
        "score": 370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Translation: F\\*\\*\\* you consumers, it's all about the datacenters now. I hate this timeline.",
                "author": "shadowtheimpure"
            },
            {
                "raw_content": "These headlines basically mean that almost all people on the planet will pay \"invisible AI tax\" in one way or another. Even if some people won't consume regular electronic devices directly, they will anyway pay this tax indirectly because TVs, cameras, medical computers, workstations used by engineers, and all kinds of vehicles and planes (basically everything that has a CPU and requires RAM or NAND memory) will cost extra.",
                "author": "smiling_seal"
            },
            {
                "raw_content": "I was checking a Kioxia 2TB drive about a month back, price doubled around 2 weeks ago.",
                "author": "-WingsForLife-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[2kliksphilip] I put all upscalers to the test in 2026. One beat the rest",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMAO Phillip went the extra mile: [https://www.youtube.com/watch?v=ge8K6m6JX9I](https://www.youtube.com/watch?v=ge8K6m6JX9I) 137 x 77 internal res. Considering how good DLSS is starting to get maybe NVIDIA should add Extreme performance mode with DLSS5. 540P -> 4K or 5K xD",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Summary for the video (and ranked according to 2kliksphilips opinion): DLSS 4.5 Preset L > DLSS 4 Trans (built-in) > DLSS 3 CNN (built-in) > FSR4 > XeSS 2 XMX > XeSS 2 D4a > FSR 3.1 Keep in mind, it's 360p to 720p upscaling. Personally I prefer less shimmery than sharpness so I pretty much agree with 2kliks ranking.",
                "author": "Fritzkier"
            },
            {
                "raw_content": "Back in 2020 all PC upscalers seemed like a joke to me. FSR1/DLSS1 definitely earned that reputation as you can see in the video. They looked like shit. I thought the trend would die out like HairWorks did. It got better over time. DLSS 2.x felt like a major hurdle had been passed. And I thought okay maybe it's not so bad; maybe they'll never convincingly feign higher resolutions but if upscalers can visually outperform the lower render resolutions at the same or higher FPS, that's useful. Intel/Radeon/NVIDIA now all offer something capable of doing that. But now we've reached a point where some upscalers can feign the higher resolutions frighteningly well. DLSS4.5 does 360p->720p while looking basically the same as 720p 9xSSAA (in other words 4k downsampled to 720p). If you think how many pixels are involved in the former and the latter, it's an insane result. And this behavior transfers to higher resolutions too, actually works even better there since artifacts are harder to notice the more pixels there are in total. Skepticism was absolutely warranted, once. I was a skeptic. And upscalers today still have room for improvement. But at this point dismissing upscalers out of hand feels less like a technical perspective more like stubbornly dying on a stupid hill that no longer makes any sense. You can see as much in the video where the \"native is king\" raw 360p looks worse than even the worst upscaler alternatives.",
                "author": "KekeBl"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Moves Custom HBM Logic Die to 2nm Foundry Process for the First Time",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well is the first time they have the 2nm process so I assume it hast to be the first time...",
                "author": "milyuno2"
            },
            {
                "raw_content": "Is their 2nm that good?",
                "author": "railagent69"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[KitGuruTech] Montech NX600 vs Thermalright Peerless Assassin 120 SE V3 - Budget cooler shootout",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Written review: https://www.kitguru.net/components/cooling/james-dawson/montech-nx600-cpu-air-cooler-review/",
                "author": "kikimaru024"
            },
            {
                "raw_content": "Thumb is kinda clickbaity, but harmless... Heatpipe cooling peaked a long time ago, honestly the last place to have FOMO is in the cpu cooling department",
                "author": "Positive-Road3903"
            },
            {
                "raw_content": "I wish someone could test both with the same Noctua fans",
                "author": "lutel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Taps Ex-Arm, HPE Exec For Data Center Systems Post Amid AI Reorg",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oddly not mentioned in the article, but per his LinkedIn: @ Arm for 18 months @ HPE for 13 years So probably for the HPE work more than Arm. Otherwise, it would’ve been quite a reversal. 10 years ago, few at Intel would look to Arm employees for datacenter experience.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Interesting moves, why do they hunt for experts in ARM architecture, should we expect significant changes in the x86 architecture?",
                "author": "JimmyEatReality"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokemon officially coming to Universal Studios Japan",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zelda area next 🙏",
                "author": "BOBBIESWAG"
            },
            {
                "raw_content": "50 bucks it's a 4D movie",
                "author": "disneydude1231"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Have you guys noticed since the release of the Switch 2, more developers started adding cross-progression to their games?",
        "score": 129,
        "text_content": "This is honestly really good and i am happy that is happening ☺️ most games should have this as a feature",
        "comments": [
            {
                "raw_content": "I feel like cross progression is such a huge feature for selling games. People will literally buy your product TWICE",
                "author": "theallgolden"
            },
            {
                "raw_content": "Would love to see more and more of this. Hopefully it happens for Elden Ring when that releases.",
                "author": "fatherplains"
            },
            {
                "raw_content": "Cross save should be the standard for all third party and indie games.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World Version 1.5.0 is now available",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "General: * Added team races to Knockout Tour when playing in a room during “Online Play” and “Wireless Play”. * The game now supports the Polish language. Note: You can change your selected language using the “Language” setting in the “System” menu of “System Settings.” Fixed Issues: * Fixed an issue where the game would sometimes end if a player plays as Kamek on Choco Mountain. * Fixed an issue where the displayed rating would sometimes be incorrect when joining “Everyone” in “Online Play” while in a room. * Several other issues have been addressed to improve the gameplay experience.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Updates are decent but I would’ve expected banger after banger content updates for how big they made this game seem",
                "author": "Heyoayyo"
            },
            {
                "raw_content": "Still waiting for donkey kong to have bananza skins added",
                "author": "MrUnexcitable"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reversible Covers are Awesome",
        "score": 570,
        "text_content": "I wish more switch 2 games did this. Such a simple touch but it’s really cool.",
        "comments": [
            {
                "raw_content": "im sorry you dont like SWITCH 2 mario SWITCH 2 EDITION + EPIC FUN PAK SUPER DLC EPIC CLOTHES INCLUDED THIS PACKAGE CONTAINS THE NINTENDO SWITCH VERSION AND THE NINTENDO SWITC2 VERSION. IT IS PLAYABLE ON NINTENDO SWITCH AND NINTENDO SWITCH 2. PLEASE SCAN QR CODE QND VISIT WWW.NINTENDO.HELPME.THEYDONTPAYME.CO.JP FOR MORE INFORMATION ?",
                "author": "trippykitsy"
            },
            {
                "raw_content": "If Rebirth and Part 3 also have reversible covers, it would be really cool if they connected with each other to make a larger artwork.",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "i like it and even prefer it but I wish the switch 2 logo was there to make everything consistent",
                "author": "mattbattmatt_yt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A Version 2.0.1 is now available",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Adjustments Applied for Obtaining Items:** * When purchasing Berries from a food stall, you can now purchase multiple Berries at once. * After beginning the story of the Pokémon Legends: Z-A – Mega Dimension DLC, you will be able purchase Berries from the clerk at Nouveau Café’s Truck No. 3. * The maximum number of Mega Shards you can carry has been increased from 999 to 9,999. **Fixes Applied for the Following Confirmed Issues Related to Pokémon Legends: Z-A – Mega Dimension Content:** * When using moves in certain pockets of hyperspace, Pokémon may sometimes have faced a different direction from the intended target. * There were cases in which the weather remained sunny and did not change. * Shiny Pokémon obtained prior to the release of Pokémon Legends: Z-A – Mega Dimension may not have been registered to the Mega Evolution Pokédex, even if their Mega Stones were obtained after becoming available in the DLC. * During missions, images from unrelated scenes may occasionally have been displayed. * Players may not have been able to complete side mission 188 “Start Special Scanning!” even after earning the maximum number of survey points. (Players who are already experiencing this issue should be able to progress after entering and exiting hyperspace.)",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Finally we can buy more than one berry at a time!!",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "That's a berry exciting update",
                "author": "USSGravyGuzzler"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza Version 3.1.0 is now available",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool 🍌 going to start it as soon as I'm done with Metroid",
                "author": "NEKORANDOMDOTCOM"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Snoopy & The Great Mystery Club Coming To Switch 2",
        "score": 215,
        "text_content": "A release date was not announced",
        "comments": [
            {
                "raw_content": "I know a system seller when I see one!",
                "author": "InsertObnoxiousNames"
            },
            {
                "raw_content": "It's a Game Key Card, Charlie Brown",
                "author": "ntwild97"
            },
            {
                "raw_content": "The switch version already maintains a stable 60 FPS on Switch 2 and has better loading times, what's the point? unless it's a graphical upgrade of course",
                "author": "Frequent-Baby2614"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital foundry Final fantasy remake integrade review",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tldr Texture quality much closer to the PS5 version than PS4 and is just overall superior to PS4 1080p docked 720 internal in handheld basically locked 30 in both modes Load times are faster than PS4 but much slower than PS5",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "Tbf no one had doubt about Remake but I’m very curious how Rebirth will handle itself on switch 2",
                "author": "Dry-Cod9127"
            },
            {
                "raw_content": "All the reviews about the port seem extremely positive so far, i’m very excited to try the game again on a new platform.",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 01/19/26❄️",
        "score": 35,
        "text_content": "[forsenAlright](https://pbs.twimg.com/media/G_N1QjwXIAEc1JR?format=jpg&name=medium) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [GTA 6 - Leak Compilation](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qghv7j/gta_6_leak_compilation/) * [Paul Tassi: Have learned that Highguard did not actually pay for that Game Awards finale spot. Was just the show putting it there](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qer8hj/paul_tassi_have_learned_that_highguard_did_not/) * [Bethesda isn't shadow-dropping Fallout 3 and New Vegas Remasters any time soon](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qidv6o/bethesda_isnt_shadowdropping_fallout_3_and_new/) * [RTX 5070 Ti 16GB & RTX 5060 Ti 16GB discontinued.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qdi4of/rtx_5070_ti_16gb_rtx_5060_ti_16gb_discontinued/) * [The new life is strange game. My buddy told me things](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qi16qw/the_new_life_is_strange_game_my_buddy_told_me/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "I'm sorry, but I'm still stunned by what happened today. Ubisoft invested so much in the Sands of Time remake that they restarted production, and then they just cancel it. What state was the game in?! Jason said it didn't impress the executives, but spending so much money and time only to cancel the project left me speechless. Five years down the drain.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "KOTOR Remake that leads to a KOTOR 2 Remake Also bring Iron Giant to Fortnite",
                "author": "seceralnof"
            },
            {
                "raw_content": "so when are people think the next direct likely would be?",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson on Prince of Persia: “Found out today it was pushed to late March in December for further polishing (…), and canned today”",
        "score": 795,
        "text_content": "He also said that the original plan for PoP, as reported in November, was to release on January 16th. He couldn’t get any updated info because of the Ubisoft breaches (which are still ongoing). He clarified he never said it was going to be a shadowdrop, those rumors started because marketing didn’t start in December as it was planned and “was a story made up by aggregators, who literally created a fake website based on that rumor”. Source: https://xcancel.com/\\_Tom\\_Henderson\\_/status/2014084476633043235#m",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "WTF MAN cmon",
                "author": "Fluke_Skyflopper"
            },
            {
                "raw_content": "I don’t understand how they let a game get this close to completion and just pull the plug? Just release it at this point, you’ve already dumped money into it and you can at least recoup some of the cost.",
                "author": "KingMercLino"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Beyond Good & Evil 2 Is Still In Active Development",
        "score": 500,
        "text_content": "[https://insider-gaming.com/exclusive-beyond-good-evil-2-survives-ubisofts-project-purge/](https://insider-gaming.com/exclusive-beyond-good-evil-2-survives-ubisofts-project-purge/) Insider Gaming has learned that one of Ubisoft’s longest in-development projects, Beyond Good & Evil 2 has survived Ubisoft’s latest round of project cancellations. Beyond Good & Evil 2 continues to make headlines as the longest-in-development title ever, having been in development since its reveal on May 30, 2008, with a total of 6445 days at the time of writing, or, for those who hate math, 17 years, 7 months, and 22 days. However, the current version of the game has been in development since around 2017, which still means a good 8-9 years of development. Regardless of records and long-ass development timelines, though, Ubisoft still thinks that Beyond Good & Evil 2 has something to give. Despite the recent restructuring that has seen six games cancelled, including the Prince of Persia: Sands of Time Remake, sources tell Insider Gaming that Beyond Good & Evil 2 is still in active development, at least for the time being. In 2023, Beyond Good & Evil 2 saw significant changes with Ubisoft Montpellier being under investigation “over an unprecedented number of developers experiencing burnout and going on sick leave.” According to sources, constant changes, pushbacks, and the lengthy development time have likely cost Ubisoft $500+ million in development costs. But, at least for the time being, Ubisoft feels like it’s a cost that is justified.",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Oh yeah, it’s sunk cost fallacy at this point.",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "Christ, to which government is it tied to this time?",
                "author": "scorchedneurotic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Flag Remake has supposedly been delayed",
        "score": 932,
        "text_content": "https://www.videogameschronicle.com/news/ubisoft-details-major-company-reset-6-games-canned-7-delayed-and-2-studios-closed/ \\>Ubisoft said it’s delayed seven games to ensure they meet quality expectations. It did not say which games had slipped, but confirmed that the seven titles include one title that was planned for release before April 2026, which will now be released before April 2027. This is in the same announcements that said the Prince of Persia Remake has been cancelled. For context, Tom Henderson had earlier said that it was releasing before April 2026: https://www.reddit.com/r/GamingLeaksAndRumours/s/HxVJ5BEmhZ",
        "comments": [
            {
                "raw_content": "game got delayed to enhance the turtle physics and add a shanty writing minigame",
                "author": "themoonandthebonfire"
            },
            {
                "raw_content": "Absolutely no chance the Splinter Cell remake has survived this",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "Not only that but Sands of Time remake is dead now apparently. Edit: It's fully dead. My bad",
                "author": "AwkwardSloth5054"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Flag remake was supposed to launch on March 19th as a digital only release - Tom Henderson",
        "score": 498,
        "text_content": "- The game was planed to go gold in the first week of February Source: https://xcancel.com/_Tom_Henderson_/status/2014065108746490310#m",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I am still denial that it might release on March.",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "Look what they took from us 😭 (Hopefully the delay makes it even better)",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kensuke Tanabe, Metroid Prime series producer, reportedly retiring from Nintendo.",
        "score": 435,
        "text_content": "It came from an interview he gave with magazine Nintendo Dream, translated by Weibo. He reportedly said Prime 4 was his last game in the series then later said it was his last game with Nintendo. He doesn’t know if there’ll be another Prime game. https://www.videogameschronicle.com/news/veteran-nintendo-producer-kensuke-tanabe-known-for-metroid-and-paper-mario-reportedly-confirms-retirement/",
        "comments": [
            {
                "raw_content": "I think this is gonna be the generation where we see a lot of \"final games\" from that old guard that's been with Nintendo since the '80s. Kinda surprised Tanabe's the first confirmed since he started a *bit* later than some others (though still a long-timer, dude worked on things like Doki Doki Panic and LttP), but I expect before the end of the Switch 2's time we'll also be seeing folks like Tezuka, Aonuma, and Sakamoto formally stepping away from game development. Fortunately it does seem like Nintendo and its old heads have by and large done a pretty solid job of making sure there's capable hands ready to take over for them and hopefully make the transition relatively smooth. Tanabe for instance shouts out Risa Tabata as someone who's likely to produce any future Prime games (she notably produced the Thousand-Year Door remake, which is a series Tanabe's usually attached to)",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Started at Nintendo in 1986 when he was 23 years old. He turns 63 next week. His list of credits is nuts. He had one hell of a run in the industry. Definitely made his mark. Wouldn't be surprised to see more Nintendo legends from that era retire soon.",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "I actually quite like Metroid Prime 4 despite some kind of weird decisions but we'll probably never find out who made them. With that said, if there is no Metroid Prime 5 then the ending definitely gets much worse.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Highguard Trophy List",
        "score": 29,
        "text_content": "https://www.exophase.com/game/highguard-psn/trophies/ Surprisingly, it's still alive.",
        "comments": [
            {
                "raw_content": "So lemme get this straight. - magitech setting - objective based - heroes and teamplay focus - itemization and loot Welcome back Battleborn.",
                "author": "UnholyPantalon"
            },
            {
                "raw_content": "I feel so bad for the devs because of Geoff just making it the last game on TGAs, if it was inserted earlier, people wouldn't want it to fail as much as they want it to",
                "author": "LadyValtiel"
            },
            {
                "raw_content": "I'll say that it's just a weird situation all around when it comes to Highguard. People are shitting on Geoff but even in his case, he saw a game he really liked, from a studio he really liked, and offered them the grand finale spot. He was just being earnest, and come to think of it, would *anyone* be talking about this game as much as they are now, if it was just a random trailer in the middle of the show? All publicity is good publicity when it comes to playercounts.",
                "author": "ChiefLeef22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[MEGATHREAD] Xbox Developer Direct 1.22.26",
        "score": 222,
        "text_content": "|| |:-:| |**Xbox Developer Direct 1.22.26**| |**Date/Time:** January 22, 2026 [12PM CST](https://dateful.com/eventlink/2580502741) (Click for your Timezone) | |**Where to Watch:** [Xbox's Youtube](https://www.youtube.com/watch?v=hXn6bvU1Kh4), [IGN's Youtube](https://www.youtube.com/c/IGN) | |**[What to expect](https://news.xbox.com/en-us/2026/01/08/xbox-developer-direct-2026/)**",
        "comments": [
            {
                "raw_content": "I want TES6, FO3 and FO new vegas shadowdropped tomorrow",
                "author": "bahia80002"
            },
            {
                "raw_content": "Hearing about Game Freak on an Xbox stream will never not sound weird to me.",
                "author": "TadeoTrek"
            },
            {
                "raw_content": "Funny how people throught few days ago that Prince of Persia Remake would be a shadow dropped in this event. And now it's cancelled lol.",
                "author": "TheCattBaladi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kknowley: Another round of Major layoffs at Starbreeze (Payday) this morning, targeting Payday 3.",
        "score": 220,
        "text_content": "https://xcancel.com/TheKknowley/status/2014003956389679235",
        "comments": [
            {
                "raw_content": "Payday 3 and Killing Floor 3 hurt so much. They had really good foundations in the prior games and they said “nah, forget all of that.” Hope they’re able to turn both of those around at some point.",
                "author": "TheOJsGlove"
            },
            {
                "raw_content": "Yeah it's DEAD dead now. What a shame. Hopefully they sell the IP to more competent people.",
                "author": "The_Black_Strat"
            },
            {
                "raw_content": "Starbreeze has been a walking corpse for a while now.",
                "author": "GoodSelective"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 26.1.1 Release Notes",
        "score": 395,
        "text_content": "# Highlights * **New Features** * Optional install of [AI Bundle](https://www.amd.com/en/blogs/2026/amd-software-adrenalin-edition-ai-bundle-ai-made-si.html) * **New Product Support** * AMD Ryzen™ AI 9 HX 475 * AMD Ryzen™ AI 9 HX 470 * AMD Ryzen™ AI 9 465 * AMD Ryzen™ AI 7 450 * AMD Ryzen™ AI 7 445 * AMD Ryzen™ AI 5 435 * AMD Ryzen™ AI 5 430 * **New Game Support** * Starsand Island * Avatar: Frontiers of Pandora™ - From the Ashes Edition * **Fixed Issues** * Some shadows may not render correctly while playing Call of Duty®: Black Ops 7 on some AMD Graphics Products on Radeon™ RX 5000 series and Radeon™ RX 6000 series graphics products. * Texture corruption may be observed when playing Enshrouded while at the first “Elixir Well” location on Radeon™ RX 7000 series and Radeon™ RX 9000 series graphics products. * Application may fail to launch while playing Diablo 4 with usernames containing non-english characters on Radeon™ RX 7000 series and Radeon™ RX 9000 series graphics products. * Some lights may not render correctly while playing Microsoft Flight Simulator 2024 during nighttime scenes on Radeon™ RX 7000 series and Radeon™ RX 9000 series graphics products. * Application crashes when using Unreal Engine 5.6 Editor with Lumen HWRT enabled on Radeon™ RX 5000, Radeon™ RX 6000, Radeon™ RX 7000 and Radeon™ RX 9000 series products. * Intermittent visual corruption may be observed while navigating Chromium and Electron apps on Radeon™ RX 5000 series and Radeon™ RX 6000 series graphics products. * Slow window resizing may be observed (related to vkAcquireNextImage extension) while developing games that use the Vulkan API on Radeon™ RX 7000 series and Radeon™ RX 9000 graphics products. * Player sprites may not render correctly while playing Cassette Beasts on Radeon™ RX 7000 series and Radeon™ RX 9000 series graphics products. * Artifact may appear when playing Baldur’s Gate 3 with TAA enabled on Radeon™ RX 5000 series and Radeon™ RX 6000 series graphics products. . # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. .",
        "comments": [
            {
                "raw_content": "I \\*really\\* hope this fixes the driver timeouts I've been getting constantly using hardware acceleration on Chromium based browsers.",
                "author": "lexcyn"
            },
            {
                "raw_content": "Avatar was unplayable with prior drivers because of heavy flicker while using FSR4, hope it's fixed now. Edit: it's not fixed still a mess. Workaround is either a driver rollback or disabling fsr upscaling on the driver just for this game and using optiscaler with fsr 4.0.2.",
                "author": "Bandicoot-Trick"
            },
            {
                "raw_content": "Did anybody elses AMD Adrenalin Edition software just... go away? I checked today to update, and its totally gone. Not in my drives, nowhere, and i never uninstalled it myself.",
                "author": "InbredAssian"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon Software Adrenalin 26.1.1",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Darktide still not listed as known issue , amd is even ghosting Fatshark ( dev of darktide / vermintide ) for 1 year.... [https://forums.fatsharkgames.com/t/investigation-poor-performance-power-draw-issues-impacting-amd-radeon-6000-9000-series-gpus/107462](https://forums.fatsharkgames.com/t/investigation-poor-performance-power-draw-issues-impacting-amd-radeon-6000-9000-series-gpus/107462)",
                "author": "Evonos"
            },
            {
                "raw_content": "Anyone tried gow 2018 to see if ahadows are fixed with 9000 series",
                "author": "Thrustherx"
            },
            {
                "raw_content": "No clue whats up but my first crash after installing the drivers completely uninstalled Adrenlin software. First time seeing that happen.",
                "author": "KillinFrenzy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 9 9955HX, RTX 5070 Ti and mini LED - XMG Apex 16 Max gaming laptop review",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No mention of how many zones it has. No mention of if you are allowed the honor and privilege of using local dimming in SDR mode without needing to enable HDR as most mini led laptops do not allow this.",
                "author": "tenchigaeshi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Acer Nitro V 17 AI review: How good is this affordable 17-inch RTX 5070 gaming laptop?",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Fanless industrial PC features Ryzen AI 9 HX 370 and modular design",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage refinances surged again, but rates are now suddenly jumping higher",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One afternoon, on a Friday, the 30 year displayed 5.99. We’re back above 6.2 just a few days later now. Damn. We went from having a 2 year window to make a generational, life changing decision, to now just a few hours at a time.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "So there was really only 1 full week of window where you can take advantage of that rate dip....",
                "author": "Alternative-Pizza368"
            },
            {
                "raw_content": "We have millions of people who now vigorously watch rates looking for any dips, and the Fed meetings went from something that hardly anyone knew about to THE news story every time Jpow speaks. I personally know several people who have their mortgage documents ready to go at a moment's notice for a refinance should rates drop just enough, and that population will only grow as new buyers are stretched and any drops in rates or even just a recasting can smooth the monthly cashflows.",
                "author": "Blacktransjanny"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Retirement dreams crushed in Florida as panicking homeowners face brutal reality of homes 'nobody wants'",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is somewhat silly. If you're looking for a place to grow old and die, who cares if it has a low resale value. Maybe multiple family members will get a smaller cut of your estate, assuming there's anything left after medical expenses.",
                "author": "SpiritualFront769"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NAR Pending Home Sales Report Shows 9.3% Decrease in December",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish there was a way to see condo market sales compared to single family sales. Seems like the condo market is crashing hard now across the country while single family is entering correction territory.",
                "author": "socialtrends93"
            },
            {
                "raw_content": "Month Over Month - 9.3% decrease in pending home sales - Declines in all four regions Year Over Year - 3.0% decrease in pending home sales - Gains in in the South; declines in the Northeast, Midwest, and West WASHINGTON (January 21, 2026) – Pending home sales in December decreased by 9.3% from the prior month and 3.0% year over year, according to the the National Association of REALTORS® Pending Home Sales Report. The report provides the real estate ecosystem – including agents and homebuyers and sellers – with data on the level of home sales under contract. Month-over-month pending home sales declined in all four regions. Year-over-year pending home sales rose in the South and declined in the Northeast, Midwest and West. “The housing sector is not out of the woods yet,” said NAR Chief Economist Lawrence Yun. “After several months of encouraging signs in pending contracts and closed sales, the December new contract figures have dampened the short-term outlook.” “Even after accounting for typical seasonal patterns, interpreting in-person home search activity in the winter – especially in December – can be tricky due to public holidays, people taking time off, and wintry weather conditions,” Yun added. “We’ll be watching the data in the coming months to determine whether the soft contract signings were a one-month aberration or the start of an underlying trend.” “Data shows closing activity increased in December. However, new listings did not keep pace so inventory decreased. Consumers prefer seeing abundant inventory before making the major decision of purchasing a home. So, the decline in pending home sales could be a result of dampened consumer enthusiasm about buying a home when there are so few options listed for sale. In December there were only 1.18 million homes on the market – matching the lowest inventory level of 2025.” December 2025 Regional Pending Home Sales Northeast - 11.0% decrease month over month - 3.6% decrease year over year Midwest - 14.9% decrease month over month - 9.8% decrease year over year South - 4.0% decrease month over month - 2.0% increase year over year West - 13.3% decrease month over month - 5.1% decrease year over year While national pending home sales dipped in December, several local markets are showing notable year-over-year gains. Among the 50 largest metro areas, the following 10 markets posted the biggest annual increases in pending home sales, according to data from Realtor.com Economics: - Louisville/Jefferson County, KY-IN (+23.8%) - San Antonio–New Braunfels, TX (+13.6%) - Virginia Beach–Chesapeake–Norfolk, VA-NC (+11.0%) - Charlotte–Concord–Gastonia, NC-SC (+9.7%) - Boston–Cambridge–Newton, MA-NH (+9.2%) - Phoenix–Mesa–Chandler, AZ (+8.7%) - Oklahoma City, OK (+8.0%) - Miami–Fort Lauderdale–West Palm Beach, FL (+6.3%) - Pittsburgh, PA (+5.8%) - Memphis, TN-MS-AR (+4.7%)",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Well yeah. It was Christmas. Happens every year",
                "author": "WhizzyBurp"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending home sales drop sharply in December, dampening 2026 outlook",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "POV: Vibe-coders need in 2026",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe not hardware, but something similar can be seen in software soon.",
                "author": "Abhishecr7"
            },
            {
                "raw_content": "Make it IPX7. I will use that in the swimming pool.",
                "author": "PhilosophyMammoth748"
            },
            {
                "raw_content": "For vibecoders? Probably don't need the discard button or the model switcher.",
                "author": "Nedshent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic publishes Claude's new constitution",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hah was just reading how most of the Claude community felt a shift about a week ago. Wondering if that was this new document being implemented.",
                "author": "CannyGardener"
            },
            {
                "raw_content": "I kinda wish the ethics of large models were discovered via some kind of self-play to converge with the constraint like the “do unto others as you’d have them do unto you” golden rule instead of having ethics hand picked by a group of humans from a particular time period. A hard coded document of “how to behave” is something I’d be wary of. Asimov’s 3 laws of robotics are not supposed to be aspirational, his writings constantly touch on all the many reward hacks and shortcomings of locking yourself into something like that. If you’ve read [The Egg, by Andy Weir](https://www.galactanet.com/oneoff/theegg.html) you’ll see where I’m coming from with the self-play ethics. I’ve seen this short story get passed around a lot between other ML engineers, but I actually think it’s tractable to express in a differentiable way with machine learning.",
                "author": "veshneresis"
            },
            {
                "raw_content": "Anthropic published an **updated** constitution for Claude outlining how the model should reason act and align with human values. The document **expands** on moral reasoning transparency and refusal behavior.This constitution directly guides training and behavior shaping **rather** than being a PR document.",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s Altman Meets Mideast Investors for $50 Billion Round",
        "score": 61,
        "text_content": "OpenAI Chief Executive Officer Sam Altman has been meeting with top investors in the Middle East to line up funding for a new investment round that could total at least $50 billion, according to people familiar with the matter. Altman recently visited the region, where he spoke with investors, including some of the leading state-backed funds in Abu Dhabi, said the people, who spoke on condition of anonymity as the information is not public https://www.bloomberg.com/news/articles/2026-01-21/openai-s-altman-meets-mideast-investors-for-50-billion-round?embedded-checkout=true",
        "comments": [
            {
                "raw_content": "Anthropic has UAE funding via Abu Dhabi's MGX and ATIC fyi.",
                "author": "Warm-Letter8091"
            },
            {
                "raw_content": "finally oiling up i see /s",
                "author": "fogwalk3r"
            },
            {
                "raw_content": "Sam really went from asking for 7 trillion to a modest 50 billion. I guess even the King of Post-Scarcity has to start using coupons eventually. At this rate OpenAI will be the first company to have its own seat at the UN.",
                "author": "DegTrader"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "UNSW Engineers set efficiency world record for emerging solar cell material",
        "score": 180,
        "text_content": "Researchers in Australia have achieved a breakthrough in an emerging solar cell material that could shape the **future** of photovoltaic technology. **Efficiency Milestone:** The team achieved a certified power conversion efficiency of 10.7% with lab settings, the cells reached a champion efficiency of 11.02% which is highest **verified result globally.** **Technical Solution:** The major **hurdle** was the uneven distribution of sulfur and selenium during production. By adding sodium sulfide, it removed a long standing internal energy barrier. **Material Advantages:** Antimony chalcogenide is promising due to its abundant non toxic materials and low temperature manufacturing making it a **cost effective** option for next generation solar cells. **Potential Applications:** The material's unique properties allow for versatile **use cases** beyond traditional rooftop panels like Tandem Solar Cases, Solar windows, Indoor & Low-Light Electronics. **Source:** University of New South Wales [UNSW Article](https://www.unsw.edu.au/newsroom/news/2026/01/engineers-set-efficiency-world-record-for-emerging-solar-cell-material#:~:text=The%20improved%20antimony%20chalcogenide%20solar,recognised%20independent%20photovoltaic%20measurement%20centres.)",
        "comments": [
            {
                "raw_content": "20% is the threshould for commercial viability. Being at 12% is not that bad, Kesterite world record is 14.2% for Kesterite It took 20 years to get from 0% to 1%, and another 20 years to get from 1% to 14%.",
                "author": "Pop-Bard"
            },
            {
                "raw_content": "This composition is meant to be used as the top layer is multi-junction solar panels composed of multiple chemistries with each absorbing a different part of the sun's spectrum. The efficiency presented here is compounded with the efficiencies of standard silicon photovoltaics (used as a bottom layer). This seems like an important detail absent in OP's summary necessary for contextualizing the figures presented.",
                "author": "A_Person0"
            },
            {
                "raw_content": "I don't get it. Isn't it like 20-25%? Is it something different?",
                "author": "Long_comment_san"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Lonely young people are using AI chatbots as friends now",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now? It's been at least 3 years.",
                "author": "basementreality"
            },
            {
                "raw_content": "I'll admit I've done this, but it doesn't last longer than an hour because it just isn't conversationally stimulating enough. Sesame was cool the first time I tried it, but it gets boring after a while and I'd rather do something else.",
                "author": "Vahgeo"
            },
            {
                "raw_content": "The interesting thing is that for a lot of people, AI companions aren't replacing human connection. They're more like a practice space or a pressure valve. Someone who's socially anxious might warm up by chatting with an AI before a real conversation. Someone who just went through a breakup might need something to talk to at 3am that isn't going to judge them or get exhausted. It fills gaps rather than replacing the main course. The real question is whether that's a bridge to something healthier or a comfortable dead end.",
                "author": "SeleneGardenAI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The intent behind the push for AI?",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ultimately, the goal is to eliminate human employees, soldiers and police.",
                "author": "Holdthemuffins"
            },
            {
                "raw_content": "It's not the main reason for the push but the scenario he describes is a possible outcome. The reason for the push is the drive to innovate engrained in us. We do because we can and we push forward. Can't fly, build a plane. Etc. We might very well automate ourselves out of existence just to say we did it. We will certainly automate ourselves out of labor and knowledge having any real value. And we'll likely do it before we have another system in place. This period will be uncomfortable and chaotic and no one knows what's on the other side of it. But I'm stoked to be here for it. Gonna be a wild ride.",
                "author": "Deliteriously"
            },
            {
                "raw_content": "The problem in this scenario isn't the technology. It's the humans. We could try to feed the hungry and home the homeless, but we don't. AI or not, greedy humans will always take advantage of those on the bottom. Our society has created this heirarchy of power based on wealth accumulation. As long as they can continue to take advantage of those below them, they will do so. No AI necessary. We could ban AI tomorrow and they would just move onto the next thing. We need to tackle the actual problems. We shouldn't limit our technological advancements due to human greed.",
                "author": "TheBeingOfCreation"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do we need AI with human intelligence to change the world?",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All of this glosses over the fact that our (speaking from the US here) rulers -- the politicians and SCOTUS and the wealthy -- do _not_ listen to / incorporate the very good advice coming from the smartest people around. Where are people getting the idea that they would take good advice from another kind of smart entity? What's more, the _voters_ have shown they'll keep those people in power. The wealthy and powerful telling them \"You don't need healthcare availability or climate remediation or vaccinations or quality education or research funding or stable grocery prices or affordable housing...\" Our rulers are in it for themselves. The only advice they are going to take from anyone, or anything, is that which furthers _their_ circumstances. Not ours. I mean, how much of this has to be observed before the clue sinks in? So far as I can tell, the answer to that is \"an infinite amount.\" I wish all this wasn't the case, but it bloody well is.",
                "author": "NYPizzaNoChar"
            },
            {
                "raw_content": "Kind of a silly example at the end but the shade thrown at the start was 🔥.",
                "author": "m1ndfulpenguin"
            },
            {
                "raw_content": "Full discussion which was quite interesting https://youtu.be/MdGnCIl-_hU Speakers: Nicholas Thompson, Eric Xing, Yoshua Bengio, Yuval Noah Harari, Yejin Choi",
                "author": "Cubewood"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Agile One, onboard AI-driven industrial humanoid robot",
        "score": 183,
        "text_content": "https://x.com/CyberRobooo/status/2013869338797973609?s=20",
        "comments": [
            {
                "raw_content": "cool if it wasn't a cg render handling a screw would look at lot better if done for real",
                "author": "JoelMahon"
            },
            {
                "raw_content": "Nice. Show it actually assembling some consumer product. Show it actually load or unload a dishwasher. Show it doing any actual work that isn't just \"get thing from a robot-optimized rack and place it in another robot-optimized rack.\" We know, the sensors and mechanics are fine now. We saw them dance. We saw them balance eggs. We didn't see them actually do any real work requiring the AI part to actually work.",
                "author": "Oktokolo"
            },
            {
                "raw_content": "This is like the 100th robot some company has shown off and I still have never seen one in person anywhere doing anything. Show me a bunch of humanoid robots in a factory doing actual work and then I'll be impressed.",
                "author": "OppoObboObious"
            }
        ],
        "subreddit": "singularity"
    }
]