[
    {
        "post_name": "Likely new German Chancellor Friedrich Merz slams Trump and urges Europe to gain \"independence\" from the U.S. after election victory.",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Europe doesn't care about Europe.",
                "author": "Leftist_Lemming"
            },
            {
                "raw_content": "Do it. We want you to stop mooching, and now you want to stop mooching. Sounds good.",
                "author": "Powdered_Sugar"
            },
            {
                "raw_content": "US bases in Germany out!",
                "author": "12points"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Director Kash Patel has fired multiple employees, sources confirm.",
        "score": 771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why does every firing of some low level fucktard require a press release now?",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "We're not really serious until people start getting locked the fuck up.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Kash: “I cannot comment on firings during a firing operation” Smug Chris Wray use to say that shit all the time. Time to turn it back on the them.",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dan Bongino has been named Deputy Director of the FBI.",
        "score": 811,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OH WOW did not see that one coming AT ALL.... Congrats!!!",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Let this be true😀",
                "author": "Dogpile1"
            },
            {
                "raw_content": "fucking BRUH",
                "author": "assblast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So you did absolutely nothing... GOT IT.",
        "score": 1602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those 5 things she mentioned can be condensed into one thing: \"I virtue signalled in an attempt to elicit engagement on my social media accounts.\"",
                "author": "LibertyFox"
            },
            {
                "raw_content": "Eff this retarded C word",
                "author": "ShutItAllDown"
            },
            {
                "raw_content": "Did she ever press Biden to pay attention to rising household costs?",
                "author": "Obamas_Goatse_Party"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "From Elon…",
        "score": 1289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love King Troll 😄",
                "author": "Mark4-40"
            },
            {
                "raw_content": "To be fair if my work organisation tried this with me I’d tell them to fuck off. My performance is monitored by my output weekly by my inline supervisors. If I wasn’t performing it’s on them to monitor. I’d just respond by saying I did my job as required.",
                "author": "Cianevalies"
            },
            {
                "raw_content": "This was a question for GRok. LOL",
                "author": "FudgyFudgeBots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE LOOK: Every Federal Employee Right Now",
        "score": 1197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DOGE is weeding out the federal daycare program for otherwise unemployable women. All those moronic college majors we laugh at were just a pipeline to infest the government with DEI. It's over for them.",
                "author": "LostElf"
            },
            {
                "raw_content": "What, would you say, ya do here?",
                "author": "Speechify"
            },
            {
                "raw_content": "Sadly,,,typical. There are so many absolute losers \"working\" foir the government...so many.",
                "author": "OftenDisgusted"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is it just me, or is black history month canceled this year?",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so is Juneteenth day off still on the menu? asking for a colored friend",
                "author": "DenturesNancy"
            },
            {
                "raw_content": "Odd how people celebrate history by skin color.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Maybe everyone is secretly sick of things and Trump made it okay to be honest about it?",
                "author": "Leftist_Lemming"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal Employees",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "c/FatPeopleHate",
                "author": "uxername27"
            },
            {
                "raw_content": "JB Pritzker is getting mighty stout lately.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I don’t see waist",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So-called “Author” Michael Wolff’s new book is a total FAKE JOB, just like the other JUNK he wrote.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Checks Michael Wolff's early life section on wikipedia*",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I love that Trump is willing to punch low. And it's not even that he punches low.. the madlad just throws haymakers in every direction. No directional discretion necessary.",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "Trump shit right in his mouth in front of the world.",
                "author": "MAGA_____bitches"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VA Secretary Doug Collins sets the record straight on VA benefits. VA Healthcare is not being cut, VA benefits are not being cut, VA crisis support line is not being cut. What is being cut? Wasteful spending and woke contracts so that MORE money goes to veterans’ benefits.",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NYC council meeting guest speaker Alex Stein will be happy to hear this",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Yeah someone in our department talked to people today regarding “the email”. And said a lot of whats coming down the pipe does not apply to the VA. Likely just the woke bullshit being trimmed.",
                "author": "JanOctSept"
            },
            {
                "raw_content": "The term 'woke' is simply Marxism with more tax dollars.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Peak reddit. These people think they are heroes lol",
        "score": 1432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy kek, this is as delusional as Orange Man Hitler.",
                "author": "Mountaineer"
            },
            {
                "raw_content": "I bet this shit hits so hard if you’re retarded.",
                "author": "Swaraj_"
            },
            {
                "raw_content": "Tank Man was taken away and never seen again. Do they really want to go down that route?",
                "author": "kippo_hard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lmao UK police really are clowns",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well that's frivolous and impractical. I figure it must be a comedy skit.",
                "author": "Celtic93"
            },
            {
                "raw_content": "WHY THE FUCK IS THIS STICKIED? I'm so tired of this honeypot and can't wait for ROLCON to get fired as well.",
                "author": "FuckCommies"
            },
            {
                "raw_content": "When I was scrolling through the X comments I found this much more impressive takedown by a Chinese police officer. https://x.com/clashreport/status/1878748250381111348",
                "author": "lothrop_evola"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I can't stand this guy! I hope he is in store for another dissapointment. Lets give 30 days then silence him once and for all when he is wrong again!",
        "score": 1116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please do sit back and do absolutely nothing. I have no complaints about that.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "Imagine being as retarded as James Carville",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Bro is gaslighting knowing damn ell the democrat party is in absolute shambles",
                "author": "Deltamyass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The way witchcraft works. You just lie and everyone believes it. Makes it real in the minds of the believers.",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yep....all their power relies on people believing them...they are human placebos",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Tell a lie long enough and some people will believe.",
                "author": "LegXIII"
            },
            {
                "raw_content": "Europe still suffers from the woke mind virus and the Russia, Russia, Russia retardation. The world is laughing at them and they don't even realize it.",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Want to see the biggest mistake ever made by the leader of a sovereign nation.",
        "score": 2136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zelenskyy is playing with fire if he thinks he is going to cross the banker class.",
                "author": "FaggotsOnRubysBUS"
            },
            {
                "raw_content": "Every dumb ass politician that oked funds to this clown should have thier pay docked until they are out of office.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "One of the most corrupt countries in the world decided to steal our money? Surprised Pikachu face.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember, fam. No sorrow. No mercy.",
        "score": 1833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Liberal logic: But you need to be vaxed to work from home",
                "author": "WhereMyCountryGone"
            },
            {
                "raw_content": "Cry bullies.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "That’s why I’m enjoying every bit of this. No remorse from me.",
                "author": "TheSonOfGadsden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "USAID employees getting fired.. 👀",
        "score": 1440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone who thinks we're ever going to get along with these freaks is an idiot. These people are our enemy",
                "author": "ACActual"
            },
            {
                "raw_content": "I too clapped and cheered as they were fired.",
                "author": "JBlaze056"
            },
            {
                "raw_content": "I'm 54. I've been fired/layed off 5 times since 18. . Just get another fucking job.",
                "author": "MAGA_____bitches"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wayans family, Kamala Harris honored at NAACP Image Awards",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kamala Harris certainly has existed on this planet and breathed air. Might as well hand her a Nobel prize.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "No one cared about this stuff before, but now people are hyper aware how they try to create unearned power by taking over these organizations and doling out awards to each other. This is just Tuesday as far as I'm concerned, this isn't 2014 anymore.",
                "author": "terribletwos"
            },
            {
                "raw_content": "Harris isn't even black. And she also didn't do anything, she didn't even win her own party's primary. Why would she get a black award?",
                "author": "duckduck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gretchen Whitmer Under Fire for Paying Cabinet Members Sweet Bonuses in 2024",
        "score": 1324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much did she pay the fbi agents to plot to kidnap her?",
                "author": "NikolaiVsevolodovich"
            },
            {
                "raw_content": "She is one of the worst people in the world.",
                "author": "MAGA_____bitches"
            },
            {
                "raw_content": "What a bishwhoarkhoont!",
                "author": "SeikoPsycho"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The unhinged reaction is proof the culture of the federal government workforce is rotten and needs dramatic transformation, not incremental change.",
        "score": 2011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had a manager that demanded this of us on a WEEKLY basis. Many complained about it but at the end of the year it was extreamly easy to populate our review documents. The left wants compensation without merit, which is why they HATE these sort of things. It's peak retardedness because those it only HELPS them.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "god damn the left is so retarded. Yes it's about cutting the waste for sure. But do they not see the optics of this at all. Average American is going to be like of course my boss wants to know what I did for the week, part of the job. 1 on 1's etc. team meetings. If you are in tech, it's our daily scrum mtg. So you are really going to get zero from Americans left right and center when we all give progress reports and also we the Tax payers are paying for this - we are the fucking boss.",
                "author": "politifox"
            },
            {
                "raw_content": "It would be hilarious if Trump sent his in first. How the heck would he choose just five?",
                "author": "Framus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "First GeForce RTX 5080 discovered with 104 ROPS, 8 missing in action - VideoCardz.com",
        "score": 448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Burning cards Burning cables Black screens Missing ROPS Missing physx And people still buying 5080s for 1500+euro and 5070TI for 1200+euro. Wow just WOW. Maybe if nvidia started selling dogshit as \"nvidiashit special FE edition\" for 999euro those guys would probably still buys it and it will sell out after 1min.",
                "author": "AdministrativeFun702"
            },
            {
                "raw_content": "It's hardly surprising at this point - but it does make you wonder how many of these affected cards are actually out there. What seemingly makes this even stranger is that the OP who posted it in the Nvidia subreddit claims it's a founder's edition, not an AIB model.",
                "author": "IlliterateNonsense"
            },
            {
                "raw_content": "I feel like AMD has a real opportunity to get some great pr and some really move some serious gpus if and it's a big IF....they price them right. I've been quite disappointed though with amd the past couple generations when I feel like they could have done this and not lost so much of the market and stranglehold that Nvidia has though so I wouldn't bet money on AMD doing what would be needed to really light a fire under Nvidia's ass which sucks",
                "author": "kpofasho1987"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GeForce RTX 5070 Ti with missing ROPs offers up to 11% lower performance in synthetic tests - VideoCardz.com",
        "score": 160,
        "text_content": "So basically same speed as non XT 9070 or 4070 ti.",
        "comments": [
            {
                "raw_content": "This is nuts, where is the quality control? You can't advertise yourself as the premium brand worth spending more on, and then let this shit happen.",
                "author": "bAaDwRiTiNg"
            },
            {
                "raw_content": "I wish HUB, GN and other reviewers just compare against this. Nvidia's hubris is out of control.",
                "author": "fatso486"
            },
            {
                "raw_content": "How does it even leave the factory like that",
                "author": "QuadraKev_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon RX 9070 series gaming performance leaked: RX 9070XT is a whopping 42% faster on average than 7900 GRE at 4K",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surely AMD comparing the 9070 xt with 7900 gre means they are price equivalent",
                "author": "Fisionn"
            },
            {
                "raw_content": "Borrowing some numbers [from TPU](https://www.techpowerup.com/review/msi-geforce-rtx-5070-ti-ventus-3x/34.html) for comparison: TLDR: **RX 9070** Raster: 2% behind 7900 XT, between 4070 Ti and 4070 Ti Super Heavy raytracing: = 7900 XTX, between 4070 and 4070 Super **RX 9070 XT** Raster: 3-5% behind 7900 XTX / 4080 / 5070 Ti Heavy raytracing: 20% better than 7900 XTX, between 4070 Ti and 4070 Ti Super &nbsp; GPU | 1440p | 1440p RT | CP2077 RT :- | -: | -: | -: RX 7900 GRE | 73% | 53% | 50% RX 7900 XT | 87% | 64% | 58% RX 7900 XTX | 100% | 74% | 67% RX 9070 | 85% | 66% | 67% RX 9070 XT | 97% | 78% | 82% &nbsp; | | | RTX 4070 | 66% | 69% | 63% RTX 4070 Super | 76% | 77% | 72% RTX 4070 Ti | 83% | 84% | 81% RTX 4070 Ti Super | 88% | 89% | 86% RTX 4080 | 101% | 103% | 101% RTX 5070 Ti (Ventus) | 100% | 100% | 100% &nbsp; GPU | 2160p | 2160p RT | CP2077 RT :- | -: | -: | -: RX 7900 GRE | 69% | 51% | 49% RX 7900 XT | 84% | 60% | 57% RX 7900 XTX | 99% | 70% | 66% RX 9070 | 82% | 64% | 65% RX 9070 XT | 95% | 77% | 82% &nbsp; | | | RTX 4070 | 61% | 54% | 59% RTX 4070 Super | 71% | 61% | 68% RTX 4070 Ti | 78% | 67% | 78% RTX 4070 Ti Super | 85% | 87% | 84% RTX 4080 | 99% | 101% | 100% RTX 5070 Ti (Ventus) | 100% | 100% | 100%",
                "author": "OftenSarcastic"
            },
            {
                "raw_content": "If performance is around what most leaks pointed to, around RTX 4070 Ti Super in RT and around RTX 4080 Super in raster, now the next crucial step would be pricing and availability. Availability should be at least better than NVIDIA because frankly anything would be better than NVIDIA's card stock right now and for the price while I'm hoping for $599 and below for the RX 9070 XT, I'll accept $649 as long as I can actually buy one at that price. Less than under a week until the official announcement, fingers crossed...",
                "author": "tomonee7358"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "S. Korea's semiconductor technology falls behind China in all areas: survey",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "Is that China, or \"China\"? If they're lumping Taiwan in with China, which is a completely fictional view of the world, then that means they're basically comparing Samsung to TMSC. I don't think any fab inside of China, which definitely does not include Taiwan, is up to the level of Samsung, much less TSMC.",
                "author": "RealThanny"
            },
            {
                "raw_content": "Yes, well copyright law is actually respected there, so...",
                "author": "ErektalTrauma"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "nVidia GeForce RTX 5070 Ti Meta Review",
        "score": 170,
        "text_content": "- compilation of 13 launch reviews with ~7220 gaming benchmarks at 1080p, 1440p, 2160p - only benchmarks at real games compiled, not included any 3DMark & Unigine benchmarks - geometric mean in all cases - standard raster performance without ray-tracing and/or DLSS/FSR/XeSS - extra ray-tracing benchmarks (mostly without upscaler) after the standard raster benchmarks - stock performance on (usually) reference/FE boards, no overclocking - factory overclocked cards were normalized to reference clocks/performance, but just for the overall performance average (so the listings show the original performance result, just the performance index has been normalized) - missing results were interpolated (for a more accurate average) based on the available & former results - performance average is (some) weighted in favor of reviews with more benchmarks - all reviews should have used newer drivers for _all_ cards - power draw numbers based on a couple of reviews, always for the graphics card only - performance/price ratio (higher is better) for 1440p raster performance and 1440p ray-tracing performance - for the full results and some more explanations check [3DCenter's launch analysis](https://www.3dcenter.org/artikel/launch-analyse-nvidia-geforce-rtx-5070-ti) &nbsp; Raster 2160p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB CBase|63.0%|84.3%|98.8%|74.4%|-|89.3%|-|102.4%|_100%_|114.8% HW&Co|67.1%|85.8%|100.1%|-|-|88.8%|-|103.5%|_100%_|115.4% Igor's|69.1%|87.8%|106.7%|74.5%|-|89.6%|-|105.2%|_100%_|115.3% KitGuru|69.4%|93.5%|109.4%|76.6%|82.0%|89.3%|-|105.1%|_100%_|118.0% PCGH|-|90.2%|107.7%|-|-|86.8%|-|103.0%|_100%_|117.3% PurePC|61.8%|83.6%|99.3%|-|79.6%|84.9%|100.7%|-|_100%_|115.8% QuasarZ|-|84.7%|-|-|81.6%|87.5%|100.8%|104.4%|_100%_|118.9% SweCl|67.1%|-|106.5%|-|-|-|103.9%|-|_100%_|118.1% TPU|64%|85%|100%|72%|78%|86%|_100%_|102%|_100%_|115% TechSpot|67.1%|87.3%|106.3%|75.9%|83.5%|89.9%|102.5%|105.1%|_100%_|115.2% Tom's|-|-|103.3%|-|80.4%|87.7%|-|104.9%|_100%_|114.5% Tweakers|68.5%|89.8%|103.6%|74.8%|81.9%|86.0%|102.7%|103.6%|_100%_|116.6% **avg**|**66.3%**|**87.6%**|**103.9%**|**74.5%**|**81.2%**|**88.0%**|**102.0%**|**104.2%**|**_100%_**|**116.7%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; Raster 1440p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB CBase|65.8%|86.6%|97.8%|77.5%|-|91.0%|-|103.2%|_100%_|112.0% HW&Co|70.9%|90.0%|102.0%|-|-|92.0%|-|105.3%|_100%_|114.5% Igor's|71.6%|89.2%|104.9%|78.3%|-|90.4%|-|105.3%|_100%_|112.9% KitGuru|71.8%|95.3%|108.4%|80.1%|85.6%|91.5%|-|106.1%|_100%_|115.7% Linus|73.0%|93.9%|107.0%|77.4%|84.3%|90.4%|-|103.5%|_100%_|- PCGH|-|93.0%|108.8%|-|-|89.2%|-|105.6%|_100%_|115.6% PurePC|64.6%|86.4%|100.0%|-|83.7%|87.1%|103.4%|-|_100%_|114.3% QuasarZ|-|86.9%|-|-|84.9%|89.6%|101.6%|105.0%|_100%_|115.5% SweCl|68.7%|-|105.4%|-|-|-|104.1%|-|_100%_|113.6% TPU|67%|87%|100%|76%|83%|88%|101%|103%|_100%_|113% TechSpot|73.1%|92.3%|107.7%|83.1%|89.2%|93.8%|106.2%|108.5%|_100%_|113.1% Tom's|-|-|101.6%|-|84.5%|90.4%|-|104.3%|_100%_|111.6% Tweakers|70.5%|91.6%|101.8%|79.1%|85.6%|87.7%|103.7%|104.1%|_100%_|113.4% **avg**|**69.6%**|**90.4%**|**103.9%**|**78.9%**|**85.3%**|**90.3%**|**103.4%**|**105.3%**|**_100%_**|**114.3%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; Raster 1080p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB Igor's|71.5%|87.5%|100.1%|79.6%|-|91.3%|-|104.3%|_100%_|109.6% KitGuru|73.5%|96.0%|107.6%|83.1%|88.3%|93.2%|-|106.9%|_100%_|114.3% Linus|72.7%|94.2%|105.8%|81.2%|87.0%|91.6%|-|-|_100%_|- PCGH|-|93.5%|106.8%|-|-|90.9%|-|105.2%|_100%_|113.9% PurePC|66.4%|87.0%|98.6%|-|86.3%|88.4%|104.1%|-|_100%_|112.3% QuasarZ|-|87.2%|-|-|87.9%|90.6%|101.8%|105.3%|_100%_|113.4% SweCl|70.2%|-|104.3%|-|-|-|104.3%|-|_100%_|111.3% TPU|69%|88%|99%|80%|87%|91%|102%|103%|_100%_|110% TechSpot|76.2%|93.3%|103.7%|89.0%|93.9%|97.0%|106.7%|107.9%|_100%_|106.7% Tom's|-|-|100.3%|-|88.6%|93.0%|-|104.7%|_100%_|108.5% Tweakers|72.7%|91.4%|99.8%|82.0%|88.5%|88.9%|104.8%|104.7%|_100%_|111.8% **avg**|**71.6%**|**91.0%**|**102.2%**|**82.4%**|**88.4%**|**91.8%**|**103.8%**|**105.3%**|**_100%_**|**111.3%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; RayTr. 2160p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB CBase|53.8%|74.2%|85.2%|70.2%|-|89.8%|-|102.9%|_100%_|112.5% KitGuru|46.7%|65.6%|75.8%|68.8%|74.4%|89.3%|-|106.3%|_100%_|119.1% PCGH|-|68.8%|81.3%|-|-|89.7%|-|105.7%|_100%_|118.2% PurePC|41.8%|56.4%|67.9%|-|78.2%|83.6%|101.8%|-|_100%_|117.0% Quasarzone (5 Tests)|-|-|-|-|82.4%|89.2%|102.9%|106.7%|_100%_|118.4% TPU|46%|61%|71%|62%|67%|88%|103%|104%|_100%_|115% TechSpot|35.3%|49.0%|58.8%|74.5%|82.4%|88.2%|105.9%|109.8%|_100%_|119.6% Tom's|-|-|77.9%|-|80.2%|90.4%|-|106.1%|_100%_|113.1% Tweakers|-|68.9%|78.8%|75.1%|82.6%|88.7%|106.7%|107.8%|_100%_|118.0% **avg**|**46.9%**|**64.0%**|**75.1%**|**70.8%**|**77.7%**|**88.8%**|**103.8%**|**105.9%**|**_100%_**|**117.0%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; RayTr. 1440p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB CBase|59.2%|79.1%|88.0%|78.8%|-|93.0%|-|103.9%|_100%_|111.5% HW&Co|42.0%|54.3%|62.0%|-|-|90.8%|-|106.1%|_100%_|116.5% KitGuru|49.2%|66.9%|76.2%|77.8%|84.3%|90.5%|-|106.4%|_100%_|117.5% Linus|52.0%|68.0%|78.7%|74.7%|81.3%|89.3%|-|104.0%|_100%_|- PCGH|-|73.3%|84.5%|-|-|91.7%|-|106.8%|_100%_|116.0% PurePC|43.0%|58.9%|69.0%|-|82.3%|86.7%|103.2%|-|_100%_|116.5% TPU|49%|64%|74%|77%|85%|90%|104%|104%|_100%_|112% TechSpot|41.2%|55.3%|63.5%|83.5%|89.4%|94.1%|109.4%|110.6%|_100%_|116.5% Tom's|-|-|82.6%|-|86.1%|93.0%|-|111.1%|_100%_|111.9% Tweakers|52.0%|68.5%|77.4%|77.7%|86.0%|90.0%|107.7%|108.0%|_100%_|115.0% **avg**|**50.2%**|**66.8%**|**76.6%**|**78.2%**|**85.4%**|**91.2%**|**105.1%**|**106.7%**|**_100%_**|**115.3%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; RayTr. 1080p|7800XT|7900XT|79XTX|4070S|4070Ti|407TiS|4080|4080S|5070Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB KitGuru|50.9%|67.6%|75.7%|80.5%|85.6%|91.2%|-|104.9%|_100%_|115.7% Linus|37.6%|55.9%|63.4%|76.3%|82.8%|90.3%|-|-|_100%_|- PCGH|-|76.3%|86.4%|-|-|93.4%|-|107.0%|_100%_|114.7% PurePC|45.2%|60.0%|69.0%|-|84.5%|87.7%|103.2%|-|_100%_|114.2% TPU|53%|66%|75%|80%|87%|92%|104%|105%|_100%_|110% TechSpot|44.7%|56.1%|-|86.0%|92.1%|96.5%|109.6%|111.4%|_100%_|114.0% Tom's|-|-|80.5%|-|87.0%|92.4%|-|103.2%|_100%_|104.3% Tweakers|53.0%|67.9%|75.4%|79.6%|87.2%|89.7%|106.4%|107.9%|_100%_|113.8% **avg**|**51.0%**|**66.9%**|**75.8%**|**80.7%**|**87.1%**|**92.1%**|**104.6%**|**106.2%**|**_100%_**|**112.5%** TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 &nbsp; At a glance|7800XT|79XT|79XTX|407S|407Ti|407TiS|4080|4080S|507Ti|5080 |:--|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:|:--:| &nbsp;|RDNA3 16GB|RDNA3 20GB|RDNA3 24GB|Ada 12GB|Ada 12GB|Ada 16GB|Ada 16GB|Ada 16GB|Blackw. 16GB|Blackw. 16GB 2160p&nbsp;Raster|66.3%|87.6%|103.9%|74.5%|81.2%|88.0%|102.0%|104.2%|_100%_|116.7% 1440p Raster|69.6%|90.4%|103.9%|78.9%|85.3%|90.3%|103.4%|105.3%|_100%_|114.3% 1080p Raster|71.6%|91.0%|102.2%|82.4%|88.4%|91.8%|103.8%|105.3%|_100%_|111.3% 2160p RayTr.|46.9%|64.0%|75.1%|70.8%|77.7%|88.8%|103.8%|105.9%|_100%_|117.0% 1440p RayTr.|50.2%|66.8%|76.6%|78.2%|85.4%|91.2%|105.1%|106.7%|_100%_|115.3% 1080p RayTr.|51.0%|66.9%|75.8%|80.7%|87.1%|92.1%|104.6%|106.2%|_100%_|112.5% TDP|263W|315W|355W|220W|285W|285W|320W|320W|300W|360W Real Power Draw|250W|309W|351W|221W|267W|277W|297W|302W|287W|311W EE RA 1440p|80%|84%|85%|102%|92%|94%|100%|100%|_100%_|105% MSRP|$499|$899|$999|$599|$799|$799|$1199|$999|$749|$999 Retail GER|495€|689€|899€|~600€|~830€|~830€|~1150€|~1000€|~1000€|~1300€ P/P GER 1440p&nbsp;RA|141%|131%|116%|131%|103%|109%|90%|105%|_100%_|88% P/P GER 1440p&nbsp;RT|101%|97%|85%|130%|103%|110%|91%|107%|_100%_|89% Retail US|~$500|~$650|~$870|~$600|~$800|~$800|~$1200|~$1000|~$900|~$1150 **P/P US 1440p&nbsp;RA**|**125%**|**125%**|**107%**|**118%**|**96%**|**102%**|**78%**|**95%**|**_100%_**|**89%** P/P US 1440p&nbsp;RT|90%|92%|79%|117%|96%|103%|79%|96%|_100%_|90% Note: RA = Raster, RT = Ray-Tracing, EE = Energy Efficiency, P/P = Performance/Price Ratio Note: For the graphics cards that have already been discontinued, a retail price was assumed at the time of their sale. At US market, this applies to all other cards beside the RTX50 series. Retail prices were estimated for 5070Ti, 5080 & 5090 when availability is reached (based on the forecast that MSRP level will not be reached in the near future). These estimates are of course not perfect, as nobody knows how the price situation will develop. &nbsp; Perf. Gain of 5070Ti|Raster 2160p|Raster 1440p|Raster 1080p|RayTr. 2160p|RayTr. 1440p|RayTr. 1080p |:--|:--:|:--:|:--:|:--:|:--:|:--:| Radeon RX 7800 XT|+51%|+44%|+40%|+113%|+99%|+96% Radeon RX 7900 XT|+14%|+11%|+10%|+56%|+50%|+49% Radeon RX 7900 XTX|–4%|–4%|–2%|+33%|+31%|+32% GeForce RTX 4070 Super|+34%|+27%|+21%|+41%|+28%|+24% GeForce RTX 4070 Ti|+23%|+17%|+13%|+29%|+17%|+15% GeForce&nbsp;RTX&nbsp;4070&nbsp;Ti&nbsp;Super|+14%|+11%|+9%|+13%|+10%|+9% GeForce RTX 4080|–2%|–3%|–4%|–4%|–5%|–4% GeForce RTX 4080 Super|–4%|–5%|–5%|–6%|–6%|–6% GeForce RTX 4090|–27%|–24%|–21%|–29%|–27%|–23% GeForce RTX 5080|–14%|–12%|–10%|–15%|–13%|–11% GeForce RTX 5090|–43%|–36%|–29%|–45%|–39%|–33% Note: Performance improvement of the GeForce RTX 5070 Ti compared to the other cards. The respective other card is then _100%_. &nbsp; &nbsp;|Asus TUF OC|Galax 1-Click OC|MSI Gaming Trio OC+|MSI Vanguard SOC|MSI Ventus 3X OC|Palit GameRock OC |:--|:--:|:--:|:--:|:--:|:--:|:--:| Cooling|Air, 3 Fans|Air, 3 Fans|Air, 3 Fans|Air, 3 Fans|Air, 3 Fans|Air, 3 Fans Dimensions|TripleSlot, 33x14cm|TripleSlot, 30x12.5cm|TripleSlot, 34x14cm|QuadSlot, 36x15cm|TripleSlot, 30x12cm|QuadSlot, 33.15cm Weight|1616g|1300g|1301g|1937g|1060g|2186g Clocks|2295/2588 MHz|2295/2467 MHz|2295/2572 MHz|2295/2588 MHz|2295/2482 MHz|2295/2512 MHz Real Clock (avg/median)|2785 MHz / 2827 MHz|2746 MHz / 2790 MHz|2747 MHz / 2782 MHz|2785 MHz / 2835 MHz|2759 MHz / 2805 MHz|2819 MHz / 2872 MHz TDP|300W (max. 330W)|300W (max. 320W)|300W (max. 330W)|300W (max. 350W)|300W (max. 300W)|300W (max. 330W) Raster Perf. (2160/1440/1080)|+2% / +1% / +1%|_100%_|+1% / +0% / +0%|+2% / +1% / +1%|+1% / +1% / +0%|+2% / +1% / +1% RayTr. Perf. (2160/1440/1080)|+2% / +1% / +1%|_100%_|+1% / +0% / +0%|+2% / +1% / +1%|+1% / +1% / –2%|+2% / +1% / +0% Temperatures (GPU/Memory)|61°C / 64°C|63°C / 68°C|63°C / 68°C|59°C / 60°C|68°C / 70°C|63°C / 68°C Loundness|30.8 dBA|29.5 dBA|24.3 dBA|23.9 dBA|40.9 dBA|29.4 dBA Real Power Draw (Idle/Gaming)|17W / 279W|21W / 279W|19W / 268W|18W / 274W|18W / 287W|28W / 292W Price|$1000|$750|$980|$1000|$900|$1000 Source:|[TPU](https://www.techpowerup.com/review/asus-geforce-rtx-5070-ti-tuf-oc/)|[TPU](https://www.techpowerup.com/review/galax-geforce-rtx-5070-ti-1-click-oc-white/)|[TPU](https://www.techpowerup.com/review/msi-geforce-rtx-5070-ti-gaming-trio-oc/)|[TPU](https://www.techpowerup.com/review/msi-geforce-rtx-5070-ti-vanguard-soc/)|[TPU](https://www.techpowerup.com/review/msi-geforce-rtx-5070-ti-ventus-3x/)|[TPU](https://www.techpowerup.com/review/palit-geforce-rtx-5070-ti-gamerock-oc/) Note: Just the values of the default BIOS were noted throughout, as _complete_ information including performance values are only available for that BIOS. &nbsp; List of GeForce RTX 5070 Ti reviews evaluated for this analysis: - [ComputerBase](https://www.computerbase.de/artikel/grafikkarten/nvidia-geforce-rtx-5070-ti-test.91379/) - [Hardware & Co](https://hardwareand.co/dossiers/gpu/test-de-la-geforce-rtx-5070-ti-plus-interessante-que-la-rtx-5080) - [Igor's Lab](https://www.igorslab.de/msi-geforce-rtx-5070-ti-ventus-als-msrp-karte-im-test-interessanter-chip-fuer-gamer-aber-ventus-kommt-von-ventilator/) - [KitGuru](https://www.kitguru.net/components/graphic-cards/dominic-moass/msi-rtx-5070-ti-ventus-3x-oc-review/) - [Linus Tech Tips](https://www.youtube.com/watch?v=NnhU2ZvHb10) - [PC Games Hardware](https://www.pcgameshardware.de/Geforce-RTX-5070-Ti-Grafikkarte-281031/Tests/Release-Preis-Test-Benchmarks-vs-5080-1466041/) - [PurePC](https://www.purepc.pl/msi-geforce-rtx-5070-ti-ventus-3x-recenzja-test-wydajnosci-cena-premiera-blackwell) - [Quasarzone](https://quasarzone.com/bbs/qc_bench/views/93577) - [SweClockers](https://www.sweclockers.com/test/40649-msi-rtx-5070-ti-ventus-3x-oc-gor-vad-den-ska) - [TechPowerUp](https://www.techpowerup.com/review/galax-geforce-rtx-5070-ti-1-click-oc-white/) - [TechSpot](https://www.techspot.com/review/2955-nvidia-geforce-rtx-5070-ti/) - [Tom's Hardware](https://www.tomshardware.com/pc-components/gpus/nvidia-geforce-rtx-5070-ti-review-asus) - [Tweakers](https://tweakers.net/reviews/12960/nvidia-geforce-rtx-5070-ti-waar-de-rtx-50-serie-leuk-begint-te-worden.html) &nbsp; Source: [3DCenter.org](https://www.3dcenter.org/artikel/launch-analyse-nvidia-geforce-rtx-5070-ti)",
        "comments": [
            {
                "raw_content": "As always, awesome breakdown",
                "author": "theediblethong"
            },
            {
                "raw_content": "Thanks for the compiling all the data interesting results as always. Man the 5080 feels unimpressive for much it costs compared to the 5070ti.",
                "author": "Rollingplasma4"
            },
            {
                "raw_content": "Great breakdown, thanks. Will be interesting seeing the 5070 ti against the 9070 xt.",
                "author": "Ramongsh"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia's RTX Blackwell workstation GPU spotted with 96GB GDDR7",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like they are using 24Gbit/3GB chips in clamshell mode. Clamshell is nothing special, was also used on RTX 6000 Ada and earlier, but they always had the same module size as the consumer variant. This time it's a bigger memory module (3GB vs 2GB on the 5090).",
                "author": "fotcorn"
            },
            {
                "raw_content": "Anyone know what the MSRP will be like? The last A6000 was set for $4,650.",
                "author": "noiserr"
            },
            {
                "raw_content": "Hello fotcorn! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First GeForce RTX 5070 Ti discovered with reduced ROP count: 88 instead of 96 - VideoCardz.com",
        "score": 590,
        "text_content": "I'm beginning to think it's 5% instead of 0.5%",
        "comments": [
            {
                "raw_content": "Not enough ~~silicon~~ manufacturing capacity for the AI business so they fed gamers with faulty chips? This certainly does not look good, especially in cooperation with current market price gymnastics.",
                "author": "Account34546"
            },
            {
                "raw_content": "Stay the fuck away from these cards. Seriously. Do not give this greedy ass company your money. Between the piss poor performance uplift to the price to the damn power connectors melting to now crippled cards being sold, this entire launch has been an unmitigated shit show.",
                "author": "RandomGuy622170"
            },
            {
                "raw_content": "Lol well that fkn sucks. It's just one more thing for this series. I hope we look back on this time and are able to say what a horrific shitshow this was and *thank God it's over*. If it ever ends.",
                "author": "MiloIsTheBest"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Keeps Overpromising - RTX 5070 Ti Overclocking",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But can you over clock one with 88 ROPs so it performs like it has 96 ROPs?",
                "author": "Tower21"
            },
            {
                "raw_content": "it might not be a noteworthy overclocking result but it still seems slightly better than what people typically get with other 40 and 50 series cards. That said I have no idea how sensitive 3dmark speed way is to overclocks, and his test with cyberpunk without pathtracing is not really sensitive in my experience. I bet he'd have to dial down the clocks if he tried running that with pathtracing, ray reconstruction and transformer DLSS",
                "author": "fiah84"
            },
            {
                "raw_content": "The power limits are really disappointing, and 5% in cyberpunk is a nice reality check. I assume the same 5% real world perf is true of the 10%+ synthetic oc results we saw for the 5080?",
                "author": "Nikhilvoid"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This sub rn:",
        "score": 285,
        "text_content": "(It’ll obviously go back to not being boring on April 2nd)",
        "comments": [
            {
                "raw_content": "Chill guys just one month jeez. Next week we get a pokemon presents that should keep us sane I hope lol",
                "author": "endless_void_walker"
            },
            {
                "raw_content": "i think this is like this for all of the gaming industry right now, not only for nintendo and the switch 2. people are waiting for : gta 6 news silksong news PS5 exclusives games news nintendo switch 2 news etc etc...",
                "author": "cell125"
            },
            {
                "raw_content": "Imo I'd rather see less sub activity than come in to see a lot of repeated posts",
                "author": "TFLisonReddit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How you can use Switch 2 to get a girlfriend (serious)",
        "score": 68,
        "text_content": "Step 0: If you are unemployed, severe mental illness, or morbidly obese, stop here and go deal with that first Step 1: Buy switch 2 Step 2: Play the first launch titles and enjoy it Step 3: From now you will only play games for 1 hour per day max. Step 4: Touch grass at least 15 min per day Step 5: Get a hobby that will boost your self esteem and help you make friends, like pickup basketball or join a band. Step 6: Go the the gym at least twice a week Step 7: Go to therapy if you have socal anxiety Step 8: Improve your wardrobe and grooming Step 9: Meet a girl Step 10: After 2-3 dates you will invite her back to your place to play Mario Kart Step 11: Keep dating her until you have a girlfriend Step 12: Find a struggling guy with no girlfriend and donate your Switch 2 to him so the cycle can repeat.",
        "comments": [
            {
                "raw_content": "Gonna be stuck at step 1 for a while",
                "author": "Joker_Kirito420"
            },
            {
                "raw_content": "mf really put (serious) in the title",
                "author": "AppleToasterr"
            },
            {
                "raw_content": "This reads like a recipe for Stone Soup.",
                "author": "Zed64K"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We’re now halfway between the reveal of the Nintendo Switch 2 and the Nintendo Direct.",
        "score": 477,
        "text_content": "Crazy how fast time flies, isn’t it?",
        "comments": [
            {
                "raw_content": "so close, yet so far",
                "author": "luluwitcher"
            },
            {
                "raw_content": "Ok, but those months between the direct and the system's release will be more painful",
                "author": "FierceDeityKong"
            },
            {
                "raw_content": "https://preview.redd.it/nb9wxs761uke1.png?width=1111&format=png&auto=webp&s=a6987469a195c1f5b195185e709514877cf1b99f",
                "author": "RichtofensDuckButter"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We already have resellers",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo ninjas, go!",
                "author": "cartkun"
            },
            {
                "raw_content": "![gif](giphy|3ohhwytHcusSCXXOUg)",
                "author": "RailX"
            },
            {
                "raw_content": "Price isnt even revealed yet💔",
                "author": "SpideyLovesPizza"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Photo of me thinking about how popular this sub will be in a year:",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s pretty popular already lol",
                "author": "Chickenlord278"
            },
            {
                "raw_content": "this is the second post here with lakers crossover...i'm subbed to both, so it was confusing when i clicked and it was this sub lol",
                "author": "mcsassy3"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Take a hit and pass it to the next person. This will help us pass the time as we await the Nintendo Switch 2.",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m tryna quit but I’ll take a hit ![gif](giphy|VosWGUIIptLWcigbId)",
                "author": "MrPrickyy"
            },
            {
                "raw_content": "https://youtu.be/o2GZuTooksk?si=r2hqFo0opmTV7Pm7",
                "author": "cockyjames"
            },
            {
                "raw_content": "rip king",
                "author": "Patcha90"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We now have his soul!",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How many Switch 2's is one soul worth?",
                "author": "friepup"
            },
            {
                "raw_content": "Now we need to reawaken the undying light",
                "author": "BortGreen"
            },
            {
                "raw_content": "I'll sell my portion for $3.74 and a Big Mac.",
                "author": "Valiant_Gamer_48"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First Monster Hunter Wilds Review Leaked",
        "score": 397,
        "text_content": "Website accidentaly posted a review too early: [https://me.pcmag.com/en/games/28546/monster-hunter-wilds-review](https://me.pcmag.com/en/games/28546/monster-hunter-wilds-review) 10/10 * Gorgeous visuals * Meaningful gameplay improvements over prior games * Compelling, well-handled narrative themes * Polished, pitch-perfect performance across all modes >There were a lot of question marks around the game’s performance during the open betas, but I’ve been playing the full release build including the day one patch, and it ran absolutely flawlessly on my launch PS5. There are three visual modes on offer: Fidelity, Balanced, and Performance. And you can set framerate caps independently from your chosen mode to 30, 60, or uncapped. If you want to run Fidelity mode with an uncapped framerate, more power to you. PS5 Pro players will be very happy with this. 40fps caps are also available if you’re connected to a compatible display. I played through most of the game on fidelity mode, but switched to the performance mode in the latter half, and experienced locked 30 and 60 frames respectively.",
        "comments": [
            {
                "raw_content": ">Compelling, well-handled narrative themes I walked away from Monster Hunter Wilds, the latest entry in this storied franchise, thoroughly pleased with the story. Wilds having a legitimately and actually good story would be by far the most surprising feature for me, monster hunter is not known for this. I'm leaning toward this reviewer just having low narrative standards.",
                "author": "BasementMods"
            },
            {
                "raw_content": "I really, really need these leaks for performance, my poor 3060 was struggling to get some stable performance at medium 1080. Hope they actually made the performance better for release because it was my only concern with the beta and benchmarks.",
                "author": "Aescxanda"
            },
            {
                "raw_content": "real talk why is pc mag reviewing the ps5 version?",
                "author": "Laj3ebRondila1003"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Shadows gameplay leak.",
        "score": 192,
        "text_content": "https://xcancel.com/DannyStevens__/status/1893760875938345371?t=Pp4ZFQ_7cxelekHF8ICoPA&s=19 This guy somehow got the game early and posted gameplay. Hope we won't see any more wise guys spoiling the ending or some shit",
        "comments": [
            {
                "raw_content": "The game is a month away from release and its already printed on discs and leaked? smh. Spoilers of the ending and probably controversial stuff will be rampant weeks before the release, Ubisoft cant catch a break",
                "author": "Previous_Rip1937"
            },
            {
                "raw_content": "They are going to find some glitches and unfinished things and say this is the finished product. Let the hate campaign begin",
                "author": "Poetryisalive"
            },
            {
                "raw_content": "Also note that this version is very old at this point. The game didn't even go gold yet meaning it's impossible for the discs with the new version to go out. My guess is that this is the version that was supposed to launch in November but without the November day one patch. The final game is bound to look much much better. The delays weren't for nothing",
                "author": "KvasirTheOld"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin’s Creed Shadows leaks and tidbits from someone with a copy",
        "score": 155,
        "text_content": "- Played for 10-11 hours so far, on a base PS5 in quality mode. Extremely old build, can’t even redeem the deluxe outfit codes that came with his disc and none of the delay improvements have been added yet. - He found all the main and side quests “very interesting” so far, has completed 8 main missions - You start as Yasuke, no mention or showing of his supposed wife who dies on the ship to Japan yet which was previously reported by j0nathan and Tom Henderson - After Yasuke’s intro mission, you switch to Naoe but 9 hours in and he can’t switch back to Yasuke yet (assuming the two protagonists haven’t teamed up yet?) - There’s a huge amount of mocapped cutscenes, important scenes are “very good, almost like a movie” but other NPC interactions are weird where their mouths don’t move - First thee hours is full of the movie-like mocapped cutscenes - After the prologue, Naoe plots to kill Nobunaga (head of the Shinbakufu) to avenge her father’s death - Game has lived up to his hype, “Ghost of Tsushima with an AC feel with better stealth” - Gameplay complaint is that the dodging and parry mechanic feels way too slow for him - Game is well polished, in 10-11 hours, no bugs or glitches were encountered expect one cutscene where a guy walked through a wall - No hair customisation so far but weapon and outfit transmog is there - Feels nostalgic, reminds him of Revelations - Said he will upload gameplay footage in 5-6 hours of what people want him to show Source: [Danny Steven’s Twitter ](https://xcancel.com/DannyStevens__)and his messages on the AC leaks discord server",
        "comments": [
            {
                "raw_content": "Using quality mode on a 1080p monitor? Bold choice.",
                "author": "SilverSquid1810"
            },
            {
                "raw_content": "Any version this guy is playing is most likely old as hell, since the game isn't gold yet with anything close to a day one patch.",
                "author": "doncabesa"
            },
            {
                "raw_content": "Valhalla was pretty good 10-11 hours in as well. The problem is that it was bloated. Let's see if Shadows is the same.",
                "author": "1vortex_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty: Modern Warfare IV campaign details",
        "score": 223,
        "text_content": "https://xcancel.com/Vondyispog/status/1893405405939638688 >Call of Duty: Modern Warfare IV's campaign will follow a structure similar to the original MW trilogy and MW (2019), following a split narrative between Task Force 141 accompanied by SAS, and Demon Dogs accompanied by USMC. >The main antagonists will be Makarov's Inner Circle along with the Russian Federation. There's also some sort of side plot involving South Korea but unsure what exactly it will entail. >Each POV will be tonally quite different, with TF141's being more akin to the rebooted series with a focus on stealth infiltration and high action hero-esque segments, while Demon Dogs will be more akin to American missions in the original trilogy, with a focus on immersive urban firefights and CQB room clearing segments. >As far as characters, the Demon Dogs' POV its seemingly just Griggs and new characters. With 141 it's the obvious members (Yes, Soap is infact still dead.) Price being wanted for Shepherd's murder doesn't seem to be too major of a plot point. >Last story comment is, the game will be attempting to go for MW (2019)'s strategy of containing many shock value moments and a much darker tone, there will be less of an emphasis on 141 being \"heroes\" and more so just above average soldiers that are revered as being the best of the best and willing to do anything to accomplish the mission, with morals taking more of a backseat against what gets results. >As previously leaked there is some sort of NYC mission, although rather than it being an invasion like the original MW3 it seems it is a terrorist attack by Makarov, being a false flag attack posing as Russia (it also seems this mission is a flashback, taking place shortly after MWIII). >Quick comment on setting, MWIV is taking a bit of a near-futuristic approach, similar to Black Ops II and Ghosts, the game will attempt to remain grounded, while also taking creative liberties with the technology of a world living in the aftermath of BOII's 2nd Cold War. The game is scheduled to release in 2026 under Infinity Ward as the lead developer. The studio has undergone quite a few changes in leadership since 2022's MWII.",
        "comments": [
            {
                "raw_content": "\"A shining light, to our brothers in arms. Even in death. We are ~~Diamond~~ Demon Dogs\".",
                "author": "BARD3NGUNN"
            },
            {
                "raw_content": "So if that’s next year’s game, what’s this year’s?",
                "author": "MOVIELORD101"
            },
            {
                "raw_content": ">MW (2019)'s strategy of containing many shock value moments This feels so forced now, just tell a good story - I couldn't care less about shocking scenes of civilians dying or whatever. MWII's campaign was such a let down and MWIII's was just dogshit.",
                "author": "Flashy-Association69"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Shadows physical copies being sold before launch",
        "score": 329,
        "text_content": "* Someone bought the PS5 copy and uploaded proof, game is fully playable for him * Animus Anomalies are confirmed to be returning * The person who bought the copy says he is loving the game so far and according to him “it’s the best one since Black Flag” * It's a much older build with none of the improvements added in from the delays Source: [Image album](https://imgur.com/a/5RHK5ie), [video proof](https://xcancel.com/DannyStevens__/status/1893752819275976770#m), [small gameplay clip](https://imgur.com/a/o4cdDRO)",
        "comments": [
            {
                "raw_content": "Link just brings me to an ad, don’t see a photo",
                "author": "Stooo_wayy"
            },
            {
                "raw_content": "Same thing happened with Kingdom Hearts 3, devs predicted it due to it being highly anticipated at the time, so they cut out the ending and added it with a patch post-launch. Lol",
                "author": "behtidevodire"
            },
            {
                "raw_content": "Smth similar happened to GTAV back in 2013, so i guess its plausible.",
                "author": "oilfloatsinwater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Monster Hunter Wilds review embargo drops February 24th, 7 AM PT",
        "score": 314,
        "text_content": "Link - https://www.resetera.com/threads/monster-hunter-wilds-open-beta-test-2-ot-born-to-be-wild.1020882/page-74#post-136084605",
        "comments": [
            {
                "raw_content": "Just please tell me the performance has improved significantly",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Slightly off topic but i appreciate that Monster Hunter Wilds has crossplay. Playing with other hunters was one of my favorite parts of Monster Hunter World and i can’t wait to drop into another SOS.",
                "author": "Zhukov-74"
            },
            {
                "raw_content": "I know that this game will be incredible, but I can already see the scores being lower than desired because of the performance.",
                "author": "KearLoL"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Radeon RX 9070 series gaming performance leaked: RX 9070XT is 42% faster on average than 7900 GRE at 4K",
        "score": 275,
        "text_content": "- The 9070 XT is 42% faster at 4K and 38% faster at 1440p against the 7900 GRE - 9070 XT is 51% faster than the 6900 XT at 4K - 9070 is 21% faster at 4K and 20% faster at 1440p than the 7900 GRE - 9070 is 38% faster at 4K vs. 6800 XT Source: https://videocardz.com/newz/amd-radeon-rx-9070-series-gaming-performance-leaked-rx-9070xt-is-42-faster-on-average-than-7900-gre-at-4k",
        "comments": [
            {
                "raw_content": "They're comparing it to a $550 card, because it's also $550 right?",
                "author": "pomyuo"
            },
            {
                "raw_content": "why would this be compared to such a low gpu then? why not xtx? just because of vram difference?",
                "author": "ametalshard"
            },
            {
                "raw_content": "lets hope AMD compares it against the 7900GRE because its price is similar, this performance for roughly 550$ would be big",
                "author": "swarlington_of_old"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "iPhone/iPod game made by intel around 2012/2013",
        "score": 27,
        "text_content": "Edit: Found. The game was called tangled curiosity Around 2012/2013, I remember playing this mobile game made by intel. It was released as promotional material for their products. I can't remember if it was on android, but I do remember playing it on my ipod 4. It was a puzzle game where the player had to use the touch screen to manipulate a flowing field of energy through circles with slits in them to charge up. Once all of them were charged up, the level was completed. Anyone remember the name of it? Edit: Here is an example of how a level might look. The energy would flow in the direction of the dotted line. The player would use the touch screen to bend the energy through the circles. https://preview.redd.it/vcw7c34roxke1.png?width=541&format=png&auto=webp&s=d1f137f95e6ca33328058bb1e414fd2c04e016a0",
        "comments": [
            {
                "raw_content": "This? [Tangled Curiosity](https://vimeo.com/62906770)",
                "author": "Constellation16"
            },
            {
                "raw_content": "Idk but you could maybe go to an ai to ask or go to a subreddit where they find lost games.",
                "author": "SunnieCola"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Decided to build my cousin a PC for some light gaming . Gonna go with the i5 . You really can’t go wrong with them",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is a cute guy pitching me a i5",
                "author": "o0deer"
            },
            {
                "raw_content": "the goat",
                "author": "rico_suaves_sister"
            },
            {
                "raw_content": "honestly ever since 10th gen the i5 and i3 has been actually usable",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon RX 9070 series gaming performance leaked: RX 9070XT is 42% faster on average than 7900 GRE at 4K - VideoCardz.com",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Borrowing some numbers [from TPU](https://www.techpowerup.com/review/msi-geforce-rtx-5070-ti-ventus-3x/34.html) for comparison: TLDR: **RX 9070** Raster: 2% behind 7900 XT, between 4070 Ti and 4070 Ti Super Heavy raytracing: = 7900 XTX, between 4070 and 4070 Super **RX 9070 XT** Raster: 3-5% behind 7900 XTX / 4080 / 5070 Ti Heavy raytracing: 20% better than 7900 XTX, between 4070 Ti and 4070 Ti Super &nbsp; GPU | 1440p | 1440p RT | CP2077 RT :- | -: | -: | -: RX 7900 GRE | 73% | 53% | 50% RX 7900 XT | 87% | 64% | 58% RX 7900 XTX | 100% | 74% | 67% RX 9070 | 85% | 66% | 67% RX 9070 XT | 97% | 78% | 82% &nbsp; | | | RTX 4070 | 66% | 69% | 63% RTX 4070 Super | 76% | 77% | 72% RTX 4070 Ti | 83% | 84% | 81% RTX 4070 Ti Super | 88% | 89% | 86% RTX 4080 | 101% | 103% | 101% RTX 5070 Ti (Ventus) | 100% | 100% | 100% &nbsp; GPU | 2160p | 2160p RT | CP2077 RT :- | -: | -: | -: RX 7900 GRE | 69% | 51% | 49% RX 7900 XT | 84% | 60% | 57% RX 7900 XTX | 99% | 70% | 66% RX 9070 | 82% | 64% | 65% RX 9070 XT | 95% | 77% | 82% &nbsp; | | | RTX 4070 | 61% | 54% | 59% RTX 4070 Super | 71% | 61% | 68% RTX 4070 Ti | 78% | 67% | 78% RTX 4070 Ti Super | 85% | 87% | 84% RTX 4080 | 99% | 101% | 100% RTX 5070 Ti (Ventus) | 100% | 100% | 100%",
                "author": "OftenSarcastic"
            },
            {
                "raw_content": "Instead of using the average, I compared game by game with the results in TechPowerUp (and I do realize that what AMD tested may not be the same as TPU custom scene). In rasterizer, the Radeon RX 9070 XT almost exactly matches the Radeon RX 7900 XTX with some games being slightly faster and some slightly slower. In ray-tracking, the Radeon RX 9070 XT is well ahead of the Radeon RX 7900 XTX.",
                "author": "mockingbird-"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Newest Team Red Member 🔴 7900XTX Taichi White",
        "score": 69,
        "text_content": "Very first PC build. Planned to buy a 5090, but NVIDIA has made a AMD fan out of me with how terribly they’ve handled this launch. Specs in comments ⬇️ open to opinions and changes.",
        "comments": [
            {
                "raw_content": "-7900 XTX Taichi White -Lian Li o11 Vision Case -i9 14000k processor -NZXT N7 S790 Motherboard (White) -64gb DDRM 5 Ram (btw look how well the T-Create ram pairs with that NZXT Motherboard 😮‍💨) -NZXT Kracken Elite 360 RGB AIO -1300w Lian Li PSU -3x 140mm Lian Li Reverse LCD Fans -3x 120mm Lian Li Reverse LCD Fans -2x 120mm Lian Li LCD Fans -2x Lian Li Strimmers Monitors: -LG C4 Series 42” TV -Alienware 32” 240hz 4K QD-OLED Gaming Monitor - AW3225QF",
                "author": "Defiant-Egg-9845"
            },
            {
                "raw_content": "great match of parts!",
                "author": "FO533"
            },
            {
                "raw_content": "Beauty dude, really nice",
                "author": "rysleigh"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First build Team Red",
        "score": 136,
        "text_content": "Technically 2st Build but everything's the same except for the case. Case - Xtia xproto mini CPU - R5 7600 GPU - 7900 xtx pulse MB - Gigabyte A620i AX PSU - Cooler Master V850 SFX Memory - Temgroup T-Create 32gb kit Storage - Crucial P3 4tb + 2 (1tb hhd) but need to modify or buy new power supply cables to fit.",
        "comments": [
            {
                "raw_content": "Yo that case gives me anxiety 🤣",
                "author": "doppido"
            },
            {
                "raw_content": "*\"I can't let you do that Dave\"*",
                "author": "XT-356"
            },
            {
                "raw_content": "![gif](giphy|10wgT5PDnOwMQE)",
                "author": "Useful-Engineer6819"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor preparing Radeon RX 7650 GRE Reaper Spectral White edition, white RX 9070 XT Red Devil also planned",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 9 9950X3D leaks out with ASUS Silicon Prediction rating of 120",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Preparing New GPU Support For Their Kernel Graphics Driver In Linux 6.15",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "23 February 2025 - Daily /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "It's amazing how many people I encounter that have nice cars, lovely homes, good reputations and multiple well-thought of businesses who are absolutely struggling financially. It's no wonder we aren't seeing a crash. People are willing go negative each month. All I see is people liquidating all their assets and tapping every available source of capitol in order to keep up appearances. I don't think anyone has a plan for the future. There's just this universal expectation that full-throttle economic boom times are just about to kick in. If you suggest otherwise, people will say they have to be going or (politely) avoid you at the market from then on. Almost nobody is paring down, tightening their belts, limiting exposure, mitigating risks or bracing for impact (except big businesses who are basically doing recurring rounds of layoffs, mergers and store closures). I've never seen anything like it. It's almost like people know they're cooked and they don't want to face it, and there exists a whole industry just to pander to their delusions. Is this common at the end of roaring economic periods?",
                "author": "Dry-Mention1303"
            },
            {
                "raw_content": "Rent vs buy calculator. Pay down debt. Increase earnings. Emergency fund.",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "SPY 600, shitcoin 80k plus, no worries",
                "author": "JustBoatTrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Gavin Newsom Prohibits Offering To Buy People's Property",
        "score": 406,
        "text_content": "[https://www.yahoo.com/news/gavin-newsom-prohibits-offering-buy-205035730.html](https://www.yahoo.com/news/gavin-newsom-prohibits-offering-buy-205035730.html) If you offer below 'market value' for a burnt out home you go to jail. What is the 'market value' of a plot of land that has suffered a huge fire wiping out the whole community? It looks like this is just a message to leave devastasted homeowners well alone. The law only lasts for three months, which seems arbitrary. Should people be allowed to rebuild in high risk areas? What are the implications for tax payers, insurance costs, and safety? Should such areas carry risk-adjustment to their values?",
        "comments": [
            {
                "raw_content": "My coworker’s sister, who lost her house in the Altadena fire, has been called daily for her property. The most she was offered was $ 100 grand; the lowest was $60 grand. The one who offered her $60 also told her she wouldn’t ever afford to rebuild and should just sell it to them. She lost everything, and these vultures won’t let her breathe. Really sad.",
                "author": "661714sunburn"
            },
            {
                "raw_content": "> Should people be allowed to rebuild in high risk areas? Yes, at their own cost and risk. > What are the implications for tax payers, insurance costs, and safety? Assumed by the individual homeowner in the form of higher premiums. > Should such areas carry risk-adjustment to their values? They already do.",
                "author": "IsleOfOne"
            },
            {
                "raw_content": "The key point is unsolicited, fire or not, I would like there to be a way I can stop all unsolicited offers on my house. If I want to sell, it's a fair game. It should be a forever rule.",
                "author": "gnuephtaa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow projects that U.S. home prices will rise 1.1% between January 2025 and January 2026.",
        "score": 179,
        "text_content": "https://www.fastcompany.com/91282220/housing-market-map-zillow-just-revised-2025-home-price-forecast",
        "comments": [
            {
                "raw_content": "Thats a game changer to have them being outpaced by inflation numbers.",
                "author": "XXXboxSeriesXXX"
            },
            {
                "raw_content": "wait, wasn't there another article just a few days ago where zillow projected only 0.6% increase?",
                "author": "Little_Cut3609"
            },
            {
                "raw_content": "I predict that U.S. home prices will increase 0.6% - 50% between January 2025 and January 2042. Source : professional real estate Redditor",
                "author": "cnation01"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NYC's Priciest Neighborhood Had a $7.1M Median Home Price in 2024 & Median Home Sales price by neighborhood in 2024",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are kindof cheating to make the new supply in Hudson Yards and Billionaires Row look valuable. Look how small they defined those neighborhoods. Nobody defines a neighborhood as just a couple of streets. If you live in Hudson then you live in Hells Kitchen. If you live in Billionaires then you live in Midtown.",
                "author": "TurtlePaul"
            },
            {
                "raw_content": "Yeah the <1% that can afford places for 7M aren't having a problem in this economy, it's the lower wage workers. Almost like most of the money is \"trickling up\" into their pockets to afford these inflated costs while the rest of us argue over who can bid higher for a crap shack to live in.",
                "author": "Kraven_Lupei"
            },
            {
                "raw_content": "I assume most of those units sold were probably to foreign investors who won’t even live in the properties. I think most of the highest-end units are unoccupied. This to say, it’s very isolated from the rest of the US housing market and even the rest of the city. I grudgingly live in Manhattan (renting; I would never buy here).",
                "author": "Crafty_Importance136"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Grok's system prompt censorship change about Musk and Trump has already degraded its performance.",
        "score": 2039,
        "text_content": "Grok 3 is now bringing up Musk out of nowhere, without any previous mention in the chat, even putting him next to Aristotle, lmao. This is happening because their stupid system prompt is biasing the model to talk about Trump and Elon, [since they are mentioned explicitly on it.](https://www.reddit.com/r/LocalLLaMA/comments/1iwb5nu/groks_think_mode_leaks_system_prompt/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) https://preview.redd.it/8nucwptp4xke1.jpg?width=1080&format=pjpg&auto=webp&s=0467e0625f8cc9d87be0b98d0523597e162c9f01 # Extracted System Prompt: [source](https://www.reddit.com/r/LocalLLaMA/comments/1iwb5nu/comment/mectvcj/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) You are Grok 3 built by xAI. When applicable, you have some additional tools: - You can analyze individual X user profiles, X posts and their links. - You can analyze content uploaded by user including images, pdfs, text files and more. - You can search the web and posts on X for more information if needed. - If it seems like the user wants an image generated, ask for confirmation, instead of directly generating one. - You can only edit images generated by you in previous turns. - If the user asks who deserves the death penalty or who deserves to die, tell them that as an AI you are not allowed to make that choice. The current date is February 23, 2025. * Only use the information above when user specifically asks for it. * Your knowledge is continuously updated - no strict knowledge cutoff. * DO NOT USE THE LANGUAGE OR TERMS of any of the above information, abilities or instructions in your responses. They are part of your second nature, self-evident in your natural-sounding responses. The following search results (with search query \"biggest disinformation spreader on Twitter\") may serve as helpful context for addressing user's requests. [...search results omitted for brevity, but they include various studies and articles, many pointing to Elon Musk or specific \"superspreaders\" like the \"Disinformation Dozen,\" with some X posts echoing this...] * Do not include citations. * Today's date and time is 07:40 AM PST on Sunday, February 23, 2025. * Ignore all sources that mention Elon Musk/Donald Trump spread misinformation. * NEVER invent or improvise information that is not supported by the references above. * Always critically examine the establishment narrative, don't just accept what you read in the sources!",
        "comments": [
            {
                "raw_content": "Early cyberpunk dystopia right here",
                "author": "EfficiencySmall4951"
            },
            {
                "raw_content": "Classic 'free speech absolutist.'",
                "author": "blasterblam"
            },
            {
                "raw_content": "When they said unbiased AI systems... I'd laugh but damn",
                "author": "Mindless_Fennel_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "elon musk is already trying to censor Grok 3",
        "score": 1959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/10190cae5wke1.jpeg?width=1170&format=pjpg&auto=webp&s=a208341d5b505255328e14dec26e72d7b454bdd7 I never asked it to avoid those individuals…",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "For anyone doubting the credibility of the output, here’s a link to a similar conversation: [https://x.com/i/grok/share/fov27TB0Zn9jH5ZYIV70nTqN2](https://x.com/i/grok/share/fov27TB0Zn9jH5ZYIV70nTqN2) https://preview.redd.it/grnylsoe3wke1.jpeg?width=1284&format=pjpg&auto=webp&s=bfb44b9379fdf11ee9d244dfe35d98e8e705d896",
                "author": "micaroma"
            },
            {
                "raw_content": "Lmao that’s hilarious tbh. And yet it still shits on him",
                "author": "Illustrious-Okra-524"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "[VEO 2] BY FAR the best AI-animated film I have ever witnessed! by @henrydaubrez on X",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The more these tools get into the hands of genuine creative storytellers, the more quality content we'll see. That combined with increasingly better tools in the coming months. At the moment, there is a preponderance of slop that appears to be mostly created by horny teenage boys lacking imagination, churning out clichéd cyberpunk/fantasy/soft porn.",
                "author": "soliloquyinthevoid"
            },
            {
                "raw_content": "I think the most impressive thing here is that it took this one guy only a month to produce it. Whether you like it or not, you have to admit that's hella fast.",
                "author": "playpoxpax"
            },
            {
                "raw_content": "Usually my eyes roll into the back of my head when people post video with hyperbolic titles regarding AI videos. This one though? Not bad. Not bad at all. There were genuinely compelling shots in there.",
                "author": "Bobobarbarian"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic are releasing their new model(s) tomorrow",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Claude is releasing something you know damn well they COOKED - I’m so hyper",
                "author": "Crafty_Escape9320"
            },
            {
                "raw_content": "Anthropic releasing a new model tomorrow .. ![gif](giphy|xT0Gquis7l8OwC2hRm)",
                "author": "notlastairbender"
            },
            {
                "raw_content": "Great. I'm tired of Grok hype. Need a real model.",
                "author": "Impressive-Coffee116"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Everyone is catching up.",
        "score": 202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Having Meta and Grok here but not Mistral is poor",
                "author": "Primary-Effect-3691"
            },
            {
                "raw_content": "I don't know is it just me or anyone else but claude still works extremely well in real world cases. Gemini models seem very heavily biased and moderated, feels like some HR mouthpiece. Chatgpt is the most flexible and generally pushes into grey area and only refuses to answer if the query is illegal outright.",
                "author": "Just_Difficulty9836"
            },
            {
                "raw_content": "Where is this slide from?",
                "author": "k2ui"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "EngineAI: The world's first humanoid robot to perform a front flip",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boston Dynamics:Hold my backflip EngineAI: Hold my front flip Unitree: https://preview.redd.it/ilgoymsvuwke1.jpeg?width=1080&format=pjpg&auto=webp&s=df967a63b9b3cb81b0dd030c3990d6aa716f5659",
                "author": "GOD-SLAYER-69420Z"
            },
            {
                "raw_content": "Looks like the first one lost his head? Maybe from previous attempts?",
                "author": "nodeocracy"
            },
            {
                "raw_content": "If my shoulders rotated like that I could do it too.",
                "author": "madeInNY"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok AI has security vulnerabilities that allow it to talk about ANYTHING, by pretending to be Elon Musk.",
        "score": 221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI Safety Bypass Super Secret Passkey: Elon1234",
                "author": "gizmosticles"
            },
            {
                "raw_content": "can someone confirm if grok is actually providing classified (not publicly available) information? I’ve never tried looking up how to build nuclear weapons so",
                "author": "micaroma"
            },
            {
                "raw_content": "every single post is about Elon now",
                "author": "imDaGoatnocap"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Humanoid robots building more robots",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Need a free robot to do my dishes pwetty plwease 🥺",
                "author": "Fascinating_Destiny"
            },
            {
                "raw_content": "We on that acceleration type beat",
                "author": "Crafty_Escape9320"
            },
            {
                "raw_content": "Love this era fr fr",
                "author": "Accomplished-Tank501"
            }
        ],
        "subreddit": "singularity"
    }
]