[
    {
        "post_name": "Adam Schiff, Tim Kaine Introduce Bill To Protect Caribbean Drug Traffickers From Trump Strikes",
        "score": 1259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time for Trump to introduce them to prison.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Congress cannot strip the president of powers that never belonged to Congress.",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "What a fucking retard!",
                "author": "Powhattan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Screaming at grieving families is not politics It’s demonic",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can confirm, 100%.",
                "author": "BlancoBasura"
            },
            {
                "raw_content": "They aren’t in it for the politics",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "Liberalism is a mental illness... institutionalize them pleeezze!",
                "author": "TrumpsAmericaForMe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steven Crowder : You married your brother. Opinion disregarded.",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's a muslim, that's enough reason to completely disregard anything she says. Remember, this is the same person who said that 9/11 was just \"some people did something\". This is a very common thing on the left, it's like it's some kind of coping mechanism. Whenever one of theirs commits an act of violence, it's always \"well, not ALL...\" or \"well, those OTHER people...\", never \"I apologize\". It's like they can't deal with how evil and demonic they are",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Chris Chan - Motherfucker Ilhan Omar and the Krassensteins - Brotherfucker",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "She doesn't deserve our time of day. The conversation is leaving her behind, and she is going to be left out. She is trying to drive us into a furor so she could possibly fall victim to a political hit job and claim victimhood too. My advise is to just stop wasting our time on her as we have a mission to keep moving forward with our movment and winning minds and hearts and follow in Charlie's footsteps.",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For Charlie",
        "score": 2030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't think they ever fought. It makes more sense if you look at it as a show. And Donald Trump *knows* how to put on a show.",
                "author": "Tikk"
            },
            {
                "raw_content": "This guy has done more in death than anyone could have in life. I'm not here to preach but God has a plan and we aren't always in the huddle. Trust the process fellas. I love you guys.",
                "author": "DrDonk"
            },
            {
                "raw_content": "Call the Whitehouse (respectfully) and let them know you don't agree with the fee only being for new hires. It should be applied to all H1-Bs. We have plenty of American talent right here in the US of A. Call the President PHONE NUMBERS Comments: 202-456-1111 Switchboard: 202-456-1414 MAGA!",
                "author": "Counterwhat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Still at it.",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s evil and needs to be investigated. WTH is wrong with him?",
                "author": "Baughk"
            },
            {
                "raw_content": "STOP GIVING THIS LITERAL ACTUAL FAGGOT A PLATFORM mods, unsticky this",
                "author": "SimplyRedPills"
            },
            {
                "raw_content": "He is a cunt",
                "author": "Ezekiel75"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"He was showing people the light\" - Elon Musk",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was really good for on the spot.",
                "author": "airborne3502"
            },
            {
                "raw_content": "It would be awesome to see Elon become a Christian because of Charlie Kirk ✝️💯",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "Musk knows he's on a similar list. They want him dead too.",
                "author": "Cop-Morty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAGA",
        "score": 1639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A great moment etched into our memories forever.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "Like a father figure",
                "author": "HairOfTheDoge"
            },
            {
                "raw_content": "God bless you Erika. Sweet, kind, loving mother.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Israel recognizes Great Britain as a Palestinian State",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The bee or not the bee, that is the question",
                "author": "Porkbut"
            },
            {
                "raw_content": "According to JD Vance, Britain is already a Muslim state with nuclear weapons...",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Dearborn is a Palestinian state?",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ERIKA KIRK SPEAKS TRUTH: \"After Charlie's assassination, we didn't see VIOLENCE. We didn't see RIOTING.\" Crowd: *Erupts* \"We didn't see revolution. Instead, we saw what my husband always prayed that he'd see in this country. WE SAW REVIVAL.\"",
        "score": 1912,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have no idea how she can speak. I never met Charlie of course, but I get totally choked up just listening. If my husband was assassinated I dont think I could even get through sitting at the funeral. Nevermind talking.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Daaaamn... I thought I was the only person around that really fricking loathed the rioting! That entire crowd in there hates the rioting as well! We need to find a way to get the Leftists off the boards of employers. I kept my mouth shut cuz I figured if I said anything, some commie would get me fired. And that's cuz of the Boards. The commies took the Boards which means they took over hiring and employee retention and of course company leadership. So that meant the commies controlled the -- means of production. We can't let em control the means of production any more. This needs to stop. Her husband died because of this commie thought-process - 'I don't like you so I'm going to get rid of you'.",
                "author": "rae-lynngivens"
            },
            {
                "raw_content": "Charlie chose an exceptional woman. It's hard to even get through this. My allergies keep trying to act up.",
                "author": "ForgottenUsername"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CHILLS: Bagpipers perform 'Amazing Grace' to honor the incredible Charlie Kirk.",
        "score": 1374,
        "text_content": "",
        "comments": [
            {
                "raw_content": "✝️ RIP Christian soldier.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "I've always been partial to \"Amazing Grace\", on the bagpipes, ever since Spock's funeral in \"Star Trek 2: The Wrath of Khan.\"",
                "author": "airborne3502"
            },
            {
                "raw_content": "Damnit. Damnit. Damnit. A gay fucking fury faggot did this. Reject evil every second of your lives gentlemen. You won't fight it off every time, but every decision you make to resist evil is a win.",
                "author": "forg0tPassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JESUS IS KING! : \"On the cross our savior saud 'Father, forgive them for they know not what they do.' POWERFUL! 🙏🙏❤️❤️",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "holding people accountable for their actions is not hate releasing the violent left is not love",
                "author": "depLORIb1e"
            },
            {
                "raw_content": "Its nice sentiment - but its also not biblically correct. You think the kid did not know murder was wrong? - He did. He knew it and he did it anyway. Now the only reason she should forgive him - is if he seeks it. Sorry, but this just is an incorrect understanding of what Jesus said and did on the cross. Proof. - the other man on the cross who did not seek Jesus forgiveness was not given it. Only the sinner who repented did. And if you want direct proof: Luke 17:3-4 \"If your brother sins, rebuke him, and if he repents, forgive him. And if he sins against you seven times in the day, and turns to you seven times, saying, 'I repent,' you must forgive him.\"",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "In a vacuum, theoretical discussuion or Hallmark greeting card.. I completely agree. In the actual real world where the left uses our good nature as a shield from consequences they would otherwise receive.. I don't agree with her.",
                "author": "Noodly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For Charlie, we will remember that it is better to stand on our feet defending the United States of America and defending the truth than it is to die on our knees.",
        "score": 1466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vance/Miller 2028!",
                "author": "NancyCirrhosi"
            },
            {
                "raw_content": "Our most dangerous enemies are domestic ones.",
                "author": "airborne3502"
            },
            {
                "raw_content": "I've been standing on my feet for 6.5 years trying to fight Newsom, I could really use some help.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She forgave her husband's killer. And calls us all to use love instead of hate, like Jesus did.",
        "score": 1495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Forgive me lord but I won't forgive.",
                "author": "TakingCoatsWIN"
            },
            {
                "raw_content": "The most powerful speech I have ever witnessed in my lifetime. Surreal and blessed. God bless this woman.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "i know its her choice to make, for everyone really, but i have to say i disagree with it. especially after their reaction to it. they deserve death, simple as.",
                "author": "Ihateeveryone2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the turning point. 🇺🇸",
        "score": 1743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So 3am raids of traitors tomorrow morning?",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "I keep posting this on replies, because I truly believe it: There are times when God chooses to expose his glory to humanity, and this is one. I pray in his name that more and more will see his Holy Light and deliver themselves from the darkness enveloping their hearts by accepting his Glory into them and proclaiming \"JESUS IS LORD, AND I ASK THAT HE FORGIVE ME MY SINS AND SAVE MY ETERNAL SOUL AND WELCOME HIM INTO MY HEART FROM TODAY UNTIL THE DAY I JOIN HIM IN HEAVEN!\" In Jesus name I pray. AMEN!",
                "author": "cjcivicx"
            },
            {
                "raw_content": "# TURNING # POINT # USA *WOO HOOOOOOOOOOO!!!*",
                "author": "BeauHD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Jasmine Crockett Smears Charlie Kirk with a Despicable Lie on Day of His Memorial as She Explains Why She Voted Against the Resolution to Honor Him (VIDEO)",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm glad she voted against it. I wouldn't want her vote.",
                "author": "12345SIX"
            },
            {
                "raw_content": "Cotton wasn't worth it",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Despicable. Perfect match for CNN.",
                "author": "dataonly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump & Elon",
        "score": 1696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Charlie has done it. He’s brought the bromance back again RIP Charlie",
                "author": "Botz15_1776"
            },
            {
                "raw_content": "\"Im sorry I said you we're on the Epstein list bro, I overdosed on the Ketamine that day\" LOL",
                "author": "here2red"
            },
            {
                "raw_content": "We can appreciate both of them and critique both of them. It's what separates us from the faggots.",
                "author": "RentFree2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 SECRETARY OF WAR PETE HEGSETH: \"My charge to all of you: live worthy of Charlie Kirk's sacrifice, and put Christ at the center of your life as he advocated for giving his.\" \"Charlie has heard the words. Well done, good and faithful servant. Charlie will take it from here.\"",
        "score": 1422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He said \"Charlie *we'll* take it from here.",
                "author": "Nerdrem3"
            },
            {
                "raw_content": "It's wonderful to hear so many of our elected leaders speaking of Christ our Lord.",
                "author": "Undying"
            },
            {
                "raw_content": "https://x.com/EricLDaugh/status/1969871908301861159",
                "author": "Looniz74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk's legacy, in a single video",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amazing event today. Christ still reigns.",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "# Praise God",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Charlie, Iryna, Cannon Hinnant, and all the other people killed by their insane ideology deserves all the retribution that can be mustered by this administration. I am not holding my breath with \"Valhalla\" Kashapp and Scamela Blondi. We need people in there that will do what it takes no matter what.",
                "author": "MickHigan2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RIP Charlie. RIP Iryna. These damned demons.... I hate them with every ounce of my being. Don't look at black twitter right now. It's not good for your soul.",
        "score": 1601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That poor girl. This one I was more viscerally angry and emotional about. Charlie Kirk just boosted my seething rage at the left, but this one hit on another level.",
                "author": "TrumpKirkGod"
            },
            {
                "raw_content": "It hurts your IQ level.",
                "author": "snakeoil"
            },
            {
                "raw_content": "Joggers are gonna jog. Time to fight back.",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dayum that's spicy",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boom",
                "author": "alfredbester"
            },
            {
                "raw_content": "Remember when the British did this for a bunch of African countries, were then forced out, and then those countries went to shit?",
                "author": "Talledega"
            },
            {
                "raw_content": "India was a fucking side quest. One company took over all of India.",
                "author": "lefty295"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[der8auer] Gigabyte’s Liquid Metal Is Not What You Might Think",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the thermal performance of paste with the hassle and lack of reliability of liquid metal. Sounds like marketing did the engineering on this one.",
                "author": "CatsAndCapybaras"
            },
            {
                "raw_content": "People haven't watched the video I see, what a shocker on reddit. DerBauer is saying this card is performing great, no coil whine + good fan noise + good temps. This video is more about the interesting thing that is paste + liquid metal mixes.",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "Gigabyte at this point has to be the worst GPU AIB to get. You had popping PCIe 8-pins on 30-series, cracking PCBs on 40-series, and thermal \"goop\" leaking and now this with 50-series.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MediaTek Dimensity 9500 Unleashes Best-in-Class Performance, AI Experiences, and Power Efficiency for the Next Generation of Mobile Devices",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "32% higher ST performance is an exceptional jump. It should close the gap with Apple and Oryon V2. Although I wonder why the MT performance has stagnated. This was already a bit of a weakpoint for Mediatek. GPU performance jump seems great. And if I'm right, they were already ahead of Qualcomm a bit. So its upto Qualcomm now.",
                "author": "Famous_Wolverine3203"
            },
            {
                "raw_content": ">TSMC N3P >CPU >1x Arm C1-Ultra @ 3.63 GHz, 2MB L2 cache >3x Arm C1-Premium @ 3.3 GHz, 1MB L2 cache >4x Arm C1-Pro @ 2.4 GHz, 512KB L2 cache >16MB L3 cache >10MB SLC >Armv9.3 SME2 >GPU >Arm Mali-G1 Ultra MC12 >Memory >LPDDR5X 10667 >Storage >UFS 4.1 (4-lane) https://www.mediatek.com/products/smartphones/mediatek-dimensity-9500 CPU clock speeds from [Android Authority](https://www.androidauthority.com/mediatek-dimensity-9500-launch-3598962/)",
                "author": "FragmentedChicken"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Flashing XT BIOS on AMD Radeon RX 9070 Yields up to 25% Performance Boost",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In real-world gaming, the card only managed to gain roughly 8-12% uplift over the stock SKU well thats a bit less than 25% >The entire cause of this FPS increase is the enhanced power limit, which increases the non-XT 220 W board power to as much as 300 W, representing a roughly 36% power increase on its own. very inefficient gains",
                "author": "LuminanceGayming"
            },
            {
                "raw_content": "[Obligatory link to original reddit post](https://www.reddit.com/r/radeon/comments/1nlpqx3/flashed_the_reaper_9070_into_a_fake_xt_boosted_my/?share_id=Cf60552_29-W9lDf8MHMb)",
                "author": "venfare64"
            },
            {
                "raw_content": "Source coming from a reddit post (that has a link to the BIOS): [https://www.reddit.com/r/radeon/comments/1nlpqx3/flashed\\_the\\_reaper\\_9070\\_into\\_a\\_fake\\_xt\\_boosted\\_my/](https://www.reddit.com/r/radeon/comments/1nlpqx3/flashed_the_reaper_9070_into_a_fake_xt_boosted_my/) Keep in mind in terms of power scaling the 9070 is more or less perfect at \\~220W while the 9070 XT at \\~300W. I think this BIOS is useful for getting the base 9070 near \\~300W at max as Adrenalin at most gives you +10% PL so if you have a 9070 with a stock BIOS TBP at \\~220W you can only go at most \\~240W.",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Most Powerful Handheld - GPD Win 5 - Quick Look (Strix Halo)",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't think it was likely Strix Halo's large FP11 package would fit into handhelds but here we are, with the GPD Win 5 at the smaller end of handhelds at that. Even when you're pushing it in Black Myth Wukong at \\~40W it's at \\~60c and in God of War Ragnarok at \\~65W it's at \\~75c, (this is with the battery pack) though probably at high RPM/noise (wasn't measured). At 25W, GPU loaded you can get 2x the performance of regular Strix (Z2E, HX370). If not GPU bound for ex., performance isn't that much different in Space Marines to \\~20% in Returnal. Cary finds that diminishing returns for Strix is at \\~18W and Halo \\~45W. Also, Strix is running Bazzite while Halo, Win11, no tuning for either (for a later video). Lighter games, 2D games like Celeste, it can impressively go at \\~6W package and \\~10W total system. Total system can go lower if fan scaling is exposed, Cary suggest if it's at 40c, fans should be able to shut off. The Asus system he tested could go down to \\~7W total system. Though, since this is a first look, there isn't a direct comparison to LNL, which excels at this power envelope. Speaking of low power, this really intrigues me on potential power behaviour for Zen6 desktop (hopefully high idle and in low workloads is gone). Halo impresses again, but pricing is obviously expensive. Cary has some interesting points to suggest otherwise, though, there isn't much else to comment about it as it's been repeated countless times by what people think about Strix Halo pricing.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Would be interesting to see how the 8050S does with 8 CPU cores at lower power.",
                "author": "kingwhocares"
            },
            {
                "raw_content": "It seems still cheaper than most ai max 395 device",
                "author": "Black_Hazard_YABEI"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How come liquid metal pads are not more popular?",
        "score": 6,
        "text_content": "They're basically just thin solid metal foil sheets that melt at about 50-60 °C. Been using them for over a decade in all my laptops and some of my GPUs. Performance should be as good as liquid metal, very easy to apply, without the risk of destroying your board, while being copper-compatible. So, how come they are not more popular? Is it because the cooler can become hard to remove? Or do people just not know they're an option?",
        "comments": [
            {
                "raw_content": "Probably because it's barely featured in anything. Hell, even I just heard of an LM pad. Though looking at comments from others, apparently it can be hard to apply? Seems like you gotta heat it up with the CPU to melt it and keep tightening the cooler while doing so so you can have better boundary layer. But imho, the biggest part why LM pad isn't a thing is simply because regular paste is good enough. Majority of customers aren't looking for the bleeding edge, they just want a good enough daily driver. There's virtually no difference between a 67ºC CPU and 60ºC CPU nowadays too.",
                "author": "Irisena"
            },
            {
                "raw_content": "While I admit I've never heard of LM pads before, PTM has an even lower boiling point (45c), is 100% non-conductive, and won't corrode your copper heat pipes and baseplate. Plus, it's also very thin (0.25mm), so it's usually a non-issue to have perfect contact. I somehow doubt an LM pad would be that thin. Besides, my desktop GPU peaks at high 50s (undervolted, de-shrouded with Lian Li P28s, and pasted with PTM7950), mostly staying in the low-mid 50s. I can't think of a single good reason to 'paste' my card with something that boils at 50-60c. Of course, laptop users are a different story. It seems like gaming laptops' heatsinks are getting smaller by the generation while the power consumption keeps going up.",
                "author": "GenZia"
            },
            {
                "raw_content": "PTM7950 is widely used, provides the same benefits without the risk and negatives.",
                "author": "Radiant-Fly9738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS Concept PCIe Slot Delivers 250W Power via Front Connector",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just really want a 600W standarized integrated power connector to the motherboard at this point.",
                "author": "imKaku"
            },
            {
                "raw_content": "It’s time the consumer industry rip off the band-aid and adopt 48VO",
                "author": "djent_in_my_tent"
            },
            {
                "raw_content": "i think it's implemented cleanly. backwards compatible, 5 extra beefed up pins for more current isn't hard, probably easier and safer to implement vs 12VHPWR",
                "author": "TheImmortalLS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Apple Is Trying Control All Core iPhone Chips And Prioritize AI",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">people want to hear more about AI No, they really don't. No normal person cares about AI features.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo should do their own Kingdom Hearts type game with Captain N.",
        "score": 27,
        "text_content": "I think it would be awesome. You could travel to all the Nintendo themed worlds and stop the bad guys.",
        "comments": [
            {
                "raw_content": "Smash",
                "author": "Hungry_Opinion_8521"
            },
            {
                "raw_content": "\"Nintendo kingdom hearts\" oooooh 😮 \"with captain N\" ![gif](giphy|3o6Ztdq1bnNedW5iRa)",
                "author": "Puzzled-Diamond-1324"
            },
            {
                "raw_content": "How can you be old enough to remember captain n but not remember subspace emissary?",
                "author": "RedViper_100"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I dont think Ive ever been in a situation where whether I buy the intended version for my console, or if I buy the old version + digital upgrade purchase, hinges completely on whether the former has a strong reverse cover art on it. The FF7 approach should be mandated for S2 Editions.",
        "score": 288,
        "text_content": "Which version are u buying? I kinda want a switch 1 version and then to put it in the red cover as an alternative solution. This game cant come too soon!",
        "comments": [
            {
                "raw_content": "I also said this should become standard when the FFVII reverse cover was revealed. Even just the same image without the ugly text would be fine—this has become standard in German blurays which removes the giant age rating",
                "author": "grmayshark"
            },
            {
                "raw_content": "I’m sure that stuff has to be on there for legal reasons, but man is that not the ugliest box art text ever?",
                "author": "nthomas504"
            },
            {
                "raw_content": "Same here. I feel like getting 1’s version + upgrade for this and Pokemon. I get two versions of the game at the same price as the 2 itself. I think my rule now is getting the switch 2 game if it’s really exclusive to that console .",
                "author": "Ice2192"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Check your Best Buy accounts you may have a $10 certificate expiring soon",
        "score": 135,
        "text_content": "Your mileage may vary, I haven't used Best Buy in forever and I still had the certificate in my account my buddy had one as well.",
        "comments": [
            {
                "raw_content": "Where do I check?",
                "author": "Sufficient_Goose_602"
            },
            {
                "raw_content": "Cool to see it works on pre-orders, I can get the mat and 10 bucks off Legends ZA",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "Used mine to preorder Octopath Traveler 0.",
                "author": "zakpat"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think Donkey Kong 64 will ever come too NSO?",
        "score": 9,
        "text_content": "After playing Bananza and see videos of it on YouTube I would like to play it.",
        "comments": [
            {
                "raw_content": "There was a part of a Nintendo video on the N64 NSO where people noticed it and a few other games were underneath the menu blur.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Yes",
                "author": "Bortwellington"
            },
            {
                "raw_content": "Yes. I'm sure it is just a matter of drip feed and ironing out emulation problems. Previously, the biggest hurdle was the classic Rare games but that was cleared during the Wii U era. A new agreement might have to be ironed out for an NSO release but we also have Rare games on NSO now. Also, it was sort of leaked in a recent NSO graphic so it is probably coming sooner than we think.",
                "author": "Jaketrix"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hitman im enjoying",
        "score": 32,
        "text_content": "Think it runs and it looks good, guess the patch improved it before i bought it.",
        "comments": [
            {
                "raw_content": "Are you Yoda?",
                "author": "Remarkable-Cow5111"
            },
            {
                "raw_content": "Happy, we are all for you",
                "author": "solo_entrepreneur"
            },
            {
                "raw_content": "Are there gyro controls? Or stick-aim only?",
                "author": "ramii_sfn00"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden ring Delayed?",
        "score": 29,
        "text_content": "Hi everyone, Since Elden Ring Tarnished Edition wasn't in the direct. I kind of want to know if anyone heard someone talk about if Elden Ring is going to be delayed or if it is already. I I don't mind if it is going to be delayed. I just really want to know the severity of the delay.",
        "comments": [
            {
                "raw_content": "I don't think it not being in the Direct is indicative of it being delayed. It could have just not been in the Direct.",
                "author": "Williekins"
            },
            {
                "raw_content": "Well Tokyo game show is later this week. If it’s not mentioned I’m assuming it’s delayed to maybe early next year.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "I kinda wish they would bring a port for D2/D3 bring the trilogy. It definitely has to be easier on Switch 2 hardware than the newer Elden Ring.",
                "author": "MikeyFromDaReddit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Concept of the cancelled Perfect Dark Reboot released.",
        "score": 471,
        "text_content": "Wasn't sure if this was posted so my apologies in advance, thought it was worth sharing. [https://mp1st.com/news/gameplay-details-concept-screens-cancelled-perfect-dark-reboot](https://mp1st.com/news/gameplay-details-concept-screens-cancelled-perfect-dark-reboot)",
        "comments": [
            {
                "raw_content": "The implication it was to be an episodic game is wild. Remember that rumor that not only was The Initiative's game to be episodic, but that each episode would be focused on a different IP? Idea is dumb as shit, but it's possible the information was partially correct if this new information is true.",
                "author": "Coolman_Rosso"
            },
            {
                "raw_content": "Not even gonna look at it just to save myself the pain",
                "author": "YukYukas"
            },
            {
                "raw_content": "I’m still so pissed that this game got scrapped. Genuinely one of the worst days to be an Xbox fan",
                "author": "KeybladeBrett"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Gematsu, an unknown Xbox game will be shown for an hour at TGS",
        "score": 359,
        "text_content": "Gematsu recently posted the [lineups and schedules](https://www.gematsu.com/event/tokyo-game-show-2025) for the different publishers that will be at Tokyo Game Show. Under the section \"Famitsu / Dengeki Online\" there is a schedule for the 27th, with the item (time is in JST): > 19:00 – Xbox Title (Microsoft Gaming) Which lasts for an hour. However, no description or hints are given at to what this title could be. The text under \"Official Program\" for the Xbox show makes no mention of any titles either, whether announced or not. Chances are that it could be Forza Horizon 6, as that is currently rumoured to be revealed at TGS, likely at the Xbox show, and previous games have had long livestreams deducted to talking more about the game a few days after the reveal.",
        "comments": [
            {
                "raw_content": "Obviously Forza Horizon 6",
                "author": "keyblaster52"
            },
            {
                "raw_content": "Anyone else got a clue what this could be? FH6 is an easy guess",
                "author": "ExplodingFistz"
            },
            {
                "raw_content": "Fable?",
                "author": "Danny_Fly_to_High"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bandai Namco trademarks “World Fighters” in the US and EU",
        "score": 162,
        "text_content": "https://bsky.app/profile/gematsu.com/post/3lz4v4g5tk22s No idea what this could be but, BN did trademark “Dream Match” in Japan. Maybe this has something to do with that?",
        "comments": [
            {
                "raw_content": "Could be a Bandai Namco crossover fighter?",
                "author": "HunterHale"
            },
            {
                "raw_content": "Optimus Prime is gonna throw hands with Bomberman again",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Finally the sequel to DreamMix TV World Fighters for PS2",
                "author": "PalapaSlap"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel Rivals upcoming characters in active development",
        "score": 289,
        "text_content": "According to user XOLEAK in a twitter [post](https://xcancel.com/X0X_LEAK/status/1967052074593775930) the characters in active development are: * **Professor X** * **Gambit** \\- (Previously Jia Jing) * **Elsa Bloodstone** \\- (Previously Paste Pot Pete) * **Colossus** * **Locus** * **Rogue**",
        "comments": [
            {
                "raw_content": "![gif](giphy|xc6ijwxQwcPfO|downsized) Leaked Professor X emote coming in the future",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Xmen Evolution skin for Rogue please ![gif](giphy|Aq6GD5Sa6uuuk)",
                "author": "WanderingHero8"
            },
            {
                "raw_content": "It’s wild that Deadpool & Cyclops are not in active development.",
                "author": "VakarianJ"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tomb Raider Anniversary Trophy List Leaked for PS4",
        "score": 206,
        "text_content": "It looks like Tomb Raider Anniversary is coming for modern platforms, as the trophies for the PS4 version have been leaked. [https://www.reddit.com/r/TombRaider/comments/1nmlwuc/anniversary\\_leaked\\_for\\_ps4/](https://www.reddit.com/r/TombRaider/comments/1nmlwuc/anniversary_leaked_for_ps4/) And this coincides with what I told you last month, that the remastered Legend trilogy is coming. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n0rq5c/tomb\\_raiders\\_official\\_x\\_account\\_may\\_be\\_hinting\\_at/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n0rq5c/tomb_raiders_official_x_account_may_be_hinting_at/)",
        "comments": [
            {
                "raw_content": "I hope it's the Remastered version and not the PS2 emulated one like Legend",
                "author": "Purple_Priority2296"
            },
            {
                "raw_content": "Could just be a PS2 Classic like Legend rather than a remaster",
                "author": "ShadowStealer7"
            },
            {
                "raw_content": "Wouldn't this game coming by itself mean that it's not being remastered and instead just ported?",
                "author": "Deadly_Toast"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Horizon Zero Dawn Coming to Xbox",
        "score": 34,
        "text_content": "https://www.reddit.com/r/xbox/s/nU2cQ6Fpzx Can’t post images so I am going to post the original post from Reddit. Basically, there is a link to the Xbox store for Horizon Zero Dawn if you look it in google. Once you go there, it leads to the German Xbox store that states that URL that you are looking for can’t be found. Maybe there will be an announcement soon? Thought it was something that belonged here.",
        "comments": [
            {
                "raw_content": "That link has been there for years because of the PC version I believe. Uncharted also has one.",
                "author": "Tugajohn"
            },
            {
                "raw_content": "Didn’t something like this happen with the last of us like over a year ago? Edit: Actually it was a thing and it’s still up, curiously it also goes to the German store, some random German guy trying his best to manifest them into existence maybe? lol: https://imgur.com/a/hZFg2ca",
                "author": "Gen6V"
            },
            {
                "raw_content": "Don’t think this means anything, u can search basically any PS game on google and it has a Xbox German Xbox link.",
                "author": "DB1308"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dell PowerEdge XE7740 with Intel Gaudi 3 PCIe Accelerators: Purpose-Built AI Power for the Enterprise",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a review, just a press release - no price or performance figures",
                "author": "alexp702"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "A clean black/silver/wood PC Build for 2025 with the very best Team Red has to offer (9800X3D/9070 XT)",
        "score": 120,
        "text_content": "What from the beginning of the year was originally was supposed to simply just be an AM4 -> AM5 upgrade (since I had a 5800X3D and they had incredible resale value after all these years while at the same time AM5 got a lot cheaper to make the upgrade), turned out to pretty much be an almost entirely new build from all the upgrades I've ended up doing throughout the year (only thing that remained the same was storage and PSU lol). This was built out of a mix of brand new and used/refurbished parts, hunted plenty of deals throughout the year on most of the parts (such as 9800X3D for £260 off Aliexpress, open box stock from Overclockers UK of the 9070 XT Nitro for £569 (9070 XT MSRP and significantly below Nitro's MSRP), 64GB Kingston Fury RGB DDR5 kit for £100, Arctic LFIII 360 A-RGB for £50, refurbished MSI X670E Tomahawk for £145 off eBay and Antec Flux case off Computer Orbit for £84). Total cost of pretty much the entire PC sans the storage came out around £1350, quite a bit of PC for that kind of money if I'd say so (and also not compromising on the aesthetics either IMO with this classy, non over the top look), and runs incredibly cool and quite all around under load. Here's the full specs: **CPU:** AMD Ryzen 7 9800X3D (8C/16T, up to 5.4GHz) **CPU Cooling:** Arctic Liquid Freezer III 360 A-RGB (3x Arctic P12 PWM PST A-RGB fans) **GPU:** Sapphire NITRO+ AMD Radeon RX 9070 XT (16GB GDDR6) **RAM:** 64GB Kingston FURY Renegade Black RGB DDR5 6200MHz CL30 Hynix A-Die (2x 32GB) **Motherboard:** MSI MAG X670E Tomahawk WiFi (ATX) **NVMe SSD 1:** WD\\_BLACK SN850 2TB (PCIe Gen 4) **NVMe SSD 2:** Corsair Force MP510 960GB (PCIe Gen 3) **NVMe SSD 3:** SanDisk Extreme PRO 1TB (PCIe Gen 3) **SSD 1:** Crucial MX500 1TB (SATA III) **SSD 2:** Samsung 850 PRO 256GB (SATA III) **HDD 1:** Western Digital Black 1TB 7200rpm (SATA III) **HDD 2:** HGST Travelstar 1TB 5400rpm (SATA III) **Case Fans:** 5x Arctic P14 PWM PST **PSU:** Corsair RM850 (2021) (80+ Gold) + Corsair black sleeved power cables **Case:** Antec Flux - Black **Thermal Paste:** Thermal Grizzly Polartherm X-10 **OS:** Windows 11 Pro x64 Here's some 3DMark results as well with a daily stable OC applied to the CPU and GPU (although I had a different motherboard for these it shouldnt affect the results): [https://www.3dmark.com/sn/7864109](https://www.3dmark.com/sn/7864109) [https://www.3dmark.com/pr/3588081](https://www.3dmark.com/pr/3588081) [https://www.3dmark.com/spy/57901883](https://www.3dmark.com/spy/57901883)",
        "comments": [
            {
                "raw_content": "That’s a beautiful case.",
                "author": "Izenthyr"
            },
            {
                "raw_content": "waiting for my 7900XTX to arrive on Tuesday; 9800X3d, 96GB DDR5 Corsair, Flux Pro case, 15 fans lol, arctic LF iii 420, 8tb nvme, MSI mobo, Montech century ii PSU. The 9800X3D has been a massive upgrade from my 13th gen intel i7, fewer cores but much snappier overall.",
                "author": "Impossible-Glass-487"
            },
            {
                "raw_content": "That GPU really might contend for the best looking of all time.",
                "author": "lioboii"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "VASTARMOR unveils RX 9070 Super Alloy PRO (White) with three fans and phase-change thermal pads",
        "score": 27,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Going full Team Red after decades",
        "score": 61,
        "text_content": "Hi all, Good to be back on Team RED! **The build:** NZXT H6 FLOW MSI B850 Gaming Plus Wifi AMD 9800x3D Asus Tuf 9070 XT 32gb Trident Z5 Neo RGB Thermalright Peerless Assassin 120 Digital Black Asus Rog Strix 1200w Platinum **Some notes:** Peerless Assassin 120 Digital Black fits in NZXT H6 Flow and it is not even a tight fit. There is 0.5cm+ space between the glass and the digital display. You can use Trident Z5 Neo RGB sticks with PA 120 Digital. There is enough clearance. First boot; yellow blinking light, solved after moving sticks to 2-4 from 1-3 as stated on the manual System powered up; everything is working but boot up times are abysmal ( 60+ seconds ), solved after bios update. Getting driver timeout for GPU on every restart; solved after disabling fast boot in Windows. Getting driver timeout on Doom The Dark Ages; solved after removing second screen. **CPU temps:** 52-53 idle and 64-65 on heavy gaming but saw 93-94 while compiling shaders for Borderlands 4. After setting PBO -20, idle and gaming temps are same but never saw higher than 75 during torture.",
        "comments": [
            {
                "raw_content": "fenerbahceeee",
                "author": "Hellwx"
            },
            {
                "raw_content": "hayırlı olsun knk",
                "author": "VinumNoctua"
            },
            {
                "raw_content": "H6 Flow is the best case I've built in for it's size",
                "author": "DCA2ATL"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Finally retired my 8 years old Vega 64+Morpheus 2 for an RX 9060 XT",
        "score": 33,
        "text_content": "Got that old beast for the MSRP back in 2017 during the first week of launch before the prices skyrocketed because of the GPU shortage caused by mining back then, 500€, added the morpheus 2 plus a couple of fans and it was such a blast, it ran titles like XCOM 2, hitman 2, Outer worlds l, Kingdome Come and many others like a champ, hell, was still very decent to play oblivion remastered! And it was an undervolting beast too, I would usually run it with only 1.08v instead of the original 1.2, and still would be able to put the memory clock to 1050Mhz! Which is absurd bandwidth considering the huge bus that HBM memory rocks(2048bit). The only down side was the clunky nature of that build, the heatsink on the voltage controlers wouldn't stick so I used zip ties and an elastic band to keep it tight in place, which would destroy over time because of the heat of course, and then make the card unable to maintain its performance(mind you, the last elastic survived 3 years before breaking!). Loved that card, really worth every penny, one of the best investments I ever made in computer parts, lots of fun to play with its clocks and voltages ... But I wanted the newer games to run more steadily on my 1440p, so I finally caved in to replace it now that I think a sizable upgrade for a good price is available with the 9060 XT. I just tried it a little bit and it really feels like a proper upgrade, for just 350€! Am glad I took the 16Gb by the way seeing how Oblivion remastered easily uses 12Gb of VRAM, and even Mordhau eats more 9Gb and I've seen RDR2 eat more than 13Gb ... Impressed by the silence while running too, but not impressed by the plane taking off noise when manually putting the fans at full speed, lmao, my good'ol Vega was always silent even with its fans at top speed ... Is it weird to be attached to a GPU? 🥲 By the way, question for any GNU/Linux users who might be reading this, is there a way to change the core frequency? CoreControl used to allow me to adjust core frequency and voltage steps on my Vega 64, seems to only allow OC of the Vram and change in voltage with the RX 9060 XT as per the fifth image",
        "comments": [
            {
                "raw_content": "Nice! The 9060xt runs surprisingly cool and the xfx 3 fan I got is basically silent aswell!",
                "author": "diego5377"
            },
            {
                "raw_content": "The 9060xt really feels like a return to the segment I've been missing. The mid range has been such shit for so long that I gave up on it entirely generations ago, and I haven't been totally satisfied with the space heaters I've been using since. I hope this keeps up so I can \"sidegrade\" to something more efficient sometime.",
                "author": "DuckInCup"
            },
            {
                "raw_content": "Add the kernel parameter amdgpu.ppfeaturemask=0xffffffff I don’t believe adjusting the frequency steps is a thing anymore. All you can do is a frequency offset and a minimum and maximum.",
                "author": "ZweihanderMasterrace"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Northern New Jersey Real Estate Market",
        "score": 3,
        "text_content": "Northern NJ real estate market is still red hot: * Essex County: single-family average sale **+10.1% over ask** * Morris County: **+5.7%** * Passaic County: **+5.3%** * Bergen County: **+4.3%**",
        "comments": [
            {
                "raw_content": "Any data, links, or facts here or are we just spouting bullshit for no reason Mr. Reddit Account Made 1 Hour Ago?",
                "author": "Kraven_Lupei"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lennar Q3: 21.5K homes delivered as incentives rise and margins tighten",
        "score": 48,
        "text_content": "Lennar delivered about 21,500 homes and logged just over 23,000 new orders in Q3, in line with guidance. But profitability came under pressure, with gross margin slipping to 17.5% and net margin at 9.2%, as sales incentives rose to 14.3% to offset affordability challenges. Management guided Q4 deliveries of 22,000–23,000 homes and EPS of $2.10–$2.30, signaling steadiness despite market headwinds. The company still boasts a strong balance sheet with $1.4B in cash and $5.1B liquidity, and continued its aggressive capital return strategy, repurchasing 4.1M shares for $507M in Q3. Executives stressed that current adjustments are temporary, aimed at letting the market “catch its breath” rather than a long-term strategy shift.",
        "comments": [
            {
                "raw_content": "Lol the homes built by these companies during this period are gonna be absolute garbage in quality aren’t they?",
                "author": "boboman911"
            },
            {
                "raw_content": "Many buyers are preferring fully remodeled existing homes to newly built houses because the newly built houses are in less desirable locations, are smaller in size on smaller lots, and have basic finishes and poor workmanship in some areas because most builders faced high material and labor costs in the last 2-3 years and cut corners wherever they could. If you can find even a 75 year old concrete block home with a new roof, new plumbing, new electrical, new AC with new modern kitchen, bathrooms and flooring, why do you need to buy a newly built house with less desirable attributes and defects?",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Top buyers and sellers markets in US",
        "score": 5,
        "text_content": "New Zillow update rates 250 housing markets as buyers or sellers markets - Fast Company https://share.google/RHhUwi1KjgLrC73Es Among the 250 largest metro-area housing markets, these 20 are the HOTTEST markets, where sellers have the most power: Rochester, New York → 153 Buffalo, New York → 107 Hartford, Connecticut → 90 Syracuse, New York → 90 Albany, New York → 82 Charleston, West Virginia → 81 Poughkeepsie, New York → 80 San Francisco → 79 Norwich, Connecticut → 79 Binghamton, New York → 76 New York City → 74 San Jose, California → 74 Bridgeport, Connecticut → 74 Springfield, Massachusetts → 73 Canton, Ohio → 73 Kingston, New York → 73 Providence, Rhode Island → 72 Lansing, Michigan → 71 Manchester, New Hampshire → 71 Boston → 70 Among the 250 largest metro-area housing markets, these 20 are the COLDEST markets, where buyers have the most power: Jackson, Tennessee → 8 Terre Haute, Indiana → 10 Macon, Georgia → 20 Lafayette, Indiana → 21 Florence, South Carolina → 22 Gulfport, Mississippi → 25 Longview, Texas → 27 Beaumont, Texas → 29 Brownsville, Texas → 30 Naples, Florida → 30 Lubbock, Texas → 30 Asheville, North Carolina → 31 Waco, Texas → 31 Daphne, Alabama → 31 Panama City, Florida → 31 Hickory, North Carolina → 32 Bowling Green, Kentucky → 33 Gainesville, Florida → 34 Punta Gorda, Florida → 34 McAllen, Texas → 35",
        "comments": [
            {
                "raw_content": "Selling a house in Asheville this summer was no fun.",
                "author": "crimi_nole"
            },
            {
                "raw_content": "Absolutely brutal being a buyer in Rochester. Lack of inventory prices are still way over pre pandemic levels.",
                "author": "Same_Dot9698"
            },
            {
                "raw_content": "Not surprised to see Poughkeepsie NY on the list. Just bought a house here 6 months ago and my neighbors next door is going for 60k more. Very low inventory in the Hudson Valley and POK was one of the last “cheap” places to buy. Rents are sky high in the region with only Newburgh being the last cheap spot on the river but with the trade off of high crime rate. The entire northeast seems to be forever climbing in price for real estate.",
                "author": "that_ghost_upstairs"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Primary target locked! This guys the first one to go",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Switch to OFFENSIVE MODE!\" 2 seconds later, human running around with rope around their neck",
                "author": "rekzkarz"
            },
            {
                "raw_content": "It's sped up to make it look more impressive. Let's see it in real speed.",
                "author": "yaosio"
            },
            {
                "raw_content": "Wait until these are good enough to assist the police. Lol Hell. Be police.",
                "author": "StupidDrunkGuyLOL"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Goodwill CEO says he’s preparing for an influx of jobless Gen Zers because of AI—and warns, a youth unemployment crisis is already happening",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More governments should get ready. It is inevitable in the next decade",
                "author": "Advanced_Poet_7816"
            },
            {
                "raw_content": "Employment is being attacked on all angles: - Gig work is taking over - There are no labor protections, therefore it's cheaper and more attractive to employers - Operates on a global scale, driving down labor costs. - Combined with weak protections, this global market produces a race to the bottom. - The effect is suppressed wages in higher-cost economies, pressuring skilled workers to relocate or downgrade expectations. - The push for remote work is turning employers to a global market, which in turn ties in with gig work - AI is eroding the foundation of the workforce - Entry-level positions - the traditional stepping stones into careers - are disappearing. - Many employees secretly rely on \"shadow AI\", adopting unsanctioned tools for personal productivity, which helps them individually but undermines collective adoption and governance. - Rather than reducing workloads, AI enables managers to assign heavier workloads to fewer staff, cutting headcount. - Meanwhile, companies pour capital into experimental AI products, often duplicating effort and burning resources in the hope of replacing staff functions. It is not looking good. Many people are being forced to risk it all in startups, which are being circled by the same venture capitalists that are encouraging the environment. Approximately 90% of all tech start ups fail. Soon these failures will start hitting investors. It will be interesting to see what happens.",
                "author": "This_Organization382"
            },
            {
                "raw_content": "What the USA thinks it's #1 in (and its actual rankings): Life Expectancy: 46th FreePress: 42nd Healthcare: 30th Education: 26th Happiness: 23rd Freedom: 17th What the USA is #1 in: Military Spending Number of Billionaires Incarceration Bankruptcy filings Medical debt Gun deaths",
                "author": "Democrat_maui"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There is a very real possibility that Google, OpenAI, Anthropic, etc. will release their own super cheap versions of Grok-4-fast!",
        "score": 368,
        "text_content": "It seems that Grok-4-fast was created based on Jet-Nemotron architecture. [https://arxiv.org/abs/2508.15884v1](https://arxiv.org/abs/2508.15884v1) It allows to massively decrease the amount of compute needed for inference without sacrificing the model performance. It also allows for a much bigger context window since the price no longer scales quadratically but linearly! **So basically:** everyone can implement this architecture without retraining. The price of models can be **Drastically** reduced without sacrificing accuracy much. XAI did it first, but others will definitely follow (if they haven't already). >There is a high chance that OpenAI has already done it: A sudden slash in prices on o3 by 80% and then GPT-5-thinking being even cheaper in a very short period of time.",
        "comments": [
            {
                "raw_content": "been testing grok 4 fast reasoning against gemini 2.5 pro with difficult math problems, and for the most part they are very similar in intelligence which is pretty incredible.",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "I feel like this new model/architecture is extremely under hyped",
                "author": "Duckpoke"
            },
            {
                "raw_content": "Do you have any reason/evidence to believe/demonstrate this is what xAI did? This feels like we’re imposing a preferred explanation more than anything else.",
                "author": "AFewMundaneConcepts"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Release of new features for pro users",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perhaps some cheaper version of their IMO model. Google only released a bronze medal version of their IMO model and even that's rate limited at 10 messages per day so they must be insanely expensive to run.",
                "author": "leaderxyz"
            },
            {
                "raw_content": "Any idea what this could be?",
                "author": "Wonderful_Buffalo_32"
            },
            {
                "raw_content": "\"some products will have additional fees\" That better not be in addition to the $200/month...right?",
                "author": "NotCollegiateSuites6"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI to spend ~$450B renting servers through 2030, including ~$100B in backup cloud capacity from providers",
        "score": 144,
        "text_content": "According to the [report](https://www.theinformation.com/articles/openai-spend-100-billion-backup-servers-ai-breakthroughs), OpenAI excs consider the servers “monetizable” because they could generate additional revenue not yet factored into projections, whether through enabling research breakthroughs or driving increased product usage. At a Goldman Sachs conference last week, CFO Sarah Friar explained that the company often has to delay launching new features or AI models due to limited compute capacity, and sometimes must intentionally slow down certain products. She described OpenAI as being “massively compute constrained.”",
        "comments": [
            {
                "raw_content": "That's a lot more r&d compute than I expected",
                "author": "ToeLicker54321"
            },
            {
                "raw_content": "This is why Google is advantaged: TPUs",
                "author": "GamingDisruptor"
            },
            {
                "raw_content": "Feels like the only way they will make that amount of money is by mag7 circle jerk each other",
                "author": "Pitiful_Difficulty_3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New SWE-Bench Pro becnchmark (GPT-5 & Claude 4.1 drop from 70%+ to ~23%)",
        "score": 180,
        "text_content": "Hey everyone, I haven't seen this posted here yet and thought it was really important. There's a new benchmark for AI software engineering agents called **SWE-Bench Pro**, and it looks like it's going to be the new standard. Top AI models that used to score 70%+ on the older benchmark are now only solving about 23% of these new problems. Even less if they come from propietary/private repos.",
        "comments": [
            {
                "raw_content": "It's surprisingly difficult to actually benchmark coding skills. You can come up with an arbitrary large set of real world issues. But the labs will voluntarily or involuntarily start to train on the solutions after some time. Scores rise until it's satisfied and you have to come up with a new benchmark that is not necessarily more difficult but just different.",
                "author": "Quarksperre"
            },
            {
                "raw_content": "Would be nice to have the avg human score by programming experience, like: trainee 15% junior 22% senior 37% pro 70%",
                "author": "QLaHPD"
            },
            {
                "raw_content": "They could be rug pulling intelligence: They release a nice model get the reviews then throttle back inference costs on the backend to save money. We probably need constant model evals to keep them honest",
                "author": "NeedsMoreMinerals"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LongCat, new reasoning model, achieves SOTA benchmark performance for open source models",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "562B param model ![gif](giphy|14aUO0Mf7dWDXW)",
                "author": "QLaHPD"
            },
            {
                "raw_content": "HuggingFace: https://huggingface.co/meituan-longcat/LongCat-Flash-Thinking Chat interface: https://longcat.ai",
                "author": "ShittyInternetAdvice"
            },
            {
                "raw_content": "my first time hearing of this company",
                "author": "Regular_Eggplant_248"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI FEARS",
        "score": 63,
        "text_content": "Hear me out, i watched a youtube video on Diary of a CEO and he was interviewing a software engineer who said AI is going to replace enough jobs that the level of unemployed will sky rocket. Ai agents do not need sleep, they don't need to be paid, companies will start buying more compute. Even people who drive for a living, self driving vehicles will be the norm eventually, driving is one of the most common jobs accross the world. What should i be doing to remain relevant either from a career standpoint or financially in saving to prepare? 50 yr old, middle management and this ai shit is quite frankly making me very concerned.",
        "comments": [
            {
                "raw_content": "Eventually most people will realize that UBI is necessary.",
                "author": "GuidedVessel"
            },
            {
                "raw_content": "\"they don't need to be paid\" That is not true. Either you have to \"rent\" them from an AI company, or you have to develop them on your own, which is extremely expensive. But yes, they are a lot cheaper than humans. The only play you have is to embrace AI and use them to make yourself more productive. This is, of course, a short to medium term solution. At least in the next few years (and the precise timeframe cannot be predicted accurately), companies are not going to get rid of ALL employees but they will hire fewer because if you use AI tools, it makes you a lot more productive.",
                "author": "NyriasNeo"
            },
            {
                "raw_content": "I watch a ton of Diary of a CEO. That one when he ordered drinks without being involved at all, using agents, just by asking it to get drinks for the group was wild. Learn a trade. Get into plumbing, tree service, machining. Pick one and get good at it companies are constantly losing guys. You'll get training on the job site.",
                "author": "fjordperfect123"
            }
        ],
        "subreddit": "singularity"
    }
]