[
    {
        "post_name": "ICE Arrests 223 ILLEGAL ALIENS Along Northwest Indiana Highways",
        "score": 1070,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ICE # ICE # BABY",
                "author": "BeauHD"
            },
            {
                "raw_content": "This guy lives in Carmichael, CA, which is a suburb of Sacramento. The entire trucking and freight brokerage industries in this area have basically been taken over by Ukrainians/Russians or Indians. I haven't come across an American trucker in quite some time. Not good.",
                "author": "steelbeams"
            },
            {
                "raw_content": "Hair should say \"none\" on that license.",
                "author": "Keep_on_winning_kag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: \"The anti-Mamdani vote is really the pro-New York City vote, the pro-America vote, needs to unite behind the leading candidate, and that's Cuomo”",
        "score": 668,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cuomo is a degenerate traitorous faggot.",
                "author": "Bramage"
            },
            {
                "raw_content": "These “elections” having to pick the “lesser of two evils” are complete B.S., shades of Obama vs. Romney, anyone?",
                "author": "Metalheads4Trump"
            },
            {
                "raw_content": "MAGA is bigger than Trump. MAGA doesn't want Cuomo.",
                "author": "Harvestsmiles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Independent rating of Congress:",
        "score": 673,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who the fuck rated them excellent?",
                "author": "Teufelhunden"
            },
            {
                "raw_content": "Republicans in congress basically do nothing and hope they don't get voted out. It's pretty pathetic.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "Learn to represent Americans.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They/Them Vogue no longer polluting youth",
        "score": 694,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Outstanding.",
                "author": "10MeV"
            },
            {
                "raw_content": "Ran out USAID money?",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "I got struck by, a smoove criminal. Looks like mj",
                "author": "ShadowInv"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC ballots are completely rigged.",
        "score": 628,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shouldn't that technically mean he's splitting votes with himself?",
                "author": "mykillk"
            },
            {
                "raw_content": "I like how they have these parties that sound nice to people who never do more than read a headline. \"'Working Families'? Ah, the candidate must support the working class! 'Safe&Affordable'? Sounds great to me! What kind of idiot wouldn't want to support these things?!\"",
                "author": "TheMrStone"
            },
            {
                "raw_content": "Don't you see? Zohran gets two votes to every one. It's the DEMOCRATIC way! The ballot says \"only vote for one\" but he gets two bubbles!",
                "author": "Herc130"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Adams: Getting Pluvicto (the cancer drug) tomorrow, via Kaiser Northern California. The Trump administration works fast. Amazing. For context, I waited months for the drug, like everyone else. But I think my files got misplaced or something and that glitch just got corrected. Not sure.",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What in HELL is the point of doing years of expensive research to cure cancer and then not letting patients have the resulting med? Our scientists are better than our bureaucrats.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "The obvious danger of the people controlling your medication knowing your politics and wanting to see you dead.",
                "author": "seeling0"
            },
            {
                "raw_content": "You were too White and openly protective of that, Patriot. Waiting months for life-saving remedies sounds like national free healthcare besides. Fuck Kaiser Permanente!",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New York City voters who supported Zohran Mamdani say they can’t wait for government-run grocery stores to open. In the video, a couple explains that the government should take over grocery stores because too many people are starving and prices would finally drop.",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cliff Notes: This couple is retarded.",
                "author": "16BeatsAOne"
            },
            {
                "raw_content": "Fucking retards. in what hippie shithole did these people grow up?",
                "author": "TrumpIsTheVictor"
            },
            {
                "raw_content": "I give up. They want it, let them have it.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am going to ask our Transportation Secretary, Sean Duffy, to take a good, long look at terminating New York City Congestion Pricing. The entire State is going to hell",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I say build a wall around NYC and let them work it out \"Escape From New York\" style.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "He is always trying to help out the cities full people who hate him. Maybe just let them rot and work towards improving life for the people who voted for him instead.",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "Please look at all the bullshit taxes in Illinois daddy",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMAO- they made the rules...",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's stupider is it seemed to be working",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "I'll bet shouting \"Aloha Snackbar\" would probably open a lane pretty quickly too.",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "I guess it's just me, but how can people live like that every day?",
                "author": "freedom-thinker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: It is my Great Honor to endorse MAGA Warrior Mark Lamb, who is running to represent the Great People of Arizona’s 5th Congressional District. The District is R+10 and has been a Republican stronghold since 2010. It's represented by Andy Biggs who is running for Governor in 2026.",
        "score": 867,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there a list of Trump endorsed candidates for Texas?",
                "author": "DeplorableNeandertal"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115488447377350651 **Results of Arizona’s 5th Congressional District for the 2024 election** - Andy Biggs - 255,628 votes (60.4%) - Katrina Schaffner - 167,680 votes (39.6%) I'd say Andy has a decent shot at becoming Governor. Especially because Hobbs and the Democrats don't have Dominion on their side anymore.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "If Matt wins will he get sworn in?",
                "author": "Klaus73"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dearbornistan mayor 😵",
        "score": 889,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Liberals are so gullible",
                "author": "Greenhills"
            },
            {
                "raw_content": "\"i want you out of here, because you don't believe in coexistence\" coexistence includes existing with people who aren't your religion.",
                "author": "ionizer"
            },
            {
                "raw_content": "And then one day, for NO REASON at all....",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor Greg Abbott: After the polls close tomorrow night, I will impose a 100% tariff on anyone moving to Texas from NYC.",
        "score": 1865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like a joke",
                "author": "Bearing51"
            },
            {
                "raw_content": "Get your state in order, pass a bill that bans anyone moving into your state from voting in state and local elections for ten years. Every state should be doing this.",
                "author": "SleeperAgentSupreme"
            },
            {
                "raw_content": "He flooded the country with millions and millions of hostile foreign invaders. Nothing. “Winning.”",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Outraged Woman Kicked Out and Has Her Gold’s Gym Membership Terminated After Complaining About a Biological Man in the Women’s Locker Room",
        "score": 1293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Trans is above black female in the liberal hierarchy.",
                "author": "Trumpchoochoo"
            },
            {
                "raw_content": "Note to self: If I want Gold's Gym to stop automatic membership charges, I can just complain about a tranny instead of going through the gauntlet of having my membership cancelled.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "All troons are perverts",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Washington Post: Mamdani is Extreme and NYC May Come to Regret This",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "May? Muslims are not compatible with any civilized society If they elect this goat fucking freak, they deserve what they get",
                "author": "Sea_Still"
            },
            {
                "raw_content": "This is not a question. They will absolutely regret it.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Only took 20 years to forget...that is it.",
                "author": "jermzdeejd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "700,000 Ineligible SNAP Recipients Purged After USDA Uncovers Widespread Food Stamp Fraud",
        "score": 1690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine how many more there will be when we finally get the data from the 21 blue states.",
                "author": "1_Badcop"
            },
            {
                "raw_content": "700,000 in a single incident means there are probably tens of millions. when an article is released about a scandal like this it usually means it's been going on for years or more. please investigate further.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "700k means there's going to be at least 70k shoplifting once they find out they're ineligible. Retailers better be increasing security. Imagine how much more affordable things would be if we lived in a culturally homogenous high IQ safe society.",
                "author": "MasterChief08"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The New Jersey subreddit is having a melt down over the election",
        "score": 1250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reddit is the biggest shithole on the internet Completely unusable",
                "author": "Sea_Still"
            },
            {
                "raw_content": "I didn’t get it so I looked it up. They’re such avid cultists 😂 Is the number 14 connected to nazis? “Yes, the number 14 is connected to neo-Nazi and white supremacist ideology. It refers to the \"Fourteen Words\" slogan: *\"We must secure the existence of our people and a future for white children,\"* which was coined by David Lane, a member of the white supremacist terrorist group The Order. The number 14 is used as a shorthand reference to this slogan within white supremacist circles. It is often combined with the number 88—which stands for \"Heil Hitler,\" as \"H\" is the eighth letter of the alphabet—to form the combined symbol 1488, a widely recognized neo-Nazi code. These numbers appear in graffiti, tattoos, online usernames, and extremist propaganda.” And now you know! 👍",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Everyone should be killed before they turn 14 to prevent them from becoming a nazi dogwhistle",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrats have been running this playbook for decades...",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill Clinton pardoned a member on his last day in office. That person later became part of BLM.",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "Obama's mentor and political patron. Bill Ayers.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "This is why I have a hard time with people who act like what is happening is something new. I remember the era well.",
                "author": "Kolob64"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House Cracks Down on Journalists Sneaking Around West Wing Communications Offices",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest them for espionage or for trying to access classified docs",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "From the source Fox article >”Some reporters have been caught secretly recording video and audio of our offices, along with pictures of sensitive info, without permission,\" he wrote on X. \"Some reporters have wandered into restricted areas.… Some reporters have been caught eavesdropping on private, closed-door meetings. Cabinet Secretaries routinely come into our office for private meetings, only to be ambushed by reporters waiting outside our doors.\" So… espionage charges when?",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "More softness. All that is needed: > White House Cracks Down on Journalists 97.8% of them are enemy propagandists, causing huge amounts of suffering. The Ack-Ack aliens in *Mars Attacks* did less damage in that building than the lying media have.",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jersey City mayoral candidate dubbed 'black Zohran Mamdani' vows to provide free legal services for illegal Invaders facing deportation",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This shit needs to stop in its tracks.",
                "author": "Jsmitty112"
            },
            {
                "raw_content": "> free There's that word again.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Deport muslim terrorist.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Adams thanks the POTUS",
        "score": 1798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate cancer. It kills everyone in my family. Being able to defeat cancer would honestly be one of human civilizations greatest accomplishment. Up there with going to the moon.",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Needs to be an investigation. Who was delaying Scott’s treatment?",
                "author": "SJWsHateUs"
            },
            {
                "raw_content": "God bless them both.",
                "author": "Fakehistory2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft CEO says the company doesn't have enough electricity to install all the AI GPUs in its inventory - 'you may actually have a bunch of chips sitting in inventory that I can’t plug in'",
        "score": 626,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And by the time they do have the electrical feeds nvidia will drop a new generation of chips and the demand cycle starts again?",
                "author": "spicypixel"
            },
            {
                "raw_content": "Well I'm so glad that their slop farms are absolutely thrashing chip and memory fab production just for them to not even be using them.",
                "author": "MiloIsTheBest"
            },
            {
                "raw_content": "Not the first time he has said it. Last year: \\>When asked if Microsoft was still supply constrained for Nvidia chips as it was throughout 2024, Nadella noted: \\>I am power \\[constrained\\], yes, I'm not chip supply constrained ... We were definitely constrained in '24. What we have told the street is that's why we are optimistic about the first half of '25 which is the rest of our fiscal year. And then after that I think we'll be in better shape going into 2026 and so we have good line of sight. [https://www.fool.com/investing/2025/01/01/satya-nadella-bad-news-nvidia-good-eqt-natural-gas/](https://www.fool.com/investing/2025/01/01/satya-nadella-bad-news-nvidia-good-eqt-natural-gas/)",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD confirms security vulnerability on Zen 5-based CPUs that generates potentially predictable keys",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RDSEED failures are incorrectly being flagged as correct, leading to potentially predictable encryption keys being generated by the random number generator. AGESA firmware fix coming soon.",
                "author": "BrightCandle"
            },
            {
                "raw_content": "Hello BrightCandle! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I use AMD for performance, not security.",
                "author": "mduell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why are so many new AA/AAA games dropping hardware ray tracing lately?",
        "score": 425,
        "text_content": "Is it just me, or have a lot of recent AA/AAA titles stopped supporting **hardware-based ray tracing** altogether? Take **Wuchang, Silent Hill f, Expedition33, Dying Light: The Beast, Split Fiction, BF6**,..... for example — no RT reflections, no RT shadows, nothing. Some studios are switching entirely to software/global illumination systems like **Lumen** or other hybrid lighting methods, and calling it a day. I get that hardware RT is expensive in terms of performance, but it’s been around since the RTX 20-series — we’re six years in now. You’d think by 2025 we’d see more games pushing full path-traced or at least hybrid hardware RT. Instead, we’re seeing the opposite: * Hardware RT being removed or “temporarily disabled” at launch. * “Next-gen lighting” now often just means software GI or screen-space tricks. So what’s going on here? Is hardware RT just too niche for mass-market AAA titles? Or are we hitting a point where software-based lighting like Lumen is “good enough” for most players? And seriously — are all those RT cores on our GPUs just going to waste now? Would love to hear what others think — especially from a tech/dev perspective. Are we watching **hardware ray tracing quietly die** before it even became standard?",
        "comments": [
            {
                "raw_content": "Unreal Engine 5 makes it easy to use SW-based ray tracing, which most of the games you listed use in lieu of HW-based solutions. Of course, every one of those games would probably look/run better if they added a HW option, but I digress. Here are a list of titles released in 2025 that contain HW RT features: * ARC Raiders * Assassin's Creed Shadows * Avowed * Cronos: The New Dawn * Doom: The Dark Ages (full path tracing available) * FBC: Firebreak * FC 26 * Grand Theft Auto V Enhanced (Actually one of the better recent RT implementations, BTW) * Little Nightmares Enhanced Edition (Not 100% sure) * Little Nightmares III (Not 100% sure) * Ninja Gaiden 2 Black (though it's implemented poorly) * Oblivion Remastered * Outer Worlds 2 (though it's implemented poorly) * Rise of the Ronin (Not 100% sure. Likely since it's a PS5 port which has HW) * Spider Man 2 (technically an older title from PS5, but supported HW RT) Dying Light: The Beast appears to be getting RT in an update in the next few weeks. We'll see what happens there.",
                "author": "SireEvalish"
            },
            {
                "raw_content": "I mainly miss reflections, I feel like I never see rtx reflections offered now its all screenspace garbage which I've grown very allergic to its quirks",
                "author": "InbetweenTheLayers"
            },
            {
                "raw_content": "It's a shame this is being downvoted so much. Even if the OP is (probably) reading into things a bit too much, they do raise a good topic of discussion - albeit one that's probably more about game development practices than hardware. BF6 strikes me as a particularly interesting case. BF5 was a marquee title for hardware RT (yes, NVIDIA, we get it: BF5 has reflections!). So having it absent from BF6 is a major shift. And to respond to the OP: > Are we watching hardware ray tracing quietly die before it even became standard? No. And expect to see an even larger allocation of die space to RT in the next generation of consoles, as 3nm provides enough transistor density to afford large RT engines that 7nm did not *Edit: Just for context, this thread was sitting at 52% when I wrote this post. So it was being downvoted almost as often as it was being upvoted*",
                "author": "Verite_Rendition"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Adeia sues AMD for patent infringement over semiconductor technology",
        "score": 53,
        "text_content": "The",
        "comments": [
            {
                "raw_content": "IP holding companies gonna IP hold. Adeia has sued Disney, Nvidia, Videotron, Shaw Communications and others.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "> Adeia said in the complaint that its predecessor Tessera pioneered hybrid bonding and advanced process nodes, which are both technologies related to semiconductor manufacturing. The lawsuit said AMD processors that include \"3D V-Cache\" technology, including its AI chips, were made using Adeia's patented methods. Shouldn’t they be suing TSMC for violating the process patent and not AMD? Like if Adeia patented the use of 3D v-cache for CPU performance it is one thing, but how TSMC manufactured the processors AND might not know due to it being a trade secret",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "The only two points I can find are about 3D-V cache and advanced process node. Not sure what to think about it though.",
                "author": "Remarkable_Fly_4276"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LPDDR6: Not Just For Mobile Anymore",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: balancing cost, performance, power, and capacity especially in datacenters & AI → LPDDR provides a good middle option vs GDDR and HBM. So good that JEDEC has made many datacenter-focused improvements in LPDDR6 (not detailed here). // Cadence is promoting their dual-mode PHY for LPDDR6 (14.4 Gbps) / LPDDR5X (10.7 Gbps), as well: [LPDDR6: A New Standard and Memory Choice for AI Data Center Applications](https://semiiphub.com/industryexpertblogs/lpddr6-a-new-standard-and-memory-choice-for-ai-data-center-applications)",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Noteworthy is that Grace CPU uses LPDDR5X for host memory. So this is not super unexpected, but appears to be the general direction for highly integrated servers, especially with the new features.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Very exciting! Everything is starved of memory bandwidth. I also feel its not clear how cost effective DDR6 at 14.4 Gbps is going to be in terms of board design, but not sure about that. Great video.",
                "author": "ryemigie"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix HBM roadmap teases HBM5, HBM5E, GDDR7-Next, DDR6, 400-layer 4D NAND in 2029-2031",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting to see DDR6 only in 202**9** \\- 2031 bucket, not the 2026 - 2028 bucket.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "SK Hynix should start producing custom ASICs like Broadcom.",
                "author": "LargeSinkholesInNYC"
            },
            {
                "raw_content": "How about we just make the memory we have affordable?",
                "author": "corruptboomerang"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's next-gen Exynos 2600: 59% more efficient than Apple A19 Pro thanks to 2nm GAA process",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm.. This is the same 'leaker' who apparently said that the 'testboard' has LPDDR6X 384-bit bus and RDNA4 iGPU... Also don't tag as 'news' these are 'rumours'",
                "author": "Noble00_"
            },
            {
                "raw_content": "C'mon They are saying it's getting a [HIGHER score than the Dimensity 9500](https://imgur.com/a/r48HL4f) (pretty much the same cores) while AT THE SAME TIME consumes less than half of it. That's severely unrealistic I think the leaker mixed up the numbers, and instead of 59% more efficient than Apple's, it's 59% more efficient than the last SF4 SoC, Exynos 2400. And that makes complete sense as SF3 first gen's E2500 (this one is 2nd gen) already shows a good improvement over it.",
                "author": "MissionInfluence123"
            },
            {
                "raw_content": "It's frankly embarrassing to make claims as absurd as this, pretending that samsung's 3nm++ is on par with tsmc A14, or that exynos will have >100% gains in a single year.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Outer Worlds 2 Performance Benchmark Review - 30+ GPUs Tested",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't have problems with stutter but on my system, 5800X3D and a 3090, I am significantly CPU bound, even with RT off. I'll be sitting at 55-60 fps with my GPU pulling only 260-280W. I don't really understand how this game is *that* CPU-heavy. Again, hardware RT is disabled.",
                "author": "r_z_n"
            },
            {
                "raw_content": "It runs like ass ( 7800x3d and 4080s needs dlss and framegen to stay over 60 fps at 1440 p on mostly very high with lighting and shadows on high) and the second planet is the only one that looks ok visually. I thought avowed was a decent looking game but this one is fucking HIDEOUS a lot of the time, especially the first and third planets and the story area right before the third planet. Many of the environments look like hastily slapped together low budget crap. Endless repeating assets, poorly fitted together meshes, ugllllly textures. Ue5 being especially shitty in this as shadows and lighting constantly break. Rarely looks good, often looks hideous. Never looks anywhere near what the performance would justify. This runs worse than path traced cyperpunk and that game loooks ten times better. Avowed was more technically and visually competent. This looks like it was made in a third of the time on a tenth of the budget. And yet they have the gall to ask 70 euros for this garbage. My last month of gamepass is the only reason i played this. Ill never touch another obsodian game. They re shitting out games faster than ubisoft and infinity ward did at their worst",
                "author": "Cheap-Plane2796"
            },
            {
                "raw_content": "I'm managing to play it pretty well on my 1070 at 1080p. It was actually playable at 4k with XeSS at the lowest setting and with frame gen enabled. Not great but playable. At 1080p and quality upscaling it runs pretty well which so far for me is the best UE5 result. My problems I have with the game is that the lighting can be very flat at times outside. It just depends on the weather in that regard like in real life but I would rather games just didn't try and be like real life and took the artistic route instead. Make the game always look visually interesting instead. The image quality is very blurry unless you play at native resolution with no TAA but you end up with a lot of fizzling. Sometimes shadows flicker on objects inside and outside. There is a dark area on the top of the screen that is sometimes there but reloading clears it up for a bit. Other than that I'm pretty happy with it, I wouldn't have said the graphics really justify the performance but that goes for most games these days. It's a much better RPG and a lot more fun that Starfield. Runs a lot better as well. Edit: Some other stuff I've noticed is that most NPC's don't move much, at least the named ones anyway. I know some guards and stuff patrol a little but it's not like Gamebyro engine stuff or Creation engine where you get NPC's moving around the map that you can follow around to their houses and stuff. Also you can't swim for some reason. I guess it was to save on dev time probably the same with NPC's moving around or it's just a UE5 limitation. NPC's have an \"inventory\" but it doesn't really feel like one to me but something else. Hard to put words on it but it doesn't' feel like other RPG games where it feels like actually going through their stuff. I have the pickpocket perk which is nice but most of the time it's just junk in peoples pockets, sometimes they have a keycard if it's a named NPC but it's a pain in the ass trying to find their house to steal their chest because they never go their own home. I like a lot of the RPG choices though, it actually feels like an RPG. A lot of options and choices in dialogue I have noticed require different skills or fo ryou to have read or done something beforehand which is cool. Even a lot of locked doors with alternate ways of getting past them which I like.",
                "author": "kuddlesworth9419"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] DRAM Quotes Reportedly Shift to Monthly as Samsung Largely Halts Contracts",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice to see the memory cartels are alive and well 30 years later.",
                "author": "pfak"
            },
            {
                "raw_content": ">TrendForce adds that currently, Samsung has largely halted contract offers, while other suppliers have adopted a wait-and-see stance, fueling a bidding atmosphere that continues to drive DRAM prices sharply higher. >TrendForce’s latest investigations show that server DRAM contract prices are strengthening in 4Q25, driven by ongoing data center expansion among global CSPs. This momentum is lifting overall DRAM pricing. Thus, TrendForce has revised its 4Q25 outlook for conventional DRAM pricing upward, from an earlier forecast of 8–13% growth to 18–23%, with a strong likelihood of further upward revision.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 has now sold 10.36 Million Units worldwide!",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[**Updated Sales figures for Switch 2 Games:**](https://www.nintendo.co.jp/ir/en/finance/software/index.html) * Mario Kart World - **9.57M** * Donkey Kong Bananza - **3.49M**",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Pretty much guaranteed that the Switch 2 outsells the lifetime sales of the Wii U (13.5 million) after the holiday season.",
                "author": "thendisnigh111349"
            },
            {
                "raw_content": "Holy shit",
                "author": "UTDroo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "WII U right now be like:",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's funnier is that this data was before Pokemon ZA sales/bundle. If the Switch 2 hasn't caught up already, it's very close.",
                "author": "Touma101"
            },
            {
                "raw_content": "Man, if Iwata could see just how much Nintendo bounced back from WiiU with the Switch and Switch 2.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "Oddly enough, the picture really conveys the speed diferential.",
                "author": "DrKrFfXx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World Has Now Sold 9.57 Million Units. Donkey Kong Bananza Has Sold 3.49 Million.",
        "score": 129,
        "text_content": "Data is up to the end of September",
        "comments": [
            {
                "raw_content": "Already outsold the Wii U version of Mario Kart 8.",
                "author": "Earth-Enjoyer"
            },
            {
                "raw_content": "that mkw attach rate is crazy lol, is that dk sales good?",
                "author": "skynovaaa"
            },
            {
                "raw_content": "34% attach rate for DK and 92% attach rate for Mario Kart, crazy numbers!",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you a dark or light mode person?",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dark mode; light mode kills my eyes. I hope in the future Nintendo provides additional themes either for free or purchase.",
                "author": "fit_dev_xD"
            },
            {
                "raw_content": "I judge everyone who uses light mode",
                "author": "FlowofOd"
            },
            {
                "raw_content": "I wished I liked light mode because I think it looks better but it sadly gives me eye strains",
                "author": "Forecastformcast"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm glad the bundle comes with the game physically here",
        "score": 912,
        "text_content": "Thailand. Our eshop will open on 18 Nov so they have been shipping it with a physical copy instead",
        "comments": [
            {
                "raw_content": "No rating stickers in Thailand? That’s a clean cover",
                "author": "j_dib"
            },
            {
                "raw_content": "I was talking to a guy at a Banana this past weekend and he said the Thai shop was somehow tied to the Japanese shop. Can’t wait to see what they do for it. Wonder if we will be able to port our old Switch 1 USA accounts to the new Thai account?",
                "author": "TrainerFarang"
            },
            {
                "raw_content": "I like physical games but tbh I prefer games like Mario Kart digital because it's a game I'd always want to have on my console without having to swap the cartridge",
                "author": "Financial-General163"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch breathing down the DS's neck right now",
        "score": 9,
        "text_content": "found dead 20 minutes later",
        "comments": [
            {
                "raw_content": "it did surpass it already considering that those numbers are only until end of september",
                "author": "iucatcher"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A weird observation about my Switch 2 play habits.",
        "score": 14,
        "text_content": "I noticed that I been playing Switch 2 in handheld mode almost exclusively since I got it. This is in stark contrast to how I played my switch 1, in which it was almost always docked. I think the extra horsepower to take games to 1080/60 is just enough for me. I don't really feel the need to go beyond that, and handheld provides that just fine. On switch 1, I can feel some games just run poorly in portable, so I would almost always play my switch docked, but now I pretty much only dock it if I feel like I need a wired ethernet connection. Y'all notice your play patterns change too?",
        "comments": [
            {
                "raw_content": "I’ve definitely done this a lot more with switch 2 as well. The screen size is good enough, and games tend to look better in handheld imo. It may just be that 1080 is hiding some of the imperfections. But, games generally feel crisper in handheld, even though I know that’s not technically the case.",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "I've always been handheld exclusive",
                "author": "Ok_Requirement_3693"
            },
            {
                "raw_content": "While i agree with you on using the switch 2 handheld. I disagree on playing the switch 1 docked. I always felt it looked worse on the tv due to the resolution bump not warranting the size of screen bump imo 😅 i pretty much traded in my switch 1 for the Lite as soon as i could due to the smaller screen increasing perceived sharpness lol",
                "author": "Gallade213"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nicktoons & the Dice of Destiny coming to Switch 2 on December 5",
        "score": 62,
        "text_content": "To one's surprise, it's a GKC. Announcement trailer: https://youtu.be/4wFAreIjfgg?si=USUgUFBaaYF0no3n",
        "comments": [
            {
                "raw_content": "Why does the left Joycon in the logo not have a joystick?",
                "author": "Odd-Holiday7453"
            },
            {
                "raw_content": "I am officially done trying to understand their prioritization of who has dev kits at exactly this moment.",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "This looks interesting but also like something that will be half price on Woot in like 6 months.",
                "author": "pbrslayer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 11/03/25",
        "score": 50,
        "text_content": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSR6Fns9zL2WCx-pXyGcR7aX0ehSJd78zXSKw&s What's up, my dudes. I recently learned that GTA6 has been in development for 11 years and is rumored to cost $2 billion. For context, annual CoD releases are around $700 million. This is just insane to me. Are games becoming impossible to make anymore?? --- # GLAR Discussion This thread is your weekly **central hub** for: - Gaming news - Requests - Random rumors, spicy drama, or just vibes *Keep all non-post-worthy content here so we can keep the front page clean and focused on actual leaks. We love ya, but help us help you.* --- ### P.S. There’s some drama poppin’ off over at r/OkBuddyGLAR ### Want to help improve this sub? Drop us some feedback [right here!](https://forms.gle/w9JaYTjVN1Zie9e39) ### Join the **Discord** and vibe with the community even more; we’ve got memes, theories, and occasional existential dread. [*Click here to join!*](https://discord.gg/6jdBvCSqbj) --- ## Hot threads of the past week!: - [Jason Schreier: ‘Grand Theft Auto’ Studio Accused of Union Busting After Firings](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ol535e/jason_schreier_grand_theft_auto_studio_accused_of/) - [Hideo Kojima reportedly had strong interest in making a Matrix game adaptation after the Wachowskis asked him to, but Konami said no.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ohlv03/hideo_kojima_reportedly_had_strong_interest_in/) - [HaloLeaks: “Halo 2 & Halo 3 are being remade, yes they will have sprint. No multiplayer, only campaign. Full remakes. Multiplayer is going to be Halo 7.”](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ok6ncn/haloleaks_halo_2_halo_3_are_being_remade_yes_they/)",
        "comments": [
            {
                "raw_content": "The Game Awards are next month. Where did the time go?",
                "author": "TheOneBearded"
            },
            {
                "raw_content": "Aren’t TGA nominees supposed to be out by now?",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "RDR 2 PS5 when",
                "author": "Pepsimaxgodtier"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kill Bill coming to Fortnite in Chapter 7 + possible Hollywood Sign and AREA 51 POI.",
        "score": 220,
        "text_content": "[*Source*](https://xcancel.com/ShiinaBR/status/1985380708236337447) *for the Kill Bill leak,* [*source* ](https://xcancel.com/HYPEX/status/1985358100870963419)*for the Hollywood Sign leak, and* [*source* ](https://xcancel.com/Loolo_WRLD/status/1984705463112384643)*for the AREA 51 POI.* People are now thinking that Chapter 7 at some point *might* focus exclusively on film. So, hopefully, we'll see Back to the Future and other classic films characters in Fortnite.",
        "comments": [
            {
                "raw_content": "Crossing my fingers this is where we also get the long-rumored 007 stuff",
                "author": "ESF007"
            },
            {
                "raw_content": "Quentin Tarantino gonna find out how much money you can make from video games, and finds a job writing a story for a GTA competitor.",
                "author": "WizardMoose"
            },
            {
                "raw_content": "There’s supposed to be a wide scale re release of the whole bloody affair next month so I believe it",
                "author": "mustardfan2002"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Abxylute’s massive Lunar Lake handheld with glasses-free 3D launches mid-November for $1,499",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this seems like a crazy product glad they went Kickstarter route, lets see what the market will bear",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "I’d rather just have the display tech separately",
                "author": "ryanvsrobots"
            },
            {
                "raw_content": "Too expensive",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "MSI launches Pico-ITX Alder Lake/Twin Lake/Amston Lake board for harsh environment",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not gonna lie, I want one!",
                "author": "Gears6"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Adeia Sues AMD Over Semiconductor Patents, Including Advanced 3D Stacking Used In Ryzen X3D CPUs",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A patent troll that has never produced a chip with hybrid bonding",
                "author": "kuug"
            },
            {
                "raw_content": "So a patent troll who is not making any products sueing. Still I was under impression AMD invented that stuff.",
                "author": "Vegetable-Message-13"
            },
            {
                "raw_content": "Isn't AMD using TSMCs hybrid bonding solution? I get that this is patent trolling but im surprised they didn't go after TSMC, given they are a much bigger company",
                "author": "jrr123456"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Says We're \"Confused\"",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can some AMD staff please clarify what RDNA1 and 2 users AREN'T getting anymore in comparison to before?? That would be more concise than the vague statements published before.",
                "author": "kiffmet"
            },
            {
                "raw_content": "AMD doing the weaponized incompetence again. Uff.",
                "author": "ProjectPhysX"
            },
            {
                "raw_content": "Imagine cutting driver support for hardware that is still being sold, today, right now. What kind of business does that?",
                "author": "MrKaltenbrunner"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "One ASRock B850 motherboard reportedly kills three Ryzen 7 9700X CPUs",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean after number two, I would stop using that board..",
                "author": "BakerTT"
            },
            {
                "raw_content": "At the same time? ![gif](giphy|BTbo1iT1yEfOE)",
                "author": "Nick-Sanchez"
            },
            {
                "raw_content": "First time that i'm glad that i got Gigabyte am5 board. Because ASRock was my second choice",
                "author": "Brave-Construction"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "It's not our imagination, announced layoffs through September are running higher than any full year since the recessions in 2008, 2009, and 2020",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many of those layoffs were family supporting jobs.",
                "author": "mrktcrash"
            },
            {
                "raw_content": "Fueled by nearly 300,000 federal government jobs being axed. The next president has a time on their hands to hire a good chunk of those positions back while augmenting them with AI.",
                "author": "LBishop28"
            },
            {
                "raw_content": "Keep in mind there’s 25 million more jobs now than in 2008",
                "author": "Kobe_stan_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Won’t Sell. Can’t go lower on price",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Narrator: they went lower",
                "author": "granoladeer"
            },
            {
                "raw_content": "Can't or won't go lower on price? Not the same thing.",
                "author": "AverageIndependent20"
            },
            {
                "raw_content": "Since almost everyone treats their home like an investment, sometimes you lose money on an 'investment'. Sucks to suck.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Office CMBS Delinquency Rate Hits Record 11.8%, Much Worse than Financial Crisis. Multifamily Delinquencies Soar to 7.1%",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "John Titus said it years ago, look at the banks with the highest exposure to CRE to see which of them could fail next and the data is readily available. On top of that, the scarier question is *why* is the delinquency rate increasing on commercial property. Is it the lack of economic demand that makes companies second guess the need for space when leases have only gone up on account of the underlying mortgage rate increase. Multi-family I can see where leases weren’t renewed so the properties could be “refurbished” and more rent charged or the explosion of short and medium termed rentals.",
                "author": "oldsmoBuick67"
            },
            {
                "raw_content": ">The property was purchased in 2020 by Invesco and Australian Retirement Trust from Principal Financial Group for about $585 million, according to Downtown Bellevue Network. In early 2020, it was appraised at $605 million. Two months ago, Morningstar valued the property at $268 million, a 56% haircut from the appraisal in 2020, and 12% below loan value. Things like this are what will really hurt people. A lot of pension plans and retirement funds that allowed their money to flow to investors and private equity are going to get a huge haircut on their investments. CalPERS and all the other teacher/public employee pensions invested heavily in \"alternative\" investments that will eventually blow up. I'm sure it will be another \"too big to fail\" moment as governments scramble to throw money at investors. The narrative, as always, will be that it has to be done to save retirement funds of ordinary people.",
                "author": "hereditydrift"
            },
            {
                "raw_content": "Lot‘s of people work from home is causing this issue. And why would businesses pay for commercial overhead when a zoom call is much cheaper? My family and friends are in tech. All this talk of people having to go back into the office is a bunch of BS. Work from home is growing, as businesses are finding qualified employees cross country. I would say that 50% of the techies I know, including myself, work from home. Working from home is saving millions for businesses. No commercial real estate required.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Now in A Housing Market Recession, Will Prices Finally Plunge?",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The pandemic-driven Zoomtown era has ended",
        "score": 67,
        "text_content": "https://www.",
        "comments": [
            {
                "raw_content": "Not really relevant to the article, but it feels like a dystopia. Not all that long ago, it felt like everyone was rollin' in the dough. So much extra money. It felt like EVERYONE was getting new cars, going on vacations, upgrading homes. Now, we have a population of people about to go hungry for the holidays. It is just wild to me. I mean really wild that we went from one extreme to another in only a short time. Imagine how much worse it is going to get.",
                "author": "macaroonzoom"
            },
            {
                "raw_content": "The Zoomtown era may be over, but retirees don't have to worry about RTO. That group continues the Great Retirement of America. They keep getting new highs in their retirement accounts and homes in the midwest to cash out of. They head to the coasts, already steeply elevated in valuation as well, and buy in. It's just a revolving door for the wealthy and well-capitalized.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "Imagine making life-long decisions based on TV hysteria.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Savvy buyers are taking advantage of lower adjustable-rate mortgage (ARM) rates after the Fed cut last week.",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "If by savvy you mean gullible.",
                "author": "aquarain"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Remote Labor Index (RLI) – New super-hard benchmark from makers of HLE and MMLU just dropped. It measures the replaceability of remote workers. Top result is only 2.5%.",
        "score": 71,
        "text_content": "[https://www.remotelabor.ai/](https://www.remotelabor.ai/) Paper: [https://www.remotelabor.ai/paper.pdf](https://www.remotelabor.ai/paper.pdf)",
        "comments": [
            {
                "raw_content": "This is a really cool benchmark, instead of super hard math and physics questions we’re actually getting something that relates to actual work. If this benchmark becomes saturated, the job market is in serious trouble.",
                "author": "Curiosity_456"
            },
            {
                "raw_content": "That's some amazing benchmark.",
                "author": "RDSF-SD"
            },
            {
                "raw_content": "\"Elo score reveals steady improvement. While absolute performance remains low, it is crucial to detect more granular signs of progress. \\[...\\] We find that progress is measurable on RLI. The Elo rankings indicate that **models are steadily improving relative to each other**, and the rankings generally reflect that **newer frontier models achieve higher performance than older ones**. This demonstrates that RLI is sensitive enough to detect ongoing progress in AI capabilities.\"",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Amazon just partnered with OpenAI in a $38 billion agreement giving them access to hundreds of thousands NVIDIA GPUs",
        "score": 739,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tomorrow: \"Amazon invests 38B in OpenAI equity\"",
                "author": "arko_lekda"
            },
            {
                "raw_content": "https://preview.redd.it/4kloqix5l2zf1.jpeg?width=1227&format=pjpg&auto=webp&s=a992b17de485ea5a2b29b7e975ecd760cad5c81a",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "Everyone is partnering with everyone else",
                "author": "ElectronicSetTheory"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "South Korea UNIST new artificial muscle could enable humanoid robots to lift up to 4,000 times their own weight, using a 'shape-memory' material strip that go from soft to stiff according temperature. UNIST further added a coating enabling it to curl/bend under under magnetic fields",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice. But there is actually a major flaw with synthetic muscle; it is exceedingly fragile. In real muscle it actually damages itself every time you do anything with it. It's just that there is automated self repair with organic life. In sci-fi, when synthetic muscle is used, it seemed the trend is to treat the muscles as consumables. As in after the muscles lose 20% of its strength you just swap them out with new ones. Alternatively you use much thicker muscle fibres that last longer, but you lose strength for the same volume. So there is a tradoff between power and durability.",
                "author": "VallenValiant"
            },
            {
                "raw_content": "The fact this needs thermal control to change stiffness makes this look unviable for anything like robotics or exoskeletons that need to have fast response.",
                "author": "Curious-Adagio8595"
            },
            {
                "raw_content": "So even if you go to the gym, you can get your asses handed to you in 2 second by these robots.",
                "author": "mightythunderman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Is Plateauing",
        "score": 1107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "its never been more important to distrust the basic shape/proportion of what's shown in a graph. it's never been easier or more profitable to create data visualizations that support your version of the immediate future",
                "author": "DankCatDingo"
            },
            {
                "raw_content": "https://preview.redd.it/ri66ifb0k1zf1.png?width=1428&format=png&auto=webp&s=7ae47016095e9bce09ceac24b02fafa62322ae65",
                "author": "Healthy-Nebula-3603"
            },
            {
                "raw_content": "Is it relevant that humans have remained plateaud for the last 50,000 years?",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Coming soon to a workplace near you...",
        "score": 374,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We dont have enough dickheads. We Need Robot dickheads",
                "author": "addioh"
            },
            {
                "raw_content": "\"ha ha ha hehehehe\" but it's pretty real and they really are getting fired soon enough lol",
                "author": "SoupOrMan3"
            },
            {
                "raw_content": "Can it have anime catgirl face while we are on a date?",
                "author": "wspOnca"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The beginning of the end of the transformer era? Neuro-symbolic AI startup AUI announces new funding at $750M valuation",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I call bullshit until we see a product",
                "author": "Deakljfokkk"
            },
            {
                "raw_content": "Betteridge’s Law of Headlines.",
                "author": "milo-75"
            },
            {
                "raw_content": "I saw an interview with Demis on this topic. Google will be working on neurosymbolic systems over the next 5 years to see the potential but Demis thinks you ultimately still want neural nets alone and not hybrid systems because you ultimately want them to learn on their own and not be locked into certain rules or paradigms. But we’ll see I guess.",
                "author": "Nasil1496"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Rover X1 is a companion dog at $1K that can carry your groceries, run with you, do home security",
        "score": 431,
        "text_content": "https://x.com/XRoboHub/status/1985244731832779199",
        "comments": [
            {
                "raw_content": "Only 1K? Its cheaper than a dji drone....",
                "author": "Striking_Resort_7891"
            },
            {
                "raw_content": "When they were swapping out the attachments on top I was waiting to see the mini gun. 🫠",
                "author": "Extreme-Edge-9843"
            },
            {
                "raw_content": "I have a 0.6k doodle that carries things around the house for me, runs with me, and does home security. Just the other day she went downstairs brought me a pack of Pringles and a Coke, however today it was just a pair of my wife’s socks 🧦 so.. the quality of service does vary.",
                "author": "Zero40Four"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"A modular mRNA platform for programmable induction of tumour-specific immunogenic cell death\"",
        "score": 18,
        "text_content": "[https://www.nature.com/articles/s41565-025-02045-5](https://www.nature.com/articles/s41565-025-02045-5) \"Messenger RNA (mRNA) therapeutics hold great promise for oncology but their efficacy is limited by systemic off-target effects and immunosuppressive tumour microenvironments. Here we present TITUR, a tumour-customizable mRNA nanomedicine platform that integrates tumour-customizable ionizable lipids (TIs) and tumour-specific untranslated regions (TURs) to enhance tumour-selective mRNA delivery and expression. This dual-engineered approach enables the precise intratumoural expression of 4HB, an immunogenic cell death-inducing protein, while mitigating systemic toxicities. Using murine models of immunologically cold tumours, including melanoma and triple-negative breast cancer, TITUR-mediated 4HB delivery induced tumour-specific immunogenic cell death, remodelled the tumour microenvironment and enhanced immune cell infiltration. When combined with immune checkpoint inhibitors, 4HB TITUR suppressed primary and metastatic tumour growth, while also exhibiting vaccine-like properties by reducing tumour recurrence and eliciting systemic antitumour immunity. Furthermore, it demonstrated a superior safety profile compared with conventional mRNA delivery methods. Our data indicate that TITUR may serve as a versatile approach to address the limitations of current immunotherapies and support the development of personalized mRNA nanomedicines.\"",
        "comments": [],
        "subreddit": "singularity"
    }
]