[
    {
        "post_name": "Another War ENDED under President Trump. Power to the Players! 🔥",
        "score": 503,
        "text_content": "",
        "comments": [
            {
                "raw_content": "EBT cards getting shut down and the White House memeing Master Chief, I voted so hard for this",
                "author": "Faded"
            },
            {
                "raw_content": "Lmao, you know Reddit’s libs going absolutely feral over this.",
                "author": "Twitter"
            },
            {
                "raw_content": "Laughs in PC master race.",
                "author": "HankScorpio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Matt Walsh: Abolish EBT.",
        "score": 469,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is going to be the mother of all Chimp outs if those checks don't go out next month. I don't believe people are going to just stand around and let them steal shit in my area. I'm certainly not going to watch fuckers loot my local grocery store.",
                "author": "alfredbester"
            },
            {
                "raw_content": "None of these people are victims they’re lazy faggots extorting the working class so they can buy Doritos, Cheetos and Fritos. All socialist programs *should* be terminated, but they never will be because our country already got invaded by useless third world retards who can vote for some reason.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Mixed meat Spam like product, similar vegetable canned loaf, cheese, flour, corn meal, oats, rice, powdered milk, powdered eggs and a small ration of spices. We won't let you starve to death but you also won't be living better than working citizens.",
                "author": "BidensPrisonWallet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bob Ross has created a lovely painting",
        "score": 387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all should be learning to paint at night after work. Or write. Or draw. Normal rational people need to take back art and the art world by overwhelming the system.",
                "author": "Friendly_B"
            },
            {
                "raw_content": "Happy little boom",
                "author": "DontTreadOnLego"
            },
            {
                "raw_content": "was that a narco boat?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The State Department has officially canceled the Global Engagement Center (GEC) as part of President Donald Trump’s mission to shut down the “censorship industrial complex\"",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't propaganda against American citizens used to be illegal until Obama changed it? I think propaganda needs to be outlawed again...",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Marco Rubio is doing a good job.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "Archive https://archive.is/NVkF7 Sauce https://www.breitbart.com/politics/2025/10/26/report-state-department-officially-dismantled-disinformation-agency/",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Recently pardoned George Santos: Say NO to Mamdani for the love of God!",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the foreigners and native born retards will vote for him, NYC is toast.",
                "author": "Southboundanddown"
            },
            {
                "raw_content": "Just a minor correction: Santos wasn't pardoned. His sentence was commuted.",
                "author": "WassermanSchultz"
            },
            {
                "raw_content": "We've forgotten.",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Javier Milei has won the 2025 Argentinian Legislatives Argentina voted for freedom!",
        "score": 1503,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take that commies.",
                "author": "1st_Covfefe"
            },
            {
                "raw_content": "I encourage any of you to travel there. You’ll never look back. The women are 10 times better and hotter than anything you find here, the weather is better, everything is cheaper. Go there and you’ll see why the Germans fled there. It’s like the world’s best kept secret. If I get divorced I’m totally living there for the rest of my life. It’s like europe before the moslems invaded.",
                "author": "cardinaldrones"
            },
            {
                "raw_content": "*AFUERA!*",
                "author": "NoticesBugleOWO"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Zohran Mamdani’s auntie who he cried because she was “too scared to wear hijab after 9/11 in NYC?” She never wore a hijab and was nowhere near NYC when 9/11 happened!",
        "score": 1072,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# TIME TO DEPORT THIS JOKER",
                "author": "BeauHD"
            },
            {
                "raw_content": "Taqqiya. Deport Islam now",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "islam needs to be eradicated from our country.",
                "author": "gaijin_ronin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oregon State Troopers and Portland Police just blocked off the road around Antifa’s ICE camp as crews cleared the ENTIRE camp, hauling off Antifa’s stuff in box trucks",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stuff? # They hauled off ANTIFA's FAG SHIT. They are only doing this because Trump's going to arrest their LEO if the interfere.",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "They will drive the box truck to another part of the city and antifa will meet them and unload it.",
                "author": "Patriot283"
            },
            {
                "raw_content": "The poor workers need hazmat suits. There’s no telling what is crawling around on that junk.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three years ago today, Elon Musk bought Twitter and the media said it would die under Elon. Today, it’s the #1 source of news in the world and it’s the media who is dying.",
        "score": 1411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And the left is constantly deadnaming X. I thought they didn't like deadnaming?",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Look at all that fake news just waiting to be ignored. No Reddit or Bluecry in the top ten, though.",
                "author": "MythArcana"
            },
            {
                "raw_content": "When he bought it and disabled all the algorithms banning conservative speech, it was akin to a digital Berlin Wall coming down.",
                "author": "elmerecido"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OH 😱 NO!!! Western Union says fewer U.S. dollars being sent home by Migrants. Or using the proper term, Illegal trespassers.",
        "score": 1209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be a real shame if there was a citizenship and *legal* resident check on money sending outside of the country.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "Western Union is how many of the African Kings scams work.",
                "author": "Oldman6541E5"
            },
            {
                "raw_content": "100% remittance tax!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former California Gov. Arnold Schwarzenegger SLAMS Gavin Newsom’s Democrat Gerrymandering Scheme — ‘There’s No Such Thing as Temporary, That’s Fantasy’",
        "score": 851,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Screw your freedoms!\". -Arnold Schwarzenegger",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "Fuck him. I don't give a shit what he thinks. Even if he's right.",
                "author": "JackOfAllTirades"
            },
            {
                "raw_content": "He's turned into the sad grin meme guy!",
                "author": "NZbacon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why Are So Many Arrested Minorities Booked As 'White'?",
        "score": 1133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cooking the books",
                "author": "GoldenSpirals"
            },
            {
                "raw_content": "Because the enemy we're up against doesn't want to admit that most criminals are usually other races that aren't white, as that would disprove their \"white bad, other races victims\" narrative.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Wypipo don't even season they mugshots",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Muslims have no tolerance for anyone outside of their faith!",
        "score": 1634,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muslims want equal treatment until there are enough of them that they don't need to pretend anymore. Dearborn is a total shithole now that discriminates against non muslims and blasts call to prayer all day long",
                "author": "PapaPepe"
            },
            {
                "raw_content": "That's just how Islam works. Muslims rape our kids and then say it's racist that we notice. It's just their culture. https://patriots.win/p/19BtLHfSxG/an-islamic-center-in-minnesota-r/c A lot of them are entitled animals. They literally expect us to cater to their every whim. All they want to do is breed and consume. https://patriots.win/p/17sPFoWqet/feel-the-entitlement-oozing-out-/c Oh, don't forget the crime they bring with them from one of the most corrupt countries in the world. 30% of all Somalians commit blatant welfare fraud https://patriots.win/p/1AR0nd7AA4/30-of-all-somali-mothers-in-minn/c Because of them, my state is broke. https://patriots.win/p/1AR0UrJFEW/minnesota-is-drowning-in-fraud-i/c",
                "author": "MissingTrump"
            },
            {
                "raw_content": "Cry-bullies. Every last one of them.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Schumer Shutdown",
        "score": 1095,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stock up on groceries before the EBT chimp outs commence.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "If EBT cutoffs mean Americans will suffer then that means democrats are perfectly ok with Americans suffering so long as non-Americans get healthcare they have ZERO right to. Am I understanding this correctly?",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "They said they wanted to cause people pain. When are they not doing that?",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Secret Service Seized 22 EBT Skimmers in Baltimore, Stopped $22M in Fraud",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's so much fraud in almost all of our social programs, it's better to just shut it down, keep the government closed, and \"starve the beast\". * Ex: The loudest people screaming about SNAP benefits being cut off on November 1st, are most likely the fraudsters themselves.",
                "author": "McFatty7"
            },
            {
                "raw_content": "While we're blowing up speed boats, I don't think too many people are aware of how food stamps are a big source of revenue for those drug dealers. Just one example that you can easily spot yourself. They buy a bunch of name brand water bottles, several quarts of a name brand milk, bulk packages of snack foods, 24 packs of soda pop, etc. with food stamps. Then they sell those items to a shady corner store somewhere who pays them in cash for the items cheaper than a distributor sells them for. They then take that money and buy drugs. Happens all the time. They can also let the drug dealer buy borrow their card who will give them drugs worth 50 cents on the dollar for the remainder of the cash on that card. There's a reason why you see black people on TikTok talking about locking up your cars if the food stamps get cut off. Those people getting high off their food stamp allotment aren't going to go cold turkey.",
                "author": "anotherthing"
            },
            {
                "raw_content": "Good for the soundness of our currency. Good work.",
                "author": "LaptopDied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Father ‘died of grief’ after daughter, 12, was raped and beheaded by migrant in France, her mom reveals",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why die of grief when you could just delete the perps.",
                "author": "MAGA1773"
            },
            {
                "raw_content": "Every Muslim must die",
                "author": "SouthernFriedFreedom"
            },
            {
                "raw_content": "I would die from exhaustion from revenge.",
                "author": "2Fangz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : If you lie or smear our brave men and women of @ICEgov law enforcement, you WILL be debunked. Watch here for the FACTS behind this week’s fake news hoaxes:",
        "score": 1057,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Debunked is great, but I'd rather see a direct warning from FCC that licenses are about to get yanked.",
                "author": "BrianOfNazareth"
            },
            {
                "raw_content": "is “young man” the new euphemism?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I wish it was more Miss Rachel style. Always talk to libs like children.",
                "author": "fullpotato1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A scientist who discovered a new species of butterfly has named it after Iryna Zarutska to ensure \"she is never forgotten.\" The scientist said, \"Her name will be forever immortalized as a butterfly...\" The butterfly is called \"Iryna's Azure.\"",
        "score": 583,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a kind gesture.",
                "author": "2flathat"
            },
            {
                "raw_content": ">The scientist who named Iryna's Azure butterfly (scientific name: Celastrina iryna) is Harry Pavulaan, president and director of the International Lepidoptera Survey. He discovered the species in South Carolina in the 1980s, conducted years of research confirming it as a unique hybrid introgression among Azure butterflies, and expedited publication of his findings in September 2025 to honor Iryna Zarutska, a Ukrainian refugee who was fatally stabbed in Charlotte, North Carolina, earlier that year. nice.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "I hope this is real. She deserves to be remembered.",
                "author": "GhostOfMyFormerSelf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Signs the Cambodia-Thailand Peace Treaty",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump just flies around the world and says: > hey, you stupid faggots, stop fighting or else we’re gonna cut you off from America’s economy Works every time.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Whew! We dodged that bullet!",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Democrats outraged!",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What’s worse, the NBA Players cheating at cards, and probably much else, or the Democrats cheating on Elections. The 2020 Presidential Election, being Rigged and Stolen, is a far bigger SCANDAL. Look what happened to our Country when a Crooked Moron became our “President!” We now know everything.",
        "score": 1532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow... Trumps says HE HOPES the DOJ pursues this? TRUMP should not have to ask for accountability...",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "If we don't allow athletes to bet on games they might have influence over, then why do we allow congress to invest in companies they regulate?",
                "author": "Crucible"
            },
            {
                "raw_content": "I hate sports and elections for the very same reasons; they are fake and gay.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cooler Master V4 Alpha 3DHP Black & Hyper 212 3DHP BLACK (ARGB) Review - Less is More? - Hardware Busters",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An ID Cooling A620SE also at $30 would probably offer higher performance at the same price.",
                "author": "SunnyCloudyRainy"
            },
            {
                "raw_content": "[I was convinced 16 years ago about the value proposition of the Hyper 212 series.](https://www.guru3d.com/review/cooler-master-hyper-212-plus-review/) Absolutely GOAT'ed air cooling performance within budget. From the article: *3DHP adds extra heat pipe junction T-joints from the center of the CPU contact, pulling heat from areas a standard U-pipe misses and to speed liquid return, Less turbulence in the fin stack. More quiet cooling.* Excellent innovation selling at 30$ USD, quite a challenge to beat this price-performance ratio. [Toms Hardware says](https://www.tomshardware.com/pc-components/air-cooling/cooler-master-hyper-212-3dhp-review), this cooler performs much better, when paired with a powerful fan.",
                "author": "K33P4D"
            },
            {
                "raw_content": "I think the benefit of this vs. the Thermalrights and ID Coolings of the world is probably stock and in-person availability versus the other brands. While the latter are better price/performance, they're not always available.",
                "author": "Chrystoler"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Applied Materials: \"MAX OLED Solution for Next-Generation OLED Displays\"",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First heard about this [here](https://old.reddit.com/r/hardware/comments/1gzhhcg/applied_materials_max_oled_screens_touted_to/). Really cool to see detailed info on this.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "Thanks for sharing, an interesting read",
                "author": "xeroze1"
            },
            {
                "raw_content": "Last supplier update was a year ago, when [Samsung Display was testing an \"alpha system\" using MAX](https://ir.appliedmaterials.com/news-releases/news-release-details/applied-materials-breakthrough-bring-oled-displays-tablets-pcs), but no word if they actually adopted it. Maybe it's coming soon-ish? [In the Q3 2025 update](https://ir.appliedmaterials.com/static-files/69c55ad9-d83b-4dda-a131-1f6eabc06c06), they said MAX revenue isn't included ***yet*** in their financial reports.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CXMT, Huawei align on HBM3 ahead of China's 2026 AI memory leap",
        "score": 79,
        "text_content": "High-bandwidth memory (HBM) has become the latest competitive front for global DRAM manufacturers. As Samsung, SK Hynix, and Micron gear up for HBM4 mass production in 2026, China's CXMT has reportedly delivered 16nm HBM3 samples to Huawei and its partners, a prelude to large-scale manufacturing slated for the same year. Analysts say that while CXMT remains three to four years behind top global players, its progress represents a significant stride toward bolstering China's semiconductor autonomy and disrupting the long-held dominance of international DRAM leaders.",
        "comments": [
            {
                "raw_content": "HBM laptop memory when??",
                "author": "zakats"
            },
            {
                "raw_content": "Ahhh just another day of us foreign policy back firing. The problem is those politicians in Washington are all humanities majors and lawyers. They have no clue what goes down in the engineering world. The entire semiconductor industry is ran by foreign talent. Of course the Chinese will figure out how to catch up. Every prediction I made in 2017 is coming true. Sad to see honestly.",
                "author": "frogchris"
            },
            {
                "raw_content": "I miss my R9 Fury Nano",
                "author": "broknbottle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RedMagic 11 Pro Hands-On: Can 8 Elite Gen 5 Run PC Games? - Geekerwan",
        "score": 6,
        "text_content": "Geekerwan runs Black Myth Wukong and God of War on a phone. Incredible how far we got on sub 10W TDP gaming while doing Windows and x86 emulation at the same time",
        "comments": [
            {
                "raw_content": "It's my idea or these games are running 1600×720 with FSR at 50%, meaning 800×360 effectively, give or take. I have to say, for a phone is still quite impressive, but noway near a good experience especially when the iGPU is not meant for gaming, and even then they're at TDP limit. I can see this phone being great running _older_ titles and not demanding ones.",
                "author": "DarkGhostHunter"
            },
            {
                "raw_content": "That's kinda cool, it would be really dumb to buy a gaming phone for all the jank on the play store. I guess that means exynos 2500 and dimensity 9500 would also be capable if not for the gpu drivers.",
                "author": "InformalAd202"
            },
            {
                "raw_content": "Anybody help me understand how he is able to run black myth wukomg on emulators which isn't cracked yet and have denovo.",
                "author": "comelickmyarmpits"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A comparison between Assassin's Creed Shadows on PS5 and early gameplay footage of the Switch 2.",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For a device that we can play games on our palms, these graphics are really nice and the important thing is the FPS, I hope they fix it well.",
                "author": "Esgok"
            },
            {
                "raw_content": "For a handheld device that draws 7-12 watts this is pretty amazing. We’ll have to see how the performance is but judging by these screens it’s looking pretty good.",
                "author": "SirKadath"
            },
            {
                "raw_content": "It looks pretty good but it's the framerate that's more important imo.",
                "author": "Shmullus_Jones"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is this technically possible?",
        "score": 160,
        "text_content": "I know this remake isn’t coming to switch 2, but because it is going to all other subsequent platforms I wanted to ask if such a port would be possible using the switch 2’s hardware. It’s made in unreal engine 5 and is a pretty demanding game visually (by the looks of it) minimum pc specs haven’t yet been listed so it’s somewhat hard to say, I just wanted to know if there was any insight about it. Again, about it running on switch 2, not an actual port.",
        "comments": [
            {
                "raw_content": "I would rather see mcc tbh, but who knows",
                "author": "LateResident5999"
            },
            {
                "raw_content": "I give it 2 years",
                "author": "Sufficient-Degree-47"
            },
            {
                "raw_content": "With the proper optimizations and cutbacks, it is totally feasible in my opinion.",
                "author": "SidOfBee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "i can't stop dreaming about it. i can almost feel the NSO Dreamcast🌀 controller in my hands!",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“I’m gonna take you for a ride!”",
                "author": "jbayne2"
            },
            {
                "raw_content": "Honestly I could see it happening one day.",
                "author": "Justapersonmaybe"
            },
            {
                "raw_content": "I don't really see any other Sega consoles coming to NSO. apparently getting the licensing rights from Sega was stupidly expensive.",
                "author": "Zyvyn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why does Phil Spencer keep talking about how excited he is to put Xbox games on Switch, while actually putting very few Xbox games on Switch in comparison to other big publishers?",
        "score": 189,
        "text_content": "The Switch 2 is getting extremely good AAA third party support. Big publishers like Capcom, Sega, SquareEnix, FromSoft, Ubisoft etc are bringing multiple big titles and series to the system - and most of them are just doing it, they don't keep on making statements about how they're excited to support the system, they just announce and release games. Meanwhile, big Phil makes a statement every other week about how excited he is to put Xbox games on the Switch 2, and so far the only even moderately recent release on the cards is Indiana Jones, currently with a non-specific 2026 release date. Like, if you're going to go on about it this much, I would expect Xbox support to be above and beyond what we normally see from other publishers. And if your support is going to be below average, then shut up. It's like the guy's just addicted to lying.",
        "comments": [
            {
                "raw_content": "My guess its a mix of the dev kit situation and Xbox just being a mess internally right now.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "They take time + it's Phil talking, take everything he says with a grain of salt",
                "author": "Ok-Confusion-202"
            },
            {
                "raw_content": "I mean we’re getting Indiana Jones. The games are coming.",
                "author": "MarcsterS"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Friendly Reminder that Age of Imprisonment comes out in 10 days!",
        "score": 352,
        "text_content": "Extremely excited for this one, enjoyed Aoc and excited for a smooth 60fps.",
        "comments": [
            {
                "raw_content": "Wait... just 10 more days? *opens calendar* Where did the time go, boss?",
                "author": "Few_Replacement_5864"
            },
            {
                "raw_content": "Wait what? I thought it was a 2026 game. Awesome thanks",
                "author": "predator-handshake"
            },
            {
                "raw_content": "ALAS WITH WHAT TIME STILL PLAYING HADES II.",
                "author": "IntotheWilder25"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Handheld Mode clocks should be adjusted",
        "score": 7,
        "text_content": "Cyberpunk and SW Outlaws do look and run great on the console, but that image quality… it really takes a hit DLSS is working overtime with the significantly lower clocks in handheld mode it makes me wonder if they could adjust them to allow for game to look sharper.. there’s clearly thermal headroom, the console barely heats up some details like birds or hanging cables really get deep fried in dlss artifacts and such maybe they’re concerned about battery life? which is already great for a next gen handheld",
        "comments": [
            {
                "raw_content": "Battery life is the reason. If they drop under 2 hours of average playtime people would complain even more than they already do.",
                "author": "SMC540"
            },
            {
                "raw_content": "It's not about thermals, it's battery life and power draw, and I don't think they have the room to push clocks. Two hours is fine, but it's basically as low as it can go and be fine. Any lower would be frustrating. And honestly I think handheld mode has perfectly fine image quality. Sure, some details are crunched, but those take up so few pixels I can't even notice it in normal gameplay.",
                "author": "AuthoringInProgress"
            },
            {
                "raw_content": "I’d love to plug it in while handheld and get more watts",
                "author": "RyeC77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MP1st] Report: First Look at Cancelled God of War Multiplayer Game Unveiled",
        "score": 617,
        "text_content": ">The screenshots from the project that were shared with us offer a good glance at an early stage of development, showing some assets and environments that were being worked on for the title. >The first noticeable detail that we can get by looking at the gallery is that the game was clearly planned to return to a Greek setting. This is evidenced by the presence of Greek temples, classic artifacts such as pottery, and other details we will discuss later. [https://mp1st.com/news/report-first-look-at-cancelled-god-of-war-multiplayer-game-unveiled](https://mp1st.com/news/report-first-look-at-cancelled-god-of-war-multiplayer-game-unveiled)",
        "comments": [
            {
                "raw_content": "Gotta think the obvious choice is to repurpose all that for a GoW remake.",
                "author": "Gen6V"
            },
            {
                "raw_content": "What a massive waste of a good development studios time, resources and expertise in the industry",
                "author": "Dry-Succotash4694"
            },
            {
                "raw_content": "I would have liked to see this just out of curiosity.",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DanielRPK: Sonic 4 (The Movie) could be rename to Sonic CD (The game where the movie is based on)",
        "score": 312,
        "text_content": "According to DanielRPK sources, Sonic's upcoming film, Sonic 4, can be renamed Sonic CD as a tribute to the game it is being based on. It is worth noting that this is one of the parts of Paramount's plans and does not mean that it will actually happen. Source: https://xcancel.com/fuzeryy1205/status/1982181910051684649?t=2mqLdasUUkj-naOd09Feig&s=19",
        "comments": [
            {
                "raw_content": "Sonic: Chaos Dimensions (Sonic CD). That way you capitalize on nostalgia, and don’t confuse general audience of kids who don’t know what a CD is.",
                "author": "bulletPoint"
            },
            {
                "raw_content": "Will the movie have a ripping anime intro?",
                "author": "ResponsibleTrain1059"
            },
            {
                "raw_content": "So basically “Sonic 4 will be named Sonic cd unless it isn’t” truly incredible leaks, no one could’ve predicted that How many of the danielrpk leaks that have been posted here have actually happened? Has he actually leaked any gaming news that isn’t very obvious to guess like “last of us part 3” or “sonic frontiers 2”? He was wrong about kingdom hearts 4 releasing this year",
                "author": "pkoswald"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gaming-optimized Ryzen 5 7500X3D spotted at UK retailer, new six-core budget CPU apparently readied for launch.",
        "score": 280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Stop it AMD, Intel is dying.",
                "author": "AbrocomaRegular3529"
            },
            {
                "raw_content": "As much as I'd really love for this to be an international release of an amazing budget gaming CPU, I doubt it'll be as rosy as it seems at first glance. Historically, the 5600X3D released as a Microcenter US-exclusive (if you can even call it that) release, as did the 7600X3D. The 5500X3D was rumoured to exist back in 2024 but only released in the past few months as a Latin America exclusive. Only the 5700X3D came to international fruition, and it's a few tiers above this chip, so I wouldn't consider it all that equivalent (against say, the 5500X3D). As for the non-X3D 7500(F) for the majority of its life it was an exclusive release as well and Westerners could only get them via Aliexpress, eBay or any other unofficial third party resellers. That's changed recently, it seems the 7500F is now mostly available globally, but in a fair amount of countries it's still more expensive than the 7600, and it's taken 3 years since the launch of Zen 4 to get here. AMD's kept AM5 at a relatively high price point compared to budget AM4 and I'd reckon it intentional. Why would they suddenly release a budget X3D CPU to bring down the price of AM5 to consumers when Intel's effectively meaningless in the gaming segment already? Aside from that, AMD historically doesn't seem to want to release budget X3D CPUs internationally, and you can't really blame them. It'd take away 7800X3D and 9800X3D customers if they see a budget X3D chip doing 90% of the performance for half the cost. That could be different in places like Latin America though, where there could be a price gap AMD could fill with a budget X3D CPU. As much as it'd be awesome to see a budget X3D chip, I doubt it'll happen on a global scale.",
                "author": "DiatomicCanadian"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Renters Have the Upper Hand. And They Are Probably Keeping It.",
        "score": 104,
        "text_content": "Main Takeaways * **Rent Growth Is Slowing**: National apartment rents are rising at the slowest pace in years due to a glut of new units that’s taking longer than expected to absorb. * **Tenant-Friendly Market**: Renters are benefiting from incentives like months of free rent, gift cards, and reduced prices—especially in oversupplied areas like the Sunbelt and Mountain West (e.g., Austin, Denver, Phoenix). * **Youth Job Anxiety**: High unemployment among young adults (9.2% for ages 20–24) is causing many to delay moving out, seek roommates, or return home, weakening rental demand. * **Landlord Expectations Shift**: Property owners hoped to regain pricing power by 2025, but now expect modest rent increases by 2026 or 2027—if at all. Analysts are lowering projections for future rent growth. * **Inflation Impact**: Sluggish rent growth is helping keep inflation in check, since housing is a major component of the consumer-price index. * **Pandemic-Era Overbuilding**: Developers rushed to build during the pandemic, leading to the biggest apartment boom in 40 years. But delays and labor shortages extended the supply surge. * **Changing Demographics**: Remote workers are returning to offices, and immigration is slowing, reducing demand in previously booming regions. * **Record Concessions**: In September, 37% of rentals included concessions like free rent—an all-time high for that month, according to Zillow. * **Real-Life Examples**: Renters like Anika Nelson and Spencer McKean are securing leases with generous perks, reflecting the power shift toward tenants.",
        "comments": [
            {
                "raw_content": "We sold our house in HCOL area last year and pivoted to renting bc the math was favorable for us. Rent vs buy is getting pretty skewed towards renting. We will likely buy again eventually but in the current environment, rent and invest seems to win in a lot of markets",
                "author": "dollar_llamas"
            },
            {
                "raw_content": "My rent just went up 9% in San Diego 😭",
                "author": "boboman911"
            },
            {
                "raw_content": "I think we’re in an era comparable to the 1970’s. In that scenario, inflation will decline when we have a hawkish Fed, but every one in awhile the pain will be too much and they will try to lower rates. That will cause inflation to increase, and we will have to have another Fed tightening cycle. This could go on could a decade or longer and end only when the Fed raises rates to double-digit levels. In that scenario, it’s not very good to be a renter long term, _unless_ you are investing the rental savings. Then it could be great, depending on the price: rent ratio in your area.",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ilya just posted this 🤷",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah a cryptic message. Must be super intelligence.",
                "author": "Ignate"
            },
            {
                "raw_content": "Maybe homie gave up on AGI and is making art",
                "author": "stickypooboi"
            },
            {
                "raw_content": "He’s been browsing the deepweb",
                "author": "elohsuna"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Logan just updated his bio on Twitter",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trolling at this point",
                "author": "strangescript"
            },
            {
                "raw_content": "Can we stop constantly shit posting every tweet from these hype-men. The childish lengths they go to sometimes is just embarrassing.",
                "author": "LongShlongSilver-"
            },
            {
                "raw_content": "this dude is the god of hypeposting and trolling at the same time",
                "author": "YaBoiGPT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "remember when this was the pinnacle of AI art",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/bi29kw1m5hxf1.png?width=984&format=png&auto=webp&s=91130e6c1d4f9546c3c5a2c3fbb934689e67d609 This was my masterpiece",
                "author": "westnile90"
            },
            {
                "raw_content": "I remember even older models like nightcaffe. It was exciting to get messy color patterns that matched prompt. https://preview.redd.it/0cqqarca5gxf1.jpeg?width=400&format=pjpg&auto=webp&s=04ec328feddb33095a729d2987caa4e8fa806f4e",
                "author": "chlebseby"
            },
            {
                "raw_content": "And the crazy thing is you still get people saying it won't get much better, AI can't do much more than x or z... like, have you not been paying attention to the insane advancements it has made in just a few years?!",
                "author": "-Captain-"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Interesting visual representation of AI-generated content outnumbering human generated content. From Oct 2015 to Oct 2025.",
        "score": 298,
        "text_content": "Imagine where we will be in say 5 years. What about 10 years. AI might one day not long from now generate 90% of all the content we consume.",
        "comments": [
            {
                "raw_content": "AI copy detection is absolutely not reliable enough for this exercise. Also, there were no real AI tools at that time that could have \"generated\" anything. Source: I run content programs for AI companies and have since 2017.",
                "author": "gaudiocomplex"
            },
            {
                "raw_content": "How much of the human generated content was slop, AI isn't making the situation any better but lets not pretend that the internet wasn't 90% shit 5 years ago.",
                "author": "theirongiant74"
            },
            {
                "raw_content": "\"Articles classified using AI detection\" Oh... so the thing that is proven not to work. Just yesterday my work was flagged through Grammerly for a school paper. The detected content? The information that the professor provided to do the assignment. Which was used 8 years ago for students as well. I'm not saying that this isn't accurate, but I don't see why I would trust it.",
                "author": "ApprehensiveSpeechs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Huzhou R.I. is gathering data from jetpacks for next-gen flying humanoid robots. These jetpacks weights 31Kg, have 5 microturbines, reaching 100km/h",
        "score": 183,
        "text_content": "https://x.com/XRoboHub/status/1982509562302464206 The Zhejiang University Huzhou Research Institute demonstrated its flying humanoid robot concept and jet propulsion systems at IROS 2025. They displayed a 31 kg jetpack driven by five micro-turbines, reaching 100 km/h. While currently human-controlled, the propulsion and stability data gathered are essential for developing the automatic control systems for future flying humanoids. The goal is to create an autonomous system where humans can simply \"ride\" the controlled platform.",
        "comments": [
            {
                "raw_content": "No! This is where I draw the fucking line! We cannot let the robots take the jet pack riding fun before humans!!",
                "author": "ZeroEqualsOne"
            },
            {
                "raw_content": "They fly now?",
                "author": "DarthMeow504"
            },
            {
                "raw_content": "ripoff of Gravity Co.",
                "author": "outlaw_echo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Did you know Google has this many AI \"Vibe Coding\" apps?",
        "score": 162,
        "text_content": "Google’s quietly building an entire ecosystem of AI-powered coding tools. 1. [Gemini Code Assist](https://codeassist.google/) - AI pair programmer that integrates Gemini into IDEs for intelligent code completion and generation. 2. [Gemini CLI](https://developers.google.com/gemini-code-assist/docs/gemini-cli) - Command-line tool for using Gemini to write, refactor, and explain code directly in the terminal. 3. [Gemini Canvas](https://gemini.google/overview/canvas/) - Collaborative coding and reasoning space for building and testing ideas with Gemini models. 4. [Duet AI for Developers](https://cloud.google.com/blog/products/application-development/introducing-duet-ai-for-developers) - AI assistant in Google Cloud that helps write, deploy, and debug applications in real time. 5. [Firebase Studio](https://firebase.google.com/docs/studio) - Visual environment for managing Firebase projects, data, and analytics workflows. 6. [Google AI Studio](https://aistudio.google.com/) - Web-based IDE for prototyping, testing, and deploying Gemini prompts and APIs. 7. [Google Colab](https://colab.google/) - Cloud-hosted Jupyter notebook environment for Python, ML, and data science development. 8. [Opal](https://developers.googleblog.com/en/introducing-opal/) - Google’s experimental runtime and framework for building intelligent, reactive agents. 9. **Google Labs** 1. [Jules](https://blog.google/technology/google-labs/jules/) - Conversational AI project exploring long-term dialogue and creative assistance. 2. [Stitch](https://developers.googleblog.com/en/stitch-a-new-way-to-design-uis/) - Experimental UI design tool that converts sketches and mockups into working code. 3. [Data Science Agent](https://labs.google.com/code/) - Early-access agent from Google Labs that performs data analysis and visualization with AI. Which ones do you think will stick? Which ones will fall to the waistside. Personally, the future seems to be Agentic tools that can not only write code, but run commands, execute tests, manage source control (git), etc. Like Gemini CLI. What do you think?",
        "comments": [
            {
                "raw_content": "I just wish they did not oversell vibe coding as much... like I saw the CEO of Replit interview recently and by how he described it you'd think the scaffolding they have made allows anyone to create say new banking ledger platform from scratch... So you'd think ok AI cannot really understand large codebases especially in big corporations/legacy companies like banks as there is not much such code out there and it is all in walled gardens, but then the new vibe coding can make similar stuff based on modern tools so old incumbents will be replaced by new startups. Except... all Replit can do is make simple apps like you could with no code or low code tools already, maybe they can be more customized or are cheaper but that's that. There is no big MAGIC happening.",
                "author": "avatarname"
            },
            {
                "raw_content": "Yup, and ai studio itself has a lot of cool shit",
                "author": "welcome-overlords"
            },
            {
                "raw_content": "I don't agree calling many of them \"vibe coding apps\" \\- Gemini Code Assist is literally just extension for Gemini CLI \\- Gemini CLI while can be used for vibecoding, also works really well if you use it for granular patches and read carefully through code, editing \\- Gemini Canvas is just small feature of Gemini chat, literally every single big LLM chat has it (ChatGPT, Grok, Claude) \\- Google Colab existed for a long time already as provider of servers that host Jupyter-like notebook environments with free GPUs, now I guess they just added handy AI assist? \\- Google AI Studio - well this one yeah **pure vibe coding**, pretty cool that it can integrate their own models like Nano Banana so that you can describe workflows like \"let me click on object and when I press button you will put it through nano banana with this predefined prompt to remove that object\" For rest I don't know, never used them or had access to, but simply integrating AI assist into something is far from vibe coding tbh",
                "author": "qustrolabe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla - neural network world simulator that can create entirely synthetic worlds for the Tesla to drive in (fully Al generated video below)",
        "score": 377,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is just insane how realistic it is",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Not sure if the synthetic data approach is realls the way to move forward. How do they make sure they correctly incorporate plausible rare scenarios?",
                "author": "Pahanda"
            },
            {
                "raw_content": "Simulation theory intensifies.",
                "author": "vago8080"
            }
        ],
        "subreddit": "singularity"
    }
]