[
    {
        "post_name": "8th Circuit overrules DEI Obama judge. Takes care away from her and sends it back to state court like Trump requested",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Selzer was paid to produce the result she did, she was retiring anyway so she used the opportunity to score a payoff from the idiotic Harris campaign who really thought a fake poll could help them get out the vote in the midwest.",
                "author": "LastHearth"
            },
            {
                "raw_content": "Everything needs to go to discovery. You don't just throw away 30 years of your reputation right before your retirement for nothing. There needs to be a complete financial audit of her family and friends. There's going to be a connection to the Harris campaign or a PAC. They wanted to outright supress the vote. How many Trump voters got blackpilled because of this seditious hag? She should be in prison. I'd be arresting thousands of Democrats every week if I were Trump. I'd also be ordering the national guard to plunder Democrat cities. Anything they take from a leftist or illegal would now become their property. I'm far more vindictive than Trump. It might be a good thought I don't seek political power.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "There is no question she was paid to publish a BS poll",
                "author": "Username_here"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grassley Reveals Wray, Garland Approved Controversial Anti-Trump FBI Probe",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the Leftards are pissed about the renovations to the White House. Wait until they learn about the expansions to Gitmo. 🤣🤣",
                "author": "MAGASquatch"
            },
            {
                "raw_content": "lock them up",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "They need to declassify the scope of investigation memorandum that Garland gave to Smith to see what Garland authorized him to do in that specific investigation. If he ordered Smith to spy on Republican Senators, he needs to be criminally charged. And did Wray help him write that memo to Smith? As a reminder, Acting Attorney General Rod Rosenstein issued two such memorandums to Robert Mueller. This was not a normal occurrence. The first memo was dated May 17, 2017, and outlined the scope of Team Mueller's authorized investigation in the broadest terms. The second memo, dated August 2, 2017 expanded Mueller's mandate beyond allegations of Russian election interference. \"Because of this second memo, Paul Manafort's lawyers moved to have his initial and the subsequent superseding indictments for business dealings years ago dismissed because, among other reasons, Mueller had no legal authority beyond probing Russian election interference in the 2016 election when he was appointed by Rosenstein on May 17, 2017.\" How many such memos did Garland send to Smith outlining what authority Smith had, and his scope of investigation?",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Coast Guard opens fire on U-Haul at SanFran base 🚚🔫🚢",
        "score": 470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "pressed board and aluminum...was hoping for better penetration - get back on the range boys",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Light those faggots up",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "I feel sorry for them (U-Haul). Those damn liberals damaged their truck.",
                "author": "tuaris"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kid Rock's Halloween Costume 🤣🔥",
        "score": 441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "face diapers are for retards",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "We always had a sense of humor",
                "author": "Fingerbang"
            },
            {
                "raw_content": "I love how kid rock has made enough fuck you money to be able to NOT have to play their game",
                "author": "FrankDuncan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat Party And Liberal White Women",
        "score": 1029,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THEY LIKE TO BE LED BY THE NOSE",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "The cattle nose ring thing is a 100% sign that a male or female is owned by the DNC, but its also true that the DNC owns a larger percentage of non-White women than White women. It amazes me how uniform that libtards have become. Weird random tats, cattle nose rings, SSRI eyes, etc.",
                "author": "HeavyMetalPatriot"
            },
            {
                "raw_content": "Nose ring theory is a thing. If you see one, especially accompanied with trashy ass tats (which is most of them), walk away. She’s probably got a body count to go along with the mental issues.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor: It’s INCREDIBLE how much my presence outside ICE Portland pisses off the leftists. Practically the WHOLE GROUP abandoned their post blocking ICE’s driveway to follow me down the block.",
        "score": 934,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be careful Nick. These weirdos are sick on the head. They have absolutely nothing to live for, which makes them very dangerous. People who love life like me carefully calculate how we act, because we aren't willing to throw our lives away. These types? They'll kill without a second thought. So keep your head on a swivel friends.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "He's the pied piper of antifa.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "whats the bag limit on the furrys after opening day? Asking for a friend",
                "author": "salt-collector"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Make it make sense...",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's simple. Dems were counting on people to struggle so that they can capitalize on it. If people get paid it doesn't increase the pressure.",
                "author": "phro"
            },
            {
                "raw_content": "it’s illegal to donate to the US?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "half the country still thinks the new york times ISNT a piece of shit. God help us.",
                "author": "thelastlast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We need more of these highly skilled workers.",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Completely accurate.",
                "author": "entERmyMAtrix"
            },
            {
                "raw_content": "no joke, pajeets are always on the phone when theyre working.",
                "author": "entwickelnden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yet ANOTHER middle-aged white man in a business suit running amok on public transport, targeting ethnic minority women—will no one stop these monsters?? (Sadiq Khan used public money for this one.)",
        "score": 1140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When has a black woman ever been known to be silent about anything she doesn't like?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "It's okay to be White.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "That's like going to the grocery store and shoplifting from the trash can in the restroom.",
                "author": "2Clutch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The President’s Remodeling Play-set",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI is The new era of Shitposting.",
                "author": "DT170x"
            },
            {
                "raw_content": "Hammer ready playset. kek",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Leftist are being so anal about the ballroom. They can't get over he won the election. Sickening.",
                "author": "SomecatsareMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Police Report Reveals Democrat DC Congressional Delegate Eleanor Holmes Norton Has “Early Stages of Dementia”",
        "score": 953,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The good news is that DC doesn’t vote for anything in Congress",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "I thought brain damage was a prerequisite for being in congress.",
                "author": "_fidelio"
            },
            {
                "raw_content": "Rule By Elderly has been a complete and total disaster.",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keir Starmer Vows to Protect Britain's Muslim Migrants From the Legitimate Criticisms of British Citizens",
        "score": 1160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "whatta stupid cucked faggot Trump literally made him visit in his own country",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "What the hell is wrong with these people? Seriously.",
                "author": "AuPhalanx"
            },
            {
                "raw_content": "Dude wants his country to burn from the fires of Islam, apparently.",
                "author": "Than0sIII"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Teachers' Union Sues to Save...Illegal Alien Truck Drivers?",
        "score": 1157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End all tax payer unions.",
                "author": "MeMargie"
            },
            {
                "raw_content": "How would they possibly have standing?",
                "author": "OK_Parmaker"
            },
            {
                "raw_content": "the federal govt has used the interstate commerce clause as justification for all sorts of powers. How about they regulate interstate commerce. If your shitt y ass state issues drivers licenses to illegals, they cant leave the state. If a trucking company employs them they are lliable for the deaths..",
                "author": "super_pede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Florida Police Bust Massive COLOMBIAN Theft Ring Run by Illegal Aliens Disguised as “Landscapers” — All Five Suspects Are in the U.S. Illegally with ICE Detainers",
        "score": 1443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Massive\" Five landscapers",
                "author": "MAGASQUAD"
            },
            {
                "raw_content": "Remember \"Stop Asian Hate\"? Vanished like a fart in the wind when almost all of the perps were narratively inconvenient.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "The theft was massive not the amount of criminals.",
                "author": "MkultraUSA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "rome",
        "score": 1424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Basically this. Deny us number 1, we'll settle for the second.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "Make Instanbul Constantinople again!",
                "author": "Sythen"
            },
            {
                "raw_content": "I've often wondered how much more advanced humanity would be if Rome never fell. All of humanity forgot how to make concrete for 1500 years. What else would we have achieved?",
                "author": "prayinpede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Heartbreaking Setback: New Late-Term Abortion Clinics in Colorado and New Jersey Spark Outrage",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd rather have a declining population that was never born than straight-up ~~murder~~ abortion. These babies never got a chance at life ...all because 2 people couldn't be bothered to use a $1 condom.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Moloch is hungry.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "If I'm on the jury of any abortion center attacker's trial, innocent as the day is long.",
                "author": "UncleSlayton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seattle Jail Hires Illegal Migrants to Guard Citizens, Will Fight State Ban to Keep Them",
        "score": 1283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its NOT a Federal crime to hire illegals???",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Why the FUCK is DACA still a thing? I don't give a FUCK who it inconveniences. The courts don't have an army. IGNORE THEM. Trump has every right to just erase an executive order - especially one as illegal as DACA. Trump is being so weak just trying to keep the government functional. We want you to cross that Rubicon. These people literally want our families dead. We are under no obligation to uphold a corrupt system waiting to regain power to kill us. Use Hesgeth to clean out the military and then round up all the illegal immigrants and DACA recipients. The left literally can't win Congress ever again without illegals.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "I'm waiting for the day when President Trump gives marching orders to his base. FAFO",
                "author": "actlikewewon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dan Scavino to Canada: Why did you spend $75,000,000.00 here in the United States with a FAKE anti-tariff ad featuring President Ronald Reagan? Did you reach out to them and extend an apology? Did you pull the ad? Why are you interfering in our elections by targeting Republican Voters?",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s the penalty for foreign election interference? Asking for a fren",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "$75m? Trump posted that it was $75k",
                "author": "couranto"
            },
            {
                "raw_content": "Bomb Canada",
                "author": "SadFugeeFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anonymous Billionaire Pays $130 Million for Troops’ Salaries",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless him/her.",
                "author": "12345SIX"
            },
            {
                "raw_content": "One thing we know for sure is it wasn’t a Democrat",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Probably Trump.",
                "author": "posedgeclk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘You Are Suffocating’: SCOTUS Justice Sonia Sotomayor Pens Bizarrely Emotional Dissent",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sonia is not healthy at the moment, and her moods seem to be attributable at least in part to her advanced diabetes. Anyone who knows diabetics knows what I mean.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "2016 was the biggest election of my lifetime. Imagine the state of the country with Cuntillary winning and her appointing 3 more DEI hires to the Supreme Court like this cunt. We'd be fucked.",
                "author": "HankScorpio"
            },
            {
                "raw_content": "Hopefully she kicks the bucket soon.",
                "author": "Ricky_CIA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Qualcomm announces new Snapdragon 6s Gen 4, claims 36% CPU and 59% GPU speed improvements, support for 144 Hz displays",
        "score": 23,
        "text_content": "**Summary**:- **Improvements\"*:- -> +36% CPU speed -> +59% GPU speed -> Bluetooth v5.4, up from Bluetooth v5.2 -> Wi-Fi 6E, up from Wi-Fi 5 -> 5G modem downlink speeds of up to 2.9 Gbps, up from 2.5 Gbps -> support for LPDDR5 memory, up from LPDDR4X standard **What's new**:- -> Support for 200 MP cameras (previous gen supported up to 108 MP) -> 240 fps slow motion capture at 720p (up from 120 fps) -> Support for 144 Hz refresh rate (up from 120 Hz max) **Other**:- -> 4nm Samsung node, first in it's series -> Now uses a 4 performance and 4 efficiency core architecture -> Uses the same Cortex A55 and A78 cores, however an increased peak boost of 100 MHz -> No mention of support for HEVC encoding (previous gen had it) -> No comment on efficiency gains On paper it looks promising, but we've been fooled by that before. Sounds good though, we might have to wait for a new Xiaomi budget device to see how these improvements translate onto real life.",
        "comments": [
            {
                "raw_content": ">No comment on efficiency gains. If the CPU is 36% faster at iso power or even just slightly more power, efficiency gains are likely very significant.",
                "author": "Famous_Wolverine3203"
            },
            {
                "raw_content": "Only 2k video recording? Also it's 2025, there isn't AV1 support yet on their cheaper socs? My 2017 snapdragon 660 does 4k 30fps hevc no issues.",
                "author": "empty_branch437"
            },
            {
                "raw_content": ">Support for 144 Hz refresh rate (up from 120 Hz max) Would have thought they could do that already.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's pivotal 18A process is making steady progress, but still lags behind — yields only set to reach industry standard levels in 2027",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At least they are being honest about it. That's progress.",
                "author": "noiserr"
            },
            {
                "raw_content": "This is one important part of [the much larger earnings news](https://www.reddit.com/r/hardware/comments/1oeggjg/intel_nasdaqintc_q3_beats_on_revenue_stock_soars/). [The full transcript of Intel's earnings call](https://finance.yahoo.com/quote/INTC/earnings/INTC-Q3-2025-earnings_call-366977.html), timestamp 0:44:35: >**Question:** >Yeah, thanks, John. I wanted to follow up on the gross margin trajectory as 18A layers in. I know, you know, comparing it to probably the prior couple of nodes, not a great compare, but maybe to a successful one. When you say yields are in a good spot and improving, is there a way to think about where those 18A yields are versus a successful product that you've seen in your history and, you know, kind of thinking about how that layers in in the first half? >**Answer (CFO Zisner):** >Yeah, I would say in general, I'm not sure yields in older nodes have been a big focus of ours, quite honestly. We're blazing a new trail on this. Yields are, what I would say, the yields are adequate to address the supply, but they are not where we need them to be in order to drive the appropriate level of margins. By the end of next year, we'll probably be in that space. Certainly the year after that, I think they'll be in what would be kind of an industry-acceptable level on the yields. I would tell you on Intel 14A, we're off to a great start. If you look at Intel 14A in terms of its maturity relative to Intel 18A at that same point of maturity, we're better in terms of performance and yield. We're off to an even better start on Intel 14A. Funny how there's no numerical answer on how 18A yields compare to a previous product and then the CFO's quickly shifts to 14A. For reference, this is probably what the question expected: [the Intel chart](https://cdn.mos.cms.futurecdn.net/vfZptrDfS3Z7ApSphcRXai-728-80.png.webp) \\- y-axis has no numbers, no other nodes' yield plotted [a TSMC chart](https://www.dvhardware.net/article73608.html) \\- numbered axis, plots multiple nodes' yield [a TSMC chart](https://semiwiki.com/forum/threads/tsmc-discloses-n2-defect-density-lower-than-n3-at-the-same-stage-of-development.22699/) \\- y-axis has no numbers, plots multiple nodes' yield // Claiming to be better than older nodes, but with no actual data is maybe why yields won't reach an \"industry-acceptable level\" until 2027. As a reminder, Reuters' previous report: [Exclusive: Intel struggles with key manufacturing process for next PC chip, sources say | Reuters](https://www.reuters.com/world/asia-pacific/intel-struggles-with-key-manufacturing-process-next-pc-chip-sources-say-2025-08-05/) Again, Intel still has not provided an updated defect density on Intel 18A in now [**13 months** (and counting).](https://www.tomshardware.com/tech-industry/intel-says-defect-density-at-18a-is-healthy-potential-clients-are-lining-up) Clearly Intel ***has*** 18A defect density data every quarter, but has decided to not make public updates. // 18A not having [any \"significant\" external customers](https://www.reddit.com/r/hardware/comments/1ma3kkw/intel_shares_its_foundry_has_zero_significant/) is quite unfortunate for margins. For reference, TSMC has [picked up **10 to 15 customers** on TSMC N2](https://www.tomshardware.com/tech-industry/intel-amd-and-mediatek-reportedly-among-tsmcs-2nm-early-adopters-company-said-to-have-15-customers-lined-up-for-new-process-tech).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "https://www.techpowerup.com/342204/intel-reassures-18a-yields-are-okay-continues-14a-development >Adding to that, the CFO commented on 18A yields: \"I wouldn't say Intel 18A yields are in a bad place. They're where we want them to be at this point. We had a goal for the end of the year, and they're going to hit that goal. To be fully accretive in terms of the cost structure of Intel 18A, we need the yields to be better. That's like every process. That's what happens. It's going to take all of next year, I think, to really get to a place where that's the case.\" For Intel, 18A yields are now at a very low defect rate where manufacturing even some of the bigger dies is not a problem or financial burden. However, as every node, it matures over time where defect rates are constantly reduced to increase operating margin and reduce waste dies. Hence, Intel is still investing into the 18A refinement, and the node will stick for a very long time. The actual disclosure is significantly more optimistic than the OP article, although as usual, no actual defect density numbers or even a yield number+die size.",
                "author": "SemanticTriangle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RX 9070 - 50 GAMES at 1440P UW | Ray Tracing, FSR4, Frame Generation & More!",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD EPYC Turin vs. Intel Xeon 6 Granite Rapids vs. Graviton4 Benchmarks With AWS M8 Instances.",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">It is worth noting though with the AMD m8a instance are all physical cores without SMT / sibling threads while the M8i Granite Rapids instance for its vCPU counts the physical core plus the sibling thread of Hyper Threading. I would like to see it apples-to-apples. I wonder why AWS counts SMT differently for the same named instance.",
                "author": "Earthborn92"
            },
            {
                "raw_content": "Big OOF for Intel. If you need x86_64 or it better fits your workflow just use AMD as it has both higher performance and is more cost effective. Otherwise Graviton might be a possibly a cheaper option. The only reason to use Intel is I guess some legacy enterprise software may be only certified running on Xeons? Who would choose Intel and why?",
                "author": "reveil"
            },
            {
                "raw_content": "Why cant intel get any W's",
                "author": "A_Typicalperson"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon AI PRO R9700 GPU arrives October 27 at $1,299 for retail",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> These Radeon AI PRO R9700 GPU features a 4 nm \"Navi 48\" GPU, equipped with 64 RDNA 4 compute units, providing 4,096 stream processors and 128 AI accelerators for enhanced matrix operations across various data formats. A key improvement over the RX 9070 XT gaming GPU is the increased memory capacity, now doubled to 32 GB. The memory subsystem includes 20 Gbps GDDR6 across a 256-bit wide interface, delivering 640 GB/s of memory bandwidth, supported by a 64 MB 3rd Gen Infinity Cache. The AMD Radeon AI PRO R9700 achieves up to 191 TeraFLOPS FP16 dense performance and up to 1531 TOPS INT4 sparse performance, all within a power footprint of up to 300 W. It's basically a 9070xt with 32GB of memory.",
                "author": "ADreamOfRain"
            },
            {
                "raw_content": "gddr6 instead of gddr7",
                "author": "Professional-Sir7048"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Silverstone FLP02 is hiding a HUGE secret",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This thing is so cool, seriously thinking of buying it",
                "author": "msthbe"
            },
            {
                "raw_content": "Waiting on this with bated breath….",
                "author": "Artistic-Tangelo-904"
            },
            {
                "raw_content": "Looks like a great case. I could do without the fake floppy drives, turbo display etc... so I guess something more modern but still retaining most of the 90s workstation midi tower styling, I just like this classic layout. I do know that just like back in the day that rear fan exhaust would need to be modified though, those restrictive stamped exhaust holes were a plague in the 90s.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC says China's rare-earth export restrictions will have limited short-term impact on company — concern lies in transitioning away from China supply",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tom's hardware repeating the state media line. Taiwanese media claims TSMC will be out of rare earths by dec 1",
                "author": "stopantisemitsm2025"
            },
            {
                "raw_content": "It's in Taiwan and China's interest to keep them mutually dependent. I'm all for the hard work they have done to make these incredible chips.",
                "author": "jedrider"
            },
            {
                "raw_content": "Hello nohup_me! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phil Spencer: Switch 2 will be one of the focuses of Team Xbox.",
        "score": 794,
        "text_content": "\"We are making efforts to lower the barrier to entry so that people can play our games through services like Xbox Play Anywhere and Xbox Game Pass. However, if someone wants to play our games on PlayStation 5 or Nintendo Switch 2, we would love for them to do so on those platforms. In that sense, we have received excellent support from both Sony and Nintendo.",
        "comments": [
            {
                "raw_content": "Give me Rare Replay already 😭",
                "author": "ThePickleHawk"
            },
            {
                "raw_content": "MS and Nintendo have historically gotten along pretty well because NOA is down the street from Microsoft HQ and even when Rare was bought by MS, they allowed them to publish games on the GBA like Saberwolf, Banjo Pilot, Grunty’s Revenge, etc. I would 100% love a port of Rare Replay to Switch with all the bonus material, etc but not sure now since all n64 games (besides conker) are on NSO now.",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "Halo on Switch 2 will be a dream",
                "author": "Rocco_Morrashow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I don't have Pokemon Legends ZA yet, so I'm going to start a new playthrough in Legends Arceus to fill the void☺️",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh how I wish they gave legends arceus a patch edit: mistake",
                "author": "BoughtSquash665"
            },
            {
                "raw_content": "i’m actually going to do a replay myself after i finish ZA! arceus is such a special, fun game",
                "author": "marcobiotic"
            },
            {
                "raw_content": "would be an instant buy for me if they patched it on switch 2, so stupid that they wont do it.",
                "author": "zarif2003"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What switch 1 games are worth trying on switch 2?",
        "score": 449,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apart from The Xenoblade Games, which haven’t gotten a patch yet, basically all the high-profile exclusives! Especially the Zelda games, they run and look even better on SW2.",
                "author": "skylu1991"
            },
            {
                "raw_content": "Mario odyssey is amazing on switch 2",
                "author": "BreadIll4440"
            },
            {
                "raw_content": "Animal Crossing, faster loading",
                "author": "GeneralBrilliant2336"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just watched second direct and it feels like Kirby air rider 2 has way more content than Mario Kart World",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i feel like sakurai games just pack in a ton of random features into them",
                "author": "THEPOTATOLORDREDDIT"
            },
            {
                "raw_content": "That's what i'm gonna miss from Sakurai when he'll retire. He puts so random stuff in his game and so much polish.",
                "author": "Specialist-Movie-320"
            },
            {
                "raw_content": "As someone who grew up playing the original Kirby Air Ride, this is a dream come true. I’ve never been more excited for a game before. I highly recommend trying the online demos that are happening soon.",
                "author": "newcanadianjuice"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"with all the games available on Switch 2, in terms of the most high-end graphical experience, I think we are the best\" - FFVII remake co-director Naoki Hamaguchi",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As someone who only owns nintendo console for all my life im so excited to play this game",
                "author": "OnePassenger4597"
            },
            {
                "raw_content": "I agree, I still think Star Wars Outlaws is the most ambitious but in terms of pure aesthetics Final Fantasy wins.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Umm, they are probably right, but in my opinion cyberpunk seems way more impressive, day one console release and while i haven't played it in person, it seems quite impressive in terms of graphics and performance. Final fantasy remake i think is less intensive in some parts, like not being exactly open world makes the cpu less likely to be a bottleneck, so graphically its gonna be quite beautiful, it was already on ps4 so i expect great things from this port!",
                "author": "Successful-Bar2579"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "System Shock 2 Remake confirmed to be fully on cartridge for Switch 2.",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where that just looks like a switch 1 box",
                "author": "skyblade960"
            },
            {
                "raw_content": "There is no System Shock 2 remake.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Best of luck to everyone who gets a copy 2 years later after 15+ mfg delays on limited runs end",
                "author": "otakugamerzone"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Games you are most shocked that still don't have a Switch 2 update/edition?",
        "score": 70,
        "text_content": "Just wanted to bring this up because i was talking to a friend about this and was telling me how he was expecting more Switch 2 updates overall for titles like say, the Xenoblade series and yet we're still waiting, i guess it could happen after Xenoblade 4 is announced 😅 thoughts?",
        "comments": [
            {
                "raw_content": "Xenoblade for sure, and i wish they could make the Switch 2 version for the Pokemons SwSh, but they won't",
                "author": "Rayzakii"
            },
            {
                "raw_content": "Metroid games",
                "author": "TrainingDivergence"
            },
            {
                "raw_content": "I'd love to see Legends Arceus get one at some point.",
                "author": "PhoenoFox"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends Z-A has sold 5.8 million units worldwide in its first week. About half of sales were on Nintendo Switch 2",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not even the true holiday shopping time yet",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "I'm having fun with it, as well as Digimon, I do hope they port it over to the Switch 2, I would rather play it directly on the Switch 2 rather than stream it from the PS5 to the steam deck.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "All I've done in my spare time since release is play it. Just under 50 hours in and still loving it.",
                "author": "Thekingchem"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Halo Remake officially shows up on Xbox store",
        "score": 932,
        "text_content": "Halo: Campaign Evolved, also releasing on ps5 [https://www.xbox.com/en-US/games/store/halo-campaign-evolved/9N683TDT5M7R/0010](https://www.xbox.com/en-US/games/store/halo-campaign-evolved/9N683TDT5M7R/0010) Previous rumors (RebsGaming; Nate Grubb and Schreier corroboration) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ocitws/rebs\\_gaming\\_grunt\\_is\\_reconfirming\\_that\\_a\\_new\\_halo/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ocitws/rebs_gaming_grunt_is_reconfirming_that_a_new_halo/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oe1ean/jason\\_schreier\\_later\\_this\\_week\\_microsoft\\_will/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oe1ean/jason_schreier_later_this_week_microsoft_will/) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oejeq4/jeff\\_grubb\\_and\\_natethehate\\_seemingly\\_confirming/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oejeq4/jeff_grubb_and_natethehate_seemingly_confirming/)",
        "comments": [
            {
                "raw_content": "Description: >Halo: Campaign Evolved is a faithful yet modernized remake of Halo: Combat Evolved’s campaign. Experience the original story rebuilt with high-definition visuals, updated cinematics, and refined controls, plus three brand-new prequel missions featuring the Master Chief and Sgt. Johnson. A broader arsenal of weapons, vehicles, enemies, and gameplay-modifying “Skulls” – optional modifiers that change combat in fun and challenging ways – add fresh tactics and endless replayability. >Play it your way: solo, in 2-player split-screen co-op (console only), or up to 4-player online co-op with full crossplay and cross-progression support. Whether you’re discovering Halo for the first time or returning to the ring after 25 years, Halo: Campaign Evolved delivers an adventure that feels both timeless and brand new.",
                "author": "Str8UpJorking"
            },
            {
                "raw_content": "Why does everything in UE5 have this weird grain and ghosting on every reflective surface. It's very apparent in the trailer.",
                "author": "CategoryStrict8462"
            },
            {
                "raw_content": "if you check the trailer it's also coming to PS5 and Steam https://imgur.com/V2n2Ff2",
                "author": "lurkingdanger22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Halo 1 Remake Demo available at Halo WC 2025 before launch!",
        "score": 508,
        "text_content": "In the video you can see the booth for a demo of the game. [https://youtube.com/shorts/MWii3zsXE9g?si=VrI2Srlim\\_itwN-F](https://youtube.com/shorts/MWii3zsXE9g?si=VrI2Srlim_itwN-F) Also the entry gate pass has Master Chief in his OG Armor [Here](https://www.reddit.com/r/halo/comments/1of45or/yeah_theres_no_way_its_not_the_ce_remake/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "The fact that they have a playable build at least soft-suggests whatever trailer they're showing will actually be gameplay-focused That's something Halo hasn't really done in terms of an unveil in a long fucking time",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Oh damn, that’s cool. Hopefully the confidence is warranted.",
                "author": "HiCustodian1"
            },
            {
                "raw_content": "so does this game launch a year from now? surprised theres a demo so far away from launch",
                "author": "Retro1088"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "BF6’s free to play BR mode is titled RedSec and will shadow drop on October 28th",
        "score": 568,
        "text_content": "- Will be called Battlefield: RedSec - Supposedly no trailers until launch day or maybe a day before Source: https://xcancel.com/ModernWarzone/status/1981741907387523203#m",
        "comments": [
            {
                "raw_content": "So just like Warzone, it won’t be classified as a BR mode, but a separate Battlefield game by itself. This was what I was most curious about. If it would be branded as a battle royale mode for Battlefield 6, or marketed as a separate game by itself.",
                "author": "Bolt_995"
            },
            {
                "raw_content": "This makes sense because BF6 includes a bonus XP modifier for owning BF6, which was pointless without this context.",
                "author": "Small_Bipedal_Cat"
            },
            {
                "raw_content": "Gonna go against the grain here and say I think Battlefield's gameplay could lend itself well to a BR. There's arguably a niche for it for people that want a somewhat slower BR than Warzone but still keeping a realistic aesthetic as opposed to Apex/Fortnite. Guess I'll find out in a few days if it is any decent or not.",
                "author": "Blackadder18"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The TV's in Fortnite are about to updated with various Simpsons memes including Homer retreating into the bush, Lisa's speech and Marge krumping",
        "score": 245,
        "text_content": "https://xcancel.com/HYPEX/status/1981682151059050686?t=a_GRfwQKLlL3MdFzIZZJpQ&s=19",
        "comments": [
            {
                "raw_content": "We did it reddit!",
                "author": "Nintendope"
            },
            {
                "raw_content": "This is SO heckin chungus 😂😂",
                "author": "GomaN1717"
            },
            {
                "raw_content": "![gif](giphy|a8AXSGtbEl1du)",
                "author": "-ImJustSaiyan-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Corcoran Group CEO says Gen Z's housing market struggles mirror what boomers faced 30 years ago: ‘Stop buying Starbucks coffee,' she advises | Fortune",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't starbucks not doing well due to people not spending money on coffee? (and the CEO commuting to work via jet).",
                "author": "babypho"
            },
            {
                "raw_content": "And every Millennial could have afforded a house if not for their pesky avocado toast habit",
                "author": "feeltheglee"
            },
            {
                "raw_content": "Weren't average salaries higher relative to housing prices 30 years ago? Oh yeah that's right, they were.",
                "author": "jiggajawn"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dow rises 400 points to record as light inflation report paves way for Fed rate cut",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone here feel they are only paying 3% more for food and energy in the last 12 months? In fact, is anyone here paying 3% or less for *anything* in the last 12 months? This number is manipulated bullshit.",
                "author": "damnedbrit"
            },
            {
                "raw_content": "TL;DR U.S. stocks reached new heights on Friday as cool inflation data raised investors’ optimism that the Federal Reserve can stay on its rate-cutting path, boosting the economy and justifying higher valuations for equities.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I bought pants on Amazon a week ago because all of mine are falling apart and I lost 85 pounds in the last 18 months. I got one pair to try them out. I like them so I go to buy some more and holy smoke they are 30% more across the board. Huh? Not just these but all of the alternatives as well. They are even more expensive everywhere else I check. Was this inflation suddenly catching up to Amazon? Or are they just jacking the price up because they can. Probably both I imagine. I still have to pay more at a time when my employer \"eliminated my position\" due to a merger. And it's just about impossible to find a job. And food, electricity, and a bunch of other stuff is suddenly more expensive as well. Inflation is real and it sucks no matter what these hosers say. I know because I STILL NEED PANTS!",
                "author": "RelentlessGravity"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation rate hit 3.0% in September, lower than expected, long-awaited CPI report shows",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the report your employer will show you when they tell you your 2% merit increase is really good, and if you can’t pay your bills it must be your imagination.",
                "author": "dallasdude"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "3% is not good. The fed is cutting rates while 1% above target and rising.",
                "author": "mattjouff"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Single-family rent growth just hit the lowest level in 15 years, new report finds",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bad news for investors, fantastic news for the rest of us.",
                "author": "ColorMonochrome"
            },
            {
                "raw_content": "It's pretty wild that rents for single-family homes rising 1.4% is the lowest in 15 yrs.. finally a cool off. Just shows how insane things were for rent prices for so long. Hopefully wages can keep growing and catch-up.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflated Prices, Taxed to Death - Appraisers Blogs",
        "score": 12,
        "text_content": "Freddie, Fannie Have Unwittingly Stoked Property Tax Firestorm. Inflated home values, engineered by Fannie and Freddie’s appraisal waivers and algorithmic lending, have distorted the market and saddled taxpayers with rising property tax burdens.",
        "comments": [
            {
                "raw_content": "Fannie and Freddie have not engineered inflated home values. Inflated home values are due to policy set by our local and federal government. Not every borrower or property qualifies for an appraisal waiver. There are restrictions. Also, a percentage of those waivers are for properties that have recently been appraised and that recent appraisal will be used instead of ordering a new one. Algorithmic or automated appraisals rely on historical data for valuation. Its goal is predict what someone would pay for the home. With appraisers their goal is to find comps to value the home at the sales price or higher. In fact if an automated appraisal comes under the sales price then you would order an appraisal. Automated home values do decrease and appraisers can’t always justify the price. Neither method is perfect, but perhaps a good method would be a combination of the two. The 2018 tariffs, the trade war that followed, and tax benefits in the 2017 tax cuts and jobs incentivizing investors to buy up existing homes are a big reason why home values have inflated so much. The tax benefits and tariffs increased demand on existing while tariffs inflated cost to build new. The BBB increases these incentives while the new tariffs and trade war will increase the cost to add new supply. These incentives are not enough for some investors at these prices so they are waiting for more distressed sellers and foreclosures which there will certainly be in the future. Our government uses taxes to influence investor behavior. Counties and cities should use real estate taxes to influence investors. Right now large landlords are lobbying and influencing people with propaganda to get rid of the real estate tax. This will only increase investor demand on housing during a period of increased foreclosures and distressed sellers. I would hate to see what prices will be on the other side of this recession should this happen. I expect existing home values will creep up to new build prices. States should implement a significant homestead exemption tax. Then localities should implement a split tax rate to incentivize investors to sell or to do something productive with their property. For example a vacant homes and land in cities should be tax at much higher rate than occupied properties. Short term rentals should be taxed higher as well. Tariffs levied in 2018 fueled higher construction prices https://warrington.ufl.edu/news/tariffs-in-2018-higher-construction-prices/ “For real estate investors, the extended and expanded tax cuts, as outlined above, are largely favorable, increasing margins and profitability while lowering barriers to investment.” - “Beautiful Bill’ for Real Estate Investors https://www.landlordstudio.com/blog/the-one-big-beautiful-bill-and-real-estate",
                "author": "LegalFig5560"
            },
            {
                "raw_content": "In all of the taxing jurisdictions I know of, rising property values don't necessarily increase your tax burden. But i guess it's too much to ask an appraiser to understand how property taxes work.",
                "author": "Single-Difference610"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Existing home sales rise to 7-month high, helped by falling mortgage rates.",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol at the comment \"it's going to be a wild spring\" Also are these accounts that cross post from r/realestate just realtor spam bots trying to push a narrative",
                "author": "probably-theasshole"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AGI confirmed",
        "score": 443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so just do the opposite of what it tells you to do then! pretty good winrate then",
                "author": "Jeb-Kerman"
            },
            {
                "raw_content": "\"Excellent question- ... ... By the way, are you interested in trying out my new Agent mode for your Fidelity portfolio? I can help you optimize your retirement funds\" *\\[Absent mindedly type yes cuz whatever, I say yes to whatever BS followup question it asks half the time cuz I am bored\\]* Several days later...I see OP pic on my Fidelity account",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "Funnily enough the chinese models like deepseek and qwen are a LOT better at this lol",
                "author": "Finanzamt_Endgegner"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam cooked with this one",
        "score": 1705,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey ladies, I have my AI900 certification if you're interested...",
                "author": "Kracus"
            },
            {
                "raw_content": "These kinds of honeytrap tactics have been practised by modern states for well over 100 years, nothing new here aside from perhaps scaling it up.",
                "author": "FriendlyJewThrowaway"
            },
            {
                "raw_content": "Aren't an absurd number of these AI researchers already from the East and here on visa?",
                "author": "Gubzs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is becoming a class war.",
        "score": 57,
        "text_content": "There are many elites on record trying to stop: \"*goal of building superintelligence in the coming decade that can significantly* ***outperform all humans***\" [https://superintelligence-statement.org/](https://superintelligence-statement.org/) But AI that can replace **most humans** is OK, apparently. [https://www.businessinsider.com/functional-agi-superintelligence-economy-replit-amjad-masad-2025-10](https://www.businessinsider.com/functional-agi-superintelligence-economy-replit-amjad-masad-2025-10) **I want AI that can replace YOU but not ME.** (as a pro-AI person I always thought it'd be used to cure cancer, create fusion energy, etc. Never expected this outcome. I am gullible like that..)",
        "comments": [
            {
                "raw_content": "Yes, that's the gist of what's going on. The top 10% thought they were all safe, but the top 1% figures they can replace the other 9%, and the 0.01% believe they can replace the other 9.99%. At the end of the day, if we create super intelligence and it has it's own goals, we're all just chattering monkeys, equal in our lack of intelligence, and having lost the spot as the most intelligent thing on Earth.",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "In the endgame of this thing called humanity, you’ve got to let people do some foolish things, say some foolish words, and think some foolish thoughts — that’s the humanity I know.",
                "author": "nillouise"
            },
            {
                "raw_content": "As an aside, imagine being around for a decade and getting reduced to a “vibe coding startup”: > The CEO of the vibe coding startup said I hate this place",
                "author": "dashingsauce"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Suno 3.5 Passed The AI Music Turing Test",
        "score": 41,
        "text_content": "https://x.com/emollick/status/1981501021320053020 https://arxiv.org/abs/2509.25601 https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fgrv8l8z952xf1.png%3Fwidth%3D1320%26format%3Dpng%26auto%3Dwebp%26s%3D6bc89977d0a55f9101ef020260dc5ff69265aa79 Half of the participants in the study could not tell the difference between real life popular music vs music generated by Suno 3.5, which was released almost 2 years ago. If they do a new study with Suno V5, it's likely that 90% of the participants will not be able to tell the difference.",
        "comments": [
            {
                "raw_content": "What you have mentioned about them using a 2 year old version of Suno, is the most important part, and what people will miss Completely agree with you that if these tests are conducted again using Suno V5, more than 90% wouldn't be able to tell the difference. I'd even go as far as 95%",
                "author": "whoistlopea"
            },
            {
                "raw_content": "most people do not have musical knowledge.",
                "author": "ninjasaid13"
            },
            {
                "raw_content": "Most people are NPCs and think of music as just background noise… but as a musician and music lover I’m anticipating the day when I hear something that was completely AI generated that is just undeniably great on the same level as Smells Like Teen Spirit or Yesterday. I still don’t know how I’ll react to it but I’ll definitely need to take a lap around my block a couple times to really understand how to feel about it.",
                "author": "HelloGoodbyeFriend"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Flyby of Stargate in Abilene, Texas, in September",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|kQmr2OwBTD2L5Hzo1T)",
                "author": "Rainbowels"
            },
            {
                "raw_content": "When you think about its scale. It looks closer to what it would take to get to AGI, these may be the very buildings it emerges from.",
                "author": "Dry_Management_8203"
            },
            {
                "raw_content": "Hell yeah, I can't wait for the largest data centres to finally start coming online next year, things are really gonna get wild!",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree G1 spotted learning bike at IROS2025",
        "score": 365,
        "text_content": "https://youtube.com/shorts/CDerpl40nAo?si=VDc8clAIuApmeuzK IROS2025: The 2025 IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS 2025) October 19 to 25, 2025 in Hangzhou, China.",
        "comments": [
            {
                "raw_content": "A robot riding a bike like that may conserve battery as well when traveling large distances - just like bikes do for humans. Didn’t even think of that as an option before this video",
                "author": "nooffensebrah"
            },
            {
                "raw_content": "Got people arguing with me (on this very subreddit) that there is no way robots will have the dexterity to do human trade jobs in our lifetime Hilarious.",
                "author": "lolsai"
            },
            {
                "raw_content": "unitree makes tesla look like amateur hour",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI has more than 100 ex-investment bankers helping train its artificial intelligence on how to build financial models",
        "score": 430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Going to be really funny when it just puts all of its money into the S&P 500 and leaves it there for a few decades.",
                "author": "MonkeyHitTypewriter"
            },
            {
                "raw_content": ">OpenAI Looks to Replace the Drudgery of Junior Bankers’ Workload I.e. generously relieve them of their jobs.",
                "author": "King_Allant"
            },
            {
                "raw_content": "openAI is desperate to make money since their obligations are piling up. mark my words. there will be an IPO after an insane amount of hype",
                "author": "kvothe5688"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Plots Generating AI Music in Potential Rivalry With Startup Suno",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "even sora 2 creates better music than suno or udio, at least in those short clips, so this could be very good",
                "author": "JoMaster68"
            },
            {
                "raw_content": "I’m down. It’s not everyone’s cup of tea, but I enjoy it.",
                "author": "NotMyMainLoLzy"
            },
            {
                "raw_content": "AI companies that only do one thing are not long for the world. Sora 2 can do decently okay music and singing and it wasn't specifically trained as a music generating AI. Eventually we will have omnimodels that do everything.",
                "author": "yaosio"
            }
        ],
        "subreddit": "singularity"
    }
]