[
    {
        "post_name": "8-year-old Sarah Marsh has sadly passed away from the Kerr County flooding along with 51 others so far, let’s see how democrats responded:",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting take from the party of baby killers.",
                "author": "BrotherSeven"
            },
            {
                "raw_content": "Truly evil people",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "And yet somehow we have a Democrat speaker of the house....",
                "author": "deltch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arbella Rodriguez Marquez, has been seen by a medical professional at least 13 times at Eloy Detention Facility. Each time she has been found to have no medical issues.",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Help¡ I’ve been caught doing something illegal and now I have incarceritas¡ I need to cost the taxpayers more money¡",
                "author": "1756_squanch"
            },
            {
                "raw_content": "Faking cancer. Wonderful people, really.",
                "author": "LibertyOrigins"
            },
            {
                "raw_content": "It's \"she is not doing WELL\", yet more proof that we need to dismantle the department of \"education\"",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. intelligence official: \"Obama ordered the ICA to set Trump up and knock him off balance before he could even get started. This was an influence operation far more consequential than anything Putin cooked up. Obama and Hillary schemed the op, and the CIA and FBI ran it.\"",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NEW: news that everyone's known for the last 9 years.",
                "author": "clean"
            },
            {
                "raw_content": "TIRED of seeing evidence online with NO arrests or Indictments. It's lke you don't even need to investigate, ITS ALL PARADED ONLINE DAILY.",
                "author": "magaboom"
            },
            {
                "raw_content": "Well? We’re waiting…..",
                "author": "Petes_Agate_Israel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cool story bro",
        "score": 695,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When did we start liking Republicans? Did u fuckers forget they funded Biden without question while he fucked the country for 4 years? Did we forget them handing Ukraine an Israel 200 billion while saying we don't have 5 billion for the wall? The fuck is wrong with you people?",
                "author": "DaayTerkErJerbs"
            },
            {
                "raw_content": "Haha! Suck it Elon, you little faggot!",
                "author": "Internet_hugs"
            },
            {
                "raw_content": "> I am become Jill Stein, destroyer of recounts.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What a difference a day makes....",
        "score": 990,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Couldn't Barron just walk over and look around.",
                "author": "cyberrigger"
            },
            {
                "raw_content": "That's my President.",
                "author": "Anyone"
            },
            {
                "raw_content": "Federal judge just ruled that the president has no authority to order the military to perform rescue operations and those rescued should be thrown back into river and drowning.",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An Alvarado Police officer was shot in the neck after police were lured to the ICE facility by masked extremists in black who attacked cars and security cameras. Antifa and far-left extremists have been urging people to murder police & ICE agents.",
        "score": 1225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So start shooting these terrorists.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "We need Stand Your Country laws.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Arrest Hakeem Jeffries for inciting violence",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: 264 wanted criminals arrested in New Jersey as part of Operation Apex hammer, led by US Attorney Alina Habba and US Marshal Juan Mattos Jr.",
        "score": 860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now arrest the judges who have been putting them back on the streets for years and years.",
                "author": "JohnnieGitYerGun"
            },
            {
                "raw_content": "**I VOTED FOR THIS**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Turns out the solution for solving crime was to just enforce the fucking law",
                "author": "TheAttackTitan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on Powell: \"I'd love him to resign ... he's a stupid person.\"",
        "score": 1130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love Donald Trump, lol.",
                "author": "Walt_Kowalski"
            },
            {
                "raw_content": "Powell is a Shylock",
                "author": "Deadpool"
            },
            {
                "raw_content": "I miss this language so much. The language of my youth. The straight talk. \"He's a stupid person\". Short, to the point and accurate. Its up to us to bring it back.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How retarded do you have to be?",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are MORE Dems than Republicans going to join? If NOT... it's a PSYOP. You people are goddamn retards when it comes to math.",
                "author": "SirPokeSmottington"
            },
            {
                "raw_content": "Already fell for the patriot act. Fool em, you don't get fooled again.",
                "author": "utfanx2"
            },
            {
                "raw_content": "It's a party for H1Bs wanting to stay on in America. hence the 'America Party!!!' It's a party in America for them alright.",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sources tell me OBAMA's fingerprints are all over Brennan's post-2016 election Intelligence Community Assessment/Putin-Trump frameup scandal",
        "score": 1463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone already knew this.",
                "author": "TheBaconStopsHere"
            },
            {
                "raw_content": "Restart the countdown to 2 weeks!",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "The CIA and the FBI tried to assassinate Trump. Convince me I'm wrong",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rent free in Xim/Xer's head 🔥🤡",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All considered, those are pretty great dolls.",
                "author": "BarneyFrank"
            },
            {
                "raw_content": "She has way too much time on her hands. Get a real job damn.",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "There really has to be something wrong with your brain if you put this much effort into someone you dislike.",
                "author": "2Clutch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HELLO SAAR PLEASE DONATE",
        "score": 689,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nooo do not redeem the Amazon gift cards",
                "author": "live3ordye"
            },
            {
                "raw_content": "Legal immigration is still replacement immigration.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Why can she slap?",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Wakanda Not Forever] Akon’s $6 Billion ‘Wakanda’ City Abandoned – Only a Welcome Center Got Built",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wakanda crap is this?",
                "author": "magaboom"
            },
            {
                "raw_content": "We wuz Wakandans.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Probably $6B US taxpayer dollars and USAID got cut-off.",
                "author": "Hammond"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : “This We Will Defend.” 🇺🇸 @SecDef Pete Hegseth delivers a powerful message on service, sacrifice, and the revival of the American warrior spirit under President Trump.",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hot Damn. I would follow that man into battle.",
                "author": "gotyer6"
            },
            {
                "raw_content": "What a fucking clown Austin was…",
                "author": "Constitution_1788"
            },
            {
                "raw_content": "Glad to see a bunch of faggots wont be on our front lines anymore",
                "author": "Paydro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I WILL F**K YOU UP\" Caught on Camera: NYC Heroes Deliver Street Justice to Subway Predator",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Virus website",
                "author": "CyanScales"
            },
            {
                "raw_content": "Shit link do not click.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "u/Mods, please remove this adware shit link and ban the poster",
                "author": "NoMaskNoMaster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Presler responds to Elon \"I am staying as a Republican\".",
        "score": 744,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's right, it's why Trump ran as Republican. It's a two party system and our only viable path is to reform the Republicans into MAGA",
                "author": "RolandDelacroix"
            },
            {
                "raw_content": "Link https://x.com/ScottPresler/status/1941617348118470685",
                "author": "Hammond"
            },
            {
                "raw_content": "3rd parties do not work. Our system works when it's actually adhered to because it forces a choice: this or that. No waffling in-between. No one-issue voters. Gotta vote for the whole platform.",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The ICE tracking app creator just dared us to hold him accountable!",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its called obstruction.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Lulz the first amendment doesn't protect obstruction and impediment with federal officer enforcement.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "When you're aiding and abetting criminals your rights don't matter other than remaining silent and having access to an attorney.",
                "author": "KE948_U2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Crockett (D) slams deportations: \"How would it feel if countries sent people to our country!?\" 👀",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ignant. Full stop.",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "Absolute retard.",
                "author": "Dem2MAGAConvert"
            },
            {
                "raw_content": "She has to be trolling",
                "author": "Yignuced"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Crazed Rosie O’Donnell Marks July 4 in Europe by Hinting at Revolution Against Trump Admin.",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put her fat fucking ass on the permanently banned for terrorism list. Tell Rosie to permanently fuck off",
                "author": "Deadpool"
            },
            {
                "raw_content": "Why would we sticky the opinions of unAmerican lunatics? Amplifying their voice only gives them the power and attention they crave. Just ignore these irrelevant has beens and move forward.",
                "author": "goat_nebula"
            },
            {
                "raw_content": "Leaves the country to get away from Trump, talks about Trump nonstop! Rent free 👌",
                "author": "Just_An_Idahoan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They can't make him look bad",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Barron's actual height",
                "author": "TioVanilla"
            },
            {
                "raw_content": "They should unironically replace the Statue of Liberty with a statute of President Trump. And throw that shitty poem in the garbage where it belongs.",
                "author": "dogofwar"
            },
            {
                "raw_content": "the economist are fascists exploiting slaves in China",
                "author": "snoopy3210"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASUS Ascent GX10 with GB10 Blackwell Superchip launches July 22, marks NVIDIAâ\u0080\u0099s entry into 'desktop CPU' market",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any info on how big and the performance level is this thing? I'm assuming this is project Digits. The only unreliable info I found is some speculative very old mlid video that its basically an ARM Strix Halo APU (80-120W and 4070M-level gpu.) Curious about the intended target audience, as it doesn't seem to be a mature or practical as gaming platform. Also, I'm uncertain about the market demand for AI-based development tools for something with this performance level.",
                "author": "fatso486"
            },
            {
                "raw_content": "Article is wrong I think? The DGX Spark is $4k. Only partner ones (e.g. this Ascent GX10) start at $3k.",
                "author": "wywywywy"
            },
            {
                "raw_content": "At least it runs Linux, meaning I expect Nvidia's Linux support to keep improving...",
                "author": "jorgesgk"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What DLSS 4 Mode Should You Use? - Quality vs Balanced vs Performance",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Basically, yes turn it on to get the frame rate you want, then if the small shimmering on fine patterns or around characters is distracting, turn it up one quality level until it's not as obvious. Overall DLSS4 is very good at preserving texture and image quality.",
                "author": "ikkir"
            },
            {
                "raw_content": "With how decent upscaling/temporal reconstruction has gotten, and how popular OLED has become on the monitor market, we desperately need (good) dynamic resolution implementations in PC titles. OLEDs have issue with VRR, dynamic res would minimize these issues, while good upscaling would get rid of obvious image quality steps when resolution adjusts.",
                "author": "ClearTacos"
            },
            {
                "raw_content": "Here are [his recommendations](https://youtu.be/qyGClSlO8Ck?t=827): 1080p: quality 1440p: quality or balanced 4k: balanced or performance",
                "author": "Crimtos"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Machines & More] ID Cooling's IS-77-XT tested in the Fractal Terra... it's a winner!",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only case where a 77mm CPU cooler makes sense",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why aren't more companies focused on developing and producing magnetic levitation fans?",
        "score": 0,
        "text_content": "From a theoretical perspective, magnetic levitation fans have the best longevity, noise levels and performance. So why aren't more companies, like Noctua, Arctic, Phanteks, and so on, focused on developing and producing magnetic levitation fans?",
        "comments": [
            {
                "raw_content": "I use Sunon maglev fans in (a subset of) the networking products I design. I'm aiming for a multi-decade service lifetime though. The manufacturers the OP mentioned are aiming at products that have a \\~1/2 decade lifetime, making the maglev extended lifetime feature moot. Maglev fans can only achieve that extended lifetime if they're running continuously, or at least don't stop and start very often. That's because they only \"fly\" when they're running above a certain speed, and they can wear worse than a sleeve bearing fan when they're not flying. Maglev fans would not be a good fit for something like my laptop, which seems to stop and start its fan(s) quite often.",
                "author": "Allan-H"
            },
            {
                "raw_content": "I don't think fan performance is limited by what technology they use rather than quality and expense put into the R&D and production. From consumers' perspective, 99.9% of people buy cheapish middling performing fans. The market is small. Durability is almost never a consideration for consumer pc fans. Excellent noise/performance can be achieved with normal bearings when you scale cost into higher quality productuon and R&D. The result is noctua fans. The best noctua fans from what I've read online seem to outperform any ML fans at similar (high) costs per fan. Maglev does not automatically mean better performance than bearings. Developing a different technology might not be worth the cost when the benefits are undetermined in terms of the output cost/performance product.",
                "author": "EndlessZone123"
            },
            {
                "raw_content": "Corsair has released some. Their recent fans are dubbed 'mag lev' anymore, but rather 'Magnetic Dome bearing'. Not sure if this is different or not, but this is what the LX120/140 have.",
                "author": "GoombazLord"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Used a bunch of trade-ins and finally got my Switch 2 Pro Controller",
        "score": 980,
        "text_content": "I was surprised by how much I got for my Wii U trade-in. $79.20 with the Pro membership. Loving this new controller.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/e1f7tdgt85bf1.png?width=561&format=png&auto=webp&s=b57025ac385b5de756a4d2ca7c1c279bab8cfdb3",
                "author": "AssGagger"
            },
            {
                "raw_content": "RIP Wii U",
                "author": "WitheredTechnology"
            },
            {
                "raw_content": "So a pro controller is worth more than a wiiu it seems",
                "author": "Dude-arino7526"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I was not prepared for Waluigi telling me to suck it",
        "score": 549,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo was so cool in the early 2000s",
                "author": "Careless_Symphony"
            },
            {
                "raw_content": "I love that people are seeing this for the first time in 2025. Lol As a kid, and even now, Waluigi is my main in Strikers just because he does this.",
                "author": "GrimmTrixX"
            },
            {
                "raw_content": "![gif](giphy|xT4Apvuo4QoOX1gzEk|downsized)",
                "author": "Bootybandit6989"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 has been out for a month. Have you used GameChat at all?",
        "score": 67,
        "text_content": "Curious if anybody has genuinely used this feature. They built it up so much in all the promos, but I haven’t tried it out once and honestly have no real need to at the moment.",
        "comments": [
            {
                "raw_content": "Probably would’ve tried if I knew a single other person who has a Switch 2.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "I have no friends so game chat is useless for me.",
                "author": "Mobius650"
            },
            {
                "raw_content": "Almost every time I needed to click on the Home button on the Pro Controller.",
                "author": "jonjonijanagan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m playing Mario Kart World every day, so I guess it was a good launch game",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, I love it",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I have been having a blast. Find myself legitimately laughing as I’m playing the game. But I will admit, having some (more?) circuit races thrown into the mix is a must. I like the new formula a lot, but having some lap races to bring in the Mario Kart gameplay we have loved for 30 years should be a top priority. (IMO)",
                "author": "FarSandwich3282"
            },
            {
                "raw_content": "For me, the joy is in the pick up and play. Play for 30 minutes, move onto something else.",
                "author": "ollielite"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm convinced at this point that Switch 2 haters are intentionally being ignorant",
        "score": 343,
        "text_content": "The sheer amount of FUD regarding Nintendo \"bricking\" the console. People saying, \"you don't own it\" ad naseum. Falsely stating that the games are $90 (USD) or that the console is \"double/triple the cost of the first one.\" With the abundance of correct information easily available at our fingertips, I think Nintendo haters would rather just remain ignorant because it's fun to hate on Nintendo.",
        "comments": [
            {
                "raw_content": "its just what social media has degraded to. everything new gets shit on, toxic behaviour everywhere etc. best to ignore and just have fun with whatever you like.",
                "author": "Few-Strawberry4997"
            },
            {
                "raw_content": "What the hell is a FUD?",
                "author": "CynicalDutchie"
            },
            {
                "raw_content": "Because it’s the internet. People typically on the internet have nothing better to do, so they hate.",
                "author": "magnitude7711"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch family photo",
        "score": 392,
        "text_content": "Dug out my switches for a comparison of size / screens.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hpoc4fygp4bf1.jpeg?width=3024&format=pjpg&auto=webp&s=7c3d42e9c3c25beee336e8f28adc75a7b725322c I did the same thing the day the Switch 2 launched. I’m missing my V1 in that photo.",
                "author": "Galactus1701"
            },
            {
                "raw_content": "Oled barely changed the size",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Mini mushroom No mushroom Super mushroom Mega mushroom",
                "author": "Conscious_Unit190"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 3D Printed Dock Faceplate from Etsy",
        "score": 115,
        "text_content": "Got this cool 3D Printed Hylian Shield Switch 2 Dock Faceplate off of Etsy! Shipped from France and took about 3 weeks to get to me in the US. Item Link: https://www.etsy.com/listing/4314445071/?ref=share_ios_native_control",
        "comments": [
            {
                "raw_content": "That's actually the design of one of the nintendo 2DSes! I bet anyone that has that DS would feel nostalgic having this dock, good find!",
                "author": "keiiith47"
            },
            {
                "raw_content": "$40 US dollars nope",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "Quick aside, what protector are you using for the body and joycons of the switch?",
                "author": "Linkster9"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: Don't buy the dbrand travel case. It could scratch your Switch 2 screen",
        "score": 352,
        "text_content": "https://www.reddit.com/gallery/1lru4cy Posted from the dbrand subreddit: >When putting the travel cover into place, it's very easy to cause it to use the screen of the Switch as a fulcrum. >Dbrand keeps commenting that when the travel cover is in place, there is a gap that prevents contact and that's true, but the design of the travel cover forces you to put the top in first and then lever it down into position. This is not a tolerance issue, this is a design flaw that can harm your console. >Even if you are using a screen protector, it is likely that this levering motion could displace it. **Edit: Attention dbrand fanbots. This is not my photo. I wouldn't touch anything from dbrand even if they paid me, nobody should.** https://www.reddit.com/r/dbrand/comments/1lru4cy/travel_cover_defect_no_dbrand_acknowledgement_of",
        "comments": [
            {
                "raw_content": "They’ve got some real geniuses designing products at dbrand, sheesh",
                "author": "PhattyR6"
            },
            {
                "raw_content": "I’m perfectly happy with my unbranded $17 Amazon slim case and $8 glass screen protector (4 pack so I have spares). The case has a felt pad that goes over the screen and holds games on the other side. Not sure why dbrand with their infinite wisdom decided to build their case this way.",
                "author": "will_s95"
            },
            {
                "raw_content": "I was a first time customer. Already returning the product and never purchasing from them again. The experience has been absolutely horrible. Ignored by their support. Calling the customers the \"problem\" for their grip problems, even though they left no space between the joy con and the switch (which is mandatory for the magnetic pull), and blamed us for holding it wrong lol. Worst experience ever. And for 110$ I expected something premium. And it is true. The travel cover scratches the screen. The dock scratches the switch. The dock DOESN'T WORK in most cases either. But obviously they don't care about those problems at all.",
                "author": "JaPaTF"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Potential leaked footage of Damian Wayne Batman game",
        "score": 507,
        "text_content": "https://xcancel.com/ArkhamChannel/status/1941402164015845575 [Original video where this footage came from, timestamp is 8:13](https://www.youtube.com/watch?v=NiOnyKLYCrY) Footage shows Damian Batman and Killer Croc on bikes in a chase scene. The Killer Croc model is a placeholder from AO. Can we get a Jason Schreier expose piece on what this game would've been like 🙏",
        "comments": [
            {
                "raw_content": "i watched canceled sly cooper movie trailer last night. this canceled gaming projects timeline sucks actually",
                "author": "ltonystarkl"
            },
            {
                "raw_content": "Interesting that Killer Croc is back to human size here. In Arkham Knight he was HUGE, and a lot more animalistic. Edit: Also Damian’s suit seems to use Arkham Knight’s Batman Beyond suit as a placeholder",
                "author": "Different-Aspect-449"
            },
            {
                "raw_content": "Jesus how long of a tail is this game gonna have? It’s been years of leaks for this game lmao. I’ve never seen a cancelled game leaked this much.",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Finally Switched back to an AMD GPU after like 8 years with Nvidia.",
        "score": 135,
        "text_content": "Picked up a Asrock Rx 9070 XT Steel Legend. For $699 to replace my 3070ti that I got in 2021, my first GPU when I got back i to PC Gaming was a Radeon HD 7770 and then I got an HD 7950 and I switched away to a RTX 1060 when the 10 series hit, been team green since, I've only ever owned AMD CPUs, and with the horrible price to performance on the 5070ti, I jumped at the chance to go back to team red. Very happy thus far!",
        "comments": [
            {
                "raw_content": "Sick looking build!",
                "author": "KirbyAir_is_Life"
            },
            {
                "raw_content": "I finally switched to AMD GPU and CPU after all these years with Intel and Nvidia. Go team red",
                "author": "Melodic-Read-1167"
            },
            {
                "raw_content": "It looks great. I returned to AMD GPUS last month too, after 10 years of nvidia gpus. I feel it was a great decision!",
                "author": "sahui"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Zen 6 Gaming Chips Rumored To Top 6GHz And Flex Up To 240MB Of L3 Cache",
        "score": 417,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "![gif](giphy|6oFNB3JPuLpAs) Yeeee zen 6 rumors! \\* looks inside \\* MLID rumors..",
                "author": "Glodraph"
            },
            {
                "raw_content": "How are people still believing in what MLID says? His \"leaks\" are so far from true that might as well guess. I’d even say that most educated guesses are accurate that his leaks.",
                "author": "luuuuuku"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "SAPPHIRE launches NITRO B850A and B650A motherboards",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yay sapphire is back to making motherboards. They used to make them a really long time ago if I remember correctly. More choices are good. If the boards are even half as good as the current GPUs they make this is gonna be good.",
                "author": "-hjkl-"
            },
            {
                "raw_content": "pcie slot in the first position on an ATX board, interesting, not very common.",
                "author": "riba2233"
            },
            {
                "raw_content": "These are only for the Chinese market sadly. But, luckily Newegg has em stocked sometimes. I remember seeing their AM5 boards being sold on NE by Sapphire directly...so I hope these follow suit. Also, the X870 board was announced but not shown...so hopefully that one will see light outside of the East? I hope so! Be nice to pair my Nitro+9070XT with a X870 Nitro+ board. Sapphire has been as close as the \"EVGA\" side of AMD for quite awhile. I've only ever used their cards with zero complaints. Quality build and materials, and the few times I've contacted their customer support for an extra fan it's always been easy to get em shipped (for no charge either, which is nice.)",
                "author": "DwarfPaladin84"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor updates Radeon RX 7600 Fighter series with larger cooler and DP 2.1 support",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rx 6600 fighter here, had a lot of issues with delta temps and hotspot. I finally moved the card to an old i7 6700K at 1080p and locked the fps to 60, and now 0 issues. (Repasted with mx-6) But when it was used hard it was not properly cooled.",
                "author": "dsinsti"
            },
            {
                "raw_content": "I have a rx7600, works fine",
                "author": "Tenchi1128"
            },
            {
                "raw_content": "Rx7600 here, stability is ok, 8gb vram really holds the card back, can oc to 2900mhz. If u tune settings to under 8gb things work pretty good. 64c hot spot 90c, stock paste, up to 85% fan speed",
                "author": "Souritos"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "26% Fewer Canadians Are Searching For Homes in the U.S. Than Last Year",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do we let non-citizens buy houses in the US anyway?",
                "author": "brainrotbro"
            },
            {
                "raw_content": "Good! Foreign investments in family housing should be banned!",
                "author": "AZ07GSXR"
            },
            {
                "raw_content": "The number of Redfin.com users based in Canada searching for U.S. homes to rent or buy fell 26.4% from a year earlier in May. That’s a sign that fewer Canadians are moving south of the border or seeking vacation homes in once-popular destinations like Miami and Phoenix. Fewer Canadians are searching for homes in the United States than they were at the start of 2025, before the U.S. instituted steep tariffs on Canada and relations between the two countries started suffering. The number of Canadian Redfin.com users searching for homes in the U.S. on Redfin.com dropped 26.4% year over year in May. For comparison, the total number of prospective buyers and renters searching on Redfin.com declined, too, but by a fraction of the amount. Canadians searching for homes in U.S. destinations started declining significantly in February, when the White House implemented 25% tariffs on imports from Canada and Mexico. The drop was especially steep in April, the month the Trump administration announced its vast global tariff policy, falling 34.2% year over year. This is according to an analysis of the number of Redfin.com users based in Canada searching for homes for sale and for rent in the United States. The data is based on unique users, i.e. the number of different people who access U.S. home listings on Redfin.com or the Redfin app within a defined period; that user is counted only once for the period. The decline in Canada-based searches for U.S. homes coincides with some Canadians growing disillusioned with the United States. Shortly after President Trump took office in January, he instituted high tariffs on goods from Canada, and made comments about making Canada the “51st state.” In addition to trade concerns, the Canadian dollar has been relatively weak this spring, making it harder for Canadians to afford already-expensive U.S. real estate. “Normally I work with about five Canadian buyers each spring, mostly older folks looking for a second home. This year, there were none,” said Heather Mahmood-Corley, a Redfin Premier agent in Phoenix. “I actually helped a Canadian sell their Phoenix home earlier this year. People from Canada are retreating from owning real estate in the U.S. because of political tensions; some of them are worried it will no longer be practical to travel back and forth between the two countries, and some don’t want their money tied up in the U.S. But also, we’re not seeing as many snowbird buyers in general; I’ve noticed older people are more concerned about their stock portfolios and 401Ks as the economy fluctuates.” Historically, Canadians have made up the largest portion of international homebuyers in the U.S. In 2024, for instance, Canadians made up 13% of foreign buyers, snapping up $5.9 billion worth of U.S. real estate. Fewer Canadians Are Searching For Homes in Nearly Every Major U.S. Metro Area On a metro level, fewer Canadians are searching for homes in all but two of the 50 largest U.S. metros. The biggest declines in Canadians looking for U.S. homes are in big cities: Canadians searching in Houston dropped 55.2% year over year in May, and dropped 53% in Philadelphia and 47% in Chicago. Significantly fewer Canadians are searching in warm places that typically attract a lot of Canada-based second-home buyers. The number of Canadians searching for homes in both Miami and Orlando declined by about 30% year over year in May. Canada-to-Phoenix and Canada-to-Riverside (Palm Springs), CA both declined by about 23%. “I haven’t worked with a Canadian buyer in at least a year,” said Marsha McMahon-Jones, a Redfin Premier agent in Palm Springs. “I’m in touch with a few potential buyers, but they’re staying put in Canada for now with the idea of potentially making a move if and when Canada-U.S. relations improve. I haven’t heard of any Canadians who already live here part of the year listing their Palm Springs home, though.” Those second-home destinations followed a similar pattern as Canada-to-U.S. Redfin.com users overall, with sharp dips in April and slightly smaller but still significant dips in May. It’s worth noting that the housing market in Florida, a popular destination for Canadian buyers, has cooled for American and foreign buyers alike. Fewer people are interested in buying homes in Florida–particularly coastal parts of the state–as insurance costs soar and climate disasters intensify. Housing markets in Phoenix and Riverside have also cooled, though to a lesser extent.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Canadian Buyers Are Dropping Out of the U.S. Housing Market",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Americans are also dropping out of the US housing market",
                "author": "diducthis"
            },
            {
                "raw_content": "If you are American, you cannot buy land in many other countries. However, it seems the entire world has their fingers dipped into our housing market.",
                "author": "Not_a_bi0logist"
            },
            {
                "raw_content": "Great? lol More houses for Americans.",
                "author": "Tricky-Cod-7485"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else sharing housing with family in order to survive?",
        "score": 236,
        "text_content": "I’m in my 50s. I thought I did things right. I got an education, I’ve worked since the age of 15 and I am tired. I have my grown children living with me. My two grandchildren and my mother in law also live with me. There are 10 of us total. My kids are trying their hardest to launch but our American society has made it near impossible. How is it that I’m worse off than my parents? I feel like only those that cheat get ahead. Is it all rigged????",
        "comments": [
            {
                "raw_content": "Everyone in SoCal who’s not incredibly rich or living with 5 roommates.",
                "author": "supervillaindsgnr"
            },
            {
                "raw_content": "Most of the world outside of the US and Europe, really. We are the exception, not the norm.",
                "author": "I_Am_Mandark_Hahaha"
            },
            {
                "raw_content": "The system is broken and built for the rich. Now we are realizing that we are simply the peasants to the elites. We are a resource for them to harvest. Sounds crazy, but it looks that way in your accounting, and it feels that way in your heart. Sure does for me. Anyone else?",
                "author": "XamosLife"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Listings, Pending Sales Fall As Home Prices Hit Another All-Time High",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "New listings fell 1% year over year during the four weeks ending June 29, the first decline in nearly six months, with would-be sellers taking notice of slow demand. But it’s worth noting that the weekly average mortgage rate fell to 6.67%, its lowest level since early April.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Maybe one has something to do with the other:o",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Should I lower my price after two weeks?",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Correlation between homeprices and change in inventory",
        "score": 1,
        "text_content": "I've seen a lot of people stating that there is a certain level of inventory that would suggest trouble is coming for the housing market. It seems commonly excepted that an inventory of 6-7 months of supply would make a marked into a buyers market. Just a quick note that imho it's the speed and direction of the change in inventory that counts: https://preview.redd.it/seqw0y6vb1bf1.png?width=664&format=png&auto=webp&s=4dce442dffcb9a90df8acfe7b7ba7ec362541b0d Works well for the Dutch housing market too: https://preview.redd.it/hdsjue1ra1bf1.png?width=823&format=png&auto=webp&s=a8068f346cb4b2c8abd1beb26e57fc97530df04a Oh, and btw. Dutch and US market have been quitte in sync for a while now. Makes you wonder how much effect local or national policies have https://preview.redd.it/nwau1wiib1bf1.png?width=823&format=png&auto=webp&s=5bdc0e9f6d4634d89cf5d8bab85c9f5dfbb3c58a Feel free to reproduce with Rstat: https://preview.redd.it/gyd3n690c1bf1.png?width=1181&format=png&auto=webp&s=3cfde3dd53955b4efc5df4bd41f5f2923430be90",
        "comments": [
            {
                "raw_content": "I believe 6 months inventory used to indicate a neutral market, ie. supply meets demand. There's probably something in what you say regarding the correlation between the pace of supply and price, but these are both slow and lagging variables. A lot of other things can happen in that time, such as a change of interest rates, a recession, and so on.",
                "author": "Scared-Champion-1656"
            },
            {
                "raw_content": "That first chart seems off - where/what is your Case Shiller line? The [actual Case Shiller](https://imgur.com/a/yVVAE9Q) shows a steady increase not the peak and drop yours does.",
                "author": "pdoherty972"
            },
            {
                "raw_content": "I’m noticing that even after a huge listing spike around 2023, the home price index y/y barely went negative",
                "author": "tillZ43"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "lol...",
        "score": 273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"deny knowing Ghislaine Maxwell\" lol",
                "author": "sassydodo"
            },
            {
                "raw_content": "I think, that Elon, totally oblivious, is sabotaging his own creation. And will therefore lose the AI race bigly.",
                "author": "notAbrightStar"
            },
            {
                "raw_content": "[https://x.com/grok/status/1941730038770278810](https://x.com/grok/status/1941730038770278810) fuck its real",
                "author": "NomzStorM"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I guess money does talk",
        "score": 1087,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If someone offered you enough money for not just you, but for your entire family for generations, just to do the same thing you were already doing, you would take it. No one is going to say no to instant generational wealth, just for switching employers. If you think you will, you won't.",
                "author": "Smallermint"
            },
            {
                "raw_content": "[There's no $100M signing bonus.](https://www.ndtv.com/offbeat/did-meta-offer-100m-signing-bonus-ex-openai-employee-replies-to-sam-altmans-claim-8800714) That figure is either exaggerated or likely tied conditionally to the achievement of very specific milestones.",
                "author": "StackOwOFlow"
            },
            {
                "raw_content": "That photo of Sam is killing me hahahaha",
                "author": "CodeSpecific3133"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Academia is cooked",
        "score": 693,
        "text_content": "Explanation for those not in the loop: this is a common prompt to try to trick LLM peer reviewers. LLMs writing papers, LLMs doing peer review we can now take humans out of the loop.",
        "comments": [
            {
                "raw_content": "I am not in the loop, so it leaves me wondering. Are these instructions normally visible to a human reader of the paper? Or are they written in some sort of “invisible ink”, only visible to the machine?",
                "author": "Redducer"
            },
            {
                "raw_content": "These are arcxiv prepublications, they haven't been peer reviewed by a journal.",
                "author": "M44PolishMosin"
            },
            {
                "raw_content": "![gif](giphy|R9cQo06nQBpRe)",
                "author": "Perdittor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "State of current reporting about AI",
        "score": 241,
        "text_content": "Paper in question: [https://arxiv.org/abs/2506.08872](https://arxiv.org/abs/2506.08872)",
        "comments": [
            {
                "raw_content": "Misinformation will always be our downfall",
                "author": "Beeehives"
            },
            {
                "raw_content": "I mean it is deceptive but it probably is true. Your brain won’t be as trained as if you had done the work yourself",
                "author": "Serialbedshitter2322"
            },
            {
                "raw_content": "But what can you do? It's quoted in the Hill!",
                "author": "KeikakuAccelerator"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mark Cuban: The world's first trillionaire could be ‘just one dude in the basement' who's great at using AI",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, no. It's going to be one of those guys that currently have hundreds of billions and are great at stealing your private data. Such as your social security and tax information.",
                "author": "drubus_dong"
            },
            {
                "raw_content": "Billionaires seem to love selling the dream don't they. And it always seem to be that if you're not a billionaire it's solely because you didn't utilize the tools available to you effectively. It's your fault.",
                "author": "orderinthefort"
            },
            {
                "raw_content": "![gif](giphy|PjU0WtzRVbQUO4qe6v)",
                "author": "EY_EYE_FANBOI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CEOs Start Saying the Quiet Part Out Loud: AI Will Wipe Out Jobs. It will replace ‘literally half of all white-collar workers’",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "A Principal Manager in one of the largest companies in my country told me a couple weeks ago they just presented and approved by the CEO a plan that will reduce their headcount by 70% before 2028 in favor of ChatGPT. We are absolutely fucked.",
                "author": "Ensirius"
            },
            {
                "raw_content": "RUN",
                "author": "Dangerous-Sky-6496"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI ≠ Apple intelligence",
        "score": 530,
        "text_content": "From AshutoshShrivastava on 𝕏: [https://x.com/ai\\_for\\_success/status/1941492901839815150](https://x.com/ai_for_success/status/1941492901839815150)",
        "comments": [
            {
                "raw_content": "Lol, why isn't Meta in the picture?",
                "author": "Necessary_Image1281"
            },
            {
                "raw_content": "\\> \"ai isnt intelligent\" \\> looks inside \\> worst performing ai \\> even worse than open source LLM's https://preview.redd.it/wk5u3deya2bf1.png?width=480&format=png&auto=webp&s=2f721d5e78209e30210cb27f935536b42dba314d",
                "author": "SnooRecipes3536"
            },
            {
                "raw_content": "I mean it's ass but it's not like I expect a lot from an AI that is designed to run locally on a phone and leave some resources for the user apps at that lol",
                "author": "abbbbbcccccddddd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "@Grok please verify this",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear it’s just bots commenting that shit now. I saw a local news report of a heatwave coming and two people asked grok if it was real",
                "author": "Notallowedhe"
            },
            {
                "raw_content": "This isn't a meme page.",
                "author": "ComatoseSnake"
            },
            {
                "raw_content": "This sub is deranged about grok",
                "author": "jdyeti"
            }
        ],
        "subreddit": "singularity"
    }
]