[
    {
        "post_name": "Students at @QCSD_Schools reportedly ARRESTED after 35 students stormed out of school to protest ICE despite the walkout being canceled. The school was then placed in a lockdown. Law enforcement officials report that the students engaged in \"unsafe and disruptive behavior in town.\"",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Filthy gorillas. # GOD BLESS OUR ICEMEN!",
                "author": "ConfederateMaster"
            },
            {
                "raw_content": "Why not just arrest the principal instead? He's the one creating that dangerous situation.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "Complete with dipshit lib voiceover and requisite shrill white lib female screech Quakertown smh you’ve come a long way",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Emails prove Attorney General Merrick Garland lied when he said that the decision to raid Mar-a-Lago was his and his alone. The raid was, in fact, orchestrated and ordered by President Biden’s White House.",
        "score": 956,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will Pam actually do something tho?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "There was no “President Biden”. That was the illegitimate Brandon Administration.",
                "author": "Skogin"
            },
            {
                "raw_content": "Jail him for perjury. He lied about the BIGGEST action done by the DOJ in US HISTORY.",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Immigration destroyed our country in 60 years.",
        "score": 867,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This cunt can fuck right off. How about you leave our fucking Country you ugly bitch? We don't owe your faggot ass a thing.",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "I am reminded of Ted Kennedy’s speech during the debates over the immigration law changes in the 1960s: “immigration will not change the culture or the fabric of our society…”. What a lying, murdering piece of shit he was. :(",
                "author": "SteelDriver"
            },
            {
                "raw_content": "I miss 60/70/80s democrats.... (not really - but now is insane)",
                "author": "FLIBS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It sues & wins $500 because salon website has only man or woman as choices for gender in reservation system. I guess they’ll need to add ‘wierdo’ as another choice.",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a bunch of fucking degenerate faggots. Back before Trey and Matt turned into cock smokers, they were dead nuts on with Canadia and their depictions of them being trash cans.",
                "author": "ConfederateSlave"
            },
            {
                "raw_content": "I hate these people so much... They destroy everything.",
                "author": "HillarysFUPA"
            },
            {
                "raw_content": "Really must have been nice to grow up in the best time ever, cause it ain't now. Yeah, the '60s had the Vietnam War, but they only recognized two genders. Young people didn't have a device in their pocket telling them what to think about everything.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republicans are so disloyal to themselves! Unite, stick together, and WIN! President DJT",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Disloyal to us. The citizens who elected them.",
                "author": "airborne3502"
            },
            {
                "raw_content": "\"Themselves\" ... poor choice of words. They report to We The People. PERIOD. And yes, they are disloyal / traitorous scum to We The People.",
                "author": "TrumpIsMyyPresident"
            },
            {
                "raw_content": "Bro, most Republicans in government ARE NOT REPUBLICANS! The people who vote for them are idiots and don't know how to tell the difference between real Republicans and Democrat LARPers.",
                "author": "Ghostphaez"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: What happened today with the two United States Supreme Court Justices that I appointed against great opposition, Neil Gorsuch and Amy Coney Barrett, whether people like it or not, never seems to happen with Democrats. They vote against the Republicans, and never against themselves.",
        "score": 985,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So true. Lib justices always vote for the LIB side unless it’s a non political case where it could be 9-0. It’s always the republican appointees who are swing or questionable votes (Day-O’Connor, Kennedy, Roberts, Coney-Barrett, Gorsuch, Kavanaugh). Never is a Dem appointee a swing vote.",
                "author": "couranto"
            },
            {
                "raw_content": "Maybe stop listening to The Swamp that wants to destroy you, Mr. President. Scorched earth from this point forward.",
                "author": "RiolindasReturn"
            },
            {
                "raw_content": "Amy should have to register as a Democrat she votes like a liberal.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canada is the 2nd largest country on Earth, with unlimited levels of oil, nat gas, hydro electricity and minerals relative to the size of their population (1/10 of USA). Justin Trudeau & Mark Carney have messed it up so badly that Canada is now poorer than Alabama.",
        "score": 1017,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Average home in Canada is over $1 million USD! $450k average in USA. And we have way more selection than they do, so avoiding $450k isn't very hard. Canada is fucked in every which way, and their hatred of Americans will be their downfall. I always loved Canadians, still do honestly. I'm only 1.5 hours from Niagara falls, but it's such a shame what's happened to that nation =*( Been ravaged overnight.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Canadian here, well Albertan, so it's a bit different here. We have tons of oil and gas money, but it literally funds the rest of the countries liberal agenda and were poor as fuck too. There's simply no getting ahead these days anywhere in this country. The state of the world, especially my \"country\" is an absolute shit show as soon as it's my turn to be an adult lol.",
                "author": "Tayzey123"
            },
            {
                "raw_content": "Alabama catching strays.",
                "author": "AbrahamLincoln"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These are the scumbags responsible for bringing the case against Trump’s tariffs. The Woldenberg family who owns Illinois-based ‘Learning Resources’ and imports Chinese toys to sell for steep profits. “We’d like our money back.” Everyone should boycott this business.",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once again, Everyberg Singlestein Timeowitz.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "Woldenberg There's a fucking shock. I never set out to be an anti-semite, I even fought against it in my youth, but sooner or later you can no longer ignore the truth.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "More bergs destroying America. What a shocker.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump just RAISED Tariffs EVEN HIGHER. There will be no refunds kids. Laugh at the fake news. Lutnick's sons lost their bet.",
        "score": 1451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the Epstein connections weren't enough, the fact that Lutnick betted at all should be grounds for termination.",
                "author": "Eyer0ll"
            },
            {
                "raw_content": "Can't Stump the Trump",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The last 6 hours here are one good example of why emotionally unstable Zilennials addicted to AI assist that just points them right to wiki 90% of the time are still just as retarded as they were without it. Fucking losers.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somalis in Minneapolis demand $200 million in reparations for business closures and community trauma",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck off toothy",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "No, they all have to go back.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Best we can do is a 50 lb sack of rice and a box of bananas.",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The SCOTUS ruling is about what a President can and cannot do, setting precedent for all presidents, not just Trump. Congress and SCOTUS have been trying to weaken the executive branch for at least 100 years. It's the only branch with term limited elections.",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Supreme Court didn't say he can't tariff, they just said he can't use that specific method. Come on now.",
                "author": "viralriot"
            },
            {
                "raw_content": "The judicial branch needs to be knocked down, lawyers and judges are destroying the world.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Brother, the chief executive of today is so so so much more powerful than the chief executive of 100 years ago.",
                "author": "YouEssAye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They're about to wish they hadn't set this precedent",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Satan called. You're late, Joe. 👹🔱🔥",
                "author": "MythArcana"
            },
            {
                "raw_content": "Trump always follows the rules. So I don’t think he’ll go against the SC decision directly.",
                "author": "Filo76"
            },
            {
                "raw_content": "FJB eternally.",
                "author": "Bramage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Request for Jesse Jackson to lie in honor in Capitol Rotunda denied by Mike Johnson",
        "score": 1326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's already burning in Hell.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "This guy admitted to spitting in white people's food, and the naggers have the audacity to ask that his body lie in the Rotunda? He personally interrupted the funeral of my Great Grandmother when his rainbow push thugs interrupted her funeral in the 80's. Fuck this black bastard, I hope he is enjoying licking the Devil's ass.",
                "author": "Doritalos"
            },
            {
                "raw_content": "It’s a sad joke there was even a request made.",
                "author": "RiolindasReturn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: “I Don’t Think the Court Meant That, but It’s the Way It is” – Trump Says SCOTUS Actually Reaffirmed Tariff Powers, Announces 10% GLOBAL Tariffs and Investigation into Unfair Trading Practices of Other Countries and Companies",
        "score": 1226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get fucked commies",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "eat shit commies",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Get bitch slapped commies.",
                "author": "Wtf_socialismreally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✝️ Vladimir Putin: Charlie Kirk 'died because he was defending traditional values.' His killing was an 'atrocity.'",
        "score": 331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He said more then our own government has said",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "Vlad Knows!",
                "author": "Mungo"
            },
            {
                "raw_content": "Stop playing with your food and kill that faggot midget Zelensky already.",
                "author": "aloha_snackbar22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Bessent: We will be leveraging Section 232/Section 301 tariff authorities that have been validated through thousands of legal challenges.The use of Section 122 authority combined with potentially enhanced Section 232 & Section 301 tariffs will result in virtually unchanged 2026 tariff revenue.",
        "score": 1393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doomers on here btfo. So sad how defeated people are. Edit: Maybe you doomers aren't faggots. I'll be nicer.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "China is probably behind all this and if so, make them pay even harder.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Cnbc front page is hilarious right now. Headline: Sp500 jumps after Supreme Court knocks down Trumps emergency tariffs! Bottom section: Trump announces 10% global tariff Lol",
                "author": "Asianperswayzian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Legend",
        "score": 1276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, what we are seeing is, he already anticipated this outcome. He knows.",
                "author": "Meister_Bockmist"
            },
            {
                "raw_content": "Now tariff SCOTUS.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Dude, is this true? Fuck ! Source? Fucking got a hardon!",
                "author": "roarkh1777"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - After it was revealed 50 mosques have opened in the Dallas Fort Worth area in the last 24 months, a woman has uncovered that Texas Gov. Greg Abbott’s largest donor is a Muslim Pakistani who has given him more than $14 million, including $2 million this year alone.",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about we start putting these treasonous pieces of shit in prison and deporting all these fucking muslims?",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Looks pretty bad, Abbott. You are a very cheap prostitute.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "We always knew it, now the receipts are rolling in.",
                "author": "Beelzy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LOL gloat now, lefties!",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. All the outrage over this decision is fake, gay, and retarded.",
                "author": "Yawnz13"
            },
            {
                "raw_content": "Tariff Act of 1930- “Section 338 of the law authorizes the president to impose tariffs of up to 50% on imports from countries that have discriminated against U.S. businesses. No investigation is required, and there’s no limit on how long the tariffs can stay in place.” https://patriots.win/p/1ASFqprE97/kek-breaking--trump-announces-ne/c/4eaTZAJndnJ",
                "author": "DeplorableDC"
            },
            {
                "raw_content": "Instead of threatening to tariff a foreign country at 50% to make a trade deal, now Trump should just threaten to stop all trade with them if they don't make an even better deal.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BRANDON GILL JUST DROPPED TRUTH: “Importing people from unassimilable cultures is IDIOTIC and SUICIDAL!” Mass migration without assimilation isn’t “compassion” it’s national suicide.",
        "score": 243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Suicidal Empathy is the term coined by gad saad. https://youtu.be/QhQCUQlcUZU?t=397",
                "author": "kompromatdotwin"
            },
            {
                "raw_content": "Third world people do not belong here. Retard level iqs don't make a country better. They bring it down to their level and destroy it.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "The races were Never meant to mix long term. Period!",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Xbox chief Phil Spencer is leaving Microsoft / Xbox president Sarah Bond is also leaving Microsoft.",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Asha Sharma is now in charge of renaming everything in Xbox. Xbox Copilot S Copilot Pass And Flight Simulator is now simply Copilot.",
                "author": "Creative_Purpose6138"
            },
            {
                "raw_content": "...and here we go. If the person that Microsoft put in charge of its gaming unit isn't enough of a hint already, the latest DRAM and NAND racketeering cycle has just made the Xbox, in physical form, be the first major domino that is now \"Not Economically Viable\".",
                "author": "wickedplayer494"
            },
            {
                "raw_content": "They're abandoning the boat before it sinks.",
                "author": "Velha_6ai7eira"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Zen 6 desktop Ryzen “Olympic Ridge” reportedly set to launch in 2027",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Yesterday, we learned about potential Ryzen desktop CPU configurations. That leak was followed by additional reports, including a story from Benchlife, which often adds a small extra detail to its coverage. This time, the site focused on the launch timing for the same platform. >Benchlife claims AMD’s Zen 6-based desktop Ryzen family, often referred to as “Olympic Ridge” in leaks, is not expected to launch in 2026. The outlet, which has a relatively strong track record, describes 2027 as the earliest window for “Olympic Ridge” on desktop. >*Olympic Ridge, based on the Zen 6 processor architecture, is expected to continue using the AM5 socket. Taken literally, that would mean current AMD 800-series chipset motherboards could remain compatible. Whether that will actually be the case will likely depend on later confirmation. Olympic Ridge is not expected to arrive before 2027 at the earliest, and AMD’s AM5 socket has been in use since the Zen 4 generation launched in 2023.* >This does not automatically mean Zen 6 as an architecture is “locked” to a 2026 launch for every segment. AMD can ship Zen 6 first in one product line and roll it into others later, especially if platform validation, packaging, or product positioning changes the order.",
                "author": "InsaneSnow45"
            },
            {
                "raw_content": "If Intel manages to get Nova Lake out the door this year they might finally get the DIY crown back... at least for a couple of months. Does anybody know more about why Zen 6 would be delayed other than 'RAM expensive'?",
                "author": "heylistenman"
            },
            {
                "raw_content": "Makes sense they would push it to CES 2027 in order to get Zen 6 rolling earlier into Epyc and Helios installs in the second half of 2026",
                "author": "Psyclist80"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The state of China's decade-long semiconductor push: still a decade behind, despite hundreds of billions spent and significant progress — examining the original 'Made in China 2025' initiative",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> The focus of the first phase of the Big Fund (2014 - 2018) was to build basic semiconductor manufacturing capacity and reduce reliance on foreign foundries and memory suppliers; the goal of the second phase (2019 - 2024) was to establish a true semiconductor supply chain that could develop advanced process technologies and build sophisticated semiconductor production equipment (SPE). The goal of the third phase (2025 - 2040) is to make the domestic supply chain fully independent, including building all fab tools and core technology domestically. Somewhere along the line, the Chinese government stretched the Made in China 2025 project to 2030 and then to 2040 when it comes to developing the semiconductor supply chain. Despite the author calling it stretching the goals, having it be due for 2040 actually makes sense and considering China's rate of progress, seems reasonably feasible. Ultimately, what it uses to justify the \"decade behind\" conclusion is EUV lithography, which is a pretty well known issue: > Modern DUV lithography scanners are at the intersection of ultimate mechanical precision, advanced optics, fluid dynamics, and real-time computational control, where even nanometer-scale deviations can render patterns unusable. Mastering this level of system integration requires decades of accumulated expertise across optics, motion control, software, and process tuning, areas where only a handful of suppliers have achieved production maturity. > As a result, despite visible progress in other segments of wafer fabrication equipment, China remains years behind the most advanced DUV capabilities and at least a decade behind when it comes to EUV tools. So, a nothingburger of an article as far as \"news\" are concerned, but it does provide a nice summary of Chinese policy for the last decade. The Chinese certainly know of the lithography issue and we're not aware of what projects they may have underway to circumvent that nor how successful these may be, but they're certainly trying something because this is a significant part of their state policy.",
                "author": "Moikanyoloko"
            },
            {
                "raw_content": "I can buy decent Chinese SSDs and RAM, whereas 10 years ago that was not the case.",
                "author": "mictar"
            },
            {
                "raw_content": "The first 7nm chip was introduced in 2017. So, if China can achieve 7nm by next year then that's enough to satisfy the vast majority of their needs. You only need advanced 5nm or less chips for high-end mobile phones and PCs; 7nm is actually fine for most consumers. So, it was money well spent in my opinion if it breaks the Western technology sanctions on China.",
                "author": "ju2au"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Taalas Etches AI Models Onto Transistors To Rocket Boost Inference",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two thoughts: What's old (mask-programmed ROM) is new again. Surely with the fast pace of AI model development, this will have a short life cycle?",
                "author": "NamelessVegetable"
            },
            {
                "raw_content": "You can try it here: https://chatjimmy.ai/ https://taalas.com/products/ It is very fast. The model is not good compared to the models we have today but this is first generation hardware. Very impressive, and scary.",
                "author": "Waterprop"
            },
            {
                "raw_content": "This is a fascinatingly terrible idea.",
                "author": "callmedaddyshark"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Since so many tasks nowadays are memory bottlenecked, why aren't we seeing more memory channels on consumer PCs?",
        "score": 27,
        "text_content": "GPUs can have different memory bandwidths according to their needs due to having integrated memory and custom PCBs, while consumer CPUs are stuck with the standard 2 sticks for 2 channels (or 4 sticks for 2 channels) for ages. But really the only thing that needs to change is for AMD or Intel to start selling quad-channel consumer CPUs (with chipsets which support them) and the motherboard manufacturers will follow suit. The socket will have to change too, but Intel changes their socket like every other generation anyway.",
        "comments": [
            {
                "raw_content": "The majority of end user computing these days doesn't need high memory bandwidth. Think about who actually buys the computers, it's not gamers or computer enthusiasts who could maybe benefit from more memory channels. It's businesses buying computers for their employees. Work a day in corporate IT and you'll see the vast majority of things are done through websites/webapps which aren't particularly demanding and served perfectly well by midrange modern hardware. Intel/AMD do offer platforms with more memory channels for those that do actually benefit from that sort of thing, but they have no reason to increase the baseline from 2 which would increase cost for no real tangible benefit for the majority of users.",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "Market segmentation. They want you to pay if you want or need more memory channels. Want or need 4 channels? Get normal Threadripper. Want or need 8 channels? Get Threadripper WX. Want or need 12 channels? Get Epyc. Sadly the GPU department of AMD is not as forward thinking as they were in the past when they developed HBM or forward thinking architectures like GCN. In addition to Strix Halo they could have released a mini M300A for SP5, which could have had access of up to 6 TB of normal DDR5 memory with 460-614 GB/s bandwidth. The AI bros would have been all over it.",
                "author": "peerless_potato"
            },
            {
                "raw_content": "Latency is the issue causing memory bottleneck, not bandwith. If you are doing lots of small random accesses to different memory locations, which is typical in most normal applications, bandwith isn't going to help you. Having more cache would help.",
                "author": "pi-by-two"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock Industrial NUC(S) Ultra 300 BOX Series is powered by Intel Core Ultra 5 325 or Ultra 7 358H “Panther Lake” SoC",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like a piece of junk.",
                "author": "LargeSinkholesInNYC"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Already preloaded, waiting is gonna be torture!!!",
        "score": 222,
        "text_content": "Putting everything on the backlog on hold for these classics (Got them so i can trade the exclusives, got two Switches lol)",
        "comments": [
            {
                "raw_content": "Emerald next would be amazing, my second favorite Pokemon game",
                "author": "663mann"
            },
            {
                "raw_content": "i like the icons they look nice",
                "author": "MightyPelipper"
            },
            {
                "raw_content": "I'm pretty hyped to play them again. They were such a blast to play. I remember picking my copy of fire red up at GameStop. I was so hyped to drive home and play in the back of my mom's car.",
                "author": "beauf1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Full list of exclusive Pokémon in FireRed and LeafGreen",
        "score": 1579,
        "text_content": "Additional \"fun\" fact: the Slowpoke evolution line in LeafGreen is the only line that is available ONLY in a single Gen III game, and this is including Colosseum and XD on GameCube.",
        "comments": [
            {
                "raw_content": "Throwing this in there for those who dont know: the gen 2 pokemon in each are post game only so dont pick a version based on them",
                "author": "Yacobo93"
            },
            {
                "raw_content": "I’ve been torn on which game to play first, as Red was my first game, but LeafGreen is the remake I played first. I’ll probably go with FireRed, because I’ve used a lot of those exclusives in other games recently. I also played Let’s Go, Eevee and not Pikachu.",
                "author": "Joshawott27"
            },
            {
                "raw_content": "Green has all my favorites....except for Growlithe.",
                "author": "MoneyMakingMugi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The latest \"Monster Hunter Wilds\" update scrapped all Switch 2 mentions from the code... but accidentally left the Switch 2 local-multiplayer illustration",
        "score": 267,
        "text_content": "\"At least you tried\" award for Capcom. Source of the datamine here: [https://www.reddit.com/r/monsterhunterleaks/comments/1r8c00w/tempered\\_gogmazios\\_and\\_zoh\\_shia\\_sw2\\_version/](https://www.reddit.com/r/monsterhunterleaks/comments/1r8c00w/tempered_gogmazios_and_zoh_shia_sw2_version/)",
        "comments": [
            {
                "raw_content": "Time to pivot to 4k60 MHGU",
                "author": "MASKoJOO"
            },
            {
                "raw_content": "Has to be a General Direct announcement...whenever that is",
                "author": "snfi1"
            },
            {
                "raw_content": "I only own a Switch 2 and no other current-gen system or capable enough PC. So, you know what. Even if the quality is worse than the other versions, I’m still in. I’ll be getting it day one unless it’s *truly* unplayable. The hybrid nature of the Switch is just perfect for MH, imho",
                "author": "Docile_Doggo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In October, it's been 9 years since the last mainline 3D Mario platformer",
        "score": 1625,
        "text_content": "Will nintendo show a new mario game this year or will they save it for the 10th anniversary of Odyssey? I think 10 years is way too long, gotta be this year right?",
        "comments": [
            {
                "raw_content": "Just makes me feel old tbh",
                "author": "JackRaiden89"
            },
            {
                "raw_content": "N-nine? Jesus christ I am old.",
                "author": "Arky_Lynx"
            },
            {
                "raw_content": "if you listen to the Kit & Krysta podcast two former Nintendo employees they make it clear, anniversaries are an afterthought for Nintendo. Also it takes a lot of resources and time to produce a 3D game, especially one of the caliber everyone expects from a Mario game.",
                "author": "Arcade1980"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m tired of waiting. Persona 5 Royal S2 Edition mockup.",
        "score": 105,
        "text_content": "Made by me",
        "comments": [
            {
                "raw_content": "There wasn't an upgrade path from PS4 to PS5, so I'm sure they'll want another full $60 for the inevitable Switch 2 version.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Switch 2 exclusive protag, Brandon",
                "author": "Simplejack615"
            },
            {
                "raw_content": "NateTheHate suggested Atlus might make a NS2 edition for P5 to show that they want to support the system. But i’m not sure if that was a leak or simply a prediction from his end.",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's happening!!",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was debating on starting this series or final fantasy 7 remake after i finish Cyberpunk then came Xenoblade X. Backlogs keeps piling up 💔",
                "author": "GohoomoaR"
            },
            {
                "raw_content": "Just 1 more week folks. THE END IS IN SIGHT.",
                "author": "Thegoodgamer32"
            },
            {
                "raw_content": "They really should’ve released RE7 and RE8 a week before",
                "author": "The_Senate15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "UPDATED: A little over 24 hours after being released, Xenoblade Chronicles X DE NS2 Edition Upgrade pack is ranking at #3 with the full game ranking at #5",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Beautiful stuff. Keep supporting Monolith guys! They deserve this love.",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Is this a good entry for someone who’s never played the series before?",
                "author": "angryboi7"
            },
            {
                "raw_content": "I bought it on a whim when the S1 version released and I gotta say, I had a great time with it. Didn’t have any expectations going in. Just wanted something new to play, and it more than satisfied.",
                "author": "TheWinteredWolf"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The atmosphere in this game is something else",
        "score": 106,
        "text_content": "I’ve been enjoying Xenoblade X Definitive Edition after the recent Switch 2 edition patch. I started a new save file despite the fact that I finished the game last year. Seeing the beautiful planet Mira in 4k has been so satisfying.",
        "comments": [
            {
                "raw_content": "Now imagine Xenoblade Chronicles 4 built from the ground up for Switch 2 😌",
                "author": "snfi1"
            },
            {
                "raw_content": "I just bought the game last night and am excited to start it tonight! I've never played a Xenoblade game before but this one looked awesome.",
                "author": "thinksInCode"
            },
            {
                "raw_content": "I hope they do xenoblade 2 soon too or one which I have not even played yet. I tried chronicles on Wii u but I did not like it at all, I prefer the more traditional jrpg style of the mainline.",
                "author": "Mundane-Possible2628"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IGN: Phil Spencer Retiring, Sarah Bond Out, Matt Booty Promoted as Microsoft AI Exec Asha Sharma Named New Xbox Boss previously the President of Microsoft's CoreAI product",
        "score": 1837,
        "text_content": "\"Microsoft Gaming CEO Phil Spencer, who has been at Microsoft since he joined as an intern in 1988 and with Xbox since the software giant launched its first console in 2001, is retiring, sources familiar with the matter who are not authorized to speak publicly confirmed to IGN. Spencer's retirement is effective on Monday, February 23. Meanwhile, Xbox President Sarah Bond, long thought by many both inside and outside of Microsoft to be Spencer's heir apparent, has resigned. The new CEO of Microsoft Gaming will be Asha Sharma, currently the President of Microsoft's CoreAI product. Finally, Xbox Game Studios head Matt Booty is being promoted to Chief Content Officer and will work closely with Sharma.\" Source: https://www.ign.com/articles/phil-spencer-retiring-sarah-bond-out-matt-booty-promoted-as-microsoft-ai-exec-asha-sharma-named-new-xbox-boss-exclusive",
        "comments": [
            {
                "raw_content": "I wonder if Bond wasn’t offered CEO and resigned for that reason",
                "author": "GandyRiles"
            },
            {
                "raw_content": "and nothing will improve because the problems with Microsoft go beyond Phil and Sarah",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "How is Matt booty still there",
                "author": "Drkrieger21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Looks like the Saints Row 1970s prequel is not happening",
        "score": 259,
        "text_content": "[https://xcancel.com/papaRPG/status/2024941290492694703](https://xcancel.com/papaRPG/status/2024941290492694703) RIP saints Row. Chris Stockman the guy who made the pitch says that Embracer has passed on it.",
        "comments": [
            {
                "raw_content": "Whatever financial damage got done by the reboot has probably made them think it’s just easier to hard pass on any future ideas, at least for another decade or so or until there’s new leadership there.",
                "author": "vashthestampede121"
            },
            {
                "raw_content": "Yeah… Can’t say I’m surprised. Just really unfortunate that Mike’s work on the Saint’s Row 2 PC Patch goes to waste.",
                "author": "Content_Detail1467"
            },
            {
                "raw_content": "I already thought the franchise was dead but now it’s extra dead. Sad to see one of my favorites die.",
                "author": "galaxyadmirer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Eel Game Studio website has gone live revealing Kenji Saito (\"Metal Gear Rising: Revengeance\" Director) as President; Takahisa Taura (\"Astral Chain\" Director) as a company Director and Katsumi Suenami (\"Bayonetta 3\" Project Manager) also as company Director",
        "score": 332,
        "text_content": "Source: https://eelgamestudio.com/en/ Previous rumor: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1i8usic/astral_chain_director_and_nier_automata_designer/ It's yet another very tiny team (23 employees) made up from ex PlatinumGames staff, as reported at the time.",
        "comments": [
            {
                "raw_content": "Konami should hire them for another Metal Gear project as an easy win before releasing a new mainline game.",
                "author": "CarbVan"
            },
            {
                "raw_content": "So platinum 2.0 that's actually great",
                "author": "Huge-Formal-1794"
            },
            {
                "raw_content": "Really talented lineup hopefully it works out well for them!",
                "author": "Snowby0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Post Ragnarok ending hidden dialogue has now been found within the game files *POTENTIAL FUTURE SPOILERS*",
        "score": 943,
        "text_content": "Credits go to “the morse” from the GoW Ragnarok sub. Original post: [https://www.reddit.com/r/GodofWarRagnarok/s/RZ9bNPWnvM](https://www.reddit.com/r/GodofWarRagnarok/s/RZ9bNPWnvM) “There is also a hidden cutscene of Atreus, in his travels to other pantheons, walking with an individual called \"Mau\". This being communicates only by saying the word \"Mau\", similar to how Groot speaks by saying only \"I'm Groot\", and people can understand what he's saying. Atreus apparently can understand this person through his godly gift of language. Mau is Egyptian for cat, and is also one of the manifestations of the Sun God Ra. Basically, just like the beginning of Ragnarok was hidden in the 2018 files, these dialogues might be the beginning of the next game. The dialogues go like this: Atreus: \"Wake up. I think we're close.\" Mau: \"Mau?\" Atreus: \"Hey, you insisted on coming along. C'mon, let's have a look.\" Mau: \"Mau.\" Atreus: \"I hope you're right. Sounds like we found it.\" And: Robed Figure: \"To lefkó fídi tha se fáei.\" Robed Figure: \"One failed us. One rejected us.\" Athena: \"We have a problem.\" I believe \"One failed us\" refers to Odin, and \"One rejected us\" refers to Atreus. Athena is part of a group of beings in the higher plane, which are the voices coming from the rift. Odin failed them and the mission they gave him to use the mask, and Atreus rejected them when he broke the mask.”",
        "comments": [
            {
                "raw_content": ">And: Robed Figure: \"To lefkó fídi tha se fáei.\" This is greek, translates to \"The white snake will eat you.\"",
                "author": "zoon_zoon"
            },
            {
                "raw_content": "Makes sense that >!Athena!< would return in a potentially antagonistic role, given >!her appearance in 2018.!<",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Yeah I had a feeling Athena was going to be involved again eventually.",
                "author": "OverlordJacob2000"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "London-Based Theatre Chain Everyman Cinema may have accidentally spoiled a major character’s appearance in The Super Mario Galaxy Movie",
        "score": 90,
        "text_content": "https://nintendowire.com/news/2026/02/20/a-surprise-super-mario-galaxy-movie-character-may-have-been-spoiled-by-london-based-cinema-chain-everyman-cinema/ Take it with a massive grain of salt. I sorta refuse to believe if >!Wario!< truly is in this movie, they’d be hidden to this extent, given they’re such a major character in the franchise and beyond. Granted, we don’t exactly know Bowser JR’s full plot in this movie, but idk, that seems a bit fan-fiction-y",
        "comments": [
            {
                "raw_content": "Wah if true",
                "author": "anonsyed"
            },
            {
                "raw_content": "surely a casting announcement for >!Wah!< would be a huge marketing opportunity. this is not a movie I'm planning to see, but if they had said \"and Danny Devito is voicing >!Wario!<!\" then I'd buy a ticket just to hear his delivery",
                "author": "Blint_Briglio"
            },
            {
                "raw_content": "Just searched the exact synopsis given here and it looks like people were sharing it around on Instagram in December? I think someone made it up and then sites just began to run with it lol [This](https://www.instagram.com/p/DSBTQ9xD6ci/) was the earliest post I found on about two minutes of research",
                "author": "m1n3c7afty"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New info from Polish insider on upcoming Witcher 3 DLC location",
        "score": 314,
        "text_content": "[Wccftech article link](https://wccftech.com/the-witcher-3-new-dlc-closer-to-velen/) Here's the important part: >>!...Commenting on old map design approaches in video games in a livestream earlier this month, UV o grach, a former Gry-Online journalist with solid connections with the Polish gaming industry, made some comments about reusing assets and filling in the blanks on a map.!< >>!These statements sparked a wave of comments from livestream watchers who started asking for updates on the yet-to-be-announced The Witcher 3 DLC. While UV o grach did not confirm or deny anything outright, **he suggested that people are looking at the horizon while the answer is right under their nose, essentially doubling down on an earlier tidbit the former journalist dropped in early December about the new region being an extension of the Velen region, rather than a brand new one like the rumored Zerrikania.**!< >!So... Looks like we're staying in the Northern Kingdoms.!<",
        "comments": [
            {
                "raw_content": "I really need CDPR to confirm this DLC so i can start a new Witcher 3 run before its release",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Velen is probably my favorite game location ever, just an absolutely miserable shit hole.",
                "author": "FluffyFluffies"
            },
            {
                "raw_content": "So, wouldn't CDPR have said something by now if this dlc/expansion was fake? They have commented on fake stuff for Cyberpunk in the past.",
                "author": "Andrew_Waples"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pory_Leeks’ “Leak Log,” correctly leaked FireRed & LeafGreen Pokemon Ports hours in advance, also mentions other things that will be shown in the Pokemon Presents",
        "score": 255,
        "text_content": "https://xcancel.com/pory\\_leeks/status/2024586046168559870?s=46 Figured this was worth posting as this list specifically name drops, ***“FRLG Ports Pokemon,”*** which he called 7-8 hours in advance, before Nintendo themselves accidentally leaked the info on the EShop. The following is everything else mentioned in the Leak Log that will be allegedly featured in the 2/27 Pokemon Presents: ***• Pokemon Sleep*** ***• Pokemon Unite*** ***•TCG Next Set Reveal*** ***•XD/Colosseum NSO*** ***•Champions*** ***•Pokopia*** ***•Pokemon Winds & Waves (Gen 10)*** ***•Other Merchandise/Anniversary Stuff to fill time, albeit it’s not the main focus of the presentation***",
        "comments": [
            {
                "raw_content": "Worth noting the the rumours/leaks of FireRed and LeafGreen have been circulating for over a week now. This wasn’t the first mention of them. They could have just picked up on others ‘leaks’.",
                "author": "noggs891"
            },
            {
                "raw_content": "I’m not doubting Poryleeks but the FRLG ports have been an open secret for a minute. And the rest of this stuff is very easy predictions. Literally everything here besides the Colosseum and XD NSO release is practically guaranteed, and even those are fairly expected since they were shown in the initial Switch 2 direct.",
                "author": "PlumRelative4399"
            },
            {
                "raw_content": "No Masters or Cafe Remix mention? Obviously fake /s",
                "author": "ComeAlongWithTheSnor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core 200E Bartlett Lake-S CPU series specs have been leaked, up to 12 P-cores and 5.9 GHz boost",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waste of sand. Only half joking there. This is a part meant to use old fabs for niche customers. Old CPU, Regular RPL has more than enough P cores for consumers (no, your RTX 2060 from 7 years ago isn't bottlenecked and you're not good enough for a 2 FPS difference to matter) and better MT because of the awesome E cores. Both NVL and Zen 6 are out not that long after this and will likely just be outright better for most use cases. \\--- Aware these are embedded (which makes sense, there is a use case here) - it was a thing for a while where \"EXTREME GAMERZ!1!11!\" wanted more P cores. Never mind the fact that many 6 core systems matched 8 and 16C in games on the Ryzen side with the benefit of more cores being that the main cores aren't clogged up by background tasks.",
                "author": "Intrepid_Lecture"
            },
            {
                "raw_content": "BOOST",
                "author": "Montresoring"
            },
            {
                "raw_content": "I'm still hoping we see these on the consumer market. Have LGA1700 boards that could use them, and they'd be a better choice than Alder Lake or a self-destructing Raptor Lake part!",
                "author": "airmantharp"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Zen 6 desktop Ryzen “Olympic Ridge” reportedly set to launch in 2027",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "They should just stop making normal vs x3D parts and just make x3D the standard. Clearly most everyone wants it.",
                "author": "Obvious_Drive_1506"
            },
            {
                "raw_content": "Not a surprise given N2X not in full production yet",
                "author": "Flynny123"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Delidded AMD Ryzen 7 9850X3D now available from Thermal Grizzly at $876",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage rates drop to lowest level in nearly 4 years",
        "score": 204,
        "text_content": "Great news for the housing market.",
        "comments": [
            {
                "raw_content": "* 30 year rates still above 6% * House prices still at close to all time high * Realtors still inflating already high price by 6% commission * AI threatening all jobs * Layoffs all the time * Terrible jobs report * Loss of confidence in US administration * Tarrifs and Wars injecting uncertainty yeah, I think I’ll stay put in my cheap condo.",
                "author": "UpTheDumpIsRetarded"
            },
            {
                "raw_content": "Big win for the rate daters",
                "author": "ishboo3002"
            },
            {
                "raw_content": "This is like hearing that Ferrari is offering better interest rates on expensive cars. Still not paying 250k+ for a car…",
                "author": "Crazyboreddeveloper"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "'Canary in the coal mine': Blue Owl liquidity curbs fuel fears about private credit bubble",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a bubble but from the article I didn't get the impression that the lending here was for housing, sounds more like lending to businesses.",
                "author": "DoubtHot6072"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "(Sound on) Gemini 3.1 Pro surpassed every expectation I had for it. This is a game it made after a few hours of back and forth.",
        "score": 371,
        "text_content": "This is what it managed to make, I did not contribute anything except for telling it what to do. For example, when I added plants to the planets, it caused performance to tank. I simply asked it \"optimize the performance\" and it goes from 3 fps to buttery smooth. I asked for it to add cool sci fi music and a music selector and it did that. I asked it to add cool title cards to the planets with sound effects and it absolutely nailed it. Literally anything you want it to do you just say in plain language. Final result is around 1,800 lines of code in html.",
        "comments": [
            {
                "raw_content": "OP you and u/LightVelox made [almost the exact same game.](https://www.reddit.com/r/singularity/comments/1r8zrxf/gemini_31_pro_makes_a_nms_style_space_exploration/) What tool did you use for codegen?",
                "author": "Recoil42"
            },
            {
                "raw_content": "Delete this. I have Unity shares and a family to feed.",
                "author": "atlantajake"
            },
            {
                "raw_content": "Is the soundtrack generated as well, so cool",
                "author": "Flannakis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Opus 4.6 is going exponential on METR's 50%-time-horizon benchmark, beating all predictions",
        "score": 741,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> We estimate that Claude Opus 4.6 has a 50%-time-horizon of around 14.5 hours (95% CI of 6 hrs to 98 hrs) on software tasks. While this is the highest point estimate we’ve reported, this measurement is extremely noisy because our current task suite is nearly saturated. LOL they literally didn't update the benchmark for like 2 months recently because they were revamping it to add harder tasks and this 1.1 update to their benchmark is already near saturation",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "Doubling time below 3 months, it seems. It is too few data points to extrapolate from, though.",
                "author": "Apart_Connection_273"
            },
            {
                "raw_content": "https://preview.redd.it/3cs1ydv7hpkg1.png?width=1361&format=png&auto=webp&s=209ace3eba9134adb44a7541bfffb2f1e6ed69d5 In an offline chat i asked claude to predict the tarifs decision, and it perfectly predicted it. Kinda shocked me lol",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "James Bond x Seedance 2.0",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They having a stroll trough the town :)))",
                "author": "Alone-Ad-3328"
            },
            {
                "raw_content": "Still pretty awkward tbh but I can see why they’re saying full movies will made by ai by the end of the decade.",
                "author": "theghostlore"
            },
            {
                "raw_content": "Should have had them on trikes.",
                "author": "Deciheximal144"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.1 Pro created this isometric 3D scene ... Using only svg components",
        "score": 110,
        "text_content": "I wanted to see how far I can go with just svg, and Gemini 3.1 Pro certainly did not disappoint. Important disclaimer here: This was definitely not built with a single prompt. But I can assure you that every object in this scene was generated by Gemini 3.1 Pro. Core isometric engine code for anyone else who wants to play around: [https://gist.github.com/andrew-kramer-inno/3f7697e92026ac98897ba609d4cfaea6](https://gist.github.com/andrew-kramer-inno/3f7697e92026ac98897ba609d4cfaea6)",
        "comments": [
            {
                "raw_content": "Wow!",
                "author": "bartturner"
            },
            {
                "raw_content": "Can someone explain to me why SVG images matter?",
                "author": "abatwithitsmouthopen"
            },
            {
                "raw_content": "we're cooked",
                "author": "xenquish"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is literally 80% of my timeline.",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> has automated a 30s task in 4 days of work we call this devops :)",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "I feel attacked.",
                "author": "Rise-O-Matic"
            },
            {
                "raw_content": "> runs some open source model which has very low cost per million tokens via API anyways The hardware will never even get close to paying for themselves before they eventually break or become obsolete. Self hosted AI is the future, but not now. We will see massive hardware improvements in a few years. Why buy now?",
                "author": "vasilenko93"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Not so gentle singularity? Sam Altman says the world is not prepared, “It's going to be a faster takeoff than I originally thought”",
        "score": 434,
        "text_content": "Full quote: \"The inside view at the companys of looking at what's going to happen, the world is not prepared. We're going to have extremely capable models soon. It's going to be a faster takeoff than I originally thought. And that is stressfull and anxiety inducing\"",
        "comments": [
            {
                "raw_content": "Well METR just updated their chart with opus 4.6 seems like hes right about a fast take off",
                "author": "Alive-Employment-403"
            },
            {
                "raw_content": "Call him a hype artist, but this dropped like an hour before Claude Opus 4.6 hit 14 hours on the METR 50% time horizon. Things are getting fucking crazy.",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "One thing he didn't lie about is people really have no idea what's coming. They love to bury their heads in the sand and act like AI is beyond useless. It's really funny.",
                "author": "Funkahontas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.3 codex (high) scored underwhelming results on METR",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/2ksmd49xvrkg1.jpeg?width=1179&format=pjpg&auto=webp&s=0828c7e437715d953f4aa907e997b202bc8d4ffc Begging you people to read evals properly",
                "author": "Warm-Letter8091"
            },
            {
                "raw_content": "I want to see Gemini 3.1",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "This doesn’t really align with my (and a lot of others) results using both Opus and Codex 5.3",
                "author": "Howdareme9"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Doubles Revenue Forecasts to over $280B, Predicts $111 Billion More Cash Burn Through 2030",
        "score": 124,
        "text_content": "\\-Lifts revenue forecasts through 2030 by $141 billion \\-Doubles cash burn forecast \\-Missed margin target last year as compute costs surged Source: https://www.theinformation.com/articles/openai-boost-revenue-forecasts-predicts-112-billion-cash-burn-2030",
        "comments": [
            {
                "raw_content": "Square this with the idea of AGI predictions in next few years and a mass displacement of workers and the ability to create anything and everything from scratch with continual learning and RSI. In that kind of environment, they predict that ads are going to be larger than B2B and half their revenue with new products only like 5% or so? Really makes you think...",
                "author": "Nedshent"
            },
            {
                "raw_content": "The economics of AI still don't make any sense to me. The only way OpenAI can become profitable in one year is if they suddenly developed AGI, and companies start replacing all their workers with it en masse. And there would be a slew of other catastrophic consequences from that. Who really believes this?",
                "author": "Illustrious-Film4018"
            },
            {
                "raw_content": "I don’t can’t read the full article to know where the $13B for 2025 came from but when Brad Gerstner asked that question in his [podcast](https://youtu.be/Gnl833wXRz0?si=HVKVeMA9ry58IN_A) (@12:25 timestamp) Sam’s immediate response was: “First of all, we are doing well more revenue than that…”. Is OpenAI now saying that Brad was right on the money so to speak?",
                "author": "BranchPredictor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis Deepmind CEO says AGI will be one of the most momentous periods in human history - comparable to the advent of fire or electricity \"it will deliver 10 times the impact of the Industrial Revolution, happening at 10 times the speed\" in less than a decade",
        "score": 878,
        "text_content": "@INDIA AI Impact Summit 2026 16 Feb - 20 Feb",
        "comments": [
            {
                "raw_content": "How crazy will it be if kurzweil nailed the AGI 2029 prediction way back when?",
                "author": "It_Redd"
            },
            {
                "raw_content": "We are approaching our great filter fast, let's hope we make it through",
                "author": "OverCoverAlien"
            },
            {
                "raw_content": "It would be pretty funny if we made super intelligence and then it completely ignores us Aren't we super intelligent compared to a cow? Nobody cares what they have to say.",
                "author": "p1nk_sock"
            }
        ],
        "subreddit": "singularity"
    }
]