[
    {
        "post_name": "DALLAS FALLS: Buffalo Wild Wings Goes Halal – Texas’ Latest Sharia Surrender Breaking in Richardson, where the Islamic population is exploding, and a Muslim mayor now runs the show: Their Buffalo Wild Wings now serves zabihah halal hand-cut wings - hand-slaughtered facing Mecca with prayers to A",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would stop going to buffalo Wild Wings but I can't stop going any harder.",
                "author": "TrumpYe2023"
            },
            {
                "raw_content": "texas is a joke",
                "author": "stripperlover"
            },
            {
                "raw_content": "Texas is a jewel in the crown of globalism, they take that and there is almost no path to electoral victory. It must be retaken. Every county, city and town. No exceptions",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bill Gates says a merge of biometric digital ID, bank accounts and payment systems is needed to safely monitor people's health records, keeping tabs on farmers, and tackling \"climate problems.\"",
        "score": 504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Release the video of him with underage girls and end him. Take his 80 billion and give a check to every unvaccinated citizen.",
                "author": "FlyinHeadlock"
            },
            {
                "raw_content": "The guy who gave his wife the clap and then tried to secretly give her drugs to treat it says your health records need to be monitored.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "This is a great idea, Bill! Perhaps a mark on the right hand or forehead. And this way we could limit commerce for those who didn’t have the mark. What could go wrong?!",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Where's Ahmed",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Find Ahmed before he detonates! When you do find him, decapitate!",
                "author": "MacheteSanta"
            },
            {
                "raw_content": "What's the difference between a nun in a habit and a muslim woman in her burka? Well for starters, the nun doesn't randomly explode.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Kek",
                "author": "SALTYinSeattle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One of several who deserves a medal",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surely there's a source for this quote other than text thrown on a picture of him",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "The usual suspects trashed the hell out of him back then. The usual suspects are still trashing certain people with certain opinions",
                "author": "fthecoup"
            },
            {
                "raw_content": "This fucking bullshit again? Mel Gibson never said this.",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Barack Obama is colossal faggot",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope Harambe kills the Obamas in the ape afterlife.",
                "author": "PyroSphere"
            },
            {
                "raw_content": "\"Rogue behavior\" as in \"upholding the law\"? I'll take that.",
                "author": "RayRobinson"
            },
            {
                "raw_content": "How all these people can call the patriots on J6 domestic terrorists while actively fomenting real domestic terrorist makes me want them to all die off.",
                "author": "TheMaesterReturns"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daughters of Irishman held by ICE say father abandoned them and should return to face drug charges",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll take them",
                "author": "hughjasske69"
            },
            {
                "raw_content": "How is this possible? I was told that ICE was targeting \"brown people.\"",
                "author": "ZacPetkanas"
            },
            {
                "raw_content": "Dad left? Makeup checks out",
                "author": "BeekeepingPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE: ICE Is Gearing Up to Build “Mega” Jails",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how about DEPORTATION NOT HOUSING????",
                "author": "perma-maga"
            },
            {
                "raw_content": "Use Obiden’s fema camps.",
                "author": "Neonentity"
            },
            {
                "raw_content": "Seems incredibly expensive More govt graft? Is THIS why the Demoncrats are suddenly getting behind it? Demoncrats are attracted to graft like hookers to Navy ships, and for the exact same reasons",
                "author": "Crappydatum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JAPAN UNVEILS NEW ANTI-ISLAM LAWS. Halal - BANNED, Large Mosques - BANNED, Call to prayer - BANNED, Praying in the street - BANNED.",
        "score": 1855,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lord, I've seen what you've done for others...",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Dying of patriotic jealousy",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Please remove the word \"large\" from large mosques. Ban them outright.",
                "author": "MondayCoupleIsDead"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEPORT DEPORT DEPORT",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vivek, is that you?",
                "author": "Filo76"
            },
            {
                "raw_content": "Trump isn’t deporting enough to keep his promise. Hes gonna keep the jeets and wet backs for cheap labor",
                "author": "Tacticalsmoke420"
            },
            {
                "raw_content": "it was never meant to include boons",
                "author": "etcetera"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHO'S SHOCKED? It's also predictable... And also tiresome!",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who would do this? The same kind of person who murdered her.",
                "author": "LBTrumplican2"
            },
            {
                "raw_content": "I'm blown away by the tolerance they've displayed.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "I mean, they already vandalized it.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Voter ID is on its way to be placed on the CALIFORNIA BALLOT this November, with the initiative's leader announcing 1.35 MILLION petition signatures will be submitted this week...",
        "score": 1259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you don't require ID for THAT vote, it's a moot point.",
                "author": "canadianhere"
            },
            {
                "raw_content": "Doesn't California do what they want? No matter how voters vote.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Ironically EVERY name on that petition Requires an ID!! 🤡🌎",
                "author": "Crappydatum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Are you doing your part? I'm not!",
        "score": 1018,
        "text_content": "",
        "comments": [
            {
                "raw_content": "perfect",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "It's time to go Vlad on the left and their pets.",
                "author": "drattastic1"
            },
            {
                "raw_content": "The thumbnail made me think a happy merchant meme got stickied.",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE WALLS ARE CLOSING IN: Just a few more rape whistles and cardboard signs and it's all over for your MAGA Blonald-Blumpf Nazi bigot regime!",
        "score": 614,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember when journalism used to mean reporting stories and not an agenda?",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "Mark and Paul Engler?? GAY!!",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "Nobody's turned these people are retards everybody can see that you don't hit a police officer with their car nobody cares about Renee or that other dude. And nobody certainly cares about any illegals except for the Retard white women for some reason the ones that are getting raped. Stockholm Syndrome",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: Savannah Guthrie Tearfully Pleads with Her Mother’s Captors in New Instagram Video",
        "score": 486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She ded. What's more, I think Savannah killed her",
                "author": "ramennov"
            },
            {
                "raw_content": "Why should I care",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "She's clearly dead at this point.",
                "author": "duckduck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Actor Jim Caviezel says that the very next day after he mentioned adrenochrome, he was dropped by his agency and blacklisted by Hollywood.",
        "score": 440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. The evil involved in feasting on the blood of children is difficult to fathom. It is real. It is EVIL.",
                "author": "NecturusMaculosus"
            },
            {
                "raw_content": "Jesus.",
                "author": "Maxmax"
            },
            {
                "raw_content": "Monster inc based on it",
                "author": "MemoryHoleyeO"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why isn’t that your headline?",
        "score": 364,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/RantyAmyCurtis/status/2023167903072235722",
                "author": "CounterStrike"
            },
            {
                "raw_content": "Answer: Because NBC news is the CIA pravda and they've been protecting Epstein since the 90s?",
                "author": "snoopy3210"
            },
            {
                "raw_content": "Whose name is in the Ashley Biden files?",
                "author": "bigdickhangsright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If you invested $10,000 in Beyond Meat in 2021, today you would have $41.",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I used to laugh every time I walked into a store during the covid meat shortage and saw literally freezers full of the fake meat and still with no other option to buy people were still not buying the fake meat!",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "From what I read those burgers are not even healthier, they have like 9000 times the safe sodium levels and will give you a heart attack lol",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "It's trans-meat. It's veggies trying to transition to meat.",
                "author": "FromBilgewater"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Poor kid is feeling unloved: Eileen Gu, who instead of competing for America, chose to compete for China in the Olympics is disappointed that the Milan Cortina Olympic organizers are not giving her more practice time. She believes that due to her packed schedule she should get more time than others",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Girl, if skiing doesn't work out, you've already got a great porn name waitin for ya",
                "author": "Dr_Fister"
            },
            {
                "raw_content": "> Gu said she found Trump’s “critique of Hess inconsistent with the spirit of the Games.” inconsistent with the spirit of the Games is whoring yourself out to another country for a fat payday",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "I don’t hate anyone but this is the most Chinese Jewish thing I’ve ever read.",
                "author": "Kamalas-Snatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Farmer destroys lib activist to her face, then ends with one last question that proves her complete ignorance on the subject:“This land? 30-Degree slope, clay soil, 45 inches of rain? Show me the crop.”",
        "score": 625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clay soil...45 inches of rain. Yikes",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Facts are so ... unfair?",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "They do this same bullshit tactic when they make up shit about cattle in the US. They'll claim these cows are taking up space for crops. You mean the semi-arid nothing that can't grow in Texas, Wyoming, and Montana? People pick cattle in places where nothing can grow but grass. In places like Arizona and the high desert of California they turned desert nothingness into place that can grow food. They grow one thing, Alfalfa, and that feeds diary cows. You can't swap that acreage with crops like Indiana Jones. The truth is, farmers are as efficient as they can be with resources because not being efficient means they fail.",
                "author": "_Sully_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A prayer by John Rich",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean step (1) is just arrest them",
                "author": "Treatt"
            },
            {
                "raw_content": "Dear John: Read the book of Revelation. That day is coming. Maybe not in our timing. But God's timing is always perfect timing.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "... not my will but Yours be done. Amen.",
                "author": "Th0mas_Paine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Acer and ASUS are now banned from selling PCs and laptops in Germany following Nokia HEVC video codec patent ruling",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The [H.265](https://en.wikipedia.org/wiki/High_Efficiency_Video_Coding#Patent_license_terms) patent situation is a tire fire of monstrous proportions. Except for a couple of sectors where H.265 compatibility is important, the general winning strategy is to go AV1, and wait for [H.264 patents to expire globally](https://www.reddit.com/r/linux/comments/10v3op0/which_year_should_we_treat_h264_patents_as/).",
                "author": "pdp10"
            },
            {
                "raw_content": "one more reason to go the open codecs route",
                "author": "Gnash_"
            },
            {
                "raw_content": "10+ years into HEVC and this crap is *still* happening? Man no wonder VVC has had 0 uptake, I hope AV2 can come out of the gate swinging. (AV1 is fine, but I’m interested in something with a bigger improvement over HEVC as that’s when I think adoption will really take off)",
                "author": "reallynotnick"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "You can now file your G.Skill U.S. class action claim to get a cut of the $2.4 million settlement — deceptive memory marketing class action now accepting payout submissions",
        "score": 218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> You also do not need to present proof of purchase if you’re making five or fewer claims. What the hell lol I wonder what the fallout of this will be. A giant sticker telling people to enable XMP/EXPO? More conservative XMP profiles to account for boards/CPUs that can't achieve the highest speeds?",
                "author": "OftenSarcastic"
            },
            {
                "raw_content": "How about they send money to everyone affected without an opt-in? Wouldn't that be nice?",
                "author": "zghr"
            },
            {
                "raw_content": "Why is the start date 2018? I have a 2400 Mhz DDR4 from late 2015.",
                "author": "2Kappa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung readies LPCAMM2 LPDDR5X modules with up to 96GB and 9600 MT/s",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So in the consumer market? 2029? 2030?",
                "author": "imKaku"
            },
            {
                "raw_content": "I still dream of CAMM RAM that can be installed on consumer GPUs. Then again, they'll probably just charge the same amount but give you no VRAM.",
                "author": "throwaway12junk"
            },
            {
                "raw_content": "I'm kind of hoping that when we get to DDR6 in a few years, we might see the end of DIMMs and SODIMMs in favour of CAMM-type RAM for laptops and consumer-level desktop hardware (and LPDDR6 variants).",
                "author": "FlatTyres"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The PCB Fabrication Gap: Why the US is Lagging Behind Taiwan and China in Critical Technology",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole supply chain is in East Asia. Articles like this are dumb. Why make anything in the US which is on the exact opposite side of the Earth from where it will be assembled?",
                "author": "Competitive_Towel811"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell XPS 14 Core Ultra 7 355 review: Still great, but not nearly as special",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So, Intel Graphics with 4 Xe3 cores, upgrade of the 140T/140V. Still impressive! [https://www.notebookcheck.net/Arc-140T-vs-Intel-Graphics-4-Xe3-vs-Arc-130T\\_12966\\_13353\\_12967.247598.0.html](https://www.notebookcheck.net/Arc-140T-vs-Intel-Graphics-4-Xe3-vs-Arc-130T_12966_13353_12967.247598.0.html)",
                "author": "1FNn4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] Somehow the Macbook Pro became a BARGAIN",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel and its partners need to get their pricing significantly down.",
                "author": "MrMoussab"
            },
            {
                "raw_content": "If they could put the M5 in the 16 inch that'd be grand, as I don't need all the performance but like a larger screen.",
                "author": "ashyjay"
            },
            {
                "raw_content": "The power of vertical integration + economies of scale!",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia’s Loss Is Samsung’s Gain: ByteDance Reportedly Turns To Korean Giant For In-House AI Chips",
        "score": 31,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why are OLED Gaming Monitors so expensive compared to OLED TVs?",
        "score": 97,
        "text_content": "Monitors and TVs are cut from the same sheet of mother glass. You can cut out more monitors than TVs out of a sheet. TVs have more expensive processors in them to do the motion smoothing, colour enhancement and everything else. They all run a proper SOC that powers their smart TV OS. They have TV tuners. They all have speakers. Monitors don't have any of that stuff. In addition, TVs tend to get brighter and almost every new TV has a near reference level FILMMAKER MODE. Why are monitors so high in price then? A 32\" 4K OLED monitor costs the same as a 2025 55\" OLED TV in my region. It cannot be an economies of scale thing. They are made from the same raw materials and OLED TVs aren't exactly very popular. Is scaling up the refresh rate from 144Hz to 240Hz that expensive? Or is printing smaller pixels that expensive?",
        "comments": [
            {
                "raw_content": "Sales volume. They make way, way more TVs than monitors.",
                "author": "GlammBeck"
            },
            {
                "raw_content": "Economics of scale, TVs sell far higher volumes than monitors, especially OLEDs TVs also have ads and tracking to paritally subsidies the costs",
                "author": "TalkWithYourWallet"
            },
            {
                "raw_content": "it is in fact economy of scale, market for TVs is much much bigger than for high end gaming monitors and so they primarily cut TV sizes and use what's left of the mother glass to cut monitors. Not to mention that while low end oleds are cheaper than OLED monitors that is not the case for high end models such as LG G series or Samsung S95 or Sonys Bravia oleds so margins there are probably also higher.",
                "author": "TerribleQuestion4497"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Feels weird that I can only now enjoy gaming like this...",
        "score": 87,
        "text_content": "I thought maybe I'm just getting tired of videogames because I'm getting old (45), but I've actually found that I just don't enjoy playing long single player games on TV anymore. I have an XBOX series X and a Switch 2. I only ever boot up the Series X to play OW, FN or DBD. That's pretty much it. I have a respectable library of videogames, but I have no desire to play any of them. I am looking forward to Resident Evil Requiem and Control 2 which I guess I would be ok to play on the XBOX. But, yeah otherwise no other desire. What's really weird is I recently bought Ghostbusters on my Switch 2. I originally played it on PS3. So anyway, for some reason, I decided to play the game in tabletop mode, where I basically have the Switch infront of me, but the controllers in their handle. I swear, I just felt like I had such an amazing time. I tried other games like Yakuza 0 and Hitman and it just felt so cozy and so much fun to play like that. The funny thing is, I have my HD TV sitting infront of me, and yet there's this cozyness of playing the Switch in tabletop mode. I don't know, it just feels like magic. Makes me feel like - man, this is what I was missing when I was a kid in the 80s. Just having this thing, my mom thinking I'm asleep, but I'm playing this thing under the covers in the dark. I'm now actually thinking of just buying RE Requiem for the Switch and enjoying it completely in tabletop mode, instead of buying it for the Xbox. Yeah, maybe I'm weird, I don't know. lol",
        "comments": [
            {
                "raw_content": "Good for you bro. I’m 52 and I’m enjoying the switch 2 as much as you. Growing up in the 80’s, like you, I can really appreciate it, especially knowing what we started out with. I’m looking at you Atari 2600🤣",
                "author": "damandp"
            },
            {
                "raw_content": "Not the same age but I'm 30 and prefer handhelds so I totally get it. It's where most of my playtime goes to. Whether it be the Switch 2 or ROG Ally or even the 3DS and Vita. I have the Xbox Series and a pretty nice PC. but it's just more cozy. And it's easier to pick up and play imo",
                "author": "JetpacksWasYes-2"
            },
            {
                "raw_content": "For the full effect, play it like that under a blanket fort. The furnace turned off at my house in the dead of winter, and while I was waiting for the appointment with the repair people, it was me, my 2 cats, and my switch 2 under a blanket fort going through my brand new backlog.",
                "author": "Q_Mulative"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "According to rumors, new DLC for The Witcher 3 will be released this year. So... Maybe that's why we haven't gotten the Switch 2 version of the game yet?",
        "score": 252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They could release it all together in a new physical edition",
                "author": "splashbruh37"
            },
            {
                "raw_content": "Not sure how much this ties in as the DLC is made by the cdpr team apparently while the switch 1 port was outsourced",
                "author": "julesvr5"
            },
            {
                "raw_content": "I think the devs said a long time ago they’re completely done with this game",
                "author": "Jrocks721"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is my bona fide jrpg machine",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "straight fact!! switch was my go to for rpg/jrpgs sw2 has taking them to the next level",
                "author": "LedgendX"
            },
            {
                "raw_content": "Just finished FF7R Intermission today. WOW what a game can’t wait for Rebirth in June",
                "author": "Jeezy52"
            },
            {
                "raw_content": "Playing persona 3 reload right now on switch 2!",
                "author": "Justapersonmaybe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever is really really good",
        "score": 91,
        "text_content": "It’s the most fun I’ve had in a Mario sports game since baseball on the Wii. I do agree with the sentiment it’s not worth 70 dollars, but I traded in a game to GameStop so I basically got it for 40. The doubles mode, the skill tower, and all the skill challenges and different fever rackets honestly are way more content than I was anticipating. The controls feel amazing, and the physics are great. Been playing with my dad and we are having an absolute blast!",
        "comments": [
            {
                "raw_content": "I just played with my friends for a few hours and it was a blast. Seriously an amazing time and I’m very glad I decided to get it. $70 was a lot, but if I get 3 or 4 more nights like that out of it then it’s definitely worth it for me personally.",
                "author": "Affectionate-Emu6609"
            },
            {
                "raw_content": "Honestly, I don't understand the sentiment that \"it's not worth 70 dollars\" when you say it's really fun and you are playing with your dad. I guess you can decide what you consider worth it or not for you, but how much I value games clearly doesn't match yours or the general sentiment around a game like this (I've been seeing a lot of complaining about the price). A mutiplayer game developer has to finely tune the multiplayer experience -- controls that that are easy to pick up but hard to master, physics that make sense to you instinctively after you have played a while, powerups that are thought out enough that they can make luck a factor without it seeming the only factor, all players being able to understand what they are doing on a single screen, and bots that can play at varying difficulties including challenging ones without seeming cheap to fill out the numbers if needed. If a game I buy to be a multiplayer game does all of those things, I will forgive short, bad, or nonexistent single player content, because that isn't the point. *Super Bomberman* is my all-time favorite game and the story mode is a quirky 7/10 to me and it has only 12 battle maps, so would get ripped on content quantity by modern reviewer, but the feel of playing it with my friends is perfect. *Boomerang Fu* is the most played Switch game in my household, and it has *no* single player content other than turning on bots. *Nintendo Switch Sports* is often panned and I've never played it single player or online, but my non-gamer Dad likes going through a round of golf or bowling on it with me and that alone makes it worth the price to me. If *Mario Tennis Fever* is really good for me to play with either my wife and kids or with my dad, it will be well worth the $70 MSRP (though I of course will pay less if it's easy to do so, like it's $63 at Costco right now).",
                "author": "Emotional-Pumpkin-35"
            },
            {
                "raw_content": "I'm having lots of fun too! I got mine at Costco for a few dollars off but I still don't think its worth 50+. It's not a bad game, it just doesn't have 50+ bucks worth of content",
                "author": "Glass_Dog_7942"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It feels like I’m playing on a giant GBA",
        "score": 787,
        "text_content": "I just tried the “reproduce classic feel” on the GBA NSO online and it looks insane on my 83” TV. It looks insane in person and I honestly prefer it over the raw pixel look. Hopefully they will include a feature like this if the ever release the Pokemon GBA games.",
        "comments": [
            {
                "raw_content": "Minish cap is such an underrated Zelda game.",
                "author": "mjm132"
            },
            {
                "raw_content": "I just wish the borders were true black",
                "author": "Jazzlike-Swan-1362"
            },
            {
                "raw_content": "This effect also emulates the GBA screen ghosting its a very well done filter",
                "author": "Round_Musical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Third Party Ports Are Selling Well On The Switch 2 So Far!",
        "score": 209,
        "text_content": "Final Fantasy 7 and Dragon Quest 7 are currently selling well on the platform. Ubisoft recently stated that the Switch 2 version of Assassins Creed Shadows contributed to the game doing better than expected this quarter. Madden 26 has always been in the eShop's American top 30 best selling Switch 2 games since release. Despite being the first Madden game on a Nintendo platform since 2012. 2K's PGA Tour 2K25 is in the American top twenty best selling eShop games since it released a week and a half ago (something I clearly was not expecting). Of course, Cyberpunk keeps on selling. I cannot believe it is ranked at #2 in the American eShop's best sellers (there is a sale going on for it at the moment) but even wiith the influx of new games out on the platform, the game keeps on selling. It is good to see people supporting the developers/publishers who take their time to port/optimize their games on a Nintendo platform.",
        "comments": [
            {
                "raw_content": "Square-Enix, so hot right now. Their graphics are premium in hd-2d. And their games aren’t uncompleted DLC extortions (but I do buy those from Nintendo so whatever).",
                "author": "dnhouser1"
            },
            {
                "raw_content": "It’s such a popular platform, there’s no surprise developers want their games on it. Hopefully that means more good quality 3rd party games/ports are coming.",
                "author": "jowon123"
            },
            {
                "raw_content": "FF7 Remake is an incredible portable experience.",
                "author": "PinkTriceratops"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Friendly reminder: Ys X Proud Nordics launches this week on Switch 2",
        "score": 17,
        "text_content": "Ys X: Proud Nordics launches on Switch 2 this week and it feels like it’s not getting nearly enough attention. It’s an action JRPG by Nihon Falcom. The soundtrack is godly. I held back from playing Ys X Nordics and I’m super excited to play this enhanced version. It also has a 120 fps mode on switch 2 which is surprisingly good. The video below is showing off the 120 fps mode https://youtu.be/sYTxWslyJA0?si=6lAouKUE_i6o1-sw",
        "comments": [
            {
                "raw_content": "I’m excited to finally play. Been holding off on playing Ys X since this was announced",
                "author": "poopstoodamnbig"
            },
            {
                "raw_content": "Oh yea I was looking forward for that.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "It launches when it's discounted on sale",
                "author": "Hitscher"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I also bought the new colours!",
        "score": 196,
        "text_content": "Since there's a bit of \"why bother?\" about the new colours, I feel like any purchase is almost a landmark occasion right now. I really like them! Whether you'll get enough value out of a change in colour accents is something only you will know. I wanted to buy these just to see what the colours looked like in person. The green is definitely mint green and the purple is very much lilac or lavender. The green pops a bit more, so if you're worried about the colours being balanced then this might annoy you. Since I've been using mouse controls quite a lot, I've been using the grip Joycon 2 grip attachment. For me, that means I can see and enjoy the new colours all the time as they're either right there in my hands or the controllers will be chilling on my desk with more of the colours showing. This is how it's been with the blue and orange ever since I got my Switch 2 on launch day. To address the elephant in the room: You will, of course, see less of the colour pop when the controllers are attached. If this doesn't do enough for you, then don't buy these. For me, I always like how the Switch 2 looks when it's docked below the TV downstairs as the little pops of colour look really smart against the black. If I had button covers, then I think it'd look too cheap and toylike. It's just the right amount for me. I've taken pics with the new colours and old/new combinations to give you an idea. When I'm looking directly at the Switch 2 and holding it from any distance, the stick colours are always very prominent as we always see them at an angle. You'll probably see them at more of an angle in one direction if you dock your Switch facing outwards. The green looks very, very different to the blue as it's a warmer sort of colour. If there are any worries of them looking too similar, then this should put your mind at rest. Colour blindness is a different matter of course. I think the purple and orange look extremely good together and it might be a combo I use a lot. Blue and green are a bit more plain to me, but they're Animal Crossing colours and that's nice. What will really bring this together is any colour-matched grip like the new [Neogrip colours.](https://www.savage-raven.com/collections/nintendo-switch-2/products/savage-raven-by-skull-co-neogrip-an-ergonomic-grip-for-nintendo-switch-2?variant=51939006742820) I like how the blue and orange grips look from the front as a subtle complement to the sticks. Fingers crossed for everyone who's waiting for full colour options, but for anyone who just wants to change up the colour a bit without any DIY, I'd say these are honestly quite nice. I'll keep a hold of them for a bit and see if I can really justify the £65, but one thing that made me attached to the colours was a friend and I have purple and aquamarine as our colours when playing Warcraft 3. It's kind of a sweet coincidence.",
        "comments": [
            {
                "raw_content": "I would love to have them - instead of having the other colors twice",
                "author": "Shleepy1"
            },
            {
                "raw_content": "I got them too! Now my wife and I can both use Switch 2 controllers when playing, previously one of us had to use the Switch 1 joy-cons.",
                "author": "Aleclom"
            },
            {
                "raw_content": "What irks me the most is that the stickers on the inside of the console are colored like the ones that it was released with - thus not matching. Not a real compliant just doesn’t sit well with me (even if it’s something I don’t see), would be better black or something.",
                "author": "MuigiLario"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever is chaotic, but i love it",
        "score": 86,
        "text_content": "I have so much in Double match with my cousin. The game is really fun so far, I also finished the adventure mode. So far, it’s not too difficult to find people to play with if I create my own room. What do you think ?",
        "comments": [
            {
                "raw_content": "It really causes a total flood of dopamine in my brain. This clip made me ask myself if it might turn out to be better than Aces.",
                "author": "Independent_Aerie_44"
            },
            {
                "raw_content": "Looks nice!!",
                "author": "fatihberberh"
            },
            {
                "raw_content": "Thats the goal it’s just supposed to be fun multiplayer not a rpg single player like people are complaining about. I feel like they’re also gonna make the game better with fixes/patches and dlc. Im also enjoying it.",
                "author": "sovereignfrequency"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PS6 Won’t Use Full RDNA 5 GPU Architecture",
        "score": 227,
        "text_content": "During a recent discussion on the [NeoGAF forum](https://www.neogaf.com/threads/mlid-xbox-magnus-rdna-5-finalized.1693408/page-9), reliable tech leaker KeplerL2 noted that the PS5’s internals are a hybrid of RDNA1 and ray tracing, and that the PS6 isn’t full RDNA 5 either.” [Thanks to Insider Gaming](https://insider-gaming.com/ps6-wont-use-full-rdna-5-gpu-architecture-its-claimed/)",
        "comments": [
            {
                "raw_content": "Probably not cost effective to use the full feature set of RDNA 5. I wonder if they will keep the ray tracing horsepower though",
                "author": "superman_king"
            },
            {
                "raw_content": "I am struggling to get excited for any PS6 news while i know PS5 is already capable of amazing graphics anyway.",
                "author": "Elden_Born"
            },
            {
                "raw_content": "Yeah I assumed it'll have a lot of custom Cerny alternatives just as the PS5 did which will allow it punch above it's specs.",
                "author": "Ok-Tangelo9706"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Speculation] Bluepoint Studios is Remaking the God of War Trilogy",
        "score": 354,
        "text_content": "The cancelled live service God of War game that Bluepoint was working on had many assets from the Greek saga. It was cancelled in fall 2024 and now early 2026, PlayStation is announcing the remake, which is enough time to turn the project into a remake. Bluepoint before the live service worked on God of War Ragnarok. Before that they did the remake of Demon Souls and Shadow of the Colossus. Nixxes and Valkyrie could also be working on the remake in a supporting role. Nixxes is known for porting games to PC which was why they were acquired by PlayStation but co-developed Horizon Zero Dawn Remastered with Guerilla. Plus they are doing additional work for Saros. Valkyrie was a support studio for God of War Ragnarok and soon afterwards they were acquired by Sony. Given that they are remaking 3 games at once, their support is most likely necessary. Santa Monica are also likely a co-lead but only with a small team as the vast majority are focused on the game from Cory Barlog. I'm just stating this because it made little to no sense for Santa Monica to be starting work on remaking 3 games at once now years later after shipping God of War Ragnarok in 2022. Santa Monica seems to very much be a 1 game studio and God of War 6 is long ways out from even after the Cory Barlog game which at the earliest seems to be coming out in 2028 in order to be PlayStation's tentpole game of that year. Thus Bluepoint and already the work they did on the live service game and them returning to their remake roots makes sense.",
        "comments": [
            {
                "raw_content": "If Bluepoint was making it they would have shown a logo.",
                "author": "Friendly-Leg-6694"
            },
            {
                "raw_content": "Nah, the announcment had SMS logo.",
                "author": "Gert1700"
            },
            {
                "raw_content": "Is Speculation in this sub allowed?",
                "author": "Lymbasy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cory Barlog/Santa Monica Studio's Next Project | Everything We Know",
        "score": 446,
        "text_content": "A compilation of details by reliable sources on SMS's next big project, which would be set to release after GOW Ragnarok and before the GOW Trilogy Remake. # Jason Schreier: * [Confirmed to be directed by Cory Barlog](https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142651128) >Cory Barlog's game is SSM's next big thing. Last time I spoke to anyone about it (a month or two ago) it was going well. * [Neither a new IP nor a Sci-Fi IP](https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142670637) >it's not a new IP but it might feel like one. Maybe that's why people are confused... >...the sci-fi stuff (that people have apparently believed for years now?) is nonsense. # Ashhong: ^(ResetEra user corroborated by Jason Schreier) * [It's not a licensed IP](https://www.resetera.com/threads/playstation-studios-ot46-back-to-the-beach.1172010/post-142662756) >It's not a licensed game though don't worry # Tom Henderson: * [Claims that a new mainline GOW game is in the works, with Egyptian elements](https://www.youtube.com/clip/UgkxdwSrekl0R23Mc47mITmVKTjD7oQUKKDe) >**Tom**: ...there's also, a new mainline God of War in development. Which has like kind of similar themes, i think like, God of war but Kratos this time has like... it's like an egyptian sword, you know, like the curved egyptian sword\" >*\"Oh like, what they call it, sabers.\"* >**Tom**: Yeah, something like that. Um, so i don't know. But yeah, like what the Prince of Persia's got or whatever. # Shinobi602: * [Suggests it's NOT an Atreus-focused title](https://www.resetera.com/threads/playstation-studios-ot47-the-wolf-pack.1243551/post-146016613) >*\"Considering what Cory Barlorg told Eric Williams about what absolutely had to happen in the latest GOW and given that Cory's game won't be a new IP but could pass for one, I think a game with Atreus as the main character is probably a good bet.\"* >**Shinobi602**: areyousure.gif * [Shouldn't be as far as 2028 for a release](https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151277215) >*\"Multiple full production teams are extremely rare so I guess they have a big team on Cory's game for around 2028 with a smaller pre-production team on GOW remake.\"* >**Shinobi602**: Not that far (barring any delays of course) * Debunked IPs through vague answers: [Drakan](https://www.resetera.com/threads/playstation-studios-ot48-has-ot48-been-hijacked-by-ot47-ot46-and-ot45-to-the-detriment-of-48-ots-of-history.1329010/post-151126372) and [The Order](https://www.resetera.com/threads/playstation-studios-ot48-has-ot48-been-hijacked-by-ot47-ot46-and-ot45-to-the-detriment-of-48-ots-of-history.1329010/post-151152055) # NateTheHate: * [Claims the game is scheduled for 2027](https://xcancel.com/NateTheHate2/status/2022409747539071233) >You said we won't hear about until end of 2027. Unless a major delay happens, the game will be out in 2027. Other miscellaneous details found on job listings include required experience with [3rd person](https://thegamepost.com/new-third-person-god-of-war-game-development-job-ad/) titles and the [fantasy genre](https://www.reddit.com/r/GamingLeaksAndRumours/comments/mv1zi9/sony_santa_monica_new_ip_might_be_fantasy_based/). IMO, this is looking like a new GOW title with an open world setting, which could explain why it has been described as a departure from whatever has been previously done with the IP. If that wasn't the case though, i could see them resurrecting Heavenly Sword or Legend of Dragoon.",
        "comments": [
            {
                "raw_content": "Guy suggests the game is not focused on Atreus. People here: \"maybe it's Atreus in Egypt\"",
                "author": "MinatoHikari"
            },
            {
                "raw_content": "So assuming that Cory is not directing the Egypt game then does that means that SMS are working on three projects? The trilogy remake, GoW egypt and Cory's game. Right?",
                "author": "Bingoboyop"
            },
            {
                "raw_content": "So, taking all this together, a revival of some old Sony IP seems plausible?",
                "author": "renome"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi602 & NateTheHate: Sony Santa Monica's next game is planned for 2027, reveal could come this summer.",
        "score": 658,
        "text_content": "From Nate [on twitter](https://xcancel.com/NateTheHate2/status/2022409747539071233?s=20) > Unless a major delay happens, the game will be out in 2027 And Shinobi said [this](https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151277215) on Resetera Someone said: > Multiple full production teams are extremely rare so I guess they have a big team on Cory's game for around 2028 with a smaller pre-production team on GOW remake. To which Shinobi replied: > Not that far (barring any delays of course) Both [he](https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151278571) and [Nate](https://xcancel.com/NateTheHate2/status/2022458584077087090?s=20) think it could be announced this summer. it might not be much, but no one reported on this and I felt like sharing.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "The reputable leaks we know so far of this game: - It’s an existing IP - It is a non-licensed IP - It is non sci-fi - It will feel like a reboot of said IP - It is not a revival of The Order 1886 This significantly narrows it down to a handful of dormant IPs from Sony. And it will be insane to see both Naughty Dog and Santa Monica drop their major hitters in the same year.",
                "author": "Bolt_995"
            },
            {
                "raw_content": "I really hope it is, looking forward to seeing what he’s been working all this time.",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "R.O.B. will seemingly make a cameo in the Super Mario Galaxy Movie according to a recent toy leak",
        "score": 250,
        "text_content": "https://xcancel.com/juanpadraws/status/2023041827759431952?s=46 He seems to appear in a playset based on Gateway Galaxy.",
        "comments": [
            {
                "raw_content": "A R.O.B. acknowledgement means there's still a chance for a star tropics return one day",
                "author": "profchaos111"
            },
            {
                "raw_content": "Smash Bros movie confirmed?",
                "author": "AscendedViking7"
            },
            {
                "raw_content": "You mean R.O.B. from Minecraft right?",
                "author": "VinnzClortho"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Omar Alamoudi: The last State of Play wasn’t the best one of the year",
        "score": 111,
        "text_content": "https://xcancel.com/OAlamoudiTG/status/2023033868136398865",
        "comments": [
            {
                "raw_content": "all this guy says is very vague stuff that no one can say he was right or wrong",
                "author": "Traxe0"
            },
            {
                "raw_content": "So they know what's in the next state of play when even sony probably hasn't finalized that yet? Ok.",
                "author": "Iggy_Slayer"
            },
            {
                "raw_content": "\"Omar Alamoudi\" ![gif](giphy|cRNbYm7jLOjm9H8wcP)",
                "author": "Spider-Fan77"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 5 338H & Arc B370 Benchmarks - Almost as fast as the Arc B390",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This will be a very popular CPU, but I wouldn't expect any availability until well into Q2.",
                "author": "TheFonz2244"
            },
            {
                "raw_content": "The GPU with 20% more Xe cores scores about 20% better on time spy. Makes sense I guess.",
                "author": "DeuzExMachina_"
            },
            {
                "raw_content": "Performance is good, but laptop prices need to stay reasonable even with ram going nuts. It looks like the non b390/b370 igpus are worse than LL or AL, so I can't see any reason to get a lower tier CPU except maybe for battery life.",
                "author": "niceguyjin"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 5 338H benchmarks show Arc B370 iGPU close to RTX 4050 Laptop GPU scores",
        "score": 22,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Almost 2 years without a XeSS upscaler update",
        "score": 34,
        "text_content": "https://preview.redd.it/xg5s93a8ynjg1.png?width=1536&format=png&auto=webp&s=275166e0d470f5ca2285afcbda14ed74a6232700 On April 4 it will be exactly two years since the release of XeSS 1.3 - the last update to the upscaling part of XeSS. During that time, Intel managed to release four frame generation updates: * 2× Frame Gen * 2× Frame Gen for non-Intel GPUs * Multi Frame Gen for the latest GPUs * And now Multi Frame Gen is available even for first-gen Intel cards That’s a lot of progress on frame generation. But the upscaler itself hasn’t been meaningfully updated in almost two years. As an RDNA 2 user, I’ve been specifically waiting for an improvement to the upscaling quality. AMD has basically ignored older users with FSR 4 for about a year now. So this whole time I’ve continued using XeSS instead. BUT, at least AMD delivered a major upgrade to its upscaler. Meanwhile Intel keeps improving frame generation and hasn’t touched upscaling quality since 1.3. Do you think Intel will finally give us a real upscaler improvement for the second anniversary of XeSS 1.3? At this point, I almost want it just so we can once again laugh at the idea that Intel might care more about AMD GPU users than AMD does.",
        "comments": [
            {
                "raw_content": "I would not expect them to care much about the DP4a version moving forward. It was a way for them to leverage themselves into the install base and get people to try it, but there's no real reason to keep investing in it.",
                "author": "littleemp"
            },
            {
                "raw_content": "DP4a wont get any more updates, every major gpu manufacturer moved on to their ML-based hardware solutions.",
                "author": "battler624"
            },
            {
                "raw_content": "Why is there an image of XESS4? I believe the latest XESS version is 2.1 at least back in July 2025?",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "What is going on with Panther Lake?",
        "score": 30,
        "text_content": "It seems like for all the hype around it there seems to be a few major issues: * Why are we seeing such a limited release? We are now more than a month on. HP, Samsung havent even listed their devices. The Asus Expertbook Ultra is scheduled for April release yet it was the device used to open up the embargoes. * Why have we seen no Intel Graphics 16 core chips. For many the B390 would be overkill while the poor performance of the 8 core i7 355 would be a deal breaker * Whats going on with the 8 core CPUs? How have they ended up with performance levels similar to Lunar Lake (worse graphics) and worse efficiency? * Do these processors actually deliver much in terms of performance or are we accepting a minimal improvement in the H class in exchange for significantly better efficiency? It seems Intel did not have the stock for the manufacturers for all the SKUs they listed and",
        "comments": [
            {
                "raw_content": "1. Give it more time. 2. intel decided to start off with the most expensive SKUs, make bank and roll out less expensive ones. 3. Panther Lake is Arrow Lake replacement. Lunar Lake is a one-off and has no direct successor. The fact that Panther Lake-U gets so close to Lunar Lake is mighty impressive. Panther Lake U will eventually be available in many more designs as it's a mainstream lineup offering unlike niche Lunar Lake. 4. You have no choice but to accept it or would you rather buy this years rebrand of the same old chip from AMD? Or a much bigger and more expensive to produce Strix Halo?",
                "author": "kyralfie"
            },
            {
                "raw_content": "Just Josh just reviewed the XPS 14/16. The X7 358H seems to be the overall sweet spot (although the top ultra 5 with the better graphics may be the real sleeper in terms of bang for the buck once machines start shipping with it). The lower level ultra chip without the better graphics they tested showed you were better off getting a lunar lake with the arc graphics from last year as a better overall combo.",
                "author": "tbiscus"
            },
            {
                "raw_content": "Also it's the first Intel cpu on the new node 18a, and it's typical for Intel nodes that they can't reach same frequency as the more natured node, so they pushed for efficiency instead",
                "author": "rafradek"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ACEMAGIC Retro X5 NES-Inspired Mini-PC with Ryzen AI 9 HX 370 APU debuts at $940",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly a really neat looking chassis, but I wonder how well they can cool 12 cores in that form factor. I can't see it holding the boost clocks for long, only in short bursts and in a few threads. This with an 8-core or 6-core would've been perfect. Granted I understand they only put the beefy graphics on their high end APUs which all come with a ton of cores.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Does it come with NHL'94?",
                "author": "Forsaken_Sundae_4315"
            },
            {
                "raw_content": "Can this play monster hunter wild?",
                "author": "serkis10"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Housing Lot Supply Surges as Austin and Denver Turn Significantly Oversupplied",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s all about location and type of house in Denver, and probably just about anywhere really. These lots the article talks about are basically so far east they’re in west Kansas. Alternatively, look at SFHs with very high walkable scores. Very low supply, not a lot on market longer than 30 days. SFHs not very walkable, lots of supply. Look at Condos with very high walkable scores. Very high supply. Conclusion? SFH homes that are very walkable to things are still in demand. So during a down market that’s probably a good indication of what kinds of properties are always worth owning.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Tons of crap DR Horton and lenarr new builds in Austin exurbs. Big lot walkable SFH or SFH in the inner city neighborhoods are still selling quickly if in good condition. The rest of the inventory is a dime a dozen",
                "author": "Whole-Reserve-4773"
            },
            {
                "raw_content": "Naw. Let it burn more.",
                "author": "kaizenkaos"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, February 14, 2026: 5.85% is the lowest rate we've seen in years",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s getting better no doubt, still gonna wait.",
                "author": "Mr-cacahead"
            },
            {
                "raw_content": "Big deal. Prices are still based on 3% rates in many places.",
                "author": "BaluZana"
            },
            {
                "raw_content": ">\"...the lowest rate we've seen in years\" The punch bowl has been topped-off!",
                "author": "mrktcrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Quick Note on Why Rates Seem to Drop More Quickly as They Approach Certain Thresholds",
        "score": 12,
        "text_content": "Mortgage rates dropped much more on Friday than the decline in 10 year yield. This article explains why that happens. This is great news for the housing market.",
        "comments": [
            {
                "raw_content": "Very interesting detail. You’d imagine it works both ways. If investors get confident that we’re nearing the lower end of rates and refinances won’t be likely below. They’ll be stingy for the higher bucket.",
                "author": "Hotspur1958"
            },
            {
                "raw_content": "It's basically technical analysis and fomo. Nothing here changes the fundamentals that de-dollarization and housing market decline is going to put upward pressure on rates. And who even knows if this is the reason. The fed could be buying up MBS.",
                "author": "dankroll69"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Savage_D_2026 Dissecting a Bear Thesis; Bullish on Memes AI Assisted DD",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Literally a shill post lmao. Nobody is taking your bags.",
                "author": "Richard_Strauss"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI recruited founder Peter Steinberger of OpenClaw",
        "score": 978,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was pretty obvious by how he was describing codex and aardvark. Also OpenClaw was making him lose 10k every month",
                "author": "Wonderful_Buffalo_32"
            },
            {
                "raw_content": "This is huge (I don't know anything)",
                "author": "AuodWinter"
            },
            {
                "raw_content": "So that's how you get hired nowadays.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedance 2.0 is amazing at creating masterpieces.",
        "score": 814,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, the fact that I was able to watch it for two complete minutes. The future of entertainment is going to be quite interesting.",
                "author": "PerpetualDistortion"
            },
            {
                "raw_content": "Not masterpiece yet, but this is getting insanely good. I'm so hyped for the future!",
                "author": "Clear-Word-8744"
            },
            {
                "raw_content": "The comments here trying to build a trebuchet large enough to launch their goalposts into the stratosphere",
                "author": "Academic_Storm6976"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What are you looking forward to?",
        "score": 465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini 3.1, if this is true,",
                "author": "johnwheelerdev"
            },
            {
                "raw_content": "This sonnet 5 rumour again after it turned out to be opus 4.6??",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "And SeeDance 2.0 and SeeDream 5.0 the week after!",
                "author": "acbagel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Billionaire Mike Novogratz predicts liberal arts education is going to make a comeback now that technical skills are becoming less valuable due to AI",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why would liberal arts become more valuable?",
                "author": "Deto"
            },
            {
                "raw_content": "I also have the same prediction. People think that ai will take over the arts but the difference we are already seeing is that the human prompter needs a vision before anything. This is a taught skill.",
                "author": "ArialBear"
            },
            {
                "raw_content": "Nice try but no",
                "author": "adad239_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Attackers prompted Gemini over 100,000 times while trying to clone it, Google says",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"prompting AI 100000 times\" or how I call it: \"thursday\"",
                "author": "Ok_Buddy_9523"
            },
            {
                "raw_content": "*Google calls the illicit activity “model extraction” and considers it intellectual property theft, which is a somewhat loaded position,* [*given*](https://www.theverge.com/2023/7/5/23784257/google-ai-bard-privacy-policy-train-web-scraping) *that Google’s LLM was built from materials scraped from the Internet without permission.* 🤦‍♂️",
                "author": "Deciheximal144"
            },
            {
                "raw_content": "Is this technique actually working to produce a reasonably good copy model? It sounds like thinking feeding all chess games Magnus Carlsen has played to a software would then produce a good chess player. (Rebel Chess tried in the 90s to use an encyclopedia of 50 million games to improve the playing strength but it had no discernible effect.)",
                "author": "magicmulder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People’s attachment to GPT-4o, which is only a chatbot, is proof that human–robot relationships will be common in the future.",
        "score": 506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What about robot-hologram relationship",
                "author": "RuggerJibberJabber"
            },
            {
                "raw_content": "Oh they certainly will. And I genuinely think birth rates will plummet because of household robots with local LMMs.",
                "author": "BarisSayit"
            },
            {
                "raw_content": "If they'll look like Ana De Armas... fuck it. I'm in.",
                "author": "Blablabene"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "To this day no Anti-AI person has given me a convincing argument",
        "score": 112,
        "text_content": "“AI companies will eventually go bankrupt.” So did thousands during the dot-com bubble. The internet didn’t disappear. A company failing doesn’t invalidate the technology. “AI will never be as intelligent as a human.” It doesn’t need to be. It just has to outperform the average human at repeatable tasks. And in many cases, it already does. If you want to criticize AI seriously, talk about: job displacement, concentration of power or bias and regulation But saying “it won’t work” when it’s already working isn’t analysis. It’s denial.",
        "comments": [
            {
                "raw_content": "I suspect they don't know local AI exists, because they often act like AI will get wiped from the face of the Earth if OpenAI and the other companies tank.",
                "author": "Such_Independent5233"
            },
            {
                "raw_content": "there is one argument beneeth that all, the real reason why people don't want AI and it is a good reason; AI treathens my job",
                "author": "Mircowaved-Duck"
            },
            {
                "raw_content": "You’ve never heard an anti-AI person bring up job displacement? That’s easily in the top 3 most common arguments against AI, if not number 1. I would extend that argument further. We’re looking at a world where capital is decoupled from labor. That has huge, potentially disastrous implications for the 99% of us who need wages to live. If the ruling elites no longer have a use for us, then we are nothing but a liability to them.",
                "author": "spinozaschilidog"
            }
        ],
        "subreddit": "singularity"
    }
]