[
    {
        "post_name": "Expose and Fire: Meet Alachua County (Florida, Gainesville) School Board Chair Sarah Rockwell. She celebrated Hulk Hogan’s death and wrote “Good. One less MAGA in the world.” This person is in charge of children’s education. Any comment @AlachuaSchools ??",
        "score": 1275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/libsoftiktok/status/1948887289989362017 - TDS ✅ - Problem glasses ✅ - Fugly ✅ - Train ❌ - Says her prayers ❌ - Eats her vitamins ❌ - Be true to herself ❌ - Be true to her country ❌ - Be a real American ❌",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "I've said this a million times, if you want to clean up the shithole known as American education, you have to break up the unions. They are all getting their marching orders from the incredibly nasty and retarded Randi Weingarten, and nobody seems to point in her direction whatsoever. She instructs the local unions on her warped agenda, then it flows to the boards who also have to follow lock, stock and barrel.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Ugly ass tranny Wario can't even cut \"her\" bangs in a straight line",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump vs Obama",
        "score": 581,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am expecting that thing on the right to start moving and Jawas to come out of it.",
                "author": "DT170x"
            },
            {
                "raw_content": "The Trump Tower is four decades old and still beautiful and timeless, meanwhile that Obama building is not even finished and already looks like a total disaster.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "That thing is hideous, an obamanation one might say. It perfectly captures his vision for this nation.",
                "author": "Giant_Schwartz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe this will get England off its butt.",
        "score": 618,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Muslim invasion in Europe is SCARY. Especially considering at least other non-whites TRY to assimilate. Muslims do NOT assimilate, or make any effort at all.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "LOL mos def. It's on in the UK just watch.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "As a semi-distant second, anime waifus and stuff are being hit.",
                "author": "dres3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: “FIREAID” IS A TOTAL DISASTER. LOOKS LIKE ANOTHER DEMOCRAT INSPIRED SCAM. 100 MILLION DOLLARS IS MISSING. WAS SUPPOSED TO TO GO TO THE LOS ANGELES FIRE VICTIMS, FIRES THAT, WITH PROPER MANAGEMENT, WOULD NEVER HAVE EVEN HAPPENED. GOVERNOR NEWSCUM REFUSED TO RELEASE BILLIONS OF GALLONS OF WATER",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're missing the point of FireAid. It wasn't suppose to help the LA Fire Victims, it was suppose to help the fired Democrats.",
                "author": "AlvinOfTheTrumpmunks"
            },
            {
                "raw_content": "Invent the problem then invent the cure…. Steal money the whole way",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "I love having GEOTUS hammering Newsom and Bass. It’s almost like getting a new Governor in California.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: I’m in Scotland now. Many meetings planned!!!",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If he wears a kilt...... 😆",
                "author": "Here_we_go"
            },
            {
                "raw_content": "I love the Scottish people, Connor Macleod a great Scotsman, good friend of mine. He's quite old, looks great. Also William Wallace, did many great things. Macbeth, a total disaster, took some bad advice, didn't know what he was doing. Sad!",
                "author": "swarleybing"
            },
            {
                "raw_content": "the trouble with Scotland, is that it's full of Scots.",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Would-be Trump assassin Ryan Routh’s son Oran Routh sentenced to seven years in prison for possessing child porn.",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like he didn't want to go along with what they wanted him to say...",
                "author": "jughaid"
            },
            {
                "raw_content": "This is what happens when E Jean Carroll is your father.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Didn't this also happen to the Las Vegas shooter's brother?",
                "author": "Jefferson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These DOGE cuts are getting insane.",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Illuminati has entered the chat...",
                "author": "D__1"
            },
            {
                "raw_content": "lol, made me laugh. Why not make a little tiny spec of dust?",
                "author": "Tongs_Ya_Bass"
            },
            {
                "raw_content": "Honestly, I think Pelosi's House Bar is probably costing us much more.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Court blocks ammunition background checks in new blow to California’s gun control framework",
        "score": 1409,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9th circuit Court of appeals has read the shall not be infringed part of the second amendment.",
                "author": "airborne3502"
            },
            {
                "raw_content": "“Because none of the historical analogues proffered by California is within the relevant time frame, or is relevantly similar to California’s ammunition background check regime, California’s ammunition background check regime does not survive scrutiny under the two-step Bruen analysis,” Ikuta wrote. In a fiery dissent, Judge Jay Bybee said the decision failed to correctly apply the Bruen test, and that using the logic of the decision, any firearms regulation could be interpreted as a violation of the Second Amendment. Yeah, no fucking shit dickless. The way the founding fathers intended.",
                "author": "m0ntsta"
            },
            {
                "raw_content": "Midway is now shipping to CA. If you order over $100 you get free shipping. Also, they are not collecting CA ammo tax, just regular sales tax. FUCK CALIFORNIA.",
                "author": "Walt_Kowalski"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Ghislaine Maxwell received limited immunity during meetings with deputy AG, per ABC",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is BIG! Well, we wanted the Epstein list, here it comes.",
                "author": "magaboom"
            },
            {
                "raw_content": "Probably means she can't be charged as a result of new information provided. It actually provides a massive incentive to provide as much information as possible because you are shielded from prosecution for crimes they may not even know about.",
                "author": "Zskills"
            },
            {
                "raw_content": "If Maxwell says that Trump wasn't there the TDS morons will just claim that she is lying so she can get a pardon or immunity.",
                "author": "Danofdestiny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The S&P 500 just closed at ANOTHER record high… …it also did this on Monday, Tuesday, Wednesday and Thursday. First time in 4 years.",
        "score": 1214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shrug",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "And inflation played no role whatsoever! It's all fundamentals!",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Don’t give a shit til the price at the pump, grocery store, and restaurants come down",
                "author": "CaptainWinston"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: According to her attorney, Ghislaine Maxwell has supplied the Department of Justice with information on approximately 100 individuals linked to Jeffrey Epstein",
        "score": 1766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's odd that our alphabet-soup agencies have never before officially interviewed her, that we know of.",
                "author": "loooooof"
            },
            {
                "raw_content": "I'm just going to sit back and let this play out before I make any sort of assumption. This is like crazy world, right now.",
                "author": "IllKissYourBoobies"
            },
            {
                "raw_content": "so yer tellin' me there's a list",
                "author": "blueeyephoto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mollie Hemingway: Bombshell Russiagate Docs Indict The Media: That's Why They're Hiding Them \"They pushed this absolute delusional conspiracy theory for years.\" \"Now that we know the real story...The media are hiding it. And why? Because they were complicit in the crimes that were committed.\"",
        "score": 1169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They deserve to face justice too. Yeah, I know. But a girl can dream.",
                "author": "AsaNisiMAGA"
            },
            {
                "raw_content": "Anybody see the Colbert reaction on his show when Clair Danes started talking about how intelligence agencies were working with the media? It’s from an episode from 2018 and his reaction is so fucking obvious it’s spooky. Bro, really did sell out years ago and is a coward.",
                "author": "_Sully_"
            },
            {
                "raw_content": "Yep",
                "author": "Greenhills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keep it simple",
        "score": 433,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except the 2 wings of same birds thing",
                "author": "keeptherepublic1776"
            },
            {
                "raw_content": "Lol you wish!",
                "author": "CanadianTrump2"
            },
            {
                "raw_content": "Okay, but what does it accomplish? Nothing can pass without 60 votes and Democrat voters don't support any of these things anyway, so voting no doesn't hurt them.",
                "author": "dogofwar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan to Stephen A. Smith: \"When you don't enforce the law and you don't show consequences, people feel welcome to come across. It overwhelms the Border Patrol.\" \"We cannot support illegal activity. We just can't do it. It sends a bad message to the whole world.\"",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have been waiting for years",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "There can be ZERO incentives for illegal migration, this includes any form of amnesty.",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "&#65038; Now punish the NGOs conspiring to bring in the MILLIONS of illegals. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember when Hulk Hogan sued Gawker into oblivion? This person does.",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Goose meme: WHY DID YOU LOSE YOUR JOB?",
                "author": "HuntsBiden"
            },
            {
                "raw_content": "It's really disturbing how many people think it makes total sense to use a man's death to shit all over him like they've never had sorry moments in their lives. And they all have this shit just loaded like he was an authoritarian dictator who murdered his own people. Nah, the dude was crass and said some shit fucking years ago. I hope all those people burn in fucking hell.",
                "author": "_Sully_"
            },
            {
                "raw_content": "That’s the most flattering photo she had. Don’t imagine how she really looks when you’re eating.",
                "author": "Neonentity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The President of Media Matters is on MSDNC melting down over Trump and how he has completely kneecapped the liberal media outlets: \"We're at the beginning stages of a massive transformation of of, uh, and a closure of and a reduction in civic spaces.\"",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To MSNBC: Fuck your civic spaces and your safe spaces you commie weirdo cocksuckers, suck these nuts I know your journalists are here reading this you bulldyke faggots",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": ">Cutting off our USAID money is literal fascism! Shariablue shills on suicide watch",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "No, not Media Matters! Where will I get my propaganda from now?",
                "author": "Iremembermypassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING – MASSIVE VICTORY: A judge sided with President Trump and DISMISSED multiple lawsuits challenging the dismantling of USAID. Trump just got the green light to finish GUTTING the corrupt organization. LFG!",
        "score": 1983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's what I voted for",
                "author": "TrumpCare"
            },
            {
                "raw_content": "You notice these propaganda tv shows suddenly going out of business",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Big win",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump has said he will give them “a list” of Jeffrey Epstein associates, per NYP",
        "score": 1497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is *them?*",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "I'm loyal to Trump to the end, but they couldn't have handled this whole thing any worse unless there is some real 4D chess going on - in which it never seems to happen.",
                "author": "America_No_1"
            },
            {
                "raw_content": "Huh? Trump is giving who what now? Trump has the mythical list that doesn't exist? How does he know anything if he wasn't involved? Why is Pam Bondi such an asshole for starting this mess?",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anyone else notice that CIA/State slushfund USAID just closed up and suddenly a bunch of liberal TV shows and news sites are no longer able to meet their payroll and have to shut down?",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop noticing",
                "author": "Juzeza"
            },
            {
                "raw_content": "They were never viable business ventures",
                "author": "ClarenceBeeks"
            },
            {
                "raw_content": "It's raised an eyebrow and a few chuckles from me, yes.",
                "author": "FateOfNorns"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FAFO. The medical workers in California who decided to block ICE agents from arresting an illegal have NOW BEEN CRIMINALLY CHARGED, per Fox.",
        "score": 1768,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep your hands off Federal agents.",
                "author": "Saltyminer11"
            },
            {
                "raw_content": "Dude should've had back up to arrest every single one of these tards",
                "author": "JBiggly"
            },
            {
                "raw_content": "Eat shit leftists",
                "author": "BallsackPaneer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Final Benchmarks Of Clear Linux On Intel: ~48% Faster Than Ubuntu Out-Of-The-Box",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish to see benchmarks of Gentoo which can be also compiled and tuned to specific CPU",
                "author": "lutel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel slumps as potential foundry exit deepens investor gloom",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah...I was worried about this. You can only do so much cutting before investors start worrying about the ability to continue forward.",
                "author": "Shogouki"
            },
            {
                "raw_content": "RIP that dude who gambled his grandpa's $700k on INTC",
                "author": "puffz0r"
            },
            {
                "raw_content": "I've had a thing against big blue for a while, but that was back when we had other US chip fabs. IBM's Fishkill fab, Motorola's just utter buckling, and now Intel.....this is depressing as hell. The semiconductor industry was something the US changed the world with, and now we whimper away in the name of pleasing shareholders.",
                "author": "Logical_Specific_59"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Intel Reveals Plan To Spin Off Networking Business In Memo",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like private equity. Article says Intel plans to maintain a large stake in new entity, probably modelled after their spin-out of Altera. If the whole unit was sold, my money would be on Broadcom. This would be right up their alley.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Another correct call by Reuters that reported this over 60 days ago: https://www.reuters.com/technology/intel-explores-sale-networking-edge-unit-sources-say-2025-05-20/ Today, CRN has obtained official confirmation by Intel after going light of a memo recently shared to Intel customers.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "From Light Reading: In 2024, Nokia dropped Intel from its latest 5G RAN boxes and shifted to Arm. After the networking division at Intel posted big operating losses (-$500 million) due to “telecom sales”, Intel was even considering a sale under CEO Gelsinger. https://www.lightreading.com/5g/after-losing-nokia-crisis-hit-intel-seeks-network-assets-buyer",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Digital Foundry: \"Cyberpunk 2077 Mac DF Review - Mac Mini/MacBook Pro/Mac Studio Tested - PC Perf Comparisons + More!\"",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those wondering as with others outlets they find the M4 Max is similar to a RTX 4060.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "The stutters really take away from what is written \"no driver updates to contend with, there's no need to worry about some obscure parts combination that could cause headaches\" Reporting heavy frame drops during combat and then pretending there is nothing that causes headaches... This seems like really shallow reporting. Would also be interesting to see some efficiency curves. Im also a bit confused why only the 4060 Desktop and 5060TI Desktop were chosen in this comparison. Some reports claim the FPS/W for the 5090M is on paar with the M4 Max for maxed out settings but more FPS for the 5090M, and we see not a single Zen 4/Zen 5 APU like the Z1 Extreme or Ryzen AI 370 at default TDP. This picked comparison is... interesting.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "[Digital Foundry also posted an article on Eurogamer.](https://www.eurogamer.net/digitalfoundry-2025-cyberpunk-2077-apple-mac-review-an-impressive-thoughtful-port-from-cd-projekt-red)",
                "author": "Dakhil"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Two more Exynos 2600 Geekbench 6 results spotted today, on par with the Snapdragon 8 Elite",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Matching the last generation Qualcomm SoC.",
                "author": "Darkknight1939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Threadripper 9000 Series Available On 31 July, 9980X For $4999 USD",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Realized too late it might be better to post the [original source](https://www.amd.com/en/blogs/2025/designed-to-create-built-to-inspire-amd-introduces-new.html). Prices are much more interesting than the Pro/WX line, starting at $1500 for 24 cores. I think they would definitely be lower if there was some kind of competition though.",
                "author": "Kryohi"
            },
            {
                "raw_content": "I'd happily pay 3x 9950X price for a CPU that's 2x 9950X in cores, but somehow AMD doesn't want to make that",
                "author": "Tystros"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What happens now with Frore Systems AirJet?",
        "score": 27,
        "text_content": "I heard about it for the first time back in CES 2023 thanks to [Gordon](https://www.youtube.com/watch?v=WibczqINifA) from PCWorld. They have been on this year's [Computex](https://www.youtube.com/watch?v=O_C9EusL3dE) for their gen 2 stuff. But now I wonder why their AirJets are not more widely available in more devices such as gaming handheld or laptop? It looked very promising.",
        "comments": [
            {
                "raw_content": "The only review I saw showed the concept definitely works, but it's not as revolutionary as one might expect from marketing: [Zotac Zbox pico PI430AJ review: The world's first mini PC with active AirJet technology cools the Intel Core i3-N300 in a 0.055 gal case - NotebookCheck.net Reviews](https://www.notebookcheck.net/Zotac-Zbox-pico-PI430AJ-review-The-world-s-first-mini-PC-with-active-AirJet-technology-cools-the-Intel-Core-i3-N300-in-a-0-055-gal-case.794472.0.html) This is with 2x AirJet Minis (*should* dissipate \\~10.5W), but it struggled to prevent throttling even at 8W. >The Intel Core i3-N300 struggled to maintain a consistently high performance due to these increased CPU temperatures. Telemetry data indicated a **gradual decline in performance** as the SoC temperature rose. Additionally, the power consumption **never exceeded** **eight watts** throughout the test, resulting in a final average score of only 386 points. It also seemed to have a high peak + high frequency noise output under strenuous conditions, which is regrettable for a previously passive mini PC: >The system, however, doesn't operate in complete silence, as indicated by our measurement results. At idle, the volume level is a very low approximately 26.6 dB(A). With moderate load, the noise level increases to 29.4 dB(A). It's important to note a peak noise level slightly exceeding 40 dB(A). Additionally, the subjective perception of volume may seem somewhat louder due to the high-frequency cooling noise. The biggest benefit seems to be the z-height & zero maintenance: it *could* fit into much thinner devices and allow a bigger performance gap vs heatsink + fans, plus never needing to clean out fans after a few years is a win. // Now, perhaps Zotac should've gone with the larger AirJet Pros or set a much more aggresive thermal limit or NBC could've tested the passive version for the best comparison. I've not seen any more thorough tests of the AirJet 1st gen. Maybe we'll see that for 2nd gen now. // As mentioned by many & Frore now, too, AirJets would be interesting in smaller devices like SSDs or high-bitrate 4K/8K digital cameras or maybe even gaming phone coolers. [IIRC some are being made](https://www.tomshardware.com/tech-industry/iodyne-launches-external-ssd-with-frores-airjet-cooler-for-sustained-3gbs-performance), but not in any mass-market sense. At this point, if the camera industry [will try Peltier cooling](https://www.ulanzi.com/products/thermostatic-semiconductor-camera-cooler-cu01?_pos=2&_psq=cooling+fan&_ss=e&_v=1.0), surely AirJets can't be that crazy.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "They're making their way with embedded products: https://www.froresystems.com/about-us/where-to-buy-airjet If you want to buy one the [Zotac PI430AJ](https://www.newegg.com/zotac-zbox-p-series-barebone-systems-mini-pc-intel-core-i3-n300-zbox-pi430aj-glb/p/2SW-0004-00084?item=9SIAMFBK7M7008&source=region) is available for ~$400 right now.",
                "author": "throwaway12junk"
            },
            {
                "raw_content": "Not sure , but remember reading something about it being too power hungry.",
                "author": "fatso486"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sony wants to expand \"PlayStation Studios games beyond PlayStation hardware\" — hiring to partner with Xbox, Steam, Nintendo Switch, and more",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Astro Bot would do very well on switch",
                "author": "TreeBushFire"
            },
            {
                "raw_content": "Bloodborne on Switch 2",
                "author": "WilliamWong1016hk"
            },
            {
                "raw_content": "God of war and ratchet and clank on a switch will be peak gaming for me",
                "author": "tiorteD_snotsiP"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World Split Screen Online Is A Complete Disappointment",
        "score": 155,
        "text_content": "My wife and I played a ton of Mario Kart 8 and loved each having our own account for split screen online. It was so great to each have our own unique identity and progression. For whatever reason Nintendo has decided to take steps backward and reduce the second player to the role of guest by not allowing them to use their own account. Why am I paying for two accounts if we can't use both accounts? But alright, fine. We'll try it out anyways. The main online mode is 90% driving to the actual course. Once you get there you get one lap and thats it. The incredible soundtracks do not get any room to breathe. You don't get any time to get a feel for the map or learn any shortcuts before its already over and you go back to the lobby to wait to find out where you are driving to next. As someone who pretty much only played MK8 splitscreen online I am just so disappointed by this iteration. And I know Nintendo is so far behind the curb with listening to player feedback so I just dont see this getting any better. I doubt we will put much time into this iteration. But then you get that really great Rainbow Road 5 stage race and you remember why you love this series lol",
        "comments": [
            {
                "raw_content": "I just want to play free roam with my son. Insane you can’t do that",
                "author": "usernamesarehard44"
            },
            {
                "raw_content": "Open your heart to playing Knockout Tour with your wife. It's a real relationship builder.",
                "author": "crunchwrap_jones"
            },
            {
                "raw_content": "Mkw is really weird. I like it well enough as a casual mkw fan who just plays it with people who come over occasionally, but looking on the mkw subreddit and reading comments here and there on the Internet the game seems to disappoint casual fans and more hardcore players. So, I mean, that's just happening. I think it's fine, it's just not really clear how you're supposed to play it. There are all these tricks and shortcuts and the fastest route is still just driving straight most of the time. Strange game.",
                "author": "xansies1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fun Fact! Changing The Switch 2's System Language Between \"UK/Australia\" & \"The Americas\" Changes the Zelda BOTW game icon!",
        "score": 89,
        "text_content": "Not sure how well known this is but I had to change my system country settings for the Nintendo Playtest and decided to change the language as well and was surprised to see the Zelda BOTW game icon change to the American version! Which icon do you prefer more?",
        "comments": [
            {
                "raw_content": "North American BOTW art is raw as fuck. That being said; the vibrancy on the european/australian box art is very pleasing to look at.",
                "author": "jamemeus"
            },
            {
                "raw_content": "Oh damn! I had no clue, I'm in UK region so I had the more vibrant one but I wish there was an option to switch around cuz recently got a poster and it's the same art as the US one",
                "author": "Miwoo0"
            },
            {
                "raw_content": "This happen with BOTW in switch 1 also",
                "author": "Makiavelo32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally Got My Switch 2 Invintation But I Already Have One Lol",
        "score": 217,
        "text_content": "Better late than never I suppose lol",
        "comments": [
            {
                "raw_content": "mark this is good news",
                "author": "ineedalotofhelp09"
            },
            {
                "raw_content": "Literally same. Couldn't trust I'd get the Nintendo invite sooner than I could get it from Best Buy preorder",
                "author": "jackattacka95"
            },
            {
                "raw_content": "Same, I got the email in the same batch. I got mine day one at best buy",
                "author": "HumphreyBlodart"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "2069!?",
        "score": 95,
        "text_content": "I got my Nintendo Shop Switch 2 invite and I've ordered it for my sister. I guess we'll see it in 2069. 🤣",
        "comments": [
            {
                "raw_content": "It’s actually 1969, so it arrived a while ago",
                "author": "luxmesa"
            },
            {
                "raw_content": "1969. Jan 1st, 1970 is the zero date for Unix timestamps. I’m guessing that you are in a negative time zone so it’s taking the zero date to give you a time on December 31st, 1969.",
                "author": "dashingThroughSnow12"
            },
            {
                "raw_content": "Nice",
                "author": "Nitrogen567"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "the camera system in Donkey Kong Banaza isn’t perfect but man i love this feature…",
        "score": 321,
        "text_content": "The underground tunneling in this game is so fun and the way you can see other paths/tunnels you create while underground is unique and something i haven’t seen in a 3D game before.",
        "comments": [
            {
                "raw_content": "yea it really was probably quite the head scratcher figuring about the best way to display things to maintain visibility while underground. it works very well, the only issue I have with it is in some situations where you may be in sort of \"in between\" underground and above ground, the sky will sort of swap back and forth from \"sky\" to \"underground sky\" very abruptly. but overall very impressed",
                "author": "ayyyyycrisp"
            },
            {
                "raw_content": ">15k gold and 130 banandium chips and bro has yet to hit the title screen There's a whole game in there, go play it lmao",
                "author": "ShinyGrezz"
            },
            {
                "raw_content": "Manage to find a banana doing that once. It's still kind of mind blowing to me that most of the environments are destructible",
                "author": "BrattyTwilis"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Took me too long to finally get it 😭",
        "score": 245,
        "text_content": "Finally home stranger hospitality can take people a long way",
        "comments": [
            {
                "raw_content": "![gif](giphy|Dx0ca9wpJ0lX8sodJs)",
                "author": "jpassc"
            },
            {
                "raw_content": "Congrats my friend",
                "author": "Sandy12315"
            },
            {
                "raw_content": "nice 👍. here’s a banana 🍌",
                "author": "Continuous_G"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wild Heart S released today for Nintendo Switch 2",
        "score": 25,
        "text_content": "Developed by Omega Force and published by Koei Tecmo costs $49.99 https://www.nintendo.com/us/store/products/wild-hearts-s-switch-2/?srsltid=AfmBOopK0ytSI_O35rISsbji2wsTO7Ym4aEeK-uGUmDObhulF_LgWeIc",
        "comments": [
            {
                "raw_content": "I'll buy it if they put a 30 FPS cap option. It's just too all-over-the-place.",
                "author": "733MHz"
            },
            {
                "raw_content": "I'm glad to have this game back in my life. I fell in love with it when it first came out. I got all the achievements, which is something I very rarely do. I hunted and hunted and hunted until the player pool dried up. With the Switch 2 release, there is an influx of players and it's fun to play it again. I would recommend people don't sleep on it if they like Monster Hunter games. Yes, it doesn't look amazing and has some performance issues. It always has on every platform. But, for me, gameplay is king. It's not just the moment-to-moment combat; it's all the little systems that make it for me. The Karakuri is an obvious one. It's not just useful in battle, but it's also got a purpose for getting around the map or just establishing little bases. Combined with the Dragon Pit mechanic, there can actually be a bit of strategy in terms of how you place Karakuri. People can visit your world, and you can visit theirs (under certain circumstances). It's quite neat. Sometimes you'll be in a stage and you'll say \"I didn't put that there.\" No, someone else did. (This isn't a live service game and can be played entirely offline, so this is just a neat extra.) With the weapon tree, skills can be carried across to an upgraded weapon. But you can't take them all, so you have to choose wisely. It can also mean that taking rather unconventional routes through the tree is beneficial rather than just beelining it to the weapon you want. The armour has a mechanic where you can morph it either to a human form or a Kemono form. Certain skills and attributes on weapons and armour only activate if you are committed to one path, so there's a lot to think about your builds and play styles. I used to have a great late-game weapon, but it needed a fully human setup to get the best out of it. When I switched my armour set, none of the perks would activate. (I just ground out a second one to use with Kemono armour.) Plus it's got all the usual stuff, like running around the world farming stuff. One nice thing I like is that you can actually farm minor Kemono by petting them rather than killing them. Some of them are kind of docile and cute, so I love this option. I wouldn't say the story is the attraction, but it's there and it's not awful. There's plenty of side quests, too. And the soundtrack is fantastic. I actually enjoy the game much more than Monster Hunter Wilds, even with the dodgy graphics. I've basically been playing for like 5 hours straight today. I realise the graphics, price, of key card shenanigans will put many off, but I really hope people can get past those things if they are intrigued in the game. It won't last you forever, but you can easily get a few hundred hours out of it if it clicks with you.",
                "author": "Fenicillin"
            },
            {
                "raw_content": "It has notoriously bad optimization that was never addressed. Best on a $10 sale they they do on steam from time to time",
                "author": "CorporateSharkbait"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sony job listing signals intention to expand multiplatform strategy (including Xbox and Nintendo platforms)",
        "score": 677,
        "text_content": "https://job-boards.greenhouse.io/sonyinteractiveentertainmentglobal/jobs/5587289004 > Reporting to the Vice President, Commercial Management as Senior Director of Multiplatform & Account Management, you will play a critical leadership role in shaping and executing the global commercial strategy for PlayStation Studios software titles across all digital platforms beyond PlayStation hardware, including Steam, Epic Games Store, Xbox, Nintendo, and mobile. This role is accountable for optimizing title profitability, ensuring cross-functional alignment, and leading a high-performing team focused on multiplatform expansion, mid-range commercial planning, and platform partner management.",
        "comments": [
            {
                "raw_content": "Gravity rush gang, rise up! (It's only me :/) ![gif](giphy|l3q2CTnVPs0olBAOI|downsized)",
                "author": "KvasirTheOld"
            },
            {
                "raw_content": "We are in the endgame.",
                "author": "LinkedInParkPremium"
            },
            {
                "raw_content": "\"4 Games\". Hilarious that is even more transparent than the beginnings of Xbox's porting strategy which seemed to only mention vague references to \"multiplatform\" in job listings. They're *outright* naming Xbox and Nintendo here openly.. for a company which used to purposely avoid any mention of their competitors. Suggests a radical shift in vision.",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sega/Atlus leaker teases Persona 3 Reload appearing in the Nintendo Direct",
        "score": 370,
        "text_content": "https://www.resetera.com/threads/vgc-corroborates-imminent-nintendo-direct-rumors.1253175/page-6#post-143102976 >I'll tell you there are many obvious ports coming, for instance. >Keep reloading the news feed. This user has a history of leaking Atlus and Sega reveals just before they happen. Like Yakuza 0 Director's Cut and both Persona 3 Reload and Persona 4 Revive's existence.",
        "comments": [
            {
                "raw_content": "Don’t have to leak stuff like this, really. With how damn popular this console is, devs will continue to trip over each other to get their games ported over to switch 2. Atlus’s recent games getting ported is a matter of when, not if",
                "author": "BlueIndividual76"
            },
            {
                "raw_content": "Yeah, that seems expected. Metaphor and Persona 3 Reload getting Switch 2 ports feels pretty likely.",
                "author": "ToothlessFTW"
            },
            {
                "raw_content": "My friend uses \"Switch 2 port\" as an excuse to stall playing games for as long as possible and this was one of them lol He caved on Metaphor because Metaphor is peak fiction but this would definitely push him over. I'd double dip as well when I get my Switch 2",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Variety] Kilter Films signed to produce 'Wolfenstein' live-action series for Amazon",
        "score": 299,
        "text_content": "[Variety has exclusively broken](https://variety.com/2025/tv/news/wolfenstein-tv-series-amazon-kilter-patrick-somerville-1236469609/) that Kilter Films, who currently produces *Fallout* for Amazon Prime Video, will be taking the reins on another Bethesda property for the streamer, this time boarding a planned live-action adaptation of id Software's *Wolfenstein*. *Maniac* and *Station Eleven* creator Patrick Somerville is attached as showrunner and will executive produce alongside Lisa Joy and Jonathan Nolan, who are collaborating again after previously aiding Fallout. Jerk Gustasson, who co-directed MachineGames' reboot *Wolfenstein: The New Order* and recently directed *Indiana Jones and the Great Circle*, will also executive produce. Plot details under wraps.",
        "comments": [
            {
                "raw_content": "Call Alan Ritchson's agent and tell him we have a generational cast on our hands. But I really love how wolfenstain 2 nailed the themes of the worrying rise of fascism and the reasons for it.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "Fuck yeah. Now if only we can get a sequel to New Colossus as well.",
                "author": "Kyro_Official_"
            },
            {
                "raw_content": "Genuinely wondering what they do here because unlike Fallout, Wolf actually has defined and heavily ingrained character writing and is far more driven by a core cast or specifically named characters than Fallout being from the POV of a nameless protagonist you insert yourself as, especially the MachineGames entries which have like a whole proper supporting cast of people through the American resistance aiding Blazkowicz. There's a much better case to be made of this being a more straightforward adaptation rather than just an original story in continuity, though that could be interesting as well if they set it in Nazi America from another perspective It'd be crazy if this is how we get the resolution to Youngblood's cliffhanger lol",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC has corroborated NatetheHate's claim of an imminent Nintendo Direct",
        "score": 632,
        "text_content": "https://www.videogameschronicle.com/news/with-release-news-expected-soon-metroid-prime-4-has-been-rated/ That Direct is definitely coming sooner rather than later.",
        "comments": [
            {
                "raw_content": "Wednesday July 30th at 6:00am PST / 9:00am EST. I'll eat a hat live on Twitch if this isn't the exact date and time of the next Nintendo Direct.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I love how that wording makes it sound a bit threatening.",
                "author": "RipMcStudly"
            },
            {
                "raw_content": "How much protein is in the average hat?",
                "author": "jj_olli"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Plants vs. Zombies: Replanted Preorder Recording Taken Down & Cover Art Leaked",
        "score": 267,
        "text_content": "Jay, a prominent figurehead in the Plants vs. Zombies community, has confirmed yesterday's footage showcasing someone trying to preorder Plants vs. Zombies: Replanted [has been taken down by Electronic Arts.](https://xcancel.com/Hey1mJay/status/1948719139981590966) On top of this, the cover art has leaked. [Very low-res image, but here.](https://i.imgur.com/sEK8x2b.png) The original leak mentioned the game having a Switch release- possible that it is formally revealed during the July Nintendo Direct?",
        "comments": [
            {
                "raw_content": "Full-screen PC PVZ without the black bars finally I still need to 100% the game on PC, but I did get the plat on Vita :) I'm really curious about what this will even add. Could it potentially add a new world? Or some new plants.",
                "author": "DarwinDa5"
            },
            {
                "raw_content": "The last PvZ game on mobile had some of the worst microtransactions I've ever seen... Can't wait to see how badly they fuck this up.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "October release date mentioned in the video by the way. (Sorry I’m on mobile so I don’t think I can shorten the link) https://youtu.be/sGNTdYbIhXo Reveal imminent?",
                "author": "Tolstartheking"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Deallabs: SpongeBob SquarePants: Titans of the Tide Releases November 18th on PS5, Xbox Series, Switch 2 & PC!",
        "score": 278,
        "text_content": "__Source:__ https://www.dealabs.com/magazine/bob-leponge-est-de-retour-un-nouveau-jeu-video-prevu-pour-cet-automne-60284 SpongeBob SquarePants: Titans of the Tide will be available for PC, PlayStation 5, Xbox Series X|S and Nintendo Switch 2 on November 18th 2025. Likely to be announced either at the Nintendo Direct or THQ Nordic Showcase. This is the next SpongeBob game by Purple Lamp after Cosmic Shake and BFBB Rehydrated, [originally teased last year](https://youtube.com/watch?v=BYcXWK2jJZc&t=27s). It will be priced at $39.99/€39.99 on all platforms. The physical release will only be available on PlayStation 5 and Switch 2.",
        "comments": [
            {
                "raw_content": "Hope we someday get a remake of the movie game, that was really good.",
                "author": "StoBeneStallion"
            },
            {
                "raw_content": "likely to be announced at THQ showcase*",
                "author": "Metalfy"
            },
            {
                "raw_content": "That’s pretty cool that the studio can bust out another game only 2 years after The Cosmic Shake (and a year after Epic Mickey Rebrushed). Hopefully its at least on par with their last Spongebob game",
                "author": "Bananaslammma"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Metroid Prime 4: Beyond has been rated in Korea",
        "score": 433,
        "text_content": "https://www.grac.or.kr/Statistics/Popup/Pop_ReasonInfo.aspx?914b326d87c6070f0760b092a83d753ca6c813a6a053e8e5ec12581d53453bb0 Another sign for a Nintendo Direct coming very soon.",
        "comments": [
            {
                "raw_content": "\"Man i wonder if that delay rumor is true\" The humble age ratings board: ![gif](giphy|pOwfkBoezfkFRkVmVX)",
                "author": "Legospacememe"
            },
            {
                "raw_content": "The past 24h have been a rollercoaster for us Metroid fans.",
                "author": "Luck88"
            },
            {
                "raw_content": "Well, here’s our answer about KiwiTalkz BS from yesterday.",
                "author": "Tubim"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Next Generation RDNA 5 GPU Lineup Leaked: Up to 184 CUs 128GB GDDR7, Top Gaming Model at 154 CUs 36GB GDDR7 with performance at 2.64x of RTX 4080.",
        "score": 215,
        "text_content": "|Segment|TBP|Compute Units|Memory (36 Gbps GDDR7)|Bus Width| |:--:|:--:|:--:|:--:|:--:| |CGVDI|600W|184|128GB|512| |CGVDI|350W|138|96GB|384| |Desktop Gaming|380W|154|36GB|384| |AI|450W|184|72GB|384| |Desktop Gaming|275W|64|18GB|192| |Desktop Gaming|235W|48|15GB|160| |Desktop Gaming|210W|44|12GB|128| |AI|300W|64|48GB|192| |AI|300W|64|48GB|192| |AI|125W|64|48GB|192| These models already have Compute Units cut down for yield reasons. Maximum size might be over 190 CUs. Source: [https://youtu.be/uLsykckkoZU?t=771](https://youtu.be/uLsykckkoZU?t=771) Estimated performance of the 154 Compute Units 36GB DDR7 Gaming model to be **2.64x** of an RTX 4080. [https://youtu.be/uLsykckkoZU?t=1000](https://youtu.be/uLsykckkoZU?t=1000) Kepler confirmed that the leaked document is genuine, but has slightly fudged numbers which he speculated was aimed at catching leakers. [https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/page-23#post-41481919](https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/page-23#post-41481919)",
        "comments": [
            {
                "raw_content": "It’s the “time to hype up next AMD GPU” time of the year again",
                "author": "Henrarzz"
            },
            {
                "raw_content": "I thought their next generation was meant to be UDNA but I guess I misremembered",
                "author": "nothanksbroo"
            },
            {
                "raw_content": "The 5090 is only 70% faster than a 4080 and costs what? Like 3K? There's no way that AMD is going to release a card that is 164% faster than a 4080. But if they do, it will cost like 5K because of the insane greed all these companies have.",
                "author": "DaemonXHUN"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen™ Master Release Notes (3.0.0.4199)",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It appears that 3.0 is only compatible with Ryzen 9000 and newer.",
                "author": "ahk057"
            },
            {
                "raw_content": "As much as I would like to use RM, the headaches it causes makes it not worth it for me right now.",
                "author": "Desmond_Winters"
            },
            {
                "raw_content": "Still no Linux support.",
                "author": "sob727"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Southwest Florida housing slump forces Sarasota homebuilder into bankruptcy",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I'm not going to tell you who the builder is...\" no wait...",
                "author": "Echoeversky"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seattle's housing market is finally looking like the rest of the nation",
        "score": 164,
        "text_content": "I haven't seen so many listings in the Seattle-Tacoma metro area since ... ever. Things are about to break towards the historical averages (home price to income ratio), and possibly go below. The article's stats are from June, when I thought there was an increasing amount of homes on the market. The inventory exploded this month, and stats should back up what I'm seeing in real-time in a week or two. [https://komonews.com/news/local/seattle-housing-market-real-estate-experts-remax-emerald-city-2015-king-county-lake-union-jeff-tucker-principal-economist-borrowers-treasury-yield](https://komonews.com/news/local/seattle-housing-market-real-estate-experts-remax-emerald-city-2015-king-county-lake-union-jeff-tucker-principal-economist-borrowers-treasury-yield)",
        "comments": [
            {
                "raw_content": "I really hope inventory continues to rise. Everyone was screaming about how inventory would never increase and that we were going to be locked into housing scarcity forever.",
                "author": "bostonlilypad"
            },
            {
                "raw_content": "House of cards falling nationwide.",
                "author": "Safe_Mousse7438"
            },
            {
                "raw_content": "Seattle’s inflated market was a result of people mass exodus’ing the bay area in search of affordable housing but similar salaries. Seattle will never be able to compete with the bay area level of wealth so similarly priced homes are going to face some harsh realities. I also believe the bay area is insanely overpriced but Seattle- man- their housing market is fucked",
                "author": "Texaspilot24"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Here's what a Redfin data journalist learned from taking a $25K bath on the sale of his house",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lesson learned here is not following the old 5 year advice rule before buying a house. You should expect to stay in that home for at min 5 yrs before selling to increase your odds of at least breaking even after selling fees, taxes, repairs, etc. And I would say it should be at minimum 7-10 yrs today. But paying out $25k for 2 years of living costs isn't that bad and in-line with renting a SFH in South City, MO.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Senior Data Journalist Mark Worley co-authored a new Redfin report showing that roughly 6% of U.S. home sellers are at risk of selling at a loss. The analysis hit close to home—he and his wife just did exactly that, selling their St. Louis home for less than they paid. In early 2022, my wife and I were temporarily living downstairs at her parents’ house, south of Seattle, trying to work out where to move next. We had just returned from my native Australia, where I had been posted by a previous employer to help open a new office. (Long story short: the office opened a few weeks before the pandemic hit and we spent much of our time abroad under covid-related lockdowns and curfews.) Like many at the time, we could work from home and live anywhere in the country. We looked at a map and considered our options. We didn’t want to follow the crowds flocking to pandemic homebuying boom towns like Austin or Tampa. With a relatively constrained budget, we looked to the more-affordable Midwest, and landed on St. Louis. I had connections in St. Louis—my Oklahoman dad spent time living there in his younger years. And when I hit the road to explore the U.S. a decade ago, St. Louis was my favorite stop. The city is a long way from its heyday, but it has a rich history, world-class arts and cultural institutions, a dynamic food scene, friendly people…and gorgeous homes. There, within a mile or two of the iconic Gateway Arch, one can find a beautifully renovated historic brick home in a walkable, tree-lined neighborhood for less than the price of a one-bedroom apartment back in Seattle. We packed up our car and moved to the center of the country. Chasing our dream home…and losing out We chased dream homes for months—putting in offers well over asking price, adding escalation clauses and waiving inspections where possible. It wasn’t enough. We ended up as the second-placed offer on four separate occasions and it felt like we would never find a home. Even as rising inflation pushed mortgage rates skyward in mid-late 2022, and the real estate market started sputtering nationally, it didn’t feel that way in St. Louis. The homes we wanted were listed on Thursday and went under contract by Monday, if they even made it that far (many were snapped up before the first open house). I remember telling my wife at the time it didn’t make sense to rent in a city where buying was so affordable. So onward we went with our house hunt. Now, with 20-20 hindsight, I know the better financial decision would have been to rent. Instead, we returned to a house that had been sitting on the market for more than two months—unusual given the speed most homes were snapped up at that time. It was a beautiful old South City home, completely renovated with all the modern upgrades we were looking for. It had a lovely yard with a two-story carriage house for a garage. We had initially ruled it out because it was priced a little high and located outside of the neighborhoods we wanted to live in, but after losing out so many times we had to shift our strategy. We offered $50,000 under its original list price and the sellers couldn’t sign the paperwork quickly enough—definitely a red flag in hindsight. None of this is to say we regret buying the property. We loved that house. And we truly loved living in St. Louis. But we overpaid, setting a then-record for the neighborhood. We bought at the very top of the market in a part of the city where homes did not sell quickly. Two years later, life changed and we had a new decision to make Less than two years after moving in, our life changed. My wife was pregnant, I had a job offer with a great company in Seattle and we decided to move back closer to our family and friends. We had two options: sell the house, or rent it out. It was an easy choice. We knew the stress—and cost—of maintaining a 130-year-old rental property from 2,000 miles away, while taking care of a newborn baby, was too much for us to handle. St. Louis home prices had continued to rise in the two years after we bought, but in our neighborhood, sales were slow. Buyers were no longer overextending themselves the way we had. So we listed our home at the same price that we had bought it, knowing we were taking a loss when agent fees and closing costs were taken into account. Not a single potential buyer came to view the house in the first two weeks it was on the market. By then, we were back in the Pacific Northwest, carrying rent payments in addition to our mortgage. The weather was turning cold and homebuying season was almost over. We lowered the price by $25,000 and a single out-of-state buyer saw the home online and fell in love, much as we had. They made an offer at the revised list price that we gratefully accepted. This time, we were the sellers rushing to get the paperwork signed so we could finally exhale. We successfully closed the deal last November. Very few homeowners in the U.S. are at risk of selling their homes for less than they bought them for. But those who have to sell now, after buying at the tail end of the pandemic buying spree, are much more likely than others to take a hit. We learned that the hard way. Buying a home will always be a long-term investment. Trying to time the market is a fool’s errand. Still, while we walked away with less money, we were carrying two years of amazing memories, new friendships and a beautiful baby girl. In my mind, we came out ahead.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I live in this area, and it is still one of the most affordable ones in the nation. But according to the article “we overpaid, setting a then-record for the neighborhood.” Yeah, that’ll definitely come back to bite you if you go to sell two years later. Always want to be the cheapest house in the best neighborhood, not the reverse of that.",
                "author": "downwithpencils"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In a desperate bid to help homeowner bag holders, Missouri passes legislation to eliminate state-level capital gains taxes on homes, in order to reignite the housing market Ponzi scheme.",
        "score": 67,
        "text_content": "Even with positive equity, if you can't actually sell the home for the price you want, then that appreciation means nothing. The home is only worth whatever the next buyer is willing to pay. It's not like the stock market where you click the 'sell' button and you're done. If and until it sells, it's just paper wealth, and you're stuck with the monthly carrying costs forever, which eats into whatever gains you were hoping for. * Starting in 2025, individuals in Missouri can deduct 100% of their federal capital gains from state taxable income. * This means no state income tax on long-term gains from selling homes, businesses, stocks, or other assets.",
        "comments": [
            {
                "raw_content": "Trying to juice the wealth transfer and encourage boomers to cash out before they check out. I expect more of this probably on a federal level.",
                "author": "No_Cut4338"
            },
            {
                "raw_content": "Exactly! The state is colluding with large investors to continue enriching them while defrauding the public. This tax makes it easier for big investors to dump undervalued properties they have been propping up while crashing the economy and the market for the single family owner.",
                "author": "davecskul"
            },
            {
                "raw_content": "Capital gains are on profits. No one that benefits is “holding a bag”. You’d actually need to make at least $250k in profit for a single filer or $500k for married filing jointly on a home sale. They get to deduct federal capital gains against their state owed taxes. This is stupid and only benefits the wealthy but there are no bag holders in this scenario just corruption.",
                "author": "Acceptable-Peace-69"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "JPMorgan Chase: Homebuyers Now Have To Spend 45% More of Their Incomes on Mortgages — Is Homeownership Still Worth It?",
        "score": 166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "JPMorgan you fucking tools.",
                "author": "stargarnet79"
            },
            {
                "raw_content": "Lol renters have to spend 45%+ of their incomes on rent...",
                "author": "ktaktb"
            },
            {
                "raw_content": "Yes, homeownership is definitely worth it. If we give up our homes, whats the point of working if we cant have any luxury or peace or happiness whatsoever- the real question, is 'capitalism' even worth it?",
                "author": "Superb_Nectarine9992"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Listing Today, No Showings Normal?",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let the panic begin!",
                "author": "Buffalo-Soldier420"
            },
            {
                "raw_content": "Date the rate marry the house, because you’ll be upside down for 10 years",
                "author": "Spiritual-Tailor9209"
            },
            {
                "raw_content": "New normal lol",
                "author": "DragAccomplished1731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tampa Bay's Office Market Booming Amid National Downturn",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI are now stealth routing all o3 requests to GPT-5",
        "score": 514,
        "text_content": "It appears OpenAI are now routing all o3 requests in ChatGPT to GPT-5 (new anonymous OpenAI model \"zenith\" in LMArena). It now gets extremely difficult mathematics questions o3 had a 0% success rate in correct/very close to correct and is significantly different stylistically to o3. Credit to @AcerFur on Twitter for this discovery!",
        "comments": [
            {
                "raw_content": "Damn, and this performance comes from a model that isn't as strong as the one that got the gold medal...",
                "author": "Box_Robot0"
            },
            {
                "raw_content": "I've gotten tons of \"which answer do you like better\" surveys using o3 recently. Makes sense if some of them are gpt 5",
                "author": "TheOwlHypothesis"
            },
            {
                "raw_content": "Little update - it might not be **ALL** requests, but it seems pretty consistent, at least for math-related prompts. Could also be only a subset of users right now. Update #2 - it got an even more difficult question right and did it very briefly with a perfect counter-example. [https://chatgpt.com/s/t\\_68842c7357e88191898d79d28af40819](https://chatgpt.com/s/t_68842c7357e88191898d79d28af40819) For whatever reason the prompt doesn't show on ChatGPT, so to clarify it was \"The \\\\textit{repeat} of a positive integer is obtained by writing it twice in a row. For example, the repeat of $254$ is $254254$. Is there a positive integer whose repeat is a square number?\"",
                "author": "ShreckAndDonkey123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google's new feature in Veo 3: you can now draw your instructions on the first frame, and Veo follows them. Instead of iterating endlessly on the perfect prompt, you can just draw it out like you would for a human artist.",
        "score": 932,
        "text_content": "[https://x.com/bilawalsidhu/status/1948844167603310660](https://x.com/bilawalsidhu/status/1948844167603310660)",
        "comments": [
            {
                "raw_content": "Crazy, One step closer to hyper-specificity",
                "author": "Beeehives"
            },
            {
                "raw_content": "Yep this is the game changer in video generation. Pure creative control. Imagine what creatives actually versed in cinematography will be able to create, mixed with character consistency.",
                "author": "Goofball-John-McGee"
            },
            {
                "raw_content": "I wish we were at the point where you could get endless generations for a subscription. It's just too expensive to play with right now.",
                "author": "RichRingoLangly"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI safety solved.",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You forgot time.sleep(120) and printing the answer 3 characters at a time",
                "author": "XInTheDark"
            },
            {
                "raw_content": "https://i.redd.it/r4xolkayy5ff1.gif",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Prompt: don't destroy the world",
                "author": "Orange_Ninja"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"About 30% of Humanity’s Last Exam chemistry/biology answers are likely wrong\"",
        "score": 334,
        "text_content": "[https://www.futurehouse.org/research-announcements/hle-exam](https://www.futurehouse.org/research-announcements/hle-exam) \"*Humanity’s Last Exam has become the most prominent eval representing PhD-level research. We found the questions puzzling and investigated with a team of experts in biology and chemistry to evaluate the answer-reasoning pairs in Humanity’s Last Exam. We found that* ***29 ± 3.7% (95% CI)*** *of the text-only chemistry and biology questions had answers with directly conflicting evidence in peer reviewed literature. We believe this arose from the incentive used to build the benchmark. Based on human experts and our own research tools, we have created an HLE Bio/Chem Gold, a subset of AI and human validated questions.*\"",
        "comments": [
            {
                "raw_content": "It’s crazy that such a popular benchmark could be so obviously flawed.",
                "author": "Johnny20022002"
            },
            {
                "raw_content": "I played a role in curating some problems for the Humanity’s Last Exam benchmark (particularly in mathematics/computer science) so I have some insights. From my experience, the review process for creating these problems seemed rather hasty. Typically, we had some academic person A coming up with a problem to be tested against some SoTA LLMs, and it would then be sent for review if and only if it stumped at least some models. After the problem passed this initial assessment, it would then be added to a spreadsheet where other academics could review the work. Each problem could only be assigned to at most one other academic. If this reviewer deemed the problem to be good, it would be sent to QC for final review… but this person likely did NOT have the required subject expertise to answer the question without external help. Therefore, there were really only two academics reviewing any singular question, hence the issue…",
                "author": "EzMoneyBois"
            },
            {
                "raw_content": "I believe it. When I looked at some of the questions in my area of expertise (medicine) they didn't seem very well-written or clear cut.",
                "author": "sklantee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Getting nervous about these coding abilities",
        "score": 85,
        "text_content": "[https://www.reddit.com/r/OpenAI/comments/1m995nz/gpt\\_5\\_series\\_of\\_model/](https://www.reddit.com/r/OpenAI/comments/1m995nz/gpt_5_series_of_model/) I have a physics degree, 10+ years of SWE experience, and a half dozen hackathon wins. This shit is better than anything I could make in a WEEK from scratch with no AI help. The physics, the smooth FPS, the particle animation on collisions, wow. Now sure, I've been on r/singularity for years and seen this coming for a while (and pivoted my career to benefit maximally). But holy shit, I didn't think it would get this good this fast. I'm nervous for every white collar worker right now. I've also been using ChatGPT agent for over a week and while it's been rather disappointing, coding went from basically where Agent is now to this in 2-3 years, it won't be long before Agent is completing most tasks faster and more accurately than a human. You could say I'm nervous and excited!",
        "comments": [
            {
                "raw_content": "AI is undoubtedly the future. It just keeps getting better and better. See how professionals like translators and others in similar fields are adapting and evolving alongside these advancements. Wishing everyone the best on this incredible journey!",
                "author": "RomeInvictusmax"
            },
            {
                "raw_content": "I previously thought I got on the last chopper out of 'Nam being born in 1995, but now I'm certain I was actually 5+ years too late. Somewhere around 1985-1990 got on the last chopper in terms of having enough invested to retire and weather this upcoming societal upheaval. I could've retired at 40 if the moneytrain kept going for another decade but now I'm utterly fucked and destined to be part of the permanent underclass. SWE was the only job I was decent at and can do. I am 80% certain that I will no longer be employable as a software engineer in any capacity by January 1, 2028. 50% by January 1, 2027. AI is so exciting but terrifying at the same time. We can only pray that AI causes insane deflation and everything becomes largely abundant, because it's pretty much over if not.",
                "author": "Sprytex"
            },
            {
                "raw_content": "You should be nervous and excited! But every time one of these posts pops up, we need to talk about UBI (Universal Basic Income). If machines are going to displace the jobs of humans, then humans need to be taken care of in the meantime. If we don't implement something like UBI, AI companies will just run off with the profits into the sunset, and the wealth inequality gap will keep widening.",
                "author": "veganparrot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing Runway Aleph, a new way to edit, transform and generate video",
        "score": 712,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The changes in the film and animation industry will be absolutely insane in the next couple of years",
                "author": "aiiiven"
            },
            {
                "raw_content": "This might be the first genuinely useful AI tool for filmmakers",
                "author": "heyhellousername"
            },
            {
                "raw_content": "impressive honestly",
                "author": "Jabulon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree unveils its new R1 humanoid. Starting at $5,900 and weighing only 25kg. Cheaper than G1",
        "score": 1855,
        "text_content": "Unitree just unveiled the new R1 humanoid. Starting at $5,900 and weighing only 25kg (55lb).",
        "comments": [
            {
                "raw_content": "\"Can you make me breakfast\" \"No but check this out\" \\*does a flip\\*",
                "author": "Still_Mycologist753"
            },
            {
                "raw_content": "Just make them controlled by remote VR set with first person view and give them hands and you will do a revolution.",
                "author": "Tentativ0"
            },
            {
                "raw_content": "Now we just add a layer of medical-grade silicone...",
                "author": "No-Zookeepergame8837"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Company Employees Given Access To GPT-5",
        "score": 191,
        "text_content": "Hey all, my sister is a dev at a very large American based company and they were all given access to ChatGPT 5 “preview” this week. Was shocked to hear this as it felt pretty random. Surprised this news isn’t mentioned anywhere so just sharing here. Won’t say the name of the company as it’s not my news to drop and don’t want to get anyone in trouble but just sharing what I heard. Will say they have over 10k employees and are not specifically in the tech industry.",
        "comments": [
            {
                "raw_content": "https://i.redd.it/dsorfepnj3ff1.gif",
                "author": "Beeehives"
            },
            {
                "raw_content": "Can confirm my uncle works at Nintendo. Also my dad can beat up your dad.",
                "author": "Crestfallen92"
            },
            {
                "raw_content": "Did your sister just break her NDA?",
                "author": "Singularity-42"
            }
        ],
        "subreddit": "singularity"
    }
]