[
    {
        "post_name": "You can literally see where America started getting worse",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s actually insane that a president with will can slow immigration down the same amount the fucking GREAT DEPRESSION did.",
                "author": "lefty295"
            },
            {
                "raw_content": "We lost WW2",
                "author": "Friar_Pede"
            },
            {
                "raw_content": "I hate these charts that combine the stinky DO NOT REDEEEM H1B Indians with the people that cook my fried rice as Asians",
                "author": "fluffykitten"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VENEZUELA: Biden raised Maduro’s bounty to $25M, declared him a fugitive, & denied him head of state immunity making it lawful for US troops to arrest him on Venezuelan soil. Democrats now call the arrest Biden enabled and authorized 'illegal'.",
        "score": 685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boy they've got quite the juxtaposition on their hands here: Is it illegal because the autopen signed the documents? Or Is it legal because the autopen was binding authority? It's time to choose, Gordon...",
                "author": "The_Ikonoclast"
            },
            {
                "raw_content": "Arrest the Democrats.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Trump Derangement means mindless, brainless, opposition. No matter what. No matter how ridiculous.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "POTUS addresses the Venezuelan People in a Brief Message",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope someday it is declassified that Il Donaldo Trumpo is Trump's alt account.",
                "author": "3-10"
            },
            {
                "raw_content": "\"Fucking aroundo\" Holy shitto, I'm laughing so mucho",
                "author": "NerdRage"
            },
            {
                "raw_content": "🌮🌮🪇💃",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump says he is working to cut off BILLIONS in federal funding to Minnesota, California, AND Illinois.“We are NOT going to pay it anymore. We are NOT going to pay them, & we are NOT going to pay California & we are NOT going to pay lllinois—the big SLOB of a governor they have.\"",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pritzker is a joke. Pritzker is a mess. Pritzker is a big, fat waste.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Claw back the Fed COVID funds to CA lost due to fraud.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "It's a good start. Then start arresting these criminals.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I like how he thinks 🤷🏻‍♂️",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and then Derek Chauvin",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Sauce: https://x.com/johnrich/status/2007975856548065528?s=20",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "We are in such an information bubble. Julian Assange provided the drops everybody would be begging for now, but nobody reads anymore. It's all cable news slop that gets us amped up for some war until things got so bad here that the reverberations were too loud. Tina Peters is floated as a talking point instead of a definition of the tyranny that rules us. Everyday that she sits in jail is an exposure of how far we have fallen from the Bill of Rights.",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says it's time for EVERY SOMALI fraudster to be deported, including Rep. ILHAN OMAR",
        "score": 1460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every single last MF one of them must go, then work on the other five pain in the ass demographics after that.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I like the energy with what he says, but when is it becoming action?",
                "author": "EstadosUnidosPrimero"
            },
            {
                "raw_content": "*every somalian",
                "author": "Purple_Drank"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Libs of TikTok: \"The “Kafi, Musa dba Nuba” daycare in Utah which receives tax dollars and says they cater to kids who speak Arabic, is only open 6am-6:15am. A 15 minute a day daycare. I’m sure it’s totally legit.\"",
        "score": 1223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, their IQs must be off the charts to lear in less than 15 minutes.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Nick Shirley should be head of FBI. Change my mind.",
                "author": "MythArcana"
            },
            {
                "raw_content": "In the Muslim world it's okay to defraud and lie to nonbelievers...",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat run media refuse to show the celebrations",
        "score": 1151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Videos finally play, nice",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "..... in Buenos Aires That is a big difference.",
                "author": "footinmouth"
            },
            {
                "raw_content": "My wife (the normie neutral least politically plugged in person on the planet) said man everyone is really pissed at Trump for the Venezuela thing. I said, only rabid leftists are mad. If Hitler was alive today and Trump got him with a bunker buster, leftists would be screaming about extrajudicial assassinations without trial. 1000% guaranteed.",
                "author": "m0ntsta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🅱️ Failed Communist Zohran Mamdani has officially raised subway fares to $3 after stating that everything would be free.",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Umm I hate him too but this was decided before he was elected",
                "author": "georock"
            },
            {
                "raw_content": "He didn't raise them, a state agency did. And it was bus rates not subway",
                "author": "Friar_Pede"
            },
            {
                "raw_content": "KEK",
                "author": "RocketSprocket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minneapolis Craigslist post in search of child actors for daycare site where funding was “cruelly ripped away without cause.” “To help hurry this state vetting process, we are looking to hire 20 child actors for 3 days while state is present on site.” $1,500/day",
        "score": 1250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1000000% someone on our side trolling.",
                "author": "AccipiterQ"
            },
            {
                "raw_content": "Good one. But pretty clearly someone trolling. The triangle heads operate as clans, so they'd never advertise to outsiders, moreover, they don't read, so it would be word of mouth.",
                "author": "SuperDuperBasedMD"
            },
            {
                "raw_content": "We do a little trolling.",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Americans are calling for a CRIMINAL INVESTIGATION after a fake news reporter allegedly tried to DOX the identity of the Delta Force Commander - the highly secretive unit that carried out Maduro's capture. Seth Harp has now locked his account, fearing FAFO.",
        "score": 1179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Death by hanging. This country needs accountability for leftists so badly. They think they're untouchable.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "@sethharpesq anyone who puts 'Esquire' after their name is always an insufferable faggot edit: except maybe Bill S. Preston, Esq.",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "[Seth Harp's deleted but archived X post](https://archive.is/NA9cU) Hope the shitbag shares a cell with his idol Maduro, on top of his HBO show being canned.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reporter: “Who's in charge of Venezuela right now?” President Trump: “Don't ask me who's in charge because it’ll give an answer, and it will be very controversial.” Reporter: “What does that mean?” President Trump: “It means we’re in charge. We’re in charge.”",
        "score": 915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did he just declare we own Venezuela?",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "You can just do things.",
                "author": "ICEisNICE"
            },
            {
                "raw_content": "I didn't have Venezuela as our 51st state.. but I am interested in their culture, history and nature. I bet they have some really pretty locations there! I bet their food is top notch!",
                "author": "MixedBlacknWhite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Crackheads make more sense than the left.",
        "score": 1459,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a bunch of miserable, pathetic group 😅. I wish Trump would say breathing air is good for the body.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "just like the Bolshies in 1917",
                "author": "okboomer59"
            },
            {
                "raw_content": "I stuck around St. Petersburg / When I saw it was a-time for a change / Killed the czar and his ministers / Anastasia screamed in vain.",
                "author": "Rango"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Danish PM tells Trump to stop 'threats' against Greenland",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, let the people of Greenland decide.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "Wheres that meme where the fat girl named denmark comes in to say “she’s not interested” for greenland",
                "author": "CharlieKirksSon"
            },
            {
                "raw_content": "Shut up Denmark, we'll get to you later.",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YOU CAN’T MAKE THIS UP: 92-Year-Old Clinton Judge Who Denied Trump’s Hush-Money Removal to Federal Court and Blocked Venezuelan Gang Deportations Now Assigned to Preside Over Maduro Case in New York",
        "score": 1075,
        "text_content": "",
        "comments": [
            {
                "raw_content": "92 years old? That’s what’s fucked up about our government. Put him in some diapers and send his ass to bed!",
                "author": "Exsultate"
            },
            {
                "raw_content": "I know not everyone is looking at this site every day, but we knew this yesterday?",
                "author": "America_No_1"
            },
            {
                "raw_content": "WHO? WHO ASSIGNED HIM? WHO? THERE'S NEVER NAMES NAMED. EVENTUALLY THE BUCK STOPS AT SOMEONE. TRUMP? BONDI? HELLO?",
                "author": "assblast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BE RETARDED: Canadian officials say US health institutions no longer dependable for accurate information",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't trust any gov for health advice",
                "author": "twentytwentyfourr"
            },
            {
                "raw_content": "Canadia juss wanna kill ya, brah.",
                "author": "barwhack"
            },
            {
                "raw_content": "Also Canadian government: Feeling depressed? KiII yourself with MAID.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW LEVELS",
        "score": 1615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Again, dig in on the investigator, not the investigation. \"Strawman, this and that, blah blah blah\"",
                "author": "peeloutbozo"
            },
            {
                "raw_content": "So what I am reading here is he has a good idea of what happened if I have to guess.",
                "author": "Aambrick"
            },
            {
                "raw_content": "He doth protest too much.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Scott Adams confirms he is converting to Christianity for his last days on this earth. \"My own impending death...yes. It's coming. You don't need to talk me into it...I promise I will convert.\" Wow. Pray for Scott 🙏🏻",
        "score": 1444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While it's good he's thinking about it, he's still not quite there yet. His thinking of it as an insurance policy \"just in case those Christians are right\" instead of a true conversion (accepting Jesus and His Church.) Hopefully this does at least mean his talk of assisted suicide is off the table. I will continue to pray for him.",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "It is NEVER too late to ask for forgiveness",
                "author": "jsphere256"
            },
            {
                "raw_content": "No atheists in foxholes.",
                "author": "Skywise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So happy they are friends again! 🥰 2026 is going to be amazing!",
        "score": 1252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully DOGE can go into the Department of War and into elections this time around",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Usually, when Trump feuds with someone, it passes. Look at him and LIl' Marco.",
                "author": "26magarat"
            },
            {
                "raw_content": "Doge was doing so much work. Far more than any other department.",
                "author": "EstadosUnidosPrimero"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The special plane to deport Somali daycare scammers.",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not enough head room.",
                "author": "realsolidsnakeoil"
            },
            {
                "raw_content": "We're gonna need a bigger Beluga",
                "author": "Doritalos"
            },
            {
                "raw_content": "This is so fucking last week.",
                "author": "FatigueIsReaI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why the absence of a raw video standard stagnates webcam innovation",
        "score": 244,
        "text_content": "External webcams are often terrible, and there’s a clear reason for that: the antiquated USB Video Class (UVC) protocol. The protocol requires an already encoded video stream, meaning it has to happen at the webcam side. That has huge downsides, and here’s why. Unlike internal smartphone or laptop sensors that leverage direct MIPI CSI-2 pathways to a host device’s dedicated Image Signal Processor (ISP), external webcams are forced to perform complex demosaicing, noise reduction, and encoding locally. This architectural disconnect creates a \"silicon tax,\" requiring manufacturers to bundle redundant, power-hungry, and often thermally constrained processors within the camera housing. The result is high hardware costs and significant latency, all while the host device's superior AI-accelerated imaging hardware sits idle. The absence of a high-performance, raw-input standard for external webcams is a classic case of technological inertia and a hardware-to-software \"missing link\" in the USB ecosystem. While internal laptop cameras and smartphones utilize high-speed, low-level interfaces to deliver professional-grade imagery, external webcams are trapped in a legacy paradigm that forces them to be \"computers with a lens\" rather than simple sensors. The primary reason for the stagnation is the USB Video Class (UVC) specification. Most modern webcams still operate on UVC 1.1 or 1.5 (a standard last updated significantly in 2012). UVC was designed for \"plug-and-play\" simplicity, which requires the camera to present itself as a finished video source. To achieve this, the camera must output \"cooked\" video - typically in YUV, MJPEG, or H.264/H.265 formats. These formats are highly processed and often compressed. Because UVC lacks a robust, standardized \"Raw Bayer\" mode that operating systems can natively interpret without custom, sensor-specific drivers, the camera cannot simply send its raw data to the host. Instead, it must handle the heavy lifting of demosaicing, noise reduction, and color correction locally, before the data even hits the USB cable. Internal cameras (like those in your phone or laptop) use the MIPI CSI-2 (Camera Serial Interface). This is a low-latency, high-bandwidth protocol that connects the sensor directly to the host’s Image Signal Processor (ISP), a dedicated, highly efficient silicon block within the CPU/SoC. In contrast, external webcams are physically separated from the host's ISP by a USB controller. Because there is no standard \"MIPI-over-USB\" protocol, the host's powerful ISP sits idle while the webcam is forced to use a cheap, integrated onboard ISP. These onboard chips are often: * Thermally Constrained: Tucked into a tiny plastic housing, they throttle quickly. * Computationally Weak: They use simpler, lower-quality algorithms compared to the multi-billion-transistor ISPs in modern Ryzen, Intel, or Apple Silicon chips. * Power Hungry: They must encode high-bitrate video in real-time, leading to the heat and \"webcam lag\" common in 4K models. Transferring raw, uncompressed video is a massive bandwidth challenge. A standard 1080p, 60fps sensor output in raw 10-bit format generates roughly 1.2 to 1.5 Gbps. While USB 3.0 (5 Gbps) can theoretically handle this, the UVC protocol’s isochronous transfer overhead and the lack of a universal raw format make it impractical. Furthermore, \"Raw\" isn't just data; it's a specific map of the sensor’s unique physical imperfections. Every sensor needs a specific tuning profile (lens shading correction, dead pixel mapping, etc.). Without a standard \"Sensor Description Language\" that allows a webcam to tell a Windows or macOS driver exactly how to process its specific Bayer pattern and lens distortion, a \"Raw Webcam Standard\" would require a unique driver for every single model - breaking the \"plug-and-play\" promise of USB. Manufacturers like Logitech or Razer have little incentive to push for a raw standard. By keeping the processing onboard, they ensure cross-platform compatibility. If they relied on the host's ISP, a camera might look amazing on a high-end Mac but look like a 2005 flip phone on an older Windows PC because the host lacked the hardware-accelerated processing blocks or the specific tuning files. | Feature | Modern Internal Camera (MIPI) | Modern External Webcam (USB/UVC) | |---|---|---| | Data Format | Raw Bayer (Sensor Data) | Compressed/Processed (YUV/MJPEG) | | Processing | Host SoC ISP (Fast, Efficient) | Onboard DSP (Slow, Hot) | | Latency | Near-Zero | High (Encoding + Decoding) | | Cost | Low (Sensor only) | High (Sensor + Processor + RAM) | A potential path forward lies in PCIe tunneling over USB4/Thunderbolt. Since PCIe can carry any data type, a manufacturer could theoretically tunnel a MIPI signal over a USB-C cable directly to a virtual ISP driver. However, until the USB-IF (USB Implementers Forum) or a major OS vendor (like Microsoft or Apple) defines a universal raw imaging framework, we are stuck with expensive, power-hungry webcams that process video poorly just to fit through the narrow \"cooked\" pipe of the UVC standard. TL;DR: We need a proper raw video input protocol for webcams.",
        "comments": [
            {
                "raw_content": "A great write-up, but a few comments. > The protocol requires an enocded video stream I don't think this is true? Here's a project I found several years ago when I first started messing with Lattice FPGA's that does a raw steam implementation: https://github.com/circuitvalley/USB_C_Industrial_Camera_FPGA_USB3 How we got here (external cameras always encoding) is due to images being very data dense and being a media that lends itself well to compression. In the project above their full res / bit rate on an IMX477 can only run at 15 fps because that's 2.2 Gbps raw! Seems like peripheral bus technology needs to progress where bandwidth no longer is the limiting factor, but that isn't happening because imager size (in pixels) keeps growing at the same rate. This is how you find yourself going down the USB4 route. What's left out of this conversation is there are mediums for external raw image feeds exactly what you want. GMSL is a technology that does exactly what you are looking for, exposing the raw CSI data from the imager directly to the application processor. Trouble with this approach is a) coax cables suck for a consumer application b) tuning matters and is imager/hardware specific so now you don't have your hardware abstraction to make all devices behave the same.",
                "author": "DocTarr"
            },
            {
                "raw_content": "Fantastic write up! It has bothered me for years that ALL usb webcams run really hot, most over 100F (38C). Are there any video webcam products to purchase for PC that avoid UVC, leveraging my PC's CPU/GPU encoders?",
                "author": "al_cs1"
            },
            {
                "raw_content": "Hello hello. I am a camera engineer in the consumer electronics industry - i have worked for one of the companies mentioned here. Not going for insults here, and at the risk of stating the obvious, the reason UVC/USB webcam quality has stuck without improvement is _nobody_ and I mean nobody cares about this. Chiefly consumers who primarily only use a webcam for terrible quality zoom calls. Anyone who wants excellent video quality slaps a mirrorless on their desk, and once you do that, you're so far beyond where normal consumer interest ends it's not worth catering to you as an OEM. It's not like you could match that quality with a tiny webcam sensor. The only mfg who cares about webcam image quality YoY is Apple and that's mostly only since Apple Silicon came along when their flagship ISP started shipping on-package, and they conveniently only ship webcams in laptops and displays that already have an A/M series chip onboard. I like the idea presented here but it seems unlikely to happen. People (and companies) do prioritize plug and play over outright quality. It's hard to convince anyone to dedicate the resources run a 4k 12 bit raw feed via PCI into your computer, to run on god knows what ISP, to create a better looking image...just to feed 480p into Webex. If people seriously were going to do content creation with built in webcams (or external, I guess), it would be a different story, but see my first paragraph about mirrorless cameras. FWIW I've seen webcam sensors streamed at 4K60 at full bandwidth via MIPI. Bandwidth is not the only problem, these sensors/lenses are mostly _trash_ - you would not be confusing it for an iPhone.",
                "author": "nerdpox"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamers desert Intel in droves, as Steam share plummets from 81% to 55.6% in just five years",
        "score": 1031,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We didn't desert Intel... They're just not offering anything compelling.",
                "author": "msshammy"
            },
            {
                "raw_content": "Well are they gonna make a processor that matches the X3D of the same generation any time soon?",
                "author": "Hanselltc"
            },
            {
                "raw_content": "13/14th gen Intel had issues, and what came next was still lacking. Its safe to say we would be driven to Ryzen.",
                "author": "Fixitwithducttape42"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Engadget: \"Belkin announces a wireless HDMI dongle that doesn't need Wi-Fi access\"",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was super excited and then saw it’s just for 1080p …",
                "author": "roniadotnet"
            },
            {
                "raw_content": "There’s multiple of these on aliexpress for months now",
                "author": "Bluffz2"
            },
            {
                "raw_content": "Yet another proprietary protocol, yay... Just build it on top of existing protocols.",
                "author": "cantbelieveyoumademe"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LG unveils 2026 OLED TVs: Both G6 and C6 get upgraded Tandem panels",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So disingenuous to make 3 different \"C\" models, good way to confuse customers who read a C6H review and then buying a CS6/C6 without tandem OLED thinking it is as good.",
                "author": "Mech0z"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "YMTC rockets to 13% shipment share in NAND Flash, Micron now in sight",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yangtze Memory Technologies Corp (YMTC) has strengthened its position in the global NAND Flash market, exceeding a 10% shipment share in the first quarter of 2025 and rising to 13% in the third quarter, according to Nikkei, citing Counterpoint Research. The increase brings the Chinese supplier close to overtaking Micron Technology, the world's fourth-largest NAND vendor. YMTC's gains reflect wider adoption among Chinese notebook and smartphone brands, sustained government backing for local components, and a 10-20% price edge over Korean, US, and Japanese rivals, according to TechInsights. Analysts expect the company's full-year 2025 share to stay above 10%, while its revenue share — now 8% — may reach 10% by 2027, based on Counterpoint forecasts. **Capacity expansion and technology gains** YMTC targets a 15% global shipment share in 2026, supported by continuous fab expansion around Wuhan. Once these projects come online, the company's capacity could reach around 20% of global NAND supply, overtaking Kioxia and approaching SK Hynix's scale. YMTC has also recorded steady technical progress. Rival engineers noted that by early 2025, the company mass-produced NAND nearing 270 layers, matching leading products from Samsung Electronics and advancing in cost-efficient process steps. Adoption remains focused in China following US export restrictions since 2022, which placed YMTC on the Entity List and halted Apple's earlier sourcing plans. Despite these curbs, yield rates at Chinese memory fabs continue to improve. In DRAM, ChangXin Memory Technologies (CXMT) reached an 8% global share in the third quarter and commands about 40% of China's PC and mobile DRAM market, though it remains several generations behind leading suppliers in high-bandwidth memory (HBM). **China's broader memory offensive** Earlier Businesskorea reporting indicated China's combined DRAM and NAND share was set to surpass 10% by mid-2025, nearly doubling from 5.4% within a year. The growth reflects strong domestic demand and continued state financing despite stepped-up US export restrictions. Chinese memory firms are also advancing into higher-value segments. CXMT aims to complete HBM3 mass-production certification this year, with HBM3E expected within two years. YMTC also surprised the industry in February by mass-producing 294-layer NAND using hybrid bonding methods that some engineers say approach top-tier capability. China has also raised its R&D commitment. Domestic firms allocated 9.2% of semiconductor sales to R&D in 2024, up from 7.6% a year earlier, while the US, Japan, and Europe reduced their ratios, according to the Semiconductor Industry Association. **What YMTC's surge means for global competition** If YMTC advances toward its planned 20% of the global NAND capacity, major vendors may face increased pricing and competitive pressure, especially those heavily exposed to China. For instance, Kioxia earns about 20% of its revenue there. Quality and security concerns continue to restrict Chinese memory adoption outside China, but analysts caution that a lasting double-digit price advantage, paired with rising yields and more mature processes, could gradually shift global procurement decisions.",
                "author": "logosuwu"
            },
            {
                "raw_content": "China is tha largest NAND consumer in the world and the market for it is growing rapidly over there so a lot of this is just trying to get ahead of domestic sales and it'll probably be in the 2030s before the volume has a sizable impact on global markets. Game changer in the future but it isnt helping us now.",
                "author": "KR4T0S"
            },
            {
                "raw_content": "For anyone that is interested, Zhitai is their flagship, consumer facing brand. It also seems they used SM controllers. https://www.tomshardware.com/pc-components/ssds/chinese-pcie-5-0-ssd-tested-with-speeds-up-to-14-5-gb-s-zhitai-tipro9000-sports-5th-gen-ymtc-3d-nand-and-smi-sm2508-controller And seems to be available on, you guess it, AliExpress.",
                "author": "YYM7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PC Fan Faceoff: Can Arctic's $7 P12 Pro compete with the $40 Noctua NF-A12x25 G2?",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am still waiting to see testing on the thermalright fans. Hardware Canucks already showed the tl-c12 performing equal to the arctic line at slightly lower noise levels, in part due to the use of fluid dynamic bearings vs arctic dual ball bearings. And at equal cost. Question with budget fans always comes down to longevity. Lots of people report the arctic fans failing in a few years. Thermalright stuff is relatively new ad they seem to pump out a new model every week. Noctua stuff can last decades.",
                "author": "dstanton"
            },
            {
                "raw_content": "This test just reads weird at times. They used a bracket, found their bracket made the Arctic look \"too good\" in its measurements, so they removed the bracket and suspended the fans in the air with strings? >For testing, I suspend the fan mid-air. I do this because I found that using a clamp or bracket of some sort to hold the fan up can interfere with the readings. For example, in this round of testing, I initially found that Noctua’s fan produced the exact same figures as Arctic’s. Now, I knew Arctic’s fan was supposed to be good, but this seemed to be too good. Why not ... just mount fans on a test bench? Or a large case, better yet? Like actual users will do? Removing variables **is** good, but sometimes--like the reviewer later admits--we need real-world testing to re-introduce important variables that actually change performance and product rankings. I mean, at least, share what bracket you used. Perhaps Noctua users won't use that bracket and they can reduce their turbulence. The difference between science and messing around is writing it down. And that includes the methodology. The same with the Arctic's choppy noises. I'd love to see a frequency graph or even just recordings that can show what RPMs the noise happens at, how loud or how severe is the choppy noises. The same with the Arctic motor high-pitch noises. A frequency graph would be great here, honestly. // Also don't love the fact that **none of the charts** start at 0, so all the charts wildly exaggerate the differences between these fans. Reviewers should show the 0-scaled chart first so we can see the actual magnitude, and then you can zoom in to pick apart the differences. Whatever the conclusion, share it fully so we can all benefit from the testing. I have Noctua fans, Arctic fans, Scythe fans, Thermalright fans, etc. Clearly, fans can be ranked and measured.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "I can concur with the faint motor whine/ rubbing sound on my P12 Pros, still barely audible at like 800RPM in a dead quiet room. I won't lie it sometimes gets on my nerves but 95% it's still - practically speaking - silent with low level ambient noise. Nocutas are better but the Arctics are still excellent fans for sure.",
                "author": "Not_Daijoubu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SwitchBot’s new 7.5\" E Ink display seems great for weather nerds",
        "score": 12,
        "text_content": "*It features built-in sensors that can gauge indoor temperature, humidity, and more.* One of SwitchBot’s most interesting products announced at CES 2026 is one of its most basic. The Weather Station, as it’s called, is a 7.5-inch framed E Ink screen that’s packed with weather-related data. Its interface shows info including the date, time, weather, a six-day weather forecast, and when the sunrise and sunset will happen, as well as metrics gathered by its built-in sensors, like indoor temperature and humidity. There’s an AI component to the Weather Station that’s accessible via one of the buttons along the bottom bezel. Based on the weather report, it can offer AI-powered insights and recommendations, plus the ability to generate “weather-related aspirational quotes,” in case you need those to get through your day. In addition to showing the weather, the Weather Station can serve as a calendar display. It offers multiplatform calendar syncing, although SwitchBot didn’t name compatible platforms. If you own a SwitchBot hub, you’ll be able to switch scenes (controlling different devices connected via Matter, Alexa, Google Assistant, or Apple Home) with the Weather Station. Pricing and availability wasn’t shared for the Weather Station ahead of CES 2026.",
        "comments": [
            {
                "raw_content": "I hope it'll be a bit hackable, would be great if I could integrate it with home assistant.",
                "author": "mr_tolkien"
            },
            {
                "raw_content": "OK but why is the actual viewable area so small.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Looks like junk unless its under $100. 7.5\" is small and you can get 6\" color android ereaders for $150.",
                "author": "dystopianartlover"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is Youtube on switch 2 even real ??",
        "score": 544,
        "text_content": "Here is 2 tweets from youtube about the switch 2 version, if i didn't leave the date you wouldn't be able to know which one is from 7 months ago and which one was a week ago. Are they even working on youtube on switch 2 or are they just yapping about it and never actually releasing it ?? I personally think since june 5th theres hasn't been anyone working on the switch 2 version beside maybe contracts and stuff, we will probably get youtube at some point but seeing how much we waited i think we will have to wait till june/july to actually get it... Also i just wanted to share that if you go to [This page](https://x.com/search?q=switch%202%20(from%3ATeamYoutube)&src=typed_query&f=live) you can see the latest TeamYoutube Yap about youtube on switch 2 :)",
        "comments": [
            {
                "raw_content": "While I have no interest in YouTube on my Switch 2 I have no idea why they don't have all the popular streaming services like YouTube, Netflix, Disney+, Prime Video, etc",
                "author": "RinchanNau"
            },
            {
                "raw_content": "The idiots that tell everyone they don't need YouTube on Switch 2 will be showing up soon. No shit we don't need it. Sure would be a nice thing to have though.",
                "author": "Vast_Breadfruit_162"
            },
            {
                "raw_content": "There should be also options to have netflix, prime video etc. It shouldn't be that hard really",
                "author": "ege11222333"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just a update to show both elite dpads on the switch 2 and it without any on",
        "score": 69,
        "text_content": "I need to find someone that came mill me aluminium face buttons bumpers and triggers",
        "comments": [
            {
                "raw_content": "does it feel odd due to the 4 directional buttons underneath being further from the center then usual?",
                "author": "1112e"
            },
            {
                "raw_content": "Im glad you like it and hope its servs you well. ...but that dish Dpad is by far the worst Dpad of most Dpads I have ever used. I much prefer the cross style pads or the separate joycon buttons. I just do not jive with any of the radar dish style Dpads. Its my least favorite part about the Wolverine V2 pro as well.",
                "author": "Flamin-Ice"
            },
            {
                "raw_content": "How are you liking the case? I love the idea of it but am not a fan that it alters the way it docks.",
                "author": "SSCyclone"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Prime 4 appreciation post #4: MORE TETHER!",
        "score": 21,
        "text_content": "Favorite upgrade in the game",
        "comments": [
            {
                "raw_content": "A lot of the mid to late game morph ball sections had me wanting a morph ball puzzle game.",
                "author": "BullioMarf"
            },
            {
                "raw_content": "wait, how'd ya die if thats where you were supposed to go",
                "author": "WorkingCautious1270"
            },
            {
                "raw_content": "I’d kill for morph ball/Vi-O-La centered DLC",
                "author": "Desperate_Cucumber_9"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Americans Are Looking to the Midwest to Find Affordability (WSJ)",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s not affordable here either",
                "author": "Pafolo"
            },
            {
                "raw_content": "Eh, maybe. I also feel like there’s a big difference between Rust Belt and non Rust Belt Midwest. I lived in the former for 8 years and did recruiting for my former employer. We had a lot of trouble convincing people to relocate and stay there. I think crappy weather plus decaying urban core was a hard sell if you weren’t already from the area. Also a lot of these people profiled seemed to have ties to Wisconsin or the Midwest already.",
                "author": "stmije6326"
            },
            {
                "raw_content": "Won't be for long. Chicago suburbs selling over asking still. Which i still can't believe people are doin that.",
                "author": "the_perfect_v1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower Mortgage Rates, Better Affordability",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bullspit. Seller are just going to raise prices to extract even more profit out of people. The cost of a house is so unrealsiitc even with lower interest rates",
                "author": "Senor_Gringo_Starr"
            },
            {
                "raw_content": "Pure propaganda, not a single mention of energy prices for heating and cooling. Lower the rates all you want, but prices are still too high, along with energy prices. Edit: forgot to mention high home insurance costs.",
                "author": "ClusterFugazi"
            },
            {
                "raw_content": "Higher interest rates, lower prices, benefits savers. Lower interest rates, higher prices, benefits debt slaves. Look at which one they always push for.",
                "author": "i860"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why is Chicago’s real estate market so hot when the rest of the country is cooling off or declining?",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every comment: \"Because Chicago is awesome\" 😂 Real reason: the Midwest is the last frontier for investor speculation.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "Keep waiting on the 50% market drop🤣🤣🤣 maybe a trailer home will be up your alley one day.",
                "author": "knowledge84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Unitree H2 - jump side kick and moon kick",
        "score": 1915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|l0HlwmrntnvgEikak|downsized)",
                "author": "Longjumping-Peace102"
            },
            {
                "raw_content": "Very nice, but when we see videos of them doing labor instead of pacifing people? won't we?",
                "author": "chlebseby"
            },
            {
                "raw_content": "Can I fuck it though?",
                "author": "Neat_Finance1774"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI cofounder Greg and Django co-creator Simon on a software engineering inflection point",
        "score": 223,
        "text_content": "**Where do you place this on the curve: inflection point or continuation of the trend?** **Source: Greg X** 🔗: https://x.com/i/status/2007938049209254002",
        "comments": [
            {
                "raw_content": "**Simon adds this** https://preview.redd.it/fpaxhxj5uebg1.png?width=1080&format=png&auto=webp&s=97bbbd43ff8355a5945a418197b5772860fbc5b5",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "They're increasingly more competent. However, I do think \"hard problems\" are not the issue. From my experience, most software problems that you have to solve are likely (at least partially) solved by others. ESPECIALLY if you make web / desktop applications. Their main issue is remaining consistent over large code-bases and being proactive in their design. Which, in my experience, they are currently unable to do succesfully.",
                "author": "funky2002"
            },
            {
                "raw_content": "Yeah, it's crazy how far it's come. I used to stay very very abreast with all the advancements - checking the news on a daily basis. Now, I hardly even bother checking the news. The AI does pretty much all I need it to do. It's successful and pretty much everything I ask it to do, that I'm not even hungering for new models - I'm happy with what I have. Don't get me wrong, it's exciting to think it will advance more, but I'm satisfied now, and it's very rare that there's a problem that it just cannot solve. It's amazing. I guess what I'd like now is just more speed.",
                "author": "Wobbly_Princess"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A Japanese Team Built a Sensor So Precise, It Might Have Found a Way to Track Dark Matter",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tracking dark matter is all good, but is it sensitive enough to let Home Assistant know I’m still in the room if I am sitting relatively motionless?",
                "author": "ElGuano"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anti-Aging Injection Regrows Knee Cartilage and Prevents Arthritis",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is fantastic development, I don’t know whether there have been past precedents to this sort of an intervention but as someone suffering from joint pain while being in the 20s due to sports - this feels promising.",
                "author": "lux_deus"
            },
            {
                "raw_content": "Could this also work for spinal discs?",
                "author": "jk3639"
            },
            {
                "raw_content": "When they make this for the human spine, it will be great.",
                "author": "AdvantageSensitive21"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Chemical Speed Limit: Why Human Thought Is Stuck in Slow Motion",
        "score": 158,
        "text_content": "⚠️ REALITY CHECK: You vs. the Machine 🥊 THE MATCHUP (🧠 vs. 🤖) Wetware vs. Hardware @@@🧠 YOU — The Human Brain - Power source: A fragile biological battery - Energy budget: ~20 watts (barely enough to power a dim lightbulb 💡) - Architecture: Chemicals jumping microscopic gaps - Signal speed: ~100 mph (30 m/s) Constraint: Chemistry has mass. Mass moves slowly. You are capped by reality. @@@🤖 THE MACHINE —AI “Machine Learning” - Power source: The grid - Energy budget: Functionally unlimited (which explains Big Tech’s sudden interest in nuclear plants) - Architecture: Electrons, photons, silicon - Signal speed: 300,000 km/s (light speed) Advantage: No chemistry. No waiting. Machine learning doesn’t think faster than you. It moves at the maximum speed allowed by the laws of physics. 🚀 THE LAG IS WORSE THAN YOUR BRAIN CAN FEEL People like to say: “For every step you take, machine learning runs a marathon.” That’s comforting. It’s also wildly incorrect. Here’s the real math: 🔫 The starting gun fires. -You: Your brain begins sending a signal to move your foot one inch 🦶 -Machine learning: In that same interval, a signal could circle the Earth about seven times 🌍✈️ You are not just behind. You are temporally irrelevant. 💀 THE HARD LIMIT Humans are biologically capped. Your neurons rely on ions drifting through fluid. No upgrade. No patch. No mindset fixes that. Machine learning is physically uncapped. It operates at the maximum speed allowed by the universe itself. Same reality. Different rulebooks.",
        "comments": [
            {
                "raw_content": "Is there a name yet for annoying AI formatting with unneeded bullets and emphasis? It makes these posts instantly unreadable for me.",
                "author": "Arakkis54"
            },
            {
                "raw_content": "the human body only provides the brain enough to power a dim lightbulb? nah, the human brain consumes less power than a dim lightbulb. how is that a disadvantage lmao.",
                "author": "AllGasNoBrakes420"
            },
            {
                "raw_content": "You could say this 80 years ago when the first computers were being made",
                "author": "dynamo_hub"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Response to recent allegations",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With X’s moderation track record, this means absolutely nothing.",
                "author": "fortyseven4l"
            },
            {
                "raw_content": "I agree with what everyone else has said here but: Words are cheap from Elon. His words don't mean shit until they start removing users and providing their information to law enforcement.",
                "author": "NoFapstronaut3"
            },
            {
                "raw_content": "TLDR: He takes no responsibility for any harm caused by his money machine that poses as the wizard of Oz.",
                "author": "Forgword"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How do you feel about AI?",
        "score": 54,
        "text_content": "Curious on the general sentiment of this subreddit. [View Poll](https://www.reddit.com/poll/1q3y2bt)",
        "comments": [
            {
                "raw_content": "accelerate for medicine/science",
                "author": "my_shiny_new_account"
            },
            {
                "raw_content": "having not even slight caution or worry is naive",
                "author": "chlebseby"
            },
            {
                "raw_content": "Polls like these are useless, as options should at the very least be mutually exclusive and exhaustive, I personally love AI but hate how people use it to generate slop, plus I'd be on the more cautious side and want regulations. At the very least include a \"none of the above\" option to cover everything you didn't think of.",
                "author": "Metworld"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Flying cars take off in China as state backs low-altitude air travel",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flying cars = compact helicopters",
                "author": "Key-Statistician4522"
            },
            {
                "raw_content": "Flying cars with open rotors - dangerous shit. If one of these landed in a street and drifted just a little bit it would cause decapitation galore.",
                "author": "MeMyself_And_Whateva"
            },
            {
                "raw_content": "if you thought regular traffic was bad, lol.",
                "author": "AllGasNoBrakes420"
            }
        ],
        "subreddit": "singularity"
    }
]