[
    {
        "post_name": "NSW Police confirm that one of the shooters Sajid Akram (the father) was issued his firearm licence in 2023. This was issued AFTER his son Naveed Akram (the other shooter) was on the ASIO watchlist!",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe the government knew they'd go on a shooting spree and planned to use it as an excuse to further disarm the law abiding citizens.",
                "author": "LaPastillaEscarlata"
            },
            {
                "raw_content": "They had to give the mud a license to prove they aren’t Islamaphobic.",
                "author": "XlDEN"
            },
            {
                "raw_content": "deport terrorists’ bloodlines, don’t just watch them",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The only man that can save Australia, send in the Road Warrior",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THUNDERDOME",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "They already killed Crocodile Dundee over his revolver.",
                "author": "clownworld30330"
            },
            {
                "raw_content": "I'm trying to imagine what Australia could be like if it went back to being ruled by men. Maybe this will happen after the founding of the ZSG (Zero Sheila Government) political party in 2027/28",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Three top ranking Minnesota Democrats all have direct ties to the Somalian fraud ring stealing tens of millions of dollars. Ilhan Omar, Keith Ellison, and Tim Walz are all deeply connected.",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd care if anybody ever actually got arrested",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "If we only have a Bureau in the Federal level of government that investigate these things.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "So is Tom Emmer, the republican whip for the House",
                "author": "SpeekFreely"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Northern California resident says they have been having really heavy fog that “has shit in it” He shows on his truck there is a thick film where he’s driven through the fog, showing this doesn’t seem like normal fog Reports in Southern California are confirmed “radiation fog”",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop tailgating illegals",
                "author": "cyberrigger"
            },
            {
                "raw_content": "It’s been dark and gross for like three weeks people are getting cranky",
                "author": "Groomerboomer"
            },
            {
                "raw_content": "Huh? Shit doesn’t become an aerosol. It’s probably just dirt from the roads getting kicked up and mixed with the water droplets in the air.",
                "author": "vongregormench"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Files $10 Billion Lawsuit Against the BBC for Edited Jan. 6 Clip",
        "score": 1143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can the UK afford that? is their king getting served?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "[President Donald Trump filed a monster $10 billion lawsuit on Monday against the British Broadcasting Corporation (BBC) for its 2024 \"Panorama\" documentary that distorted his Jan. 6 remarks.](https://www.foxnews.com/media/trump-files-powerhouse-10-billion-lawsuit-against-bbc-over-documentary-editing-his-jan-6-remarks) Trump sued the BBC for both defamation and for a violation of Florida’s Deceptive and Unfair Trade Practices Act for $5 billion apiece, as the president is seeking $10 billion total. The suit, filed in the Southern District of Florida Federal Court, was filed in a personal capacity and names BBC and BBC studios productions as defendants. The documentary omitted Trump urging his supporters to protest \"peacefully\" and instead spliced two separate comments made nearly an hour apart, making him appear he was calling for violence. \"We're gonna walk down to the Capitol. And I'll be there with you. And we fight — we fight like hell,\" the documentary showed Trump saying. In reality, Trump said, \"We're gonna walk down to the Capitol. And we're gonna cheer on our brave senators and congressmen and women, and we're probably not going to be cheering so much for some of them because you'll never take back our country with weakness. You have to show strength and you have to be strong.\" It wasn't until 54 minutes later that Trump called on his supporters to \"fight like hell\" for election integrity. Trump is seeking a jury trial.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "That's probably only a fraction of what they got from our tax dollars",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today we’d like to thank Democrats for keeping us on the wrong side of this map. While 38 states enjoy gas under $3, California is not one of them. We pay more because Democrats never met a tax, fee, or regulation they didn’t love.",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "California is a one-party leftist state by bureaucratic fiat. There's no voting your way out of this.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Thank you for lowering gas prices.",
                "author": "DeportThemAllForever"
            },
            {
                "raw_content": "Gas is finally dropping below $3 a gallon in Illinois. But that also means if you go to Wisconsin, Indiana, or Iowa, it’s below $2.50. And at a glance, you can even find it below $2.30 in those states. Getting gas prices below $2 a gallon would be huge",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Like clockwork! Chuck Schumer is now demanding the United States implement MORE GUN CONTROL, just like Australia, after the latest attacks",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jew.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "The right to life is the reason we can use deadly force to protect ourselves. anyone that wants to take our guns wants to shoot us in mass. should be automatically dragged out and hold snap elections at the very suggestion. but of course nothing will ever happen because we have been conquered 150 years ago and the US Military is a bunch of fucking cowards.",
                "author": "FlgPole"
            },
            {
                "raw_content": "Tell us you know the real reason 2A exists, without telling us why it exists.",
                "author": "Build_Back_Bankrupt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The bar just went private after the AG said she will pursue legal action against people who threaten law enforcement. We have everything saved. You can’t hide.",
        "score": 781,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who knew that electing Trump would get liberals to support, check notes, online child predators.",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "Leftist derangement boomerang 🎯",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "I’d be scared! Look what she did to dismantle the deep state.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This you, Keith?",
        "score": 996,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, let's stop pretending we care about that TDS fat piece of shit Rob Reiner. The left wants us dead, I celebrate when they die.",
                "author": "SupFrens"
            },
            {
                "raw_content": "They honestly don’t think they are hypocrites because they’ve convinced themselves of their own righteous superiority.",
                "author": "Filo76"
            },
            {
                "raw_content": "Rules for thee but not for me? President Trump did not wish death on him at least because he is not a stupid liberal he just says what comes around goes around Gods will be done",
                "author": "grannylovestrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I wouldn't be surprised.",
        "score": 1432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will probably charge him with assault too.",
                "author": "RedHotLama"
            },
            {
                "raw_content": "Anything is possible in Clown World! An elderly man in the UK was fined earlier this year for spitting out a leaf which had blown into his mouth. He appealed it and they merely reduced his fine. Yes, I'm serious.",
                "author": "F_the_Admin_State"
            },
            {
                "raw_content": "😀😀😀",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I think our troops dig him.",
        "score": 853,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All patriots do.",
                "author": "Bramage"
            },
            {
                "raw_content": "Isn't that cannon cool lol that guy is the real deal and you can see the sincere pride he has in our enlisted. I have that same pride too!",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "No more demoralizing tranny parades! No more getting off duty for gender bs!",
                "author": "LLP2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC appellate court panel to Jeb Boasberg just now: WTF dude? Judges suggest Boasberg's criminal contempt inquiry is out of order (as DOJ did as well) and wants to know why he's pursuing an \"indirect\" contempt charge without first referring for prosecution per federal criminal procedures.",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's becoming clear that we are not saving this country by vote.",
                "author": "AllahFubar"
            },
            {
                "raw_content": "They're acting like this dipshit is just bumbling about, making errors. They're pretending he's not a corrupt activist judge purposely breaking the law. It's time stop insulting us and just call it what it is. Severe judicial corruption.",
                "author": "MAG_n_KAG"
            },
            {
                "raw_content": "He’s doing it because the GOP is filled with pussies that won’t do shit about it.",
                "author": "Roadrash"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hillary Clinton has been HOSPITALIZED in New York City.",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Santa heard me?",
                "author": "here2red"
            },
            {
                "raw_content": "She was called to testify on December 18th, how convenient.",
                "author": "sleepy_bob_ross"
            },
            {
                "raw_content": "Did she have information on The Clintons?",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: \"I am UNABLE to put anybody in office having to do with U.S. attorneys, or judges. If you have ONE Democrat senator in a state, it's not possible to appoint because of blue slips.\"",
        "score": 1206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Need to go full Bukele on the Bolshevik judges trying to ruin his presidency and our country.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Imagine having to get permission from a party that was specifically voted out of power. Republicans are all wife guys.",
                "author": "Viewer01"
            },
            {
                "raw_content": "When did Republicans ever use this blue slip shit to block judges? Never?",
                "author": "Yignuced"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Angry Aussie who stomped on Bondi Beach gunman’s head says he did something ‘every Australian wanted to do’",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every attack on Jews is a psyop meant to garner them sympathy.",
                "author": "WeaponizedSmirk"
            },
            {
                "raw_content": "jury nullification",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Start with your politicians.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Trump Signs Executive Order to Designate Fentanyl as a Weapon of Mass Destruction as Offensive Against Venezuelan Narcotraffickers Escalates (VIDEO)",
        "score": 1401,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It certainly is. Fentanyl is a key weapon of non-kinetic warfare. For less than the cost of a missile it can do financially far more damage that previously couldn't solicit a kinetic response. It's killing thousands and thousands of people. It's incarcerating thousands and thousands of people at the cost of at least $60,000 a year PER PERSON to taxpayers. It's destroying families. It's overloading our court systems. It's causing a rise in crime for junkie's supporting their habits. Just $100 in cost of fentanyl from China can do hundreds upon hundreds of thousands of dollars worth of damage to the US. It should absolutely be treated the same way as someone attempting to drop bombs on the US.",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "uh oh. Does that mean ground war with Venezuela to search for WMDs?",
                "author": "Choppermagic"
            },
            {
                "raw_content": "",
                "author": ""
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just confirmed the Democrats' worst nightmare: In the 2026 midterms, he will put the name \"TRUMP\" on the ballot to surge low propensity voters. \"When I'm not running, we don't do as well. But I'm gonna try to get that CHANGED for the midterms!\"",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hard to put your agenda through if you are on the campaign trail, doing rallies. Time is growing short.",
                "author": "Hambonemcgee"
            },
            {
                "raw_content": "This isn't going to matter. If Republicans don't solve the affordability problem they're going to get their asses handed to them regardless of anything else they do. The inflation is caused by money printing, and the money printing occurs because of government over-spending on entitlement programs. So it's simple. Either dramatically cut entitlement spending or the leftists are going to annihilate the GOP in the midterms. Period. And here's the kicker. They're going to do it by offering people even more free shit, which will exponentially exacerbate the affordability problem. This is literally the perfect storm of stupidity. So instead of rallies, you should be focusing on eliminating welfare and Medicaid. The sooner the better.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "The video does not match the headline. He does not say he’s going to be on ballots, he’s looking to help campaign for midterms",
                "author": "bumpman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump responds to people criticizing his post about Rob Reiner's death, where Trump mentions Reiner's \"TDS\" \"I wasn't a fan of his at all. He was a DERANGED person, as far as Trump is concerned.\"",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That fucking low life hated us in life we can hate him in death good riddance",
                "author": "Southernwhitebread2"
            },
            {
                "raw_content": "He would have danced on Trumps grave if it was the other way around",
                "author": "AmericanForever"
            },
            {
                "raw_content": "He raised his own murderer, he was clearly a terrible person.",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🦘 Australian female cops when the pressure is on",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They signed up to put the boot on the neck of the good folk and feel like big boys/girls, not have to deal with violence or ongoing crises! Kek. Reminds me of that Demolition Man line.",
                "author": "Shmioighan"
            },
            {
                "raw_content": "*****REPEAL. THE. 19TH. NOW.*****",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "There’s something so weird about everyone calmly walking around in the middle of the shooting. Where the fuck is everyone’s basic survival instincts? Find cover retards!",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No one can be this retarded",
        "score": 1537,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those guys got their rifles legally. It isn't illegal to own them in Australia.",
                "author": "briantrash"
            },
            {
                "raw_content": "Honestly after I learned that they slaughtered puppies at a shelter so that people wouldn't break covid quarantine to feed them I lost all sympathy for that shithole.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "it was a psyop to push more gun control",
                "author": "LogicCircuits"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"No stock\": Samsung raises DDR5 contract price by over 100%",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dark times are awaiting us...",
                "author": "simo41993"
            },
            {
                "raw_content": "This is ridiculous, and used prices are out of control too. At this point I can make back the cost of all the parts in my home server (except the drives) if I sell 64 out of the 128GB of DDR5 in there lol.",
                "author": "jenesuispasbavard"
            },
            {
                "raw_content": "Man the 2010s really were a golden era of PC hardware",
                "author": "OkayTHISIsEpicMeme"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Acer and ASUS Reportedly to Pass Surging Memory Costs to PCs in 1Q26, Hot on Dell’s Heels",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The report also identifies HP as a key driver behind the price spike. After failing to negotiate in South Korea, the company reportedly turned to Chinese DRAM suppliers, snapping up modules at $200 each. Thus, spot prices for DDR5 16GB modules surged again last week, climbing to $200–220, the report adds. >The surge is hitting PC brands hard. Commercial Times reports Acer CEO Jason Chen saying that memory typically makes up 8%–10% of the BOM (Bill of Materials). Between Q3 and mid-Q4, memory prices reportedly jumped 30%–50%, translating to a 2%–3% impact on overall BOM costs. Still, PC makers are feeling the pressure, with some cutting configurations, such as dropping 16GB RAM down to 8GB, Chen added.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HDD prices spike as AI infrastructure and China's PC push collide — hard drives record biggest price increase in eight quarters, suppliers warn pressure will continue",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It may not be right now, but I promise you they will use this type of message to excuse high prices, across-the-board, regardless of any supply deficiency.",
                "author": "gcbofficial"
            },
            {
                "raw_content": "Already saw this with higher tier HDDs, bought 2x 16TB Toshiba N300 Pros back in September, it's now $100 more expensive each in December. I wouldn't be surprised if the prices kept climbing. Building NASes is going to suck as well into 2026/2027.",
                "author": "deltatux"
            },
            {
                "raw_content": "Damn, everything is getting devoured by those AI fucks.",
                "author": "pagemap1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Xiaomi is working on a decently slim phone with a 10,000 mAh battery",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank goodness. We don't want indecently slim phones.",
                "author": "Ploddit"
            },
            {
                "raw_content": "> And despite the massive battery, this phone will be less than 8.5mm thick That's slimmer than an average phone. Wonder if it's the rumoured 500 Wh/kg battery finally making mass scale commercial implementation.",
                "author": "kingwhocares"
            },
            {
                "raw_content": "I'm forever scarred by remembering the pre-smart cellphone market where it was totally normal for a phone to last more than a week. I can never have enough battery capacity.",
                "author": "MumrikDK"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China equips traffic police with AI smart glasses for real-time vehicle checks",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "China was injecting \"5G\" into everything 5 years ago, now they're injecting \"AI\" into everything.",
                "author": "ClickClick_Boom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ComputerBase] RAM prices surge more than 3x in 3 months since mid-September 2025 (German source)",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "According to PC Part Picker, 16 x 2 32GB DDR5 6000MT kit is ~3.65x more expensive now than it used to be 3 months ago (Sep 2025) https://i.imgur.com/aCxRDG4.jpeg",
                "author": "Few-Profit-2134"
            },
            {
                "raw_content": "I just checked, the 32x2 64gb ddr5 6000mt kit I got in february for $180 is now listed at $660 from the same place I purchased it from (newegg). it's $700 on amazon... I had no idea how bad it was wtf",
                "author": "jangoagogo"
            },
            {
                "raw_content": "This is why I panic-bought a laptop...",
                "author": "DarthZiplock"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Native versus emulation - World of Warcraft game performance on Snapdragon X Elite",
        "score": 26,
        "text_content": "With the new Prism emulator for WoW the performance is near identical between native and x86\\_64 client run through emulation.",
        "comments": [
            {
                "raw_content": "While I’m glad that wow was tested as it’s one of my most played game. I do have one gripe with this review. The author only tested performance in old instances and old zones which are mostly dead and barely have any player activity. I’d love to see how the snapdragon SOC performs in current expansion’s capital city “Dornogal” and a current expansion raid boss fight in a 20man setting. Also comparison with Apple’s Mac chips would be appreciated. Thanks for sharing!",
                "author": "Nimbus420i"
            },
            {
                "raw_content": "Great to hear. Qualcomm seem to have lit a fire under Intel, and we’re now getting some great mobile CPUs from them.",
                "author": "SomeoneBritish"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung in Talks to Manufacture AMD’s Next-Gen EPYC “Venice” CPUs Using 2nm Process",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Venice is the next release. This would have leaked ages ago unless they are going for dual supplier.",
                "author": "mr_invester"
            },
            {
                "raw_content": "AMD already announced they taped out Venice on TSMC 2nm back in April. [https://www.amd.com/en/newsroom/press-releases/2025-4-14-amd-achieves-first-tsmc-n2-product-silicon-milesto.html](https://www.amd.com/en/newsroom/press-releases/2025-4-14-amd-achieves-first-tsmc-n2-product-silicon-milesto.html) If they use Samsung at all, It is probably going to be something else. That said, there are going to be Zen 6 EPYC SKUs that use different chiplets (there are at least two chiplet variants). So it is possible that \"Venice\" is referring to a family of CPUs and there could be some Samsung based SKU in there. But I think it is more likely that this headline is wrong, and AMD is contemplating Samsung for a different product.",
                "author": "RetdThx2AMD"
            },
            {
                "raw_content": "AMD and TSMC have been pretty intimately close ever since AMD ditched global foundries. Also TSMC isn't too kind on companies that are unreliable partners, AMD just hopping to Samsung would be pretty shocking",
                "author": "juhotuho10"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hollow knight nintendo switch 2 edition coming in 2026",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another 120fps Switch 2 game incoming 😎",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "And it’s free, just like Silksong. Both these games with the Switch 2 edtions for $35 is such a steal.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "am actually unreasonably excited for this. HK is one of my cozy replay games (along with MPR), and I am super excited to have it get a fresh coat of paint and some general overall changes that will have it mirror SS a bit more.",
                "author": "firefrenchy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Team Cherry Holiday Sign-off! Hollow Knight: Silksong - Sea of Sorrow revealed, the original Hollow Knight refreshed, and more!",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Free expansion for silk song and a free switch 2 Update for Hollow Knight? Team Cherry are the goat indie devs.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Awesome! I put it off for a while but I've been playing Silksong recently and I can't wait for the DLC! Plus the HK switch 2 version will be really nice, I never finished it originally, and it's not great to play on the switch 2 since I think it's like 540p or something in handheld",
                "author": "ASignificantSpek"
            },
            {
                "raw_content": "Yall have me conditioned to believe everything is a silkpost.",
                "author": "epicbrewtality"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hollow Knight: Silksong Has Sold 7 Million Copies",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They GOT PAID.",
                "author": "SupperTime"
            },
            {
                "raw_content": "I hope they have a Hollow Knight + Silksong double pack on physical media. I would love to double dip on both.",
                "author": "DrSussBurner"
            },
            {
                "raw_content": "WOW WTF",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Intergrade demo available on the Nintendo eShop",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Woah",
                "author": "jpassc"
            },
            {
                "raw_content": "Just pre-ordered mine. I haven't played the demo but how was it? Especially in handheld?",
                "author": "Ozem-pic"
            },
            {
                "raw_content": "AHHHHH, downloading it now. 👍👍👍",
                "author": "FayeChan350259"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Hardware Hit by 41% Price Jump in DRAM, NAND Up 8%",
        "score": 511,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THIS AI BUBBLE IS TAKING TOO LONG TO POP!!!",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "The only reason I got one on launch day was because so many Redditors warned me that the price would go up before it was a year old.",
                "author": "Vast_Breadfruit_162"
            },
            {
                "raw_content": "They're in a pickle. as choosing to absorb it hurts, but raising the price also hurts . I feel like if Tariffs weren't also a thing they could choose to absorb it, and maybe they will opt to for another year or so, but the wider affect on the whole industry just makes me sad tbh",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Took me way too long to get this to work, but he deserved it.",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol at the timing of John dusting himself off a second after the body pops into a bloody mess.",
                "author": "pawlik23"
            },
            {
                "raw_content": "Is this rdr1 on switch 2 or rdr2",
                "author": "MarkdaHer0"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sorry for the terrible photo, but when did they announced Divinity Original Sin 2 getting a switch 2 edition? Its seems like it appeared out of nowhere",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It tells me that the eShop page got uploaded seconds ago So maybe they are a bit late with the trailer?",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "I was hoping for a Switch 2 Update when the PS5 version leaked. I have both the Steam and Switch version, but prefer to play large RPGs portable because I travel often, but the Switch 1 version was so ugly and blurry. This should be a huge improvement and I’m happy to try and play this again on Switch 2 EDIT: trailer can be found online. Resolution increase and frame rate increase. Looks to be 60 FPS. Awesome EDIT 2: Officially announced.",
                "author": "Smitty2017"
            },
            {
                "raw_content": "https://preview.redd.it/6wapoe8eyd7g1.jpeg?width=1439&format=pjpg&auto=webp&s=0cf14ef6a61f1344985df0519f3708cbf1cfa95a I love reddit haha",
                "author": "julesvr5"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World Version 1.4.1 is now available",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "THW OUT OF BOUNDS GLITCH IS GONE 😭😭😭",
                "author": "Pomps8a"
            },
            {
                "raw_content": "Unless and until they add 3 lap grand prix I don't think I will ever go back.",
                "author": "NewNatural6512"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Marathon releases in March 2026",
        "score": 362,
        "text_content": "[https://www.bungie.net/7/en/News/Article/marathonvidoc](https://www.bungie.net/7/en/News/Article/marathonvidoc) **Marathon releases March 2026, targeting a price of $39.99/€39.99/£34.99. We’ll announce additional regional pricing as we get closer to launch.** Purchasing Marathon will give you full access to the game, including a roadmap of free gameplay updates as the year progresses. This will include new maps, new Runner shells, events, and more, starting with the exploration of UESC Marathon's Cryo Archive in Season 1. We also want to ensure you are logging in because you love the game, not from fear of missing out—so Marathon's Rewards Passes will not expire, and you’ll be able purchase and unlock prior Passes. Finally, and most importantly, we believe in preserving competitive integrity in Marathon, so survival will never come down to how much money you spend. We’ll share more about our plans for seasonal content, a roadmap, and details about when you’ll be able to try the game as we get closer to launch. Previous Rumor: [Marathon still aiming to be released in FY25](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lab1o4/marathon_still_aiming_to_be_released_in_fy25/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "And yes another game in the first quarter of 2026..",
                "author": "ygtsahinn"
            },
            {
                "raw_content": "Now if they’d only move that battle pass formula to Destiny",
                "author": "Astro4545"
            },
            {
                "raw_content": ">We also want to ensure you are logging in because you love the game, not from fear of missing out Wonder why they didn’t feel that way to their destiny players",
                "author": "JakeSteeleIII"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Divinity: Original Sin 2 is now available on Switch 2, PS5 and Xbox Series X|S",
        "score": 545,
        "text_content": "This was rated a while ago original post: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1gksmor/divinity_original_sin_ii_de_leaked_for_ps5_xbox/ now confirmed and released by Larian: https://larian.com/news/divinity-original-sin-2-is-now-available-on-switch-2-ps5-and-xbox-series-x-s_147",
        "comments": [
            {
                "raw_content": "Free Upgrade too which is a great gesture. Press release don’t specify changes but [PlayStation](https://store.playstation.com/en-us/concept/232084) & [Xbox](https://www.xbox.com/en-US/games/store/divinity-original-sin-2-definitive-edition/bw8pvl4cj2q6) Stores list PS5 Pro Enhanced and 60FPS.",
                "author": "ZXXII"
            },
            {
                "raw_content": "Ohhh this means they have a Switch 2 dev kit. That might make the BG3 port more plausible.",
                "author": "Jack2036"
            },
            {
                "raw_content": "Insanely good game. Was playing earlier today",
                "author": "Tiwanacu"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PCGamesN - Techland job listing mentions \"a new online experience in the Dying Light franchise.\"",
        "score": 162,
        "text_content": "Source - [https://www.pcgamesn.com/dying-light/new-game-techland-job-post](https://www.pcgamesn.com/dying-light/new-game-techland-job-post) Techland job post for a Lead Online Game Designer mentions \"a new online experience in the Dying Light franchise\", and requires someone with \"Senior-level experience in game design for online and live-service (Games-as-a-Service) titles.\" Article says it could end up being a new mode/ experience within an existing Dying Light game, but the wording suggests it's an all-new project Techland declined to comment",
        "comments": [
            {
                "raw_content": "hopefully its some writers",
                "author": "AreaRare1329"
            },
            {
                "raw_content": "Don't they typically have online coop in their games? Not sure if the latest one will have online coop.",
                "author": "method115"
            },
            {
                "raw_content": "Last time they did a dying light live service, it didn't go so well",
                "author": "Icy_Ad620"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sapphire asks AMD for more freedom in partner GPU designs: “Let us go nuts\"",
        "score": 1414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want to see 2000's translucid designs",
                "author": "digital_n01se_"
            },
            {
                "raw_content": "Why not allow them? Especially if they release both a normative and \"nuts\" design",
                "author": "BlobTheOriginal"
            },
            {
                "raw_content": "The nuts; a decent amount of VRAM in 2026.",
                "author": "spicypixel"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Fannie, Freddie Quietly Add Billions to Mortgage-Bond Portfolios",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trying to “buy down” the 10 year rates, which simply won’t budge, though Fed has cut rates. No one wants Americas debt at 3% yield. The bond market is telling us that it’s flooded with the 1-2% yield coupons of 2020-2022, and they don’t want more of it.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Mortgage spread will likely decline further towards 1.5%. A combination of 3.9% 10 year yield and 1.6% spread will bring the 30 year fixed mortgage rate to 5.5%. Decent odds of this happening within 2-3 months.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/2Xfgm Takeaways: - Fannie Mae and Freddie Mac have increased their retained portfolios by more than 25% in the five months through October, lifting their combined positions to $234 billion. - The expansion of their portfolios is fueling speculation that they’re trying to push down lending rates and boost their profitability ahead of a potential public offering. - Analysts estimate that Fannie and Freddie could add as much as $100 billion more to their portfolios next year, which could compress MBS risk premiums and lower lending rates. **Fannie Mae and Freddie Mac have added billions of dollars of mortgage-backed securities and home loans to their balance sheets in recent months, fueling speculation that they’re trying to push down lending rates** and boost their profitability ahead of a potential public offering. The government-backed housing-finance giants increased their retained portfolios — the portion of bonds and loans they hold onto rather than sell to investors — by more than 25% in the five months through October, according to the latest figures. That’s lifted their combined positions to $234 billion, the most since 2021. Analysts estimate they could add as much as $100 billion more next year. While Trump administration officials have remained tight-lipped on the MBS purchases, they’ve stated repeatedly this year that they would leverage the financial might of Fannie and Freddie to bring housing costs down. Policymakers have also been laying the groundwork to return the companies to public markets nearly two decades after they were placed into conservatorship, and a larger retained portfolio would likely bolster earnings and strengthen their appeal to investors in any future offering. For now, though, the impact is mostly being felt in the $9 trillion US agency MBS market. As the government-sponsored enterprises snap up more and more bonds, they’re curbing the flow of the securities into the market and supporting prices. Moreover, having two large buyers step in when spreads widen could also dampen volatility and, in the process, alter how investors evaluate risk. “**If you want to lower mortgage rates, one of the most direct ways to do so is simply directing the GSEs to purchase more mortgage bonds**,” said Vitaliy Liberman, a portfolio manager at DoubleLine Capital. “This administration is looking at everything.” Representatives for Fannie Mae, Freddie Mac and the Federal Housing Finance Agency, which oversees both companies, didn’t respond to multiple requests for comment. Long used as a short-term pipeline for loans awaiting securitization, the retained portfolios ballooned in the 1990s and 2000s as the firms increasingly used them to juice earnings by borrowing cheaply and investing in higher-yielding mortgage bonds. By 2008, their combined holdings swelled to more than $1.5 trillion, and the portfolios had become Fannie and Freddie’s primary profit engines. They weren’t limited to safer agency paper, either. The companies also loaded up on private-label bonds and other assets that proved far riskier than expected. When the housing market buckled during the financial crisis, those positions — and the leverage behind them — delivered heavy losses that helped push Fannie and Freddie into conservatorship. In the aftermath, the Treasury forced the pair to unload assets and imposed strict caps on how much they could hold. By late 2022, their retained portfolios had shrunk to just $158 billion. But now, assets are climbing again, rising more than $50 billion in the five months through October. Even after the jump, the firms remain more than $200 billion below their cap, leaving ample room for further growth. The pickup has caught the attention of analysts, who say that with officials offering little explanation, Wall Street is left to speculate about what’s driving the shift — and how much the GSEs might add next year. **Lower Mortgage Rates** One line of thinking is that the buildup is aimed at nudging mortgage rates down. By keeping more loans on their books instead of selling them into the market, the GSEs shrink the supply of MBS available to investors, a shift that can compress yields and, in turn, lower lending rates. The expansion is unfolding as the Trump administration ramps up its focus on housing affordability. Treasury Secretary Scott Bessent said in September that the president may declare a “national housing emergency.” More recently, FHFA head Bill Pulte said the agency was exploring the creation of a 50-year mortgage to ease monthly payments, while President Donald Trump urged Fannie and Freddie in a social media post to “get big homebuilders going.” Despite the administration’s push, mortgage rates have remained stubbornly high since 2022, when the Federal Reserve began hiking its target rate to stave off inflation. Even after 1.75 percentage point of rate cuts since 2024, the average 30-year home loan rate is still above 6%. Citigroup Inc. forecasts that Fannie and Freddie will boost their combined retained portfolios by roughly $100 billion in 2026, with an outside chance the increase could reach $250 billion. Such growth, the bank estimates, could compress MBS risk premiums by about 0.25 percentage point, with some or all of that passing through to the rates consumers pay on mortgages. “Since Fannie and Freddie are still substantially owned by the Treasury, the administration still has a great deal of influence over them,” said Walt Schmidt, a strategist at FHN Financial. “It gives them a flexible tool to lower interest rates for consumers, similar to the Federal Reserve,” which since 2022 has been allowing its own mortgage-bond holdings to roll off its balance sheet. Expanding their retained portfolios could also help set the stage for a public offering, market watchers say. More MBS on the balance sheet means more interest income, and potentially higher profits, at a time when doubts about the GSEs’ earnings power relative to their debt remain a hurdle to any share sale. The Trump administration has already begun laying the groundwork, including informal outreach to investment banks about a potential offering. Commerce Secretary Howard Lutnick said earlier this month that IPOs for the two companies are coming “sooner rather than later.” “If you’re going to put them outside conservatorship and make them profit-seeking entities, then this would be a starting point,” said Jason Callan, co-head of structured assets at Columbia Threadneedle. “Investors in an IPO are only going to be interested in owning shares of Fannie and Freddie if they can show earnings growth.” MBS Tailwind Regardless of the motivation, analysts say a new source of demand in the MBS market could shift the delicate balance that determines bond prices and yields. Larger retained portfolios could push down risk premiums and dampen day-to-day volatility, altering market dynamics investors have become accustomed to. The GSEs could also reemerge as a central force in the market. Over the past three years, attention was focused on money managers, who became the marginal buyers after the Fed scaled back MBS purchases. If Fannie and Freddie keep growing their holdings, that could change. “If the ramp-up in the GSEs’ portfolios continues, they would become one of the most important buyers in the market, and that would force investors to pay very close attention to their every move,” said Mario Ichaso, a strategist at Wells Fargo & Co. “The mantra becomes, ‘Don’t fight the GSEs.’” For more debt-market coverage, subscribe to the Credit Weekly Even modest portfolio growth could revive long-running debates over how much risk the companies should take on, and whether expanding their holdings puts them on a path toward ever-larger balance sheets. “There would be huge political concern if Fannie and Freddie began building up their portfolios back toward pre-2008 levels,” said Jeana Curro, a strategist at Bank of America Corp. “Tighter underwriting has made mortgage bonds safer than they used to be but still, we expect there would need to be strict regulation if they added significantly.” Few expect a return to the pre-crisis playbook, when the companies’ massive portfolios drew scrutiny for distorting markets and masking risks. But investors say today’s policy backdrop makes at least some additional portfolio expansion likely. “You’ve got an administration that’s more focused on growth, and getting housing policy wins is paramount,” said Brian Simon, a managing director at alternative credit investment firm Balbec Capital. “Buying more mortgage bonds to help drive down rates and achieve other objectives — even though we have yet to see that materialize — could be very much on the table.”",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The solution to America’s affordability problem might be broken, too",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Total BS. Look... The reason why we have run-away inflation and high costs of living, is because out Government is now in the business of picking winners and losers. And they do so, for their own interest. The ONLY way to reduce costs, is to break up monopolies (Amazon, Tyson, Google). Make them compete for customers on price. Remove taxpayer-funded subsidies. Make stock buy-backs illegal. Make 2nd, 3rd homes tax prohibitive. While we're at it, tax the billionaires out of existence. My fellow Americans... All this other crap is distraction as they're robbing us blind...",
                "author": "NorCalJason75"
            },
            {
                "raw_content": "Maybe employers will start paying people more out of the goodness of their hearts /s. Having a union contract helps though, probably the only reason my wages have consistently outpaced inflation even if it’s just by a little bit some years.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "So I actually read this article. “Economists, business leaders and politicians have debated the best solution to make America’s cost-of-living feel affordable again, including increasing health care and housing subsidies and reducing tariffs”. Best we can do is the opposite",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A 'new era' in the housing market is about to begin as affordability finally improves 'for the first time in a bunch of years,' economist says | Fortune",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Build more starter homes",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Propaganda. It hasn’t been affordable in years.",
                "author": "Specific_Dealer_9363"
            },
            {
                "raw_content": "I’ll have what you guys are smoking, please",
                "author": "zerosumratio"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"Eternal\" 5D Glass Storage is entering commercial pilots: 360TB per disc, zero-energy preservation and a 13.8 billion year lifespan.",
        "score": 2130,
        "text_content": "I saw this update regarding **SPhotonix** (a spin-off from the University of Southampton). We often talk about processing power (Compute), but **Data Permanence** is the other bottleneck for the Singularity. Current storage (Tape/HDD) degrades in decades and requires constant energy to maintain (\"bit rot\"). **The Breakthrough:** This \"5D Memory Crystal\" technology is officially moving from the lab to Data Center Pilots. **Density & Longevity:** 360TB on a standard 5-inch glass platter. Rated to last 13.8 billion years (effectively eternal) even at high temperatures (190°C). **Sustainability:** It is \"Write Once, Read Forever.\" Once written, the data is physically engraved in the glass and requires 0 watts of power to preserve. This is **arguably** the hardware infrastructure needed for an ASI's long-term memory or a \"Civilizational Black Box\" that survives anything. **Does this solve the \"Data Rot\" problem for future historians? Or will the slow read/write speeds limit it strictly to cold archives for AGI training data?** **Source: Tom's Hardware and Image: Sphotonix** 🔗: https://www.tomshardware.com/pc-components/storage/sphotonix-pushes-5d-glass-storage-toward-data-center-pilots?hl=en-IN",
        "comments": [
            {
                "raw_content": "13.8 billion years seems suspect as that's the current estimate as to the age of the universe",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "“Write speeds of around 4 MBps and read speeds of roughly 30 MBps.” It would take roughly 2 years and 10 months of continuous writing at 4 MBps to fill a 360 TB disk assuming there are no failures while writing to disk.",
                "author": "Savings_Midnight_555"
            },
            {
                "raw_content": "Humans in post apocalyptic world will hunt these bad boys.",
                "author": "attempt_number_3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google just dropped a new Agentic Benchmark: Gemini 3 Pro beat Pokémon Crystal (defeating Red) using 50% fewer tokens than Gemini 2.5 Pro.",
        "score": 863,
        "text_content": "I just saw this update drop on X from Google AI Studio. They benchmarked **Gemini 3 Pro** against **Gemini 2.5 Pro** on a full run of **Pokémon Crystal** (which is significantly longer/harder than the standard Pokemon Red benchmark). **The Results:** **Completion:** It obtained all 16 badges and defeated the hidden boss Red (the hardest challenge in the game). **Efficiency:** It accomplished this using **roughly half the tokens and turns** of the previous model (2.5 Pro). This is a huge signal for **Agentic Efficiency.** Halving the token usage for a long-horizon task means the model isn't just **faster** ,it's making better decisions with less \"flailing\" or trial and error. It implies a massive jump in planning capability. **Source: Google Ai studio( X article)** 🔗: https://x.com/i/status/2000649586847985985",
        "comments": [
            {
                "raw_content": "\"POKEMON CRYSTAL MILESTONES\" is a terrible name for this benchmark. I am renaming it to Pokébench",
                "author": "Calm_Hedgehog8296"
            },
            {
                "raw_content": "Would be a better task to throw it at a new video game that just came out and doesn't have tons of guides and walkthroughs in the training data.",
                "author": "Cryptizard"
            },
            {
                "raw_content": "Didn't Google give credit to the guy that did this testing? Anyway the guy who did the testing made a reddit post about it. https://www.reddit.com/r/singularity/s/ZGv1zoIkTi https://blog.jcz.dev/gemini-3-pro-vs-25-pro-in-pokemon-crystal The above is the blog about it. Below are some interesting stuff from the blog. Op can you please credit original owner of the test.",
                "author": "Seeker_Of_Knowledge2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini Flash 3.0 launching today??",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good thing he put three lightning bolts instead of two.. That'd get misinterpreted pretty quickly.",
                "author": "PaxODST"
            },
            {
                "raw_content": "Likely tomorrow",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "Source: https://x.com/i/status/2000723780067381572",
                "author": "freedomheaven"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "WAN2.2 + Nano Banana Pro",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No Back to The Future despite using Johnny Be Good?",
                "author": "zombiesingularity"
            },
            {
                "raw_content": "We are witnessing the quasi instantaneous collapse of digital media through destructive inflation. AI is the revenge of analog.",
                "author": "CertainMiddle2382"
            },
            {
                "raw_content": "I’m hopeful for a comeback of real experiences. Stage plays, local artists, independent film on physical media. Small stores and performance venues everywhere. Something real. I’d love it for technology to do some good again.",
                "author": "bokan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Disney's internal AI strategy leaked: A first look at \"DisneyGPT\" and a new Agentic \"JARVIS\" tool in development.",
        "score": 34,
        "text_content": "We knew **Disney** signed a massive deal with OpenAI, but we are finally seeing how they are using it **internally.** According to a new report from **Business Insider,** Disney has **two** major projects running: 1. **\"DisneyGPT\" (The Chatbot):** As seen in the image(interface), it’s a **custom** wrapper (\"Hey Mickey!\") that connects to their internal data. **The Vibe:** It’s designed to be **\"enchanting,\"** offering quotes from Walt Disney and categorized prompts for employees (Legal, Creative, etc.). **2. \"JARVIS\" (The Agent):** This is the big one. They are developing a separate **\"Agentic\"** tool named after Iron Man’s AI. Unlike DisneyGPT (which just chats), JARVIS is designed to **execute complex workflows** autonomously. This confirms that the **$1 Billion OpenAI investment** wasn't just for \"Sora\" videos. Disney is fundamentally re-architecting its internal workflow around Agentic AI. **If Disney is building \"JARVIS\" for employees, how long until we get a consumer version of a Disney Agent that plans our entire vacation?** **Source: Business Insider** 🔗: https://www.businessinsider.com/disney-ai-strategy-employees-disneygpt-openai-deal-chatgpt-2025-12",
        "comments": [
            {
                "raw_content": "![gif](giphy|f6cspoo2hdLNNdkHOh)",
                "author": "pebrocks"
            },
            {
                "raw_content": "This is so stupid",
                "author": "samwell_4548"
            },
            {
                "raw_content": "you either die a hero, or live long enough to see yourself build a gpt wrapper",
                "author": "pdantix06"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Another “impossible” task for AI…",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love how we come up with these benchmarks lol, the wine glass one, counting the fingers from that hand emoji",
                "author": "Different-Incident64"
            },
            {
                "raw_content": "That's surprising given that pianos are basically invariable. I guess that's the equivalent of early AIs giving an improbable number of fingers to characters",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "tested on lmarena https://preview.redd.it/xs9t3fgh5f7g1.png?width=799&format=png&auto=webp&s=e3f7b9a19a049bdab70c8345a13460b107105280",
                "author": "RalFingerLP"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 Catches Up with Gemini 3 and Reaches a Reliability SOTA on ZeroBench",
        "score": 20,
        "text_content": "https://zerobench.github.io/",
        "comments": [
            {
                "raw_content": "Why does this has 0 upvotes? Are shills working overtime :3",
                "author": "Independent-Ruin-376"
            },
            {
                "raw_content": "Benchmarks are getting better but that doesn't always translate to \"feels better in practice.\" The gap between test performance and user experience is still huge. A model can score perfectly on ZeroBench but still fumble basic context retention or give you worse outputs than the previous version. What's interesting is people are starting to auto-grade AI predictions retroactively to see which models were actually right over time https://karpathy.bearblog.dev/auto-grade-hn/. That kind of long-term evaluation matters way more than synthetic benchmarks, but it's harder to market. This was in my last newsletter issue (https://hackernewsai.com/). The benchmark-to-reality gap is widening as models get optimized for tests instead of actual use.",
                "author": "HackerNewsAI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.2 Thinking scores the highest IQ - Even higher than 5.2 Pro, 5.1 Pro, and Opus 4.5",
        "score": 77,
        "text_content": "Source: [https://x.com/chetaslua/status/2000670516508545283](https://x.com/chetaslua/status/2000670516508545283) AI IQ Rankings: [https://www.trackingai.org/home](https://www.trackingai.org/home)",
        "comments": [
            {
                "raw_content": "I'm very curious what happens when these models start getting scores that would be statistically impossible for a human. Would it still have the same strange shortcomings that current models do?",
                "author": "NoCard1571"
            },
            {
                "raw_content": "Let me ignore everything wrong with this post because who really cares if OP can't even read a graph.",
                "author": "pentacontagon"
            },
            {
                "raw_content": "Ironic OP is reporting on IQ scores",
                "author": "Yami350"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI just stealth-dropped new \"2025-12-15\" versions of their Realtime, TTS and Transcribe models in the API.",
        "score": 105,
        "text_content": "It looks like OpenAI is preparing for a massive push into affordable **Voice Agents.** **New models** have just appeared in the API dropdown (noticed by Developers): **gpt-realtime-mini-2025-12-15** **gpt-4o-mini-tts-2025-12-15** **gpt-4o-mini-transcribe-2025-12-15** Until now, the **Realtime API** (which allows for human like interruptions and emotion) was extremely expensive. Releasing a **\"Mini\"** version implies they have successfully distilled the audio capabilities into a smaller, cheaper model. This likely opens the floodgates for **\"Voice Mode\"** capabilities in third-party apps that couldn't afford the main model. **Does this mean we are getting a free tier for \"Advanced Voice Mode\" in ChatGPT soon? Usually, API drops precede consumer rollouts.**",
        "comments": [
            {
                "raw_content": "I'd just love to be able to dictate for long stretches in chatgpt without it timing out and crap. Let me have confidence that I could record for long stretches and the value goes up. For now I basically need to use otter to do that for me and then paste over.",
                "author": "Gratitude15"
            },
            {
                "raw_content": "Any one else's voice mode stop working / loading today? I'm tired of the voices, tired of their attitude, tired of their lack of intelligence and capability. We better get something real good or we will soon be in 2026 without capabilities that were promised in 2024 (that we got for a short time before the substantial nerf took place and was called an \"upgrade\").",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "I’d have to see what this is about. With all the transcription updates to advanced voice it could led up to this. You sure it’s emotions or more so just agentic capabilities?",
                "author": "Ok-Mathematician8258"
            }
        ],
        "subreddit": "singularity"
    }
]