[
    {
        "post_name": "🇺🇸❤️🎄🐸🎁✊🏻",
        "score": 312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sweet! The Brakeless Trump Train!",
                "author": "TinfoilHardhat"
            },
            {
                "raw_content": "Frens 🐸",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "u/pdwbot how fast is the train going? 🚂",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KariLake is the rightful governor of Arizona",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i watched it all go down was obvious fraud even videos of people dumping ballots in the mailboxes, which is illegal in AZ judge in the lawsuit was just a bitch and didnt want to do what needed to be done",
                "author": "fightfightfightx"
            },
            {
                "raw_content": "Life in prison for Hobbs? Or just drag her outside, and feed her to the wolves?",
                "author": "dontdrinksoy"
            },
            {
                "raw_content": "Democrats can only “win” through fraud.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American family has 5 kids. She makes $2,600 per month after taxes The cheapest option she could get for health insurance from the Affordable Care Act marketplace is $1,700 per month with a $17,000 deductible",
        "score": 355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just be an illegal. Get it all for free like healthcare, food, housing and thousands of extra spending money.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Same reason it costs $8,000 for a car bumper. Insurance makes everything more expensive because the party paying for the services has less than zero incentive to keep costs under control. After all, higher costs mean higher premiums!",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Fuck Bathhouse Barry and Big Mike, they were the catalyst to destroy this country. Nigbamacare, illegals, and racism like we have never seen. The Demonrats are pure evil.",
                "author": "CaptainWinston"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dinesh D'Souza : She’s so crushed by the untimely deaths of her two dear friends that she decided to get all dressed up and head over to a comedian’s talk show to chat about her grief.",
        "score": 311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being Michelle Obama's chef also takes a very courageous, many would say foolhardy, individual.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "They're very used to people in close positions to them dying.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Commies all pretend they like each other. They are all disposable to each other when they outlive their usefulness. It's all theater.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats politically weaponized an army of medically diagnosed retarded Americans to tell President Trump to stop using the word Retard",
        "score": 331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Walz feelings were really this hurt huh? Well, stop being a retard faggot, Tim.",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "Offense is taken, not given. This is a backhanded exploitation of people with legitimate handicaps. These aren't \"retards\", did someone call *them* retards, labeled them as such and put them in a video? Holy fucking shit, the mental gymnastics they had to go through to make this \"point\" are downright diabolical. Let me play the other side of this coin as well, if these people do identify as *retards* and there is nothing wrong with being retarded, then what is the problem? Are retards insulted by being lumped in on the level of politicians?🤣",
                "author": "Dirk_Diggler"
            },
            {
                "raw_content": "i have worked with, been friends with, and most generously enjoyed interacting with people who would otherwise be classified as intellectually, developmentally, or mentally disabled. i promise you that they are more in tune with the graces of life that we fucking retards miss on a nearly constant basis. the real retards are the fools taking advantage of these people.",
                "author": "bearhugprolapse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Not just Somali Fraud: Linda McMahon just CAUGHT Minnesota engaging in massive education fraud: \"ghost students\" received millions of taxpayer dollars & POCKETED the cash. Trump Administration is formally demanding the RESIGNATION of Minnesota Gov. Tim Walz due to massive fraud & dereliction of duty",
        "score": 1220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, so we're going to do something about it then, right?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fraud is a crime. Resignation is not punishment.",
                "author": "NamendaBiden"
            },
            {
                "raw_content": "how hard is tim yanking his son around tonight?",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Everyone on the Left discussing gun control refuses to ever consider that if we just locked up ALL violent criminals, the majority of violent crime would disappear, overnight.",
        "score": 881,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The biggest explosion in crime was due to the left saying \"Putting violent criminals in jail is racist!\", and then installing judges and DAs who follow that philosophy. If they said \"Every criminal statute is hereby repealed when the criminal is black!\", that would never pass the legislature. Install corrupt DAs and judges, and the net outcome is the same. Corrupt judges and DAs completely bypass the legislature when it comes to preventing crime.",
                "author": "fskfsk"
            },
            {
                "raw_content": "I'm beyond taking prisoners for violent crimes. Bring the death sentence for murder, rape, attempted murder, bodily injury and child abuse in any form.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Because the Goal is not public saftety. The Goal is public disarmament.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pete Hegseth: Finally an accurate headline.",
        "score": 773,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Milley! Hang that traitorous bitch!",
                "author": "I_Love_45-70_Gov"
            },
            {
                "raw_content": "Oh boy I'm excited! Something's about to happen! 🚨🚨🚨 Everyone in this administration should just get the fuck off social media for a while and actually do things. Too many people are trying too hard for the \"viral meme tweet\" and it's incredibly gay.",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "Two more weeks.",
                "author": "Gibs3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Motives Unclear",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muslims need to be banned from coming here.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "This shit should have been delt with right after 9/11. The exact same narrative and cover-ups are happening. Islam does NOT belong anywhere near Western societies.",
                "author": "Alphahorizon"
            },
            {
                "raw_content": "we will never know what happened",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just CALLED OUT Islamic terrorism for what it is, demanding the West stand against it after what happened in Sydney: \"We don't learn...ALL NATIONS must stand together against the evil forces of radical Islamic terrorism.\"",
        "score": 750,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop calling it radical Islamic terrorism. It’s just Islamic terrorism.",
                "author": "HockeyMom4Trump"
            },
            {
                "raw_content": "What does “stand against” even mean? Just start round these fucking sand ngrs up and shipping them the fuck out.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "How about no “peaceful” Islam in our country either",
                "author": "juustlearn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🗯️ 𝐑𝐞𝐩𝐨𝐫𝐭𝐬: Officials at Brown are now 𝙖𝙣𝙜𝙧𝙞𝙡𝙮 𝙮𝙚𝙡𝙡𝙞𝙣𝙜 at the public for asking questions, per Jack Poso...",
        "score": 1118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "COVERUP",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Inside job. Cover-up. Send in the FEDS.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "If the common citizen can track down a killer within 72 hours I would say with certainty we do not need an FBI. States can handle this and the military should prosecute stolen valor and things of that nature. FBI is in shambles and completely worthless.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow, is this the BROWN University killer?",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That person looks like he'd walk as seen in the videos.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": "It’s done. This shit is over. They are literally covering for a leftwing terrorist that shot a white girl to death for being a Republican. Trump has to go ahead and go full tyrant on the Left. Declare Marshall Law. Fuck the judges.",
                "author": "BasedCostanza91"
            },
            {
                "raw_content": "Websites and socials suddenly scrubbed. Weird huh.",
                "author": "Disinformation_Mnstr"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump has ordered a full blockade on all sanctioned oil tankers traveling to or from Venezuela",
        "score": 987,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn straight! Only Israel gets to boss us around.",
                "author": "MythArcana"
            },
            {
                "raw_content": "# HELL # YEAH **LET'S FUCKING GO!!!**",
                "author": "GarlicFart1776"
            },
            {
                "raw_content": "Which oil, land and other assets did Venezuela steal from the USA?",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Brown University X account has just blocked EndWokeness",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's beginning to look like this was a state-sanctioned, college-backed Political Assassination.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Are we willing to finally admit that colleges are nothing but terrorist cells?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Surprise motherfuckers! You are busted. Campus director phone 401-863-1000",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🗳️ 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Nearly EVERY Democrat voted 𝘼𝙂𝘼𝙄𝙉𝙎𝙏 a bill to prevent migrant children from being placed with sponsors who have criminal histories...",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sick fux",
                "author": "Bobsnatch"
            },
            {
                "raw_content": "This is the most anti-trafficking bill that I've seen. If every candidate running against these fuckers doesn't plaster this on every TV and newspaper, they don't like winning.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "# 🔗 𝙇𝙄𝙉𝙆 𝙏𝙊 𝕏 𝙋𝙊𝙎𝙏 ***:*** 》 *https://x.com/libsoftiktok/status/2001089288780271922* 《 For those without an account: *https://xcancel.com/libsoftiktok/status/2001088843672658112* --- Info on the ***Kayla Hamilton Act HERE*** → *https://www.congress.gov/bill/119th-congress/house-bill/4371/text/ih*",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A verified buyer from the United States with the name \"Mustapha K.\" reviewed a 9MM muzzle brake through the Wing Tactical website on December 29th, 2024, the same caliber used in the Brown shooting. There are approximately a few hundred people in the entire United States with that name",
        "score": 1155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is all just speculation right now as the FBI kicks snow looking for clues",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Muzzle brake?",
                "author": "MagaMom69"
            },
            {
                "raw_content": "I hope you fucking retards realize that Muzzle Brakes are one of the most common firearms accessories in the USA, and that 9mm is the most common handgun caliber. This is like touting the BREAKING NEWS that a guy named John drives a Toyota Corolla.",
                "author": "Stygem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The U.S. House PASSED the \"Kayla Hamilton Act\" in a 225-201 vote. The Bill bans illegal, unaccompanied alien children from being released into our communities. Kayla was murdered and sexually assaulted by a then-16-year-old illegal, Walter Javier Martinez.",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"children\"",
                "author": "TDAF"
            },
            {
                "raw_content": "201 cunts voted against a dead American",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "Where do the illegal unaccompanied children go? Does this Bill specify if they get deported? If so, that explains the 201 Nays.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And there's George Soros",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the more proof George Soros is still a NAZI.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "George Soros is the public facing financier of the Color Revolution against the United States of America.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Soros is a Hungarian Jew, but is persona non grata in both Hungary and Israel. Figure this out for yourself.",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI agents seen kicking the snow in Providence, Rhode Island, looking for clues in the search for the Brown University shooting suspect.",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Humiliation ritual double-whammy. The agents wasting time and resources we get to pay for at gunpoint.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Lol they did the meme https://youtu.be/g4OBUupicWg?si=MEmSmTxqZ-y7k8TH",
                "author": "PapaPepe"
            },
            {
                "raw_content": "While Kash is laughing it up on podcasts with his honeypot girlfriend, you can't make this stuff up",
                "author": "brainphreeze"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal employment is now at the lowest level since 2014 — down by 271,000 jobs since President Trump took office. Promises made, promises kept.",
        "score": 1192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**I VOTED FOR THIS**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "MORE! REDUCE IT MORE!",
                "author": "Konsaki"
            },
            {
                "raw_content": "I think it can be leaner. Where to start? 🤔",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom's Hardware: \"Don't wait if you're planning to upgrade your RAM or SSD, Kingston rep warns — says 'prices will continue to go up,' NAND costs up 246%\"",
        "score": 524,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While they're not wrong, their job is to sell RAM.",
                "author": "spicypixel"
            },
            {
                "raw_content": "It seems for the life of me that I cannot seem to buy a Computer when there ISNT a shortage of something, somewhere, somehow.",
                "author": "Dominator211"
            },
            {
                "raw_content": "I bought a bunch of ddr4 on eBay to upgrade my am4 systems. Hunkering down for the next few years and will see what happens.",
                "author": "Illustrious_Log_8053"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New scam: Sealed DDR5 kit sold as new hid DDR2 sticks and a fake weight plate - VideoCardz.com",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These modules aren't DDR2. These are DDR1, and pretty old ones! The markings on the chip say SAMSUNG K4H280838B-TCB0, which apparently runs at 266 MHz (PC-2100).",
                "author": "lukfi89"
            },
            {
                "raw_content": "No it's the same scam we've heard about for years... decades even. Return fraud like always. Who lets this crap get published?",
                "author": "SuperHiko"
            },
            {
                "raw_content": "I looked up the pin out differences for ddr1-ddr5 out of curiosity. It looks like there is a different pin out, but it is really subtle unless you count the pins or measure it. Are there any quick visual references anyone can share?",
                "author": "ragin_brainer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DRAM Price Hikes Have Minimal Impact on PC OEMs, Notes Report",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With a massive *FOR NOW.* When they run through their existing stocks of RAM, it'll creep in.",
                "author": "FlarblesGarbles"
            },
            {
                "raw_content": "OEMs like Dell and Lenovo have announced significant PC price hikes (15–20%+) in 2026. HP has also stated that in the second half of 2026, it will increase prices for its consumer lineups as well, due to a lack of secured component sources. So yeah, what mattered even a week ago doesn’t matter anymore. This is the reality now, and even a market study done today will soon be meaningless.",
                "author": "nariofthewind"
            },
            {
                "raw_content": "Minimal impact? They're all announcing large price increases",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix, Samsung Reportedly Deliver Paid HBM4 Samples to NVIDIA Ahead of 1Q26 Contracts",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RAMs too expensive now to give free prototypes 😆",
                "author": "blackbalt89"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "EIB and STMicroelectronics announce €1 billion agreement to boost Europe’s competitiveness and strategic autonomy",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pompous words. It's no wonder we europeans gave the world the best poets. $1 bn in the age of artificial intelligence is the amount Elon spends on travel and security for a month, when he vacates a Marriot hotel for his stay.",
                "author": "SlightAspect"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermalright Phantom Spirit 120 Vision EVO tested",
        "score": 0,
        "text_content": "Hey I couldn't find any professional tests yet so I ordered the vision to compare it to the standard Evo The slightly bigger fans make it run minimal slower for same temps but have in my test worse sound above 45% RPM than the standard Evo so I will send it back I made pictures of both Fans and coolers but somehow can't attach it here",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Batman: Arkham Knight Nintendo Switch update out now, includes Switch 2 improvements",
        "score": 388,
        "text_content": "Has anyone been able to try this? Love the trilogy and have thought about getting the games to play on Switch2 since I haven't played since release date!",
        "comments": [
            {
                "raw_content": "Man, I might have to double dip on these since they keep supporting them and they're getting decent sales ($20 on the eShop right now). All time classics and it'd be fun to have them portable.",
                "author": "blueberrypizza"
            },
            {
                "raw_content": "There you go: https://youtu.be/_M7yCon_cLo?si=TIo1or-yyo72G9oS It's still very obviously the Switch 1 version but it's at least serviceable. It was atrocious before. Hopefully they do an actual Switch 2 version though.",
                "author": "Charming_Ease6405"
            },
            {
                "raw_content": "I just noticed all three are on sale in the Aus store. With this update, it makes playing them even more enticing. I haven’t since PS4 lol.",
                "author": "MattehPee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Soooo post Game Awards… how quickly are we thinking this game will be ported?",
        "score": 356,
        "text_content": "I mean it’s probably the most successful AA in recent money, so there’s no way Nintendo doesn’t have eyes on it now, right? Would it run that well on Switch 2? Could it be a full physical release instead of a key card?",
        "comments": [
            {
                "raw_content": "I think it could easily run on switch 2 - just depends on the devs",
                "author": "Fresh-Chemical-9084"
            },
            {
                "raw_content": "It runs like ass on Steam Deck, it’d have to be a pretty good port",
                "author": "ryzenguy111"
            },
            {
                "raw_content": "After playing it on PS5 I don’t have high hopes for the Switch 2 version. It’s already quite low resolution. Maybe handheld it’ll be ok but so much of the game relies on its art direction and if that’s compromised then I’m not sure it’ll be the best place to experience this masterpiece.",
                "author": "MesozOwen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After testing the demo out how are you feeling about final fantasy 7 remake?",
        "score": 270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10 / 10",
                "author": "Ok_Internal_8500"
            },
            {
                "raw_content": "Stable 30 fps throughout entire demo, excited to play this again might do it handheld only this time around",
                "author": "ellmatatan2000"
            },
            {
                "raw_content": "Square actually putting in the effort on one of their ports for once. Now do Kingdom Hearts.",
                "author": "3ehsan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Great time to be a Nintendo Gamer",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What game is this",
                "author": "Ghost-Power"
            },
            {
                "raw_content": "YES IT IS!!!! I never got to play ff back in the day! all my friends had the ps1 I had snes (as I only buy nintty consoles) Now 20 years? ish? later we can finally shine!!! ![gif](giphy|glvNGHmbZwgrKH4YYA)",
                "author": "Escapement_Watch"
            },
            {
                "raw_content": "Euhm it's a great game, but I wouldn't call having to wait X years after launch date to finally be able to play it a \"great time\".",
                "author": "DarkNemuChan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m conflicted….",
        "score": 245,
        "text_content": "Trust me when I say I hate key cards as much as the next person but I’m so tempted to pull the trigger cause so many great games are finally coming on the switch 2 and it sucks to not play them cause I always prefer handheld gaming and love the system but I just cant stand the idea of key cards. I know this discussion is like beating a dead horse at this point but I’m contemplating.",
        "comments": [
            {
                "raw_content": "You can also sell em",
                "author": "Possible_Aardvark856"
            },
            {
                "raw_content": "I just buy them, key card or not because I want to play the games and for me single player games I much prefer physical over digital.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I'll take GKC over pure digital any day - can trade it, sell it, loan it, whatever. Pure digital you are just stuck with. Also for me personally I can use Bst But reward points on GKCs to get the games for cheap.",
                "author": "Mysticwaterfall2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Another good port inbound. FFVIIR runs well on the Switch 2.",
        "score": 992,
        "text_content": "No drops or stutters so far, even will all the particle effects. And before the almighty \"gamers\" start pointing it out, yes it's locked at 30fps which isn't a big deal.",
        "comments": [
            {
                "raw_content": "Never played Final Fantasy. Is this one a good game to start? Or would you recommend another game?",
                "author": "KvatchWasAnInsideJob"
            },
            {
                "raw_content": "It looks and runs so gooood. They are spoonfeeding us these 3rd party ports :D",
                "author": "setonfire_"
            },
            {
                "raw_content": "People can shit on the Switch 2 all they want but as an 80s kid who grew up with a NES, it's wild seeing a hand-held console running games like this. I love it.",
                "author": "StormtrooperMJS"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Looks Phenomenal on Switch 2",
        "score": 202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's lookong really impressive on Switch 2.",
                "author": "Bzduras"
            },
            {
                "raw_content": "Yes its fucking incredible",
                "author": "Adeel_"
            },
            {
                "raw_content": "What I’m really curious about is, will the second installment come to switch 2? I am a Nintendo only console gamer, so I really want this, but not if they aren’t gonna port the sequel, which I would wanna jump into afterwards. From what I have seen the sequel is more open world and thus maybe more taxing on the switch 2? Anyone heard if sequel will be ported or think in your personal opinion it will? 🤔",
                "author": "NoConcert8526"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I hope Persona 5 Royal / Strikers / Tactica get Switch 2 Editions",
        "score": 57,
        "text_content": "I know i sound naive because Atlus will Atlus... But with SEGA recently admitting that their usual re-release strategy isn't panning out like they hoped, i wanna believe they'll go the Switch 2 Edition route and just let us do a paid upgrade path...",
        "comments": [
            {
                "raw_content": "Wouldn't hold your breath Atlus is so slow to port things, if at all, and Persona 3 also got an awful Switch 2 version",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Metaphor switch 2",
                "author": "PhaseSlow1913"
            },
            {
                "raw_content": "There was no upgrade path from P5 to P5 Royal and there was not upgrade path from the Xbox One/Ps4 Royal edition to the Series/PS5 version either. So if they ever bother with an update you will need to pay full price again most likely.",
                "author": "Diligent-Ad650"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "CharlieIntel: CoD2027 does not take place during the late 1990s/early 2000s, it's a new franchise set in the modern-era",
        "score": 273,
        "text_content": "CharlieIntel put out a new tweet which contradicts GhostOfHope's rumor that CoD2027 will be set in the late 1990s/early 2000s. It is now alleged to be in the modern era which lines up with earlier rumors/reports about the game. >We have heard that Sledgehammer Games' 2027 Call of Duty title does not take place during the late 90s/early 2000s, despite some rumors today. Per the latest reports, it's a new sub-franchise set in the modern-era. Also funnily enough SHG is now the second studio to respond to rumors that Hope has posted, after IW recently over that MW4 rumor [https://xcancel.com/charlieINTEL/status/2000987007007473995](https://xcancel.com/charlieINTEL/status/2000987007007473995)",
        "comments": [
            {
                "raw_content": "hopefully it’ll be able differentiate itself from MW/BO, it’s due time for a new sub-franchise",
                "author": "Traxe0"
            },
            {
                "raw_content": "Call of Duty: Even Moderner Warfare",
                "author": "Zyaru"
            },
            {
                "raw_content": "It’s called call of duty modern warfare: ghost",
                "author": "usaduno"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: EXCLUSIVE: COD2027 made by Sledgehammer Games will be a new sub franchise with completely new characters set in the late 1990s/early 2000s.",
        "score": 374,
        "text_content": ">\\- Omnimovement with NO Tac Sprint is currently planned for the game \\- Pick 10 returning is a big discussion happening \\- Zombies currently still not planned to return \\- Get High returns (Still unclear if its the third mode) [https://xcancel.com/TheGhostOfHope/status/2000945365055394031](https://xcancel.com/TheGhostOfHope/status/2000945365055394031)",
        "comments": [
            {
                "raw_content": "Sledgehammer’s 3rd attempt at making a sub franchise for COD",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "CoD is CoD. For better or worse. These leaks just don’t hit for me.",
                "author": "Hovi_Bryant"
            },
            {
                "raw_content": "You think they have the balls to work 9/11 into the story?",
                "author": "Fluid_Chef_4777"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "How Collaboration in High-NA EUV and Transistor R&D Are Shaping Future Waves of Device Innovation [Intel installed first ASML TwinScan EXE:5200B]",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The post on Intel's official blog reads … > ## Scaling with Confidence: First TWINSCAN EXE:5200B High NA EUV Installed > […] > Specifically, today we are excited to share that Intel and ASML have *reached the milestone of “acceptance testing” on the TwinScan EXE:5200B*. This High-NA EUV tool maintains the high resolution of the first-generation EXE:5000, while expanding output to *175 wafers per hour* and improving overlay (accurate alignment of different lithography layers) to 0.7 nanometers. > This builds on Intel’s experience with High-NA EUV that began in 2023 with the shipment of the world’s first commercial High-NA tool to our research and development fab in Oregon. > Key enabling innovations of the EXE:5200B include the following: > * Higher power EUV source: Faster wafer exposure at practical doses, supporting resist/process windows for high contrast patterning while minimizing Line Edge Roughness and Line Width Roughness. > * New wafer stocker architecture: Improved lot logistics and thermal/process stability, which mitigate drift and enhance throughput consistency, especially critical for multipass or multiexposure flows. > * Tighter alignment control: The 0.7 nm overlay figure reflects advances in stage control, sensor calibration, and environmental isolation, all of which matter as customers push the limits of transistor density. > #### 2D Materials for Future Transistor Scaling > […] > In joint work presented at IEDM last week, Imec and Intel demonstrated a 300mm manufacturable integration of source/drain contacts and gate stack modules for 2DFETs (WS₂, MoS₂ for ntype; WSe₂ for ptype). The central innovation is a selective oxide etch applied to Intel-grown, high-quality 2D layers that were capped with AlOx/HfO₂/SiO₂. This enabled damascene-style top contacts, a reference to the ancient technique of embedding metal into a trench or groove. This is a world first for fab-compatible processing – while preserving the integrity of the underlying 2D channels.",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "seeing fancy factory tech like this always has me wondering... how much financial damage would eating lunch next to it do?",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Minisforum launches BD895i SE MoDT motherboard with 16-core Ryzen 9 8945HX launched at $424",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was interested in the 7945HX version, but now I can't buy ddr5 even the laptop memory.",
                "author": "ApplicationMaximum84"
            },
            {
                "raw_content": "AMD Ryzen™ 9 8945HX is a straight refresh of 7945HX. It's still Dragon Range (Zen 4). If anyone (like me) thinks AMD's naming scheme is hopeless.",
                "author": "burninator34"
            },
            {
                "raw_content": "Cool, you can just double the cost and that directly gives you how much it costs when you add the RAM.",
                "author": "nikomo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "8-inch gaming handheld now also with AMD - MSI Claw A8 review",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "8-inch is pretty good actually",
                "author": "afonsolage"
            },
            {
                "raw_content": "> Verdict - AMD version is the worse choice overall > MSI's Claw is one of the few gaming handhelds with an Intel processor, offering a really good, albeit expensive, overall package thanks to efficient Lunar Lake processors. However, we don't really understand why an AMD-powered Claw model is now being launched on the market. The AMD version offers no real added value, especially since the new case is less ergonomic, and the reduction in the size of the shoulder buttons and triggers does not really make sense. Apart from the processor choice, that case looks horrendous with two edges right where the device will rest on the palms.",
                "author": "chris-tier"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Consumers are feeling gloomy about the economy. Here's why they're spending anyway",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Stocking up” on TV’s? Computers? Toys? lol. Black Friday already broke online sales records (effect of inflation an entirely different subject). Christmas will likely do the same. Meanwhile brick and mortar, small businesses and mom and pops continue to close down. What’s crazy is nobody wants to admit that the economy is in terrible condition. Nobody wants to connect the dots. Commercial real estate agents all say their transactions are fine. Ask them what type of warehouses are moving, who are the tenants? They’re all businesses needing to downsize. Larger warehouses are vacant, huge demand for smaller sized warehouses. They don’t realize that businesses are actually closing down locations - they just see transactions being the same and no net change to their wallets. “Everything is fine!” This happens in freight, too. “There is crazy demand!” Yeah - because businesses are trying to navigate tariffs. They are pulling in inventory before the tariffs go into effect. Freight companies are closing left and right, just like everyone else. There is an absurd amount of gaslighting and willful ignorance, and not enough people questioning reality.",
                "author": "South-Play-2866"
            },
            {
                "raw_content": "We already know the top 10% of households make up 50% of consumer spending. How do we know they aren’t just further propping up spending? Im doing great, but even so find the current economy concerning.",
                "author": "NewChemical7130"
            },
            {
                "raw_content": ">\"Every headline says people are scared to spend,\" he said. \"Then >I walk down [one of Boston's major shopping streets] Newbury Street >on a Saturday and it's shoulder-to-shoulder.\" That's because we don't have cast-iron debtor's prisons.",
                "author": "mrktcrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Unemployment rate jumps to 4.6%",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quadruple it to get the real rate",
                "author": "SlavaCocaini"
            },
            {
                "raw_content": "All FRED stuff fundamentals went the way of the DoDo, viable DATA by way of nypost, nothing more than the National Enquire Economics for the naive and gullible.",
                "author": "Lo0seR"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else feeling like the photos are lying more than usual in this market?",
        "score": 20,
        "text_content": "I’ve been actively looking again over the past few weeks, and one thing really stands out to me in this market: photos are doing a lot of heavy lifting, sometimes too much. On paper, many listings still look “reasonable” price-wise compared to peak years. Great lighting, clean staging, nice kitchens, all the usual. But once you actually show up, the reality feels different. Parking issues, noise, awkward layouts, deferred maintenance, or neighborhoods that don’t quite match the listing vibe. I’m not saying sellers are doing anything wrong. I get it, everyone is trying to protect value in a market that’s clearly cooled but not exactly cheap. Still, as a buyer, I’ve become way more cautious. I care less about perfect finishes and more about fundamentals: location, livability, long-term demand, and what problems I’ll actually have to live with day to day. Curious if others are feeling the same. Are you adjusting your expectations, or are you waiting things out until pricing and reality line up a bit better?",
        "comments": [
            {
                "raw_content": "The ai staged photos it's messed up",
                "author": "Significant-Pen-6049"
            },
            {
                "raw_content": "Yep. This ai is blowing things out of the water with their crazy crap",
                "author": "Salty_Wing_8267"
            },
            {
                "raw_content": "The photos and description are lying. The 'marketing' and choice of words to keep prices high is insane and ridiculous. A 2 feet deep by 6 feet wide is called a loft nowadays. A good size loft is considered a loft only or a bedroom (because you can turn it into a bedroom). WTF, since when? Blame the RE outlets and realtors that are laughing to the bank, the crooks and pirate traitors.",
                "author": "Dry_Hunter3514"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In the last five years, Long Island homes in FEMA flood zones sold for a 10% higher median price than those outside flood zone risk areas",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So.. waterfront properties sell for more? No friggin way",
                "author": "DumpingAI"
            },
            {
                "raw_content": "Who knew location mattered most regarding desirability….",
                "author": "bigmean3434"
            },
            {
                "raw_content": "Great. Then let the buyers assume the entire risk on their purchase. When, and if, they ever get wiped out, no FEMA assistance. Sound fair? Got the money to ignore the risk, then let’s see them eat the risk when, or if, that comes to pass. Seems like a decent agreement to me.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "He just said the G word now. Gemini 4 tomorrow 😉",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> \"Hey Google, dim the lights please.\", I say as I sit in my reclining chair. The blinds are closed. The doors are locked. I have my lotion at the ready on my adjustable height coffee table. I can barely contain myself as I unzip my pants with one hand, clutching my phone in the other. I proceed to write the most asinine braindead tweet and watch the likes pour in, every notification another stroke. I am Logan Kilpatrick.",
                "author": "bigasswhitegirl"
            },
            {
                "raw_content": "Wait, didn’t Gemini 3 come out like a month ago ?",
                "author": "TheSidecam"
            },
            {
                "raw_content": "BARD",
                "author": "Disable_Autoplay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 1.5 Image vs Nano Banana Pro vs Seedream 4.5 vs Flux 2 Max vs Grok 2 Image",
        "score": 74,
        "text_content": "Same Prompt​ GPT 1.5 Image Nano Banana Pro Seedream 4.5 Flux 2 Max Grok 2 Image",
        "comments": [
            {
                "raw_content": "Grok needs to catch up on image generation",
                "author": "soggy_bert"
            },
            {
                "raw_content": "Nano Banana Pro is the clear winner here. Not even close.",
                "author": "ZestyCheeses"
            },
            {
                "raw_content": "Pic 5: What could be worse than one? Three.",
                "author": "BoldTaters"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BREAKING: OpenAI releases \"GPT-Image-1.5\" (ChatGPT Images) & It instantly takes the #1 Spot on LMArena, beating Google's Nano Banana Pro.",
        "score": 744,
        "text_content": "The image generation war just heated up again. OpenAI has officially dropped **GPT-Image-1.5** and it has already dethroned Google on the leaderboards. **The Benchmarks (LMArena):** **Rank:** #1 Overall in Text-to-Image With **Score** 1277 (Beating Gemini 3 Pro Image / Nano Banana Pro at 1235). **Key Upgrades:** **Speed:** 4x Faster than the previous model (DALL-E 3 / GPT-Image-1). **Editing:** It supports precise \"add, subtract, combine\" editing instructions. **Consistency:** Keeps character appearance and lighting consistent across edits (a major pain point in DALL-E 3). **Availability:** ChatGPT: Rolling out today to all users via a new \"Images\" tab in the sidebar. **API:** Available immediately as gpt-image-1.5. **Google held the crown with \"Nano Banana Pro\" for about a month. With OpenAI claiming \"4x speed\" and better instruction following, is this the DALL-E 3 successor we were waiting for?** **Source: OpenAI Blog** 🔗: https://openai.com/index/new-chatgpt-images-is-here/ **Video :** https://youtu.be/DPBtd57p5Mg?si=iBlvJ0Km6uUoltYn",
        "comments": [
            {
                "raw_content": "I tried the 3 combined photos prompt example on their [announcement page](https://openai.com/index/new-chatgpt-images-is-here) with Banana Pro. The result is below. >*\"Combine the two men and the dog in a 2000s film camera-style photo of them looking bored at a kids birthday party.\"* https://preview.redd.it/sf2hzi365m7g1.png?width=2080&format=png&auto=webp&s=ad07a65eb007bc33098f85c45236614e0df033f9",
                "author": "Gaiden206"
            },
            {
                "raw_content": "I like the scene consistency [https://chatgpt.com/share/6941abd7-1380-8013-aacc-75ed1f4496b6](https://chatgpt.com/share/6941abd7-1380-8013-aacc-75ed1f4496b6) https://preview.redd.it/355f25dt5m7g1.png?width=1024&format=png&auto=webp&s=6d0f2046b189c7bb8b19c470ae6ff0ca15fabdf5",
                "author": "Infninfn"
            },
            {
                "raw_content": "It looks very...ChatGPT. Stylistically similar to their previous image model, which isn't a good thing in my opinion.",
                "author": "meatotheburrito"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Terence Tao: Genuine Artificial General Intelligence Is Not Within Reach; Current AI Is Like A Clever Magic Trick",
        "score": 1221,
        "text_content": "https://mathstodon.xyz/@tao/115722360006034040 Terence Tao is a world renowned mathematician. He is extremely intelligent. Let's hope he is wrong. >I doubt that anything resembling genuine \"artificial general intelligence\" is within reach of current #AI tools. However, I think a weaker, but still quite valuable, type of \"artificial general cleverness\" is becoming a reality in various ways. >By \"general cleverness\", I mean the ability to solve broad classes of complex problems via somewhat ad hoc means. These means may be stochastic or the result of brute force computation; they may be ungrounded or fallible; and they may be either uninterpretable, or traceable back to similar tricks found in an AI's training data. So they would not qualify as the result of any true \"intelligence\". And yet, they can have a non-trivial success rate at achieving an increasingly wide spectrum of tasks, particularly when coupled with stringent verification procedures to filter out incorrect or unpromising approaches, at scales beyond what individual humans could achieve. >This results in the somewhat unintuitive combination of a technology that can be very useful and impressive, while simultaneously being fundamentally unsatisfying and disappointing - somewhat akin to how one's awe at an amazingly clever magic trick can dissipate (or transform to technical respect) once one learns how the trick was performed. >But perhaps this can be resolved by the realization that while cleverness and intelligence are somewhat correlated traits for humans, they are much more decoupled for AI tools (which are often optimized for cleverness), and viewing the current generation of such tools primarily as a stochastic generator of sometimes clever - and often useful - thoughts and outputs may be a more productive perspective when trying to use them to solve difficult problems.",
        "comments": [
            {
                "raw_content": "Tao's post is more of a philosophical statement about how to view the inner workings of LLMs and related AI tools rather than a statement that AGI is a dead-end. He doesn't accept the label of \"intelligence\" because he thinks what LLMs do is too different from what humans do, so he calls it \"cleverness\" instead. Perhaps a fair point, but I'll note that when he says this cleverness may be \"traceable back to similar tricks found in an AI's training data\", I have to notice the similarities to how humans learn to do mental \"tricks\" or \"rules of thumb\" that allow them to solve problems by saving time or energy (sometimes called heuristics), which they learn from their own \"training data\" or lived experience.",
                "author": "Completely-Real-1"
            },
            {
                "raw_content": "While I respect Tao a whole lot, and his work with AI has been very interesting, I think (as is often the case in these discussions) people are talking about intelligence in such a way that keeps the goalposts permanently five feet away. Yes, what AI does is just stochastic brute force - a bundle of dirty tricks. But *any* truly detailed explanation or reproduction of intelligence would just be a dirty mechanical trick! There is no little man in our heads that is doing the 'real intelligence'. It's neurons. It's electricity. There is a mechanism behind it. So it's unfair to dismiss AI because it ultimately relies on tricks instead of something ineffable. The rest of his argument is entirely valid.",
                "author": "Saint_Nitouche"
            },
            {
                "raw_content": "No thanks, I'll just trust my Twitter feed.",
                "author": "doodlinghearsay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Give me slop, beautiful slop\" by u/KayBro",
        "score": 56,
        "text_content": "As the world splinters into pro AI media and anti, I stand squarely in the pro.",
        "comments": [
            {
                "raw_content": "Premium self aware slop! I enjoyed that.",
                "author": "JackInSights"
            },
            {
                "raw_content": "mind. blown. thank you",
                "author": "grigednet"
            },
            {
                "raw_content": "Original https://www.reddit.com/r/aivideo/s/dUXTihJ3iV",
                "author": "Anen-o-me"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-image-1.5 is not better than Nano Banana Pro",
        "score": 273,
        "text_content": "Have seen a lot of examples from both models and I can say pretty surely that nana banana pro is much better than gpt-image-1.5. What do you guys think?",
        "comments": [
            {
                "raw_content": "You guys are forgetting aesthetic is not the only thing measured. Otherwise midjourney would rank alot higher. I assume their new model follows instructions and edits better which more people find important.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Ever think that maybe people aren't posting when chatgpt wins and might have a slight agenda? Lymsys is literally a blind test and more reliable than random online posters.",
                "author": "metalman123"
            },
            {
                "raw_content": "It's so funny to me you guys never say the benchmarks bad when Gemini's at the top of it. WTH is going on with this ChatGPT hate?",
                "author": "EventuallyWillLast"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Popular AI Image Models compared, Which model you think did the best?",
        "score": 53,
        "text_content": "I have tried to create a comparison for all 3 popular image models using Higgsfield, which model do you choose? Here are prompts, since most of them aren't properly visible : 1. \"A futuristic robot shaking hands with a human businessman. The robot is on the left side of the frame. The background is a blurred office.\" 2. \"A first-person point-of-view shot looking down at your own feet. You are wearing mismatched sneakers (left foot red, right foot blue) and standing on a skateboard.\" 3. \"A black cat hiding behind a sheer white curtain. Only the cat's silhouette and glowing yellow eyes are visible through the fabric textures.\" 4. \"A red apple on the far left, a blue hardcover book in the center, and a green ceramic vase on the right. The book is leaning diagonally against the vase.\" 5. \"A transparent glass sphere contained inside a wireframe metal cube, which is balanced delicately on the tip of a stone pyramid. The pyramid is floating above a calm, mirror-like ocean.\" 6. \"A person eating spaghetti, sucking a noodle into their mouth. The noodle connects from the plate to the lips.\" 7. \"A group of 5 diverse friends taking a selfie. All faces are in focus, distinct, and high quality.\" 8. \"A close-up of a musician's hands playing a complex chord on an acoustic guitar. Fingers are pressing specific strings.\" 9. \"A delicious pepperoni pizza with absolutely no basil leaves.\" 10. \"A teddy bear made of shiny, reflective chrome metal, sitting on a concrete floor.\" 11. \"A hybrid animal that is half-owl and half-cat. The head is an owl, the body is a cat. It is perched on a branch.\" 12. \"A classic wooden chair that is carved entirely out of translucent green Jell-O. It is wobbling slightly.\" 13. \"A yellow strawberry and a blue lemon sitting side-by-side on a silver plate.\" 14. \"A clean, vector-style infographic illustration of a bicycle with labels pointing to parts: 'Wheel', 'Seat', 'Pedal', 'Handlebar'.\" 15. \"The word 'NATURE' formed by the negative space between towering pine trees in a dense, foggy forest.\" 16. \"A latte art pattern in a white ceramic cup that clearly spells out the word 'Love' in the milk foam.\" 17. \"Extreme close-up of a denim jacket collar. The word 'REBELLION' is embroidered in gold thread. The stitching texture is visible and follows the folds of the fabric.\" 18. \"A neon sign mounted on a textured brick wall that explicitly reads: 'The quick brown fox jumps over the lazy dog'. The sign is glowing pink.\"",
        "comments": [
            {
                "raw_content": "Nano banana pro looks the most realistic in most of these. I found the difference particularly noticeable in the 3d hierarchical stacking (only pyramid that is floating above the ocean), the consumption physics, and technical labeling examples.",
                "author": "WillingnessStatus762"
            },
            {
                "raw_content": "Gpt1.5 still has that AI smiles and shades, nano banana looks more real",
                "author": "Relevant-Sherbet-460"
            },
            {
                "raw_content": "Thanks for doing this",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Another novel proof by GPT 5.2 Pro from a UWaterloo associate professor",
        "score": 208,
        "text_content": "[https://x.com/kfountou/status/2000957773584974298](https://x.com/kfountou/status/2000957773584974298) GPT 5.2 Pro solves the COLT 2022 open problem: “Running Time Complexity of Accelerated L1-Regularized PageRank” using a standard accelerated gradient algorithm and a complementarity margin assumption.",
        "comments": [
            {
                "raw_content": "While people will downplay this still you can see the new trend atleast. We are moving slowly and slowly into new capabilities, which are doing more things with less hand holding. Next year or the year after it might not be some obscure open problems anymore. Then in 2028 it could be some of the top problems. And then eventually fully autonomous without custom scaffolding or prompting assistance. People seem to forget that llms weren’t even doing middle school math a few years ago.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "I am really curious about the state of a.i in 1-3 years, will it become AGI, will TAO see the light ? Or is this just clever tricks as he says, I am biased and I think AGI is arriving soon. Before end of 2030. My guess is 2027.",
                "author": "fastinguy11"
            },
            {
                "raw_content": "The way the guy described the problem, it sounded like it stumped even highly intelligent postdoc researchers. I feel like people's increasingly high standards for what qualifies AGI will mean that by the time they iron out the few kinks that remain with these models we will have an ASI on our hands. People have already abandoned the \"as good as the average human\" threshold without acknowledging it, but this is so close to superhuman. It's also curious to me that only GPT 5 does this and we hear it almost on a daily basis. Not Gemini 3, not Claude 4.5. There doesnt seem to be this discrepancy between benchmark results and real world use with GPT 5 unlike the competitors.",
                "author": "Maleficent_Care_7044"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis (DeepMind CEO): AGI will be 10x bigger than Industrial Revolution & Reveals DeepMind's \"50% Scaling /Innovation\" Strategy (New Interview)",
        "score": 390,
        "text_content": "A new interview just dropped on the **Google DeepMind channel** and it is packed with specific details on their roadmap, timelines and philosophy. While **others** are betting 100% on scaling laws, Demis reveals DeepMind is playing a **different game.** **1. The \"10x\" Scale & Speed:** He explicitly compares the coming AGI shift to the Industrial Revolution but with a terrifying/exciting multiplier. *\"It's going to be 10x bigger and maybe 10x faster.\"* He suggests this transformation will **happen in a decade rather than a century.** **2. The \"50/50\" Secret Sauce:** This is a huge strategic reveal. DeepMind isn't just throwing compute at the wall. **The Split:** They allocate 50% of effort to Scaling and 50% to Innovation (Architecture/Research). **The \"Wall\":** He implies that scaling alone isn't enough to reach AGI, you need fundamental architectural breakthroughs to fix **\"Jagged Intelligence\"** (where models are PhD-level at physics but fail basic logic). **3. Solving \"Root Node\" Problems(Post-Scarcity):** Demis doubles down on using AI for science first. He calls Fusion and Superconductors (Materials) **\"Root Node\"** problems. **The Thesis:** If AI solves energy (Fusion) and efficiency (Materials), you unlock everything else (Water, Food, Transport). **The Quote:** He explicitly questions **\"what happens to money\"** in a world where energy and goods are abundant/free. **4. Simulation Theory (Genie + SIMA):** He teases a future training pipeline: Using **Genie** (World Model) to generate infinite 3D worlds. Plugging **SIMA (Agent)** into those worlds to learn physics and logic via evolution, without needing real-world robot data. **With the \"50% Innovation\" comment, does this confirm that Google believes the \"Scaling Law Wall\" is real? Or is this just how they differentiate from OpenAI?** **Source: Google DeepMind - The Future of Intelligence** 🔗: https://youtu.be/PqVbypvxDto?si=0bgv1OnfxBtVgYeP",
        "comments": [
            {
                "raw_content": "“ *If AI solves energy (Fusion) and efficiency (Materials), you unlock everything else (Water, Food, Transport).”* I mean, this ^ is true & what I’ve been pointing out. Nearly free energy + extremely cheaply extracted and processed materials unlocks everything else, and we have housing/transportation almost free. They’re assuming AI will be able to design & build a working fusion reactor and robots come out ready to get to work. Another big assumption is energy companies, construction companies, food distribution companies- all will be willing to walk away from hegemony without a decades-long political battle they paid for.",
                "author": "j00cifer"
            },
            {
                "raw_content": ">**With the \"50% Innovation\" comment, does this confirm that Google believes the \"Scaling Law Wall\" is real? Or is this just how they differentiate from OpenAI?** I feel there is a wall, but only a temporary one and it can always be overcome with enough compute. However, while scaling may continue to take AI models further, it is only in a linear way, whereas the other 50% innovation element will open up multiple new routes that can spread AI in all directions, enabling it to be properly balanced and well-rounded.",
                "author": "BB_InnovateDesign"
            },
            {
                "raw_content": "Energy and food are abundant now, they are just doled out to us in a way that makes people rich.",
                "author": "bornlasttuesday"
            }
        ],
        "subreddit": "singularity"
    }
]