[
    {
        "post_name": "So many retarded faggots 🤦‍♂️: Man in Durham, NC, films as the car he’s in stops in the middle of the road, backs up, and floors it toward DHS/ICE agents until they draw their weapons.",
        "score": 526,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and the driver remains free",
                "author": "Raetchel"
            },
            {
                "raw_content": "Dems are vaxxed to the max and high on crack.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Joseph Rosenbaum: \"Bust on me for real!\"",
                "author": "rugburnd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller slams democrats for calling for an \"insurrection.\" 🔥",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This shit is so exhausting. The left calls for a literal insurrection and the best the GOP can come up with is to “slam them”. Who gives a shit? Hold them accountable or just shut up. It’s just lip service at this point.",
                "author": "yourheadasplode"
            },
            {
                "raw_content": "Less ***\"𝙎𝙇𝘼𝙈𝙈𝙄𝙉𝙂\"*** and more ***𝘼𝙍𝙍𝙀𝙎𝙏𝙄𝙉𝙂*** please.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Handcuffs and perp walk them out of the House Chambers. This is not ok and it's going to grow with other Democrats taking a stand with them.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The U.S. House just PASSED Rep. Elise Stefanik’s bill that locks up violent offenders and restores real accountability in D.C. H.R. 5214 will require MANDATORY cash bail for a wide array of offenses that pose a threat to public safety.",
        "score": 539,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's dope, but there's no way it'll pass on the senate. Democrats are against locking up their constituents.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Still not a federal issue outside of DC. I agree with the intent, but Congress has no power in this regard in State cases.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "Link https://x.com/ProudElephantUS/status/1991354479657251330?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The owners of a Michigan-based plumbing company were just arrested for employing and harboring nearly 250 illegal immigrants across 4 states, generating $75M in revenue. This is only the start. Millions of jobs that belong to Americans have been stolen from us.",
        "score": 1487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this. We’re going to continue to face street confrontations with ICE from Hamplanet activists. Continue this, but goes balls in on going after the companies and corporations who turn a blind eye and hire illegals.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "This is just the tip of the iceberg . People have made millions off the new slave labor fueled by the Biden era immigration non enforcement. Construction contractors are the worst offenders.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Moises Orduna-Rios, 36, and Raquel Orduna-Rios, 30, both from Plymouth, Michigan, face several charges.",
                "author": "Restore_Sanity_alt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epstein Bill Has been Signed by POTUS and Here is his message",
        "score": 1212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Trump is so awesome 😎",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "I will withhold my thoughts until I see the outcome, but I hope for full transparency",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Now what? Isn't there a provision in the Bill that gives Bondi the authority to hold back any information she deems to be of a sensitive nature? Or some way out of releasing everything?",
                "author": "Landslide_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DOJ has just charged Democrat Congresswoman Sheila Cherfilus-McCormick (FL) with stealing $5 MILLION in FEMA funds meant for disaster relief If convicted, she faces 53 YEARS in federal prison. (yeah right)",
        "score": 1221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take a Democrat politician down every 3-4 days. Throw some red meat to us hungry Conservatives!",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "We don't have a race problem, we have a problem race Strong black queens are the worst",
                "author": "Sea_Still"
            },
            {
                "raw_content": "FEMA is a slush fund for illegals and corrupt politicians",
                "author": "556x45mm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "finally, something we can agree on!",
        "score": 1411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Peggy, piggy, what difference does it make at this point? 📰🐷",
                "author": "MythArcana"
            },
            {
                "raw_content": "Peggy will always be a piggy who feeds and eats left wing garbage.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Back away from the Big Macs, slowly!",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's why they hate ICE",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ICE # ICE # BABY",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "She almost looks human now.",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "Is the ice bucket challenge back?",
                "author": "LadyPede23"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Image Released From Dan Crenshaw's Fight To Mexico",
        "score": 875,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hate this faggot",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "🎵 If you like Pina Coladas, Getting Sauced on a Plane. We know you're not into MAGA, You're just Eye-Patch McCain...",
                "author": "Moebius"
            },
            {
                "raw_content": "Fuck that cyclops.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: \"Communist Mayor of New York City, Zohran “Kwame” Mamdani, has asked for a meeting. We have agreed that this meeting will take place at the Oval Office on Friday, November 21st. Further details to follow!\"",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make sure tons of bacon and pork chops are served for some good snacking",
                "author": "cptKloss7"
            },
            {
                "raw_content": "Disappointing that he's lending credibility to Mamdani. The only person he should be meeting with is Homan.",
                "author": "BrianOfNazareth"
            },
            {
                "raw_content": "Will ICE be exciting him out after the meeting?",
                "author": "Smeg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Top Republicans Banned Dan Crenshaw (Eye-Patch McCain,) From International Travel After Alcohol-Related Episode During Congressional Trip to Mexico",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If I were him I’d avoid getting blind-drunk.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Dan Crenshaw is so consistently full of shit that I bet he has two eyes.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Yo Ho Ho and a Bottle of Rum",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More. MORE!",
        "score": 1472,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Removal of illegal aliens makes all aspects of everyday life better. Less traffic, lower housing costs, less crime.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "same thing happened in Az.",
                "author": "T471"
            },
            {
                "raw_content": "and like a gazillion students in their school system are illegals too, apparently",
                "author": "LogicCircuits"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HERE WE GO: Judge Boasberg Revives Criminal Contempt Proceedings Against Trump Over Alien Enemies Act Deportations",
        "score": 955,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Slick move, but I think too little too late. You aren’t going to be able to use a Trump trial as reason you can’t be impeached and removed, so you can say you’re being target and discriminated against for having a current, though late, and already reversed, Trump trial. Lawfare shouldn’t be able to save you now.",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "This guy makes me think there’s something to that whole reptilian theory",
                "author": "taytaytay"
            },
            {
                "raw_content": "Arrest and execute",
                "author": "SanityGumby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Schools are not underfunded and understaffed. They’re just full of illegals.",
        "score": 1623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how many illegal parents pay taxes to keep the schools running. Not many, I'd bet. Go home and take your kids with you.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "30,000 Hispanic students did not show up for school at Charlotte Mecklenburg school today. Whether illegal or Anchor babies most people don't realize that it cost taxpayers 11,782 a year per student. That is at this level $353,460,000 a year for illegals education. Times this for health care then Welfare. But hey, don't point out the strain on the economy ya bigot",
                "author": "OldZilla"
            },
            {
                "raw_content": "This is why I quit teaching after 12 years and opened up a homeschool tutoring business for kids and parents who give a shit. This killed it for me. Two years ago I took a job at a Middle School with the assumption I was teaching 8th grade US History, Founding through Reconstruction. Well I get there and they tell me there's a change and I'm teaching 7th grade Civics. Oh well, not my thing but I'll do it. Here's where the shit hits the fan... They designate some students as \"ELL\" or \"English Language Learners.\" Two of my five sections were the \"traveling ELL groups\" meaning in one section 18 of the 24 students were ELL and not English proficient and 15 of the 21 in the other. Most spoke no English at all. I was guaranteed an interpreter but they could only do so much. There were days she wouldn't show up. I couldn't grade papers. My administration did nothing. Half of them are using phone translators. The kids in the classes that spoke English and were born here were fed up of the bullshit and they'd all argue. It was a mess. I had kids coming to me in private and just venting to me about this horseshit and I told them I was on their side and that if you really want change, go an complain to the administration. They did and they too were ignored. And now I'm pissed off since you're ignoring children. I went to my admin, tee'd off on them and asked just what the hell was going on. Why are they ignoring valid complaints from students? Their answer basically was \"we have to take them in.\" I told them there are no grades in the gradebook 6 weeks into school for these sections since I barely understand Spanish. I was ignored. VERY next day, I walk in. Brand new kid. Literally came off of a boat from Honduras and was in school the next day. Thrown into my classroom. No English. Couldn't even read or write in his own language when I printed off a Spanish version of the text reading and questions. I knew I was done then, so I sat at my desk the rest of the period and just stewed. At the end of the day I turned in my keys and badge ripped my admin a new asshole. They tried to keep me around but I had already cleaned out my classroom and I took off never to come back. Now? I run a successful tutoring business where I work with homeschool families and are able to teach Math and History to well-mannered, attentive, smart kids with a stable home structure. I get paid very well, set my own hours, and my anxiety is basically zero. A few of my American students from the school's families reached out and I ended up tutoring some of them separately at a local Panera on the side. You should have heard the convos between the parents and I. I know some parents went to the board meeting mentioning my situation and were dismissed since their \"time expired.\" Please- for the love of all, homeschool your kids. Find a network. There are plenty of displaced teachers like me who love teaching and learning and helping kids but that isn't happening in those snake pits that are public schools.",
                "author": "Gregor85"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "♥️♥️♥️♥️",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much personal net worth do you think is represented in this one photograph? 🤔",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "What a true leader looks like.",
                "author": "journalist"
            },
            {
                "raw_content": "Hangin’ with the boys.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Governor Greg Abbott: \"Today, I called on local District Attorneys to investigate alleged Sharia “courts” operating in Texas. These tribunals have no legal authority in our state. Only Texas laws enforced by Texas courts govern our people.\"",
        "score": 1411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I reported this to the Governor on his web site.",
                "author": "dburt2"
            },
            {
                "raw_content": "Anyone participating in those courts should be tried for sedition and in general we should eject all of them from the country. Muslims do not belong here.",
                "author": "GoUSA"
            },
            {
                "raw_content": "Meanwhile in Dearborn MI, parents are chopping daughter's heads off.",
                "author": "AllahFubar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"This Is A National Emergency\" - US Govt To Buy 10 Large, New Nuclear Reactors",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do I get the feeling government ownership is going to make nuclear power the most expensive form of energy?",
                "author": "killedmytv"
            },
            {
                "raw_content": "I thought we were broke",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": ">Cameco, CCJ - Currently a 49% owner of Westinghouse. They, along with **BROOKFIELD ASSET MANAGEMENT** Well, well, well...",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Del. Stacey Plaskett Tells CNN ‘There Are a Lot of People Who Have Done a Lot of Crimes’",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep ... we fucking know. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "This is what they don't understand about \"us\". We don't give a shit what team you play for. Left, right, DEM, GOP. We want law and order restored. Equal justice under the law. We don't care who it is.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "Her entire party are criminals, She thinks it's normal",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Ask what you can do for your country, not what free gibs your country can give you in exchange for dependence and servitude\"",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need a national revival of bullying unearned, undeserved entitlement.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "Ignant low iQ sheboon.",
                "author": "Anyone"
            },
            {
                "raw_content": "Like she was almost there on her thought process but then went brain dead.",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Venezuela's Maduro Seeks 'Face-to-Face Talks' With Trump Officials",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't trust Venezuela Donar Trump! Venezuela is assho!",
                "author": "TooBright"
            },
            {
                "raw_content": "i vote no until we finish the mass deportations.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "They'll try to kill them. Why bother.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "System builders are panic-buying memory, and it could spark a chip shortage through 2027 | The AI boom is triggering a global DRAM crunch, and consumers are about to feel it",
        "score": 201,
        "text_content": "",
        "comments": [
            {
                "raw_content": "About to? Has the author not checked consumer RAM prices recently?",
                "author": "Acrobatic_Fee_6974"
            },
            {
                "raw_content": "It might sound very boomer of me to say, but I hate this new AI technology lol. It’s perpetually bringing the worst out of us",
                "author": "Jaybird149"
            },
            {
                "raw_content": "More problems caused by the fake intelligence scam industry? Gee whiz.",
                "author": "Tall-Introduction414"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GPU depreciation could be the next big crisis coming for AI hyperscalers",
        "score": 481,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cannot wait to get a couple enterprise grade gpus for 75 dollars each on serverpartdeals",
                "author": "ktaktb"
            },
            {
                "raw_content": "If ai companies keep buying more chips without having the capacity to power them on. Then its likely they will be buying 50k cards and by the time they have additional capacity they will be worth 10k. You can find 64gb h100 for 8k today. That's a 2023 card. Three mile island is coming online in 2028. OpenAI infrastructure projects are expected by 2030. All of these estimates are likely optimistic and would face delays. And the chips most companies are taking loans against are now dropping in valuse like a rock. Because the hyperscalers want to only use the most powerful cards in a slot. Old cards are not something you want to keep. This is the text book example of an unsustainable environment. Nothing in the AI world is amortized",
                "author": "upbeatchief"
            },
            {
                "raw_content": "Dont worry guys Leatherman Jensen promises the cards you buy will last for 6+ years. But also you must buy the next generation, and the one after that, and the one after that, and the one after that- or be hopelessly outdated versus your competitors. Quick, go out and take massive loans to buy cards that won't have spare production capacity until 2 years from now, so you can put them in a building that won't be built until 3 years from now, so it can get spare power 10 years from now. Jensen have tons of stonks to dump, quick! Buy!",
                "author": "Virtual-Patience-807"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Announces Financial Results for Third Quarter Fiscal 2026",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That profit margin is nothing short of obscene.",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": ">Record revenue of $57.0 billion, up 22% from Q2 and up 62% from a year ago >Third-quarter Gaming revenue was $4.3 billion, down 1% from the previous quarter and up 30% from a year ago. >NVIDIA’s outlook for the fourth quarter of fiscal 2026 is as follows: Revenue is expected to be $65.0 billion, plus or minus 2%.",
                "author": "BarKnight"
            },
            {
                "raw_content": "Gross margin 74.6%... on top of TSMC's 59%. What a time to be a monopoly.",
                "author": "FollowingFeisty5321"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] NAND Flash Prices Likely to Jump Double Digits in Q1, as Makers Reportedly Hike in Turns",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am seriously considering of buying Samsung SSD with huge storage in advance for next 2 or 3 years. Yeah it costs now but it could be saving more money in the long-run I guess.",
                "author": "zhunnni99"
            },
            {
                "raw_content": "NAND and memory makers always grab every opportunity to increase prices if they can going by last 20 years of my pc gaming experience.",
                "author": "SomewhatOptimal1"
            },
            {
                "raw_content": "Can't wait for the AI bubble to pop. Unfortunately, DDR 4 is end of life so I will just wait until I am forced to upgrade my whole setup. But, I am excited for any bottom feeding of depreciated technology. If I can get it for pennies on the dollar. If I can build a whole system around former enterprise hardware, an upgrade might be a possibility.",
                "author": "HatchetHand"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD FSR Redstone Ray Regeneration Tested vs DLSS Ray Reconstruction",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This feels like that time they launched FSR Frame Generation in 2 games to hit a deadline even though it clearly wasn't ready yet. Then a few months later in actually launched in more games and in a much better state. Like you can see the what the tech is trying to do and it does some things well already but as Alex points out it clearly feels unfinished. I've seen someone say its marked as version 0.9 in the code. Watch them announced a slew of games and the full feature pack including Radiance Caching, ML Frame Generation and improvements to FSR in general on December 10th and then say its coming to more games in Q1.",
                "author": "Firefox72"
            },
            {
                "raw_content": "Well, it seems AMD has something... Sarcasm aside, nice to see DF's input on this 'early look' of FSR RR. A lot of strange things observed. With the same settings AMD has some things omitted compared to Nvidia, as seen with shadows in a distance, it's quality, as well with objects reflected like with lights (can't say for sure if this an AMDs or dev thing, regardless it doesn't matter to the end user to who's fault). With FSR RR, the most noticeable spotted difference from at first glance is the retrieval quality and AA from the reconstructed/regenerated scene. DLSS RR is better which shouldn't be shocking. This is due to how AMD does their upscaling passes with RR, as you can choose whatever upscaling method you want with RR and how it can be clearly seen with water reflections. FSR4 Perf is noticeably blurrier than FSR4 Native when comparing the reflections in the water, while it wouldn't matter what DLSS quality setting you use in conjunction w/ DLSS RR. As an aside, I found it interesting how FSR4 Perf had better texture detail on the letters than DLSS4 Perf (that said perhaps could be a sharpening thing outside of the upscalers used). Moving on, FSR RR has missing features as noted with how reflections should be reconstructed. Reflected objects/scenes do not correctly diffuse, and are sharp throughout (typing this, I use [10:20](https://youtu.be/RuASMLRGFus?si=p1ECIQiTwNLLxeT0&t=617), but interestingly enough w/ DLSS RR, the gun has noticeable artifcating maybe due to the denoiser?). Environments with FSR RR do not have correct contact lighting as seen with the part about the trash can. AMD does have some things going for it (though, I suspect is more per game basis). In motion, DLSS RR while clearer experiences more ghosting/smearing elements compared to FSR RR. That said, can't be said for the disocclusion aspect as seen with swapping guns with water in the foreground (that said I wonder if this is again the same problem with the upscaler/denoiser pass with FSR RR or if the problems with game settings between AMD and Nvidia has something to do with it like SSR). There are things to note about performance, but isn't wildly different, so I won't make comments there. Overall, again strange to say the least. It's obvious FSR RR isn't quite done, which can be worrying considering it's still one part of Redstone. Also, the game itself isn't a good test bed for the feature (as if it only being enabled for MP wasn't obvious enough) as there are bugs and instabilities. I guess, if anything, AMD has a step in the door which will have improvements. That said, isn't quite like with FSR4 in terms of wow. Not only that FSR4 can easily be swapped with Optiscaler and recently in AMD's own driver with most DX12 games. This one seems to be dependent on AMD actually implementing it with games so unless there are workarounds no DLSS RR swapping with FSR RR.",
                "author": "Noble00_"
            },
            {
                "raw_content": "What is up with the different visuals at the same settings between the cards? The AMD version seems to be missing or have downgraded visuals.",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Netherlands Returns Control of Nexperia to Chinese Owner",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This whole thing was just asinine.",
                "author": "Arctovigil"
            },
            {
                "raw_content": "Can somebody explain to me why this feud happened in the first place? I just have a passing interest in electronics and Nexperia doesn't appear to me to make any cutting edge products, unlike Infineon which makes very high performing transistors, so why the concern of IP theft?",
                "author": "Least_Light2558"
            },
            {
                "raw_content": "okay every dutchman employed by Nexperia should start looking for a new job because the chances of Wingtech keeping these backstabbing pirates are slim.",
                "author": "Safe-Pomegranate-942"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Snapdragon X2 Elite Series: Overview and benchmarks for the new top SoC for ARM notebooks",
        "score": 29,
        "text_content": "Qualcomm was kind enough to invite us to San Diego last week for its first Architecture Deep Dive for the Snapdragon X2 series. The chip giant had already provided initial insights into the new ARM-based platform for Windows PCs during the summit in Hawaii (we reported). These insights were now to be explored in greater depth on site. In addition to the top-of-the-range Snapdragon X2 Elite Extreme (96-100) SoC, Qualcomm also took a closer look at the two smaller chips: the Snapdragon X2 Elite with 12 and 18 cores respectively. Thanks to FastConnect 7800, both support Wi-Fi 7 with tri-band support and Bluetooth 5.4. The Snapdragon X75 modem system supports 5G with up to 10 GBit/s download and 3.5 GBit/s upload speeds. A total of 53 MB of cache is available to the two 18-core models, and 34 MB to the 12-core model. All can access 9 MB of last-level cache. In addition to dual NVMe, all modern SD standards are supported and up to three additional displays can be powered. These can operate at either 4k up to 144 Hz or 5k / 60 Hz. Lower resolutions do not allow for higher refresh rates or more displays. ### Table of Contents - CPU - Staggered clock speeds for the Snapdragon X2 Elite (Extreme) - GPU – Significant improvements in performance-intensive applications - Benchmarks of the Snapdragon X2 Elite Series - Look ahead: Products not expected until the first half of 2026",
        "comments": [
            {
                "raw_content": "The top SOC for WINDOWS arm notebooks",
                "author": "SomeoneBritish"
            },
            {
                "raw_content": "V excited, hopefully we get Linux support for these processors.",
                "author": "Anustart2023-01"
            },
            {
                "raw_content": "Interesting, they claim avg gaming benchmarks against AMD's Strix Point (29% faster) and Intel's Lunar Lake (50% faster). Would also love to see more HW acceleration support in software like [Blender ](https://code.blender.org/2025/08/blender-for-windows-on-arm/)etc. 1H '25 seems a bit vague but looking forward to see 3rd party tests.",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] Qualcomm’s Snapdragon X2 Elite",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are a number of articles out today after our Compute Architecture Day last week in San Diego where I Presented on Power, Performance, and Thermals. Glad to answer questions as possible.",
                "author": "Guy_Therien_Qualcomm"
            },
            {
                "raw_content": "uArch has lots of improvements, as expected (and damn lots of $). Interesting to me is their Matrix Engine that can do 128 FP32/INT32, 256 FP16/BF16/INT16, or 512 INT8 operations per cycle. Perf cores features them as well. X2 GPU seems more proper now compared previous which seemed more like an afterthought which essentially was a fatter Adreno 730. QC have hopped on board with their own RTU with everyone else while AMD still has yet to get on the bus lol. Interestingly they have what is called Adreno High Performance Memory (AHPM) \"to allow for the GPU to do tiled rendering all within the AHPM before rendering out the frame to the display buffer.\" Hexagon NPU 6 support BF16 and FP8 that now has \"64 bit Virtual Addressing to the DMA unit which means that NPU 6 can now access more than 4GB of memory.\" I've been following FLM using AMD's NPU to run local models and surprisingly NPUs aren't a meme, they are decent at running reasonable sized models. IIRC they had a demo running a local model as well. QC have unsurprisingly introduced their own measurement of power. Idle Normalized Platform Power (INPP). Described: >What INPP gets you is the SOC power plus the DRAM power plus the Power Conversion Losses; while this isn’t quite solely SOC power, INPP is about as close as you can get to pure SOC power in a laptop form factor where discrete power sensors aren’t very common. With more details, I am a lot more interested than before (and for the gamers, there's another post on here where QC makes their own claims)",
                "author": "Noble00_"
            },
            {
                "raw_content": "So adreno is still a hybrid design with most of the on die cache being \"tile ram\". Though even the Adreno 840 is actually mostly par with the Mali g1 ultra in performance and efficiency even with all that gmem. But is nice that the Gmem can be more utilized in direct mode because directX is always ran at immediate mode on adreno GPUs",
                "author": "beneficiarioinss"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(Reuters) Nvidia shift to smartphone-style memory could double server-memory prices by end-2026",
        "score": 35,
        "text_content": "Nvidia recently decided to reduce AI server power costs by changing the kind of memory chip it uses to LPDDR, a type of low-power memory chip normally found in phones and tablets, from DDR5 chips, which are typically used in servers.",
        "comments": [
            {
                "raw_content": "This is highly unlikely and not how supply and demand now works. Get real.",
                "author": "inverseinternet"
            },
            {
                "raw_content": "Nvidia’s grace-based servers have giant pools of LPDDR to go along with the HBM, because saving power there lets them dump more into the GPU",
                "author": "a5ehren"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Guys, make sure you buy the Tomb Raider game; it only has 27,027 days left for the discount.",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You laugh, but if ya fell into a 74 year comma tomorrow, you’d be sorry.",
                "author": "Kobalt_Dragon"
            },
            {
                "raw_content": "Thats about 74 years or about 10ish consoles from now. Ima hold off for the discount on my PlayStation 15 when im about 104.",
                "author": "Munkeyman18290"
            },
            {
                "raw_content": "You get 20% off? I only get 10%.",
                "author": "Elrond_Cupboard_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin's Creed Shadows is 62.8GB on Nintendo Switch 2",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "115Gb on PC so that’s a pretty decent reduction in size.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "This sort of thing is why I plan on getting a 512GB SD express card at minimum. Third party games are usually just a good bit larger than first party Nintendo ones.",
                "author": "jwhudexnls"
            },
            {
                "raw_content": "Definitely eyeing the “physical” release. Does anyone know if it will have cross-save support? I can’t seem to find anything definitive. It’ll help hold me over until Prime 4 lol.",
                "author": "Robbitjuice"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Honestly after seeing the screenshot on my TV from the eshop it looks AC shadows looks pretty decent visually not gonna lie",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope Outlaws will be the standard, not the exception.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Definitely pretty good for a handheld. It looks nice",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "I was skeptical about outlaws, but bought it on day 1. Not only did it exceed expectations of this tiny tablet, Ubisoft has done multiple patches now to clean it up. I’m definitely picking this up and hope Ubisoft continues to deliver!",
                "author": "Raging_Pwnr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So Pokopia will be a game key-card?",
        "score": 541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not that I am defending them putting it on key card (no reason for it to be), but Nintendo was very specific with their language and said that they weren't planning to use them for any Nintendo DEVELOPED games. They didn't say published games.",
                "author": "mking098"
            },
            {
                "raw_content": "Published by someone else (prob the devs) in Japan, they made the call, Nintendo is following",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "People can argue back and forth about the technical details, but the fact is a Pokemon game is getting released on Game Key Card and that was considered entirely untouchable by the format before.",
                "author": "TheLimeyLemmon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Luigi’s Mansion Localization",
        "score": 91,
        "text_content": "Replaying Luigi’s Mansion for the 3rd time since it dropped on NSO, never realized Bill Trinen worked on this kind of stuff before becoming a higher up",
        "comments": [
            {
                "raw_content": "If you want some extra trivia, Leslie Swan below him voiced Peach in several games from the N64 to Wii era.",
                "author": "Stolen_Meme_Poster"
            },
            {
                "raw_content": "Bill Trinen (and Nate Bihldorff) are part of Nintendo Treehouse, Nintendo of America's dedicated localization team",
                "author": "Icalivy"
            },
            {
                "raw_content": "Yeah, Bill Trinen got his start as a localizer and even became Miyamoto's interpreter for American events like E3, before making his way up to an executive role within the marketing side of NoA.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomb Raider Definitive Edition is the number 4 most sold on the eShop.",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do the whole trilogy!",
                "author": "Montapella"
            },
            {
                "raw_content": "Great, I hope this means they'll port over the rest of the new trilogy over",
                "author": "Throwaway753045"
            },
            {
                "raw_content": "They were smart in how they priced it.",
                "author": "Important-Vast-9345"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kind of surreal seeing Tomb Raider up there",
        "score": 72,
        "text_content": "It went from #14 yesterday to #3 today on the US eshop. Even with its $20 tag, its still cool to see Nintendo fans buy a Tomb Raider game in droves (even if it's a middling port). They now MUST port Rise and Shadow over.",
        "comments": [
            {
                "raw_content": "Why is this surreal? This seems to be par for the course, NS1 had solid 3rd party support as well. Plus this is an older game. Or just surprised it moved up in eShop rankings? New additions to eShop would tend to do this",
                "author": "darthdiablo"
            },
            {
                "raw_content": "Surreal is a bit much",
                "author": "MrFix-it"
            },
            {
                "raw_content": "How is it surreal",
                "author": "Professional_Wiz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders gets big day one 1.1.1 update, patch notes",
        "score": 281,
        "text_content": "# Kirby Air Riders version 1.1.1 update patch notes General * Online Mode has been added. * You can play online mode from the menu screen of “Multiplayer” or each mode. * “Online” has been added to “Checklist.” * Local and LAN play are now available. * You can play by selecting “Multiplayer” -> “Local Wireless.” * A new competitive format called “Relay Switch” has been added to “Air Ride.” * A new “Team Battle” battle format has been added to “City Trial.” * You can now convert “Replays” into video files. * You can convert them into video files by selecting “Record” on the playback settings screen for “Temporary Save Data” or “Data Replay” * A microSD Express card is required to use this function. * You can now post replays and share them with other players. * You can post them from “Details” that appears after selecting each replay data in “Replay” -> “Data Replay” or “Video Replay”. * \\*You can watch replays from “Multiplayer” -> “Spectate”. * You can now train your FP (Figure Player) by holding up an amiibo from the Kirby Air Rider series. * You can read amiibo from “Other Games” -> “amiibo” or on the machine/rider selection screen in each mode. * “Daily Air Ride” and “Limited Time Events” have been added. * You can participate in these events by selecting “Daily” or “Events” from the main menu. * You can now set your “My Machine” to “Private.” * If you set it to “Private,” you will not be able to use that “My Machine” in online mode and it will not be visible to other players. * You can set this all at once by going to “Multiplayer” -> “Options” -> “Share My Machine.” * You can also set it individually from the list screen for each “My Machine.” * Road Trip has been balanced. Online * If your connection is very unstable, we’ve added restrictions that prevent you from hosting paddocks and creating races within the paddock. * You can still participate in paddocks and races hosted by other players. * You can check the status of your connection by going to “Multiplayer” -> “Options.” Bug Fixes * Fixed some issues to improve online play stability. * Fixed an issue where online matchmaking would sometimes take a long time to complete. * Fixed an issue where a match would not start properly after matching for online matches. * Fixed an issue in “Paddock” where the game would not progress after performing certain operations. * Fixed an issue in “City Trial,” “Quick Race,” and “Team Battle” where performing certain operations when joining a friend would cause the game to stop progressing. * Fixed an issue where performing certain operations during multiplayer Air Ride Relay on a single console would cause the game to freeze. * Fixed an issue where performing certain operations while using “FP (Figure Player)” in “Local Wireless” would cause the game to stop progressing. * Fixed a rare issue that could cause the game to become stuck while playing Road Trip. * Fixed an issue where certain tasks in “Checklist” would not be completed even if the conditions were met. * Several other issues were fixed to enhanced the gameplay experience.",
        "comments": [
            {
                "raw_content": "A team battle mode for City Trial sounds insane!!!! I can't wait to try that!",
                "author": "JAYZAWmusic"
            },
            {
                "raw_content": "with this update i think Air riders will be in good standing for a long time to come. Really want to see how the team battles will play out.",
                "author": "Seijin_Noboru"
            },
            {
                "raw_content": "I cannot wait for this game. I've waited for 22 years lol",
                "author": "THE_GR8_MIKE"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Linus was told from valve that the steam machine will not be subsidized, and will cost as much as a pc instead",
        "score": 1218,
        "text_content": "https://youtu.be/g3FkuZNSGkw (at 10:53)",
        "comments": [
            {
                "raw_content": "As much as gaming reddit already put the steam machine on the \"future of gaming\" pedestal, the truth is that a 600$ or above pricepoint will make it a difficult sell, let alone to even make a dent on the gaming hardware space",
                "author": "millanstar"
            },
            {
                "raw_content": "It will be available standalone for $4,000, as well as in a $4,050 bundle with Half-Life 3 included.",
                "author": "Str8UpJorking"
            },
            {
                "raw_content": "Subsidy money went to this really cool boat",
                "author": "WorldofCannons"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mike Straw on HL3 announcement: \"It was never planned for today, from what I know. One person I've spoken to gave me a date, but I haven't been able to verify it with other sources. Until I can I won't recklessly report it\", but \"The date I was told is this year\"",
        "score": 575,
        "text_content": "https://xcancel.com/MikeStrawMedia/status/1991295841181786507",
        "comments": [
            {
                "raw_content": "I dunno Mike Straw. They reliable? This reads very 'I'm pretending to know something' to me.",
                "author": "NaytNavare"
            },
            {
                "raw_content": "In case folks don't know this happened before with HLA. Valve gave out a bunch of possible dates to insiders to weed out leakers. So this could mean an announcement is imminent like few days imminent but we gotta wait and see",
                "author": "WELSH_BOI_99"
            },
            {
                "raw_content": "\"The date I was told is this year\" Well shit, it's not this week isn't it?",
                "author": "Mr_Nobody0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "xPaw, the creator of SteamDB, mentioned there's a suspicious Source 2 AppID not yet publicly available",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another piece of the puzzle...",
                "author": "Xenonnnnnnnnn"
            },
            {
                "raw_content": ">- Steam Machine Demo App >- The Unnanounced Half Life game >- mp4 file of Tyler McVicker in a dimly lit Valve office being subjugated to Chinese bamboo torture techniques take your pick",
                "author": "MrEpicFerret"
            },
            {
                "raw_content": "we're in the endgame now",
                "author": "PontusFrykter"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "For anyone who's been in the dark, reminder there's a Miro board that summarizes of all the Half-Life 3 (codename HLX) leaks",
        "score": 965,
        "text_content": "Over the last few years, dataminers have found a bunch of stuff related to \"HLX\" while digging through updates to the Source 2 engine. The findings are pretty thorough, and we've known for a while that a new Half-Life game is definitely coming. The recent hype hasn't been for no reason. [~~https://miro.com/app/board/uXjVINqBTwM=/~~](https://miro.com/app/board/uXjVINqBTwM=/) Currently not working, updated links below \\*Edit - If you think this is nothing, look at the section titled Summary: Locations, slight spoiler warning. There's some interesting stuff about enemy types as well, and physics mechanics that sound cool. For a more detailed explanation of things, Tyler McVicker has a series on YouTube called the HLX Files, in which he's been breaking down these leaks as they've come out: [https://www.youtube.com/watch?v=36gF6eiCsqU&list=PLa4rnfkA0KE7IWb\\_ck4BtTV1TKYjnHPS-](https://www.youtube.com/watch?v=36gF6eiCsqU&list=PLa4rnfkA0KE7IWb_ck4BtTV1TKYjnHPS-) \\*Edit 2 - The original board isn't working, they took it down or something. Someone found a restored copy of it here: [https://miro.com/app/board/uXjVJnkh8Q4=/](https://miro.com/app/board/uXjVJnkh8Q4=/) and a PDF version here: [https://valvearchive.com/Community/Documentation/HLX%20HL3%20Bulletpoints%20-%20What%20we%20know%20so%20far/2025-11-18/Copy%20of%20HLX\\_HL3%20Bulletpoints%20-%20What%20we%20know%20so%20far.pdf](https://valvearchive.com/Community/Documentation/HLX%20HL3%20Bulletpoints%20-%20What%20we%20know%20so%20far/2025-11-18/Copy%20of%20HLX_HL3%20Bulletpoints%20-%20What%20we%20know%20so%20far.pdf)",
        "comments": [
            {
                "raw_content": "> Miro board Damn, project managers have gotten involved in the leaks game.",
                "author": "lailah_susanna"
            },
            {
                "raw_content": "I just know the gaming subreddit's gonna break when it finally gets announced. It's like old Steam Winter Sales where it'd just stop working due to a lot of people lol",
                "author": "YukYukas"
            },
            {
                "raw_content": "It loaded up on the meme side for me lmao I was very confused for a sec. Good shit lol",
                "author": "CarbVan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Destiny 2 survey leak: Bungie is considering adding Sparrow Racing League, unvaulted campaigns, NPC sidekicks, new Subclass abilities, new Gambit mode, and more",
        "score": 260,
        "text_content": "[Source](https://thegamepost.com/destiny-2-adding-sparrow-racing-unvaulted-campaigns-npc-gambit-survey/) **Question:** *\"Please rank the following potential features to be added to Destiny 2 in terms of their potential to improve your enjoyment of the game.\"* (with a lot of options)",
        "comments": [
            {
                "raw_content": "ONBOARDING. Please for the love of good. I tried three times and have no ficking clue what is happening.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "Unvaulting would be great. I'd like to go back to old planets.",
                "author": "Miaw_Kitty"
            },
            {
                "raw_content": "Did someone say Gambit? ![gif](giphy|32681KwrcXqrFIpI0P|downsized)",
                "author": "Tequila2Dance"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD reportedly planing to raise GPU prices due to AI demand",
        "score": 467,
        "text_content": ">As [VideoCardz reports](https://videocardz.com/newz/amd-rumored-to-raise-gpu-prices-just-as-radeon-rx-9070-xt-finally-reaches-msrp), posts on the [Chinese Board Channel forum](http://www.boardchannels.com.cn/thread-129633-1-1.html) suggest that AMD has made it clear internally that it will be adjusting GPU pricing on all models, although the specific timing and amount have yet to be confirmed. >AMD reportedly raised prices slightly across its GPU range in October, but didn't pass the costs on to customers. However, the next increase is substantial enough that AMD and/or its partners can't absorb the cost, so it will be passed along to the buyer. [Thanks to PC Gamer](https://www.pcmag.com/news/amd-reportedly-prepping-to-raise-gpu-prices-to-cover-memory-costs)",
        "comments": [
            {
                "raw_content": "why can’t we ever have anything nice",
                "author": "BeneathTheDirt"
            },
            {
                "raw_content": "Steve Burke: \"AMD, don't fuck this up\" AMD: proceeds to fuck it up",
                "author": "-PVL93-"
            },
            {
                "raw_content": "I'm gonna pop a bottle of champagne when the AI bubble pops and renders these companies' multi-billion dollar investments worthless.",
                "author": "DogwoodDame"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nick all star brawl 3 roster seemingly leaked",
        "score": 189,
        "text_content": "https://xcancel.com/WretchedDesire1/status/1990978055628861556?s=20",
        "comments": [
            {
                "raw_content": "Damn they really refuse to add more TLOK characters huh",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "Why can they not just add the other three turtles? Or all of the monsters? They have models for them all now and movesets.",
                "author": "al_ien5000"
            },
            {
                "raw_content": "This is the third game that everyone has been waiting for all day in terms of news ![gif](giphy|EJIqwKKY30Dlu)",
                "author": "arkhamtheknight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AC Shadows team has seemingly started working on the next Assassin's Creed",
        "score": 210,
        "text_content": ">Ubisoft Quebec currently has two open positions for a new Assassin's Creed project. After careful inspection of Ubisoft's job listings, we know that these two job listings have only recently popped up. Moreover, they don't appear to be related to other games like the multiplayer Assassin's Creed title, which are explicitly named in their respective job listings. > >The Quebec City-based Ubisoft studio is currently looking to hire an Animation Director and Character Technical Director for the Assassin's Creed project. According to the listing, the Animation Director will work on characters, environments, and objects within the world. [https://clawsomegamer.com/ac-shadows-team-work-on-new-assassins-creed-project/](https://clawsomegamer.com/ac-shadows-team-work-on-new-assassins-creed-project/)",
        "comments": [
            {
                "raw_content": "McDonald's has started working on their next burger",
                "author": "psychonautix66"
            },
            {
                "raw_content": "This isn’t the Hexe one right?",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "they need to release Jade as a single player game on PC/Consoles. Why it went to mobile only is ridiculous considering the setting. Im a huge fan of these games just for simply the virtual vacation it brings. Id gladly take a bunch of AC single player games with varied settings throughout history.",
                "author": "the____can"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AIDA64 gets first update for Core Ultra 200K Plus \"Arrow Lake-Refresh\"",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The \"first aid kit\" design is an interesting choice.",
                "author": "AK-Brian"
            },
            {
                "raw_content": "same outdated socket :(",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD FSR Redstone Ray Regeneration Tested vs DLSS Ray Reconstruction - Not Quite What We Expected [Digital Foundry]",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That tends to happen with multi-generation software gaps. Here's to hoping AMD continues to improve it over the next few years.",
                "author": "DXPower"
            },
            {
                "raw_content": "FSR took a couple years to catch up as well. AMD is on a good path.",
                "author": "shroombablol"
            },
            {
                "raw_content": "So only DF figured out that settings between amd and nvidia are different, ray tracing as well.",
                "author": "Dordidog"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI HX 470 \"Gorgon Point\" mobile processor spotted with 5.25 GHz turbo clock",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Still RDNA3, huh. AMD should REALLY release that leaked int8 FSR4",
                "author": "SavedMartha"
            },
            {
                "raw_content": "Can't wait for the HX470 to arrive. So I can get a slight discount on a mini pc with an HX370.",
                "author": "ConsistencyWelder"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS rolls out AGESA 1.2.7.0 BIOS for AM5 800 series, prepares Zen 5 desktop APUs",
        "score": 27,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The homebuyer affordability gap today is larger than it was at the peak of the 2008 housing bubble.",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another 9T worth of Fed bucks should fix this",
                "author": "i860"
            },
            {
                "raw_content": "Home affordability wasn’t even an issue leading up to the GFC because anyone could get a loan without even needing income documentation. There were no lending standards and that is what drove the “affordability” gap back then. Today, a lot of what caused the gap is due to the 2%-3% mortgage rates driving up home prices and the millions of Boomers with massive amounts of money, equity and paid off houses.. then add the insane amount of wealth that has been created over the last 15 years just in equites and other assets.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "People forget that 2008 was not caused by a lack of affordability. Housing in 2008 was not terribly expensive - it was just given to people who had no income and then those loans were levered to the moon. It was a bad debt and bad loan issue - not a housing asset bubble.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "85% of Americans say homeownership is still key to the 'American Dream'—outranking a successful career or getting married",
        "score": 287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get out of college. Rent an apartment. Build a successful career get married buy house. Get divorced. Sell house and move into apartment.",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "Which is wild because getting married and having a successful career are pretty key to homeownership. If you are trying to get a house you are generally bidding against married couples who work these days.",
                "author": "Synensys"
            },
            {
                "raw_content": "You usually need the other 2 to get the house…",
                "author": "Impressive-Health670"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing numbers point to an unusually strong buyer's market. There's a catch",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> “Of course, it’s only a buyer’s market for those who can afford to buy—many Americans have been priced out of the housing market as affordability has eroded,” Redfin researchers noted. That’s a pretty big catch lol",
                "author": "Reddit_guard"
            },
            {
                "raw_content": "“It’s a buyers market for people that have the money to buy in this market.” Kay",
                "author": "Dapper_Mud"
            },
            {
                "raw_content": "I shouldn’t have been saying that real estate was going to retrace/go down/bubble the last 4 years, I should have said it will be a “strong buyers market”. That sounds much better. Also, if you live long enough you realize that when this stuff is in the news it isn’t an accident or investigative journalism, it’s to drum up buyers and convince people now is the time.",
                "author": "bigmean3434"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It’s the Strongest Buyer’s Market in Records Dating Back Over a Decade",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah because nobody can afford the insane prices zillow and redfin are telling them the home is worth.",
                "author": "shyvananana"
            },
            {
                "raw_content": "It's a delusional sellers market.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Im in Socal and houses are going down a bit and still selling. These prices are crazy and its going to take unemployment or another catalyst for stuff to finally go down.",
                "author": "Purpsnikka"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit highest level in a month, pushing loan demand down 5%",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, increased last week to 6.37% from 6.34% * The overall average loan size across both purchase and refinance applications fell to its lowest level since August of this year. * Applications for a mortgage to purchase a home fell 2% for the week. Mortgage rates rose for the third consecutive week, causing demand from both current homeowners and potential homebuyers to drop. Total mortgage application volume fell 5.2% last week compared with the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, increased last week to 6.37% from 6.34%, with points remaining unchanged at 0.62, including the origination fee, for loans with a 20% down payment. That is the highest level in four weeks. Applications to refinance a home loan, which are most sensitive to short-term moves in rates, fell 7% for the week but were still 125% higher than the same week one year ago. Last year at this time, mortgage rates were about a half a percentage point higher, and refinance volume was unusually low. The large increase from a year ago is more a factor of the very small volumes overall. Applications for a mortgage to purchase a home fell 2% for the week and were 26% higher than the same week one year ago. Purchase demand has hovered around the same level for several months, regardless of interest rate moves. “Application activity over the week was lower, with potential homebuyers moving to the sidelines again, although there was a small increase in FHA purchase applications,” noted Joel Kan, an MBA analyst, in the release. The overall average loan size across both purchase and refinance applications fell to its lowest level since August of this year, driven by another drop in the adjustable-rate mortgage share, according to Kan. Mortgage rates have not moved at all to start this week, looking at a separate survey from Mortgage News Daily. “With only a few exceptions, bonds have been a rudderless ship during the government shutdown. With the backlogged data returning in a slow and uncertain fashion, rudder repairs are similarly slow,” wrote Matthew Graham, chief operating officer at MND. “The surprise release of stale jobless claims data did nothing to inspire and there was limited benefit from another negative print in the weekly ADP numbers.”",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "I thought media said mortgages are in a new sellers market here. Permanently high plateau?",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano Banana Pro can produce 4k images",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The infographic is actually incredible. It's not perfect, but I have not seen anything so coherent from any generative models before. It looks... Almost accurate?",
                "author": "TFenrir"
            },
            {
                "raw_content": "That map is geographically interesting",
                "author": "Mighty-anemone"
            },
            {
                "raw_content": "The solar power infographic is the most mind-blowing one to me. These are usually littered with typos or weird character hallucinations. I only see one though (it goes from Step 2 to Step 4)",
                "author": "Jebby_Bush"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "He just \"Gemini\" again. What can it be?",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/igmgv4j7pc2g1.jpeg?width=560&format=pjpg&auto=webp&s=e7e2780b91ffa8f027c71f9edbfb2cc17ed2e666",
                "author": "ondasankar"
            },
            {
                "raw_content": "Gemini 4. Duh.",
                "author": "oilybolognese"
            },
            {
                "raw_content": "Gemini 3 one-shotted Gemini 4. Expect Gemini 5 by tomorrow and 6, 7, 8 later that day",
                "author": "traumfisch"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "5.1 Pro rolling out. Competition is a great thing",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No Benchmarks tho? 🤔",
                "author": "Purefact0r"
            },
            {
                "raw_content": "https://preview.redd.it/efhv2ioeha2g1.png?width=1178&format=png&auto=webp&s=89943ecafa41544c22db059a6ab94a29b2b56596 Wow",
                "author": "NutInBobby"
            },
            {
                "raw_content": "Pro users only. Gemini 3 is free in AI Studio.",
                "author": "JHorbach"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana 2 is coming!",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't see past the inaccurate depth of field blur.",
                "author": "pieanim"
            },
            {
                "raw_content": "Double handjob",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Those arms look so unnatural, lol.",
                "author": "Grand0rk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing ACT-1: A frontier robot foundation model trained on zero robot data.",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is next level and definitely different from the extremely short and cherrypicked Neo / Figure examples. If this is actually autonomous, then this might give them both a run for their money. Extremely impressive how long horizon, general and dexterous it is",
                "author": "New_Equinox"
            },
            {
                "raw_content": "Their innovation seems to really be in the way they gather data. On their website you can see that they've developed a glove which is a replica of the robot's hand, and they have 500+ humans that wear these gloves on a daily basis to gather training data. So, instead of an entire VR setup and training using teleoperation data, they can just put on some gloves and gather data. https://preview.redd.it/1ucyldi40b2g1.png?width=1210&format=png&auto=webp&s=0781822a165036ac99590895fa70d69dd2401c88",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "The 5x and 10x speeds are doing a lot of heavy lifting here. Thing must be slow as hell. But it's a start.",
                "author": "Scared_Bluebird_7243"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is the true AI moat. Gemini 3 was trained 100% on TPUs. No Nvidia tax",
        "score": 505,
        "text_content": "https://x.com/rohanpaul_ai/status/1990979123905486930?t=s5IN8eVfxck7sPSiFRbR3w&s=19 Google’s TPUs are on a serious winning streak, across the board. Google is scaling 3 TPU chip families Ironwood, Sunfish, and Zebrafish so its custom accelerators cover current high end inference and training needs while laying out a roadmap for even larger pods in 2026-2027. Current TPU users include Safe Superintelligence, Salesforce, and Midjourney, which gives new teams a clear path to adopt. Ironwood, also called TPUv7, is an inference focused part that delivers about 10x the peak performance of TPU v5 and 4x better performance per chip than TPU v6, with a single chip giving roughly 4,600 FP8 terafops, 192GB HBM3e, and scaling to pods of 9,216 chips and around 1.77 PB shared memory, which fits big LLM and agent serving workloads. Early supply chain reports suggest Sunfish is the follow on generation often labeled TPUv8, with Broadcom staying on as design partner and a launch window centered around the later 2020s, aimed at even larger training and inference superpods that take over from Ironwood in Google Cloud data centers. Zebrafish, where MediaTek shows up as the main ASIC partner, looks like a second branch of the roadmap that can hit lower cost and different thermal envelopes, which likely suits more mainstream clusters and regional builds instead of only the absolute largest supercomputers. By spreading workloads across these 3 families, Google can offer hyperscale customers commitments like Anthropic’s plan for up to 1,000,000 TPUs and more than 1 GW of capacity while trying to match or beat Nvidia on performance per watt and usable model scale at the full system level",
        "comments": [
            {
                "raw_content": "Up 50% on GOOG in less than 4 months 🥱 Most obvious buy since 2022 NVDA imo!!",
                "author": "ethotopia"
            },
            {
                "raw_content": "is there any info on how many TPU data centers Google is actually building, compared to what OpenAI etc are building? So how does it compare in gigawatts?",
                "author": "Tystros"
            },
            {
                "raw_content": "Claude and Midjourney also use their TPUs and they have a new generation coming that's a big step up.",
                "author": "Decent-Ground-395"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta AI | SAM 3D: a New Standard for 3D Object & Human Reconstruction from a Single Image",
        "score": 409,
        "text_content": "[https://go.meta.me/85bb63](https://www.youtube.com/redirect?event=video_description&redir_token=QUFFLUhqa0FaV2xkUlVXUFVYb3gxWmJtRTNHZUJsYTR1Z3xBQ3Jtc0tsSHZNdGZ0bW1BSWNVaEE1MVBvT2VmMENBTTlPUlNyT2prT01LaUt0OFdSSEwtLTdqOVJLUkNZRkVFaFdDRkVhWlUyOGFDcXp1eDFtQ3NBZzkwQlVtSVlIWTNJU2REZHdPSURCQ2VGU2pjbmwyNDZQMA&q=https%3A%2F%2Fgo.meta.me%2F85bb63&v=B7PZuM55ayc) Introducing SAM 3D, the newest addition to the SAM collection, bringing common sense 3D understanding of everyday images. SAM 3D includes two models: 🛋️ SAM 3D Objects for object and scene reconstruction 🧑‍🤝‍🧑 SAM 3D Body for human pose and shape estimation Both models achieve state-of-the-art performance transforming static 2D images into vivid, accurate reconstructions.",
        "comments": [
            {
                "raw_content": "W",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "as someone that went to uni for this i think im gonna kms",
                "author": "WeWantWeasels"
            },
            {
                "raw_content": "is there a way to use it?",
                "author": "lordpuddingcup"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI to launch Grok 4.20 by Christmas",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That only leaves them 6 days to release Grok 5? https://x.com/elonmusk/status/1953515379688714697?s=20",
                "author": "Elctsuptb"
            },
            {
                "raw_content": "Isn't Gemini 3.0 Pro GA also releasing early December?",
                "author": "SpecialistLet162"
            },
            {
                "raw_content": "Elon posts only the benchmarks that Grok is on top. Some weird ranking which nobody knows about... The truth is, gemini is on top right now, if Elon cares about truth as he claims to all the time.",
                "author": "rotelearning"
            }
        ],
        "subreddit": "singularity"
    }
]