[
    {
        "post_name": "SHOCKING: Democrats quietly plan a “Napa Retreat,” two-day getaway (Oct. 13-14) at the five-star Hotel Yountville, with an evening wine tour and dinner at Staglin Family Vineyards’ wine caves, as the government braces for a shutdown tonight, per Politico.",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Wine Glass Communists laugh and dine together in comfortable luxury while much of America goes to bed hungry tonight. 🍷",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "QUICK! Start TWEETING that TRUMP will be at Hotel Yountville, with an evening wine tour and dinner at Staglin Family Vineyards Oct. 13-14. The anticipation of the mayhem is exhilarating.",
                "author": "IamBACK"
            },
            {
                "raw_content": "Not shocking. Not shocking at all. Didn't we see this same wine cave feasting just last year during the Biden campaign? It's like an evil lair the monsters retreat to. I'm keeping this in mind every time MSDNC runs some sob story about some poor government wage slave that can't pay their bills and trys to blame \"Orange Man Bad\".",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They all need to go back",
        "score": 487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As a Canadian, I am fucking sick of these fucking non white indian, muslim, mexican, chinese, african, Caribbean etc. assholes who come into white countries and fucking demand to be treated better than white people and refuse to assimilate at all. White people are so nice to them, but these non white cunts bully them back. These people stay in the country for decades and their English is still shitty, and do not assimilate at all. Multiculturalism is a fucking piece of fucking shit.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "Get them the fuck out NOW",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Ilhan Omar committed immigration fraud when she married her own brother.",
                "author": "HockeyMom4Trump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He'll never live it down",
        "score": 400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I forsee many pedes showing up to this clown's future appearances wearing sombreros.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "It just amazes me that he thinks we give a fuck anymore.",
                "author": "vongregormench"
            },
            {
                "raw_content": "I keep seeing these sombrero memes. Can anyone explain? Obviously I missed something.",
                "author": "VonArman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A NEW MEME TEMPLATE IS BORN!",
        "score": 366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At least we know Monica Lewinsky isn’t underneath the desk",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "You laugh, but I wouldn’t be surprised if Trump actually does run for a 3rd term in a completely legal election after some rules have been changed.",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "Odelay homes",
                "author": "Giant_Schwartz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan makes the craziest AI anime Trump videos.",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> ***TO-RUMP!*** --GangnamStyle",
                "author": "barwhack"
            },
            {
                "raw_content": "Japan's obsession with Americana will never get old.",
                "author": "CLF3"
            },
            {
                "raw_content": "No brakes on this train!",
                "author": "Nerion"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shut it down!!!!",
        "score": 1285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And nothing of value was lost",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "But how will my illegal alien son get his sex change hormones?",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "Party time! Everyone get your mustaches and sombreros.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After Hakeem Jeffries melted down on MSNBC over Trump’s meme dressing him up as a Mexican, 47 doubled down and posted ANOTHER one, with Trump appearing in the background as a mariachi band. Nobody can out-troll President Trump. Nobody. 🤣",
        "score": 1290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KEK <-- definitely this one KEK KEK KEK KEK",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "We will never have anyone as amazing as Trump. Hilarious.",
                "author": "nakedjay"
            },
            {
                "raw_content": "Trump living rent free in Hakeem Jeffries mind.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House budget office orders federal agencies to begin implementing shutdown plans (YEY!)",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# HAPPY SHUT DOWN! 🎉",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Get that DOGE list out and start firing all the worthless government employees",
                "author": "IHeartMyDoggy"
            },
            {
                "raw_content": "It's habbening! 🐸🐸🐸",
                "author": "Pederella"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - IT'S OFFICIAL: Democrats REJECT keeping the government open tonight by a vote of 55-45...FIRINGS and LAYOFFS set to ensue when it shuts down at midnight. The Continuing Resolution pushed by Republicans failed in the Senate. Democrats chose illegal aliens first.",
        "score": 1758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then let it shut down, and keep it shut down. Trump can do many things this way. First things first, fire all the lazy parasites.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's easy to clown Mike Johnson, but he did the right thing passing a clean bill in the house and dismissing the session so the senate had to vote on it. Happy to give him his due here.",
                "author": "indigo_truther"
            },
            {
                "raw_content": "The stolen 2020 election will now be the second biggest political backfire in history",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WOW! OMB Director Russ Vought CONFIRMS he will be immediately looking into firing federal bureaucrats once the government is closed - Democrats' worst NIGHTMARE. Dems have HOURS.",
        "score": 1361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GO back and look at my ealier posts today, I told you, Russ has a list ready. All he needs to do is pull the trigger at 12:01 AM",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "Dammit, Russ, I can't have popcorn for breakfast!",
                "author": "AbrahamLincoln"
            },
            {
                "raw_content": "Good, Fire 'em ALL!",
                "author": "TrumpMagaNoBama"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. Kennedy says he’s ready for the government to stay shut down “IN PERPETUITY” to stop Democrats from using tax dollars to pay for illegals’ healthcare",
        "score": 1698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now we’re talking",
                "author": "Yignuced"
            },
            {
                "raw_content": "The US has too much socialism. Too many bandaid fixes for poverty conditions.",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "### NOT ONE FUCKING PENNY!",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - The ADL has announced it is ending its entire “Glossary of Extremism,” claiming entries on organizations like Charlie Kirk’s TPUSA were “intentionally misinterpreted” after voices on X, including Elon Musk, slammed the group for spreading hateful rhetoric.",
        "score": 1213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did Hell just freeze over? Does anyone here know a democrat that can check?",
                "author": "Awakened"
            },
            {
                "raw_content": "Adl still a faggot supremacist nationalist foreign agency.",
                "author": "Frociaggine"
            },
            {
                "raw_content": "They're feeling the legal heat.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seems like a very big problem",
        "score": 867,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That sounds like a little old thing called Treason.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I wish loomer would focus on shit like this instead of starting mean-girl bullshit arguements on X. She can be hella effective, but then she decides to sperg out randomly.",
                "author": "smaynar3"
            },
            {
                "raw_content": "Send him to South Sudan.",
                "author": "SadFugeeFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ice to the Super Bowl, please",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only the illegal ones Gerry only the illegal ones.",
                "author": "Ezekiel75"
            },
            {
                "raw_content": "Why would Puerto Ricans care about illegal aliens getting in trouble?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "This is why people throw chairs at your face, Geraldo.",
                "author": "BigMikesBallz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : ** Democrats doing anything BUT keeping the government open for the American people. **",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a timeline to be alive Edit: These posts are part of the official presidential record and are preserved under the Presidential Records Act",
                "author": "CounterStrike"
            },
            {
                "raw_content": "This is what government employees do all day. Good thing they're officially resigning and getting laid off in about 1.5 hours from now.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Love that this being posted from White House account will trigger so many libtards",
                "author": "BestTimeToBAlive"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The memes are about to get fucking lit!",
        "score": 1533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Salty Sanchez",
                "author": "Coprolite"
            },
            {
                "raw_content": "A little off topic, but Salty has a sponsor, Baerskin tactical. Read up on them before buying anything. A week after placing a $300 order, no tracking, no nothing. Tech support is an answering machine. Took 3 days to hear back via email. Online reviews, aren't great. I should have done my homework. I'll update if I end up getting what I paid for, but a week and still no tracking is crazy these days.",
                "author": "monkadelic"
            },
            {
                "raw_content": "Are you saying Hakeem Jeffries is in for it?",
                "author": "Belleoffreedom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hakeem Jeffries isn’t taking the sombrero meme well: “It was a fake, disgusting, racist video!”",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dollar Store Obama even tries to talk like him too.",
                "author": "McFatty7"
            },
            {
                "raw_content": "He thinks the memes will stop? LMAO",
                "author": "DementiaJoseph"
            },
            {
                "raw_content": "I fail to see what's racist about it",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shut it down!",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump didn't order it.... Dems ordered the shut down over handing out OUR cash to the medical industry for illegal aliens.",
                "author": "24601"
            },
            {
                "raw_content": "And so it begins.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Welcome to Red October 🩸",
                "author": "OhioRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "00:00:00",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to Red October 🩸",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Lol now the website shows that democrats have shut down the government for 10ms (and counting). This is great! xD",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "The sky didn't fall. Neat",
                "author": "realPhantomFuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Let Watch the White House Shutdown Countdown Timer",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ooooo this is good, I was going to make hourly posts with the countdown, but this is good. Fuck what a great idea, got to love Trump and his team. This is most high level trolling going on here.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "u/-f-b-i- can we get a sticky plz?",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "I can't look at this without hearing the \"beep beep beep\" from '24'.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[GN] Exploding AMD CPUs | Investigating ASRock's Murderboards",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I could not figure out if all ASRock Motherboards are affected or only certain ones?",
                "author": "Radiator3761"
            },
            {
                "raw_content": "I was always surprised the media didn't spend more time discussing some of the crazy launch era voltage defaults all the vendors were using. Granted with Gigabyte frying chips and ASUS frying chips plus their own motherboards honorably committing seppuku for the chipacide afterwards, there was a lot going on. I built a system a month after AM5 launched with a 7700X and ASRock B650E Riptide Wifi motherboard. Out of the gate VSOC defaulted to 1.25v but was reported at 1.288v by ZenTimings 1.29. VDD Misc was 1.3v, and CLDO was 1.10. Currently VDD Misc defaults to 1.1v, CLDO defaults to 0.95v even when setting 6000 1:1, and now VSOC shows as red if set above even 1.23v. VSOC also now actually delivers the voltage it's set to without running above it, so either ZenTimings changed how it measures or ASRock changed its LLC setting for the VSOC rail. Will have to finish the video later but I do wonder if Steve is factoring in the ever-mercurial voltage defaults all the vendors were using. I know ASRock personally changed and tweaked every single voltage knob & paired LLC knob that existed and was constantly changing them for the first year, and still tweaking them by year two to try and lock down the memory headaches users were having. But some of those default voltages were still nuts even when the X3D chips first launched. So if users did update UEFI versions religiously I could easily see any initial damage caused before the UEFI was updated weakening the chip, thereby triggering a belated failure later despite now running on safer voltages.",
                "author": "Kougar"
            },
            {
                "raw_content": "Every board should follow manufacturers recommendations without exception. I'm wondering how this could even happen unless users purposely overclock a board?",
                "author": "jedrider"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Qualcomm Achieves Complete Victory Over Arm in Litigation Challenging Licensing Agreements\"",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still don't get what ARM was hoping to achieve here, the damage to the platform as a whole would've been far worse had they won. The lawsuit itself was damaging enough.",
                "author": "autumn-morning-2085"
            },
            {
                "raw_content": "I completely forgot about this. But, praise be, it's finally done: please no appeals, Arm. This is basically entirely about money: how much QC pays to Arm. There is nothing else beyond it. QC will continue paying *its* ALA fees. Arm still has to honor that. [Arm Ltd. v. Qualcomm Inc., 1:22-cv-01146 – CourtListener.com](https://www.courtlistener.com/docket/64938776/arm-ltd-v-qualcomm-inc/?filed_after=&filed_before=&entry_gte=&entry_lte=&order_by=desc) This has the Judgment with some good quotes. // Of course, Qualcomm notes *their* trial suing Arm is next year. That will be very interesting, if we can get some depositions & evidence files out that, too.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Had forgotten about this. Throwback to the time when this sub was fully convinced this was a slam dunk win for ARM.",
                "author": "basedIITian"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Huge Arc B580 News! Intel Fixes CPU Overhead Problem",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nice to see that Intel is actually putting resources into fixing cpu overhead",
                "author": "Flimsy_Swordfish_415"
            },
            {
                "raw_content": "Fixed/improved in some cases, on a game-by-game basis. Better than nothing, but far from actually *fixed* fixed. Steve says he'll be testing more games and resolutions shortly, but I'd also like to see direct comparisons between a pre-fix driver and the newest.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "While it's great to see improvements, those still seem to be on a case by case basis. The root cause is still there and if there are more powerful cards coming (big if), then the issue will shift up again. But hey maybe Nvidia can start prioritising the overhead issue as well while we're at it.",
                "author": "Pimpmuckl"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chip cooling startup Corintis raises $24 million, adds Intel CEO Lip-Bu Tan to board",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple M5 (9 Core) Geekbench Score",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting the see the iPads (at least the pro versions) getting a base ram bump to 12gigs. Seems like a much more appropriate minimum for a tablet than the current 8, although 16 would have been ideal for the pro lineup",
                "author": "TheYetiCaptain1993"
            },
            {
                "raw_content": "I have a feeling the 9 core was made for the iPad (as shown here) and probably Vision Pro 2 or vision (more basic model).",
                "author": "Bderken"
            },
            {
                "raw_content": "TL;DR: - L2 cache grew from 4MB to 6 MB - 12 GB memory on base model (instead of 8) | Geekbench 6 | M4 | M5 | Improvement | |-------------------|-------|-------|-------------| | Single-Core | 3748 | 4133 | 10.3% | | Multi-Core | 13324 | 15437 | 15.9% | | GPU (Metal) | 55702 | 74568 | 33.9% |",
                "author": "Balance-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Meta Is Said to Acquire Chips Startup Rivos to Push AI Effort",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I knew a bunch of people who went to Rivos Austin. I never understood how they got so much VC money but haven’t even released a single product for the past 4 years. Hopefully the employees are getting a big payout.",
                "author": "Positive-Bowler7747"
            },
            {
                "raw_content": "Here's the [archive](https://archive.is/oeStH) to the Bloomberg article.",
                "author": "Dakhil"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hyundai Mobis teams with Samsung, SK to push for Korean-made auto chips",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside NVIDIA GPUs: Anatomy of high performance matmul kernels",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awesome write up. Was a great read, thanks for sharing!",
                "author": "ExplodingFistz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Super Mario Galaxy 1 & 2 Nintendo Switch 2 Review - Are They Worth It?",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just want to play Gusty Garden Galaxy. Looping around planets with a single long jump, to that music, is an all time greatest Nintendo moment IMO",
                "author": "v4m"
            },
            {
                "raw_content": "Was Luigi available in MG1? I thought only for MG2?",
                "author": "nomad1128"
            },
            {
                "raw_content": "I mean, it is a compilation of 2 of the best games of all time.",
                "author": "LinkCalvin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First Mario Galaxy Review : 9-10",
        "score": 431,
        "text_content": "[https://www.youtube.com/watch?v=ws0BZJ-l\\_eg](https://www.youtube.com/watch?v=ws0BZJ-l_eg) The review argues that **Super Mario Galaxy + Super Mario Galaxy 2** still represent the peak of 3D Mario-platforming, with bold, imaginative level design and notably stunning visual enhancements and texture upgrades on Switch and Switch 2 (including up to 4K in docked mode). However, it also points out minor drawbacks: gyro aiming feels less precise than the original Wii pointer, and occasional camera shifts can interfere with directional control",
        "comments": [
            {
                "raw_content": "I mean, yeah. It's quite literally one of the best platformers of all time, and many still consider it the best.",
                "author": "Melodic-Theme-6840"
            },
            {
                "raw_content": "Nice I'm looking forward to playing Mario Galaxy 2 with a pro controller once I clear out my current backlog. So sometime in 2027.",
                "author": "ChainChompBigMoney"
            },
            {
                "raw_content": "Regardless of the price, it is still some of the best games of all time.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Magazine, available for free on Nintendo stores.",
        "score": 307,
        "text_content": "I recently ordered few items from Nintendo store UK and they included a really nice magazine featuring so many switch games, accessories, related topics. It reminded me a lot of Nintendo power. I wish it’s something they have a subscription to.",
        "comments": [
            {
                "raw_content": "I've mentioned this back in early August and no one else seemed to be getting it. Did I get mine early or what? Others ordered after I mentioned it but got nothing.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "I looked all over the store and could not find the magazine",
                "author": "SlowHornet29"
            },
            {
                "raw_content": "If you're looking for a nintendo power like magazine, nintendo force is a good option: https://www.patreon.com/NintendoForce I got my first copy last week. It has some good content. I'd recommend giving it a try",
                "author": "smitherenesar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Games Releasing October 2025",
        "score": 107,
        "text_content": "A list of all the games releasing on October 2025! Which one are you most excited for? (The Red in the console section means it's coming to Nintendo) If you see a title you're Interested check out the spreadsheet! There should be a link to a trailer. Link: inhttps://docs.google.com/spreadsheets/d/1EbGHsJjxt4VrpD8_0jPZn2JMB7WNz945S1hFgfXWddg/edit?usp=drivesdk",
        "comments": [
            {
                "raw_content": "Paw patrol rescue wheels is my most anticipated game in a decade.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "Just Legends ZA for me. Also Mega Dimension isn't out 16th October, it's only 2 cosmetic outfits, the actual dlc/ expansion isn't out until February",
                "author": "Ell7494"
            },
            {
                "raw_content": "![gif](giphy|ZNMa7ocjGc0PTlHrP4|downsized)",
                "author": "jtlthe2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Does Hades2 have 4K mode on docked?",
        "score": 37,
        "text_content": "I've seen many videos saying that you can play Hades2 on 4K while docked. But Eshop only shows 1080p 120fps on description and I can't even find the graphics option related to resolution on the in-game settings. One video said that you can enable 4K on Hades2 by turning off 120hz mode and setting the output resolution to 4K on console menu. I've tried this, but it still looked like 1080p. Is this all fake information? I'm super confused.",
        "comments": [
            {
                "raw_content": "https://www.theverge.com/news/785360/hades-ii-players-on-switch-2-in-tv-mode-can-have-upscaled-4k-or-120fps-but-not-both This link shows the answer. Hades has upscaled 4k, as poster above says. :) But in 4k, it won't be 120fps. It is 60fps then.",
                "author": "quantumz00m"
            },
            {
                "raw_content": "Is the full hades out now? Like, no early access? I have it on the pc but on the switch would be much nicer",
                "author": "Frozthax"
            },
            {
                "raw_content": "https://preview.redd.it/92onxih7ddsf1.jpeg?width=4032&format=pjpg&auto=webp&s=c4262822159001da4cf78c49678e8e69a4948c88 My LG is showing 1440p at 120Hz. Personally, I don’t think it looks very good on the 4K screen 😞",
                "author": "IKEAboy_2006"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Nintendo Store in Europe will offer a Kirby themed reusable cup as a bonus item for Kirby Air Riders orders, Kirby plushies bundles also available (£12/€14)",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The plushies are cute, but they throw in any old tat with a design printed on it now. I miss the days of steelbooks and figurines.",
                "author": "papes_"
            },
            {
                "raw_content": "They will offer Chinese plastic with my new gaem!!",
                "author": "dotstream_anom"
            },
            {
                "raw_content": "£12 for an official plushie and a decent enough cup is pretty good. Not as good as the Prime 4 bundle adding a Samus deskmat and holographic stickers for only £6 though, so everybody should preorder that too!",
                "author": "Gavintendo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Controller similar to SW2 Pro Controller?",
        "score": 3,
        "text_content": "Quick question for you all: is there any third party controllers out there with a similar build quality/stick feel as the SW2 pro controller? Ideally one that can work with Switch, PS5 and PC. The switch 2 pro controller has made switching to other controllers really difficult so I’m hoping to find a third party controller of similar quality that works across platforms. Any recommendations would be appreciated!",
        "comments": [
            {
                "raw_content": "I know it wasn't part of your original question, but fyi HD rumble technology is exclusive to the switch 2 pro controller so you will lose out on that by using a 3rd party controller. In terms of good alternatives, others may have better suggestions as I havent tried myself.",
                "author": "PopplioArmy"
            },
            {
                "raw_content": "The 8bitdo ultimate (2) is a good alternative, but I don't know if you have HD rumble on it, but you can use that controller for many consoles and of course for PC.",
                "author": "No_Plankton7982"
            },
            {
                "raw_content": "Anyone has tried the 8bitdo Pro 3? I’m thinking to buy it or the Ultimate 2…",
                "author": "PhobusPT"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Extas1s] I have been told that big news regarding Gamepass will be announced on October 1st",
        "score": 241,
        "text_content": "[Source](https://xcancel.com/eXtas1stv/status/1973187075253096748?t=9uLkTKCofnQ3Jb8OXL9t9g&s=19)",
        "comments": [
            {
                "raw_content": "#eXtas1s is a Tier 4 - Generally Unreliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Price is going up folks.",
                "author": "Routine-Attention363"
            },
            {
                "raw_content": "big news you say... but is it good news or bad news",
                "author": "Creepy-Emu8779"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: “Bloomberg report that the $20 billion debt in the EA deal is expected to be rated single-B — meaning it is considered a \"junk\" loan, or one that is high-risk and speculative, typically offering high interest rates. Which the new EA will have to pay”",
        "score": 618,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3m23a2o4avs2f",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Basically, if I'm understanding it right, EA is going to be under even more financial pressure than they already have been. If you thought their monetary practices were toxic in the past, I'd strap in for what's to come...",
                "author": "connorg095"
            },
            {
                "raw_content": "leveraged buyouts: the more you learn about them, the more it becomes clear the only reason they aren't illegal is because criminals get to write the laws",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "2.5 hours of Ghost of Yotei uncut gameplay leaked",
        "score": 95,
        "text_content": "- Since early copies are in the wild, this is not surprising Video: https://m.youtube.com/watch?v=B5A8VVjJ0HE",
        "comments": [
            {
                "raw_content": "It’s gonna be interesting to see what it’s like when GTA 6 releases and early copies come out before the release",
                "author": "PresentationDull7707"
            },
            {
                "raw_content": "yup, looks like Ghost of Yotei",
                "author": "Cyber_Swag"
            },
            {
                "raw_content": "Is this surprising? The game comes out in 2 days and a lot people have posting that they got the game already.",
                "author": "Shadowcreeper15"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "BioWare Staff Worried About Studio’s Future - Insider Gaming",
        "score": 630,
        "text_content": "\"Multiple sources within the company have spoken under the condition of anonymity about their feelings over the last 24 hours. Of those who spoke, most believe that BioWare will be one of the first studios to see more cuts when the new group takes over. “Look at the negativity that came after Dragon Age,” said one source. “If we felt it was only going to get worse then, you can imagine what some of us think now.” source: [https://insider-gaming.com/bioware-staff-worried-about-studios-future](https://insider-gaming.com/bioware-staff-worried-about-studios-future)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Honestly, I’m surprised the studio hasn’t been closed/disbanded already.",
                "author": "Stunning-Stuff-2645"
            },
            {
                "raw_content": ">Regarding where things stand with Mass Effect, they all are working under the assumption that the game is going to come out. At the beginning of the year, only a small team was actively working on it, but more resources had recently started to be put into the game. >“We’re going to keep working until they tell us were done,” Insider Gaming was told. “It’s not the healthiest way to live, but as long as the paychecks keep coming, we’re not going to just walk away.” I mean, that's the right attitude. If what they are doing with the new Mass Effect is impressive EA's new owners have no reasons to go after them. If what they are showing is looking like Veilguard in space then things will be different.",
                "author": "scytheavatar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prototype remaster might just be in the works",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd prefer a Remake or whole new game but getting anything is nice.",
                "author": "XxRedAlpha101xX"
            },
            {
                "raw_content": "Why there's Steam's fps counter?",
                "author": "Martinez_Majkut"
            },
            {
                "raw_content": "A prototype 1 remake would go so fucking hard",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prototype 1 and 2 were listed on the Australian Classification Board back in 2024",
        "score": 242,
        "text_content": "[https://www.classification.gov.au/titles/prototyper](https://www.classification.gov.au/titles/prototyper) [https://www.classification.gov.au/titles/prototyper2](https://www.classification.gov.au/titles/prototyper2) I already posted this on the Prototype subreddit a couple of months ago, however considering the recent update to Prototype 1 has added a few new names in the credits that weren't in the original release such as Iron Galaxy Studios and Beenox, it makes me wonder if there might actually be remasters of Prototype 1 and 2 in the works.",
        "comments": [
            {
                "raw_content": "Maybe THATS why the Prototype games on steam have finally climbed from 75% off to 80%.",
                "author": "limelight022"
            },
            {
                "raw_content": "Hell yes if this means we get a Prototype 3 and a Prototype 4 in the future. I know a lot of people back in the days said Prototype 1 sucked and that Prototype 2 sucked even more. I love both Prototype video games and with mods on PC they are even better. A Prototype 3 video game with Unreal Engine 5's graphics, but not using Unreal Engine 5? Who am I kidding. They might use Unreal Engine 5. If they use Unreal Engine 5 it should be Unreal Engine 5.7. With CPU optimizations.",
                "author": "OrSupermarket"
            },
            {
                "raw_content": "There have also been new credits added with Ubisoft Connect and Iron Galaxy Studios being added to it with a new update adding them to the Steam version. Saw it on Twitter by Wario64.",
                "author": "arkhamtheknight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[dealabs] French retailer E.Leclerc will permanently lower the price of Nintendo Switch 2 bundles (Mario Kart World, Pokémon Legends Z-A) to €469 starting October 14th",
        "score": 321,
        "text_content": "Source: https://www.dealabs.com/bons-plans/des-le-1410-pack-console-nintendo-switch-2-legendes-pokemon-z-a-3148975 Price reductions in France are aggressive and made by retailers. They are not indicative of any price drop coming anywhere else in the world, before someone asks or starts speculating about USA/rest of Europe price drops. Switch 2 will be E.Leclerc's [loss leader](https://en.wikipedia.org/wiki/Loss_leader).",
        "comments": [
            {
                "raw_content": "But how will this affect Ferraris Championship Chances next Season?",
                "author": "leckmichnervnit"
            },
            {
                "raw_content": "Lecleeeeeeerccc, Lecleeeeeeerccc!!",
                "author": "Rampo360"
            },
            {
                "raw_content": "Interesting, the price for the bundle has come down in price here in Norway as well, about 80 usd from launch.",
                "author": "PM_ME_YOUR_COMMAS"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "World of Warcraft: Midnight Releases February 26, 2026",
        "score": 185,
        "text_content": "[Via Dealabs:](https://www.dealabs.com/magazine/world-of-warcraft-midnight-on-vosu-revele-la-date-de-sortie-et-le-contenu-de-ledition-collector-60600) >According to our information, the release date for World of Warcraft: Midnight will be Tuesday, February 26, 2026. Key for the Midnight Epic Edition game, which includes: * Early access to Midnight * 30 days of World of Warcraft game time * 2000 Deniers * Improved Vergelo to level 80 * Midnight-related art book * Midnight Pin Collector * Replica of the Heart of Darkness >According to our information, the price of the Collector's Edition will be €139.99 in Europe. Remember that the digital version of the Epic Edition is available for $89.99",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "is this the update that's gonna add housing finally? i just want to make houses really lol...",
                "author": "Queasy_Watch478"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Q4 2025 Tech Support Thread",
        "score": 7,
        "text_content": "Welcome to the r/Intel Q4 2025 PC build questions, purchase advice and technical support megathread — if you have questions about Intel hardware, need help with a purchasing decision, have a PC build question or require technical support, **please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums listed below.** Please remember that r/Intel is not a technical support, purchase advice, or PC building help subreddit. r/Intel is community-run and does not represent Intel in any capacity unless specified. You may want to consider the official [Intel Community](https://community.intel.com/) or [contact Intel support directly](https://www.intel.com/content/www/us/en/support.html) The [Intel Community](https://discord.com/invite/intelsubreddit) and [Official Intel Insiders Community](https://discord.com/invite/qRkVx53) Discord servers are also available to ask questions, including PC build questions, purchase advice, and tech support questions with other Intel users and PC enthusiasts. **You may also want to consider the following subreddits, websites, and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response**. [PCPartPicker](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker, and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc Planning on building a computer but need some advice? This is the place to ask! It is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubts one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform that exists. The Personal Computer. [OBS (Open Broadcaster Software) Forums](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC, and help others! r/techsupport Stumped on a tech problem? Ask the community and try to help others with their problems as well. [ASRock Forum](https://forum.asrock.com/default.asp): Wanna discuss or find out something for your ASRock products? Come and join the ASRock worldwide forums to chat with ASRock global users! [ASUS Republic of Gamers (ROG) Forums](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear. [MSI Global English Forum](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help. r/buildapcforme A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high-end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops The hub for gaming laptop enthusiasts. Discover discussions, news, reviews, and advice on finding the perfect gaming laptop. r/SuggestALaptop A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. # READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes or hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, **please read and try the following before making a post** — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order. If a step has already been performed or is not relevant, please move to the next step. * If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet, and any switches on the wall outlet and/or power supply are in the ON position. It's also worth checking your front panel connectors to make sure they are connected properly and trying a different wall outlet. * If you have any power-related issues, like your system not starting, shutting down, sleeping, restarting, or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB, and 3.3V rails) can cause a myriad of issues that can be inconsistent and hard to diagnose. * Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard manual. * If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM, and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers/buttons you can use; please consult your motherboard or system manual on how to clear the CMOS. * If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. * Make sure your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which will allow you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual, as the BIOS flashback procedure will vary depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. * Make sure your Monitor/TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor/TV if you are using any HDMI or DisplayPort adapters, converters, or splitters. Remove these and use a direct connection, try switching between HDMI and DisplayPort, and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. * Make sure you are running the latest software updates for your operating system, games, and applications. * Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware, and other unwanted software can cause crashes, freezes, hangs, and other performance, security, stability, and compatibility issues. * Make sure you are running the latest [Intel drivers](https://www.intel.com/content/www/us/en/download-center/home.html). Some devices, such as laptops and handhelds, may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the device manufacturer's support page. * If you need to reinstall GPU drivers, we recommend using [Display Driver Uninstaller (DDU)](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers. A guide on how to use DDU can be found [here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit) * If you have installed GPU drivers after using DDU, you may experience stutter in some games while the shaders are cached again. * If Windows Update is replacing your GPU drivers (example of what that looks like [here](https://imgur.com/a/DLLMZ3L)), please [view the following](https://drive.proton.me/urls/QHH65SVJ9M#Q25EPyELVdrT) on the steps you can take to prevent this from happening. * If you are on Windows 10 or Windows 11 and experience flickering, stuttering, or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this [thread](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling_multiplane_overlay_mpo_fixed_all/). * If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through [Steam](https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB), [Epic Games Store](https://www.epicgames.com/help/en-US/c-Category_EpicGamesStore/c-EpicGamesStore_LauncherSupport/how-do-i-verify-game-files-in-the-epic-games-launcher-a000084923#:~:text=Find%20the%20game%20in%20your,Click%20the%20Verify%20button), [Ubisoft Connect](https://www.ubisoft.com/en-us/help/connectivity-and-performance/article/verifying-game-files-in-ubisoft-connect-pc/000060529), [EA App](https://answers.ea.com/t5/EA-Services-General-Questions/How-to-verify-game-files-of-installed-games/m-p/6578960), [GOG Galaxy](https://support.gog.com/hc/en-us/articles/360003930017-My-game-data-is-corrupt-How-can-I-repair-my-game), [Battle.net](https://battle.net/support/article/7655) or whichever game client you are using. * If a program is crashing, freezing, not starting, performing poorly, or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. * If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values. This can be checked under Control Panel > System and Security > Power Options. * Make sure you are using the latest BIOS, Firmware, and Drivers for your motherboard, laptop, desktop, and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features, and improve compatibility and interoperability. * If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: **revert everything to stock clocks, timings, voltages and settings**, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner, you may also have to restore default settings in those utilities. * If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them. A guide is available here * If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the *below PSU calculators* and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. * PSU Calculators: [FSP](https://www.fsplifestyle.com/landing/calculator.html) — [OuterVision](https://outervision.com/power-supply-calculator) — [Cooler Master](https://www.coolermaster.com/power-supply-calculator/) — [Seasonic](https://seasonic.com/wattage-calculator) — [Newegg](https://www.newegg.com/tools/power-supply-calculator/) — [be quiet!](https://www.bequiet.com/en/psucalculator) — [MSI](https://www.msi.com/power-supply-calculator) — You can also add all your components into [PCPartPicker](https://pcpartpicker.com/list/) and it will provide an estimate of wattage. * Try to apply common sense to an issue, for example, if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, the DIMM slot on the motherboard, or the pins? Have you tried reseating it, etc... * If you experience crashes, freezes, unexpected shutdowns, or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that **just because your system turns on, doesn't make it stable** and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. [OCCT](https://www.ocbase.com/occt/personal) — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, and Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing to varying GPU loads, and much more. [Prime95](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress/torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. [AIDA64 Extreme](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. [Furmark 2](https://geeks3d.com/furmark/downloads/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. [MSI Kombustor](https://geeks3d.com/furmark/kombustor/downloads/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting-edge 3D APIs such as OpenGL or Vulkan. [MemTest86](https://www.memtest86.com/download.htm) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have, as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. [MemTest86+](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium-class or later 32-bit or 64-bit x86 CPU. [SeaTools](https://www.seagate.com/support/downloads/) — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. For more advanced SSD and HDD diagnostic utilities, please check the website of your SSD or HDD manufacturer, as they usually offer manufacturer-specific software to check the health of he drive, test the drive and update firmware, some examples include [Samsung Magician](https://semiconductor.samsung.com/consumer-storage/magician/), [Western Digital Dashboard](https://support-en.wd.com/app/answers/detailweb/a_id/31759/~/download%2C-install%2C-test-drive-and-update-firmware-using-western-digital) and the [Crucial Storage Executive](https://www.crucial.com/support/storage-executive). Some motherboards, laptops, and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors, or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly, or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves, etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please **backup any important files/data** and perform a reinstall/clean install of Windows, using a USB or DVD. **Only use Windows ISO images that come directly from Microsoft.** The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft [Software Download](https://www.microsoft.com/software-download/) page, and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs that modify Windows or to use 3rd party, custom, or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware, and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the template below for submitting a request. The more detail you can include, the better. **If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.** *Below is an example template you could use...* **Summary of the issue**: Playing Warhammer 40,000: Space Marine 2 results in unexpected system crashes with no error messages, forcing me to manually restart the computer using the power button. **What I have tried to resolve the issue**: Performed comprehensive troubleshooting, including DDU-based reinstallation of driver 32.0.101.6989, BIOS update, extended hardware stress testing (10+ hours), Steam integrity verification, and system log analysis. Event Viewer indicates Intel.GraphicsSoftware.App errors correlating with crash events.\" **System specifications:** * Operating System: Windows 11 23H2, OS Build 22631.5909 (to find OS build version, press the Windows Key + R and type *winver*) * CPU: Intel(R) Core(TM) Ultra 5 245K, stock settings with no overclock. * GPU: Intel(R) Arc(TM) B580 Graphics, stock settings with no overclock * Motherboard: PRIME Z890M-PLUS WIFI with 2005 BIOS * RAM: VENGEANCE® RGB 32GB (2x16GB) DDR5 DRAM 7000MT/s CL36 * Storage: Samsung SSD 990 PRO 2TB * PSU: Corsair Enthusiast Series™ TX750 — 80 PLUS® Certified Power Supply * Display: MSI 27\" MAG 271QPX QD-OLED E2 240Hz OLED with Certified Ultra High Speed HDMI Cable If you are using a prebuilt PC or don't know your full specifications, please include the make and model of your system and as much information as you can, e.g, Dell XPS 13 Laptop (Intel Core Ultra 7 Processor 258V, Intel Arc Graphics 140V, 32GB LPDDR5X RAM, 1TB NVMe M.2 SSD with the latest 1.2.0 BIOS. Please include any logs, dump files, videos, screenshots, and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling, and component installation.",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Huge Arc B580 News! Intel Fixes CPU Overhead Problem",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except it doesn’t (only for one game). Did he watch his own video before narrating it lol",
                "author": "BasedOnAir"
            },
            {
                "raw_content": "They've tested it with just three AMD cpus. Weird pairings. I would pair B580 with any i5 from last couple years. Seriously their testing is getting less and less \"real life\" and more for the purpose of a good clickbait.",
                "author": "Which-Insurance-8248"
            },
            {
                "raw_content": "the B580 is a modern gpu, it should be paired with a modern cpu, preferably an Intel one, going with old school Ryzen cpus is a bad path to take.",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel confirms Panther Lake news at Tech Tour 2025",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Am I the only one who mostly cares whether the power management and sleep/standby works properly on this generation more than anything else? I've almost had it with x64 laptops in this regard.",
                "author": "doomwomble"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Americans Are Getting Priced Out of Homeownership at Record Rates",
        "score": 327,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.longtermtrends.net/home-price-median-annual-income-ratio/ This chart is all you need to know to fight back against morons who like to claim \"it's always been hard\".",
                "author": "RamCockUpMyAss"
            },
            {
                "raw_content": "I’m approaching 40, I am the first one in my family unable to afford a home. College and teaching at college was a mistake.",
                "author": "zerosumratio"
            },
            {
                "raw_content": "Renter nation!!!!",
                "author": "Dangerous-Tomato-652"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FTC Sues Zillow and Redfin Over Illegal Agreement to Suppress Rental Advertising Competition",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Today, the Federal Trade Commission sued Zillow and Redfin over an unlawful agreement that eliminates Redfin as a competitor in the market for placing advertising of rental housing on internet listing services (ILSs)—the websites that millions of Americans use to find their next rental home. Zillow Group, Inc., and Zillow, Inc., (Zillow) and Redfin Corporation operate two of the nation’s largest rental ILS networks by traffic and revenue, including sites such as Zillow Rentals, Rent.com, and ApartmentGuide.com. The complaint alleges that in February 2025, Zillow and Redfin entered into an illegal agreement to dismantle Redfin as a competitor in the ILS advertising market for multifamily rental properties. In exchange for a $100 million payment and other compensation from Zillow, the complaint alleges, Redfin agreed: * To end its contracts with advertising customers and help Zillow take over that business, * To stop competing in the advertising market for multifamily properties for up to nine years, and * To serve merely as an exclusive syndicator of Zillow listings, making Redfin sites effectively a copy of the listings that appear on Zillow’s sites. Zillow and Redfin framed their agreement as a “partnership,” but in reality the arrangement is an end run around competition that insulates Zillow from competing head-to-head on the merits with Redfin, the complaint states. In connection with the agreement, Redfin fired hundreds of employees, then helped Zillow to hire its pick of those terminated workers. “Paying off a competitor to stop competing against you is a violation of federal antitrust laws,” said Daniel Guarnera, Director of the FTC’s Bureau of Competition. “Zillow paid millions of dollars to eliminate Redfin as an independent competitor in an already concentrated advertising market—one that’s critical for renters, property managers, and the health of the overall U.S. housing market. The FTC will do our part to ensure that Americans who are looking for safe, affordable rentals receive all the benefits of robust competition between internet listing services like Zillow and Redfin.” The FTC alleges that this agreement destroys competition for multifamily rental properties advertising on ILSs, harming both property managers seeking to advertise properties for rent and renters searching for a home. The agreement also constitutes an unlawful acquisition in violation of Section 7 of the Clayton Act, the complaint alleges. The FTC alleges that the unlawful agreement will: Likely lead to higher prices and worse terms for multifamily unit advertising; and Reduce incentives for Zillow and Redfin to compete for renters, including through investment in attracting visitors and innovation to improve user experience when searching on an ILS for a rental property. The complaint seeks to stop Zillow and Redfin from continuing their unlawful agreement and contemplates a potential divestiture of assets or the reconstruction of businesses to restore competition.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rise of ‘Accidental Landlords’ (Bagholders) Is Bad News for Investors Who Bet Big on Rentals",
        "score": 244,
        "text_content": "**Accidental Landlords Are Disrupting the Rental Market** * Homeowners unable to sell their properties are increasingly renting them out, creating a surge in “accidental landlords.” * This trend is flooding the rental market with supply, especially in Sunbelt cities like Dallas, Tampa, and Phoenix. **Pressure on Institutional Investors** * Big rental firms like Invitation Homes and American Homes 4 Rent are facing falling rents for new leases in oversupplied areas. * Rent growth in top 20 U.S. markets is projected to be just 0.8% in 2025, the slowest pace since 2011. **Housing Market Spillover** * Of the 3.06 million homes listed this summer, only 28% sold—many unsold homes are now being converted to rentals. * This “leakage” from the for-sale market is depressing rental prices and creating a shadow inventory. **Investor Strategies and Risks** * Landlords are raising rents for existing tenants to offset losses from new leases, but this could lead to higher turnover. * Stocks of single-family landlords are underperforming compared to apartment landlords and homebuilders. **Regional Disparities** * While Sunbelt cities are struggling, Midwest and West Coast markets are still seeing healthy rent growth. * The mismatch between in-place rents and new lease rates is growing, threatening long-term profitability.",
        "comments": [
            {
                "raw_content": "Game the market, shoot the price of housing to unseen levels and be left holding the bill. Of course these institutions will be given socially funded get out of jail free cards when the bill comes.",
                "author": "tehn00bi"
            },
            {
                "raw_content": "\"Landlords are raising rents for existing tenants to offset losses from new leases, but this could lead to higher turnover.\" Good reminder that you have leverage when your landlord tries to raise your rent.",
                "author": "Ecstatic_Tiger_2534"
            },
            {
                "raw_content": "\"Just rent it out bro\"",
                "author": "almighty_gourd"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why renters are increasingly outnumbering homeowners in the suburbs of major cities",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't even need to read the article to know that it's better to rent for 3k than pay 6k for a mortgage",
                "author": "coldshowerss"
            },
            {
                "raw_content": "bc boomers own multiple homes and refuse to sell",
                "author": "NoviceAxeMan"
            },
            {
                "raw_content": "I priced out 1200 square foot townhouse in Massachusetts. 670k with 125k down is like 4600 month. It’s expensive. Rent is expense. It’s hard as hell to save any money. For the record don’t have 125k to put down.",
                "author": "SectorAdditional9110"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seminole Tribe sues Lennar over 552 ‘defective’ new houses across Florida",
        "score": 115,
        "text_content": "The Seminole Tribe alleges that every one of the 552 houses Lennar built on tribal land over the past five years is unsafe, citing roofs needing replacement, air quality issues, and widespread mold. Mediation talks collapsed, with the Tribe accusing Lennar of deception and concealment; the builder insists the dispute must go to arbitration under warranty contracts. Lennar says it has a repair plan ready, but tribal attorneys argue members have been “constructively evicted” due to unlivable conditions. The case is now before a Broward judge, while Lennar faces similar quality lawsuits elsewhere in Florida.",
        "comments": [
            {
                "raw_content": "What happens when the contracts state you must go to arbitration and not a judge?",
                "author": "Apprehensive-Mall773"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Survey: 1 in 6 Aspiring Homeowners Have Given Up | Bankrate",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m that 1 of 6. Now, this isn’t a “woe is me” post. I could buy. Right now. I’d need a mortgage, and therein lies the problem. A mortgage requires a significant commitment of my future earnings. A guarantee of repayment. Meanwhile, I have no such guarantee of income to service the mortgage. It’s not a new development. What is new to this game of risk is the outsized value of “r” (risk).",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "How can an aspiring homeowner have given up? Aren’t they no longer aspiring homeowners at that point?",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.7% year-over-year in July",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Line go up",
                "author": "so_now_you_know"
            },
            {
                "raw_content": "S&P Cotality Case-Shiller Index Records Annual Gain in July 2025 • The U.S. National Index, the 20-City Composite, and the 10-City Composite continue to display growth with 1.7%, 1.8%, and 2.3%, respectively. • Housing wealth slipped again in real terms, with July’s 1.7% national gain lagging the 2.7% rise in consumer prices. • 15 of 20 major metros fell month-to-month in July, underscoring broad cooling even during peak buying season. https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20250930-1479941/1479941_cshomeprice-release-0930.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Well, Case and Schiller can go fuck themselves then.",
                "author": "fugglenuts"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sora 2 realism",
        "score": 3860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So uncanny. My brain knows it's not real but I have to ignore my eyes telling me it's real. Will have to test it out. Btw look at the muscles on the horse as they walk, insane stuff.",
                "author": "Funkahontas"
            },
            {
                "raw_content": "I have attempted skateboarding prompts in so many models. This is better that most single image models one-shot a skateboarding prompt. Wild.",
                "author": "torb"
            },
            {
                "raw_content": "What the fuck",
                "author": "Rubrumaurin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: Sora 2",
        "score": 1478,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/xg8qmg5necsf1.jpeg?width=1066&format=pjpg&auto=webp&s=bc4e44e414d399ba49575f66b630ac19936c9401",
                "author": "OrdinaryLavishness11"
            },
            {
                "raw_content": "Cameo here is a WAY bigger deal than it might appear at first glance. Character consistency is a problem for longer generations. This sounds like Cameo can be used to keep characters consistent across multiple generations.",
                "author": "SorryApplication9812"
            },
            {
                "raw_content": "App only for ios.",
                "author": "Kanute3333"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The upgrade is phenomenal",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The doomers in their chambers aren’t ready for what’s coming in a year.",
                "author": "Busy-Awareness420"
            },
            {
                "raw_content": "Can’t even imagine 2 more papers down the line…",
                "author": "AllEndsAreAnds"
            },
            {
                "raw_content": "NGL I’m gonna miss all those bad AI Videos. Like the spaghetti eating will smith. I wonder if in the future we intentionally can tell it to make it surreal or „intentionally bad“.",
                "author": "KrydanX"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Surfing on a subway",
        "score": 747,
        "text_content": "Sora 2",
        "comments": [
            {
                "raw_content": "I wonder how many young or naive people will see AI videos like this and over time lose grasp of real physics and start thinking they'll be fine if their body gets hit like the guy in the video.",
                "author": "orderinthefort"
            },
            {
                "raw_content": "I fear the day this audio gets good enough to fool me that it's real",
                "author": "Snoo-82132"
            },
            {
                "raw_content": "Cameraman taking it like a champ too",
                "author": "Medium_Chemist_4032"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 2 creates anime",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't this literally just blue exorcist",
                "author": "RedditgoldEnthusiast"
            },
            {
                "raw_content": "I'm looking forward to adapting manga or light novels that will never get an anime adaptation or a second season lol",
                "author": "junior600"
            },
            {
                "raw_content": "That Will Smith spaghetti horror was two years ago lol... I can't wrap my head around it",
                "author": "Bright-Search2835"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora2. Im amazed",
        "score": 287,
        "text_content": "Ama",
        "comments": [
            {
                "raw_content": "https://i.redd.it/v4aqw73lidsf1.gif",
                "author": "chlebseby"
            },
            {
                "raw_content": "I love Teenage Mutant Ninja Turntes",
                "author": "y53rw"
            },
            {
                "raw_content": "We're officially cooked",
                "author": "Odyssey1337"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Either they have access to many games and record human playing for hundred of hours, or it's likely from Youtube... Hopefully they have licenses to do either way?",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are plenty of videos on YouTube of people playing video games without commentary or editing (which btw is not transformative content, so using those for training is pretty fair). Very likely they used those",
                "author": "Zodiatron"
            },
            {
                "raw_content": "My conspiracy theory is they trained it on video games to help with object permanence.",
                "author": "Good_Marketing4217"
            },
            {
                "raw_content": "Who cares? The mere fact that it's that damn good with context and memory shows we are nowhere close to any so-called walls. Anyone within the next 5 years will be capable of creating any content they like, and unless you find some way to literally police thought itself it won't be stopped. Copywrite laws needed a fundamental reworking a long time ago.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora 2 does retro style commercials",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hno0qgj2uesf1.png?width=390&format=png&auto=webp&s=ce69ce6d7b01a5259a0efcecc6377c8210c47a79 Nintendo lawyers, gearing up to do what they do best",
                "author": "PwanaZana"
            },
            {
                "raw_content": "I am so going to believe this crap when dementia kicks in... ugh.",
                "author": "Procrasturbating"
            },
            {
                "raw_content": "someone try analog horror!!!",
                "author": "Funkahontas"
            }
        ],
        "subreddit": "singularity"
    }
]