[
    {
        "post_name": "Antifa militants are making masked protesters show them their identities to check for undercover reporters and cops outside the ICE facility in Portland. The group pointed out the girl in the green shirt and accused her of being undercover.",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Please show me your ID to join the protest against voter ID”",
                "author": "GreyKnight"
            },
            {
                "raw_content": "Where's that meme of 3 Spidermans all pointing at each other and saying the other is a Fed?",
                "author": "LolitaExpressPilot"
            },
            {
                "raw_content": "So the “against all authority” crowd is forcing people to provide state ID. Gotcha. They don’t irony much do they?",
                "author": "IBentMyWookie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING NEWS🚨 A Border Patrol agent was shot in the face near the George Washington Bridge, sending NYPD and emergency units rushing to the scene. The suspects are described as two Hispanic males who fled on a scooter.",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kill them",
                "author": "UltraFrogMan"
            },
            {
                "raw_content": "Expect more of this. The left-tardians have been outright calling for this for months.",
                "author": "RoninIV"
            },
            {
                "raw_content": "Why don’t ICE agents shoot at these fools? I’ve seen countless videos of cops shooting ppl for charging at them and yet ICE does nothing. But hey, at least they have paintballs! LMAO They wear masks like big bad boys yet don’t even use the tools at their disposal to ELIMINATE enemy invaders. What a joke.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portland, OR- ANTIFA attack a man wearing a 47 Trump hat outside of the Portland ICE facility. The protesters who have been taunting ICE agents all night are starting to get more aggressive as the night progresses",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd rather be judged by 12 than carried by 6. Fuck these Commies. Glad I live in a DEEP red area of a red state. These faggots would get their heads blown off.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Kill them",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Time to classify Antifa/Transtifa/Woktifa as a terrorist group and ideology.",
                "author": "Okannah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE arrests illegal immigrant accused of decapitating Illinois woman after judge set him free",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should charge the judge as an accessory.",
                "author": "CLF3"
            },
            {
                "raw_content": "Illegal invader but yeah",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Unreal",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Sets Internet Ablaze After He Floats Prosecuting “Obama and the Thugs” Involved Russia Collusion Hoax",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "PROSECUTE & EXECUTE THE PUNISHMENT",
                "author": "me-no-likely3"
            },
            {
                "raw_content": "I mean, I'm not sure why you WOULDN'T prosecute people who commit crimes. In fact, I've kinda been waiting years and years for that. Still waiting.",
                "author": "BigDaddyBigTrump"
            },
            {
                "raw_content": "FFS - Just fucking do it already! Most of us have been waiting since 2015.",
                "author": "redredwine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These “journalists” received Pulitzer Prizes for pushing Obama’s Russiagate lies.",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pulitzer, Nobel, Oscar, Emmy, Tony, Grammy et al all ruined and meaningless.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Tom Hamburger? Sounds cheesy",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Maggie Habberman & Jo Becker, Matt Apizzo and Mark Mazetti are WH correspondents for The New York Slimes, the rest work for The Washington Post.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember:Mike Rogers, who was head of the NSA under Obama, broke the chain of command and went behind Obama’s back by having a private meeting with GEOTUS at Trump Tower after the 2016 Election. The very next day after that meeting, President-Elect Trump moved his operations out of Trump Tower.",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How did I not know this? I was on r/thedonald at the time, once he won the primary I found that sub and missed this completely",
                "author": "BoltCarrierGroup"
            },
            {
                "raw_content": "what a true patriot.",
                "author": "SomecatsareMAGA"
            },
            {
                "raw_content": "&#65038; So exactly who placed all of those bugs in the Trump Tower? &#65038; And/or were they listening using an IR laser and reflecting it off of the windows? &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a Jan 5, 2017 Oval Office meeting, Obama discussed Hillary's dossier \"material\"--inclg the false claim Trump was filmed by Russian intel w/ prostitutes urinating on Moscow Ritz bed--w/ James Comey, Susan Rice + Biden along with something Obama described as \"the plan\"",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Killary was there to munch carpet.",
                "author": "Skogin"
            },
            {
                "raw_content": "Link https://x.com/paulsperry_/status/1946758781175529785",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "What a bunch of leftist Pee brains.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roger Stone is asking for the same treatment he got",
        "score": 1806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody's above the law.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's hard for me to believe how an administration can be so cowardly against a political party that has made it their mission to destroy you including fabricating evidence. This is the greatest crime committed against a president by another party. If nothing is done then I really need to wonder why I'm continuing to support these cowards. It's your final term. Round up and arrest these criminals. Make an example of them.",
                "author": "raptormissle"
            },
            {
                "raw_content": "Don't settle Roger - demand they be arrested EVEN HARDER!!",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When MAGA starts chanting \"lock him up\" and you aren't sure who they are talking about.",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lock him up u/MoreVanceMemes",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Barry looks fucked up lol. Tax payers cocaine fund I presume.",
                "author": "Jinrei"
            },
            {
                "raw_content": "I remember when lefties used to call Michael a beautiful woman",
                "author": "Albo22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Jasmine Crockett (D-TX) is obsessing over Epstein since she’s too dumb to realize Democrats were most of his clients. This is part of her panic as redistricting is happening in Texas meaning she’ll lose her House seat to Army veteran Sholdon Daniels.",
        "score": 849,
        "text_content": "",
        "comments": [
            {
                "raw_content": "N",
                "author": "FlushFive"
            },
            {
                "raw_content": "She’s a definite sub par 100 iq thing.",
                "author": "john9985"
            },
            {
                "raw_content": "I actually think that she's not on the list, and she wants to cut the throats of some legacy politicians.",
                "author": "LindaSarsourCunt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Director of National Intelligence Tulsi Gabbard Releases Background Information of President Obama Involvement in Trump-Russia Targeting Op",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, maybe you stupid leftist shouldn't have thrown her out of the party, huh?",
                "author": "RealWomenLoveTrump"
            },
            {
                "raw_content": "At least she's actually DOING SOMETHING!",
                "author": "skuts"
            },
            {
                "raw_content": "Pages 57 and 64 of the 114 page PDF are my favorites.",
                "author": "Helicopter_Rides"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mosques are being built in America as fast as churches are. Nearly all of the mosques built are of the Saudi jihadist variety.",
        "score": 460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam is incompatible with the West.",
                "author": "HumblePepe"
            },
            {
                "raw_content": "They are not merely places of worship, but outposts and military camps. Once you understand this, the rest is easy.",
                "author": "knnbccb"
            },
            {
                "raw_content": "They will all have to come down at some point.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Correct",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This Guy Fawkes. 🍩🍆",
                "author": "MythArcana"
            },
            {
                "raw_content": "Remember, remember the 5th of November (2024).",
                "author": "BestTimeToBAlive"
            },
            {
                "raw_content": "Patriotism 101",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Hopefully the very talented John Thune, fresh off our many victories over the past two weeks and, indeed, 6 months, will cancel August recess (and long weekends!), in order to get my incredible nominees confirmed. We need them badly!!! DJT",
        "score": 1068,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Very talented\" is quite a stretch.",
                "author": "sully"
            },
            {
                "raw_content": "DO IT THUNE DO IT RIGHT NOW",
                "author": "HappyNewYear2025"
            },
            {
                "raw_content": "I miss recess",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Buh bye!",
        "score": 854,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2020 revealed who the real nazis were, and the fact that nobody has been hanged for their crimes is an absolute disgrace.",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "Hospitals when they charge patients $1000 for giving them a Tylenol.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "What a soulless shill he is",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "if No one is above the Law had a face",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The face of a faggot. Reminds me of his limp-wristed baseball pitch back in '09 or 2010.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Totally not gay at all.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "lock him up",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Sues Trump Administration Over Termination Of High-Speed Rail Funding. The state alleges $4 billion in federal grants were cut for political reasons as the project enters the track-laying phase.",
        "score": 350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Discovery on where the 100+ Billion went is going to be wild.",
                "author": "raptormissle"
            },
            {
                "raw_content": "Why did it take over a decade to start laying tracks?",
                "author": "OrangeCatBad"
            },
            {
                "raw_content": "15 years, BILLIONS behind schedule… political reasonings. 🤯",
                "author": "MAGABOND"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: Tulsi Gabbard has exposed the startling depths of a seditious coup against the Republic. The forces behind this coup have done and will do anything to protect their grasp on illegal & illegitimate power. Do not underestimate their capabilities or depravities. But WE are stronger.",
        "score": 1522,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boy, sure wish we could start arresting these people!",
                "author": "Filo76"
            },
            {
                "raw_content": "IMO, the whole reason ppl (myself included) are outraged with the epstein stuff is 2 fold. a. they were raping kids and that is simply the worst. b. the elites are above the law and the deep state needs to come crumbling down. If anything actually comes of this Obama thing, it achieves b. SO it is worth pursuing imo. -Arrest corrupt elite pedos -Deport all foreigners We do those 2 things, we win.",
                "author": "chodebabies"
            },
            {
                "raw_content": "In other words, get ready for a false flag incident.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SOON.",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I doubt we will see arrests, but all of the EVIL can become public. Obama is still young, and he will live with the worst legacy of any president.",
                "author": "CyanScales"
            },
            {
                "raw_content": "Can we finally replace that retarded official portrait of him in front of a bunch of weeds with his mugshot?",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "If this piece of shit was to be arrested and convicted it would be by far the single best thing the government has done in my lifetime. Unfortunately though I know that will never happen, though I will happily admit I was wrong.",
                "author": "Lowersidecustoms"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNX Software: \"Rockchip unveils RK3668 10-core Arm Cortex-A730/Cortex-A530 SoC with 16 TOPS NPU, RK182X LLM/VLM co-processor\"",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Specs for anybody not wanting to click through: RK3668: - 4x A730 + 6x A530 - 1.5 Tflops ARM Magni GPU - 8k video decode - 16 TOPs RKNN-P3 NPU - lpddr5, 5x, or 6 at 100GB/s - 5 or 6nm process node The RX3688 goes to 8+4 with the same cores, upgrades the GPU to over 2 Tflops, increases video decode to 16k, doubles the NPU, and doubles memory bandwidth. The RK182X is interesting to me. It's a RISCV CPU and supports a rather strange 2.5 or 5GB of DRAM. The memory type isn't specified beyond \"ultra-high bandwidth\" which makes me almost think it's GDDR or something weird. I also find it interesting that these CPU cores haven't been announced by ARM yet. I wonder if these are going to be renamed under the new naming system, or if they are the last of the old system. Either way, looking forward to performance figures. Also, support for lpddr6 suggests that memory standard is on its way now. Wouldn't be too surprised to see it in more next-gen hardware.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "GGUF support is nice, but I'd still be worried about lack of software support. The format gets features added quite a bit with newer models. A MoE model that fits on the RK182X, and keep the rest in RAM could be interesting though. edit; well maybe not cuz it says the interface is either PCIe 2.0, USB 3.0, Ethernet. So pretty slow to load a new model. > HuggingFace GGUF (GPT-Generated Unified Format) The llama.cpp erasure never stops.",
                "author": "ThatOnePerson"
            },
            {
                "raw_content": "I'm super excited for what Pine64 does with this.",
                "author": "ky56"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Best FSR 4 Upscaling Setting? - Quality vs Balanced vs Performance",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With DLSS 4 at 1440p, I've been using performance mode near universally, and the same would likely be true if I had FSR 4. Like sure I can spot small differences here or there, but oh man the performance uplift is HUGE so it's worth the trade off unless I'm already well above my monitors refresh rate. Great video either way, especially for those more sensitive to visual artifacts.",
                "author": "Framed-Photo"
            },
            {
                "raw_content": "Maybe Im getting old, but I struggled most of the video to tell the difference. FSR4 performance is probably as good or better fsr3 quality.",
                "author": "fatso486"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ming-Chi Kuo: Fine M-Tec: Leading Beneficiary of SDC’s Crease-Free Display Solution for Foldable iPhone",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Fine M-Tec is expected to begin shipping display metal plates for the foldable iPhone in 1Q26, with unit prices $30–35. Man its so impressive something so incredibly stupidly mechanically complicated is 35$ that's like nothing.",
                "author": "Jofzar_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DK bananza megathread ⚠️WARNING SPOILERS⚠️",
        "score": 25,
        "text_content": "Don't need to use spoiler tags in this megathread ONLY you still need them outside the megathread",
        "comments": [
            {
                "raw_content": "Oh, banana.",
                "author": "MrCooke13"
            },
            {
                "raw_content": "The amount of bananas I'm finding from just smashing through terrain...",
                "author": "NoHovercraft3224"
            },
            {
                "raw_content": "I spent about 5 hours completely destroying the Lagoon by throwing Bomb Rock. This is the best game ever.",
                "author": "HD_H2O"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Please tag DK bananza posts as spoilers",
        "score": 184,
        "text_content": "Please tag any posts as spoilers before posting if you see a DK post without spoiler tags report it for unmarked spoilers",
        "comments": [
            {
                "raw_content": "Also, stop putting spoilers in the titles. That's annoying as all hell.",
                "author": "OfficialNPC"
            },
            {
                "raw_content": "I feel like this should have been said sooner.",
                "author": "Williekins"
            },
            {
                "raw_content": "Can you pin a Megathread for this game? The Switch2 sub is flooded with DK posts right now.",
                "author": "Imaginary_Prior_2732"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo currently retaining 98% of its staff, plus other data",
        "score": 673,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All of these companies laying off employees at the first sign of trouble just giving away great talent to others in the market. Going to regret it in the long run. Happy to see some companies recognize the value of having workers who know the ins and outs of a business and are more efficient as a result.",
                "author": "Professional-Cry8310"
            },
            {
                "raw_content": "A positive thread about Nintendo's business practices? Well, my goodness... it is indeed commendable of them for making the company a place people want to stay at and refusing to do layoffs if not absolutely necessary. Hell, Iwata even gave the shareholders an appropriate and factual reason for not doing this in that \"it's terrible for employee morale.\"",
                "author": "tinyhorsesinmytea"
            },
            {
                "raw_content": "> According to the most recent employee data, Nintendo’s turnover rate at its headquarters in Japan comes in at only 1.9% in Japan (it’s not terribly different elsewhere such as 5.1% at Nintendo of America). In other words, the company isn’t seeing a ton of layoffs (or employees deciding to leave on their own). This is based on data between April 2024 and March 2025. > Another important point is Nintendo’s average employee tenure. This is the highest in Japan at around fourteen years, but even at Nintendo of America, it’s an average of ten years. Changing jobs isn’t uncommon, but employees seem to stay on for a lengthy period at the company.",
                "author": "shinohose"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All of us on Monday when someone asks, “So, how was your weekend?”",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Banana!",
                "author": "echoess84"
            },
            {
                "raw_content": "I know the meme this is based off of and I love it",
                "author": "Beginning_Book_2382"
            },
            {
                "raw_content": "I gave 2 concerts, wo I wasn't able to finish it yet. But I intend to sink the entire today into it 🙃",
                "author": "HeWe015"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo has fixed over 20 games with Switch 2 backwards compatibility issues",
        "score": 774,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since no one else wants to post the list: •Chronicles of the Wolf •Crypt of the NecroDancer: Nintendo Switch Edition •D.C.4 Da Capo 4 Fortunate Departures •Dragon’s Lair Trilogy •Endless Ocean Luminous •Genso Rogoku no Kaleidoscope •Gunbird 2 •Harvestella •KonoSuba: God’s Blessing on this Wonderful World – Labyrinth of Hope and the Gathering of •Adventurers Plus •Kono Subarashii Sekai ni Shukufuku Wo Noroi no Ibutsu to Madoishi Bokensha-tachi •Labyrinth of Galleria: The Moon Society •Manticore: Galaxy on Fire •Nekopara Vol.1 •Nekopara Vol.2 •Northgard •Portal 2 •Redemption Reapers •Sakuna: Of Rice and Ruin •Saviors of Sapphire Wings / Stranger of Sword City Revisited •SEGA Ages G-Loc Air Battle •SEGA Ages Virtua Racing •Sky: Children of the Light ToHeart •Umineko When They Cry Saku: Nekobako to Musou no Koukyoukyoku •Warp Shift",
                "author": "GiantessStorm"
            },
            {
                "raw_content": "I am holding out for a Minecraft Native port. My SW2 will never be put down when that happens.",
                "author": "Random-Poser-"
            },
            {
                "raw_content": "Been waiting on the Portal 2 fix. Finally can get back to that game again.",
                "author": "blueblurz94"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Annnd now I need Bananza",
        "score": 638,
        "text_content": "Friggin Target HAD to have a demo. Lol. My boy said, \"I want this\" after his first punch. Haha so fun",
        "comments": [
            {
                "raw_content": "Sure… he wants it! 🤣 It’s a lot of fun. Good game.",
                "author": "Spyerx"
            },
            {
                "raw_content": "Actually I didn’t love the store demo, but the full game is good. Gets better the more you understand the controls",
                "author": "frankandsteinatlaw"
            },
            {
                "raw_content": "I bought it and my son of 5 is rushing through the story with the help mode. so i get all the spoilers :') He did the same with astro bot. He finished the story and i platinum it in the later hours. Donkey kong going to be the same route. Good fun playing both together. So tonight im going to vacuüm the levels he did.",
                "author": "kleutscher"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Some Switch 2 games on sale on eshop right now. I’ve never played No Man’s Sky. That’s a nice discount",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No man’s sky is fun but I would look into reviews before buying. I’m a big fan but the game isn’t for everyone. It has a lot of cool stuff you can do but none of the things have extreme amounts of depth to them. The game has come a long way and has even more stuff to do but if you don’t enjoy the core gameplay loop you’ll bounce off pretty hard. If you just want a cool survival-lite game where you can build bases and fly spaceships it’s an easy recommend.",
                "author": "I_Heart_Sleeping"
            },
            {
                "raw_content": "No Man's Sky is on sale for that price about every two months, sometimes more often. It does have a free Switch 2 upgrade though, so that's nice.",
                "author": "HARM0N1K"
            },
            {
                "raw_content": "Not having an upgrade path for Suikoden is so annoying. I played 1 on switch but haven’t played 2 yet. Yeah it’s just frame rate and the game is an old game, but still",
                "author": "Jimmythedad"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing DK bananza. And it's getting better and better",
        "score": 442,
        "text_content": "I'm at SL1200 now. When I was at SL 100, I thought, \" It's good.. but not as good as Mario Odyssey.\" But now I can confirm. This game is good as Mario Odyssey, and some part DK Bananza even exceeds it.",
        "comments": [
            {
                "raw_content": "Yesss I rolled the credits last night myself! It only continues to get better, tbh. Especially when you learn to control your fomo and save the harder to reach bananas for the postgame, which is what happened to me around sublevel 1000 hahah and the final level? Absolute peak. I am definitely enjoying it more than Odyssey, tbh. For different reasons, but nonetheless, I had a lot more fun with it as a whole than Odyssey",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "I think I am at 300 and already likely it more than mario odyssey and this area i am thinking man how massive is this area",
                "author": "Zeldabotw2017"
            },
            {
                "raw_content": "I replayed odyssey over the last few weeks and I think I honestly like Bananza better flat out",
                "author": "ElderGoose4"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Loving these homages in DK Bananza",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hms0k0fnkxdf1.jpeg?width=1170&format=pjpg&auto=webp&s=a6baa33a471b55e7448dd7c279e3d2a633c0a432",
                "author": "New-Path5884"
            },
            {
                "raw_content": "I dont think theyre intentional homages as much as its just an easy nice way to introduce a level and how else are they gonna have him hang from the ceiling?",
                "author": "StudyRoom-F"
            },
            {
                "raw_content": "This game just oozes charm",
                "author": "starstufft"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So apparently the switch version of Portal 2 had microphone support, and the switch 2 enables it (I can't turn it off)",
        "score": 117,
        "text_content": "So since the Switch 2 has a microphone, it activates it automatically in co-op mode! And since they never planned on the switch having a microphone, they never added a way to turn it off! Or at least none that I can find.",
        "comments": [
            {
                "raw_content": "I can see why they turned that off.",
                "author": "Mild-Ghost"
            },
            {
                "raw_content": "Stop that",
                "author": "Hungry_Information53"
            },
            {
                "raw_content": "Thats so cool, I wonder if this will get patched out or if valve completely forgot they released this.",
                "author": "IsAnUltracrepidarian"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GOG is teasing a release of Silent Hill and Silent Hill 2 (OG)",
        "score": 555,
        "text_content": "[Source](http://www.youtube.com/watch?v=TGBebJ_k1ts)",
        "comments": [
            {
                "raw_content": "Silent hill 1 never came out on pc , only 2 and 3 and 4!",
                "author": "Bootleg64DD"
            },
            {
                "raw_content": "Oh please this would be so sick. SH1 never got a PC release so even if it's just an emulation of the original PS1 version this would be so cool for preservation and having a more easily accessible, official version of the game on something modern. SH1 wasn't even put on the HD Collection for PS3/360 either EDIT: Voted",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Isn't this basically just an ad for Dreamlist? At any rate, it's clearly working if so [https://www.gog.com/dreamlist/](https://www.gog.com/dreamlist/)",
                "author": "None"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 reveal will be July 31st in ‘COD Next’ style event - Tom Henderson",
        "score": 333,
        "text_content": "- Creators and media invited to play from 29th to 31st - Official reveal on 31st with gameplay and developer interviews - Promotional care packages can be opened from 24th onwards Source: https://insider-gaming.com/battlefield-6-reveal-event/",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Hopefully they have an open beta soon. Still won’t preorder but at least we’ll know to a certain extent if it’s ass",
                "author": "Blanketshaper"
            },
            {
                "raw_content": "BF content creators when they realise they travelled cross-country just to play the build of labs they had at home. ![gif](giphy|9o9dh1JRGThC1qxGTJ)",
                "author": "EffectzHD"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden doubles down that Zenimax Online Studios' canceled project was to reallocate resources for Fallout projects",
        "score": 375,
        "text_content": "This was said in the XB2 Podcast yesterday. Timestamp: [https://www.youtube.com/watch?v=GouIbeqa784&t=1h19m20s](https://www.youtube.com/watch?v=GouIbeqa784&t=1h19m20s) Specifically, Jez states that the financial investment that Microsoft was putting towards Blackbird is what is being redirected for Fallout 5. He states that when he last mentioned this, it was just a rumor he had heard but that he did not have enough information to give a full report on it. However since then he has heard of an \"all hands internal meeting\" at Microsoft that took place last week where it was said that Blackbird was canceled specifically to make \"strategic bets in other areas\", and that the money saved from cutting that project would presumably go towards hiring \"hundreds of other people \\[in these other invested projects\\]\". Jez states that while Fallout 5 was not specifically mentioned in this meeting, the context of the meeting with what else he has heard makes him think that Fallout 5 is one of these other \"strategic bets\". Jez also says that he verified his sources diligently, and that he has heard specifically before that part of the budget consideration for the layoffs at ZOS was for Fallout related projects.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Why do we not acknowledge its Jez Corden who has a clear bias here unlike Jason Schreier. Any sources with a clear bias should be knocked down a couple tiers. Also sugarcoating layoffs is insane shit.",
                "author": "MrYK_"
            },
            {
                "raw_content": "Why are people making it Jason vs Jez? JS said, \"they did it to cut costs\", JC said, \"they are prioritizing other projects to reallocate resources\". Those two things aren't contradicting each other.",
                "author": "LogicalError_007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "2K Sports planning standalone College basketball game according to Sports Business Journal",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Neat How many years would these be away, again?",
                "author": "LoloTheWarPigeon"
            },
            {
                "raw_content": "I want to see NBA Live make a come back.",
                "author": "k_sway"
            },
            {
                "raw_content": "peak 🙌",
                "author": "opanm"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel adds four new BMG-G31 GPU Device IDs to its Compute Runtime, no word on launch yet",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "December.",
                "author": "Suspicious_pasta"
            },
            {
                "raw_content": "https://www.reddit.com/r/intelstock/s/tVpPDHxxnw",
                "author": "EstevezInteriorDemo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "SIXUNITED XN77 laptop to feature Ryzen AI MAX+ 395 \"Strix Halo\" up to 120W TDP",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm intrigued by this. Wonder what the price will be and what the quality will be like. I've got the Z13 and love this chip.",
                "author": "mister2forme"
            },
            {
                "raw_content": "I'm not hating this chip, but when i first heard about it i thought it would be nice to have 385/390 with 32gb as laptop/mini pc (for the much better GPU and not cut down zen5c cores), but now 1.5 years later all they do is release top chip with top memory configuration for $2k+, it's not even close to availability, not to mention that there is one option on the market with 390/32gb on the market and it's not better gaming laptop with 9955hx/5070ti neither in performance nor in price, it's just sad...",
                "author": "jst_reddit_user"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Best FSR 4 Upscaling Setting? - Quality vs Balanced vs Performance",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At 4K it can even be hard to notice the difference when using performance mode",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "tldr?",
                "author": "Chitrr"
            },
            {
                "raw_content": "Best FSR4 setting is the one best fitting with your performance-quality balance, individually for each game. Closing the thread, moving on.",
                "author": "janek500"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "House Prices Outpaced Income Growth Over the Past 40 Years",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Part of the problem is that median incomes and average incomes have diverged due to the gap between rich and poor widening.",
                "author": "prsnep"
            },
            {
                "raw_content": "I’d imagine the cost to build a home has outpaced income growth as well.",
                "author": "bluebloods23"
            },
            {
                "raw_content": "My old house in Brookline, MA recently sold for $2.9M which is up about 6x from what we paid in the 1990’s. The reason is obvious and it’s not income growth: lots more people have moved into Boston from around the world and lots of them have money. You can’t have stable prices when the market is drawing in new people from other places. My neighborhood became a place for people from China to invest. There are also people from S. America and Europe. BTW, taxes are now about $30k a year, so you need $2.5k a month just to pay those, plus water, insurance, and utilities, so over 3500, approaching $4k just to pay for the house. That’s nearly $50k after income taxes just for occupancy costs.",
                "author": "jokumi"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Detailed list of all 44 people in Meta's Superintelligence team.",
        "score": 979,
        "text_content": "— 50% from China — 75% have PhDs, 70% Researchers — 40% from OpenAI, 20% DeepMind, 15% Scale — 20% L8+ level — 75% 1st gen immigrants",
        "comments": [
            {
                "raw_content": "The crazy thing isn't just that 50% are Chinese, but that ±50% of the Americans are also ethnically Chinese, despite the USA only having around ±1.5% of ethnic chinese in its population.",
                "author": "SmallTalnk"
            },
            {
                "raw_content": "fantasy league for AI researchers",
                "author": "Calsoma"
            },
            {
                "raw_content": "Interestingly, Chinese people dominate - even American researchers largely seem to be Chinese. I wonder why they are overrepresented in AI specifically. Either way, glad to have global talent working in the US in this field.",
                "author": "deleafir"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "'Universal cancer vaccine' trains the immune system to kill any tumor",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like it's still clinical trials on animals.., so might be quite a while before it reaches humans. If it ever does, which I hope it will, we need to have more ways to fight cancer.",
                "author": "Good-Age-8339"
            },
            {
                "raw_content": "Please can you hurry up 😞",
                "author": "rafark"
            },
            {
                "raw_content": "Medicine should reach that level as soon as possible",
                "author": "oneshotwriter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Looks like deepmind has also won IMO gold but they haven’t announced it",
        "score": 475,
        "text_content": "I seriously want to know like I am itching to know what advancements they made in models doing this lol..",
        "comments": [
            {
                "raw_content": "What is P6?",
                "author": "---reddit_account---"
            },
            {
                "raw_content": "He deleted the tweet",
                "author": "Wonderful_Buffalo_32"
            },
            {
                "raw_content": "Can someone break down what this is about?",
                "author": "chunkypenguion1991"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Did you know Gemini could do this?",
        "score": 84,
        "text_content": "Since Google connect to so many services (Gmail, Calendar, Smart Vacuum/Light, etc) You can have it to pretty complex action, multi step actions for you. Seems pretty cool and useful.",
        "comments": [
            {
                "raw_content": "Huh. I wonder how well that works. That would be a great way to easily keep up with the latest developments in one's field in academia.",
                "author": "TurbulenceModel"
            },
            {
                "raw_content": "Can you tell it start in 10 minutes or something? I would like to see if it actually works. I would request something much simpler. I check a few websites for updates on a weekly basis. I would love to be able to tell it check daily/weekly for changes and let me know if it finds anything.",
                "author": "Tusker89"
            },
            {
                "raw_content": "By the way, apparently Google released a new page called (Gemini Drops)[https://share.google/27tyYqF8s2oZNjRP9] which is how I found out about this feature.",
                "author": "UnknownEssence"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman on the model",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"not sure how i feel about it...\" oh stfu.",
                "author": "audionerd1"
            },
            {
                "raw_content": "Little coding project: make a fully interactive snake game.",
                "author": "Blahblahblakha"
            },
            {
                "raw_content": "https://preview.redd.it/txf5ngxqnvdf1.jpeg?width=1080&format=pjpg&auto=webp&s=6ec7e9a3eda01c9ac0c5bdfb76e2853b265f9959 Same energy",
                "author": "The_OblivionDawn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "He is starting to beleive",
        "score": 489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Marcus benchmark has been saturated",
                "author": "manubfr"
            },
            {
                "raw_content": "The biggest skeptics are starting to change their tune. ![gif](giphy|4WU1o0UTmHlHq)",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "https://preview.redd.it/qb068l89rudf1.png?width=752&format=png&auto=webp&s=39014dddcc76b0662fe817a6b599c9156241ae33 You're giving him too much credit. He's more dense than that.",
                "author": "10b0t0mized"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sama tweet on gold medal performance, also says GPT-5 soon",
        "score": 580,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do I suspect GPT-5 will be underwhelming?",
                "author": "No-Search9350"
            },
            {
                "raw_content": "Maybe they keep it for themselves for now? You know, like in AI2027 scenario.",
                "author": "ilkamoi"
            },
            {
                "raw_content": "What is the gold frog?",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's usage lead isn't that far ahead",
        "score": 114,
        "text_content": "(Infographic created by ChatGPT agent)",
        "comments": [
            {
                "raw_content": "TBF, Google have built Gemini into almost every existing product they have.",
                "author": "peakedtooearly"
            },
            {
                "raw_content": "If those numbers on the side are true, the graph is wrong. Are they in the wrong spots or something? Edit: just checked and the whole infographic/numbers are wrong.",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "Is copilot just not considered? I’m curious how it can’t even touch this list being installed on all windows systems without their effort",
                "author": "DiligentClass1625"
            }
        ],
        "subreddit": "singularity"
    }
]