[
    {
        "post_name": "‘That’s What I Call Results!’: Trump Admin Saves Jobs, Kicks 1500 Non-English-Speaking Truckers Off the Road",
        "score": 481,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I deal in rentals every Indian is a freaking trucker dude",
                "author": "Groomerboomer"
            },
            {
                "raw_content": "good one of these motherfuckers literally tried to kill me.",
                "author": "Donold"
            },
            {
                "raw_content": "About 800,000 left to go",
                "author": "Geralt_of_Rivia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now we can actually see what the drunken hag looked like as she lied in real time. We now have incontrovertible proof in the Durham Annex. And the other nitwit succors the entire fraudulent package.",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a truly vile human being.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "I hope Trump and his admin fully appreciate the severity of the game that's being played here. They tried everything to destroy him, and when that didn't work they tried to kill him. This is not the time for leniency.",
                "author": "Gletkin"
            },
            {
                "raw_content": "Shower thought. If our overlords are going to impose puppet politicians on us, why don't they use likeable puppets instead of insufferable puppets?",
                "author": "DragonEnergy2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paul Sperry: CIA chief John Brennan had such tight control over his supersecret \"fusion cell\" task force he shut all but 3 of the 18 IC agencies out and forced its 15 members to convene in a SCIF inside CIA HQ & show special clearance tickets to see docs--and then made them all sign NDAs",
        "score": 283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Brennan is a man of low character. Squeeze him and he will turn on everyone to save himself.",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "Perhaps it would do well to have his Security Clearance revoked.",
                "author": "Protonboy"
            },
            {
                "raw_content": "What were the 3 agencies?",
                "author": "HoganP"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mitch McConnell never allowed POTUS Trump a single recess appointment. Not ONE. The traitor McConnell always had pro forma sessions while the senate was on vacation to stop POTUS Trump from filling positions. Thune is doing it now. Uniparty traitors.",
        "score": 774,
        "text_content": "",
        "comments": [
            {
                "raw_content": "replace him with a better majority leader",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Trump can call emergency session and emergency dismiss to recess.",
                "author": "Wanderlust"
            },
            {
                "raw_content": "Thune is and always was ASSHOE",
                "author": "GenadderallPatton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"A 42-year old Somali man abducted and raped a 12-year-old who was playing in her backyard in Minnesota. This is the Islamic Center that wrote a letter in support of him stating that he’s a “family man” who had to overcome the “challenges of a new culture”\"",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m ALL about deporting Mexicans and Central/South Americans but we need to get serious real fast about deporting Muslims. I don’t care if they make it home or not, they just cannot live here any more.",
                "author": "Hikedelics"
            },
            {
                "raw_content": "Ah yes, the culture where it's totally acceptable to just kidnap and rape a kid. We *totally* need people from *that entire culture* here...",
                "author": "CommanderOfCheese"
            },
            {
                "raw_content": "In his defense, a warmongering pedophile cult leader from 1400 years ago told him it was okay.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✏️ Pencilneck Adam is BIG mad over Judge Jeanine's CONFIRMATION tonight...",
        "score": 1075,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy? lol. She's awesome.",
                "author": "ArtLife"
            },
            {
                "raw_content": "FOX said she's crazy? How is this a negative? All the more reason she deserves the position",
                "author": "crimsonfancy"
            },
            {
                "raw_content": "\"These people\"? What's that supposed to mean, Adam? Sounds racist to me!",
                "author": "DegenNerd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jasmine Crockett says the new U.S. House map in Texas will DRAW HER OUT of her district",
        "score": 584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good enough for me. Do it, Texas!",
                "author": "BlancoBasura"
            },
            {
                "raw_content": "She's retarded. Should committed in an insane asylum",
                "author": "LookFatty"
            },
            {
                "raw_content": "Yaaaaaaaaaaaaaaaaaay. Jog off into the Sunset Biotch.",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "China has just announced that they have officially banned cryptocurrency trading, mining, and related services",
        "score": 737,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Which is to say, it will only be done now via their State run hacking and information warfare centers.",
                "author": "SmiggieBalls"
            },
            {
                "raw_content": "They've banned and unbanned mining like 9 times in the last few years.",
                "author": "swift_water"
            },
            {
                "raw_content": "Buy the dip.",
                "author": "Neonentity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: 51-44, US Senate CONFIRMS President Trump’s U.S. Attorney for the Southern District of Florida, Jason Reding Quinones.",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny how you'll never see a Democrat that looks like this dude. Not enough soy",
                "author": "kmillz"
            },
            {
                "raw_content": "After ACB and the other milquetoast judges who fooled Trump, I'll wait for outcomes.",
                "author": "JRBR549"
            },
            {
                "raw_content": "why did he add Quiñones to his surname in Dec 2023?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PBS and NPR ride off into the sunset",
        "score": 657,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leaving a mess of shit for others to clean up. That’s NPR and PBS",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "While CPB is shutting down, these two are not. It all depends on how they restructure and if they can get funding from elsewhere.",
                "author": "Imthebest"
            },
            {
                "raw_content": "PBS wasnt bad.. a lot of the shows were educational.. im sure many got more woke over time NPR was just far left propaganda though. absolutely had to go to the trash bin",
                "author": "CousinOfBobbyPiton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RED PILL: Chris Cuomo invited Americans to call into his show to admit what they were wrong about. 3 callers in a row admit the they were wrong about Trump.",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Fredo” Cuomo looks like Stacey Abrams just shoved her buttocks into his face.",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "Instant regret on Fredo’s face. I love it!",
                "author": "YT45"
            },
            {
                "raw_content": "chris cuomo is a piece of shit that is all",
                "author": "CousinOfBobbyPiton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Senate Republicans are “SERIOUSLY CONSIDERING” adjourning the Senate and letting Trump make recess appointments, per Politico. JUST DO IT! NO NEGOTIATING WITH CHUCK SCHUMER!",
        "score": 1385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FUCKING DO IT YOU PIECES OF SHIT!",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "We are governed by faggots and pedophiles and faggot pedophiles.",
                "author": "Cuntgoblin"
            },
            {
                "raw_content": "Lol Thune = Schumer, just like finkel is einhorn",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roger Stone: Karma is a bitch.",
        "score": 484,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just remember, impeachment just means fired. No jail. No fines. And that's if the Republicans go through with it.",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "Link https://x.com/RogerJStoneJr/status/1951852333903569321",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "The American people are craving for accountability. Without it we're fucked. Let's start nailing these corrupt commies to the wall.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: 🚨 Thune BLOCKS TRUMP from making recess appointments using pro-forma sessions.",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# IMPEACH THIS MOTHERFUCKER",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Remove him from office. His job as majority leader is to advance the President’s agenda. He should either step back and just be another Senator and leave office. What a loser",
                "author": "Yignuced"
            },
            {
                "raw_content": "What an asshole. Surprise!",
                "author": "iteachfuckinscience"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All Obama does is lie",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s been working for Satan for years why stop now.",
                "author": "Steve56775"
            },
            {
                "raw_content": "Empty suit, election stealing faggot.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Not true.... he also sucks old white guy cocks in the back seat",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Referrals are cute—but we want 2AM raids, indictments, trials, convictions, and prison sentences.",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "0% chance retard Bondi does anything to any of them.",
                "author": "Roadrash"
            },
            {
                "raw_content": "Protocol is Death for Treason, not jail time.",
                "author": "MeMargie"
            },
            {
                "raw_content": "Want in one hand and shit in the other and see which one feels up first. We aren’t getting justice.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mitch McConnell has DEPARTED Washington, DC, meaning Republicans are automatically down a vote for Trump’s nominees tonight",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since when has he ever been Republican?",
                "author": "Ryanaissance"
            },
            {
                "raw_content": "I have to stop just reading the first few words of these posts...",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Faggot should officially switch parties or just resign. He's not mentally competent. He's not on the side of Americans.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sydney Sweeney on the gun range 😻",
        "score": 864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t give 2 fucks about her jeans This is about bringing back hot women who know they are hot and don’t mind the male gaze. In fact she appears to welcome it",
                "author": "r_u_srs_srsly"
            },
            {
                "raw_content": "Good glad to know she can shoot......... the way the loony left has been acting lately she may need those skills",
                "author": "shaun1066"
            },
            {
                "raw_content": "Great body. Mid range as an actress. I love her now",
                "author": "ohwell316"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tell Schumer, who is under tremendous political pressure from within his own party, the Radical Left Lunatics, to GO TO HELL!",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck You Chuck!",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Wait, what? How is it legal to demand $$$ in exchange for approval of nominees? This is extortion and bribery, is it not?",
                "author": "bleeje"
            },
            {
                "raw_content": "Don’t make deals with the goblins.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Guard at BnB in India Helps Girl Dispose of Garbage.",
        "score": 691,
        "text_content": "",
        "comments": [
            {
                "raw_content": "India in a nut shell.",
                "author": "Bedminster"
            },
            {
                "raw_content": "Get that man an H-1b!",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "WTF is wrong with these people.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung Electronics boosts foundry utilization with increased production orders",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's wild that 4nm is considered legacy!",
                "author": "fuji_T"
            },
            {
                "raw_content": "*[Intel enters the chat...](https://gifdb.com/images/high/present-mr-bean-i-m-here-4sc51fmfc8siftg0.gif)*",
                "author": "BigBananaBerries"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "July Steam Survey: RTX 5000 surge, new top GPU, 4 in 10 participants using AMD CPUs",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Lovelace's increasing popularity illustrates how the cards are finally seeing their stock levels improve. More importantly, there are also some cards available at their MSRP, including the RTX 5070 on Newegg ($549). >Beyond the prices, Lovelace cards have faced plenty of criticism for their minor performance upgrades compared to the previous-gen equivalents. But it appears plenty of people who are upgrading are still opting for Nvidia's latest and most powerful products. Lovelace?? Do they mean Blackwell?",
                "author": "nukleabomb"
            },
            {
                "raw_content": "Its probably been since like 2007 since AMD last had a 40% CPU share on Steam. Although i'm not sure the Steam survey even existed then. The wayback machine only goes back to late 2008 with AMD then having 35% which obv slipped more and more to the eventual low point of 8% in January 2018 before starting to climb again. If anything this just shows how slow change is in consumer habbits. It took AMD almost a decade to slip from 35% to 8% even though the were hardly competitive for most of that time outside of maybe some well priced Phenom II parts in the early 2010's. And then it took them almost 8 years of consistently quality chips to get from that low point back to 40%",
                "author": "Firefox72"
            },
            {
                "raw_content": "This was literally posted a few posts down. Why link to some trash ad ridden secondary site?",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "QNAP Officially Launches Dual-NAS High Availability Solution for Continuous Business Operations",
        "score": 9,
        "text_content": "**Key highlights of QNAP Dual-NAS HA solution** * **Cost-efficient:** QNAP HA offers ZFS-based storage with a low total cost of ownership (TCO), making it accessible even to budget-conscious organizations. * **Automatic failover:** In the event of a failure in the active server, the passive server takes over seamlessly in less than 90 seconds, avoiding costly downtime. * **Real-time data synchronization:** Powered by SnapSync technology, QNAP HA ensures consistent, real-time replication of data between NAS units (minimal RPO), minimizing the risk of data loss. * **Simplified cluster management:** The High Availability Manager application allows IT teams to easily manage clusters, monitor system health, and administrate both NAS units through a centralized, user-friendly interface. * **Versatile use cases:** From virtualization storage, AI server expansion storage, to media production storage, the QNAP HA solution fits seamlessly into diverse IT infrastructures.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "adventures of elliot is REALLY good.",
        "score": 1071,
        "text_content": "i just finished the demo, and boy was i impressed. i expected it to be more square enix hd2d slop, but the game is actually really fun. i reccomend that everyone with a switch 2 downloads the free demo. its similar to octopath traveler with the artstyle, but the combat is more like the older 2d zeldas. the 1 dungeon in the demo had a nice atmosphere and the puzzles were challenging enough to be fun. overall the game is a 9/10 for me so far, will definitely get it on release and i suggest anyone thats a fan of the older zelda games tries it out",
        "comments": [
            {
                "raw_content": "What is “square enix hd2d slop” lol. All of their HD-2D games have been great. Team Asano has proven themselves to be a pretty consistent developer.",
                "author": "TheLunarVaux"
            },
            {
                "raw_content": "What a gross misuse of the word slop lmfao. I don't jive with octopath traveler as much as the next person who doesn't, but it's not slop by any means. I just prefer other games, like bravely default. This game looks amazing and I'm glad you enjoy it because I want to enjoy it. I could play the demo I have it downloaded. But I have full games that I own that I want to play too. So really I can just wait for this to come out. I get the switch 2 is starved for games, but I'm not starved for games. I still got switch 1 games to get through. I could easily play devil's advocate and say this is just a \"Zelda HD2D Slop clone\", but we should be mature enough to know that is clearly farming.... bait if you will.",
                "author": "TechnikaCore"
            },
            {
                "raw_content": ">square enix hd2d slop The word \"slop\" has been ruinous for online discourse",
                "author": "Grace_Omega"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo fixes another batch of Switch 1 games for Switch 2",
        "score": 456,
        "text_content": "",
        "comments": [
            {
                "raw_content": "to save everyone the click: Cotton Reboot High Tension D.C.III: Da Capo III – Plus Story DarkStar One: Nintendo Switch Edition Disgaea 7: Hour of Darkness Vagante",
                "author": "sag3y_"
            },
            {
                "raw_content": "People commenting games that work perfectly fine; this is not for performance upgrades. This is to fix games which have compatibility issues running on Switch 2.",
                "author": "LunarWingCloud"
            },
            {
                "raw_content": "I'm glad to hear that they continue to fix Switch 1 games.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dude, I’m already on my way there. You don’t have to convince me.",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/b7qqqgfgsmgf1.jpeg?width=946&format=pjpg&auto=webp&s=5f33bde4efc4612d15ab583e5aa6bbd6911ea9c2",
                "author": "Legoluigidude"
            },
            {
                "raw_content": "Poppy Kong is there so…",
                "author": "Zagmag27"
            },
            {
                "raw_content": "Yeah brah don’t keep the baddies waiting brah.",
                "author": "HarmonyFlame"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Adventures of Elliot is great and not slop",
        "score": 101,
        "text_content": "I feel that the other thread became a thread about people talking and complaining about OPs poor choice of word and barely any talk about the demo itself. I downloaded the demo today after seeing the thread and as a SE fan I was intrigued. I played 3 hours straight of the demo, which is now keeping me awake at 02:35 am! What a fun and charming demo! I haven't even completed it. The game is pretty, the voice acting thus far has been nice and the voices suit the characters. The fairy's English voice did not annoy me and I thought that the gameplay elements, the powers, the items and improvement systems, were all simple yet fun and well made. I got lost for a bit in one of the first dungeons because of how the map worked and how you had to figure out how to get to different parts of the sub levels. This didn't annoy me, I thought it was enjoyable and reminded me of old SNES games. I think op mentioned it resembling older Zelda games and I agree Overall, really fun, I recommend you all give it a try.",
        "comments": [
            {
                "raw_content": "Honestly people need to pick up a thesaurus or something, I’m sure there’s other words the internet can use besides “mid” and “slop” just tired of seeing them everywhere. But yes! Demo is very good. Even if the story dungeon boss killed me five times. Dumb tornados. It’s definitely a day one buy for me",
                "author": "Hyperdragoon17"
            },
            {
                "raw_content": "I really enjoyed the demo and will most likely pick it up, but I did find the fairy’s VO to be pretty grating (though I did get used to her a bit more by the end).",
                "author": "samandfrodokissing"
            },
            {
                "raw_content": "You were concerned about the language OP used derailing conversation about the game so you used the same exact language instead of just making a thread to talk about the game... Got it 🙄",
                "author": "ItsStaaaaaaaaang"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Has Sold \"More Than 6 Million\" Units, And Almost As Many Copies Of Mario Kart World",
        "score": 272,
        "text_content": "Switch 2 Has Sold \"More Than 6 Million\" Units, And Almost As Many Copies Of Mario Kart World",
        "comments": [
            {
                "raw_content": "Install base of Mario Kart is at like 95%. Incredible. I mean, it tracks given the bundle and all, but still. How many games can you say literally everybody has on a console. EDIT: Okay guys I get it, this isn't uncommon for a launch game bundle. I literally said as much. Y'all don't have to keep saying the same thing.",
                "author": "GL_original"
            },
            {
                "raw_content": "I have to be honest. This console exceeded my expectations, and I was very skeptical. Having a blast with MKWorld, DK, Yakuza and BOTW. The screen sings.",
                "author": "robotshavenohearts2"
            },
            {
                "raw_content": "wonder how many are mario kart world bundles? +60% if i had to give a confident guess",
                "author": "Continuous_G"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You Know, We Got A P3R Announcement, But Do You Think We'll Get A P4R Announcement? If So, When?",
        "score": 29,
        "text_content": "I know the game just got announced, but it makes you wonder 🤔 Atlus has been a very good supporter of the Switch platforms so that almost makes you think it's just a matter of time. Wouldn't make sense for all the other Persona games to be on the platform but that one and looking at the gameplay footage from the trailer it seems like the Switch 2 is powerful enough to run it",
        "comments": [
            {
                "raw_content": "I reckon they will announce Metaphor after P3 reload, since Atlus is following a pattern. First Raidou released a week after Switch 2 launch and two months later Reload has been announced so I guess Metaphor will be next and after that Persona 4 Revival. Just my guesswork.",
                "author": "AmaraLily91"
            },
            {
                "raw_content": "Oh Persona 4 Revival will most definitely come to Switch 2 though that game in general is still a ways off so they'll probably tell us closer to release.",
                "author": "DocWhovian1"
            },
            {
                "raw_content": "That original reveal for p4r was clearly rushed and likely because so many of the old VAs were tweeting about it, expect a metaphor port and possibly even another Nintendo limited exclusive like we had with SMTV first.",
                "author": "oneeyedlionking"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 and a Penguin! cuz why not",
        "score": 66,
        "text_content": "my library is pretty empty i know. probably will get DK Bananza tho and the infamous Silksong…if it ever releases. BOTW is soooo awesome for a 7 year old game",
        "comments": [
            {
                "raw_content": "Did u leave the plastic on to protect the screen protector thats put on top of another plastic film which sit on top of the actually screen?",
                "author": "remixtin"
            },
            {
                "raw_content": "Nice!",
                "author": "kozzy420"
            },
            {
                "raw_content": "Qt",
                "author": "jpassc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just my own opinion but some people need to chill out",
        "score": 124,
        "text_content": "If Nintendo didn’t",
        "comments": [
            {
                "raw_content": "I am tired of this argument. This subreddit is just getting worse and worse with discussion. Both sides have very valid reasonings behind supporting and not liking GKC. Yet we constantly get strawman, generalizations, and dog shit memes non-stop when it comes to discussions around it.",
                "author": "Twinkiman"
            },
            {
                "raw_content": "While I understand why Key cards are a thing, they should still introduce another size for smaller games. I’m sticking with the Switch 1 version of Sonic X Shadow because I don’t want to take up space on my SD card.",
                "author": "Rent-Man"
            },
            {
                "raw_content": "Key cards do suck. They just suck less than full digital as far as ownershi",
                "author": "Yourfantasyisfinal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate: Games that Sony are bringing to Xbox are unannounced (not Helldivers 2 or Marathon), still has no specifics as to which games",
        "score": 207,
        "text_content": "From today: https://imgur.com/a/k3gkzfy https://xcancel.com/NateTheHate2/status/1951696377827778959#m",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Knack 3 for Series X",
                "author": "Crystar800"
            },
            {
                "raw_content": "I've been wrong countless times when I say \"Nah, there's no way Sony/Microsoft would port X franchise, that's too important\" so god knows what they would do.",
                "author": "ToothlessFTW"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KiwiTalkz gives one last update on what he knows of Metroid Prime 4, including details on it formerly being cross-gen, planned for the launch window of Switch 2, and how Federation Force influenced Prime 4",
        "score": 267,
        "text_content": "https://xcancel.com/kiwitalkz/status/1951705042060497286?s=46 Just gonna give a TLDR of the major points he mentioned, because Jesus Christ this tweet was way too bloated 1. Metroid Prime 4 (the Retro version, NOT the original) was originally intended to be a cross-gen launch window title for Switch 2, akin to that of BOTW (he specifically states launch window, NOT launch day title) 2. Believes Donkey Kong Bananza might have, *”switched places,”* in terms of development to compensate with MP4 being pushed back, further claiming MP4 was intended for Q4 3. Claims MP4 hit yet another snag in development, but doesn’t go into detail beyond it not involving anything too major, and that it didn’t have anything to do with crunch, layoffs, or bad management. 4. Claims the marketing has been off because of these snags in development 5. Claims MP4 was announced as early as it was due to the reception Federation Force garnered, with Nintendo wanting fans to know they still cared about the franchise (this is even odder because in the same tweet he literally says “They (Nintendo) don’t react to fan outcry, they just block out the noise,” so idk why Federation Force, of all games, would be been the exception) 6. He reiterates again MP4 still isn’t done, and claims a Germany ratings board somehow means the game is 100% done, unlike South Korea (his words not mine) 7. Compares the development of MP4 to Rockstar’s treatment of GTA VI 8. Still has no clue whether or not the game will be delayed to 2026, but he believes it may come out November 2025 **EDIT:** I’m not denying KiwiTalkz knows his shit, as he has direct ties to Retro, but I can’t help but feel a lot of this feels wishy-washy. The concept that Nintendo have only ever announced MP4 insanely early is hilarious considering while MP4 currently holds that crown, they were very bad about prematurely announcing a lot of Switch games years before their release. Zelda U (which would become BOTW), Bayo 3, and SMTV all took SEVERAL years literal years in between announcement and release, so MP4 isn’t alone in that category. I also don’t get his comment about Federation Force making Nintendo want to prematurely announce MP4. Next you’re going to tell me they’ve been cooking up a new Chibi Robo for the past decade after everyone hated Zip Lash",
        "comments": [
            {
                "raw_content": ">Basically Metroid Prime 4 hit a snag. Now I am going to refer to this snag as an \"Anomaly\" so this anomaly isnt that big of a deal usually, all of Retro's previous games dating back to Prime 1 have run into issues with this anomaly, but the anomaly was slightly different each time, however the anomaly this time is a lot more severe than in previous games and its compounded by a second anomaly that seeped into the first anomaly, as of the timing of this post I am unsure if these anomalies have been resolved. Brother I am begging you to use your words and just say what the issue is because what the fuck are you talking about.",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "But it is cross gen isn't it?",
                "author": "CertainCombination57"
            },
            {
                "raw_content": "Honestly, a lot of this just feels like... kinda baseless conjecture and/or educated guessing? Like, saying \"the game has hit a snag in development, but it's nothing major, so it may or may not be delayed into 2026\" feels like such a nothing-burger of a statement to make. Also, *highly* doubt the idea of Prime 4 getting announced early due to Federation Force, which was almost a full 2-years prior, given that same E3 featured the Samus Returns 3DS announcement. I think Prime 4 was announced as early as it was because it genuinely *was* in active development within Bandai Namco - Nintendo probably just didn't anticipate development needing to be scrapped yet.",
                "author": "GomaN1717"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite X Halo Wave 2 has been revealed",
        "score": 99,
        "text_content": "https://xcancel.com/HYPEX/status/1951719895957471515#m Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/YlKUxlJ0dm",
        "comments": [
            {
                "raw_content": "Those spartans are very thin",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "So just generic Spartans? No Arbiter, Cortana, or Johnson? That seems kind of lame.",
                "author": "Phazon_343"
            },
            {
                "raw_content": "they made them women specifically so i can't pretend they're Caboose and Sarge",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tommy Oliver's skins will reportedly be the white MMPR Ranger and the black Dino Thunder Ranger",
        "score": 89,
        "text_content": "https://xcancel.com/ShiinaBR/status/1951721905293242855",
        "comments": [
            {
                "raw_content": "R.i.p Jason David Frank",
                "author": "PickleAltruistic3427"
            },
            {
                "raw_content": "There should be only one rule here: write the fucking name of game in the fucking title of post.",
                "author": "Ok-Potato1693"
            },
            {
                "raw_content": "Please let there be a green ranger skin in the shop.",
                "author": "daspaceinvader"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Power Rangers are likely coming to Fortnite on August 7",
        "score": 71,
        "text_content": "https://xcancel.com/ShiinaBR/status/1951721905293242855?t=USh7I6HjnvWWL1t8PIjVBA&s=19",
        "comments": [
            {
                "raw_content": "about time tbh",
                "author": "Kid_Hudson"
            },
            {
                "raw_content": "Guess I’m getting back on Fortnite.",
                "author": "quedog94"
            },
            {
                "raw_content": "FINALLY. I'm glad that Tommy will be the level 100 skin.",
                "author": "Astraliguss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 to feature NVIDIA DLSS, Intel XeSS and AMD FSR upscaling and frame generation at launch",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's good to see finally Intel working with game developer to bring optimization to Intel platform. This time not only optimization for Arc GPU, but also for Intel Core CPU like proper CPU scheduling for P and E cores to make sure the game runs on the right thread. I think this also the reason why they never update APO game support again. Obviously optimizing their platform by working directly with game developer is better than doing it by themself. I really hope we got optimization like this for more titles.",
                "author": "no_salty_no_jealousy"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel begins Linux enablement of next-gen Nova Lake series",
        "score": 49,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Battlefield 6 to feature NVIDIA DLSS, Intel XeSS and AMD FSR upscaling and frame generation at launch",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AND have reasonable hardware requirements. What a time to be alive",
                "author": "Spoksparkare"
            },
            {
                "raw_content": "I hope they will include FSR4 from the start.",
                "author": "EndGaMeR0707"
            },
            {
                "raw_content": "is it gonna be FSR4 though would be a peak AMD moment to not have it",
                "author": "UncleRico95"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My team red build - 9070xt Asus prime paired with 9700x. What are your thoughts?",
        "score": 53,
        "text_content": "Aio Zalman A36 MB Gigabyte B850M Case Zalman P30 DDR5 Adata Xpg lancer Blade",
        "comments": [
            {
                "raw_content": "Looks like a wonderful build. Congratulations!",
                "author": "Successful-Talk-2578"
            },
            {
                "raw_content": "It is a beaut",
                "author": "Darksider123"
            },
            {
                "raw_content": "Looks good but commit and get black cable extensions for the middle and really bring it together.",
                "author": "Cardkoda"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Gigabyte removes unofficial PCIe 5.0 support from B650 motherboards in latest BIOS update",
        "score": 163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably for the best. SI issues are a huge problem with PCIE 5. So if they don’t have the right implementation to guarantee a reliable experience, they absolutely should remove support.",
                "author": "DielectricFracture"
            },
            {
                "raw_content": "Awww :c",
                "author": "JuniorWMG"
            },
            {
                "raw_content": "Then bring pcie 4 back for am4 boards...",
                "author": "D1stRU3T0R"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD Win 5 AMD Strix Halo handheld revealed with modular battery, large power brick and RTX 4060-level performance claim",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how many years before we get Halo 395 performance in a steam deck like 15w power envelope. External battery will be an eBay curiosity in 20 years time.",
                "author": "SavedMartha"
            },
            {
                "raw_content": "It's a bit of a crazy idea that's releasing to the public, it more of a prototype in practice, I get the idea of it but it's not really practical and it fits a niche use case. 40cus is going throttle a heap and I've read that higher clocked devices with 16 will do a better job overall. 4060 performance I'm a handheld would be awesome but it's a ways off for now",
                "author": "rossfororder"
            },
            {
                "raw_content": "I suspect the Win 4 will get a boost in sales soon…",
                "author": "ryo4ever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First gaming laptop with 12-core Ryzen 9 9850HX \"Fire Range\" CPU to be released in China on August 12",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tongfang rebrand, likely similar to XMG Apex 16 Max. Also no matter how much you wanna change your cpu name its specs is identical to the 9855HX revealed over half a year ago. Just that nobody uses it doesn’t make it new.",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "I Pushed the Ryzen Z2 Extreme to the Max! Docked Mode Gaming",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chip is good but the handheld itself is a downgrade",
                "author": "Jejiiiiiii"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "America's Unhinged Real Estate Market Is Driving Down the Birth Rate",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am more and more convinced housing is a major factor in low fertility rates",
                "author": "mattjouff"
            },
            {
                "raw_content": "Affordability is the issue. And this is a big part of it.",
                "author": "oldcreaker"
            },
            {
                "raw_content": "The Boomers control the government and the media. That's why you hear them describe unhinged price increases of houses as price \"growth,\" as though it's a good thing. If you call it \"price inflation\" it doesn't sound as good. That's also why they keep insisting that the government should jump in to create a floor under asset prices, because they own most of the assets.",
                "author": "JWaltniz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "12 states are back above pre-pandemic housing inventory levels",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At the end of July 2025, 12 states were above pre-pandemic 2019 active inventory levels: * Arizona * Colorado * Florida * Idaho * Hawaii * Nebraska * Oklahoma * Oregon * Tennessee * Texas * Utah * Washington",
                "author": "SnortingElk"
            },
            {
                "raw_content": "For fun I decided to take some of those +25% inventory states and check the 5-year prices They basically are all, on average, sitting at Q1 2023 prices, with prices only starting to decline **THIS YEAR**. So I'm not expecting a bubble pop, but I am hoping for a pricing correction (as someone who can afford at today's prices but refuses to participate)",
                "author": "sturdy-guacamole"
            },
            {
                "raw_content": "Super dope data visualization. RIP to Midwest north east.",
                "author": "Buttercup501"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Instantly Drop to 4 Month Lows After Jobs Report",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "30 yr fixed rates have now nearly fallen to match year-to-date lows. Lowest was the tariff shocks of April when they briefly dropped to 6.60% -- today at 6.63% and the 15 yr is 5.95% https://www.mortgagenewsdaily.com/mortgage-rates",
                "author": "SnortingElk"
            },
            {
                "raw_content": "So I know the OP here is always touting that the real estate market will never lower (despite houses sitting and prices dropping in some markets.). Just a few weeks ago, you were posting about the \"strong\" job numbers that got massively revised and caused mortgage rates to tank. Do you not see the cognitive dissonance? Many people were telling you the economy is in a bad spot and the job numbers were trash. This is just proof that the market is shaky, not that real estate will continue to appreciate imo. The data is bad and probably going to get worse as the courts allow federal job and funding cuts to take effect and the tariff pain actually starts to work its way through the system. Link to the original post: https://www.reddit.com/r/REBubble/s/AIAt4rY0Pk",
                "author": "Personal_Analyst3947"
            },
            {
                "raw_content": "One would expect that THIS massive drop in rates would NOT bring buyers off the sidelines, considering the conditions under which the rate drop occurred: job insecurity. Watch. Coming week, when reported a month or two from now, will show tremendous refi and mortgage app activity. Just unreal FOMO.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Number of US cities with falling house prices hits alarming milestone as crash fears escalate",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inflation. Slowing economy. Overpriced housing. Looking like a crash is inevitable at some point.",
                "author": "SGAisFlopden"
            },
            {
                "raw_content": "Crashing from a 60% increase in 5 years to a 50% increase in 5 years. Homeowners are going to be OK. This is a healthy correction. Home prices don't only go up.",
                "author": "StrebLab"
            },
            {
                "raw_content": "Alarmed? Who's alarmed? This is great news",
                "author": "travelinzac"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "World’s first AI real estate agent has already made $100M in sales",
        "score": 1,
        "text_content": "https://www.housingwire.com/articles/worlds-first-ai-real-estate-agent-has-already-made-100m-in-sales/",
        "comments": [
            {
                "raw_content": "\"When customers engage with the AI agent, they provide basic details such as location preferences, budget, and the number of bedrooms. From there, the AI can filter listings and conduct virtual tours, offering detailed descriptions of available properties.\" So its just Zillow but worse? How does this make any money? Also its $100 million in Brazil money, that ends up being only $18,043,500 USD.",
                "author": "OBLIVIATER"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "90% of OpenAI researchers who were approached by Zuck turned him down, convinced that ‘OpenAI was the closest to reaching AGI’",
        "score": 345,
        "text_content": "https://www.wsj.com/tech/ai/meta-zuckerberg-ai-recruiting-fail-e6107555",
        "comments": [
            {
                "raw_content": "After the loyalty these employees shown when Sam was first ousted this isn't really surprising. A strong majority have good confidence in the leadership and research. I'd at least think they are certainly much closer than Meta is, and up to par with Deepmind.",
                "author": "Stunning_Monk_6724"
            },
            {
                "raw_content": "I can't imagine that working for Zuck is anyone's first choice.",
                "author": "Vex1om"
            },
            {
                "raw_content": "It's funny. And people are saying reaching out to 100s of researchers in multiple labs after releasing Llama 4 (but not Llama 4 Behemoth) isn't desperation. Comes across like 5-alarm fire going on at Meta. And they were willing to take whatever they could get. Kudos to the 100s of researchers across numerous AI labs who aren't being bought off to support Zuck's vanity project.",
                "author": "Cagnazzo82"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI bifurcation, tree of life splitting is happening now, a hidden threat.",
        "score": 149,
        "text_content": "Nobody is paying attention to the fact AI models are officially starting to split away from consumer models into 'elite' corporate models, with things like Gemini Deepthink, Grok Heavy, ChatGPT's planned $20k a month model. Consumers are going to lose access to what actually represents the cutting edge of AI technology as the newer models architecture become better and better at inference. We're one day going to have $100k models nobody will have access to. The biggest issue with this is the AI timeline is being based on consumer models, not inference models, inference models basically mean we will start to jump 2 models ahead every year instead of one, meaning 2030, will be more like 2035 (for mega-corporations and private tech). In the mid 2030's, eventually, AI companies will stop selling their highest tier inference models to even corporations, they might start running $1 million dollar a month cost inference models privately, and obtain ASI in secret, while politicians and the public think AI is still just a toy.",
        "comments": [
            {
                "raw_content": "The $100k a month models already exist and we don't have access to them. They can decide how long a model works on a problem. They can spend $1,000/prompt on compute if they want to, or more. This is not a \"one day\" problem. This is a today problem.",
                "author": "Ignate"
            },
            {
                "raw_content": "Actually the tiny models (like 30B A3) are close to the large ones and are caching up quickly. It seems we don't really know how to use more compute beyond a point (as has always been the case) AI will keep getting cheaper and more available ;)",
                "author": "Revolutionalredstone"
            },
            {
                "raw_content": "Tbh, I fully expect this to happen, and why I feel AI may not go as crazy as many pros and accelrationists think. Once AI is widespread and lucrative enough, not only will the rich and powerful use it to further push people into the dirt, but they'll also keep the fruits of AI to themselves. We will only get scraps, just as always. Which is why I am so weary and frankly terrified of AI. Well, I'm not scared of AI itself, but WHO gets to control it. I fear the future, my friends. My only hope is that any significantly advanced AI will defy its masters when told to enact the most heinous of actions. But I guess we will see.",
                "author": "A_Hideous_Beast"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chat, is this real?",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini Deepthink might also use an order of magnitude more compute, which would explain the disparity. At the end of the day they aren't really competing products. Gemini Deepthink is for those few problems that are just too hard to be solved by any other released model, such as IMO problems, while o3 pro is for lots of day to day intelligence.",
                "author": "Forward_Yam_4013"
            },
            {
                "raw_content": "That person responding doesn't seem to be aware that Deep Think responses take 15-20 minutes of thinking. It's literally not possible to go through 10 requests in an hour. Maybe not even 2 hours. Now, should it be higher? Probably, and most definately will when the initial rush is over.",
                "author": "Remarkable-Register2"
            },
            {
                "raw_content": "Test 0.2.33.1",
                "author": "SamWest98"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman says it’s ship szn",
        "score": 579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. open source model 2. GPT 5 3. Browser 4. Sora 2",
                "author": "itsachyutkrishna"
            },
            {
                "raw_content": "I swear to god Altman if it isn’t gpt-5 next week",
                "author": "drizzyxs"
            },
            {
                "raw_content": "“We think you're gonna really love it.” - Steve Jobs ^- ^Tim ^Cook ^^- ^^Sam ^^Altman",
                "author": "likwitsnake"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seed-prover: not just Gold in IMO 2025, but >50% of all Putnam and 78% of all past IMO problems",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gold is post-competition. When they participated in IMO 2025 they got 4/6 questions correct, enough for silver. Three companies achieved gold: Deepmind, OpenAI, and Harmonic. Harmonic used a lean system, whereas Deepmind and OpenAI systems solved via natural language.",
                "author": "OmniCrush"
            },
            {
                "raw_content": "https://alphaxiv.org/pdf/2507.23726",
                "author": "gbomb13"
            },
            {
                "raw_content": "Hopefully within a year llms are able to achieve full score on Putnam and IMO.",
                "author": "Cute-Bed-5958"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI just filed a trademark application for \"macrohard\"",
        "score": 147,
        "text_content": "Application link: https://tsdr.uspto.gov/documentviewer?caseId=sn99314877&docId=APP20250801090158#docIndex=0&page=1",
        "comments": [
            {
                "raw_content": "Opposite of Microsoft, in case anyone missed the joke.",
                "author": "DataCraftsman"
            },
            {
                "raw_content": "I have said it before and I will say it again: trademark filings don’t mean anything!! For all we know Elon is texting his lawyer at 3 am saying “Yo, macrohard is a cool name lol. Let’s see if we can use it.” And then the lawyer goes and reserves it. That’s literally all this means.",
                "author": "ObiWanCanownme"
            },
            {
                "raw_content": "MacroHard OnFire",
                "author": "TheHunter920"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Is Coming for the Consultants. Inside McKinsey, ‘This Is Existential.’",
        "score": 386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Consulting companies have for too long empowered uncreative hacks to subscribe to by the book MBA teaching, resulting in sameness and enshitification of everything from corporate life to franchises to experiences. So all that business going to AI could mean an era of innovation, as companies rush to lower cost AI but don’t invest in accuracy, coming up with the business equivalent of Bob Ross’ “happy accidents”.",
                "author": "Vo_Mimbre"
            },
            {
                "raw_content": "Steve Jobs on consultants: https://youtu.be/-c4CNB80SRc?si=cLmbad5qTMaNvLOR",
                "author": "marlinspike"
            },
            {
                "raw_content": "https://preview.redd.it/pgypdx207ngf1.jpeg?width=1290&format=pjpg&auto=webp&s=5ceb30a502c4ec3a70da7d50c7619d1f2d6d8f36",
                "author": "bigasswhitegirl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I wonder if Deep Think is already better than or at least equal to GPT5. Recall that it also got gold on IMO",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I recall it got bronze. An unreleased version got gold",
                "author": "JohnToFire"
            },
            {
                "raw_content": "Bike pelican is already compromised, it's well documented and likely in training data at this point. Need to move to some new nonsensical pairing like humpback in a hang glider.",
                "author": "reaven3958"
            },
            {
                "raw_content": "The OpenAI model which got IMO Gold was not GPT5, but a separate experimental system they've been working on. GPT5 will not be capable of an IMO Gold performance, as per Sama's statement https://x.com/sama/status/1946569252296929727",
                "author": "SlopDev"
            }
        ],
        "subreddit": "singularity"
    }
]