[
    {
        "post_name": "NOW: The National Guard presence in DC is growing A contingent is now present near the Lincoln Memorial Over 1,000 more troops are on the way, being sent by several governors",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't help but feel something else is brewing and not necessarily in a bad way.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Arresting Zelensky would be great",
                "author": "rextexMG"
            },
            {
                "raw_content": "It's really amazing to see this country heal after all we've been thru with covid and how close we came to absolute communist rule, arresting trump etc. As shitty as things are in my personal life, this is what i live for.",
                "author": "Kumalasbreakfast99"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft, $MSFT, has said that these are the 40 jobs most at risk by AI",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People that check the AI mistakes + 2 million.",
                "author": "rivetjoint2"
            },
            {
                "raw_content": "Historians? Very orwellian.",
                "author": "PenisDickWiener"
            },
            {
                "raw_content": "Hard to believe. Those jobs are where you need a human touch. There is a reason that high end restaurants do not have kiosk ordering.",
                "author": "LaptopDied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If You still not convinced they hate you! Time to return the favor!",
        "score": 255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t forget they also tried to compel you to get an experimental vaccine while letting in millions of illegals and not requiring them to be vaccinated",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "The entire state of California robs from the citizens and gives to foreigners. Might as well just scrap the bear and put a giant taco on the state flag.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Keep in mind that American citizens were intensely pressured to take the jab, and illegals didn't even have to take it.",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roblox Has Lost $12.17 Billion Dollars In Market Capitalization Since August 6th.",
        "score": 769,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would've been cheaper to deal with the pedos.",
                "author": "Farqquard"
            },
            {
                "raw_content": "I had never even heard of Roblox until I saw a post about it on here yesterday.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "Who at Roblox thought this would end well for them? That's the most baffling thing about all of this.",
                "author": "Lurker404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's very simple...",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. I was just telling my wife whats really going to fuck them over is when Trump dramatically improves DC in like a week It will show that crime ridden cities are that way simply because their leadership isn't trying. One week of trump giving a fuck and they clean up. I wouldn't be surprised if State Governor's do this with their national guards.",
                "author": "mb5231"
            },
            {
                "raw_content": "I'm begging now. Do all of California, and empty out the governor's mansion while they're at it. It's time.",
                "author": "MythArcana"
            },
            {
                "raw_content": "The left LOVES the idea of federalized police. LOVES it. As long as all the newly hired federal police officers are LEFTISTS and Democrat loyalist DEI hires.",
                "author": "BastardSonOfCastro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Voters in California overwhelmingly oppose Gov Gavin Newsom's plan to gerrymander the State 64%-36%",
        "score": 813,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We shall see. We say this every \"Red Wave\", and all we get is smelly blue goo. Every single time. He wants to draw disticts starting at the border all the way up to Riverside county. That isn't a district, it's a separate state, FFS.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Newsom: \"SCREW THOSE VOTERS WE MUST PROTECT DEMOCRACY\"",
                "author": "DT170x"
            },
            {
                "raw_content": "Link https://x.com/MAGAVoice/status/1957177853122166947 Sauce https://upolitics.com/news/64-of-california-voters-oppose-gov-gavin-newsoms-plan-to-redistrict-in-response-to-texas-changes-poll-finds/",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cambodian Monks thank President Donald J. Trump for his leadership in stopping the war between Cambodia and Thailand.",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Orange Men Good.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Based. Anyone else come across those fake monks, though, in urban cities? The ones who try putting a bracelet on your wrist then demand money.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Democrats outraged!",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pamela Bondi : 🚨 Over 300 arrests in D.C. — and counting: Just last night, our federal and DC law enforcement partners made 68 arrests and seized 15 illegal firearms. Homicide suspects, drug traffickers, and more are being charged. I’ll continue to stand with yo",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These aren’t the arrests we’re waiting for, Pam.",
                "author": "RiolindasReturn"
            },
            {
                "raw_content": "300 arrests. Are they locked up or are they let go? That's the important part.",
                "author": "Comanche_Moon"
            },
            {
                "raw_content": "This is cool but I prefer arrests of members of elite pedophile rings more.",
                "author": "BidenSniffsLittleKid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gerrymandered New England: Despite Trump 41%, 0 Republican Districts",
        "score": 546,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you look at the federal level, it can work out in our favor. However, all those districts are screwed since they are under authoritarian communist rule. That means screwball judges, crooked black DAs, violence day and night, HUD/SNAP wasteland, and lots of illegals. Nothing blue will fix those local problems.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I wish New England was based. I would love to be a fisherman, build boats, and maybe care for a little historic lighthouse on the side.",
                "author": "OrthodoxTemplar"
            },
            {
                "raw_content": "This map does not show congressional districts. It shows towns except for Maine which shows counties.",
                "author": "SummTingWong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "First they came for the cats",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The people telling me to avoid plane flights are not avoiding plane flights. They might make more money than me, but their lives are not more important than mine.",
                "author": "BillyBillington"
            },
            {
                "raw_content": "Don't worry, the next article will give you recipe ideas on how to \"honor\" the family pet!",
                "author": "Impotent_Weasel"
            },
            {
                "raw_content": "# Members of the world economic forum fly by private jet. # AND THEN they get in a private helicopter for the final leg of the trip that could easily be done by car",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Special Attorney Ed Martin just indicated he and his team are INVESTIGATING the January 6th committee members for destroying evidence. \"Trust me - a LOT of people did not get a pardon that were involved in the select committee. They ought to be keeping an eye on their mailbox...",
        "score": 1288,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look, ALL the Pardons are INVALID. Biden was NOT the duly elected President. He was RIGGED into power by the C.I.A. Investigate and prosecute the 2020 coup d'etat. Prove the mass election fraud and prosecute ALL the conspirators. Start with Gina Haspel and Mark Milley and work your way down.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "TWO",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "Should only take a fortnight.",
                "author": "Eyepatch_McCain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "List of states where illegals can get licenses. Pull federal funding until they change their laws. This is a major national security risk.",
        "score": 1603,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do which states automatically register you to vote when you get a driver's license",
                "author": "chede"
            },
            {
                "raw_content": "Understand that once an illegal gets a license in one state, they can use that license to get a drivers license in any other state because of reciprocity. There is an agreement with all states that says if you get a DL in Vermont, that it is valid if you are driving in Texas. The states that issue DL to illegals should lose their reciprocity immediately making it illegal to drive any where but their home state.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "https://x.com/EndWokeness/status/1957093339263586536 **4 of these states have a Republican Governor** - Nevada - Governor Joe Lombardo - Utah - Governor Spencer Cox - Vermont - Governor Phil Scott - Virgina - Governor Glenn Youngkin",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zelensky claims that the Ukrainian constitution doesn’t allow him to give up Ukrainian land. Another way to say it would be: “Our constitution doesn’t allow us to admit we lost a war, therefore we will continue to die.”",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suspending Voting. Arresting opposition. Kidnapping teens and old men off the streets... is all that in the Constitution.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "You didn't give up shit ----- it was taken from you. Keep fucking around and all of it will be taken from you.",
                "author": "cyberrigger"
            },
            {
                "raw_content": "Meanwhile his elected term expired over a year ago but he refuses to leave office or allow another election. Literally a dictator by definition.",
                "author": "MisterMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Barrack Obama; Gavin Newsome- CA; Pritzker IL and NOW - Liberals ALL Over The Streets of Chicago IL - Rallying the Texas Democrat Runaways Holding Up Redistricting. __Meanwhile - Gov Abbott, Lt Gov Dan Patrick - RINO's In Texas - Sit On Their Hands - _ RED TEXAS Has The Power to ADD 9 Seats",
        "score": 870,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shitcago has bigger problems to deal with, like violent crimes, yet they are brainwashed into doing this dumb shit.",
                "author": "Dev404"
            },
            {
                "raw_content": "MAGA TEXAS Warriors- We KNOW You are Fighting Tooth & Nail! TX Attorney General Ken Paxton Fighting like a DOG! Entire MAGA USA & President Trump are 10,000% Behind YOU! Keep Fighting! HOLD Your RINO State Reps & Senators Accountable to YOU! YOU have put in Blood, Sweat & Tears! Don't Let The RINO's Lose This. WEF- CCP Watching each step",
                "author": "KMOB"
            },
            {
                "raw_content": "At a very minimum they can make the bargaining chip 9 seats instead of 5. Also the whole quorum rule makes no sense at all. It should only exist to prevent secret votes from taking place without advance notice....if you choose to not show up, you lose your vote.",
                "author": "texas4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kathy Hochul Literally Pardoned a Convicted Killer to Protect Him from Deportation",
        "score": 777,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Governors can grant pardons for state crimes. Illegally entering the country is a Federal crime. If ICE catches the guy, he’s outta here.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "“Hochul pardoned Somchith Vatthanavong, a 52-year-old illegal immigrant who was convicted as a teenager of killing a man in a Brooklyn pool hall.” But if you’re an American citizen, we’ll put you in jail for life.",
                "author": "Trump454748"
            },
            {
                "raw_content": "Tar and feather?",
                "author": "Websitesdown"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newsom: How Dare Texas Reduce Gerrymandering!",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not an expert but they don't look much different.",
                "author": "Coprolite"
            },
            {
                "raw_content": "Feckless republicans in Texas. The republicans in oregon tried this ya know what they did the immediately passed a law that if you deliberately leave or don’t show up to get decorum you are no longer able to hold elected office. Democrats are killing us on this shot it’s ridiculous!",
                "author": "Beaverstatemilitia"
            },
            {
                "raw_content": "> Maps: > > https://redistricting.capitol.texas.gov/ > > https://dvr.capitol.texas.gov/ Note District 33 near Dallas, and Districts 9, 18, and 29 near Houston",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former FBI director James Comey posts bizarre video revealing how he idolizes Taylor Swift & uses her music to cope with the Trump Presidency",
        "score": 560,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a queer.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "James Comey is a Faggot Beta Male",
                "author": "Moebius"
            },
            {
                "raw_content": "Democrats are fucking weird.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Report: 75% of the homeless camps in D.C. have been cleared out so far in accordance with President Trump's executive order Via: The New York Post",
        "score": 1070,
        "text_content": "",
        "comments": [
            {
                "raw_content": "send them to Martha's Vinyard",
                "author": "cyberwar"
            },
            {
                "raw_content": "Free bus tickets to New York City!",
                "author": "fadelio"
            },
            {
                "raw_content": "Where are they being put?",
                "author": "TheImpossible1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fixed it",
        "score": 516,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He better shut his mouth before a bird builds a nest in there.",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "2030 Census Rigging Act *",
                "author": "McFatty7"
            },
            {
                "raw_content": "\"The most extensive and inclusive voter fraud organization in the history of politics.\"",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You are a Tax Slave",
        "score": 763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the alternative?",
                "author": "kippo_hard"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Learn to live free in an unfree world",
                "author": "RedSoxPiIled"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus - Special Report] THE NVIDIA AI GPU BLACK MARKET | Investigating Smuggling, Corruption, & Governments",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Steve: We want 48 GB 4090 Chad: Sure, we can make it right now! Nvidia: \"surprise pikachu face\"",
                "author": "suraj_69"
            },
            {
                "raw_content": "Can you believe this crusade all started because Nvidia asked Steve to include MFG benchmark in his review videos.",
                "author": "hsien88"
            },
            {
                "raw_content": "Wow it’s finally out! Thanks Steve.",
                "author": "jerrylzy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hardware Canucks - The Subtle Sabotage of AMD Gaming Laptops",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe things have changed within the past 12 months but AMD has had a long history of failing to provide laptop manufacturers with contractually guaranteed high volumes of its most performant chips. According to Ian Cutress this was due to a lack of cashflow combined with the fact that they were low margin parts for AMD after TSMC took its considerable cut. How does this impact who gets a vapor chamber and cool features and who doesn't? Economies of scale is the key aspect to consider. If you have a contractual guarantee for x million of chips from Intel, you simply can calculate the bill of goods that goes into a laptop completely differently. A production line for the custom vapor chamber has to be set up and financed. How much that costs per unit depends on how many units you sell etc. Meanwhile the lower unit AMD laptop gets the heatpipes off the shelve. I don't see collusion or foul play on the laptop market until AMD can actually provide the same guaranteed delivery volumes as Intel",
                "author": "constantlymat"
            },
            {
                "raw_content": "One small correction when he says that Asus is running a ton of juice into the Intel laptop. From other reviews we know that at 140w setting the 9955 uses 20-30w more than the 275. So Asus is probably running them at the same power.",
                "author": "Bananoflouda"
            },
            {
                "raw_content": "The limitations are real... Capped at 5070Ti, older thermal solutions, older components, etc.",
                "author": "AnechoidalChamber"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] Ryzen 7 9800X3D vs. Core i9-14900K: Who's Really Faster For Battlefield 6?",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: - 9800X3D is roughly 30% faster on average - 14900k consumes 120% more power (~220w vs ~95w) - 1% lows are slightly closer but 9800X3D still ahead by up to ~20% - People that claim their overclock can get them to match the 9800X3D are talking outta their arse",
                "author": "Comprehensive_Ad8006"
            },
            {
                "raw_content": "In the test the 9800X3D was around 30% faster than the 14900K, but was struck me was the power usage: 9800X3D around 90 W while the 14900K around 210 W.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "tl;dw The 9800X3D is much faster and much more efficient for playing BF6.",
                "author": "GhostsinGlass"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Heracles Attack - AMD Secure Environment Virtualization bypass",
        "score": 24,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "You Can Save This 1980’s Hard Drive!",
        "score": 1,
        "text_content": "(Yes, this video does have hardware in it.)",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "New state-of-the-art quantum computer switched on in Harwell",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"It's just a switch 1 pro\" 🤡",
        "score": 330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is this game?",
                "author": "Dicklefart"
            },
            {
                "raw_content": "I mean it is, but that’s not a bad thing. It’s what a lot of us wanted. A bigger more powerful switch :)",
                "author": "HuckFinn98"
            },
            {
                "raw_content": "Why are the people on this sub so defensive? The console is a success and you’re enjoying it, just play your console.",
                "author": "Grace_Omega"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "$400 off of FB Marketplace",
        "score": 230,
        "text_content": "I wasn’t planning on getting a S2 until that new Splatoon spin-off came out. But I’ve been on FB marketplace looking for furniture recently. One thing led to another and here we are. Brand new Switch 2, screen protector, hard shell case, and DK Banza brand new.",
        "comments": [
            {
                "raw_content": "Did the Powerade come with it?",
                "author": "Williekins"
            },
            {
                "raw_content": "Good thing they threw in the quarter bottle of Powerade otherwise I would say it’s a ripoff",
                "author": "stoneage91"
            },
            {
                "raw_content": "Someone's got some recycling to do.",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thoughts on Madden 26",
        "score": 58,
        "text_content": "So I’ve played a handful of games in Madden 26 on Switch 2. Pretty mixed thoughts: - Graphically it’s a huge step up from the FIFA/FC games on Switch. - Framerate is pretty stable but I do agree that 30 fps isn’t great for gameplay. - Resolutions actually seem pretty low and inconsistent. Does not appear to be 1080 and some random screens/elements look very fuzzy. - I do suspect there’s some input lag, especially for moves on the run with the ball and for tackling. - It is sucking down battery like crazy. I think I’m barely getting through 2 6-min quarter games on a full charge. These thoughts are from someone who has played 250+ hours combined of EA soccer titled on Switch and has played a significant amount of Madden on PlayStation, all of which has typically been quick play modes vs. the CPU. I think any casual player could enjoy this Switch 2 version of Madden a lot. It’s still one of the better sports titles I’ve played across the platform. That said, I still believe PlayStation Portal is still a significantly better experience for handheld Madden right now. Not my favorite $70 I’ve spent on games, but I’ll try to get some use out of it. Definitely hopeful for more updates.",
        "comments": [
            {
                "raw_content": "I'm glad the Switch 2 is getting these games and it's at least an improvement thanks to more horsepower.....but you can tell EA's mantra has always been to get a minimum viable product out on store shelves. If you're a football fan and all you have is a Switch 2, you have to take what you can get, which sucks. Wish the NFL would wise up and let other devs compete with EA. It's not that hard to make a better game than any Madden in the last 15 years.",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "The stuttering is making the game look so awful, I hope they'll address this if they plan to update it. I was thinking about getting it... but I'll wait for a sale. A game that is shuttering isn't worth $70 at the moment. Appreciate it for sharing the video and your thoughts!",
                "author": "RY-R1"
            },
            {
                "raw_content": "I usually buy Madden every few years for PS4/PS5. I was very excited when I learned 26 was coming to Switch 2 since I was probably going to get it this year (especially as an Eagles fan). I regretted the purchase almost immediately. It does not run well and it does not feel good. The game stutters every single time a camera angle changes. Menus take forever to load. When it comes to actual gameplay the low frame rate makes the already delayed inputs feel even worse. The commentary is regularly 5 seconds behind what's actually happening (you're already selecting the next play and they're still talking as if it's happening on the field). The last Madden I purchased was 23 for the PS5 and while not perfect, felt good enough that I'd play a few games a week during football season. I got through a single half of Madden 26 then turned it off and accepted i wasted $70. At least I didn't pay extra to play it early",
                "author": "Leapingforjoyandstuf"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Expectations for GamesCom 2025?",
        "score": 12,
        "text_content": "Are we expecting release dates? Shadow drops? Announcements? Or will Nintendo save those for a September direct?",
        "comments": [
            {
                "raw_content": "I feel like they'll save anything big for a direct. They rarely announce things at events like these anymore.",
                "author": "Williekins"
            },
            {
                "raw_content": "I expect nothing, I hope for something.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Probably not much or nothing, most announcements will be 3rd party focused A September Direct is more likely since Nintendo prefers to announce things at their own events/pacing",
                "author": "reevestussi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The obsession with the technical aspects of games now…",
        "score": 182,
        "text_content": "Is out of control from my perspective. FPS, var, frequency/hz, dlss etc…… Reviews and message boards now spend as much time - maybe more - talking about these aspects than the actual games. It’s become an absolute obsession - it’s like being conditioned that games are basically bad if they aren’t 60fps, 4k etc…. I get we all want games to be optimised as much as they can be but there’s a tipping point for me. It’s beginning to waste gaming a bit - just constant negativity irrespective of the quality of the actual game.",
        "comments": [
            {
                "raw_content": "I mean. The singular, entire purpose of the Switch 2 is being a more powerful Switch. That is to say, games look and run better on it. There literally is no other point. If most games run the same and look worse, that completely defeats the point of there even being a Switch 2 in the first place.",
                "author": "Answerofduty"
            },
            {
                "raw_content": "I agree to a point. If performance is bad enough, it can have a huge impact on the game experience. Scarlet/Violet, for example, are pretty inexcusable on Switch 1.",
                "author": "TD1215"
            },
            {
                "raw_content": "I just want fun games occasional frame dips don't bother me nor does the resolution of the game like I still play older console games on original hardware and still have a blast",
                "author": "CSBreak"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Case Dock Only",
        "score": 4,
        "text_content": "I recently went on a trip where I flew with my switch 2 and realized I needed a way to transport the dock without it breaking. The dock seems pretty forgiving, but jostling it around seems like a bad recipe for success long term. For this trip, I wrapped a PS4 game case in a t-shirt until sliding the case into the switch slot was snug. This seems to have worked, but I also carried my bag on and was gentle. Which leads me to what I’m looking for. If I wanted to check the switch dock with ease of mind, is there a dock only case out there somewhere? In this use case, you can’t check the switch because of the battery (and why would you when you can play switch while flying?) but the all in one cases/carrying the dock in a backpack is tedious and bulky. I would love to be able to check my bag with the switch case with peace of mind. Any thoughts?",
        "comments": [
            {
                "raw_content": "I was thinking about the same thing. I don’t always want to travel with the dock, and I already have a nice slim case for the console itself. A case that could carry the dock, power brick, hdmi and a pro controller would be ideal. Might need to make something myself with a generic case",
                "author": "spruegoo"
            },
            {
                "raw_content": "I don't know of one but what you described with the PS4 case works well enough imo. Just then wrap the dock itself in something thick like a hoodie or bubblewrap if you wanna be extra safe. The dock is pretty sturdy, if it broke it would probably only be the front panel anyway which you don't *need* for it to function.",
                "author": "ohmygodnewjeans"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has anyone figured out why Switch 2 gets so hot in the dock when in sleep mode?",
        "score": 63,
        "text_content": "I just removed my Switch 2 from the dock after it was asleep (and fully charged) for several hours,and it's noticeably warm. This is not a new occurrence, it's been doing this for 2 months now. I understand there's the whole \"Ethernet connected in sleep mode\" but that doesn't seem like enough to justify this level of heat output, especially compared to other modern electronics. I leave my laptop on without sleep mode wired to Ethernet, and it never heats up, and neither does my phone. For all the talk about air vents in the Switch 2 dock allowing air flow, and the 3rd party dock not having air vents, it seems the vents on the Switch 2 dock aren't doing much for air flow if removing a Switch 2 asleep for hours still results in a very warm console.",
        "comments": [
            {
                "raw_content": "I had the same issue when using ethernet. After I disabled \"Keep Wired Connection Active in Sleep Mode\", everything went back to normal.",
                "author": "Vertigo3765"
            },
            {
                "raw_content": "You are right, the Ethernet (wired connection) in sleep mode does not justify the level of heat output, but it is exactly what it is. Turn that option off and the console will be in true sleep mode, not generating any heat at all. Your newly acquired games via Nintendo eShop website will not be automatically downloaded until you wake it up next time when this option is turned off. Nintendo ought to fix this issue in future firmware update, but it’s everyone’s guess when or if they ever will at all.",
                "author": "ghim7"
            },
            {
                "raw_content": "It's a glitch with ethernet connectivity. If ethernet is disconnected it'll sleep perfectly fine without any heat. If it's connected it'll heat up because reasons.",
                "author": "nater416"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rocket League is rumored to be ported to Fortnite in the future.",
        "score": 112,
        "text_content": "[Source](https://xcancel.com/blortzen/status/1957185753064087727) *\"RUMOR: Rocket League port to Fortnite?? (Ok, it sounds weird and fake, but just let me explain* *- This info was said by the playtester who leaked 4-5 upcoming seasons, but this leak was kept hidden for a while (also, they said something about \"Rocket Racing overhaul\")* *- On December 19th, an upcoming mode, codenamed \"RL\" was added alongside Rocket Racing (Codenamed \"RR\"), this new mode will have Octane stuff as default.* *- Some updates ago, a string leaked that the top hat accessories from Rocket League would be coming to Fortnite (string is literally \"Dealership Hats\")* *- Some weeks ago, I heard about this rumor again from a source that has got a lot of collabs right, but still, a rumor* *-* [*And now, Loolo leaked an upcoming \"Dealership\"*](https://xcancel.com/Loolo_WRLD/status/1956791938180600273) *(though, this may not be related becausc Rocket League has a garage.* *Even if I don't see it as something possible (because porting a whole game onto Fortnite sounds weird) but a lot of stuff hints for it to happen.* *Again, it's just a rumor, A RUMOR that I don't believe, but I feel everyone should know.\"*",
        "comments": [
            {
                "raw_content": "I still can’t believe Epic bought psyonix, made the developers make a rocket league racing game and then put it in…Fortnite, instead of rocket league itself. Epic’s treatment of rocket league as a whole has been so bizarre and the community morale is just at an all-time low",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "This might finally achieve Epics goal of killing off rocket league",
                "author": "TOP-IS-LIFE"
            },
            {
                "raw_content": "\"we want rocket league ue5\" *monkeys paw curls*",
                "author": "SupDos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Ops 7 will be $70 at launch",
        "score": 340,
        "text_content": "https://xcancel.com/billbil_kun/status/1957017550044168449 So basically when Microsoft announced $80 games back earlier this year it was a PR disaster that didn't even come to fruition.",
        "comments": [
            {
                "raw_content": "They were insane for thinking Outer Worlds 2 of all games should have been the one to start the $80 shift. Nintendo was able to mostly get away with it because they did it on fucking Mario Kart. The only other game I could see pulling something like that and people still buying it in droves is GTA",
                "author": "Traitor_To_Heaven"
            },
            {
                "raw_content": "Pre-orders for the Outer Worlds 2 must've been damn near zero.",
                "author": "nicknp16"
            },
            {
                "raw_content": "Feel like we knew that already? >[In a statement, a Microsoft spokesperson said Xbox was \"focused on bringing players incredible worlds to explore, and will keep our full priced holiday releases, including The Outer Worlds 2, at $69.99, in line with current market conditions.\"](https://www.gamesindustry.biz/microsoft-reverses-80-first-party-price-hike-to-keep-full-priced-holiday-releases-in-line-with-current-conditions) \"Full priced holiday releases, including The Outer Worlds 2\" seems pretty cut and dry they were giving up on anything being $80 this year",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: 16 total 6v6 maps for BO7. 13 Original maps, 3 remasters from BO2. 2 additional large scale maps for their skirmish mode.",
        "score": 78,
        "text_content": "https://xcancel.com/theghostofhope/status/1957173644649488771?s=46",
        "comments": [
            {
                "raw_content": "BO6 only had 12 6v6 maps at launch and some of them stank so so bad. Hopefully the BO7 ones are better",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "so I got scammed out of black ops 6?",
                "author": "lukas-bruh"
            },
            {
                "raw_content": "I have so much hope for cod this year. It’s a weird feeling. Every leak has been positive",
                "author": "JaradSage"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Potential Spoilers] TheGhostOfHope has revealed BO7's playable Campaign characters",
        "score": 114,
        "text_content": "https://xcancel.com/TheGhostOfHope/status/1957124861173678175#m",
        "comments": [
            {
                "raw_content": "How the fuck is Harper AND Karma alive at the same time? For one to live the other had to die",
                "author": "keyblaster52"
            },
            {
                "raw_content": "At least with>! harper!< alive that confirms a canon ending for BO2",
                "author": "Dpingthroughlife"
            },
            {
                "raw_content": "So no muted protagonist anymore? Rare Treyarch W these days?",
                "author": "JjoyBboy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA plans to make Battlefield an annual franchise",
        "score": 160,
        "text_content": "https://xcancel.com/charlieINTEL/status/1957081561439879570 Industry analyst Michael Patcher claims Battlefield GM told him they plan to have a yearly Battlefield game release, but it'll probably take 5 years before that happens \"Their goal is 3 studios making Battlefield on a 3-year basis, so they can get to Battlefield annually\" Edit: [Former DICE dev months ago also claimed this was the goal](https://bsky.app/profile/rizible.bsky.social/post/3lfysleqdpb2g)",
        "comments": [
            {
                "raw_content": "Didn't he JUST backtrack about fairgame?",
                "author": "Laughing__Man_"
            },
            {
                "raw_content": "Just for fun, can we have Pachter as a Tier 7 leaker?",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Pachter said it which means the next Battlefield will release in 2031.",
                "author": "Elegant_Shop_3457"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Bartlett Lake-S 12 P-Core silicon steppings confirmed, still no sign of consumer variant",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would love a consumer variant with AVX-512 and would buy one in a heartbeat, but I’m not expecting to see it.",
                "author": "CharcoalGreyWolf"
            },
            {
                "raw_content": "I would love one of these. My 12900KS still serves me fine and will for the far future, but it would be a nice backup chip or even a mini homeserver chip. 12p cores, spread across several vms for several server related tasks out of your own home. My dream.",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "Intel needs to man up and drop this shit immediately",
                "author": "No_Meal_487"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "25 years ago today, the first ever ATI Radeon GPU was reviewed",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a ride it has been. 3850 4890 crossfire 5970 6700 XT",
                "author": "2literpopcorn"
            },
            {
                "raw_content": "I miss Ruby",
                "author": "techtimee"
            },
            {
                "raw_content": "Playing morrowind on a 9500 Pro was peak.",
                "author": "06035"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen 7 9800X3D vs. Core i9-14900K: Who's Really Faster For Battlefield 6?",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the 9800X3D and it's not all that close either",
                "author": "CMDR_omnicognate"
            },
            {
                "raw_content": "I don’t even have to watch the video to know the answer",
                "author": "Spoksparkare"
            },
            {
                "raw_content": "HUB has to retest the shyt out of CPUs to prove the obvious fact. What a time to live in. Some people can't just admit that Intel lost",
                "author": "Reclusives"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New build!",
        "score": 17,
        "text_content": "7800X3D + 5080",
        "comments": [
            {
                "raw_content": "Sick build! I see that you're rocking with the Montech King 95 Pro for your case. I'm planning to get one soon so I would like to know your experience building with it.",
                "author": "TyranWolf"
            },
            {
                "raw_content": "Not a fan of fish tank cases (I've dropped enough glass panels with my butter fingers), but I think the set up is quite aesthetically pleasing. I like the color coordination.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Looks cool mate :)",
                "author": "T_TChaos"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The Subtle Sabotage of AMD Gaming Laptops",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a well reasoned and argued video, but he does dance around the fact that Intel has had predatory and anti-competitive agreements with OEMs for decades. The findings are framed as a surprise, but it's been well known forever.",
                "author": "got-trunks"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "For anyone wondering: 256gb DDR5 4x64 works on Ryzen 7950x + Asus Crosshair X670e Hero (Bios v3205)",
        "score": 4,
        "text_content": "I had no idea if I could pull it off on my system so I was ready to buy a new cpu+mobo just in case, but it went smoother than I thought it would. Bios detected the full RAM instantly upon boot (cmos cleared to default before updating bios and inserting the sticks). Expo settings are a no-go, max speed it runs fully stable with memory testing is 4800. I'm fine with that as it doesn't affect my workflow speed much and I need as much memory as possible. Here is the kit I bought if anyone else is thinking about it: https://www.newegg.ca/g-skill-trident-z5-neo-rgb-series-256gb-4-x-64gb-ddr5-6000-pc5-48000-cas-latency-cl34-desktop-memory-black/p/N82E16820374765?Item=N82E16820374765 Still thinking of upgrading to 9950X3D but might wait to see what new chips AMD got up their sleeve",
        "comments": [
            {
                "raw_content": "Getting it to run as high as 4800MT/s off the hop seems like it may be rather lucky, cheers and best of further luck!",
                "author": "Kiseido"
            },
            {
                "raw_content": "The review in the flare set have two users that were able to get them to run at the native 6000 Mhz, one suggested switching ram slots to get them to work. These are essentially the same set with different heatsinks.",
                "author": "bostonfever"
            },
            {
                "raw_content": "How exactly did you test the stability?",
                "author": "luuuuuku"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Apartment rents drop in July as vacancies move to multiyear high",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vacancies at multi-year highs yet rents also at record highs. Make it make sense",
                "author": "MyOilSpill"
            },
            {
                "raw_content": "Very simple: people are moving in together and sharing spaces. Prices became just too high. For the time being, this is effective to combat this inflation. Long term, it’s not the solution. When or if we ever have a better jobs economy (not holding my breath), I expect people will once again see wage growth that helps them “launch” out on their own. Speaking mainly for 20-something’s, generally.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "I thought Austin was the next coming of Jesus",
                "author": "driftingwood2018"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Where are housing prices least unaffordable?",
        "score": 19,
        "text_content": "In which countries, cities, regions is a basic home most affordable for the median Joe that's not in the middle of uninhabited wilderness or job deserts? I don't know why this bubble is so global but some countries and places are definitely worse than others. What are these places doing right to keep housing affordable?",
        "comments": [
            {
                "raw_content": "Bad areas. For example some of the worst neighborhoods in Philly have homes for available for $50k or less.",
                "author": "harbison215"
            },
            {
                "raw_content": "Place most people don’t want to live, supply and demand also works in real estate",
                "author": "BlazinAzn38"
            },
            {
                "raw_content": "Coast of Somalia",
                "author": "PictureDue3878"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"AI Is Designing Bizarre New Physics Experiments That Actually Work\"",
        "score": 751,
        "text_content": "May be paywalled for some. Mine wasn't: [https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/](https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/) \"First, they gave the AI all the components and devices that could be mixed and matched to construct an arbitrarily complicated interferometer. The AI started off unconstrained. It could design a detector that spanned hundreds of kilometers and had thousands of elements, such as lenses, mirrors, and lasers. Initially, the AI’s designs seemed outlandish. “The outputs that the thing was giving us were really not comprehensible by people,” Adhikari said. “They were too complicated, and they looked like alien things or AI things. Just nothing that a human being would make, because it had no sense of symmetry, beauty, anything. It was just a mess.” The researchers figured out how to clean up the AI’s outputs to produce interpretable ideas. Even so, the researchers were befuddled by the AI’s design. “If my students had tried to give me this thing, I would have said, ‘No, no, that’s ridiculous,’” Adhikari said. But the design was clearly effective. It took months of effort to understand [what the AI was doing](https://arxiv.org/abs/2312.04258). It turned out that the machine had used a counterintuitive trick to achieve its goals. It added an additional three-kilometer-long ring between the main interferometer and the detector to circulate the light before it exited the interferometer’s arms. Adhikari’s team realized that the AI was probably using some esoteric theoretical principles that Russian physicists had identified decades ago to reduce quantum mechanical noise. No one had ever pursued those ideas experimentally. “It takes a lot to think this far outside of the accepted solution,” Adhikari said. “We really needed the AI.”\"",
        "comments": [
            {
                "raw_content": "The [linked paper](https://arxiv.org/abs/2312.04258) might be richer.",
                "author": "Adeldor"
            },
            {
                "raw_content": "So AI was able to read all of the papers associated with the topic, find a report others overlooked and incorporate into a new solution. Humans are garbage at filtering through so much data - AI is built for it.",
                "author": "angrycanuck"
            },
            {
                "raw_content": "2025 paper [https://journals.aps.org/prx/abstract/10.1103/PhysRevX.15.021012](https://journals.aps.org/prx/abstract/10.1103/PhysRevX.15.021012)",
                "author": "i_am_Misha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Computing power per region over time",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US amount will be more than double that by next year if there aren’t any major setbacks.",
                "author": "modularpeak2552"
            },
            {
                "raw_content": "Woah, if this is true, I didn't think the US was that far ahead.",
                "author": "iwantxmax"
            },
            {
                "raw_content": "We still need to catch up to China on energy though",
                "author": "TurnUpThe4D3D3D3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "100m humanoid champion",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool",
                "author": "RedErin"
            },
            {
                "raw_content": "And how quickly will they run 100m under 3 seconds, and less? In next 10 years?",
                "author": "Worth-Boysenberry-93"
            },
            {
                "raw_content": "It seems that the reason the robot cannot run faster is because of maintaining balance. It looks like it doesn't have toes, but if it made toes it would be able to run faster.",
                "author": "smallandnormal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is Meta the only big company working on alternatives to transformers?",
        "score": 122,
        "text_content": "They're working on Joint Embedding Prediction Architecture and Large Concept Models, which I find extremely commendable, as I've never heard of any other major AI lab doing anything other than improving LLMs. JEPA is essentially Yann LeCun's vision of what an AI should be like to understand the world, and it's fascinating because it works by predicting embeddings instead of tokens. JEPA would only be wrong if his world model was wrong, he couldn't hallucinate like LLMs do, besides being able to play chess, which not even o3 can do. Everyone's rooting against Zuck, but I'm rooting for them to overcome this LLM wave.",
        "comments": [
            {
                "raw_content": "I will put a H200 on the table to say that all of these companies are obviously working on the limitations of transformers. For obvious reasons they are tight lipped and do not disclose.",
                "author": "swiftninja_"
            },
            {
                "raw_content": "Supposedly Ilya Sutskever’s company, SSI (Safe Super intelligence), is working primarily on “post-transformer architecture,” at least according to an interview with him from a while ago.",
                "author": "churningaccount"
            },
            {
                "raw_content": "Iirc. Google is working on something they call \"Titans\" as an alternative to transformers.",
                "author": "UnnamedPlayerXY"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How CATL Made Batteries 90% Cheaper (breakthrough in sodium metal chemistry, $10 / KwH)",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm from Quebec where the government invested lots of money to produce batteries locally... It failed miserably and quickly, but it was very obvious that nobody could compete with China on battery manufacturing.",
                "author": "Microtom_"
            },
            {
                "raw_content": "W",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "As soon as I can buy them here in the U.S. at that price, I'll believe it.",
                "author": "PilotKnob"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do you think sex robots and AI will replace the pornography industry?",
        "score": 774,
        "text_content": "",
        "comments": [
            {
                "raw_content": "replace? you mean the industry will be the ones to supply it",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "It is kind of inevitable",
                "author": "Boogertwilliams"
            },
            {
                "raw_content": "There are definitely some niches that will be more impacted than others. Fanfiction already has a major competitor in chatbots/AI roleplay and I honestly see traditional human-written erotica becoming something of a boutique/premium product. Interactivity and customisation is key. Who gives a shit if a picture of some tits are real or AI generated? The point is being able to tailor make it to your specific flavour of freak. Fetish scenes will probably see a more significant shift than vanilla content.",
                "author": "dandelionii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Visual Reasoning and Tool Use Double GPT-5's Arc-AGI-2 Success Rate",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's cool to see people improving performance on the ARC benchmark, but to me it's more interesting to see LLMs solve ARC problems with no special training or instruction, just like a human.",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "Impressive, but subtle note. > I achieved a 22% score on ARC-AGI-2's evaluation dataset in initial testing of 40 sample problems, which needs more investigation but represents a significant improvement over the current AI state-of-the-art of 15.9% Sota is [23%](https://www.kaggle.com/competitions/arc-prize-2025/leaderboard)",
                "author": "meister2983"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gpt-5 Took 6470 Steps to finish pokemon Red compared to 18,184 of o3 and 68,000 for Gemini and 35,000 for Claude",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would be nice to also have the total cost for each one",
                "author": "LucasFrankeRC"
            },
            {
                "raw_content": "You can only directly compare o3 and GPT-5. Gemini used a different harness. I wasn't aware a Claude model has finished a Pokemon game. GPT-5 is clearly a big improvement over o3, I've noticed it watching the streams, and chatting.",
                "author": "Atomic258"
            },
            {
                "raw_content": "Did OpenAI make this chart? The numbers are all wrong. Claude has never completed a Pokemon game. Even Claude 4 Opus failed. Gemini 2.5 Pro's record is ~37k steps, not 68k. Model | Success? | Steps | Hours | Version ---|---|----|----|----| Claude 3.5 Sonnet | No | | Claude 3.7 Sonnet | No | | Claude Opus 4 | No | | Gemini 2.5 Pro 0325 | Yes | 106,505 | 813 | Blue Gemini 2.5 Pro 0506 | Yes | 36,804| 406.5 | Blue o3 | Yes | 18,181 | 388.5 | Red o3 | Yes | 13,373 | 237.5 | Red o3 | Yes | 27,040 | 506 | Crystal GPT-5 | Yes | 6,740 | 162 | Red GPT-5 | [Ongoing](https://www.twitch.tv/gpt_plays_pokemon) | 890 | 16 | Crystal Claude Opus 4.1 | [Ongoing](https://www.twitch.tv/claudeplayspokemon) | 42,457 | NA | Red (?) Gemini 2.5 Pro 0605 | [Ongoing](https://www.twitch.tv/gemini_plays_pokemon) | 150,475 | 1550 | Yellow Legacy (Hard Mode)",
                "author": "Hemingbird"
            }
        ],
        "subreddit": "singularity"
    }
]