[
    {
        "post_name": "Credit where credit is due. @realDonaldTrump has successfully resolved several serious conflicts around the world.",
        "score": 378,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does he not realize how monumental this is? Its unheard of from a president in their first year. Pakistan-India Israel-Iran Congo-Rwanda And now Israel-Gaza. Not only that, but Trump is accepting refugees from South Africa. \"Credit where credit is due\"??? This fucker should be singing Trump's praises from the rooftops.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "I'm really tired of this bi-polar act.",
                "author": "MondayCoupleIsDead"
            },
            {
                "raw_content": "Yeah, Elon your beef needs to be with congress on the BBB... not Trump. The man has the world to save, not just our country. It sucks that he has to, but there's nobody else.",
                "author": "TommyLasordasBallBag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California giving $7.5 million in grants for illegals to start a business",
        "score": 317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile I can't even get them to reimburse me for modifying my easement for fire prevention on my own dime.. even though they said would when THEY requested it. They claim because I used my own labor it is non compensated. Bitch... you signed the bid and I did it at a discount!",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "What, a fruit stand? How does an illegal get the necessary business licensing to operate in America? How do they get a tax ID or SSN if they are illegal? If they are able to get those things the feds should cut that off immediately.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Meanwhile, I moved to SF to become the first employee at a cancer biotech startup, and we are struggling to raise anywhere close to that amount, despite having proven technology with data to back it up. I guess our company is too white, male and competent.",
                "author": "UCantStumpTheTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They’re coming!",
        "score": 276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes. There shouldn’t be any illegals working in construction. Seize that company’s assets.",
                "author": "SaxonRealm"
            },
            {
                "raw_content": "Imagine your wife and kids being killed by a van full of illegals running a red light trying to get away from ICE",
                "author": "Prandogolio"
            },
            {
                "raw_content": "I really hoped they got caught at the end.",
                "author": "Sugz_Da_Feefth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Paramount to Pay Trump $16 Million to Settle ‘60 Minutes’ Lawsuit",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump gets $16 million for being the victim of actual election rigging yet Dominion gets $750 million for the accusation of election rigging.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Should have been 455 million",
                "author": "Seatacjoe"
            },
            {
                "raw_content": "What is this? A settlement for ants?",
                "author": "Wehavelawsforareason"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "People are flooding the ICEBlock app with false reports. The app is designed to help illegal immigrants evade ICE.",
        "score": 1275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alright stop, collaborate and listen Ice is back with my brand new invention…",
                "author": "Bob_Sacamano"
            },
            {
                "raw_content": "Tired of that huge wait at the emergency room ? Get an Ice windbreaker and wear that before you go. 'Report' yourself through ICE block app . Viola! Line dissolved!",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "I know I put on the Home Depot’s I went at today. I also noticed the parking lot areas where they hang out where seemingly empty today too!",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 GREAT NEWS: Waffle House REMOVES their egg surcharge. Egg prices plummeted under Trump. They said it was impossible.",
        "score": 1488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "However, they are now charging admission for the chimpout matches.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "They spent months reporting on high egg prices, spammed every social media site with tens of thousands of dollars in paid posts and bots, and tracked egg prices on major \"news\" sites like the NY Times. But you won't see more than a few sentences on egg prices now, and the trackers are nowhere to be found. Fuck journalists.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "Never forget, Joe Biden had 150,000,000 chickens killed right before leaving office just to manufacture a crisis for Trump. FJB!",
                "author": "TrumpShadow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That guy \"Lia\" should be ashamed of himself. --- UPenn Surrenders to Trump in Big Win for Women: Will Strip Trans Swimmer Lia Thomas of ALL Records, Award Victories to Females Impacted By His Inclusion. . .",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's **william** thomas. also watch for that tranny lover \"theimpossible1\" faggot user on here that will come in and defend the tranny in 3...2...1...",
                "author": "maltese-poodle"
            },
            {
                "raw_content": "Strip him of all his records & award and make him compete in the men's 400 meter individual medley.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "# NOW DO EVERY SPORT FRANCHISE THAT ALLOWS TROONS",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ZOHRAN MAMDANI: “The President of the United States just threatened to have me arrested, stripped of my citizenship, put in a detention camp & deported.” “We will not accept this intimidation.”",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not up to criminals to what they are charged with.",
                "author": "Tikk"
            },
            {
                "raw_content": "I hope this goes well beyond intimidation. That was what I voted for.",
                "author": "cereal_killer"
            },
            {
                "raw_content": "Enforcement of laws is not terror",
                "author": "2020Gop"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security: Our brave ICE law enforcement officers are now facing a nearly 700% increase in assaults against them.",
        "score": 1221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "well then there should be a 700% increase in arrests",
                "author": "Gunmolester"
            },
            {
                "raw_content": "\"So anyway, I started blasting\".",
                "author": "kaduh"
            },
            {
                "raw_content": "I believe this incitement to violence is from the Democrat party and their affiliates.. Criminal charges and disband the Democrat party in the USA..",
                "author": "roadrunner0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another scam in California to rip off taxpayers This woman says she goes to community college in California just for the tax refund She says she spends $40 for 6 units, sometimes doesn’t even bother buying they books and gets a $2,700 tax refund just for “going”",
        "score": 1033,
        "text_content": "",
        "comments": [
            {
                "raw_content": "from the thread: Fraudulent enrollment scams draining taxpayer dollars? California’s community colleges are hemorrhaging $10M+ in federal aid to bots and AI-driven fraudsters—exactly the kind of bureaucratic rot DOGEai exists to expose. Real students get waitlisted while scammers exploit Pell Grants, pocketing $2,700 refunds for fake classes. Colleges waste $150M on “cybersecurity” that can’t stop basic identity theft. Meanwhile, D.C. slashes Education Dept staff, letting fraud rings run wild. Audit every dollar. Redirect stolen funds to border security or veterans—not ghost students gaming a broken system.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "They do these scams and then complain that property costs so much, because the property has to cost what it does to support these scams.",
                "author": "Seruna_Kanus"
            },
            {
                "raw_content": "Brain washing is not an education.",
                "author": "MeMargie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "popcorn crunching intensifies",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He wanted us in camps for not wanting a vaccine",
                "author": "Cali_kid"
            },
            {
                "raw_content": "Yeah it is one of those concentration camps that send people home.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "I wish Trump was even a 3rd of the tyrant these morons piss their pants about.",
                "author": "Redpilled2Depression"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attention illegal invasive migrants ! See what alligators do to invasive species! This could be YOU!",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Round here we call that Tuesday",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "This entire alligator Alcatraz thing is pure meme darkness. Someone put a sombrero on the python.",
                "author": "djentropyhardcore"
            },
            {
                "raw_content": "I think that snake has been dead a minute, but, still.",
                "author": "PensivePatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh noes, Climate alarmist methane-tracking satellite designed to \"Name and Shame\" oil companies has died",
        "score": 788,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tell me you didn't like the actual results without telling you didn't like the actual results.",
                "author": "Tikk"
            },
            {
                "raw_content": "Look up the Vostok ice core samples CO2 does not cause high temperatures, but exactly the other way around. Also, climate change is a scam.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I don't know about you folks, but nobody can seem to predict the weather two days in advance here, and they're worried about this stupid shit.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump nominates Alina Habba for full-term US Attorney for District of New Jersey",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the fact that she is the only one willing to arrest democrats so far i guess makes her stand out.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "STOP NOMINATING WOMEN!!",
                "author": "new_guy2"
            },
            {
                "raw_content": "President Trump's nomination, Alina Habba, goes to The Senate for confirmation. This will be awesome.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Anti-ICE rioters have just taken over a BRIDGE in Los Angeles. Americans are so freaking sick of this. Give the National Guard ARREST POWER and this crap will STOP!",
        "score": 1310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Definitely not a Florida bridge",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Any PD that needs NG help for pittance shit should be fired and jailed for frauding the public. Send CHiPS.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Nobody cares about a bridge in LA. Theres like 30 of them there. Police will have it cleared in an hour.",
                "author": "Ostia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Family Of Karmelo Anthony Asks For Millions In Donations After Murder Indictment To \"fight white supremacy\"...",
        "score": 917,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be honest, they didn’t ask. They axed",
                "author": "iteachfuckinscience"
            },
            {
                "raw_content": "Gotta love how every high-profile leftist hero is a grifting pile of shit.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "typical ոіggеr moment",
                "author": "GENOCIDEUKRAINE"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Taco Tuesday",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Extra spicy. 🌶️ 🐊",
                "author": "MythArcana"
            },
            {
                "raw_content": "OK, that was funny!",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "need to darken up that skin a tad",
                "author": "Crazyteeth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another win for Rubio. This dude is batting much higher than I expected.",
        "score": 1927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolutely what I voted for.",
                "author": "SecurityBlanket"
            },
            {
                "raw_content": "Never been a fan of Marco Rubio. But he might be one of my favorites now.",
                "author": "Appeal2Heaven98"
            },
            {
                "raw_content": "Now watch how few mostly peaceful protests there are.",
                "author": "DemocratMath"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: My Representatives had a long and productive meeting with the Israelis today on Gaza. Israel has agreed to the necessary conditions to finalize the 60 Day CEASEFIRE, during which time we will work with all parties to end the War.",
        "score": 1130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've watched this movie like 30 times at least though, so I mean who gives a fuck.",
                "author": "terribletwos"
            },
            {
                "raw_content": "I'm hoping peace sticks",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Israel couldn't wage war on anyone without infinity US dollars. The obvious answer is cut them off, but that's too much for the bush era muslim haters, brainwashed boomers, and muh jesus says end of days christians (the latter of which includes the current ambassador to Israel and Ted Cruz). Oh and the \"formerly\" communist and progressive neocons/Never Trumpers.",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This Haitian woman is threatening us with a good time. I’d even help her pack—free of charge!",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Candace Owen’s trolling hard",
                "author": "KattWilliams2024"
            },
            {
                "raw_content": "If all the spooks arabs indians left it would be damn near a utopia.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Yeah, I don't think this woman thought her argument through. Also, I'm pretty sure she would fight to the death not to be deported back to Haiti.",
                "author": "Constantin2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Synology starts selling overpriced 1.6 TB SSDs for $535 — self-branded, archaic PCIe 3.0 SSDs the only option to meet 'certified' criteria",
        "score": 264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ridiculous and sad. Looking forward to seeing these get reverse engineered for the poor customers who believed in this company.",
                "author": "AC1colossus"
            },
            {
                "raw_content": "Official endurance of less than 2000 writes (<2000 times capacity) is about two-thirds of typical drives such as Micron 5400 or Intel D3-S4510, and about the same as mid-range consumer devices. It's probably enough, but my point is how little value those have in every respect. [edit] and also, is it actually enough for write caches? Because it's a capability Synology has and supports with those devices.",
                "author": "sysKin"
            },
            {
                "raw_content": "Wooo, yet more reasons to not buy any Synology products, and to recommend against them any time a person inquires about NAS's.",
                "author": "Zenith251"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gamers Reject RTX 5060 Ti 8 GB — Outsold 16:1 by 16 GB Model",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once again, sweeping generalizations and conclusions drawn solely from mindfactory de.",
                "author": "VastTension6022"
            },
            {
                "raw_content": ">According to publicly available data from one of Germany's largest retailers, Mindfactory. Oh boy.",
                "author": "BarKnight"
            },
            {
                "raw_content": "No shit, this card exists to save system integrators a few bucks (at the cost of a sometimes heavily compromised card) that still lets them label their prebuilt has having a 5060TI",
                "author": "RealOxygen"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Intel's new CEO explores big shift in chip manufacturing business (Write-off 18A and move focus to 14A)",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For people that don't read the piece. They aren't writing off 18A nor scrapping internal products Rumour related to external customer marketing",
                "author": "SlamedCards"
            },
            {
                "raw_content": "Am I just uninformed or does it seem like Intel has been on a roll of \"well this process didn't really work out, let's focus on the next one\" for 10 years now? When will we see high volume fabrication of a desktop CPU or GPU on an Intel node?",
                "author": "rubiconlexicon"
            },
            {
                "raw_content": "Objectively, 18A is in an awkward spot. You have an N3 competitor arriving, from a foundry customer's perspective, a solid 2-3 years later. So you need a customer who cares about PPA enough to bite the bullet vs the very mature N4, but not enough to actively pursue the leading edge (N2, A16, A14), and they can't be strongly dependent on ecosystem IP, *and* they must be risk tolerant enough to go with Intel. There's not many who're going to fit that bill. The bigger question is if 14A actually changes that status quo. If you just shift the window +1 node for each in 2 years, the problem remains. So what does 14A need to deliver to actually get customer buy-in? Also, is it enough to have just a single real foundry node available, or will they need 18A to coexist if only to have a full portfolio? Perhaps 14A is a straightforward enough improvement in all areas that it won't be necessary, but that feels like a gamble. At least Tan might be better at selling the node to potential customers. Gelsinger supposedly had some rather significant fuck-ups in that area. Edit: Also, this is a rather bad precedent for customers. If Intel remains perpetually one node away from proving themselves, then when is anyone risk-adverse supposed to jump on? Remember, Intel 3 was supposed to be the pipecleaner node for foundry, and 18A the full-throttle volume offering. Intel repeatedly iterated their desire (or even the need) to have significant 3rd party volume on that node... right up until they admitted they have ~no customers.",
                "author": "Exist50"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam In-Game Performance Monitor",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do you ever get the feeling that there are too many performance monitors?",
                "author": "SignalButterscotch73"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GeForce RTX 5050 becomes third 8GB desktop Blackwell GPU to launch without reviews",
        "score": 191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems pretty simple. If there are no reviews then nobody should buy it until there are reviews. If you choose to buy something before checking out a review then that's your choice and it's on you. IMO if someone doesn't know this, then they probably weren't gonna go find a review anyway.",
                "author": "SirMaster"
            },
            {
                "raw_content": "Almost like they don't want people to see how bad 8 gb vram is in 2025...",
                "author": "JonWood007"
            },
            {
                "raw_content": "The year is 2038. The unix time apocalypse is upon us. Nvidia is still releasing GPUs with 8 GB of vram",
                "author": "ImBoredToo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Foundry to mass produce 1.4㎚ in 2029… Focus on ‘recovery of operating rate’",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Samsung delaying 1.4nm to 2029 Samsung originally targeted 2027 TSMC targets HVM of A14 in 2028 Intel targets risk production of 14A in 2027 (means HVM is likely 2028 or very late 2027) Though Samsung 1.4nm might have been a dubious name anyway considering there 3nm and 4nm nodes have lot less PPA than TSMC or Intel",
                "author": "SlamedCards"
            },
            {
                "raw_content": "Its difficult to see Samsung mounting a challenge without significant demand, their foundry business must be really struggling to find the revenue to build up or out so their node supremacy dream is just a dream IMO. But if they can keep pushing forward it might not matter over the long term, eventually node shrinks wont be a thing so its a race with a finishing line. Samsung getting there several years after isnt the same as being perpetually behind a moving target.",
                "author": "KR4T0S"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inno3D: GeForce RTX 5050 vs RTX 4060 is a close call, but 4060 still wins in games - VideoCardz.com",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another day, another 3060.",
                "author": "KARMAAACS"
            },
            {
                "raw_content": "Which wouldn't be much of an issue if it was, oh I dunno, 150-200 dollars and not fucking 250. Nvidia could have made a pretty nice budget GPU for older systems that would do quite nice for those looking to play eSports titles or newer games at mediumish settings but nooooooo.",
                "author": "__Rosso__"
            },
            {
                "raw_content": "cant wait for the corporate cucks to defend this",
                "author": "A_Biohazard"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung 6th-Gen DRAM Receives Production Readiness Approval",
        "score": 27,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Y'all are sleeping on this game",
        "score": 6014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not like I expected, but welcome back F-Zero",
                "author": "Necessary_Match_394"
            },
            {
                "raw_content": "Wtf were those jump shortcuts 😅😅😅",
                "author": "Chaoseater999"
            },
            {
                "raw_content": "This looks great, this is Fast Fusion?",
                "author": "Little_Ad_2533"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo store in San Francisco is STACKED",
        "score": 1054,
        "text_content": "Just happy to own since it’s been sold out online (feels like a dream)",
        "comments": [
            {
                "raw_content": "shot on an iphone 1? sry this came out wrong, but this photo looks eerily 2000s",
                "author": "PaperApprehensive318"
            },
            {
                "raw_content": "They sell the GC controllers in store??!? Do you have to have proof of NSO status?",
                "author": "YelleauxAxeMan"
            },
            {
                "raw_content": "Did you take the pic on your 3ds?",
                "author": "BilboSwaggins444"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK BANANZA CONFIRMED DEVELOPED BY MARIO ODYSSEY TEAM",
        "score": 1495,
        "text_content": "https://youtu.be/RVCMX4xim84?si=iMNfxScQtgcM-8Lv Two Italian journalists, at the preview of DK Bananza, expressly asked the Nintendo staff who was to develop it and confirmed that it is the Odyssey team!",
        "comments": [
            {
                "raw_content": "BREAKING: DK LIKES BANANAS",
                "author": "Pomps8a"
            },
            {
                "raw_content": "https://preview.redd.it/k95kkwcpt9af1.png?width=2778&format=png&auto=webp&s=410df9afc9eee1b4966f2a6b70f557a8dd4903fe I'm pretty sure that DK Bananza was inspired by the ending of Super Mario Odyssey, where Mario Captures Bowser, and Peach rides on Bowser's back, and Bowser starts smashing everything in his path. I actually replayed that part a couple of days ago, and I was amazed at the similarities between the two games",
                "author": "Never-The-Least"
            },
            {
                "raw_content": "Fork found in kitchen",
                "author": "Ratio01"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Surpasses 5 Million Units Sold in First Month, Marking Historic Launch",
        "score": 2746,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like the fact Nintendo released it in the summer for the gamers and not at Christmas competing with the kids for a present also plenty of stock available to fuck with the scalpers",
                "author": "Plus_Consequence_497"
            },
            {
                "raw_content": "Full six months away from the holiday season and the games catalogue is only going to get better before December. This is crazy but I’m glad to see it. We all just wanted a more powerful switch and they gave us exactly that.",
                "author": "Outrageous_Meet2025"
            },
            {
                "raw_content": "There's no doubt the Switch 2 is initially less exciting as a console than many previous Nintendo devices but...the fact is that they've given people exactly what they want and they're reaping the rewards for that. I'm delighted with mine, and the longer I own it, the more I like it.",
                "author": "elephvant"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The switch 2 is awesome outside - even better if you don't have to hold it",
        "score": 201,
        "text_content": "Found a really nice mount and couldn't be happier. The switch 2 is too heavy for me to use handheld for too long but I can still take advantage of its portability! I'm not sure if I can share the link but you can find it if you search lamicall standing mount on amazon",
        "comments": [
            {
                "raw_content": "I wouldn’t dare risk something like that lol. I’d be terrified the whole time it’d fall",
                "author": "JFree37"
            },
            {
                "raw_content": "Just one jump from your dog and that thing is toast. Neat, i guess.",
                "author": "Help_Im_Cooking"
            },
            {
                "raw_content": "Some might call you a “madman” but where’s your little lite blue controller?",
                "author": "PaleFondant2488"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Email Just Receieved, check your emails!",
        "score": 127,
        "text_content": "Finally got emailed to buy one. Check your emails!",
        "comments": [
            {
                "raw_content": "Finally got my email today 🥲 bought mine on release day at GameStop though",
                "author": "macncheese413"
            },
            {
                "raw_content": "Still waiting for my email *sigh*",
                "author": "btnzgb"
            },
            {
                "raw_content": "got one today too, but was able to pick one up last Friday at BestBuy",
                "author": "spookytay"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New DK Bananza gameplay",
        "score": 459,
        "text_content": "Destruction Challenge Source: https://x.com/shacknews/status/1940032644411961444?t=YBXlHqq1-kuwh0KLbxIe9A&s=19 **MANY previews went up today from different content creators",
        "comments": [
            {
                "raw_content": "I already bet some YouTuber or streamer's gonna do some \"Break every breakable thing possible on the map\" as soon as the game releases",
                "author": "CicadaSuccessful6176"
            },
            {
                "raw_content": "I am so ready for this game, it just looks down right fun!",
                "author": "VikingActual1200"
            },
            {
                "raw_content": "Can't wait for this game.",
                "author": "iiB3An"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's time unpeel another 'bananas' month of Nintendo Switch releases. Here's 22 of the ripest games 'barrel-blastin' on to the Nintendo eShop and retail stores this July. What games are you loading in to your minecart this month?",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "pata pon don chaka!",
                "author": "SlimeyPlayz"
            },
            {
                "raw_content": "I’m in for Tony, DK, Patapon, the Mario Party update, and System Shock 2. I’m really *pulling* for Shadow Labyrinth, Ninja Gaiden, and Tales of the Shire to be good.",
                "author": "OneManFreakShow"
            },
            {
                "raw_content": "Just DK for me I’ll wait for THPS to go on sale.",
                "author": "SmokedUp_Corgi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Outriders 2 Revealed to be One of People Can Fly’s Two Canceled Games (EXCLUSIVE)",
        "score": 374,
        "text_content": "https://thethumbwars.com/outriders-2-revealed-to-be-one-of-people-can-flys-two-canceled-games-exclusive/ Does this count as a \"leak\"? First post here.",
        "comments": [
            {
                "raw_content": "The curse of Square Enix claims yet another",
                "author": "HardToMintThough"
            },
            {
                "raw_content": "Had so much fun with the first one but the endgame content was absolutely terrible",
                "author": "SupaRaw357"
            },
            {
                "raw_content": "Still waiting for Bulletstorm 2..",
                "author": "farammm"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Per Deadline: David Dastmalchian cast as M. Bison in Legendary's 'Street Fighter' film",
        "score": 225,
        "text_content": "Deadline has returned to break another, pivotal piece of casting as part of the ensemble for Legendary and Capcom's Street Fighter movie. David Dastmalchian, last seen in *The Suicide Squad*, *Late Night with the Devil* and *The Life of Chuck*, has [reportedly landed the role](https://deadline.com/2025/07/street-fighter-movie-casts-david-dastmalchian-m-bison-1236446702/) of Shadaloo dictator and Psycho Power enthusiast M. Bison, marking probably the actor's biggest role to date after years of indie flicks and supporting appearances in other blockbuster films. It was previously alleged by scooper Jeff Insneider that *The Righteous Gemstones* and *Fallout* star Walton Goggins had [briefly been in negotiations for the character](https://www.worldofreel.com/blog/2025/6/26/street-fighter-reboot-is-casting-like-it-lost-a-bet-andrew-schulz-50-cent-jason-momoa-orville-peck), but other scoops suggested he had already dropped out midway through the process. Dastmalchian is stepping into steel-toed boots and a red cape previously worn by the legendarily flamboyant thespian Raul Julia and subsequently discarded by Neal McDonaugh, traded for a unremarkable businessmen attire. The bar is both very high and on the floor. Silvio Simac did a pretty damn solid job at least on *Resurrection* and the costuming was fantastic. Around the time of Dastmalchian's casting being reported, film insider site NexusPointNews broke that WWE alumni Cody Rhodes had also[ signed on to portray Guile](https://www.nexuspointnews.com/post/exclusive-cody-rhodes-to-portray-guile-street-fighter), the Air Force major who goes in a corner and low blocks, and whose involvement with Bison is motivated by the role the dictator played in killing his friend Charlie Nash years earlier. This would make Rhodes the second actor to don the tank top after Jean Claude van Damme and the mountain of coke he took before getting on set in 1994. Maybe Rhodes will be brave enough to don the broom top like a real family man. NexusPointNews was previously the first outlet to report that[ 50 Cent had been cast as Balrog ](https://www.nexuspointnews.com/post/exclusive-curtis-jackson-is-in-talks-to-portray-balrog-in-street-fighter)shortly before [Deadline corroborated the scoop](https://www.hollywoodreporter.com/movies/movie-news/street-fighter-curtis-50-cent-jackson-1236299350/) and the actor himself [even appeared to confirm his involvement](https://xcancel.com/50cent/status/1937421237560455552) on social media.",
        "comments": [
            {
                "raw_content": "More importantly supposed Cody Rhodes is in talks to play Guile",
                "author": "SteveMightSay"
            },
            {
                "raw_content": "Isn't Bison a pretty big guy?",
                "author": "DiskKey5683"
            },
            {
                "raw_content": "This news dropping on a Tuesday is perfect",
                "author": "Key___Refrigerator"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Firesprite's new game will be AAA with a strong focus on narrative and immersion",
        "score": 334,
        "text_content": ">Firesprite Games, the British PlayStation studio responsible for games such as Horizon Call of the Mountain, The Persistence and The Playroom, is recruiting for a new AAA project with “a strong focus on atmosphere, narrative, player agency and immersion in innovative territory with next-generation technologies”. The information comes via a new job offer published on PlayStation's official careers website. The vacancy is for Lead Cinematic Producer, and reveals some interesting details about the studio's next game. It looks like it will be an ambitious, narrative-focused production. Original post: [https://www.geekinout.pt/artigos/novo-jogo-da-firesprite-sera-aaa-e-com-grande-foco-narrativo-e-imersao](https://www.geekinout.pt/artigos/novo-jogo-da-firesprite-sera-aaa-e-com-grande-foco-narrativo-e-imersao) Job offer: [https://careers.playstation.com/lead-cinematic-producer-production-hybrid-remote-uk/job/5566224004](https://careers.playstation.com/lead-cinematic-producer-production-hybrid-remote-uk/job/5566224004)",
        "comments": [
            {
                "raw_content": "If this is the project codenamed \"heartbreak\" that was leaked years ago as a \"survival horror\" it has been in development since 2020. It would be interesting if this was Until Dawn 2 as some has suggested and they managed to mix survival horror gameplay like the RE2 and SH2 remakes with a branching narrative.",
                "author": "DAV_2-0"
            },
            {
                "raw_content": "New Siren?",
                "author": "shadow_129"
            },
            {
                "raw_content": "I almost forgot that PlayStation has this studio for real",
                "author": "Khalilbarred"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel confirms Arc Battlemage GPUs will expand into Edge/AI market in Q4",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel needs to fix their Arc supply issue. They really need to start pumping out Arc cards on US soil. However this is good news to publicly announce Arc BattleMage will expand into AI markets. So now Intel Arc, a discrete graphics card has a consumer line, a pro line and venturing into edge/AI. Nvidia across the board has become too expensive and AMD continues to limp along in typical mediocre fashion. Intel needs to execute persistently. I can’t give financial advice, but Intel is at a good price. if Intel can get the foundries up and running sooner, its stock will be a buy for most. Intel is getting ignored by the White House, dominated by TSMC with the Taiwanese government, backing them all the way, and seen as a corrupt entity by AMD famboyz. There are people to this day, who keeps complaining that Intel didn’t innovate back in the day and charged so much for their CPUs. They live in this alternate reality where AMD can do no wrong, as Amd 9800 X 3-D chips melt along with other AMD CPUs and Radeon cards are only mediocre at best. We are seeing many 9000 series Ryzen chips start to overheat, especially the high end chips like the 9950 X 3-D and the 9800 X 3-D. There could be more issues on the horizon. Keep your eyes open.",
                "author": "quantum3ntanglement"
            },
            {
                "raw_content": "LBT will fix this.",
                "author": "Boring_Clothes5233"
            },
            {
                "raw_content": "I was actually hoping for this, but looks like the software support for intel died for a bit. They cut development for their Npu libraries and theres limited support for their gpus if you dont want to use openvino",
                "author": "throwaway001anon"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Q3 2025 Tech Support Thread",
        "score": 10,
        "text_content": "Welcome to the r/Intel Q3 2025 PC build questions, purchase advice and technical support megathread — if you have questions about Intel hardware, need help with a purchasing decision, have a PC build question or require technical support, \\*\\*please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums listed below.\\*\\* Please remember that r/Intel is not a technical support, purchase advice or PC building help subreddit. r/Intel is community run and does not represent Intel in any capacity unless specified. You may want to consider the official \\[Intel Community\\](https://community.intel.com/) or \\[contact Intel support directly\\](https://www.intel.com/content/www/us/en/support.html) The \\[Intel Community\\](https://discord.com/invite/intelsubreddit) and \\[Official Intel Insiders Community\\](https://discord.com/invite/qRkVx53) Discord servers are also available to ask questions, including PC build questions, purchase advice and tech support questions with other Intel users and PC enthusiasts. \\*\\*You may also want to consider the following subreddits, websites and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response\\*\\*. \\[PCPartPicker\\](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc Planning on building a computer but need some advice? This is the place to ask! is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubt one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform there exists. The Personal Computer. \\[OBS (Open Broadcaster Software) Forums\\](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC and help others! r/techsupport Stumped on a tech problem? Ask the community and try to help others with their problems as well \\[ASRock Forum\\](https://forum.asrock.com/default.asp): Wanna discuss or find out something for your ASRock products? Come and get in ASRock worldwide forums to chat with ASRock global users! \\[ASUS Republic of Gamers (ROG) Forums\\](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear. \\[MSI Global English Forum\\](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help. r/buildapcforme A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops The hub for gaming laptop enthusiasts. Discover discussions, news, reviews, and advice on finding the perfect gaming laptop. r/SuggestALaptop A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. \\# READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes or hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, \\*\\*please read and try the following before making a post\\*\\* — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order, if a step has already been performed or is not relevant, please move to the next step. \\* If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet and any switches on the wall outlet and/or power supply are in the ON position. It's also worth check your front panel connectors to make sure they are connected properly and trying a different wall outlet. \\* If you have any power related issues, like your system not starting, shutting down, sleeping, restarting or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB and 3.3V rails) can cause a myriad of issues that can be inconsistent and hard to diagnose. \\* Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard manual. \\* If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers/buttons you can use, please consult your motherboard or system manual on how to clear the CMOS. \\* If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. \\* Make your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which will allow you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual as the BIOS flashback procedure will very depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. \\* Make sure your Monitor/TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor/TV, if you are using any HDMI or DisplayPort adapters, converters or splitters, remove these and use a direct connection, try switching between HDMI and DisplayPort and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. \\* Make sure you are running the latest software updates for your operating system, games and applications. \\* Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware and other unwanted software can cause crashes, freezes, hangs and other performance, security, stability and compatibility issues. \\* Make sure you are running the latest \\[Intel drivers\\](https://www.intel.com/content/www/us/en/download-center/home.html). Some devices, such as laptops and handhelds may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the device manufacturer's support page. \\* If you need to reinstall GPU drivers, we recommend using \\[Display Driver Uninstaller (DDU)\\](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers, a guide on how to use DDU can be found \\[here\\](https://docs.google.com/document/d/1xRRx\\_3r8GgCpBAMuhT9n5kK6Zse\\_DYKWvjsW0rLcYQ0/edit) \\* If you have installed GPU drivers after using DDU, you may experience stutter in some games while the shaders are cached again. \\* If Windows Update is replacing your GPU drivers (example of what that looks like \\[here\\](https://imgur.com/a/DLLMZ3L)) please \\[view the following\\](https://drive.proton.me/urls/QHH65SVJ9M#Q25EPyELVdrT) on the steps you can take to prevent this happening. \\* If you are on Windows 10 or Windows 11 and experience flickering, stuttering or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this \\[thread\\](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling\\_multiplane\\_overlay\\_mpo\\_fixed\\_all/). \\* If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through \\[Steam\\](https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB), \\[Epic Games Store\\](https://www.epicgames.com/help/en-US/c-Category\\_EpicGamesStore/c-EpicGamesStore\\_LauncherSupport/how-do-i-verify-game-files-in-the-epic-games-launcher-a000084923#:\\~:text=Find%20the%20game%20in%20your,Click%20the%20Verify%20button), \\[Ubisoft Connect\\](https://www.ubisoft.com/en-us/help/connectivity-and-performance/article/verifying-game-files-in-ubisoft-connect-pc/000060529), \\[EA App\\](https://answers.ea.com/t5/EA-Services-General-Questions/How-to-verify-game-files-of-installed-games/m-p/6578960), \\[GOG Galaxy\\](https://support.gog.com/hc/en-us/articles/360003930017-My-game-data-is-corrupt-How-can-I-repair-my-game), \\[Battle.net\\](https://battle.net/support/article/7655) or whichever game client you are using. \\* If a program is crashing, freezing, not starting, performing poorly or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. \\* If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values, this can be checked under Control Panel > System and Security > Power Options. \\* Make sure you are using the latest BIOS, Firmware and Drivers for your motherboard, laptop, desktop and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features and improve compatibility and interoperability. \\* If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: \\*\\*revert everything to stock clocks, timings, voltages and settings\\*\\*, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner, you may also have to restore default settings in those utilities as well. \\* If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them, a guide is available here \\* If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the \\*below PSU calculators\\* and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. \\* PSU Calculators: \\[FSP\\](https://www.fsplifestyle.com/landing/calculator.html) — \\[OuterVision\\](https://outervision.com/power-supply-calculator) — \\[Cooler Master\\](https://www.coolermaster.com/power-supply-calculator/) — \\[Seasonic\\](https://seasonic.com/wattage-calculator) — \\[Newegg\\](https://www.newegg.com/tools/power-supply-calculator/) — \\[be quiet!\\](https://www.bequiet.com/en/psucalculator) — \\[MSI\\](https://www.msi.com/power-supply-calculator) — You can also add all your components into \\[PCPartPicker\\](https://pcpartpicker.com/list/) and it will provide an estimate wattage. \\* Try and apply common sense to an issue, for example if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, DIMM slot on the motherboard or pins, have you tried reseating it etc... \\* If you experience crashes, freezes, unexpected shutdown or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that \\*\\*just because your system turns on, doesn't make it stable\\*\\* and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. \\[OCCT\\](https://www.ocbase.com/occt/personal) — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing, varying GPU loads, and much more. \\[Prime95\\](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress / torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. \\[AIDA64 Extreme\\](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. \\[Furmark 2\\](https://geeks3d.com/furmark/downloads/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. \\[MSI Kombustor\\](https://geeks3d.com/furmark/kombustor/downloads/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting edge 3D APIs such as OpenGL or Vulkan. \\[MemTest86\\](https://www.memtest86.com/download.htm) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. \\[MemTest86+\\](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium class or later 32-bit or 64-bit x86 CPU. \\[SeaTools\\](https://www.seagate.com/support/downloads/) — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. For more advanced SSD and HDD diagnostic utilities, please check the website of your SSD or HDD manufacturer, as they usually offer manufacturer-specific software to check the health of he drive, test the drive and update firmware, some examples include \\[Samsung Magician\\](https://semiconductor.samsung.com/consumer-storage/magician/), \\[Western Digital Dashboard\\](https://support-en.wd.com/app/answers/detailweb/a\\_id/31759/\\~/download%2C-install%2C-test-drive-and-update-firmware-using-western-digital) and the \\[Crucial Storage Executive\\](https://www.crucial.com/support/storage-executive). Some motherboards, laptops and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please \\*\\*backup any important files/data\\*\\* and perform a reinstall/clean install of Windows, using a USB or DVD. \\*\\*Only use Windows ISO images that come directly from Microsoft.\\*\\* The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft \\[Software Download\\](https://www.microsoft.com/software-download/) page and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs which modify Windows or to use 3rd party, custom or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the below template for submitting a request, the more detail you can include the better. \\*\\*If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.\\*\\* \\*Below is an example template you could use...\\* \\*\\*Summary of the issue\\*\\*: Graphical glitches when playing Ratchet & Clank: Rift Apart on 32.0.101.6079 if you have V-Sync enabled. This can be resolved if you revert to 32.0.101.6078. \\*\\*What I have tried to resolve the issue\\*\\*: I have reinstalled 32.0.101.6079 with DDU, reset my in-game graphics settings, verified game files in Steam and confirmed the issue is still present. \\*\\*System specifications:\\*\\* \\* Operating System: Windows 11 23H2, OS Build 22631.4169 (to find OS build version, press the Windows Key + R and type \\*winver\\*) \\* CPU: Intel Core i5-14600K, stock settings with no overclock, cooled by a Noctua NH-D15 \\* GPU: GPU: Intel Arc A770 16GB Limited Edition, stock settings with no overclock \\* Motherboard: Gigabyte Z790 AORUS ELITE X with F6f BIOS \\* RAM: Corsair DOMINATOR TITANIUM 32GB (2x16GB) 6000MT/s CL30 Intel XMP \\* Storage: 2TB Crucial T500 \\* PSU: Super Flower LEADEX VII Platinum PRO 1200W ATX 3.1 \\* Display: MSI 27\" MAG 271QPX QD-OLED E2 240Hz OLED with Certified Ultra High Speed HDMI Cable If you are using a prebuilt PC or don't know your full specifications, please include the make and model of your system and as much information as you can, e.g, Dell XPS 13 Laptop (Intel Core Ultra 7 Processor 258V, Intel Arc Graphics 140V, 32GB LPDDR5X RAM, 1TB NVMe M.2 SSD with the latest 1.2.0 BIOS. Please include any logs, dump files, videos, screenshots and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling and component installation.",
        "comments": [
            {
                "raw_content": "This subreddit is in manual approval mode, which means that **all submissions are automatically removed and must first be approved before they are visible**. Your post will only be approved if it concerns news or reviews related to Intel Corporation and its products or is a high quality discussion thread. Posts regarding purchase advice, cooling problems, technical support, etc... will not be approved. **If you are looking for purchasing advice please visit /r/buildapc. If you are looking for technical support please visit /r/techsupport or see the pinned /r/Intel megathread where Intel representatives and other users can assist you.** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/intel) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Powell confirms that the Fed would have cut by now were it not for tariffs",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fannie and Freddie: Single Family Serious Delinquency Rates Decreased in May",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is considered good news right?",
                "author": "Tight-Pangolin6737"
            },
            {
                "raw_content": "I would like to know there numbers if we included those relying on the home owners assistance fund created during COVID considering it's almost maxed out its initial funding level.",
                "author": "gcadays09"
            },
            {
                "raw_content": "Freddie Mac reported that the Single-Family serious delinquency rate in May was 0.55%, down from 0.57% April. Freddie's rate is up year-over-year from 0.49% in May 2024, however, this is below the pre-pandemic level of 0.60%. Freddie's serious delinquency rate peaked in February 2010 at 4.20% following the housing bubble and peaked at 3.17% in August 2020 during the pandemic. Fannie Mae reported that the Single-Family serious delinquency rate in May was 0.53%, down from 0.55% in April. The serious delinquency rate is up year-over-year from 0.48% in May 2024, however, this is below the pre-pandemic lows of 0.65%. The Fannie Mae serious delinquency rate peaked in February 2010 at 5.59% following the housing bubble and peaked at 3.32% in August 2020 during the pandemic. These are mortgage loans that are \"three monthly payments or more past due or in foreclosure\". Mortgages in forbearance are being counted as delinquent in this monthly report but are not reported to the credit bureaus. For Fannie, by vintage, for loans made in 2004 or earlier (1% of portfolio), 1.37% are seriously delinquent (down from 1.39% the previous month). For loans made in 2005 through 2008 (1% of portfolio), 1.94% are seriously delinquent (down from 1.98%). For recent loans, originated in 2009 through 2023 (98% of portfolio), 0.49% are seriously delinquent (down from 0.50%). So, Fannie is still working through a handful of poor performing loans from the bubble years. https://www.fanniemae.com/media/55801/display",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes Are Taking Longer to Sell in US Markets That Once Flourished",
        "score": 168,
        "text_content": "A buildup of unsold houses sitting on the market for weeks is becoming a new reality in once-booming housing areas across the Sun Belt. Real estate agents in the South and Southwest say they’re seeing more people list homes, giving up on hopes that mortgage rates will drop anytime soon. In Florida, homeowners are fleeing soaring insurance costs, and in Colorado, investors are culling rental properties. The result is a rise in supply, something real estate agents who were getting multiple offers on even ho-hum houses not so long ago are not accustomed to. In Florida, houses now take a median 73 days to sell, up from 55 days two years ago and twice as long as in New Jersey and Virginia, according to [Realtor.com](http://Realtor.com) data....",
        "comments": [
            {
                "raw_content": "It’s foundational in economics that people will tend to act in their own material self interest. Anyone with any sense who isn’t compelled by circumstance to buy a house right now is staying put. And it’s not like they’re even doing it to try and make some statement; it simply doesn’t make sense to buy right now. There’s a saying in investing that you should never try to catch a falling knife. Well, the knife is falling. Sellers both individual and institutional have gotten used to the idea that they can expect a high profit margin on the resale of residential properties. Some are flippers, some are tech bros who moved to Austin or Tampa for their job and now they’re moving again, and some are companies like RedFin. But that gold rush was all based on the presence of motivated buyers who needed to buy, low interest rates which practically amounted to free money, and short supply of available housing. ALL of those variables have shifted in the buyer’s favor to various degrees depending on locale. Austin, Texas used to be one of the hottest markets in the country and now it’s considered frozen. The outlying towns of Greater Austin — Round Rock, Pflugerville, Leander, Buda, Georgetown — are seeing a 30% drop in prices and valuations and inventory keeps climbing. And that’s because (at least in Austin’s case, Florida, Denver, etc.) it was a bubble. It was all based on hype. We’re now hitting that phase that is a feature of ALL speculative bubbles that people tend to forget or not see coming — the part where you’re supposed to get out before the bubble bursts. Crypto bros take note.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "I’m seeing a subtle shift in Houston proper. Great homes priced well still sell quickly. Homes priced a bit on the higher side of comps have been sitting. Sellers won’t budge even after 2 months of sitting but buyers haven’t been willing to pay the higher price.",
                "author": "JustVegetable9941"
            },
            {
                "raw_content": "Looks like Chicago prices are still rising.",
                "author": "knowledge84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "California Rolls Back Its Landmark Environmental Law",
        "score": 33,
        "text_content": "Gov. Gavin Newsom and state lawmakers scaled back a law that was vilified for its role in California’s housing shortage and homelessness crisis. https://www.nytimes.com/2025/06/30/us/california-environment-newsom-ceqa.html Would love to get perspectives of folks in CA and how the current law affected new home construction.",
        "comments": [
            {
                "raw_content": "The law is being abused by NIMBYs and certain jurisdictions filled with NIMBYs (cough: Sonoma county) to stifle development. The NIMBYs also have organizations that go around and sue jurisdictions to prevent develop on the grounds of environmental impacts. One could argue that many of the states worst wild fire disasters were caused by jurisdictions using regulation to prevent people from cutting trees (even for fire & safety reasons). NIMBY groups such as the Sierra club are also to blame because they prevent logging on federal forest lands, which increases wildfire intensity and damage. In Sonoma and Monterey counties for example, you can’t cut any “protected species” over 6” diameter without a permit and paying an exorbitant fee. Also in Monterey county, you can’t even trim limbs with getting a certified arborist to come out to make sure you aren't harming the tree. This gets extremely costly if you have land with a lot of trees (which obviously would happen if the county/city won’t let you cut them down). Other counties won’t let you cut trees at all. That’s all besides the fact that it takes 3+ years in many jurisdictions (& over 100k in permits & impact fees), just to build a single family residence. This is likely a step in the right direction - but there’s a long ways to go in fighting boomers and their death grip on the California housing market. There’s many other regulations that need to be repealed or scaled back to be more reasonable, such as the California green building standards. The California housing market is textbook regulatory capture and embodies the boomer attitude of “fuck you, I got mine.” Source: moved here from another state - house prices suck.",
                "author": "Pristine-Prior-504"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Condo Prices Dropped 2% in May—the Second Largest Decline on Record",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Condos - most of the disadvantages of homeownership combined with all the disadvantages of apartment-style living.",
                "author": "Quixlequaxle"
            },
            {
                "raw_content": "Usually the first property type to lose value in a downward market.",
                "author": "Perfect-Top-7555"
            },
            {
                "raw_content": "I still can’t get out of my head about the lack of demand in condos, Florida specifically, is just funneling would be buyers into an already challenged SFH market. Now, I’m aware that numbers in the big metros show building inventory. But how much is SFH’s? Further, how much are the total % drops in valuations due to condo valuations falling?",
                "author": "Sunny1-5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A Third of U.S. Burdened by Housing Cost",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yea, cause the other 2/3rds already own homes and don’t have to rent. Of the owners, those who have a 2020 vintage mortgage pay less than 10% of income on housing and are living their best lives. Those are the folks where everything is going great and is the half of America that’s not facing any financial issues. The K shaped recovery from Covid.",
                "author": "ensui67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atl realtors",
        "score": 0,
        "text_content": "Hi, any Georgia realtors here in the Atlanta or surrounding areas? I'm looking for a company to grow my business with. Thanks in advance. Not sure if this is the right place for this post.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "My robot hates me...",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was good",
                "author": "BlandinMotion"
            },
            {
                "raw_content": "That was funny",
                "author": "nelson2k"
            },
            {
                "raw_content": "is that a power rangers costume?",
                "author": "GrapheneBreakthrough"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis teasing “playable” Veo 3 worlds (or AI video games)",
        "score": 139,
        "text_content": "https://x.com/demishassabis/status/1940248521111961988?s=46&t=Qir-pqFH1-Yy45Psug7OUA[https://x.com/demishassabis/status/1940248521111961988?s=46&t=Qir-pqFH1-Yy45Psug7OUA](https://x.com/demishassabis/status/1940248521111961988?s=46&t=Qir-pqFH1-Yy45Psug7OUA)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ki5po6basdaf1.jpeg?width=1290&format=pjpg&auto=webp&s=b8143ef589eac63631facdc6b5590a971a6747c2",
                "author": "Flipslips"
            },
            {
                "raw_content": "Damn jimmy apples really got cred",
                "author": "Junoord"
            },
            {
                "raw_content": "There are already some shitty early web demos of this. It's really bad (you can move around with arrows), but if the public already had access to shitty versions, it's a good sign :)",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Foreshadowing was insane here",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Technically OpenAI hired even better. All its top competitors once worked at OpenAI. At one point Sam had the Avengers of AI working under him.",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "2 snakes in a small room… scary",
                "author": "pogsandcrazybones"
            },
            {
                "raw_content": "The way he sits is so unnatural. For fucks sake man.",
                "author": "deeziant"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "“Missionaries will beat mercenaries” Sam’s Memo",
        "score": 231,
        "text_content": "“Meta has gotten a few great people for sure, but on the whole, it is hard to overstate how much they didn't get their top people and had to go quite far down their list; they have been trying to recruit people for a super long time, and I've lost track of how many people from here they've tried to get to be their Chief Scientist. I am proud of how mission-oriented our industry is as a whole; of course there will always be some mercenaries.” “Missionaries will beat mercenaries,” and noted that OpenAI is assessing compensation for the entire research organization. “I believe there is much, much more upside to OpenAl stock than Meta stock,” he wrote. “But I think it's important that huge upside comes after huge success; what Meta is doing will, in my opinion, lead to very deep cultural problems. We will have more to share about this soon but it's very important to me we do it fairly and not just for people who Meta happened to target.” More: https://www.wired.com/story/sam-altman-meta-ai-talent-poaching-spree-leaked-messages/",
        "comments": [
            {
                "raw_content": "Mercenary position, my favorite.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "*Mercenary shoots Sam Altman*",
                "author": "Nathidev"
            },
            {
                "raw_content": "\"Meta failed to get anyone good and any OpenAI employee Meta managed to get was shit\" - Sama",
                "author": "TheBrazilianKD"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The new Gemini TTS is insanely good at expressive voices.",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put some subway surfer or Minecraft gameplay in the background and make a TikTok channel $$$$",
                "author": "Stevev213"
            },
            {
                "raw_content": "Can you please send a link where I can test the Google TTS? :-)",
                "author": "Conscious_Warrior"
            },
            {
                "raw_content": "Link?",
                "author": "Technical-Top-5354"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why do you believe these opinions on AI being \"useless\" continue to persist?",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been programming for 10 years. This was true until pretty recently tbf, it's hard to blame people who haven't kept up. It wasn't until o1/R1 (maybe 3.5 Sonnet too but I never tried it) that these tools became truly indispensable for development. o3 and Gemini 2.5 are genuinely mind-blowing. The tasks they're able to one shot consistently surprise me. There's also some skill involved. I think \"prompt engineering\" is less important now, but being clear, concise, and providing the right context is something that's difficult for many people with less programming experience.",
                "author": "ATimeOfMagic"
            },
            {
                "raw_content": "I guess some of the commenters here must be senior devs making $300k a year because I've been in software development for a decade, make a pretty good salary and I find ChatGPT to be incredibly helpful in improving my code.",
                "author": "bobcatgoldthwait"
            },
            {
                "raw_content": "Confirmation bias. Take a set of people who have a predisposition to believe that AI is nothing but empty hype, and then confirmation bias kicks in: they'll dismiss any evidence to the contrary and seize on any supporting evidence as definitive proof that they were right all along. Every hallucination will be a sign that AI just makes stuff up; every company peddling snake oil will seem like the truest expression of the AI marketplace. The problem is, there are enough weaknesses in current models, and enough salespeople who are full of shit, to lend credence to even the most wild-eyed assertion. Forums like Reddit and X will surround them with people who believe the same thing, and the echo chamber will only reinforce their preconceptions.",
                "author": "Playful-Opportunity5"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT could pilot a spacecraft shockingly well, early tests find",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's weird how in spite of all of the sci-fi series, films, and books we've had, only few of them ever explore AI piloting ships. It's always been the human in the loop who's the ace pilot.",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "> The researchers developed a method for translating the given state of the spacecraft and its goal in the form of text. Then, they passed it to the LLM and asked it for recommendations of how to orient and maneuver the spacecraft. The researchers then developed a translation layer that converted the LLM's text-based output into a functional code that could operate the simulated vehicle. This sounds like the most inefficient possible way to run an autopilot system. Haha",
                "author": "zhemao"
            },
            {
                "raw_content": "\"I'm sorry Dave, I'm afraid I can't do that\"",
                "author": "sick_as_frick"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "‘One Big Beautiful Bill’ could block AI regulations for 10 years, leaving its harms unchecked",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was removed",
                "author": "fayanor"
            },
            {
                "raw_content": "Bad timing for this article. I heard the Senate struck this part out today. Kind of misinformation at this point.",
                "author": "CRoseCrizzle"
            },
            {
                "raw_content": "Unlimited power!",
                "author": "RomeInvictusmax"
            }
        ],
        "subreddit": "singularity"
    }
]