[
    {
        "post_name": "A DC Grand Jury has just REFUSED to indict Sen. Mark Kelly, Elissa Slotkin, and other Democrats who called for members of the military to REFUSE orders from President Trump",
        "score": 658,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m shocked that a DC grand jury would do this. Shocked!",
                "author": "charlesthehammer"
            },
            {
                "raw_content": "How is it that Demonrat prosecutors are able to change venue to the most favorable location for their prosecutions?",
                "author": "iamstadter"
            },
            {
                "raw_content": "I thought this was a court-martial matter? Did the military not even make an attempt at doing something?",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❗ Nancy Guthrie Breakthrough? — Woman says the FBI searched her house, told her they received a tip that Nancy Guthrie was inside. The woman says she is the mother in law of the person who was detained. — “They came out telling us that they had somebody gave a tip that the lady was in my house.” ...",
        "score": 301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"He does like Fedex or something like that\" If she's his mother in law, she should know exactly what he does. Weird.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "If someone is missing, I hope they’re found. That being said, I don’t care about any of these people and I don’t think this is national newsworthy.",
                "author": "TheMemesofProduction"
            },
            {
                "raw_content": "Illegal Alien i'm willing to bet",
                "author": "ICE_ICE_BABY"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When teachers aren’t busy plotting ICE riots, they are busy shaping the hearts & minds of the NYXT generation.",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "News didn't cover this but American conservatives were banned for a NZ shooting. Interesting. I'm so exhausted with the left, folks. I can't help it. I hate them",
                "author": "HorrorGameDev"
            },
            {
                "raw_content": "Looks like a Chris Farley skit on SNL.",
                "author": "Bastard"
            },
            {
                "raw_content": "This shit MUST STOP",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RINOS NEED PRIMARIED: COLLINS, MURKOWSKI, MCCONNELL AND THUNE. Report: 49 out of 53 GOP Senators now COSPONSOR the SAVE Act (S.128) - requiring proof of citizenship and an ID to vote in Federal elections! Because they can't win an election honestly!",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird how there's always just enough obstructionists to keep any bill that helps Americans from passing",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "We've got Fetterman and JD. Nuke the filibuster!",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "McConnell is still alive?!? What?",
                "author": "Mintap"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Ken Paxton : 🚨BREAKING: I'm withdrawing a John Cornyn legal opinion that enabled illegal aliens to obtain occupational licenses and issuing a new legal opinion to protect Texas jobs.",
        "score": 1326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. good. 2. wtf was it issued in the first place.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "Now revoke all the ones that are already in place",
                "author": "mty_green_go"
            },
            {
                "raw_content": "Cornyn is the reason I stopped supporting the NRA years ago. NRA gave that POS an A rating after he voted with democrats to infringe the gun rights of law abiding American citizens. I can’t wait for the day these scumbags politicians get what they deserve.",
                "author": "BigMikesBallz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congressman Hakeem Jeffries solicited money from Child-sex Trafficker Jeffrey Epstein in 2013 - AFTER Epstein was a known pedo.",
        "score": 1233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's not all he requested from Epstein. How many underage males were trafficked?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Temu obama at it again. And he got another Rigger to write the letter. Lol.",
                "author": "Porkbut"
            },
            {
                "raw_content": "Link https://x.com/Milajoy/status/2021351426946125979?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE confirmed they’ve purchased a MASSIVE warehouse in Maryland to be used as a detention center for illegals. This facility is a whopping **825,000** square feet on 53 acres.",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck filling it, process them Out of the fucking country!",
                "author": "john9985"
            },
            {
                "raw_content": "cant we just get bezos to ship the illegals with amazon prime?",
                "author": "GoodvsEvil2"
            },
            {
                "raw_content": "They've picked up at least two more in PA as well. Seems like maybe they're gonna start picking up the pace here in the near future.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's amazing how the MSM has the average NPC believing JE was \"Trump's Friend\"",
        "score": 871,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck this gay ass shit. I spent like a man-week of my life going through the files and watching 4chan. Even the propagandists in /pol/ have NOTHING on Trump because there is nothing. Except that he helped to have Epstein arrested in '06.",
                "author": "MichiganRepublic"
            },
            {
                "raw_content": "Trump's honestly dead to me if he does nothing about it.",
                "author": "603taco"
            },
            {
                "raw_content": "Well when you let them be propaganda arms this is what you get",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Protestors” are OUTRAGED after President Trump ordered the gay flag be TAKEN DOWN on federal property in NYC",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm gay. The pride flag has NO business being flown near the US flag. It's gross to even conflate the two. But watch this will be used to discredit Trump as somehow being anti-LGBT despite the fact that (A) one of his favorite musicians is gay, (B) his mentor was gay, (C) he was the first Republican nominee to hold up the pride flag during his campaign run, (D) hosted numerous gay weddings at Mar A-Lago, and many other things I don't care to list.",
                "author": "grimthoughts"
            },
            {
                "raw_content": "Fags",
                "author": "ganachain"
            },
            {
                "raw_content": "fly the superstraight flag 🟧⬛️",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "People need to go to jail",
        "score": 857,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why wasn't this done on day 1 ?",
                "author": "chicagoindustrial"
            },
            {
                "raw_content": "Isn’t this about the 15th time Trump has ordered this?",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "Nobody is never arrested so who cares?. It's like an on-going humiliation ritual for the Goyims to watch. The small hats allow you to see all the hidden hand operations but laugh as you say OK arrests when?. It's like they want you the Goyim to seek justice for yourselves so they can roll the Drone Fleets on you and kill you on your Front lawns like the movie \"Gray State\". All Fake and 100% gay.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Law enforcement has ARRESTED one individual, but Nancy Guthrie remains missing, as reported by Fox.",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is this stickied? Who fucking cares about this bitch. So fucking gay. Edit: the people have spoken. Get this shit out of here.",
                "author": "Trump2020or4eva"
            },
            {
                "raw_content": "Gonna be someone who worked there or knew someone who did. In Cold Blood - 2026.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "",
                "author": ""
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna: I’d say there are several highly corrupt members of Congress seeking re-election. Ethics will do nothing about it. It’s on both sides.",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any \"Republican\" who votes against the save act needs to be immediately campaigned against, there should be no exceptions.",
                "author": "Ikon"
            },
            {
                "raw_content": "We need arrests, convictions and HANGINGS!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Why would they \"do\" anything about their own corruption? They have even set up a slush fund of YOUR tax-payer money to cover up all of their illicit behavior. Hello, is this thing on?",
                "author": "DJT4MoreYears"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mentally-Illinois Democrat Senator Dick Durbin says he will NOT vote for the SAVE Act, claiming that it is a \"terrible idea\" because people might not be able to provide documents proving they are citizens. Anyone who opposes voter ID just wants to CHEAT.",
        "score": 1047,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s right, the Save Act needs to be amended to the constitution to be effective",
                "author": "ConfederateSon"
            },
            {
                "raw_content": "Nobody actually believes their \"reasons\" for opposing it....we all know the real reason is that they want to cheat. Why do we pretend that they actually have arguments. We know they are lying - they know we know they are lying - and we know that they know that we know they are lying.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "It would be retarded for a Democrat to vote for the SAVE act. If we have free and fair elections, Dems are cooked.",
                "author": "okboomer59"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who the fuck is Jeffries to say shit like this? Or even make that call.",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't recognize him without the hat and moustache.",
                "author": "DeploraBen"
            },
            {
                "raw_content": "He's a faggot who thinks he can control them through their budget except they have funding for the next 4 years so just ignore the bitch. Obama light needs to get deported.",
                "author": "Oruin"
            },
            {
                "raw_content": "Jeffries Epstein",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All of these nurses from National Nurses United need to lose their licenses. They’re suggesting they will target ICE to protect illegals. \"We will crush ICE for our patients!' MAKE THEM FAMOUS.",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You never want a fat nurse, I tell you what. Those gals lumber through the day slow and logy.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "\"Women were a mistake\" - Adam",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "National Nurses United is a DC-based far-left labor union for nurses. They're very politically active, organizing bus tours, endorsing Dem candidates, and lobbying for legislation. They endorsed Kamala. Before that, they endorsed Bernie. Their executive director is Puneet Maharaj. Their website says she's \"met the moment for Trump 2.0...\" https://www.nationalnursesunited.org/puneet-maharaj Lots of stuff on their website advocating for social justice, racial justice, gender justice, environmental justice, etc. I guess they find time for patients in there somewhere (hopefully.)",
                "author": "PorchLightOn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Judge Unseals Warrant and Affidavit of Probable Cause for FBI Search Warrant of Fulton County 2020 Election Records",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HIT THEM BACK **TEN TIMES HARDER**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "What about those 50 or so boxes that were moved ahead of the raid... where are those?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "18,000 ballots weren't scanned in a single county + thousands more scanned multiple times. Yes you could certainly swing an entire state if the margins are that close. Only 12k votes determined the state.",
                "author": "HorrorGameDev"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "According to DHS, the illegal migrant escaped arrest and fled on foot, before slipping and falling, hitting his head.",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Slipped on some ICE.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Should have just beat him. Take the W for breaking his skull and let em know the laws coming.",
                "author": "CrackerSmurf2"
            },
            {
                "raw_content": "Too bad he slipped. Tragic.",
                "author": "LegendFang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣 Alex Stein speaks at Plano city council meeting while identifying as an Indian man.",
        "score": 1012,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMFAO XD The Pimp on a Blimp, does it again! XD",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Kek, the lone clapper at the end 👏",
                "author": "Illah88zillah"
            },
            {
                "raw_content": "His best one ever",
                "author": "KD355A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Border tensions: two perspectives",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# MORE # FASTER",
                "author": "MichiganRepublic"
            },
            {
                "raw_content": "AI pics with fake stats getting stickied now?",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "3 million have not been deported 71,405 were deported in 2025 https://www.ice.gov/statistics",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John Thune throws cold water on filibuster change",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "John Thune will be known as the person who triggered the second civil war.",
                "author": "Greenhills"
            },
            {
                "raw_content": "To no one's surprise a RINO is acting like a RINO. The depressing thing is Trump would rather go after Massie for trying to bring Justice for the Epstein victims and mildly criticizing Isreal than this faggot who REFUSES to pass any part of the Trump agenda, he can't even confirm all of Trump's nominees!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "https://www.thune.senate.gov/public/index.cfm/contact Senator John Thune United States Senate SD-511 Washington, DC 20510 Phone: (202) 224-2321 Fax: (202) 228-5429 Toll-Free: 1-866-850-3855 It only takes a few minutes of your time. You could do it in between commercials or while scrolling for the next YouTube video. Stop letting others do all the work. Time to pick up the slack.",
                "author": "mailinvoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "G.Skill settles with U.S. plaintiffs following $2.4 million class action lawsuit over advertised memory speeds, denies all wrongdoing — company will have to change its packaging and be clearer about overclocking and BIOS adjustments if approved",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've only bought G.Skill for like the last 15 years, does Corsair etc have these labels on their boxes or is the lawsuit only targeting G.Skill becuse they make the best shit?",
                "author": "The-Choo-Choo-Shoe"
            },
            {
                "raw_content": "This is one of the dumbest lawsuits out there. The RAM does exactly what it's advertised to do when properly configured and all it takes is a few clicks. Starting in a \"compatibility mode\" is a feature, not a bug.",
                "author": "Intrepid_Lecture"
            },
            {
                "raw_content": "I'm not getting the memory speeds on my Gskill ram simply because I cant use expo on AM5 without issues. And yes I've tried multiple setting changes and bios updates. Not a big deal but still.",
                "author": "heymikeyp"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DeepComputing unveils RISC-V mainboard compatible with Framework 13",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone knowledgeable on RISC-V know what the performance level of this CPU is? And how it compares to the JH7110 currently available from Framework?",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "Is this a yearly release from them at this point? I know the last deepcomputing risc-v board for the framework has 8gb of ddr4 so this is a clear upgrade",
                "author": "SnooOranges3779"
            },
            {
                "raw_content": "We need one or more industry-wide open x86_64/UEFI/ACPI [SoM](https://en.wikipedia.org/wiki/System_on_module) standards, similar to the Broadcom/Pi [Compute Module](https://www.youtube.com/watch?v=Ef70x0izkFU). Or, a cross-ISA SoM standard, if that can be managed. Then we'll have an ecosystem across laptops, SBC carrier boards, MiniPCs, cases, etc. Absent that, a *de facto* standard around FW13 motherboards is better than nothing. But we can do better.",
                "author": "pdp10"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung: \"Expanding CPU Capabilities for On-device AI with Arm SME2 [as implemented in the Exynos 2600]\"",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a nice explainer of SME and the theoretical benefits of CPU matrix extensions, but samsung neglects to mention any specific features of theirs that take advantage of it.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TrendForce forecasts memory revenue to outpace foundry over 2.5 times",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leaked Exynos 2600 GPU benchmark hints at minor performance lead over Snapdragon 8 Elite Gen 5",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Exynos is the always the best in leaks.",
                "author": "Creative_Purpose6138"
            },
            {
                "raw_content": ">Performance-wise, the Xclipse 960 is about 10% faster than the Snapdragon 8 Elite Gen 5’s Adreno 840 GPU. This is a ray tracing benchmark, so I was expecting Exynos to have a bigger lead since ot uses RDNA4 (which has great RT). Qualcomm is lagging in RT. In 3DMark Solar Bay Extreme, 8 Elite Gen 5 has like half the performance of A19 Pro and Dimensity 9500.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "honestly dont care about performance, i just want it to be efficient and not run too hot",
                "author": "iucatcher"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How and When the Memory Chip Shortage Will End",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It didn’t answer anything.",
                "author": "pelouskopelo"
            },
            {
                "raw_content": "It will end once OpenAI finally runs out of money and goes under, as it deserves.",
                "author": "Threaded-Needles"
            },
            {
                "raw_content": "It won't end any time soon. There's a handful of companies owning the majority of all patents related to memory chips.",
                "author": "LargeSinkholesInNYC"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory Chip Squeeze Widens Gap Between Market Winners and Losers",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And now the US government might break the market by excempting some companies from tarrifs.",
                "author": "RealPjotr"
            },
            {
                "raw_content": "Relevant quotes, where they say \"the market\" considered memory tightness to be a short-term deal, but people are starting to come around to the view that it might last longer: > “What remains underappreciated is the risk around duration — current valuations largely factor in that the disruption will normalize within **one to two quarters**,” said Vivian Pai, a fund manager at Fidelity International. “We believe industry tightness is likely to persist,” possibly through the rest of the year, she added. > [...] Charu Chanana, chief investment strategist at Saxo. “The market broadly understands that memory prices are up and supply is tight — that’s no longer new information, so I would assume that’s priced in. But it does look like the timeline of this supply tightness is now starting to be questioned.” > [...] “Historically the memory cycle normally lasted 3-4 years,” said Jian Shi Cortesi, a fund manager at GAM Investment Management in Zurich, adding that she has been holding memory chip shares for a long time. “**The current cycle already exceeded the previous cycles** both in length and magnitude, and we are not seeing demand momentum softening.” Also Bloomberg's data has higher price growth than trendforce for RAM and NAND.",
                "author": "Boreras"
            },
            {
                "raw_content": "The crashout from this will be the ultimate train wreck. Personal prediction: one of the big 3 memory producers goes bankrupt, and we are left with 2 + China.",
                "author": "jigsaw1024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Picked up Hades 2 today!!",
        "score": 408,
        "text_content": "Im a huuuge fan of the first one, and I can already tell based off of what I seen, I'll love this one too. Plus 120 fps is the cherry on top.",
        "comments": [
            {
                "raw_content": "Nice! One of the best games on the system, in my opinion. Was so into it I actually went out and got a book on Greek mythology to read alongside my playthrough.",
                "author": "elephvant"
            },
            {
                "raw_content": "The spine arts on the cases are nice, aside sparkling zero and daemon x machina.",
                "author": "GrayhavenStudios"
            },
            {
                "raw_content": "I had this on pre-order the second I read it’s a proper physical release (i.e. both Switch and Switch 2 versions on the cartridge). I love the first game and the sequel certainly does not disappoint!",
                "author": "KnightRoom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just received my copy of Mario Tennis Aces early! Some pics + first impressions",
        "score": 419,
        "text_content": "Bought this game for $50 during the Target sale. It's running at 4k 60 (upscaled via dlss) and looks really nice on my 4K TV. It has a small update and the game loads extremely fast (1-2 seconds from main menu). Gameplay is similar to Aces but the animations look a lot more clean and the new character designs are appreciated and the new fever rackets are a blast. It's a fun time if you like Mario Tennis!",
        "comments": [
            {
                "raw_content": "I am a bit cautious after the Mario Strikers game I bought the day it got published.",
                "author": "fortuneman7585"
            },
            {
                "raw_content": "you mean Fever?",
                "author": "Legitimate_Dot_7311"
            },
            {
                "raw_content": "Daisy is sick https://preview.redd.it/d6y9b7eerpig1.jpeg?width=4032&format=pjpg&auto=webp&s=264c5b3e57c415a2f04c61f767955441edc7ee27",
                "author": "Icalivy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Look what came a few days early",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Target? Got mine too. Played a bit. It’s, well… Mario tennis. For me at least, of all the games to get early this is probably the absolute least exciting lol",
                "author": "JustinAndFeena"
            },
            {
                "raw_content": "Target hooked me up with mine too",
                "author": "GrimmTrixX"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Subnautica, Subnautica: Below Zero reveal new Nintendo Switch 2 Editions",
        "score": 296,
        "text_content": "I hope the game actually looks better and it’s not just a framerate/resolution boost, but it’s still great to see! Another game I was waiting until the Switch 2 to play. [https://nintendoeverything.com/subnautica-subnautica-below-zero-reveal-new-nintendo-switch-2-editions/](https://nintendoeverything.com/subnautica-subnautica-below-zero-reveal-new-nintendo-switch-2-editions/)",
        "comments": [
            {
                "raw_content": "Maybe time to get these, everyone praises them up and down.",
                "author": "Arktos22"
            },
            {
                "raw_content": "Oooo I wouldn’t mind playing Subnautica again. So good. Also own Below Zero the entire time but I’ve never finished it. Perhaps time to do that too",
                "author": "darthdiablo"
            },
            {
                "raw_content": "More games need to target 1440p for docked",
                "author": "Thin_Molasses_2561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "RUMOR: Nintendo General Direct 3rd Week of Feb w/ Next 3D Mario! Fresh from @Attackdabacklog podcast w/ @NWeedle: - Big 3D Mario CONFIRMED (same sources that predicted DK in Switch 2's 1st Direct) - Multiple sources: 3rd week Feb - March leaks shifted earlier",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is one of those absolutely nobody will believe them until it happens type scenarios.",
                "author": "MischiefSculptor"
            },
            {
                "raw_content": "I should not trust nashweedle in the slightest he is really 50/50 with his leaks.",
                "author": "itzjabohy"
            },
            {
                "raw_content": "If this end suo true then dam Partner showcase 1st week 30 minuites Sony state of play 2nd week 60 minuites General direct. 3rd week Pokemon presents last week 35 minuites",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just bought Dragon Quest VII Reimagined",
        "score": 61,
        "text_content": "I’m not really a big DQ fan but I really enjoyed the demo so I ended up buying this game. Hopefully that $60 was well spent.",
        "comments": [
            {
                "raw_content": "I’ve never played a Dragon Quest but found the demo very enjoyable. Do you usually play RPGs?",
                "author": "Despacio1316"
            },
            {
                "raw_content": "Never played a DQ game but this looks pretty good",
                "author": "immabeasttt15"
            },
            {
                "raw_content": "It starts at little slow, but once it gets going it excellent!",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever - Review Thread",
        "score": 93,
        "text_content": "Game Information -------------------- **Game Title**: Mario Tennis Fever **Platforms**: - Nintendo Switch 2 (Feb 12, 2026) **Trailer**: **Review Aggregator**: **[OpenCritic - 75 average - 70% recommended - 23 reviews](https://opencritic.com/game/19292/mario-tennis-fever)** Critic Reviews ------------- **[BioGamer Girl](https://opencritic.com/outlet/986/biogamer-girl)** - [Mandy Valentine ](https://opencritic.com/critic/11634/mandy-valentine-) - [9 / 10](http://www.biogamergirl.com/2026/02/mario-tennis-fever-nintendo-switch-2.html) >Mario Tennis Fever blends classic arcade energy with refined mechanics, delivering one of the most fun and competitive Mario sports games to date. ------------- **[CGMagazine](https://opencritic.com/outlet/82/cgmagazine)** - [Jordan Biordi](https://opencritic.com/critic/378/jordan-biordi) - [9 / 10](https://www.cgmagonline.com/review/game/mario-tennis-fever-nintendo-switch/) >Mario Tennis Fever combines the same fun and technicality of the classics in the series with a wealth of variety and new ideas that make it one of the best in the series. ------------- **[COGconnected](https://opencritic.com/outlet/94/cogconnected)** - [James Paley](https://opencritic.com/critic/2831/james-paley) - [86 / 100](https://cogconnected.com/review/mario-tennis-fever-review/) >Although I didn’t really vibe with the campaign mode, I still recognize its usefulness. I also wish those motion controls could be used in every other part of the game. If you want a more aggressive, fast-paced tennis game that’s also colorful, cute, and accessible, Mario Tennis Fever is an excellent choice. ------------- **[Cerealkillerz](https://opencritic.com/outlet/465/cerealkillerz)** - [Steve Brieller](https://opencritic.com/critic/9606/steve-brieller) - *German* - [8 / 10](https://cerealkillerz.org/review-mario-tennis-fever-spiel-satz-und-sieg/) >The story mode of Mario Tennis Fever turns out to be a disappointment, lasting three to four hours, mainly due to its pointless experience point system and the unbearably sluggish first chapter. In the other modes, this is partially offset despite the overall low difficulty level. However, the positively chaotic tennis gameplay truly comes into its own—unsurprisingly—in multiplayer with up to four players. That said, Camelot definitely could have done more with it. ------------- **[Console Creatures](https://opencritic.com/outlet/798/console-creatures)** - [Bobby Pashalidis](https://opencritic.com/critic/7698/bobby-pashalidis) - [8 / 10](https://www.consolecreatures.com/mario-tennis-fever-review/) >Mario Tennis Fever is easily Nintendo's best Mario-themed tennis game in ages. Filled with tons of racket types and characters to unlock, the fun you have playing online or against the CPU never falters or feels stale. I've had such a great time diving into the pretty solid Adventure mode and Trial Towers. The strategic layers the game adds through various racket types go a long way and mesh well with the fast pace of tennis. ------------- **[Digitec Magazine](https://opencritic.com/outlet/887/digitec-magazine)** - [Domagoj Belancic](https://opencritic.com/critic/10266/domagoj-belancic) - *German* - [4 / 5 ](https://www.digitec.ch/de/page/41463) >Mario Tennis Fever gets a lot right and offers a solid amount of content, even if many of its single-player modes are on the easy side. The game truly shines in multiplayer. The tennis gameplay is fast-paced, and the controls feel intuitive and reliable. The wild “Fever” rackets expand the core mechanics with devastating special attacks. The system works well, even though doubles matches can sometimes descend into excessive chaos. Visually, Mario Tennis Fever shows major improvements over its predecessor, with the exception of the rather dull environments in Adventure Mode. ------------- **[Enternity.gr](https://opencritic.com/outlet/783/enternity-gr)** - [Nikitas Kavouklis](https://opencritic.com/critic/7434/nikitas-kavouklis) - *Greek* - [8 / 10](https://www.enternity.gr/Article/Games/Reviews/mario-tennis-fever-review/100153.html) >With Mario Tennis Fever, Nintendo is showing its intentions for 2026 early on. Fun for everyone, without limits. Even if you don't like sports, it's worth giving it a try. ------------- **[Eurogamer.pt](https://opencritic.com/outlet/832/eurogamer-pt)** - [Bruno Galvão](https://opencritic.com/critic/6156/bruno-galv-o) - *Portuguese* - [4 / 5 ](https://www.eurogamer.pt/mario-tennis-fever-review-uma-febre-que-da-gosto) >Mario Tennis Fever is another simple but highly ingenious effort from Camelot and Nintendo, which captures the flavor of the golden age of arcades in a way that few others can. Its solo strength is much more fragile, but played with company it becomes one of Nintendo's most enjoyable games in recent years. ------------- **[GAMES.CH](https://opencritic.com/outlet/762/games-ch)** - [Benjamin Braun](https://opencritic.com/critic/4867/benjamin-braun) - *German* - [80%](https://www.games.ch/mario-tennis-fever/test/review-mLo/) >Quote not yet available ------------- **[GRYOnline.pl](https://opencritic.com/outlet/559/gryonline-pl)** - [Filip Melzacki](https://opencritic.com/critic/10885/filip-melzacki) - *Polish* - [5 / 10](https://www.gry-online.pl/recenzje/recenzja-mario-tennis-fever-bez-goraczki-innowacji/z648d6) >Mario Tennis Fever is a decent tennis game with its biggest problems being a lack of innovation, simplified gameplay, and a very weak story mode. If you're a fan of the series and don't care about online play, stick with Tennis Aces. Newcomers may appreciate it for its more robust single-player content and still quite enjoyable core mechanics. ------------- **[GamesRadar+](https://opencritic.com/outlet/91/gamesradar-)** - James Nouch - [3.5 / 5 ](https://www.gamesradar.com/games/sports/mario-tennis-fever-review/) >The experience of hurling ink and mud and fireballs at your friends - while some small part of your brain tries to still think about court positioning and slices and dropshots - is riotous, hilarious, chaotic fun. It's just a shame that, at launch at least, Mario Tennis Fever can't serve up a more complete package. ------------- **[Gfinity](https://opencritic.com/outlet/803/gfinity)** - [Alister Kennedy](https://opencritic.com/critic/10213/alister-kennedy) - [7 / 10](https://www.gfinityesports.com/article/mario-tennis-fever-a-party-ace-that-nets-a-fault-in-solo-play) >Mario Tennis Fever is a visual powerhouse that showcases the Switch 2’s potential with vibrant graphics and lightning-fast load times, yet it struggles to find its footing on the court. While the \"Fever\" mechanics and chaotic multiplayer modes make it an instant party-night favorite, veteran players will be disappointed by floaty physics and a lack of mechanical precision compared to Aces. Without the heart of a deep story mode or a robust tennis engine, it stands as a polished, high-octane spectacle that prioritizes casual fun over competitive depth. ------------- **[Giant Bomb](https://opencritic.com/outlet/132/giant-bomb)** - [Jeff Grubb](https://opencritic.com/critic/1047/jeff-grubb) - [3 / 5 ](https://giantbomb.com/reviews/mario-tennis-fever) >Mario Tennis Fever has me worried for Nintendo’s sports games on Switch 2. It’s not worse than any of the sports games on Switch 1, but it’s also not any better. The trouble is that it commits almost all of the same sins: the mechanics are solid, but nothing outside of the core tennis gameplay is that much fun. ------------- **[Glitched Africa](https://opencritic.com/outlet/687/glitched-africa)** - [Marco Cocomello](https://opencritic.com/critic/2466/marco-cocomello) - [8 / 10](https://www.glitched.africa/mario-tennis-fever-review-yes-this-is-the-best-mario-sports-game-yet/) >Mario Tennis Fever is crammed with fun and engaging content that goes from accessible to challenging. It feels so satisfying to play and packs a robust campaign mode that I wasn’t expecting to be as deep and detailed. Overall, this is no doubt the best Mario sports game yet. ------------- **[IGN Italy](https://opencritic.com/outlet/477/ign-italy)** - [Arturo Perrotta ](https://opencritic.com/critic/11198/arturo-perrotta-) - *Italian* - [8 / 10](https://it.ign.com/mario-tennis-fever/223558/review/mario-tennis-fever-la-recensione) >Mario Tennis Fever is pure, unbridled fun: fast-paced, chaotic, and incredibly addictive. A perfect ace for one of Nintendo's most solid and spectacular sports spin-offs. ------------- **[IGN Spain](https://opencritic.com/outlet/471/ign-spain)** - [Marcos Catalán](https://opencritic.com/critic/10228/marcos-catal-n) - *Spanish* - [8 / 10](https://es.ign.com/mario-tennis-fever/226445/review/analisis-de-mario-tennis-fever-nintendo-aprende-y-nos-da-el-set-y-juego-y-partido-completo) >With a mix of continuity and innovation, Mario Tennis Fever achieves what it sets out to do, which is nothing less than entertain. This time, we'll also have a complete game right from the start. For the next one, the story mode will need to be polished up, as it's nothing more than a slightly long and underutilized tutorial. ------------- **[LevelUp](https://opencritic.com/outlet/454/levelup)** - *Spanish* - [8.5 / 10](https://www.levelup.com/reviews/mario-tennis-fever/) >Mario Tennis Fever is the most complete entry in the series so far. The game offers fast-paced matches, creative power shots, and a surprisingly stable online mode. While motion controls feel inaccurate and disappointing, the core gameplay, large character roster, and multiplayer options make it a very fun and engaging experience on Nintendo Switch 2. ------------- **[PPE.pl](https://opencritic.com/outlet/642/ppe-pl)** - [Wojciech Gruszczyk](https://opencritic.com/critic/5528/wojciech-gruszczyk) - *Polish* - [7.5 / 10](https://www.ppe.pl/recenzje/399167/mario-tennis-fever-recenzja-gry-najwieksza-ekipa-wkroczyla-na-kort.html) >Mario Tennis Fever works best as a party game: 2-4 players, lots of excitement, and constant reactions to Fever Shots. Fever Rackets really change the game and add a cool layer of tactics, especially in doubles. The problem is that the content unlocks quickly, and Adventure mode is more of a drawn-out tutorial than a full campaign. If you're looking for a “couch” title, it's definitely worth it, but don't expect exceptional solo fun. ------------- **[SECTOR.sk](https://opencritic.com/outlet/615/sector-sk)** - [Matúš Štrba](https://opencritic.com/critic/5090/mat-trba) - *Slovak* - [8 / 10](https://www.sector.sk/recenzia/40441/mario-tennis-fever.htm) >Mario Tennis Fever delivers fast, accessible arcade tennis backed by impressive depth and an abundance of modes. Its strong local and online multiplayer ensures long-term appeal, even if the game rarely surprises and mainly refines familiar ideas. A polished and highly enjoyable iteration rather than a bold reinvention. ------------- **[Spaziogames](https://opencritic.com/outlet/502/spaziogames)** - *Italian* - [8.5 / 10](https://www.spaziogames.it/articoli/recensione-mario-tennis-fever) >Mario Tennis Fever hits its main goal by putting the pure arcade tennis experience front and center. Fast-paced, fun, and built on several smart ideas, above all is extremely solid in its core mechanics. While the single-player campaign is less engaging than in the previous entry, and the potential of motion controls is largely left unexplored, these shortcomings do little to overshadow what ultimately stands as the most mature and refined chapter in the Mario Tennis saga. ------------- **[Stevivor](https://opencritic.com/outlet/424/stevivor)** - [Ben Salter](https://opencritic.com/critic/3160/ben-salter) - [6 / 10](https://stevivor.com/reviews/mario-tennis-fever-review-coz-im-breaking/) >Mario Tennis Fever is also a letdown as one of the first Switch 2 exclusives. There’s little that feels truly current-gen, and some of the visuals are surprisingly basic and rough. ------------- **[TheSixthAxis](https://opencritic.com/outlet/68/thesixthaxis)** - Steve C - [8 / 10](https://www.thesixthaxis.com/2026/02/10/mario-tennis-fever-review-switch-2/) >Mario Tennis Fever is another highly polished and enjoyable entry in the series that is well worth picking up for fans and newcomers. I'm not sure it renders its Switch predecessor Aces completely redundant, given the Switch 2's backward compatibility, but anyone who is after a new approach will find much to enjoy here. Assuming that the netcode is solid post-launch, then you should have a lot of fun with Mario and his friends. ------------- **[VGC](https://opencritic.com/outlet/821/vgc)** - [Chris Scullion](https://opencritic.com/critic/4391/chris-scullion) - [3 / 5 ](https://www.videogameschronicle.com/review/mario-tennis-fever/) >Mario Tennis Fever is another solid enough sports game from Camelot, but a disappointingly short single-player offering and a real risk of imbalance – whether using Fever Rackets or not – means what could have been fantastic will have to settle for simply being good. -------------",
        "comments": [
            {
                "raw_content": "It seems exactly in line with Mario tennis and better than aces. So I’m buying this",
                "author": "Banks201"
            },
            {
                "raw_content": "Looks like a $40 game that they are charging $70 for.... Could be a decent amount of fun for $40, but not $70.",
                "author": "Liability049-6319"
            },
            {
                "raw_content": "I'm looking for answers to these questions and haven't found yet : - what are the online modes like? 3-round tournaments like Aces? More variety? - what's the frame rate like in split-screen? In gameshare? - how is stuff unlocked? Does it give incentive to play online? Play solo? Does it look like we will still have things to unlock 3 months from now? - is there anything like online timed events? I'm thinking Splatoon splat fests, or tournaments over a week or something?",
                "author": "Groditor"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Someone already got the Switch 2 Light Purple and Light Green Joycons early and are on eBay",
        "score": 27,
        "text_content": "Found a listing when trying to look for a second pair of joycons where I found someone is already selling them and got it 2 days early",
        "comments": [
            {
                "raw_content": "Are these not available yet? I saw them at bestbuy today",
                "author": "TheAusAmerican"
            },
            {
                "raw_content": "Saw them on a shelf at Walmart today",
                "author": "Arab_Chief"
            },
            {
                "raw_content": "I saw them at Best Buy several weeks ago.",
                "author": "icy1007"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IFYOO joycon 2 grips",
        "score": 13,
        "text_content": "I highly recommend these grips for $18 off of Amazon if you just use regular joycons. They are much more comfy and easy to put on and take off. Glad I saw someone mention these in a comment and wanted to pass the word on. Add any other accessories here that you think might help people out if you'd like!",
        "comments": [
            {
                "raw_content": "I just got the same ones today, but with a different name. They are pretty nice for the price!",
                "author": "JTMx29"
            },
            {
                "raw_content": "I just got [these ](https://www.etsy.com/listing/4375698069/nintendo-switch-2-split-grips-pro?ref=yr_purchases)and they're 95% perfect. They make playing handheld effortless, zero discomfort, and are as easy as you could want them to be. They also feel exactly as snug as you would want them to feel. Like those joycons are never going to slip out, but also it'll never scratch them. The seller is also super responsive and kind and helpful which rules. For some reason Etsy told me they had been delivered but I didn't see them, so I was messaging the seller about it and we were gonna wait a few days before they would just send me another set. An hour later they got dropped off properly (must've just been a mistake) and I got on the horn with the seller and let them know they had arrived. But I was very impressed with how quickly they responded to me and how perfectly accommodating they were willing to be about the situation, very understanding and very cool. I also suggested to them that they add a loop for wrist straps at the bottom of the grips so that you can play with them free hand and not worry about launching them at the TV and they said they would look into updating them! I thought that was cool. So all in all an easy 10/10, even with the loop missing for wrist straps. edit: oh! and small detail that makes a huge difference, they have a supporting \"anchor\" on each joycon that basically puts a small hand on the back of the Switch 2 itself so when you're holding it with one hand you don't feel like all of the weight of the system is going straight to the joy-con connector. It's so good lol https://preview.redd.it/dtyy35wd6sig1.png?width=794&format=png&auto=webp&s=be6671628ff24c01f573e75f5db6ecf90b92540e",
                "author": "overtunerfreq"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shpeshal Nick: Wii, DS, and Sega CD coming to Switch Online",
        "score": 363,
        "text_content": "[https://xcancel.com/Shpeshal\\_Nick/status/2019608756057997739#m](https://xcancel.com/Shpeshal_Nick/status/2019608756057997739#m) Wii remote won't need a sensor bar DS will use an extra screen",
        "comments": [
            {
                "raw_content": "That extra screen will be 150 buckos I bet",
                "author": "mrtars"
            },
            {
                "raw_content": "They are never gonna give us Twilight Princess HD are they",
                "author": "RelevancyIrrelevant"
            },
            {
                "raw_content": "People have said this for a while, it makes sense. I don't know that this is much of a leak or how reliable Shpeshal Nick is these days though. Sick if true",
                "author": "Hydroponic_Donut"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: New details on the cancelled Rebecca-focused RE Revelations game",
        "score": 181,
        "text_content": "full thread on XCancel: [ https://xcancel.com/AestheticGamer1/status/2021378400464916676#m ](https://xcancel.com/AestheticGamer1/status/2021378400464916676#m) see also: details regarding a cancelled RE6 DLC campaign that would've chronicled what Claire and Moira were doing during the game's events, alongside a Barry-centred DayZ clone which went by the name of Biohazard Z: [ https://xcancel.com/AestheticGamer1/status/2021384516552818973#m ](https://xcancel.com/AestheticGamer1/status/2021384516552818973#m)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I hate when games are scrapped/cancelled. University and fighting with items near character seems very interesting. Like Dead Rising but in RE a bit",
                "author": "Martinez_Majkut"
            },
            {
                "raw_content": "I remember reading about a Wii U version of RE6 ages ago that had a Claire campaign. Wonder if that's related lol",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More Chinese Marathon Leaks",
        "score": 91,
        "text_content": "This video shows some gameplay of the dire marsh map event. A comment by user \"marathonfan\" describes the event as follows: \"Lockdown\" is a large-scale PvE event that occurs on the \"Abyssal Swamp\" map. Approximately 15 minutes later, a Point of Interest (POI) may be locked down and surrounded by red bubbles. To trigger this event, you need to use the \"HEC\" consumable. This consumable allows you to enter the red bubble without taking damage for 45 seconds and press a switch to close it. After pressing the switch, three waves of enemies will spawn; be sure to kill them one by one. The final wave will have a boss. After defeating the boss, you will receive the first wave of loot and a keycard. Afterwards, the locked-down area will move (it could be \"Algae Pool,\" \"Isolation Zone,\" or \"Comprehensive Facility\"), and this process will repeat up to three times. Each time you increase the difficulty level, you need to use a keycard from the previous level. [https://www.bilibili.com/video/BV1LrFZz6EGC](https://www.bilibili.com/video/BV1LrFZz6EGC)",
        "comments": [
            {
                "raw_content": "My dumb ass thought the title meant they're making a separate Chinese version of Marathon",
                "author": "Ordinal43NotFound"
            },
            {
                "raw_content": "that sounds like public event from d2",
                "author": "Alwrynn019"
            },
            {
                "raw_content": "Don’t think these are even leaks, Bungie did an event in China and approved people from this event to talk about and share footage.",
                "author": "Careless_Main3"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "billbil-kun/Dealabs: PS+ Extra February lineup includes Marvel’s Spider-Man 2 (PS5)",
        "score": 397,
        "text_content": "Other two games are: - Test Drive Unlimited Solar Crown (PS5) - Neva (PS5/PS4) Source: https://www.dealabs.com/magazine/ps-plus-extra-une-grosse-exclusivite-ps5-debarque-ce-mois-de-fevrier-61029",
        "comments": [
            {
                "raw_content": "This seems quick, it’s still occasionally in the top few dozen sellers each month so it’s surprising they’re doing it",
                "author": "Vast-Cranberry6105"
            },
            {
                "raw_content": "When does it get added exactly?",
                "author": "xCreampye69x"
            },
            {
                "raw_content": "Announcing Spider-Man 2 for PS+ at the State of Play means we're definitely getting an announcement of the Venom spin-off game, right. ... RIGHT?!",
                "author": "Infamous-Boat-782"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon hands-on event in China impressions leaked",
        "score": 469,
        "text_content": "- First hands on event outside of NA, indicating Bungie's emphasis on the Chinese community. - Blown away most by the expanded worldbuilding/narrative. The tutorial & faction intros give clear origins and motivations. Players can even discover the will of Dr. Strauss, a key-figure who connects many narrative threads from the original Marathon games. - Personal impressions are that the PvE is extremely challenging. AI is constantly calling in reinforcements as time goes on so there is no \"clearing the map\". Environmental hazards like poison gas vents, perimeter turrets and landmines everywhere as well. - Meds/shields are expensive to buy from vendors that by the end of the play session, the reviewer could not even afford them unless he sold all of his buffs - Early combat or PvP is almost guaranteed to be a net loss, expects the high-risk exploration experience to push players to focus on missions to upgrade base stats. Expects there to be little to no player co-operation, calling every enemy player a loot pinata - As for objective improvements since alpha, UI seen a massive overhaul but still finds the UI logic a bit awkward - In-game visuals also seen a massive upgrade, environments giving off a much darker and mysterious tone comparing it to Pathways into Darkness and the original Marathon trilogy - Skill distribution across all classes is fairly balanced allowing for flexible team compositions (multiple Shells have movement abilities). Cosmetic shop and battle pass were unavailable at the event but each runner has six base appearances tied to each faction - 28 guns and each has 2 or more skins with some even altering the weapon model. Each gun has one charm slot and three sticker lots which player can unlock by completing challenges Source: [https://www.bilibili.com/video/BV1JCcPzYEov/](https://www.bilibili.com/video/BV1JCcPzYEov/)",
        "comments": [
            {
                "raw_content": "Looks like they're really going for the hardcore crowd. Risky business, but I can't wait to try it out.",
                "author": "FyLaw95"
            },
            {
                "raw_content": "“Environmental hazards like poison gas vents, perimeter turrets and landmines everywhere as well.” This drove me crazy playing solo queue in the playtests. Most times I died wasn’t from another player or an enemy combatant, it was from the all the poorly telegraphed hazards - like land mines that downed you in one hit.",
                "author": "subjectxen"
            },
            {
                "raw_content": "This lines up with my friend's playtest experience. It's a much more hardcore game than Arc but still nowhere near as hardcore as tarkov or ABI. I'm really interested to see what kind of playerbase it holds onto after launch. Safe to say it won't come anywhere near Arc's popularity but it will surely carve out its own playerbase.",
                "author": "Necrophag1st"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hidden video spotted on Marvel’s Wolverine’s playlist. Gameplay demo or new trailer coming Thursday?",
        "score": 182,
        "text_content": "https://youtube.com/playlist?list=PLol\\_ykYs3OQ4qCOX2fOCd9kPdaFenpCNC&si=6Kc88gaMzE17\\_F0U",
        "comments": [
            {
                "raw_content": "That hidden video is the 2021 announcement",
                "author": "Tugajohn"
            },
            {
                "raw_content": "It's the original teaser trailer from 2021, which has now been removed from PlayStation's channel. IGN has a re-upload of it **[here](https://youtu.be/AF_f8kl8lJQ?si=Q65fwwCr8XUVjoQI)**.",
                "author": "Respawn-Delay"
            },
            {
                "raw_content": "I misread as \"Hideo\" for a second lol",
                "author": "scorchedneurotic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More impressions from Chinese media at the Marathon hands-on event",
        "score": 7,
        "text_content": "* Event was in Shangai in early February, first Bungie event outside of NA * Demo was fully localized, featuring polished & natural Chinese text and VA. Marathon may become one of the first SIE first party games with full Chinese VA * Reviewer’s personal impressions are that the game does not encourage prolonged fights for both PvE and PvP * Gunplay is top-notch and compares the aim-assist to Destiny 2 which each gun having defined AA values * PvP gunfire will attract distant AI transforming them into “world police” to eliminate both sides in one sweep. * PvE robots are not cannon fodder, they have defined roles where some can turn invisible for ambushes, some will deploy shields and some will focus on melee * Commander-type robots function as tactical hubs using real-time orders and co-ordination flanks against players or send some robots to camp downed players. * AI has improved since the alpha, they are not “omniscient radios” anymore that respond instantly to every sound and reinforcements are no longer endless waves. The pressure remains formidable but players have breathing room. * Ammo was extremely scarce and the AI robots rarely dropped ammo and the supply crated yielded very little, leading to early extractions after just 1-2 engagements * Loot distribution felt extremely incosistent, with some POIs having virtually nothing to loot which sucked as the PvE fights already depleted ammo/meds. * The visual/art style makes certain weapon attachment icons extremely abstract making it hard to quickly identify them in high-pressure situations. This can waste precious seconds or even get your loot stolen. * The reviewer was “hoarder-type” player so he was just looting in the shadows solo and wondered “why even fight” * Personal impressions of the reviewer shifted from mild indifference to genuine anticipation * Interview with Joe Ziegler confirmed that each season is 3 months (12 weeks long) * Development dreams and even player expectations (PvE only mode?) will be saved for the future * No safe pocket system at launch, may consider it in future seasons based on player feedback * No aggression-based matchmaking like Arc Raiders to separate co-op players from PvP ones * Larger maps will support up to 18 players (6 squads) and smaller maps will support 12 (4 squads) Source 1: [https://www.ali213.net/news/html/2026-2/998177\\_2.html](https://www.ali213.net/news/html/2026-2/998177_2.html) Source 2: [https://nga.178.com/read.php?tid=46168659&forder\\_by=postdatedesc&rand=230](https://nga.178.com/read.php?tid=46168659&forder_by=postdatedesc&rand=230) Source 3: [https://www.a9vg.com/article/240026](https://www.a9vg.com/article/240026)",
        "comments": [
            {
                "raw_content": "\\>No safe pocket system at launch man that kinda sucks",
                "author": "Cyber_Swag"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD \"Medusa Halo\" APU to Use LPDDR6 Memory",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Medusa Halo is going to be only APU from AMD that will be worth it, considering the others will be stuck to RDNA3.5",
                "author": "dampflokfreund"
            },
            {
                "raw_content": "I don't understand why their big APU line has so many CPU cores. Does the target audience need that many cores?",
                "author": "genericdefender"
            },
            {
                "raw_content": "Likely 2H 2027 at the absolute earliest.",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire Nitro+ B850M Wi-Fi Review",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bargain bin is 200 bucks now?",
                "author": "chipsnapper"
            },
            {
                "raw_content": "Damn, not even 6E? Dead in US at that price with those features",
                "author": "RedLimes"
            },
            {
                "raw_content": "E a atualização do AMD Software?",
                "author": "Ok-Impact6285"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Santa Barbara approves temporary rent freeze; permanent rent stabilization ordinance targeted for 2027",
        "score": 142,
        "text_content": "Key details: Santa Barbara City Council approved a temporary citywide rent freeze. It’s described as the only city in California with a rent freeze about to take effect. The freeze would prohibit many landlords from raising base rent (for rent paid as of Dec. 16, 2025) and runs until Dec. 31, 2026 or until a permanent rent stabilization ordinance is adopted (target Jan. 1, 2027). Exemptions include Section 8, post-1995 housing, single-family homes, some condos, and government housing. Debate in the council: supporters argue it closes an “interim protection” gap while an ordinance is built; opponents say it’s already causing fear/confusion and owners calling agents to list properties.",
        "comments": [
            {
                "raw_content": "I'm in the Midwest so housing isn't as scarce but even here people will complain about housing prices but then show up to every city council meeting to block high density development. Everyone wants more homes... just not near them. It's nuts that this situation persists and housing will only be fixed when the ability to block development is fixed.",
                "author": "dzyp"
            },
            {
                "raw_content": "Rent control doesn't work, the only thing that lowers housing prices is an increase in supply but California is full of NIMBYS so that won't happen",
                "author": "Capital-Giraffe-4122"
            },
            {
                "raw_content": "Rent control just creates a new floor. Rent will never drop below the rated is today regardless of market conditions. It’s a terrible idea and creates a wild misallocation of resources. Why would someone who has a rent controlled place Leave a four bedroom home when they’re empty Nesters? It makes much more sense for them to move into a smaller unit, but that smaller unit will never be as cheap as their four bedroom home so they’ll stay in it forever and a family that actually needs a four bedroom home won’t be able to get into it. Additional supply is the answer. Get rid of red tape and 20 and 30 people at a time need to start showing up to city council meetings to speak on behalf of needing more housing. You need to drown out the voices of the five loud people who are opposition, and I don’t mean that in a protest sort of manner. I mean do it within the rules of the system at the podium",
                "author": "majessa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zillow Profit View Misses on Cool Housing Market, Legal Costs",
        "score": 10,
        "text_content": "https://www.bloomberg.com/news/articles/2026-02-10/zillow-profit-view-misses-on-cool-housing-market-legal-costs Zillow Group Inc. forecast first-quarter profit that falls short of analyst estimates as the home-search site balances legal costs from ongoing litigation and expenses from the company’s partnership with Redfin. The Seattle-based company said Tuesday it sees adjusted earnings before interest, taxes, depreciation and amortization range with a midpoint of $167.5 million for the three months ending March 31, missing Wall Street’s estimates of $182.7 million. The shares fell as much as 8.6% in postmarket trading. The stock had fallen 20% this year through Tuesday’s close. While the US housing market might find some relief in 2026 after mortgage rates fell to their lowest level since 2022, homebuilders are still not confident about the market’s rebound. Fewer home sales and new home builds as well as high prices spell future challenges for Zillow, which makes more money the more activity there is in the housing market. The company is facing other headwinds too, including multiple lawsuits that question Zillow’s market dominance and Google’s decision to test a new real estate advertising format that could rival Zillow’s services. Chief Executive Officer Jeremy Wacksman said the way to think about the current state of the US housing market is in terms of marginal improvements, such as pricing balancing out and slightly lower mortgage rates. “The slope is in the right direction,” he said in an interview. “The challenge is we still have a long way to go. So we’re planning for a little bit of improvement.” Compass Inc. lost a bid last week to temporarily block Zillow’s ban on listings that have been advertised elsewhere first. The Federal Trade Commission also sued Zillow in September to block a $100 million deal that made the company the exclusive provider of information on apartment rentals offered by Rocket Cos.’ Redfin. The company reported fourth-quarter adjusted Ebitda of $149 million, which fell short of analyst estimates.",
        "comments": [
            {
                "raw_content": "This can’t be right. Every Zillow marketing email I get is predicting that every market I’m watching is going up over the next year.",
                "author": "myturn19"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America Slowly Tilts Toward a Buyer’s Market as Listings Pile Up in More Metros",
        "score": 109,
        "text_content": "Miami is on the list... but I think people may be misreading the tea leaves. There were a rash of articles that came out a few weeks ago that everyone was commenting on. It showed that there was a slight exodus of \"Americans\" leaving Florida. The impression they were trying to give is that Miami is a failing city and people were fleeing. The thing is, they were subtle about the use of the word American and / or \"domestic.\" The stat basically said that U.S. Citizens had a net-negative migration to Miami... but Miami continues to grow its population by about 60-80k people a year. They're foreign buyers... and they're paying cash. I don't know why there is a narrative that keeps getting pushed which tries to suggest Florida or Miami (in particular) is on a downward trend... but regardless, it isn't true. What Miami has done under the previous mayor (and continued under this new mayor), is to build as many new residencies as possible. For Miami, this basically means condos... and there have been ***several dozen*** new condos being built in Miami. Check out this link: [Miami Pre-Construction, New Developments & Luxury Condos For Sale](https://miamiresidential.com/new-developments/) It's a hot sheet for new buildings. There's a couple of them that haven't even been completed yet, and the condos are already sold out. The prices range from cheapest at \\~$400k in the burbs, all the way up to 15 million a condo. The price decrease you're seeing is as a result of people leaving the older condos and moving into the newer pricier condos. There's also a smaller market for multi-million-dollar homes, and thus the timeframe will always be longer than a middle-class home in say, San Antonio. For the record, I don't live in Miami... but misleading news articles drive me nuts.",
        "comments": [
            {
                "raw_content": "Miami area, Tampa area, Orlando area, Naples area, hell even Jacksonville are all in buyer's markets. The issue is not people living in the units, it is the amount of investors. Most those homes for sale are from investors trying to get out at the top.",
                "author": "NRG1975"
            },
            {
                "raw_content": "Like in dating, the good ones sell, as long as they don't have crazy demands, the bad ones stay on the market making people wonder what's wrong with them.",
                "author": "Prcrstntr"
            },
            {
                "raw_content": "Miami market shouldn’t be an indicator of any trend. Look up the listing price of any new building in Brickell. It’s becoming a manhattan style market, where the ultra wealthy store money into multi million dollar condos they’ll never live in.",
                "author": "Erosun"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Yields Retreat as Consumers Retrench: 10-Year Treasury Hits 4.14% Following Soft Retail Data",
        "score": 27,
        "text_content": "Good news for mortgage rates and the housing market. 30 year FRM should get firmly below 6% now.",
        "comments": [
            {
                "raw_content": "Ehh, 30 year rates have been in the same general ballpark for a while now. I don't see these momentary ups and downs as all that interesting.",
                "author": "BaluZana"
            },
            {
                "raw_content": "Now if pay jumps 60% we are so back",
                "author": "fewer-pink-kyle-ball"
            },
            {
                "raw_content": "Big move down today in rates. A negative job number tomorrow (delayed from Monday) will further this movement. I see some 5.75% 30 year rates by end of week. And the floodgates will open up on inventory and mortgage apps. Inflation in shelter commences.",
                "author": "Top-Acadia-1936"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Employment numbers come out tomorrow will it affect RE?",
        "score": 2,
        "text_content": "RE is soft , most delinquent FHA loans EVER( Greater than GFC of 2008). Prices super soft in HCOL areas, if job report is bad tomorrow I expect FHA foreclosures to begin FLOODING the market within the next year. Also do you think Trump will get his wish ? He wants to lower interest rates by 200 basis points ? What is your prediction what will happen?",
        "comments": [
            {
                "raw_content": "This admins employment numbers might as well be a random set in Pi.",
                "author": "Blubasur"
            },
            {
                "raw_content": "You don’t want to buy an FHA foreclosure, trust me.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower rates widen mortgage refinance opportunity with affordability near 4-year high",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My guess is affordability might be at a 4 year high, but still 1/3rd of what it was in 2020.",
                "author": "BaluZana"
            },
            {
                "raw_content": "Sub 6% doesn't matter on a basic 700k+ starter home. It's still $5k/mon with taxes, insurance, hoa etc. rates need to be sub 3% to make a difference at these prices",
                "author": "mountainlifa"
            },
            {
                "raw_content": "Whatever happened with that incredibly long mortgage rate that was supposed to be available. Did that ever happen?",
                "author": "73VW-Todd"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Accelerate until everything breaks!",
        "score": 1229,
        "text_content": "Get in bitches we're heading for the Stars",
        "comments": [
            {
                "raw_content": "\"The mushrooms said to me once...\"😆 Upvoted anyway",
                "author": "poigre"
            },
            {
                "raw_content": "Ah Terrence… he went away way to soon… 😥❤️",
                "author": "4n0m4l7"
            },
            {
                "raw_content": "Idk with evrything going on in the US when I hear this guys voice I instantly loose all anxiety",
                "author": "Tensackofmisery"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Banger tweet more relevant than ever",
        "score": 1700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"moving on to study philosophy\". Of course. After making many millions if not billions, you can do whatever you want.",
                "author": "NyriasNeo"
            },
            {
                "raw_content": "What is the average math nerd really going to do with 67 million dollars that he/she can’t do with the 47 million dollars that he/she has already been paid? I mean really. Very few of these “conscientious objectors” are using all the money to fund ai safety or build bunker complexes, which you would do, if you thought we were about to be wiped out.",
                "author": "Scared_Section7911"
            },
            {
                "raw_content": "Eh, wake me when they start saying \"I am moving on to build a small cabin in the center of the South Atlantic Magnetic Anomaly\" or \"I am moving on to spend what little time I have remaining with my loved ones.\"",
                "author": "FaceDeer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Will Smith Eating Spaghetti\" By Seedance 2.0 Is Mind Blowing!",
        "score": 1593,
        "text_content": "Seedance 2.0 officially reached the nano banana pro moment for video clips. what comes next?",
        "comments": [
            {
                "raw_content": "Its hilarious that Will Smith became a benchmarking tool lol",
                "author": "hellcat1592"
            },
            {
                "raw_content": "He literally swallowed so much at once holy shit",
                "author": "boinkmaster360"
            },
            {
                "raw_content": "This has come along way in the past few years. Wonder what the next few years will bring.",
                "author": "SAHpositive"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Another cofounder of xAI has resigned making it 2 in the past 48 hours. What's going on at xAI?",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is obvious, they got bought out by SpaceX Their equity stake was payable out. Time to move on to something new.",
                "author": "ShoshiOpti"
            },
            {
                "raw_content": "I've had enough consequential years for a decade or two.",
                "author": "omn1p073n7"
            },
            {
                "raw_content": "Cash out",
                "author": "crujiente69"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedance 2.0 vs Kling 3.0 vs Sora 2 vs VEO 3.1",
        "score": 240,
        "text_content": "source: https://x.com/wavespeed_ai/status/2020921891163152571",
        "comments": [
            {
                "raw_content": "Messed up by terrible music. Why? Just why?",
                "author": "Longjumping_Area_944"
            },
            {
                "raw_content": "Seedance most realistic",
                "author": "redditissocoolyoyo"
            },
            {
                "raw_content": "Surprised that Veo absolutely messed up the continuity there. On that alone it's the worst. Sora looks the most fake though for the people.",
                "author": "ghoonrhed"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We gave AI agents access to Ghidra and tasked them with finding hidden backdoors in servers - working solely from binaries, without any access to source code.",
        "score": 114,
        "text_content": "https://quesma.com/blog/introducing-binaryaudit/",
        "comments": [
            {
                "raw_content": "Zero day exploit discovery is going to drive corporate adoption of AI tools, IMO. If you aren't scanning your own code to find and patch vulnerabilities, you can be sure someone else is, and they won't be sharing the results with you. Corporations care much more about avoiding a catastrophic hack than they do about saving a little payroll by replacing staff. A couple big fish are going to be caught with their pants down first, but it will be corporate malfeasance to not scan your code with AI shortly after.",
                "author": "fmfbrestel"
            },
            {
                "raw_content": "> However, this approach is not ready for production. Even the best model, Claude Opus 4.6, found relatively obvious backdoors in small/mid-size binaries only 49% of the time. Worse yet, most models had a high false positive rate — flagging clean binaries. Blog answers exactly the question I had upon seeing this post. > A security tool which gives you fake reports is useless and frustrating to use. We specifically tested for this with negative tasks — clean binaries with no backdoor. We found that 28% of the time models reported backdoors or issues that weren’t real. For any practical malware detection software, we expect a false positive rate of less than 0.001%, as most software is safe, vide false positive paradox. Gemini 3 has a false positive rate of **65%** The authors themselves basically say these are damn near useless for this task right now, you can't really trust it. It's interesting work but yeah, nowhere near useful yet.",
                "author": "tenchigaeshi"
            },
            {
                "raw_content": "where is 5.3 codex?",
                "author": "KeyCall8560"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kobe Bryant in Arcane Seedance 2.0, absolutely insane!",
        "score": 606,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He should probably take the bottle cap off before drinking the juice, but otherwise it's pretty flawless.",
                "author": "ItsTheOneWithThe"
            },
            {
                "raw_content": "He drank soda with lid on",
                "author": "Shot_Inflation351"
            },
            {
                "raw_content": "This is peak",
                "author": "xSnakyy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Days ago, DroidsUp Moya, the ginoid, was launched - probably overlooked - warm soft, harm skin, lifelike facial expressions",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It still does the facial expressions of an animatronic from 1970.",
                "author": "MrBadBoyWorldwide"
            },
            {
                "raw_content": "“Other service roles” ![gif](giphy|6ra84Uso2hoir3YCgb|downsized)",
                "author": "samspade211"
            },
            {
                "raw_content": "\"92% humanlike motion\" .....yyyyyeah, for a drunk grandma with arthritis. BS Arbitrary number",
                "author": "Corsavis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Despite garnering attention on social media, Anthropic's Super Bowl ad about ChatGPT ads failed to land with audiences",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's very \"inside baseball\". Most people won't even know what it's talking about.",
                "author": "NewConfusion9480"
            },
            {
                "raw_content": "Pretty sure that’s just AI in general and Anthropic/Claude is lesser known by ‘normies’ than OpenAI/ChatGPT or Google/Gemini. Guarantee those ads have super low ratings too",
                "author": "llkj11"
            },
            {
                "raw_content": "A superbowl ad is a very dumb and expensive way to emphasize a message that is \"we don't have ads.\" And I am a person who hates ads and am highly motivated to avoid them.",
                "author": "CrispityCraspits"
            }
        ],
        "subreddit": "singularity"
    }
]