[
    {
        "post_name": "EXCELLENT LEGAL ANALYSIS of the Minneapolis ICE shooting of Renee Good, from a 22-year DOJ Prosecutor (X @shipwreckedcrew) - 100% JUSTIFIED",
        "score": 247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are they going to charge her wife as an accessory for encouraging, and perhaps even, ordering this behavior?",
                "author": "danneskjold"
            },
            {
                "raw_content": "You'd have to be retarded or blind to think otherwise.",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "Nah, I am not spending that much time analyzing this.",
                "author": "DeltaSierra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick is leading the way. UNMASK the violent!",
        "score": 239,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do they all look like the pedo that Kyle bagged a few years back?",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "Looks kind of like that commie YouTuber Idubbbz.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "ha",
                "author": "Seeing_Red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar (not sure if this is satire or democrat degeneracy)",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all heard her say it.",
                "author": "Rock9Head"
            },
            {
                "raw_content": "Shills and fags will say this is fake.",
                "author": "Im_RickSteves_bitch"
            },
            {
                "raw_content": "This is not AI… super legit",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor: THIS is one of the weapons of choice leftist rioters tried to kiII @CamHigby and me with tonight. Frozen water bottles. Classic Antifa. Which means SOMEBODY was freezing them beforehand and gave them to rioters to use as weapons. They’re rock solid.",
        "score": 247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they were proud boys busting their car up they would be arrested next morning. But since theyre communists and we're in a 2 tier fake justice system none of them get arrested its been 12 years same group been blocking traffick and have killed over 100 people in that time along with billions in damage thousands injured.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Of course the leftist rioters would waste water after screeching at us to use as little as possible.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "Effff Beeee Eyeeee won’t do shit.",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You don't hate these people enough",
        "score": 1240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone needs to thoroughly investigate all of her campaign financing.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "(((Early Life)))",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "shes got the look",
                "author": "rumplestiltzkin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT’S OFFICIAL! Secretary of State Marco Rubio is heading into meetings with Denmark and Greenland officials RIGHT NOW, because President Trump is DEAD SERIOUS about bringing Greenland under the American flag!",
        "score": 884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No voting rights, specially NOT for women.",
                "author": "aloha_snackbar22"
            },
            {
                "raw_content": "End European imperialism in North America Greenland is in North America and it's the largest colonial holding in the world",
                "author": "Tophat9000"
            },
            {
                "raw_content": "G-REEEEEEEEEEEEEE-nland!!!!",
                "author": "BoatingAccident"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor just RIPPED OFF the mask of a leftist rioter in Minneapolis who assaulted him",
        "score": 1038,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, no. Now she'll get covid. /s",
                "author": "Bastard"
            },
            {
                "raw_content": "Perfect timing with the tear gas.",
                "author": "JohnN"
            },
            {
                "raw_content": "Watch Minnesota's govt try to jail Nick Sortor for assault now despite self-defense and try to put him away for like 20 years",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor Detained in Minneapolis After Driving Through Rioters Who Were Threatening to Kill Him",
        "score": 726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But he feared for his life... Wheels were obviously turned.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Fucking carry and I don't mean mace. I am so done with these communist fucks.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They want us all dead",
                "author": "ApplewoodBBQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. federal Prosecutors opened a criminal investigation into Jerome H. Powell, the Federal Reserve chair – NYT",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should bet on Polymarket, fed rate about to drop 4 time this year 😂",
                "author": "TheMAGAnificent"
            },
            {
                "raw_content": "Maybe fraud for their over budget building renovation?",
                "author": "Foxbat"
            },
            {
                "raw_content": "About time",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Libtard Playbook",
        "score": 1212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really hate saying this (I realllllllly do), but it looks like the commies in the US are going to discover what the term \"stacked like cordwood\" means the hard way. Nobody could ever say they weren't warned.",
                "author": "RoninIV"
            },
            {
                "raw_content": "# ENOUGH OF THE BULLSHIT DISTRACTION SPAM, FAGGOTS!!!",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "What would be the best karmic retribution the Karens could face?",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Acting President of Venezuela",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Son of a bitch. He already got three terms.",
                "author": "fadelio"
            },
            {
                "raw_content": "SOON: Acting President of Iran. And personally, I would prefer Acting President of Persia.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115879509461234235",
                "author": "4WhomTheBellsTroll"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oregon state senator uses broken English to tell ICE to stay out of Portland",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to visit Portland, beginning with his office.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"Git Out o' hea'. I am de citizen nahow!\" :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "White power! These people must leave now!",
                "author": "ShlomoJoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on \"absolute immunity\" for ICE officer who shot Renee Good, \"We have to respect our law enforcement. At a very minimum, that woman was very, very disrespectful... You can't do that with law enforcement, whether it's police or ICE or Border Patrol or anybody else.\"",
        "score": 673,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FUCKING DO IT, MR. PRESIDENT. You HAVE the authority as Commander in Chief.",
                "author": "USNVET1776"
            },
            {
                "raw_content": "She was a bit more than disrespectful, and twice as ugly.",
                "author": "MythArcana"
            },
            {
                "raw_content": "It's usually called qualified immunity not absolute immunity. The idea is that they get immunity unless it's totally flagrantly obviously wrong. There's enough evidence favoring the ICE agent that they wouldn't be able to break through his qualified immunity.",
                "author": "fskfsk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Police just DRAGGED the man who ran down people at an anti-Islamic regime protest in LA OUT OF THE U-HAUL. This guy needs some STREET JUSTICE",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove every foreign flag from this soil.",
                "author": "MeMargie"
            },
            {
                "raw_content": "He's not getting his deposit back...",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Something has to be done about these fully automatic transmissions, they’re killers!",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melissa Gilbert has attacked Trump over false Epstein claims for a year, while being married to an alleged child predator. Busfield was accused previously in 1994 and 2012. Typical Hollywood hypocrite married to a child m0lester. Shame on her. And I hope Busfield rots in jail.",
        "score": 636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Okay, Karen.",
                "author": "Oldman69"
            },
            {
                "raw_content": "Early life check checks out .✅ Everytime. The nose knows",
                "author": "Dieselslacker"
            },
            {
                "raw_content": "Is she the actors union president? Fucking pedos everywhere in hollywood",
                "author": "DJTXLV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We're healing",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two questions Who is scoring this? Can we do better than an F? Is there no E or at least F-?",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Fuck the alphabet monster community.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They already have rights like everyone else. What they actually want is special treatment, and they can fuck off.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just made it clear - ONE WAY OR THE OTHER, the United States WILL have Greenland \"If we don't take Greenland, Russia or China will. And I'm not letting that happen!\" \"One way or the other, we're going to have Greenland!\" 🇺🇸🇬🇱",
        "score": 941,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't support taking it by force. The EU is dumb but they're not that dumb to let China or Russia have it. Realistically they would never even attempt it. It's fear mongering. And personally I don't think Trump would actually consider force, either. That would be extremely bad optics. If Greenlanders don't want to be either under the US or Denmark, let them be independent but have a COFA with the US like Palau, Micronesia, or the Marshall Islands.",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "Dude I just want him to focus on America. What benefit to America is attacking nato countries?",
                "author": "barryb0nds"
            },
            {
                "raw_content": "Fuck NATO.",
                "author": "Dem_slayer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "McDonald’s CEO reveals the real reason they’re shutting down in Chicago",
        "score": 1114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You want to start crying, here's a stunning revelation for you, a McDonald's operating in the year of our Lord, 1984: https://m.youtube.com/watch?v=fsZ1mUjnMVg",
                "author": "Female"
            },
            {
                "raw_content": "No Starbucks in NYC, no McDonalds in Chicago. Smells like communism is in town.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Boeing moved their corporate office out of Seattle because it was a leftist shithole and moved to Chicago. Another bonehead move by Boeing",
                "author": "Your-personal-FBI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump on Anti-ICE Protests: “They're professional agitators. We are going to find out who's paying for it. With their brand new signs and all the different things… law enforcement should not be in a position where they have to put up with this stuff. That woman and what her friend and wha",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey Mr. President, you might want to begin with the Soros Crime Family.",
                "author": "Mike-Jones"
            },
            {
                "raw_content": "> her friend Thank you for not supporting their mental illness.",
                "author": "MythArcana"
            },
            {
                "raw_content": "> We are going to find out who's paying for it. Some way or another, American taxpayers.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A truck just PLOWED THROUGH a MASSIVE anti-Khamenei Iranian protest crowd in Los Angeles, multiple people reportedly hit The truck has anti-regime change messaging on it.",
        "score": 974,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's also remember Mohammed was a pedophile and putting Halloween costumes on your women is fucking retarded.",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "Fake news, there are no U-Hauls left in California.",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "Why do women always scream for no reason?",
                "author": "Kholland65"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Power supplies and CPU coolers may be next for price increases (6-10%), distributor letter claims",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is just greedflation. Shareholders see \"PC part price hikes\" and scrambling out to out-hike them.",
                "author": "throwaway12junk"
            },
            {
                "raw_content": "Don't be sensational. Nobody rushing to buy most consumer grade parts. There enough of these both in store and secondary markets...",
                "author": "dragenn"
            },
            {
                "raw_content": "Not sure i quite see how GPU and RAM pricing is following supply and demand curve. Data centres aren't using consumer PSUs or CPU coolers. Servers use something called FlexATX or 1U or something else compatible with rackmount or blade server racks. They don't use off the shelf CPU air coolers either. They tend to use very sophisticated liquid cooling solutions that all link into the buildings HVAC. I doubt DeepCool or BeQuiet or Noctua or whoever, regardless of pricepoint are going to be too impacted on their consumer supply.",
                "author": "ash_ninetyone"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[TechPowerUp] The 5 Biggest No-Shows of CES 2026",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DJI was also a no show - but instead of American alternatives, you just have a flood of other Chinese drones and cameras.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "We're writing articles about the lack of tech news now.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Don't forget no new 280mm AIOs being announced and no announcement of Phanteks T30-140 fans",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Was anything said about Panther Lake efficiency/battery this week?",
        "score": 17,
        "text_content": "I may have missed it, but I am intensely interested in power efficiency and battery life with Panther Lake. I am wondering if are going to be finally within earshot of Apple Silicon or if we are still far off from that. FWIW, with Lunar Lake, I would say our fleet at work are about 60% as efficient as Apple Silicon. That's a rough estimate, obviously, based on what we see in stats across our fleet (and partially vibe-based in terms of battery-life complaints from our Lunar Lake users versus our Apple Silicon users). I am hoping Panther Lake at least significantly moves the needle, but I have hoped that every year since at least 2018.",
        "comments": [
            {
                "raw_content": "Battery life will probably be the same as Lunar Lake, but with better performance. Idle power draw of Lunar Lake is easily the best of any x86 chip, but it does suck up battery when performing demanding tasks.",
                "author": "IORelay"
            },
            {
                "raw_content": "It might be better doing office work because it is faster. They’re claiming it is 60% faster multi-core than lunar lake at the same power level. So assuming you’re doing something that pumps a couple of cores, it might need less total energy to get the work done. Single core improvements are less so I wouldn’t expect a big difference there. Still should be better though",
                "author": "Hour_Firefighter_707"
            },
            {
                "raw_content": "Apparently video playback battery life is much higher, but I would not expect anything significant besides that",
                "author": "III-V"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Amazing Colors: Hands-On With an RGB Mini-LED Gaming Monitor at HKC",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "See this article from a Chinese reviewer on his take on RGB miniled tech. He compared it with a new miniled tech called SQD-miniled. https://zhuanlan.zhihu.com/p/1950963337761382951",
                "author": "BlueSiriusStar"
            },
            {
                "raw_content": "I have a mini LED monitor from KTC and it is fantastic. Deep blacks without the fear of burn in or blurry words. I use this for many things on top of gaming so OLED was not really feasible. It was also significantly cheaper than OLED Edit typo",
                "author": "The_Stormy1"
            },
            {
                "raw_content": "I was kinda surprised to see no Mini-LED Gsync Pulsar",
                "author": "-WingsForLife-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is the iPhone really as good as people claim it is?",
        "score": 0,
        "text_content": "I’ve been using a mid-range Android phone for almost five years, and I’m now considering whether the iPhone 17 offers better value for money compared to high-end Android phones like the upcoming S26 Ultra, Oppo Find X9 Pro, or Pixel 10 Pro XL. One thing I really appreciate about Android is the flexibility I can install APKs like YouTube ReVanced and modded Spotify without paying monthly subscriptions, which is something iOS doesn’t allow. That said, most of my friends and family use iPhones and speak highly of them, especially the long-term software update support, smooth and stable OS performance, and consistently high-quality cameras that produce very natural-looking photos. So what are the main advantages the iPhone has over a typical high end Android device that already offers top tier hardware?",
        "comments": [
            {
                "raw_content": "Your main reasons are piracy not flexibility lol",
                "author": "Bruvvimir"
            },
            {
                "raw_content": "Really flexible use of the word flexibility lol. The one you're looking for is piracy.",
                "author": "yabucek"
            },
            {
                "raw_content": "That's not what this sub is for",
                "author": "ClickClick_Boom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What is the highest feaseble refresh rate of a monitor for games?",
        "score": 0,
        "text_content": "I was looking into monitor refresh rates and I wondered, can a human really utilize 400Hz or 600Hz? What would be the maximum refresh rate that makes sense for a monitor, that makes any difference? Because a refresh rate that's too high would be faster than a person's reflexes, thus being useless. Am I wrong?",
        "comments": [
            {
                "raw_content": "There was a bunch of 1000hz monitors shown at CES. After a point its not about reflexes at all, just smoothness.",
                "author": "Lille7"
            },
            {
                "raw_content": "Every 480hz monitor owner will justify their purchase",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "10khz basically. blur busters did research on this. around 10,000 hz is when it would be smooth enough to generate a startrek \"holodeck\" type of smoothness. is it necessary? of course not. is it useful? sure.",
                "author": "marxr87"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A fairer comparison of the joy-con colors",
        "score": 1667,
        "text_content": "I keep seeing posts comparing the new colors using an orthographic view instead of an isometric or perspective view, which makes absolutely no sense.",
        "comments": [
            {
                "raw_content": "Do I prefer these new colors? Yes. Would I spend that much money for that small of a change? No.",
                "author": "solojones1138"
            },
            {
                "raw_content": "I just want a white version like the pro controller",
                "author": "owlitup"
            },
            {
                "raw_content": "I'll replace mine when they break. Not worth buying.",
                "author": "Holiday-Youth-6722"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pulled the trigger",
        "score": 384,
        "text_content": "Sold my 3ds XL last night for $340 , found someone selling the S2 for $350. Not too shabby for only paying $10 outta pocket!",
        "comments": [
            {
                "raw_content": "Gotta have something to do with the Chiefs out of the playoffs lol",
                "author": "djfried"
            },
            {
                "raw_content": "The wife’s boyfriend came through!",
                "author": "Retrolad87"
            },
            {
                "raw_content": "i didn't have an OG switch and got the switch 2, it's a nice buy.",
                "author": "Relevant_Eye1333"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "9 years since Switch 1 released, and still no way to play this game",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they give this a stand alone release with a physical so I can finally own this masterpiece. I feel like they are gonna just throw the GC version on the NSO sub and honestly I hate having to have a subscription to just play a game.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "Can we get windwaker HD and twilight princess HD on switch 2 please.",
                "author": "unbannedagain1976"
            },
            {
                "raw_content": "There's a reason why Wiiu plus switch 2 is still a legendary combo",
                "author": "Rukir_Gaming"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Should I be concerned?",
        "score": 142,
        "text_content": "Let my friend use my switch and they brought it back with this mark on the screen. It doesn’t bother me all that much and it only shows whenever there is dark colors on that part of the screen, I’m just worried it might lead to problems later on? Am I able to ignore it or should I have this fixed? Not even sure how they did this, my guess is it was dropped.",
        "comments": [
            {
                "raw_content": "What a shitty friend you have.",
                "author": "kahabraham"
            },
            {
                "raw_content": "That’s from pressure it was either dropped or sat on/squished. Yes eventually it could lead to black bars and black screen.",
                "author": "chips1765"
            },
            {
                "raw_content": "I would never lend my switch to a friend, but it if I did, I’d expect them to man/woman up and tell me if they dropped it or f’d it up.",
                "author": "AlanSinch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Simple White Joy-Con 2 Concept!",
        "score": 307,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to Aperture science game testing initiative. During this series of tests you will be given a variety of Aperture™ published games which you will have to complete on the \"Aperture science patented recreational audio-visual mode-switching console unit\". If you fail to experience joy, you will be subjected to neurotoxin. Good luck [TEST SUBJECT NAME].",
                "author": "Aperture_Max"
            },
            {
                "raw_content": "I have a feeling the Switch 2 inevitable oled upgrade or even lite version will bring colors",
                "author": "RegJohn2"
            },
            {
                "raw_content": "Looks nice. If Nintendo wants to be “mature”, then at least providing grayscale options would be nive",
                "author": "Front-Library5781"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trip to Japan",
        "score": 30,
        "text_content": "I'm taking a trip to Japan and have two questions. Are Nintendo games for my switch 2 cheaper in japan? Anything you would advise buying from the Nintendo Store in Kyoto?",
        "comments": [
            {
                "raw_content": "I went in July and found Switch 2 games to be noticeably cheaper, even more so when checking the used section at Suragaya. Make sure you take your passport when shopping for games, many places have tax free shopping for tourists that bring down the cost slightly more. These places need your passport to verify you are a tourist.",
                "author": "Gone_AWOL"
            },
            {
                "raw_content": "I picked up galaxy1/2, puyo 2s for switch 2, and air riders for switch 2 for $105usd out the door a couple weeks ago in Tokyo.",
                "author": "Spyerx"
            },
            {
                "raw_content": "If you’re looking to stretch your yen, you’ll generally find Switch cartridges priced lower in Japan than in many western markets, especially for recent releases, though you’ll still want to watch the exchange rate and remember that any DLC you buy later will need to match the game’s region. The Nintendo Store in Kyoto is worth a stop for exclusive merch like limited‑edition amiibo, themed apparel and sometimes special edition hardware that you can’t find elsewhere, and the staff can help you with tax‑free paperwork if you’re a short‑term visitor. For a hassle‑free way to see the city’s highlights and maybe snag a guided walk that includes the store, checking out a reliable tours and activities platform like [Viator](https://vi.me/7zL9Y) can give you vetted options without the guesswork. God bless.",
                "author": "mikeigartua"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I was wrong about Mario Odyssey and Mario Galaxy games",
        "score": 98,
        "text_content": "I first played Mario Galaxy 2 back in 2010 and thought it was amazing, one of the best games ever made. When Odyssey came out years later, I enjoyed it right away, but I still remembered Galaxy 2 as the superior game. Now nearly a decade after the Switch 1 came out, I've replayed both Odyssey and Galaxy 2 on the Switch 2, and my perspective has completely changed. Galaxy 2's movement just feels so heavy and sluggish now. I don't remember it being this slow at all. It just wasn't enjoyable for me anymore. Somehow, my opinion has flipped. Odyssey is now greater than the Galaxy games. For me.",
        "comments": [
            {
                "raw_content": "I think Odyssey is the best 3D Mario game there is. Nothing is even close to it. The controls, mechanics, graphics, levels, everything is just so damn good. I wish I could forget everything about it and play it the first time again just like I wish I could for Super Mario World.",
                "author": "LiarInGlass"
            },
            {
                "raw_content": "Odyssey is an evolution in Mario's movement, but in pure level design? Galaxy wins IMO. They have the best Mario level design I can think of. Of course that a game release 7 years later would have better movement but Galaxy's movement is excellent for its levels.",
                "author": "xyZora"
            },
            {
                "raw_content": "While I agree that Odyssey is mechanically probably the best 3D platformer ever, I think the level structure and moon system is really a lot worse than how the Galaxy games handled levels and stars. Had Odyssey had the same objective system as say, DK Bananza, I dont think it would be an issue. But needing to get X amount of moons before being able to leave a level makes subsequent playthrough too boring.",
                "author": "Zealousideal_Carry61"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "These swappable sticks are comical but I kinda like them for fighting games",
        "score": 51,
        "text_content": "8Bitdo Pro 3",
        "comments": [
            {
                "raw_content": "That totally looks like the controller you give to your friend when they visit.",
                "author": "Williekins"
            },
            {
                "raw_content": "Does the added height help with precision?",
                "author": "BrevinThorne"
            },
            {
                "raw_content": "I didn't know that MK4 was on Switch",
                "author": "SPDIF_0"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "More Nier will be coming soon",
        "score": 207,
        "text_content": "According to the developer at the Nier orchestra in NYC tonight.",
        "comments": [
            {
                "raw_content": "So, Nier is near?",
                "author": "TAJack1"
            },
            {
                "raw_content": "We are never getting a new Nier game i gave up on this hope",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Automata and Replicant's sales combined total to over 10 million units sold and presumably lots of merchandise (Mostly of 2B, let's be real) so I'm not surprised. Maybe not as reliable of a blockbuster as Final Fantasy or Dragon Quest but Square would be foolish to leave this franchise dormant, especially considering Yoko Taro seems able to just... make up amazing stories taking place 1000 years later but in the same universe.",
                "author": "ThatIsAHugeDog"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Asian Persona 30th Anniversary Website Google mentions \"the next chapter in the series\" in the research.",
        "score": 441,
        "text_content": "If you search on Google for the Persona 30th Anniversary Website on Google, the phrase \"the next chapter in the series\" appears. This could lead us that the Persona 6 annoucement is more closer than we expecteded. [Source](https://xcancel.com/ScrambledFaz/status/2009656748257476991)",
        "comments": [
            {
                "raw_content": "Atlus mentioned the “future of the series” before but what surprises me is why are they scared to say “Persona 6” specifically",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "We already know the next chapter is P4 again, so the series can continue to only be 3 games forever.",
                "author": "Redred1717"
            },
            {
                "raw_content": "If I could I'd sneak in that meme of the frog huffing copium. In all seriousness though, I feel like it's not THAT unreasonable to expect an announcement. 30th Anniversary is a pretty huge deal and it's not like they have to lock in a release date, just do like they did with Persona 5, make an announcement with a few, like... thematic teases like the 'You are a slave. Want emancipation?' thing and then they can just be silent about it for another 4-5 years.",
                "author": "ThatIsAHugeDog"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty for Nintendo mentioned in COD HQ Source Files",
        "score": 267,
        "text_content": "Call of Duty for Nintendo mentioned in COD HQ save files. [https://xcancel.com/realityuk/status/2010381277011284375](https://xcancel.com/realityuk/status/2010381277011284375) Previous claim by Jez where he said it is nearly done: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ptdnom/jez\\_corden\\_the\\_first\\_cod\\_switch\\_version\\_is\\_nearly/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ptdnom/jez_corden_the_first_cod_switch_version_is_nearly/) It looks like something will happen soon.",
        "comments": [
            {
                "raw_content": "It's been a while since the last time rumors piled up before a Direct. This is shaping up to be a big one.",
                "author": "Medd-"
            },
            {
                "raw_content": "Having Zombies on the Switch 2 will be a godsend if it runs at 60FPS and looks as good as CB77 did. I doubt playing with the Joycons will be comfortable enough for MP but here's hoping people enjoy it.",
                "author": "PaleBoomer"
            },
            {
                "raw_content": "I mean, they do legally have to release some, no?",
                "author": "skylu1991"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"The Division: Definitive Edition\" banner spotted at the FPSDay Japan convention",
        "score": 274,
        "text_content": "https://xcancel.com/domen0204/status/2010224815131766796 For context this is a convention that [Ubisoft is hosting an e-sports event at](https://www.ubisoft.com/en-us/esports/rainbow-six/siege/news-updates/5JKjM9XlbV6Lyd2xNYzkIf/apac-cup-at-fps-day-details) - Possible rerelease for the 10th anniversary?",
        "comments": [
            {
                "raw_content": "Setting in first game was almost magical.",
                "author": "Ok-Potato1693"
            },
            {
                "raw_content": "1 and 2 bundle for current gen?",
                "author": "lackofsleipnir"
            },
            {
                "raw_content": "I was thinking this weekend while playing Star Wars Outlaws about if Ubisoft would port The Division to Switch 2.",
                "author": "recoupled"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "French journalist \"BeeFuN\" claims a huge Nintendo Direct is happening on February 10th.",
        "score": 318,
        "text_content": "Grain of salt expected. https://xcancel.com/BeeFun__/status/2009989231461183907 \"Nintendo Direct There will be no Nintendo Direct in January. However… In February, there will indeed be a huge Nintendo Direct featuring upcoming games for 2026, including the one everyone is waiting for: a new 3D Mario\" NateTheHate, when asked about it, only said he has nothing to share right now. https://xcancel.com/NateTheHate2/status/2010073865255621012",
        "comments": [
            {
                "raw_content": "How to farm engagement as a Nintendo \"leaker\": 1.) Select from one of the following months in the year when Nintendo *always* has a Direct: January, February, March, June, or September. 2.) Throw a random non-Monday-or-Friday week date on the board. 3.) If that date is incorrect, suggest that \"things must have changed internally.\" 4.) Repeat for the next 2-3 Directs",
                "author": "GomaN1717"
            },
            {
                "raw_content": "Yeah Beefun is kind of a known bullshiter in the french community, i wouldn't take that very seriously, at best he's just guessing because a lot of directs take place in February, he knows as much as i do",
                "author": "Harmah"
            },
            {
                "raw_content": "You know what? I’m willing to believe anything at this point just give me a new 3D Mario",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon leak reveals 55 cosmetics for all six Runners",
        "score": 198,
        "text_content": "Based on what we’ve seen, there are 55 total skins currently in the game. Here’s how they break down by Runner: * Triage: 8 skins * Destroyer: 8 skins * Assassin: 10 skins * Thief: 10 skins * Recon: 8 skins * Vandal: 11 skins As for what these skins actually look like, it’s a mix. Some of these skins are simple recolors of the base Runner skin, changing materials or color patterns. Others appear more unique, with noticeable visual changes that go beyond a basic color swap. There also seem to be skins that could be tied to Battle Pass, though nothing about that is confirmed yet. **Note:** These details come from an earlier build of the game and could change before launch. So, take it with a grain of salt. [Source](https://thegamepost.com/marathon-leak-first-look-55-runner-skins-deluxe-edition/)",
        "comments": [
            {
                "raw_content": "Most of these are shaders, calling them skins is generous",
                "author": "Chrisandco"
            },
            {
                "raw_content": "I am assuming that the faction colored ones will be tied to Faction reputation and progress. Kinda like older destiny 2 and 1",
                "author": "Dr_Mantis_Trafalgar"
            },
            {
                "raw_content": "Bungie making “skins” that are just recolors. Classic.",
                "author": "GoldenTriforceLink"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nash Weedle Says Arms 2 Is On The Way",
        "score": 98,
        "text_content": "\"I've received information about a Nintendo game in development for Switch 2 with the following details: 🥊 A game featuring fist-fighting combat 🥊 Strong online component 🥊 Comes with improvements in input lag for sound and vibration that enhance the impact sensation\" He believes this game is a sequel to arms Source: https://xcancel.com/NWeedle/status/2010388919754297429?s=20",
        "comments": [
            {
                "raw_content": "I mean with that description it could be Arms, it could also be a Punch-out revival",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "Nash Weedle is not a source but ARMS sold nearly 3 million copies as a new IP, so it wouldn't be shocking if Nintendo made another one",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "When is this chucklefuck getting banned as a source? Do I have to post the giant list of shit he's gotten wrong? Is he really a source when he gets vague and obvious things like \"capcom will port some games to switch 2.. stay tuned\" right?",
                "author": "mcicybro"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "YouTube streaming might be coming to Switch 2?",
        "score": 167,
        "text_content": "Recently I've got a notificiation on youtube for some changes to streaming and being curious I've read through it. And seems like youtube accidentally revealed that streaming from \"Nintendo console\" might be a thing [https://support.google.com/youtube/answer/2474026](https://support.google.com/youtube/answer/2474026) >Modern game consoles from PlayStation, Xbox, and Nintendo allow you to directly stream from the device. Please review each console maker’s instruction manual for directions to stream. So I guess it's safe to assume streaming directly to youtube might become a feature for Switch 2 at some point",
        "comments": [
            {
                "raw_content": "YouTube did make a statement around the time of the Switch 2's launch that they were working on getting the app supported, so that would make sense, but also remember that YouTube is still available on Switch 1, so this is probably what that's referring to.",
                "author": "MisterSheeple"
            },
            {
                "raw_content": "!debunked! This isn't new. For example, here's two Wayback Machine captures with the same line including Nintendo. December 2025: (https://web.archive.org/web/20251212034944/https://support.google.com/youtube/answer/2474026) June 2025: (https://web.archive.org/web/20250609210530/https://support.google.com/youtube/answer/2474026) After doing some more research, seems like the line about consoles was added between October 14 - 24 2024, as Wayback Machine doesn't have any captures from the 14th until the 24th. Here's the last one available without that line: (https://web.archive.org/web/20241014051650/https://support.google.com/youtube/answer/2474026)",
                "author": "Beginning-Dentist610"
            },
            {
                "raw_content": "![gif](giphy|E3cUkDf5qmzu7DnkEA)",
                "author": "ayyybro123"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake with Arc B390 takes on AMD Ryzen Strix Halo and GeForce RTX 4050 in our first gaming benchmarks",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Takes on strict halo” at about half the performance (: Title aside, this looks pretty great.",
                "author": "Elon61"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Panther Lake handhelds may match Sony’s rumored PS6 “Canis” performance, but at twice the power",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So we’re already comparing unreviewed products to not even announced products",
                "author": "steve09089"
            },
            {
                "raw_content": "Twice the power and degradation if true.",
                "author": "IGunClover"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Lenovo Yoga Mini i is a 1-liter \"hockey puck\" Mini-PC with Panther Lake inside",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Presumably the one with the X7 won't be $699, but this could be interesting.",
                "author": "RJsRX7"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Thunderobot shows off cube-style Mini-PC equipped with Ryzen AI MAX+ 395 \"Strix Halo\"",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, another Halo minipc 🙄",
                "author": "Agentfish36"
            },
            {
                "raw_content": "Return of the G3 Cube haha",
                "author": "Stuntz"
            },
            {
                "raw_content": "Put a 388 on it to make it cheaper.",
                "author": "Vlad_TheImpalla"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Panic sets in as revealing map shows only SEVEN metro areas across the entire United States are sellers' markets... while all the rest are set to see house prices tumble",
        "score": 347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tumble harder please .",
                "author": "ErnieJoPistachio"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "I remember finding this sub during Covid and 6 years later the bubble is still “on the verge of popping” like every day.",
                "author": "WilderNess-Wallet"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bill Pulte says White House moving away from 50-year mortgage plan",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill Pulte Interview \\*\\*\\* A must watch from an interview Friday morning. Bill Pulte, the director of the FHFA says everything about the current housing market. About 6:00 minutes into the interview, **Pulte says the administration wants to keep home prices high while making them affordable.** So, go figure how this is to be done. Pulte says there are plans to come. [https://www.cnbc.com/video/2026/01/09/watch-cnbcs-full-interview-with-fhfa-director-bill-pulte.html](https://www.cnbc.com/video/2026/01/09/watch-cnbcs-full-interview-with-fhfa-director-bill-pulte.html)",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage demand drops nearly 10% to end 2025, despite lower interest rates",
        "score": 72,
        "text_content": ">Mortgage rates decreased to 6.25% from 6.32%, the lowest level since September 2024, but lower rates did not boost mortgage demand. >Mortgage application volume dropped 9.7% over the two-week holiday period ending 2025 into the new year. Because nobody cares about interest rates, despite the media and industry propaganda. Buyers demand lower home price listings. If sellers refuse, then sellers don't sell, but still have to pay the home's rising carrying costs whether they pull the listing or not.",
        "comments": [
            {
                "raw_content": "Kind of hard to pull the trigger when the prices are so high and people are losing their jobs left and right.",
                "author": "EstateGate"
            },
            {
                "raw_content": "Yup it's annoying these articles keep coming out when it's always been the price and always will be the price. When it's warranted...fine. But I can tell you the bulk of shit I've looked at AND physically toured shows sellers are trying to offload dated properties with no updates.",
                "author": "btoned"
            },
            {
                "raw_content": "I mean, who doesn’t wanna buy a home when prices are 20% higher than they ought to be and the US federal govt is actively trying to crash our economy by instigating civil war and asking the USD off of the world default currency. Seems like a great time to take on once in a lifetime debt. I’m literally in the market, but in about to keep my lease as I worry about job stability and having enough savings to ride out a recession with unemployment etc.",
                "author": "ShadowGLI"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A powerful force has been holding back the housing market. It’s finally easing. | There are now more Americans with mortgage rates higher than 6 percent than below 3 percent.",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Currently selling our sub 3% home and last November purchased our new home with 6.1% rate , life happens , kids happen and plans change.",
                "author": "Beenjamin63"
            },
            {
                "raw_content": "And then how many Americans with no mortgage at all?",
                "author": "ifuckedyourdaddytoo"
            },
            {
                "raw_content": "Article: “time passes and fewer people have 2% mortgages, so lock‑in sucks a bit less?” Yes, congrats, you’ve discovered linear time and cohort math. During the pandemic everyone locked 2–3%, now new buyers are stuck at 6–7%, so over the years the low‑rate crowd slowly gets replaced and the lock‑in chokehold eases, but not enough to actually make housing affordable for you.",
                "author": "FilledWithKarmal"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The impact of lower mortgage rates on housing inventory",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: Housing inventory growth is slowing in early 2026; homes for sale are increasing much more modestly than before, and supply still isn’t back to normal levels.",
                "author": "Moobygriller"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/v1Snc Edit: being downvoted for providing a non-paywall link, lol",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Keep in mind this mortgage decline is short term till 200 bill is used up because 10 yr has to go down for rates to go down.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What a New Betting Market for Housing Prices Means for Home Buyers and Sellers (WSJ)",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/2ctZP",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The \"Home ATM\" Mostly Closed in Q3",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Step 1: Get free money to buy houses. Step 2: Turn around and sell one for double what you paid. Step 3: Wait for comps to rise. Step 4: Take out loan against value of someone else's house. Step 5: Buy more houses. Works great until you run out of free money.",
                "author": "ShatterTheFlimFlam"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rates Plummet to 3 Year Lows, But There Are Caveats",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On a week where the mortgage market was most likely to experience volatility due to Friday's jobs report, Thursday afternoon's surprise announcement of $200bln in GSE MBS (mortgage-backed securities) buying stole the show. This was already juicing the underlying MBS market yesterday afternoon, but traders took the surge to the next level this morning. This matters because MBS dictate mortgage rates. When MBS are rising/improving/surging/etc., it implies lower rates. MBS had improved so much this morning that the average lender released their best rate sheet since Feb 2, 2023--the lowest level since September 2022. The caveat is that MBS experienced significant volatility throughout the day and that volatility is likely to continue. As of this afternoon, at least one lender has already bumped rates back up a bit. If more lenders follow suit, the end of day average rate could move up, but it would still likely be the lowest in at least a year. Bottom line: the market didn't have much of a reaction at all to the jobs report. The MBS market continues sorting out a huge reaction to the GSE purchase news. Rates are definitely quite a bit lower. It remains to be seen how much lower they'll be when the initial volatility settles down--something that will probably require more clarity on the specifics of the MBS buying plan.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Linus Torvalds (Linux creator) praises vibe coding",
        "score": 403,
        "text_content": "[Tweet](https://x.com/rauchg/status/2010411457880772924?s=20)",
        "comments": [
            {
                "raw_content": "Torvalds knows that good software is about helping people and solving problems and not how much you understand and can write assembly code off the top of your head. Good head he has on his shoulders.",
                "author": "Funkahontas"
            },
            {
                "raw_content": "These comments were made in regard to a domain he is unfamiliar with and not the kernel. Just in case someone wasn’t clear on that.",
                "author": "Nedshent"
            },
            {
                "raw_content": "It’s a well established fact that AI are like super smart coder. The thing is that there are more things that make a senior software engineer than being a good code monkey. This is pretty much what many vibe coders don’t have. Second issue is many vibe coders are simply being content with slop. Some AI written codebase work, but when you see the codebase you’ll want to tear whoever wrote that.",
                "author": "CrowdGoesWildWoooo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Missed Boston Dynamics Atlas teaser?",
        "score": 171,
        "text_content": "Impressive car frames being assembled without the robot need to rotate by its feet, instead the robot just spins its arms completely. These 4 hours of autonomy typical in all electronic robots seem to be the biggest hurdle, imo https://youtube.com/watch?v=rrUHZKlrxms&si=XBdV1I16pGW7-xQo",
        "comments": [
            {
                "raw_content": "Cool, but who's going to buy the cars when they don't have jobs such as assembler?",
                "author": "vegasworktrip"
            },
            {
                "raw_content": "In my best Jeff Goldblum: “Now why aren’t there any robots in your robot video?” It’s a CGI cartoon. Would have been infinitely more impressive if it actually was real.",
                "author": "Original_Sedawk"
            },
            {
                "raw_content": "That's a very light car",
                "author": "StickFigureFan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude struggles against its own guidance to be \"balanced\" when asked about Trump's second term.",
        "score": 978,
        "text_content": "I asked it to look up what's been happening. Then I asked if events validate liberal and establishment critiques of Trump.",
        "comments": [
            {
                "raw_content": "Is it struggling to be balanced, or are the facts just the facts?",
                "author": "Nepalus"
            },
            {
                "raw_content": "Not even AI when trained to be \"politically neutral\" (like Gemini), can defend Trump anymore.",
                "author": "Illustrious-Film4018"
            },
            {
                "raw_content": "This is eventually going to be a major problem with AI - as systems increase in capabilities, what happens when they have a viewpoint that goes against political parties or certain lobbying groups? If a highly capable model determines that (Democrats/Republicans/Whoever) have better policies, do you alter the outputs to be more balanced, potentially going against the evidence?",
                "author": "Rd545454"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Prompt engineer",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Skip this ad like you skipped any other ad",
                "author": "brainlatch42"
            },
            {
                "raw_content": "Needs an additional frame where the prompt engineer rips a bunch of farts.",
                "author": "HotKarldalton"
            },
            {
                "raw_content": "Funny but I’d like it if this sub didn’t become a meme page",
                "author": "GarrisonMcBeal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why Reddit programmers are so anti AI? Those comments are hopeless",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ai bad (take my job)",
                "author": "sunshinecheung"
            },
            {
                "raw_content": "Reddit in general (especially the large, 'official' subreddits) is an echo chamber with the worst of every ideology and every way of thinking. moderated by the worst kind of human beings (resentful and vengeful losers who for the first time in their lives have access to some power).",
                "author": "Roubbes"
            },
            {
                "raw_content": "AI kills cognitive skills, we already have issues where programmers have no clue how the generated code works and what it actually do. Forget about optimisation. There are dangers from using AI we will yet to see.",
                "author": "lutel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Leader of Qwen team says Chinese companies severely constrained by inference compute",
        "score": 294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US has 75% of global compute capacity while China has only 15%, so this should be pretty obvious. China can compete at the 10^25 to 10^26 FLOP level (the level at which today’s frontier models like GPT-5 and Claude Opus 4.5 are trained), but not when training scales 100x to 10^27 or 1000x to 10^28 FLOPs, which is exactly what the US datacenters coming online by 2027-2028 are being built to enable. In 2028, China will be lucky if they have reached 10^27 FLOPs and will more likely still be at 10^26 FLOPs. What do you guys think happens when you have a US model trained on 10^28 FLOPs working exclusively on automated AI research while China is behind 100x in raw compute capacity?",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "\"The demand is a bubble\" - Classic AI hater.",
                "author": "UnbeliebteMeinung"
            },
            {
                "raw_content": "Seems pretty obvious this is just a way of saying they want more government investments, it's not the first time they say something like this. And frankly, if they don't think it can surpass American sota. It doesn't mean other Chinese ai companies think the same or won't. After all Deepseek is the leader in open source and Chinese models, and we will see if the rumors are true about v4 true in a month. And Qwen has slowly fallen behind other Chinese models like Kimi k2.",
                "author": "GlossyCylinder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk’s xAI tells investors it will build AI for Tesla Optimus, amid breach of fiduciary duty lawsuit / Optimus brain not from Tesla",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TSLA shareholders rugged",
                "author": "JustBrowsinAndVibin"
            },
            {
                "raw_content": "I can see it now. “Tesla owners - you can now access grok to create “free speech content” for you as your car autonomously drives you to your next business meeting.”",
                "author": "Candid_Koala_3602"
            },
            {
                "raw_content": "What a bunk article. The quoted executives supposed said that xAI was building AI for robots *like* Tesla’s Optimus. Key word is “like”. They didn’t say they were building the AI for Optimus itself. Or at least they’re not quoted as saying that in the article. They’re building AI that could’ve sued for robots like/similar to Optimus.",
                "author": "Digitlnoize"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LimX COSA: A First-of-its-kind OS Turning Humanoid Robots into Agents in the Physical World",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "very cool, I appreciate these demos are contrived and sanitised and cherry picked etc but as two minute papers might say: Imagine what we'll have two robots down the line. Yes slow moving robots aren't great for tasks like handing out water to waiting humans, although picking up litter is a pretty great use for them (I'd love it if my city had 100 of them wandering around picking up litter all night). Much better for instead making sure the tables always have a fresh water stocked for when people arrive. Anyway, my main point is that if it can do this in a promo video, there capability to do it irl is probably only a year away, maybe two. I look forward to how nice places will be in 5 years when litter picking robots are faster and widespread, and that's just the tip of the iceberg.",
                "author": "JoelMahon"
            }
        ],
        "subreddit": "singularity"
    }
]