[
    {
        "post_name": "Update on National Guard Staff Sgt. Andrew Wolfe: Staff Sgt. Wolfe has made extraordinary progress. He is now breathing on his own & can stand with assistance—important milestones that reflect his strength and determination. He is now ready to transition from acute care to inpatient rehabilitation.",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He is healing physically, but his greatest wounds may be mental. I pray for this fine gentleman and patriot. God help America with these Islamist terrorists running around.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "# PRAY # for this # MAN",
                "author": "BeauHD"
            },
            {
                "raw_content": "Some GOOD news for once!",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This morning, Tennessee officially partnered with TPUSA to launch Club America chapters in every high school across the state.",
        "score": 578,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you buy the tiny hats after the presentations ... or do they just throw them out at you? 🤔",
                "author": "drmrboy"
            },
            {
                "raw_content": "I would have loved this news 4 months ago.",
                "author": "geckofishknight"
            },
            {
                "raw_content": "make hs seniors Republican voters again",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Matt Walsh pleads for Candice Owens and others on the right to stop politicizing Charlie Kirk's death. \"There's a reason why Tyler Robinson is smiling, he knows he is winning.\"",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop politicizing the most political assassination of the 21st century? I like both of them, but that don't make no sense.",
                "author": "DeadOverRed"
            },
            {
                "raw_content": "Does he not realize this shit has the exact opposite effect or was that the point.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "> Virtue is a strange thing in our day.",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller confirms President Trump is STOPPING companies from replacing Americans with H-1Bs \"This is the 1st time in US history a president has taken action to stop companies from using low-wage labor to replace Americans!\"",
        "score": 1033,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# THIS # IS # MY # PRESIDENT",
                "author": "FrankIin"
            },
            {
                "raw_content": "End H1b. Deport jeet.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "This real? My company *just* did a layoff to replace more people with poojeets.",
                "author": "hollow_fang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: \"[They] find the poorest populations from the most dysfunctional places in the world and then bring them into small town America... These non-profits get massively rich,\"",
        "score": 578,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone who thinks this isn’t a strategy to replace us has shit for brains",
                "author": "ClarenceBeeks"
            },
            {
                "raw_content": "The Democrats can't even name one success that their open borders policy created. Now they just protest riot ICE for deporting illegals without ever telling us why they are so important for them to keep here. They can't tell us it's because the illegals are voting in the Primary all across America because State's allow them to vote locally. Trump's administration better prepare for this and not another election like they stole 2020.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "It is not just enough to stop immigration. We need mass deportations, executions, the stripping of citizenships, and exiles of traitors.",
                "author": "Roadcruiser2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lol the Epstein files don’t hurt Trump they just make him look better. It’s photos of him with tons of models who over 18 and they say he was gentlemen and the best lover they ever had. Trump is always a bad ass Alpha male",
        "score": 1094,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's the father of girls and a good one at that. He isn't into young girls. His history shows that.",
                "author": "UntakenUsername"
            },
            {
                "raw_content": "Haha same photo on Reddit had their faces blocked not his I wonder why",
                "author": "MisterMAGA"
            },
            {
                "raw_content": "Sure he was a playboy. He fucked adult women, not children. Big difference.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "true",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "where’s AOC?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Troons, Muslims, democrats, etc",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "No, they serve a purpose for our adversaries: Destroy America from the Inside.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BOMBSHELL: Top Obama White House counsel Kathy Ruemmler met with Jeffrey Epstein DOZENS of times AFTER his conviction. Now we know why Democrats suddenly went quiet on the Epstein files. It’s all starting to make sense…",
        "score": 1147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m tired of Epstein. He was a mossad and cia asset blackmailing anyone and everyone he could. Simple as. You don’t need a list. Just acknowledge that anyone stumping for Israel is likely compromised and simply refuse to support them. Yes yes we need justice but this isn’t the wheel of time and they’re not Aiel who will put the noose around their own necks.",
                "author": "Viewer01"
            },
            {
                "raw_content": "They went silent because they already got their message out. You pump with misinformation, connect Trump to it, then drop the story. The mass people will never hear the truth and just be associating Trump to Epstein and if you never mention it again you've already won. It's unethical, should be illegal. I've always wanted an \"equal time recant act\". If you publish a fake story on page 1 of the NYT you should have to publish the recanting of the story in the same size and same page as the initiation. If you spend 5 hours talking about Trump Russia collusion, you should have to spend 5 hours telling everyone you were wrong. Instead, you get a 20 second recant or a buried apology and then they move on but the damage was successful.",
                "author": "DatabaseCentrals"
            },
            {
                "raw_content": "It's a democrat hoax, don't you remember?",
                "author": "Bazhosh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr. announces that the total elimination of mercury in all US vaccines is official.",
        "score": 1675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "here come the liberals buying and gulping down gallons of mercury.",
                "author": "JohnBarronGalt"
            },
            {
                "raw_content": "MAHA!",
                "author": "aloch2"
            },
            {
                "raw_content": "I was told mercury being in vaxxines was a hoax though.",
                "author": "chickeninoven"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegals abandoning houses bought with taxpayer backed FHA loans!",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "<CHIRP> That's the REAL reason they left! HAHAHAHAHAHAHA!",
                "author": "TrumpMagaNoBama"
            },
            {
                "raw_content": "This pisses me off. That's luxury living.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "and here i am like a retard working to save a down payment because homes are unfordable for native born Americans. Biden killed this country, collapse is the only way forward or a massive civil war.",
                "author": "PunishedOrange"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New study reveals alarming link between COVID vaccines and heart inflammation - Patrick Lewis",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You mean the millions that dropped dead “SUDDENLY” wasn’t a give away? People need a one way ticket to the gallows.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "New study? What bullshit. Trying to cover their asses. We have known this from near the very beginning. Bring back the gallows or firing squads. Genocide.",
                "author": "SneakyWino"
            },
            {
                "raw_content": "With each passing day I'm more glad to not have taken that shit.",
                "author": "Bazhosh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "National Guardsman who refuses to be deployed to Chicago to protect federal property tells everyone exactly why she won’t with 3 words “I am Mexican”",
        "score": 752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She boutta get a UCMJ crash course.",
                "author": "ScreaminMime"
            },
            {
                "raw_content": "revoke her citizenship and deport her back to Mexico then",
                "author": "Magma_Biscuit"
            },
            {
                "raw_content": "does Mexico pay her military paycheck? 🤔",
                "author": "zoom19911991"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey, listen fren...",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMFAO XD A meme so bad it gets memed!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Try and tell me the mods don’t have a sense of humor.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "The mod who pinned this is NOT a fag.",
                "author": "1DontTreadOnMe1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And I’m sorry — where are the impeachment proceedings?",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We know why there's no impeachment proceedings.. cause the establishment wants him to continue his activism to nueter Trump's agenda",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "When they killed Charlie we should have hit back by taking Boasberg and 3 or 4 others like him.",
                "author": "Hikedelics"
            },
            {
                "raw_content": "Congressional GOP are as usual MIA on impeaching this cartel muppet.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey Friend Listen.....",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this a lefty meme?! Shorten that shit up!",
                "author": "Schweddynadzbackup"
            },
            {
                "raw_content": "> Hey Fren **WALL OF TEXT**",
                "author": "45fan"
            },
            {
                "raw_content": "I just looked and there has never been a peaceful protest that meant anything to communists.",
                "author": "MickHigan2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Mar-a-Lago raid was a politically motivated fabrication tied to Russiagate. “There was no crime, no predicate to invade Trump’s home.” Authorities are now investigating, with criminal charges on the horizon.",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In two weeks!",
                "author": "Cowpill"
            },
            {
                "raw_content": "Okay? Not a single Democrat in jail. The White House is still obeying leftwing judges. I'm not voting next year. Fuck the GOP.",
                "author": "KuonFan"
            },
            {
                "raw_content": ">Authorities are now investigating, with criminal charges on the horizon. KICK THE FOOTBALL CHARLIE BROWN! Any day now.",
                "author": "Bythrfruitsyknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sick of \"Call To Prayer\" . Bring out your local Instruments. This is the Way!",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even better idea: destroy the muslim megaphone speakers.",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "Bagpipes and Bacon.. This is the way!",
                "author": "shialecuck007"
            },
            {
                "raw_content": "Sing onward christian soldiers: https://share.google/rUN24MKApVkf1c8HT",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US President Donald Trump has said he is leaning toward Warsh or Hassett to lead the Fed, and the next Fed chair should consult with him on where to set interest rates per the WSJ",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "probably another deep state snake like 90% of all the other appointments",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Just end the Fed already.",
                "author": "LordKuroTheGreat"
            },
            {
                "raw_content": "Has to be approved by the Senate. So it's not gonna happen. Yes, I'm entirely blackpilled on congressional republicans. They will do nothing.",
                "author": "lefty295"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shutting Down the 'Fourth Branch.' The Constitution defines three, not four, branches of government.",
        "score": 1212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chevron. They already did. It’s just that retards keep enforcing lame shit; thus rendering everything moot because it comes down to when any one retard sends their badged faggots to offer battle against strangers for them. 🤷🏼‍♂️",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "I swear the ‘general welfare’ clause of the constitution is the cart blanche for politicians to do whatever the hell they want. They’ve abused the notion and hide behind it whenever someone points out this government program or that one that costs tens or hundreds of billions. The only general welfare congress cares about is their own.",
                "author": "Filo76"
            },
            {
                "raw_content": "God forbid we actually FOLLOW the Constitution... SCOTUS has let us down so many times in the last few years...",
                "author": "Shayhawk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Europe is enemy of the USA. Earlier Denmark announced that the USA is threat to them and now Sweden is considering that the USA is threat to the kingdom's security.",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they are a threat to their own existence",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Europeans hate the USA, the USA should let Russia have them.",
                "author": "Chukna"
            },
            {
                "raw_content": "They are their own worst enemy",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan's top 3 banks poised to loan up to $13bn to chipmaker Rapidus",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Japan's three biggest banks have expressed their intention to provide financing to Japanese chipmaker Rapidus as it seeks to mass-produce the country's most advanced chips supporting the local company",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory Price Surge to Persist in 1Q26; Smartphone and Notebook Brands Begin Raising Prices and Downgrading Specs",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "welcome back 8GB laptops. I wonder if the 8GB MB Air will return.",
                "author": "Lower_Fan"
            },
            {
                "raw_content": "Apple releasing 4Gb RAM laptops. “You are gonna love it”",
                "author": "CarretillaRoja"
            },
            {
                "raw_content": "You guys loving that AI? Don't you just love the use of AI? Don't you just love how AI is being fucked into every hole in the world?",
                "author": "PotentialAnt9670"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ZOTAC's special RTX 5060 Ti does not need any power cables",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was reading about this, it's a very neat packaging solution. I wonder if we're ever going to see something more standardised like this in desktop PCs, even just re-locating the graphics card power connectors to somewhere close to the ATX power connector and delivering power over the motherboard and to the card a bit like Asus BTF would be a lot neater. Of course routing high power traces in that area might be a problem.",
                "author": "jenny_905"
            },
            {
                "raw_content": ">The first x8 section carries PCIe data, while the rear section has been repurposed as a 19V power feed from the mini PC’s custom slot, allowing the card to reach its 180W target without external plugs Would the card just die if you stick it into a normal PCIe slot?",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "I was hoping that Nvidia allowed them to sell a 75W 5060Ti :/",
                "author": "Homerlncognito"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese SMIC Achieves 5 nm Production on N+3 Node Without EUV Tools",
        "score": 138,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Just Updated HDR on Switch 2… Here’s What You Need to Change",
        "score": 455,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vincent is a very odd man. I do like him!",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "“The chart is now as useless as a swimsuit in the Sahara” lol 😂 💀",
                "author": "Jad3nCkast"
            },
            {
                "raw_content": "5 clicks for 900nits+ but how many for 800 nits?",
                "author": "Lum1882"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 third party support is a spectrum",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From software games are always poorly optimized. The PS4 version runs better on PS5 than the PS5 version",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "Optimization Either exists or it doesn’t Devs have to take advantage of the cpu. They are solid for the switch 2, probably the best for price per performance wattage for mass production at their targeted mrsp Not amazing and clocked on the low side but they are still competent enough to get modern games running on them; they are significantly better than ps4 and Xbox one jaguar CPU’s That’s why what Bethesda did with Skyrim is weak, poor optimization",
                "author": "roccerfeller"
            },
            {
                "raw_content": "Fromsoft are notorious for launching janky games and fixing them later. They decided to delay elden ring since it wasn't ready.",
                "author": "Hugh_Jegantlers"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I see Skyrim is as buggy as ever on the Switch 2",
        "score": 50,
        "text_content": "I’m used to playing it on PC with all the community patches. Been a while since I played on console and had to deal with all the bugs.",
        "comments": [
            {
                "raw_content": "It's a feature not a bug.",
                "author": "daikunut"
            },
            {
                "raw_content": "It wouldn't be Bethesda otherwise.",
                "author": "twovles31"
            },
            {
                "raw_content": "I wouldn’t change a thing (/s)",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can’t believe I’m playing RDR Portable while waiting for my kids.",
        "score": 408,
        "text_content": "I can remember going to pick this game up on PS3 at midnight and being blown away by what Rockstar has created. I never imagined in my life I’d be playing this game portable looking better and playing better than the PS3.",
        "comments": [
            {
                "raw_content": "Your dashboard was made for this moment, that's a perfect platform for it.",
                "author": "skavenrot"
            },
            {
                "raw_content": "9 years later and I still can't over the fact that we can play home console games on the go. Truly amazing. I miss RDR1.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Just wait till 2 comes out 👀",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata on Switch 2 is so high-quality that even the developers were surprised, say the developers.",
        "score": 345,
        "text_content": "Performance: Ōyama: “I think it’s reaching a level that stands shoulder to shoulder with Resident Evil: Requiem. We plan to release a demo on every home console the game will launch on, so I hope everyone will give it a try. It'​s shaping up to be something thoroughly enjoyable. Please wait just a little longer.” Zhao: “When we first got it running on Switch 2, even the development team was surprised, saying, ‘Wow, it actually runs at this level of quality!’ The reaction was very positive.” Amiibo: Ōyama: “When you load in, you can obtain hacking nodes, which provide unique effects for weapons, healing items, and hacking abilities. Items that can be acquired within the stage will drop, making progression a bit easier. When you return to the shelter from a stage and deploy again, you can load them once more, so it functions as a support bonus that helps make the game easier to progress through.”",
        "comments": [
            {
                "raw_content": "CD Projekt, Ubisoft and Capcom humiliating every developer putting slop ports for Switch 2.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Wonder what's the resolution in handheld for Re9 and pragmata",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "But skyrim can only be 30fps lol",
                "author": "Zealousideal_Carry61"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Man the Switch 1 really held Capcom back compared to their support now on the Switch 2 that aren't solely ports of games from generations ago.",
        "score": 82,
        "text_content": "And that was with them requesting Nintendo to add more RAM to the Switch 1.",
        "comments": [
            {
                "raw_content": "Technically, they never stopped giving support. Rise was made for Switch 1, multiple MH were exclusive to 3DS and RE Revelations was made for the 3DS. But what really surprised me is how they aren't excluding Switch 2 from day 1 like others are doing.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Very curious to see if they get MH Wilds running on Switch 2. Also what the follow up to Rise will be. Hopefully they port RE2-4 remakes natively eventually.",
                "author": "The-student-"
            },
            {
                "raw_content": "60 fps for Monster Hunter Rise! PLEASE!",
                "author": "xSinn3Dx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata Switch 2 screenshots",
        "score": 524,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait what switch 2 version announced??? I missed that",
                "author": "Successful-Bar2579"
            },
            {
                "raw_content": "Diana's hair doesn't look the best but we were all kinda expecting that lol. For comparison, here is what it looks like on ps5 https://preview.redd.it/16zyg4xivq6g1.png?width=2160&format=png&auto=webp&s=3b2c56c3ae6e99df2de44026880ec944318e21d8",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "Technically/visually looks impressive. I'd like to see more Switch 2 clips to decide, but i recall distinctly people saying they weren't sure Pragmata could make it on Switch 2 even after the RE9 annoubncement. Capcom's going all in",
                "author": "dekuweku"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mike Straw: “Half-Life 3 is a Steam Machine launch title, Steam hardware set for Spring 2026”",
        "score": 971,
        "text_content": "He also said the reason behind HL3 not being announced this year is that Valve’s worried about the economics of RAM memory prices and it’s affect on the hardware. 28:05 https://www.youtube.com/live/x7GRLcaZtgA?si=l4cxu-SrhGQnKggL",
        "comments": [
            {
                "raw_content": "Too late, the Half Life subreddit has already gone Arkham-mode insanity",
                "author": "4000kd"
            },
            {
                "raw_content": "This might save the Half Life subreddit from the suicide watch",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "What's the deal with Mike Straw anyway? Serious question. Is he a known leaker? What's his reputation? I started hearing from him last month about HL3, nothing he said came to fruition. When you look at his twitter he mostly talk about American Football/Hockey.",
                "author": "Wrong_Relative1075"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Star Wars: Fate of the Republic likely not coming out until 2030 at the very earliest; Studio was formed last year",
        "score": 1838,
        "text_content": "Per Jason Schreier on Bluesky: [ https://bsky.app/profile/jasonschreier.bsky.social/post/3m7sj6bcoxk2o ](https://bsky.app/profile/jasonschreier.bsky.social/post/3m7sj6bcoxk2o) Somehow forgot to add in \"Old\" in the title lol EDIT 2: Studio was actually formed THIS year. I don't know how I misread that 😭",
        "comments": [
            {
                "raw_content": "Their website says they were founded last July (5 months ago). We might not even see this game again till 2030, let alone release.",
                "author": "4000kd"
            },
            {
                "raw_content": "Ah releasing right along with Star Wars Eclipse then",
                "author": "0shadowstories"
            },
            {
                "raw_content": "Kill all early announcement teasers.",
                "author": "KearLoL"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Natethehate on Persona 6: its not on development hell and P Studio is focused on it,P4R is mainly external developer TOSE",
        "score": 408,
        "text_content": "source1: [https://xcancel.com/NateTheHate2/status/1999595212906090883#m](https://xcancel.com/NateTheHate2/status/1999595212906090883#m) source2: [https://xcancel.com/NateTheHate2/status/1998983539233374508#m](https://xcancel.com/NateTheHate2/status/1998983539233374508#m) finally some hopium towards this damn game",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Sad that \"its not in development hell\" is cause for hopium",
                "author": "masterchef757"
            },
            {
                "raw_content": "My guess with what we saw with Persona 5 Royal's insane legs through Sega's sales data and it being one of the most successful titles in Sega's history. The Persona 6 team, have basically been given unlimited time to make P6 and likely got an even bigger scope then either P5 or Metaphor.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Casey Hudson on the 2030 rumor",
        "score": 254,
        "text_content": "[https://xcancel.com/CaseyDHudson/status/1999652683972489385#m](https://xcancel.com/CaseyDHudson/status/1999652683972489385#m)",
        "comments": [
            {
                "raw_content": "12/29/2029",
                "author": "Darx117"
            },
            {
                "raw_content": "This has a high chance of aging very badly, even with best intentions.",
                "author": "TurnaboutAdam"
            },
            {
                "raw_content": "I think that one of the reasons Casey belives this (unless it's useless lip service), is the fact that he was working on a sci-fi rpg on his previous studio - and I've already seen on linkedin that several of the people who worked with him on that game, including many former BioWare staff, have already joined Arconaut Studio. Who knows, maybe they are planning to salvage some ideas from the game that never saw it's release.",
                "author": "TheHolyGoatman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rumour: Voice Actor Might Have Accidentally Hinted at Bass in Mega Man: Dual Override",
        "score": 67,
        "text_content": "[Coming from Rockman Corner](https://www.rockman-corner.com/2025/12/voice-actor-might-have-accidentally.html) > Following *Dual Override*’s announcement, Rockman Corner reader HCHecxz shared a story on our Discord about a recent meet-and-greet with Matt Hill, known to us as the voice of Bass.EXE in *Mega Man NT Warrior*. During the event, Hill may have let slip that he was voicing Bass -- *classic Bass* \\-- in a project that had not yet been announced. >[](https://blogger.googleusercontent.com/img/b/R29vZ2xl/AVvXsEj6ObOXEkQr4qOFfCRBXy8oDJgf6csBXuoBNU5_JiOVmTucZ08SVNa1hDp8ld5Y8-WbJqD3bfy9X-y6AB5a3dMRDUx41WoVr7XMw_G1G-u7Rber1SvLvS3acaYmVEZ_Falv8FfoKh9gFBxkKlUqqHdXdknzA3VbZiawCpMNnmJdke_a9yKmbze1bVCLW7zY/s1495/2025-12-12%20-%2021_19_57%20-%20(2)%20Discord%20_%20%23classic%20_%20Rockman%20Corner.png) >Image attached with story: I met Matt Hill last weekend at a Con. I was wearing a Rockman Tee & Hate and he was like \"Nice Hat! Be on the look out for a new Mega Man game\". Me thinking he's Bass.EXE went \"Star Force Legacy Collection?!?\" Confused as Bass isn't in it. He looked back caught and we \"...ugh don't think that one\" I said \"Battle Network Legacy Collection came out last year did you do lines for it? He was confused a bit and said \"Ah well\" and changed the subject It is worth noting that Capcom brought Matt Hill back to reprise his role as Bass.EXE in the mobile trading card game *Teppen* in December 2024. Those voice lines can be heard [here](https://www.youtube.com/watch?v=QzVkx6Rpmd0). That said, this was specifically for Bass.EXE, the *Battle Network* incarnation of the character. The classic series version of Bass hasn't had an English counterpart since 1996, so it would stand to reason that Capcom may have looped in Hill for role.",
        "comments": [
            {
                "raw_content": "Please let bass name be mispronounced as bass like the fish",
                "author": "yusakufujiki2"
            },
            {
                "raw_content": "If Bass is playable I really hope they keep his dash and ability to aim in multiple directions. I get they don't give this to Mega Man because of tradition but he was so much fun in Mega Man 10. I hope him and Proto Man being playable again means they're getting their own levels as well",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "I wouldn’t be surprised if they went all out. We already know Protoman will be in it.",
                "author": "ScalaAdInfernum"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[TheGhostofHope] Black Ops 7 financial performance \"below expectations\"; Studio mergers and a complete monetization rethink not off the table for Call of Duty",
        "score": 659,
        "text_content": "[Source](https://www.resetera.com/threads/theghostofhope-bo7-financial-performance-below-expectations-studio-mergers-and-a-complete-monetization-rethink-not-off-the-table-for-cod.1380277/)",
        "comments": [
            {
                "raw_content": "Rethink everything except a yearly release lol",
                "author": "PhatYeeter"
            },
            {
                "raw_content": "You can’t appeal to multiple generations at once. It’s a sea change moment and they need to decide if they chase new players or stick with the increasingly aging existing one. I know many of the OG CoD players are in their 40s now.",
                "author": "Benevolay"
            },
            {
                "raw_content": "Microsoft with the buy high sell low",
                "author": "MolotovMan1263"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Insider Gaming]: A New Alien Game Is Back In Development",
        "score": 262,
        "text_content": "Source: [https://insider-gaming.com/new-alien-game-back-in-development/](https://insider-gaming.com/new-alien-game-back-in-development/) From the article: \"According to sources, this new Alien title is a single-player arcade survival horror game that sees players trying to survive being aboard a decaying space station. They’ll have to evade a mix of xenomorphs and spec ops units in what was described to Insider Gaming as being “Shadow of Tomb Raider with xenomorphs” at its current stage. When it comes to gameplay, its planned to have a mix of combat, platforming, and puzzles. Players will need to rely on stealth, resource management, and problem-solving, with puzzles ranging from repairing machinery to cracking codes. And during combat, enemies won’t just rush blindly. The AI is designed to adapt and react to whatever tactics you use.\"",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "More alien is good with me",
                "author": "gjamesaustin"
            },
            {
                "raw_content": "Isn't this just Creative Assembly's sequel?",
                "author": "ItsCrankss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Indian retailer lists unannounced Core Ultra 9 290K Plus and Core Ultra 7 270K Plus as “in stock”",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yay, I think. The 270K makes far more sense than the 290K, once again, but did I read it right they're sticking to a 125W PL1 this time? My 265K has gone for 250/250 since I first updated the BIOS past pre-launch.",
                "author": "RJsRX7"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen 400 series spotted in latest chipset drivers",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Ok everybody, say it with me: it’s just a slightly higher clocked version of the 300 series with the same Zen4 and RDNA 3.5 cores. There’s not anything to get excited about.",
                "author": "CatoMulligan"
            },
            {
                "raw_content": "Gonna be a slaughter by Panther. AMD not crossing that 20-25% threshold on laptop market share they've been at since Renoir era.",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Colorful launches flagship X870E iGame Vulcan OC motherboard with built-in screen",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perhaps worthy of the name, an OC dream with ...a customizable smart screen...",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor, Sapphire and ASRock launch Radeon AI PRO 9700S/9600D with passive cooling",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Is this a good sign and is it finally happening?",
        "score": 322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homes rise in value 40% since 2020 Those elevated prices now drop a mere percent or two “HOMES ARE TANKING”",
                "author": "Traditional-Pilot955"
            },
            {
                "raw_content": "everywhere in my city and around here \"+150% last 10 years\" going down 2% doesn't mean jack shit when all these 120k shitters are going for 400k",
                "author": "flutasma"
            },
            {
                "raw_content": "Thanks for the Twitter screenshot!",
                "author": "Hot_Examination1918"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I am officially done with \"Starter Homes.\" It’s not an investment; it’s a bailout for the previous generation's neglect.",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The market is not right. Those homes should be priced corrected, which is what is happening right now as homes are losing value.",
                "author": "Johnrays99"
            },
            {
                "raw_content": ">The Bones: A 25-year-old roof, an HVAC system from the Bush administration I feel old",
                "author": "BackToTheCottage"
            },
            {
                "raw_content": "he's right. think about this the next time you see some article trying to instill buyer FOMO. you really don't want to be a massive bagholder of an illiquid asset like a house. buying a home is great but you have to be very intelligent about it. waiting for better deals is fully rational and fine, especially since it means you are building a better down payment anyway, something you'll need to offset the high interest rates.",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing inventory drops for month of November",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a chart though. Look at the trend upwards! Excellent news for homebuyers!",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": ">\"ZOMG it's plummeting! Better buy now or be priced out *forever*!\" oh no! it's only at par with pre-pandemic levels, what *ever* shall we do??",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "Truly shocking 😂",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How much of your income goes to housing right now?",
        "score": 44,
        "text_content": "Mine shows 40% and calls it ‘risky’. People always say ‘keep it under 30%’ but I honestly don’t know anyone who does. Curious what real numbers look like 🥲",
        "comments": [
            {
                "raw_content": "20% but it takes time to get it lower. As a 1st time buyer it was much more (>40%). Fixed rate and time in market make debt to income go down.",
                "author": "KoRaZee"
            },
            {
                "raw_content": "Does \"Insurance\" include Homeowners or Renters Insurance?",
                "author": "KevinBabb62"
            },
            {
                "raw_content": "We just refinanced and now a bit under 25% of net, but my wife also has med school loans that take up 10% and childcare for one is another 10% (but about to be 20% when the next one goes in). I always suggest as low on housing expense as possible but 40% isn’t like an automatic problem",
                "author": "freewallabees"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Housing Ladder Didn’t Stall, It Snapped: What the Data Actually Says About the UK Market",
        "score": 0,
        "text_content": "I ran the numbers properly, and this isn’t opinion or doomposting. This is exactly what the stats in the report are saying. The UK housing market is not “cooling”, “resetting”, or “pausing”. It is structurally jammed. Prices are barely up at around 3% year-on-year, which is below inflation, so in real terms prices are already going backwards. At the same time, transaction volumes are down roughly 37%. That combination matters. Prices are being quoted in a market where hardly anyone is actually buying or selling. That means prices are no longer being discovered by a functioning market. They are just the last number agreed by a very small group of people who still can transact The report’s stress index puts the national market in the top decile of stress compared to the last three years. That is not normal. Volatility is extremely high across most regions, not because prices are booming, but because so few sales are happening that each sale moves the average. Over 80% of areas show extreme fragmentation between property types. Flats, terraces, semis, and detached houses are no longer moving together. That only happens when credit conditions bite and the buyer pool fractures. In a healthy market, everything moves roughly in sync. Here, it doesn’t, because the market itself is broken Mortgage activity is the core failure. Mortgage transaction volumes have collapsed to the worst historical percentile in the data. This is the engine of the housing ladder, and it is not sputtering, it is off. First-time buyers cannot enter in meaningful numbers, movers cannot chain, and anyone relying on selling to buy is stuck. Cash buyers are not a sign of strength here. The report shows cash is not surging because of confidence; it is filling gaps left by mortgage withdrawal in narrow segments. That produces artificial price support without real liquidity. This is how markets freeze before they reprice, not how they recover People point to low repossessions as proof there is no stress. The report directly contradicts that comfort story. Repossessions look low because transactions are low. Distress is being delayed by fixed-rate mortgages, term extensions, and households absorbing pain rather than moving. That does not remove stress; it stores it. When turnover is this low, the marginal seller eventually sets the price, not the average homeowner sitting tight. Thin markets flip suddenly because there is no depth underneath the headline number This is why the housing ladder is dead. The ladder assumes liquidity, credit availability, and smooth price discovery. None of those conditions exist. You cannot “move up” when you cannot sell. You cannot sell when buyers cannot borrow. And you cannot trust prices when they are being set by a tiny, unrepresentative slice of the market. The report does not describe a stable plateau. It describes a market held together by low volume, delayed distress, and denial. That is not a foundation. That is a warning. [Link to Data](https://labs.jamessawyer.co.uk/ukhpi_outputs/ukhpi_report.html)",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "World’s smallest AI supercomputer: Tiiny Ai pocket Lab— the size of a power bank. Palm-sized machine that runs a 120B parameter model locally.",
        "score": 93,
        "text_content": "This just got verified by **Guinness World Records** as the smallest mini PC capable of running a 100B parameter model locally. **The Hardware Specs (Slide 2):** * **RAM:** 80 GB LPDDR5X (This is the bottleneck breaker for local LLMs). * **Compute:** 160 TOPS dNPU + 30 TOPS iNPU. * **Power:** ~30W TDP. * **Size:** 142mm x 80mm (Basically the size of a large power bank). **Performance Claims:** * Runs **GPT-OSS 120B** locally. * **Decoding Speed:** 20+ tokens/s. * **First Token Latency:** 0.5s. **Secret Sauce:** They aren't just brute-forcing it. They are using a new architecture called **\"TurboSparse\"** (dual-level sparsity) combined with **\"PowerInfer\"** to accelerate inference on heterogeneous devices. It effectively makes the model **4x sparser** than a standard MoE (Mixture of Experts) to fit on the portable SoC. We are finally seeing hardware specifically designed for *inference* rather than just gaming GPUs. 80GB of RAM in a handheld form factor suggests we are getting closer to **\"AGI in a pocket.\"**",
        "comments": [
            {
                "raw_content": "looks perfect for homegrown robotics",
                "author": "Digital_Soul_Naga"
            },
            {
                "raw_content": "> RAM: 80 GB LPDDR5X (This is the bottleneck breaker for local LLMs). Ahhh, so that's why there's a RAM shortage.",
                "author": "Zeppelin2k"
            },
            {
                "raw_content": "Is this commercially available? Price?",
                "author": "EngineEar8"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.2 comes in 3rd on Vending-Bench, essentially tied with Sonnet 4.5, with Gemini 3 Pro 1st and Opus 4.5 a close 2nd",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In benchmarks other than the benchmarks touted by OpenAI, GPT 5.2 seems to be among the best, but not clearly the best model.",
                "author": "j-solorzano"
            },
            {
                "raw_content": "Interesting how Sonnet 4.5 and GPT-5.2 have the exact same drop around day 230",
                "author": "ActualBrazilian"
            },
            {
                "raw_content": "Either Openai faked the benchmarks or the model is bench maxed in some domains.",
                "author": "iamz_th"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Deepmind: Gemini rolling out an updated Gemini Native Audio model, built with Audio",
        "score": 300,
        "text_content": "**Features:** - higher precision function calling - better realtime instruction following - smoother and more cohesive conversational abilities **Available to developers in the Gemini API right now!** **Source: Google Deepmind** Improved Gemini audio models for powerful voice interactions 🔗 : https://blog.google/products/gemini/gemini-audio-model-updates/",
        "comments": [
            {
                "raw_content": "Smells like 3.0 Flash is inbound, not a news flash or anything since we knew that. They release these updates for multimodal around releases of new models which aren’t yet dedicated to multimodal purposes.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Surprising release. 3.0 Flash is likely coming out next week, and Nano Banana 2 Flash is also being tested... so one would expect that 3.0 TTS is ready as well. Why spending time on 2.5 then?",
                "author": "Sulth"
            },
            {
                "raw_content": "Voice dictation is the thing that keeps me on OpenAI",
                "author": "Lucky-Emergency-9583"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Epoch predicts Gemini 3.0 pro will achieve a SOTA score on METR",
        "score": 169,
        "text_content": "Epoch AI added ECI scores for Gemini 3 Pro, Opus 4.5, and GPT-5.2. [ECI](https://epoch.ai/benchmarks/eci) combines many benchmarks and correlates with others, so Epoch uses it to predict [METR](https://metr.org/blog/2025-03-19-measuring-ai-ability-to-complete-long-tasks/) Time Horizons. Central predictions for Time Horizon: \\- Gemini 3 Pro: **4.9 hours** \\- GPT-5.2: **3.5 hours** \\- Opus 4.5: **2.6 hours** Epoch notes that 90% prediction intervals are wide, about 2x shorter or 2x longer than their central estimates. They said ECI previously underestimated Claude models on Time Horizons by \\~30% on average. If you adjust for that, they predict Opus 4.5 at \\~3.8 hours (instead of 2.6h). Source: [https://x.com/EpochAIResearch/status/1999585226989928650](https://x.com/EpochAIResearch/status/1999585226989928650)",
        "comments": [
            {
                "raw_content": "So does this surpass Agent 0 from the AI 2027 paper?",
                "author": "torrid-winnowing"
            },
            {
                "raw_content": "Yeah, something along the lines of my predictions too. Though I see GPT 5.2 being below Opus 4.5. Well, the last paragraph in the post says exactly the same.",
                "author": "Rudvild"
            },
            {
                "raw_content": "Gemini 3.0 pro fucks. Idgaf what the benchmarks say, this thing simply \"gets it\" in my experience",
                "author": "AverageUnited3237"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Erdos Problem #1026 Solved and Formally Proved via Human-AI Collaboration (Aristotle). Terry Tao confirms the AI contributed \"new understanding,\"not just search.",
        "score": 322,
        "text_content": "**The Breakthrough:** Harmonic's AI system **\"Aristotle\"** has successfully collaborated with human mathematicians to solve and formally prove (in Lean 4) the **Erdos #1026 problem.** This **wasn't** just a database lookup. As noted in the discussion (and Terry Tao's blog), the AI provided a **\"creative and elegant generalization\"** of a 1959 paper. It's effectively generating a new mathematical insight rather than just retrieving existing literature. It bridges the **gap** between **\"AI as a Search Engine\"** and **\"AI as a Researcher.\"** **Source: Terry Tao's Blog** 🔗: https://terrytao.wordpress.com/2025/12/08/the-story-of-erdos-problem-126/",
        "comments": [
            {
                "raw_content": "Where does Terence tao say new understanding?",
                "author": "NunyaBuzor"
            },
            {
                "raw_content": "a few interesting thoughts from @llllvvuu: > I didn’t make a crisp AI claim on this one because it had the very humanlike (i.e. tending to arise from real collaboration) property of not having a simple credit assignment story. The only thing I could try to communicate was that, despite the AI not directly proving a previously-unknown result, we had a moment of “looking at what the AI actually did provoked some productive thought” rather than just “looking at what the AI actually did provoked a general sense of anticlimax”, and hence did contribute in a meaningful way to the ultimately new result (said new result was essentially finding the right two arguments to mash together, but that unexpected connection itself is what’s elegant) and > It’s tempting to imagine a binary, an uncrossable chasm between AI surfacing old ideas and AI discovering new big ideas. It may instead happen that there is a continuum where AI gives slight creative nudges via tweaking existing ideas, then eventually discovering new small ideas, before finally discovering new big ideas. There is a vast space of possible forms of human-AI collaboration in between, and this was a fun instance of AI’s participation in the discussion feeling particularly human.",
                "author": "my_shiny_new_account"
            },
            {
                "raw_content": "But but but LLMs told me 2+2 = 5 , 3 years ago?!!! This must be fake , and the best mathematician alive is actually incorrect. LLMs cannot do math. They're just fancy autocomplete!!!",
                "author": "Funkahontas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2(xhigh) benchmarks out. Higher than 5.1(high) overall average, and higher hallucination rate.",
        "score": 24,
        "text_content": "I'm sure I don't have access to the xhigh amount of reasoning in ChatGPT website, because it refuses to think and is giving braindead responses. Would be interesting to see the results of 5.2(high) and see it hasn't improved any amount.",
        "comments": [
            {
                "raw_content": "GPT-5.2 (xhigh) which uses juice of 768 is only available over API, not the plus (who get like 64 juice) or pro (who get like 200 juice) subs.",
                "author": "Sad_Use_4584"
            },
            {
                "raw_content": "Simplebench humiliates GPT 5.2 (17th) and xhigh (8th), and that's the only benchmark I believe these days.",
                "author": "holvagyok"
            },
            {
                "raw_content": "Great! Still waiting for METR to update their time horizon graph though.",
                "author": "epic-cookie64"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Diffusion LLMs were supposed to be a dead end. Ant Group just scaled one to 100B and it's smoking AR models on coding",
        "score": 315,
        "text_content": "I've spent two years hearing \"diffusion won't work for text\" and honestly started believing it. Then this dropped today. Ant Group open sourced LLaDA 2.0, a 100B model that doesn't predict the next token. It works like BERT on steroids: masks random tokens, then reconstructs the whole sequence in parallel. First time anyone's scaled this past 8B. Results are wild. 2.1x faster than Qwen3 30B, beats it on HumanEval and MBPP, hits 60% on AIME 2025. Parallel decoding finally works at scale. The kicker: they didn't train from scratch. They converted a pretrained AR model using a phased trick. Meaning existing AR models could potentially be converted. Let that sink in. If this scales further, the left to right paradigm that's dominated since GPT 2 might actually be on borrowed time. Anyone tested it yet? Benchmarks are one thing but does it feel different?",
        "comments": [
            {
                "raw_content": "How does a diffusion LLM determine how long it's response will be? Is it fixed from the beginning of the generation?",
                "author": "SarahSplatz"
            },
            {
                "raw_content": "no links?",
                "author": "Dear_Departure9459"
            },
            {
                "raw_content": "Maybe diffusion models will be like the right brain and normal LLM models will be like the left brain in hybrid systems.",
                "author": "Single-Credit-1543"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "HuggingFace now hosts over 2.2 million models",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. When thinking about how far the capabilities have come in 2.2million models, it makes me wonder how many more models are left until we reach AGI/ASI.",
                "author": "Dry_Management_8203"
            },
            {
                "raw_content": "https://preview.redd.it/sarwv7lj6w6g1.jpeg?width=632&format=pjpg&auto=webp&s=7f19a3a642d4710093222b1478d1ef50110e8ed1",
                "author": "Certificus"
            },
            {
                "raw_content": "Jesus how much storage space does that take?",
                "author": "jazir555"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.2 might be SOTA",
        "score": 20,
        "text_content": "I saw this before onthis sub how every model was failing, and since then, when a new model comes out, I was always testing, and this is the first time it got a correct answer",
        "comments": [
            {
                "raw_content": "Actually GPT5.1 also got this I believe, I tested it awhile ago too lol. Gemini 3 does not interestingly even tho its vision is supposed to be very good",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "I am super surprised it got such a bad result in simplebench, though",
                "author": "shotx333"
            },
            {
                "raw_content": "I gave 5.2 a simple table with 3 columns and 7 rows and asked to draw a line chart. It failed miserably. Gemini 3 pro did it perfectly.",
                "author": "mxforest"
            }
        ],
        "subreddit": "singularity"
    }
]