[
    {
        "post_name": "Do leftists care about children?",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course they do, they harvest their organs so they can live in mansions!",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "Only when they can be USED.",
                "author": "MarshallB"
            },
            {
                "raw_content": "Only their own... and sometimes not even then...",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mamdani Criticized for ‘Staged’ Hanukkah Clip with Actor Mandy Patinkin: ‘We’re Not Fooled, Zohran’",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, the guy who hired the female rabbi?",
                "author": "Account"
            },
            {
                "raw_content": "Great. I've now lost all respect for Patinkin, who is arguably one of the best actors in the history of the profession.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Important News I just peed, but it still feels like I have to pee a little bit more. .",
                "author": "CaptainCuomo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Walz actually shut down the very office that had been investigating fraud for years. Now the truth is pouring out and the backlash is massive. Calls for his resignation are getting louder by the hour.",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if all that happens to him is resignation i will finally begin to consider this administration fully compromised.",
                "author": "thelastlast"
            },
            {
                "raw_content": "on Walz they're closing in it's the beginning of the end",
                "author": "Calumet57"
            },
            {
                "raw_content": "Sounds like time for an arrest??",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our governor is literally a deadbeat. Every other state paid back its federal COVID loan. California defaulted. So now our small businesses have to repay the $20 billion through automatic tax increases.",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I will never forget the day that DOGE discovered that FEMA was spending $59 MILLION to house illegal aliens in luxury hotels in NYC… …all while FEMA nearly kicked out 3,000 Americans from their hotel rooms in the dead of winter in Western North Carolina after Hurricane Helen.",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DOGE really kicked ass. I'm tired of the low energy naysayers saying Musk did nothing.",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "We from Western NC will never forget the faggot Democrats that chose illegals over Americans.",
                "author": "OldZilla"
            },
            {
                "raw_content": "I remember they also didn't let citizens through with supplies and blocked roads illegally",
                "author": "STONKATRUCK"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal alien Chinese bus driver who got his CDL in New York allegedly causes fatal pileup in Tennessee",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many such cases",
                "author": "PepePatriot"
            },
            {
                "raw_content": "Need to throw the people issuing these CDL’s in prison or they’ll just keep giving out more.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Sum Ting Wong",
                "author": "Givesgunstogrannies"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to announce that I am appointing the GREAT Governor of Louisiana, Jeff Landry, as the United States Special Envoy to Greenland",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# MAKE # GREENLAND # AMERICA",
                "author": "FatigueIsReaI"
            },
            {
                "raw_content": "be pleased to announce a fucking replacement AG!!!!!",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "So is he still my governor?",
                "author": "TravisRSCX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vance: “You don't have to apologize for being White anymore.” * Crowd erupts *",
        "score": 999,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never Did...",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "It’s fuckin’ great to be White!",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Vance says all the right things and seems much more in tune with the base than Trump is. The question is whether he'll take action accordingly if given power.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Western Europe will be Islamic states in 30-40 years. They do not share our values. It’s time to leave NATO.",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "30 years? More like 13. This has the makings of a end of days scenario. I can see open rebellion in the UK soon and we will have to make a major decision. Same concept in the states. Infilrate the major cities and take over. Sound familiar?",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Time to build new alliances with Christian nations.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "u/War_Hamster \"nAtO\" has never been about the 'West' for 'Western Europe', including the USA in it. It's been a tool for the globalists/internationalists to keep Europe divided between the 'western' parts and 'eastern parts' = specifically Russia. Using the Atlantic Council as the main font of this geopolitical game.",
                "author": "Worldtraveler0405"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lol!",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Troll them until they cry. And then troll them some more.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "From 2019... https://www.mediaite.com/politics/trump/trump-reportedly-keeps-showing-white-house-guests-where-bill-clinton-and-monica-lewinsky-had-sex/ Two OLD AF articles where OP omits or removes the date and doesn't post a source link. Color me not impressed with this garbage.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Needs a plaque.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance Full Speech AmFest 2025",
        "score": 508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That picture of him kissing the wall is tough to get past.",
                "author": "TexasBeer"
            },
            {
                "raw_content": "I don’t trust him at all",
                "author": "medicpatriot"
            },
            {
                "raw_content": "This is one of the greatest speeches in modern political history. Vance might be the closest thing we have to Charlie Kirk himself. He is a red pill factory.He’s never shied away from controversial issues and he’s so intelligent and good hearted he can cut through the leftist propaganda effortlessly, just like Charlie. Been saying this for years. Vance is the best politician behind Trump. A country boy. A red blooded American. A marine. A rags to riches American Dream story personified. Trump couldn’t have made a better VP choice. Vance was loyal all throughout Trump’s first admin. Never faltered when so many other people started betraying Trump in 2020 and 2021. Close friends with Donald Trump Jr. May was well be part of the Trump family. There’s actually a possibility of Vance 2028 and 2032 being better than Trump’s two administrations. Trump revolutionized politics, discredited the media, and broke the Overton Window but Vance does some things better than Trump. Vance isn’t as funny or compelling when he speaks but he is sharp as a tack, extremely polite, and he can appeal to moderates and independents in a way that Trump never could. The best is yet to come!",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You've been warned",
        "score": 1076,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this lying cunt out of the hospital yet? Can she go testify at Congress now ? No one is above the law",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "Her body double is going to commit forever self sleep?",
                "author": "zen_toco"
            },
            {
                "raw_content": "When did Hillary turn into Donkey from Shrek?",
                "author": "TexasRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Christmas time chat",
        "score": 679,
        "text_content": "<p>As Christmas approaches, I find myself drawn to the quieter aspects of the story that the world often overlooks.</p> <p>Before the advent of crowns, kingdoms, churches, and traditions, there was a young woman who accepted God’s call without comprehending the unfolding events. There was a man who chose faith over fear. There was a child born not into power or comfort, but into humility. No palaces, no armies, just obedience, trust, and love.</p> <p>“And the Word became flesh and dwelt among us.”</p> <p>That’s the miracle we’re about to witness once again this season.</p> <p>It’s easy to feel disheartened right now. The world seems loud, fractured, and unstable. Trolls and stormfags abound, and truth is often mocked. Faith is treated like a relic, conviction is labeled cruelty, and humility is mistaken for weakness. However, Christmas reminds us that God accomplishes His greatest work in unexpected places, through ordinary individuals, in moments that may appear insignificant at the time.</p> <p>Christ didn’t come to validate the world as it was. He came to redeem it.</p> <p>He didn’t arrive with force but through sacrifice. He didn’t seek to rule through fear but to save through love. This doesn’t mean truth became weaker; it means it became flesh—lived, walked out among us.</p> <p>This season calls us back to that example.</p> <p>We must stand firm without becoming cruel. We must speak truth without losing compassion. We must hold our ground while remembering the significance of that ground.</p> <p>Christmas is not about escaping hardship; it’s about God joining us in it.</p> <p>So, if things feel broken, weary, or confusing, you’re closer to the manger than you realize.</p> <p>Take time this season to be still, pray, read the story again, spend time with your family, extend grace wherever possible, and remember that light shines brightest in the darkness not because the darkness is powerful, but because it cannot overpower the light.</p> <p>“Glory to God in the highest, and on earth peace, good will toward men.”</p> <p>May that peace rest on your homes, your hearts, and your faith this Christmas.</p> <p>I apologize for my preaching tone, but I genuinely wish you all a very Merry Christmas.</p> <p>Merry Christmas</p>",
        "comments": [
            {
                "raw_content": "God bless you @-f-b-i-",
                "author": "m0ntsta"
            },
            {
                "raw_content": "# Thanks for all you do!!! ~ cindi ~",
                "author": "Broomstikchik"
            },
            {
                "raw_content": "Jesus Christ is King! Merry Christmas, Pedes! And someone whip up some tasty s'mores for our great mods and Doggos for delivering us to yet another year's end in one piece.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣 🤣 🤣",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dims waiting for Satan to announce he’s runnning.",
                "author": "MegoThor"
            },
            {
                "raw_content": "No point in running when it's been proven the candidate is just installed. Idiot Democrat voters see nothing wrong with that either",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "they messed up my thumb nail ???",
                "author": "TimWaltz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Word",
        "score": 1018,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I second that. Word.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Amen!!! Australia will ban guns harder now.",
                "author": "TravisRSCX"
            },
            {
                "raw_content": "You can still buy one legally, it’s just one hell of a hassle. And I think they only allow bolt action rifles",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Suicidal Empathy",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stockholm syndrome. Stockholm syndrome is a psychological condition in which individuals who are kidnapped or held captive (or butt-raped) develop positive feelings, empathy, or even emotional bonds with their captors, often defending them despite the danger they faced.",
                "author": "Spunas1"
            },
            {
                "raw_content": "From 2016. So, knowing what we know now, \"Raped\" means massive faggot caught in the act and his blackmailers (anyone's guess, but we all know, country of origin) told him to publicly defend his \"assailant'. Edit: And why do all these eurofags like Karsten here have an IMDB profile?",
                "author": "wranlon2"
            },
            {
                "raw_content": "From 2016... https://www.dailymail.co.uk/news/article-3528236/Male-Norwegian-politician-raped-asylum-seeker-says-feels-GUILTY-attacker-deported-man-suffer-Somalia.html",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEI and the Rise of Ideological Tyranny During the Biden Years",
        "score": 572,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their brains are vaxfried. They'll all be dead of vaxcancer and vaxaids pretty soon, so this will be kinda moot except for the historical lessons.",
                "author": "DogPilledMom69"
            },
            {
                "raw_content": "we’ve had anti-white racism called affirmative action since the 1970s. its been going on so long its closer to a genocide",
                "author": "IlhansBrother"
            },
            {
                "raw_content": "Well, it's time for the fall of it now that the scandal is publicly known!",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Almost time",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grew up in a house with wood paneling and a Philco console TV. People today are literally living like kings, and they don't even realize it.",
                "author": "CaptRied"
            },
            {
                "raw_content": "Merry Christmas!!",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "The pajama themes make this extra spicey.",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republicans are demanding full restitution for Rudy Giuliani, who was charged with 13 felony counts and fined $148 million after contesting Georgia’s 2020 election, following Fulton County’s admission that 315,000 votes were fraudulently counted.",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lock up Ruby. At least start there.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Not just restitution. *Retribution*. Those that perpetrated calumny upon Giuliani's person and property, need to find multiplied punishment. Each.",
                "author": "barwhack"
            },
            {
                "raw_content": "Sad part is that a lot of his prized possessions that he has already handed over he will likely never see again.",
                "author": "Transparency"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why is Gen z moving right",
        "score": 1427,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People aren't really moving right so much as reacting to the left moving into deeper insanity. 15 years ago, no mainstream Democrat was publicly supporting the trans mental illness, or publicly saying we should have open borders. The left went insane and lacks the ability to recognize that their own positions have changed. They literally went from \"let gay couples marry\" to \"if you try to stop us from chopping off children's genitals you are a bigot\" in 10 years and they call us the ones moving into extremism. Communist-minded people are extreme narcissists who are disconnected from reality. We need to socially neuter them by removing them from all positions of power and relentlessly mocking and deriding them until nobody will associate with them.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "Or when the bread cost $100 dollars a loaf and the circus is a bunch of criminals stabbing a random audience member on the street/bus.",
                "author": "ListenJack"
            },
            {
                "raw_content": "they aren't moving right they are moving populist and radical change saying they are \"moving right\" assumes they will be supporting republicans, which they wont as things stand",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Moore Threads unveils next-gen gaming GPU with 15x performance and 50x ray tracing improvement — AI GPU with claimed performance between Hopper and Blackwell also in the works",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Raw power means barely anything if the drivers are unoptimized. Even tho their last offerings were strong on paper and in benchmarks, they failed in day to day workloads cause of the unoptimized drivers, still a good start nonetheless",
                "author": "dadols"
            },
            {
                "raw_content": "Yeah, I can invent paper specs too. Just multiply all those numbers by 10 and that's what my startup is going to release next year.",
                "author": "Frexxia"
            },
            {
                "raw_content": "Their [previous](https://www.guru3d.com/story/moore-threads-mtt-s90-reached-geforce-rtx-4060-performance/) GPU was only a little ahead of the RTX 4060 in benchmarks but IIRC its under $200 and has been on sale for as low as $165. They mostly sell in China though but they do have a huge domestic market so there are some international sellers selling them too. Would like to see something in the 9070/5070 territory for circa 400 next.",
                "author": "KR4T0S"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung, SK Hynix to beat TSMC in gross profit margin for memory business",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time for TMSC to pump up their prices. Can’t be losing money in sales…",
                "author": "LickMyKnee"
            },
            {
                "raw_content": "TSMC is mainly in the processors chips business, less in the memory business.",
                "author": "alexandreracine"
            },
            {
                "raw_content": "So they are / will be admitting that they are price gauging basically.",
                "author": "noiserr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Secures AI Chip Deal With Elon Musk's xAI",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can’t wait for this bubble to burst",
                "author": "AcademicF"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Study: Batteries Lose Charge When They ‘Breathe’",
        "score": 261,
        "text_content": "> Researchers found that every cycle of charge and discharge causes batteries to expand and contract, similar to human breathing. This action causes battery components to warp just a tiny amount, putting strain on the battery and weakening it over time. This phenomenon, known as “chemomechanical degradation,” leads to reduced performance and lifespan",
        "comments": [
            {
                "raw_content": "To the people that are commenting \"didn't we already know this?\", yes they are aware, the title is symplifing the findings: > Electrode deformation induced by internal strain accumulation represents a major failure mode in lithium-ion batteries. However, **little is known about how local strain forms and evolves during battery operation**. Sun et al. explored the strain dynamics in lithium-ion battery cathodes and **identified substantial heterogeneity in the states of charge among electrode particles at the onset of operation**, which induces local strain. Using optical flow mapping and grain-resolved synchrotron x-ray diffraction, the authors tracked particle behavior and revealed an intriguing coupling between charge transfer and particle motion. A larger out-of-plane deformation compared with the in-plane counterpart was also confirmed to be responsible for electrode wrinkling. —Jack Huang",
                "author": "braiam"
            },
            {
                "raw_content": "I can't wait until solid state batteries fix this.",
                "author": "mycall"
            },
            {
                "raw_content": "So is the best option is try to do 0-100 charging or something close compared to many 50-90 type charging?",
                "author": "binge_readre"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600 is fundamentally different than Samsung's previous in-house chips",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does that mean it's good?",
                "author": "LargeSinkholesInNYC"
            },
            {
                "raw_content": "> It is rumored that Samsung decided not to integrate a modem inside the Exynos 2600 to reduce heat generation and use that area for other intellectual property (IP) blocks, such as the CPU, GPU, NPU, and ISP. Since other IP blocks get to use more surface area of a chip, they could pack in more transistors, **resulting in higher performance than previous Exynos chips.** I'll believe it when I see it.",
                "author": "SmileyBMM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Donkey Kong Bananza Version 3.0.0 is now available",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "General * Added Thai as a supported language. If you set the language to “Thai/English” in the Nintendo Switch 2 system, the text will become Thai. The audio is English. * Added “Camera's automatic tracking” to “Options” in the Pause Menu, and made it so that you can set it ON/OFF. * Several other changes have been made and issues addressed to improve the gameplay experience.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "....am I the only one hoping for some HUD options? It's really annoying the on-screen hints and controls. You stop for 5 second and it's reminding you the controls.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Internal GameStop memo confirms that Nintendo has ended production of the Mario Kart World Switch 2 bundle",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well thats it boys lets wait for next chrismas",
                "author": "JampyL"
            },
            {
                "raw_content": "Lasted for longer than I expected, I do worry that this will lead to an inevitable price increase for the standalone system to $500 next year due to the skyrocketing cost of DRAM and NAND.",
                "author": "Lisata598"
            },
            {
                "raw_content": "Kinda surprised it lasted this long. Thought the Legends Z-A bundle was going to replace it, but that seems to have gone out of production before the Mario Kart World bundle.",
                "author": "gaysaucemage"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Huge shoutout to Cast n Chill, just dropped on Switch 2",
        "score": 107,
        "text_content": "You all like cozy games right? It seems like every time I go into a Nintendo subreddit someone is asking for them. This is a REAL cozy game, like super high cozy factor, that is not a visual novel, nor a farming game, nor an immersive sim. https://preview.redd.it/qy3rn3lzun8g1.jpg?width=1920&format=pjpg&auto=webp&s=70ec9a2633141662b117c2f1f70f4cd1510c523d In Cast n Chill you fish. By the lake. You cast the rod and you chill. Side scrolling perspective, you can see the fish in the bottom of the water and try to fish specific ones. All the while you're treated to an audiovisual spectacle, truly some of the best pixel art I've ever seen. Computer background material. I adored the game when it first dropped on PC and I am honestly glad for Switch/Switch 2 owners that they get a console exclusive (for now) like this. It's like someone realized we all get a kick out of the fishing minigame from every open world game ever, and made a game like that. It's not a grand adventure, it's trying to scratch the fishing minigame itch and absolutely succeeding. going for the vibes and they are immaculate. Fishing mechanics are really solid, which separates this game from your average indie pixel art game. it's just cast n chill. If you cough up a few extra pesos you can also get a cute pixel doggie and a kitty for your boat as a deluxe bonus, purely aesthetic and absolutely works. It won't be anyone's favorite game of all time, but a great small game to keep installed for a quick run maybe forever",
        "comments": [
            {
                "raw_content": "I consider this the monster hunter of fishing games. Catch fish, sell fish, upgrade gear, repeat. Go to new fishing holes, catch legendary fish, and wait for dlc. Its a fantastic game.",
                "author": "parolebot"
            },
            {
                "raw_content": "My wife and I spent a majority of our weekend playing this; such a fun chill game, especially with a toddler running around 🤣",
                "author": "SolarDeath666"
            },
            {
                "raw_content": "I bought it 30 min ago. It's a nice chill game so far. I can see myself having the switch on at my work, let it idle catch and release for ambiance and pick it up and fish whenever I have a some free time.",
                "author": "Extreme_Hat1089"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Skyrim on switch is 60 fps now (only indoors)",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tod Howard's done it again! I don't care how many new fancy bells and whistles you add to it, no excuse for a game that originally released in 2011 to run this poorly.",
                "author": "Full_Metal18"
            },
            {
                "raw_content": "A stuttery 60 fps indoors and a stuttery 30 fps outdoors. I wish they just cap the framerate again, but without the horrible input lag.",
                "author": "Master-Barber-4836"
            },
            {
                "raw_content": "I’ve played Skyrim a few times on different consoles (Xbox 360, Xbox one, Switch) and it’s always a janky, buggy mess. Considering this is like the 10th+ release like in 15 years, It’ll never get better.",
                "author": "ButtCrackBop"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I want this game on the Switch 2 so bad",
        "score": 30,
        "text_content": "I've already had it on the PS5 since 2023 but would love to be able to play it on the Switch 2 and take it anywhere (with WiFi of course)",
        "comments": [
            {
                "raw_content": "Yeah I kinda thought it would be announced at TGA",
                "author": "setonfire_"
            },
            {
                "raw_content": "It will happen. Give it some time. I think that they need to figure it out how they need to implement the offline gaming. If I’m not wrong Diablo 3 was also always online and they managed to play Diablo 3 offline.",
                "author": "UpstairsExercise650"
            },
            {
                "raw_content": "And where da fook is Doom Dark Ages?",
                "author": "shawarmaking_85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For switch 2 users that also own a gaming pc",
        "score": 24,
        "text_content": "How do you decide what games to buy on which platform?",
        "comments": [
            {
                "raw_content": "AAA on PC, indies and exclusives on switch",
                "author": "trmetroidmaniac"
            },
            {
                "raw_content": "Only exclusives on switch for me",
                "author": "skynovaaa"
            },
            {
                "raw_content": "Honestly just depends on the game. I own a PC, ally and switch 2. I will say more than lately I do find myself playing my switch 2. But it's mainly for the ease of use. For me no matter what OS I run on my ally whether it be steamOS based or windows based, I still end up having to tweak and mess around with things(or in the case of windows deal with windows update). The switch 2 I don't have to worry about any of that. Sure I sacrifice some visual fidelity and frame rate depending on the game, but I spend more time in game than I do on my ally. What's got me super excited is the launch of the new nitro deck coming. I had one for my OG switch and it was a game changer.",
                "author": "Thisguy91223"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m calling it now. Assassin’s Creed Shadows is better looking than Star Wars Outlaws.",
        "score": 234,
        "text_content": "Maybe it's just because I prefer the aesthetic of Japan over a galaxy far far away but this game is stunning. Runs really well too. I waited until the patch to play. I'm about 23 hours in and only had one crash. Runs really well. If you enjoy open world, and stealth, you can't really go wrong.",
        "comments": [
            {
                "raw_content": "Go and play the Final Fantasy 7 Remake Demo",
                "author": "SatyrAngel"
            },
            {
                "raw_content": "Nintendo fans, who have been the most vocal about graphics not being important, have been more vocal about graphics more than anything since release",
                "author": "ChemG8r"
            },
            {
                "raw_content": "Neither are games I’m particularly interested in playing, but it’s nice to see newer games running well and looking good on Switch 2.",
                "author": "SubterraneanSmoothie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got a small Christmas gift to myself",
        "score": 312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice! I honestly loved the game especially on hard mode.",
                "author": "DannySanWolf07"
            },
            {
                "raw_content": "Have a good time with it. One of my favorite games I’ve played this year.",
                "author": "honorable_doofus"
            },
            {
                "raw_content": "Great game! Have fun",
                "author": "PaleFondant2488"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Alleged The Elder Scrolls VI: Iliac (internal name: WhiteBeach) leak found on 4chan",
        "score": 62,
        "text_content": "> Title: The Elder Scrolls VI: Iliac > Setting: Hammerfell+Coastal High Rock > Yes: 11 Major Cities, 2 “fortress/cities”, Shipbuilding, Settlement Building, Procedural Generation (Iliac bay), thieves guild, dark brotherhood, fighters guild, mages guild, imperial cult (not joinable), Temple of Three (not joinable), Crowns (exclusionary), Forebears (exclusionary) > No: Sword Singing for player character, Generic (Starfield) NPCs, Dwemer return, Orsinium > Story: Revolves around Nocturnal, Peryite, and an Akaviri artifact > Side plot: Crown/Forebears are joinable factions and oppose the Thalmor -can only choose one faction -do not directly oppose one another -fight against Thalmor/Aldmeri invasion -Story, landscape, rulers, towns are all affected by which faction you choose -the ending to the main quest will be mostly the same but how it develops will be different based on which faction is chosen/no faction being chosen > World is open -interiors and cities are free of load zones -minus loading into ProcGen areas from handcrafted areas and vice versa. > Game is much further along than what is being reported -Marketing to start ramping up in January 2026 -Full announcement at Summer Showcase -Release window depends on how much is polished by the end of May 2026 but currently shooting for holiday 2026 to Q1 2027 > Not exclusive to Xbox but delayed release to PlayStation > For credibility, the internal name for TESVI is “WhiteBeach” Some information already seen in previous \"leaks\" such as ship building, sailing and the archipelago being a proc-gen area. Directly disproves previous alleged info about sword singing, though. It talks about some weirdly specific details such as the main story's premise and the factions. A bit harder to make educated guesses with those. Estimated release being 2026 sounds sketchy. Probably the weirdest timeframe I've seen floating around. Guess we should see if marketing \"ramps up\" this January. Internal name is also an interesting way for someone else with credentials to possibly verify the validity of the info. Nevertheless, aside from the release, it’s a realistic prediction/leak. **As always, it's 4chan. Take the info with a truckload of salt.**",
        "comments": [
            {
                "raw_content": "![gif](giphy|eXOVOJLkK6G7S)",
                "author": "CLASSIESTCHIMP209"
            },
            {
                "raw_content": "😭 This shit so fake faker than my last BBL I got",
                "author": "Sorry_Soup_6558"
            },
            {
                "raw_content": "I was about call the shipbuilding bs but then I remember that Starfield already laid the foundations for it. Regardless, this leak is another shot in the dark at making shit up to draw attention.",
                "author": "Sidesight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Switch 2 Mario Kart World Bundle May Be Discontinued, According to A Leaked GameStop Memo/ Nintendeal",
        "score": 288,
        "text_content": "https://bsky.app/profile/nintendeal.com/post/3majevuxgsk2p https://xcancel.com/Nintendeal/status/2002812731108581597?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet",
        "comments": [
            {
                "raw_content": "We knew this all the way back in April, Nintendo themselves noted that it would be a limited bundle until Fall 2025. Not sure why people are surprised by this 🤷🏽",
                "author": "Sejarol"
            },
            {
                "raw_content": "It's probably making a comeback every upcoming holiday season, the same way Mario Kart 8 Deluxe bundle did during half the Switch 1 lifetime.",
                "author": "Medd-"
            },
            {
                "raw_content": "I thought this bundle was announced as limited time, was it not? I guess we just didn't know the exact timing",
                "author": "LoloTheWarPigeon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "20+ minutes of new Marathon gameplay from the October/December tests leaked",
        "score": 527,
        "text_content": "After digging through Bilibili, I found a few videos that were not yet taken down by Sony. The PC performance improved in the December playtest and the player was getting 145fps average on max settings at 1440p (no frame gen available) with a 9070XT and 9800X3D - Intro mission: https://streamable.com/o7hst4 - Room mini-puzzle: https://streamable.com/1bmyoo - PvP gameplay: https://streamable.com/29ahn1 - More PvP: https://streamable.com/7c7yf3 - New guns shown (sniper etc.): https://streamable.com/zpesed Original source: https://space.bilibili.com/3333537",
        "comments": [
            {
                "raw_content": "Invisibility in an extraction shooter? That’s a big no for me.",
                "author": "nhozemphtek"
            },
            {
                "raw_content": "I don't think it's going to flop like Concord, but I can see it ending up like Anthem. It likely isn't going to appeal to anyone outside a hardcore PvP audience.",
                "author": "voltwaffle"
            },
            {
                "raw_content": "TTK is so fking fast, none of the pvp encounters had any shooting back. Literally who shoots first / who sees who first results in a win.",
                "author": "Chun--Chun2"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Post-Mortem of the i9-14900KS Are we truly stable after the 0x12B era or just delaying the inevitable?",
        "score": 53,
        "text_content": "It has been a significant amount of time since the widespread instability controversy surrounding the 13th and 14th Gen processors peaked, yet the long-term verdict on the flagship i9-14900KS remains a polarizing topic that requires a brutally honest reassessment in late 2025. Following the deployment of Intel’s critical microcode updates, specifically the 0x129 and the finalized 0x12B patches intended to address the root cause of the Vmin shift instability, the narrative has largely shifted from active crisis management to a quiet acceptance, but I am looking to cut through the noise to understand the actual technical reality of daily driving this silicon today. I am specifically asking current owners to detail whether their systems have truly achieved complete stability without compromising the advertised performance metrics, or if the \"fix\" has simply masked underlying degradation issues that are now manifesting as occasional decompression errors, shader compilation stutters, or unexplained application crashes under heavy load. It is crucial to distinguish between a processor that is genuinely stable at stock Intel parameters and one that is only functioning because it has been manually downclocked or power-limited to avoid the voltage spikes that previously killed these chips. I am not interested in speculative defenses of the architecture; I need concrete feedback from users who have pushed this chip for months post-patch to determine if the 14900KS is finally a reliable workstation component or if it remains a silicon lottery gamble where degradation is still a looming threat despite the software mitigations. If you have had to RMA your unit recently or are noticing that your voltage requirements are creeping up to maintain the same frequencies, that is the kind of data point that defines the true state of this platform right now.",
        "comments": [
            {
                "raw_content": "I’m not sure if anyone can offer you anything but anecdotes. We have a lot of these in heavy use in always on machines at my workplace and we had to replace many of them in the past. It’s a lot better now so the fixes did at least something.",
                "author": "jaaval"
            },
            {
                "raw_content": "My PC still crashes to this day but it's less frequent after the patches, I own 13900K and I can't get a refund/replacement in my country, which makes me pissed.",
                "author": "pitaorlaffa"
            },
            {
                "raw_content": "Have mine since release, the latest microcode is 0x12F. Had some instabilities prior this code in April this year but it seems it was caused by a Windows 11 update - no issues since 12F.",
                "author": "Razzer85"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "New Driver for Intel® 7th-10th Gen Processor Graphics - Windows*",
        "score": 40,
        "text_content": "Release notes: [https://downloadmirror.intel.com/871509/ReleaseNotes\\_101.2140.pdf](https://downloadmirror.intel.com/871509/ReleaseNotes_101.2140.pdf)",
        "comments": [
            {
                "raw_content": "https://www.intel.com/content/www/us/en/download/776137/intel-7th-10th-gen-processor-graphics-windows.html",
                "author": "hieronymous-cowherd"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "9800X3D + 5090 build",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "looks nice! What are the colorsettings on your INF fans?",
                "author": "iibergazz_94"
            },
            {
                "raw_content": "can u pls write the whole parts?",
                "author": "ExchangePublic1560"
            },
            {
                "raw_content": "How do you like the astral? How is coil whine?",
                "author": "Celcius_87"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First build in a decade, first all AMD",
        "score": 164,
        "text_content": "Just built this rig with a 7800X3D and a XFX Speedster 7800XT running bazzite Linux. Been such a great experience. My previous machine has a Core I5-4690k and a GTX 1070 so this is a massive upgrade.",
        "comments": [
            {
                "raw_content": "Power your GPU with two separate 8-pins.",
                "author": "Major-System6752"
            },
            {
                "raw_content": "Thanks everyone for the feedback! Definitely gonna be switching to separate cables for the GPU power.",
                "author": "Reven_93"
            },
            {
                "raw_content": "Are there any intake fans?",
                "author": "Osoromnibus"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire X870EA Nitro+ motherboard with Phantom Link to adopt updated ASUS PCIe Q-Release Slim system",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The Southern state (LA) drowning in homes worth less than what their owners still owe on them",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "11.9% vs. 2.8% nationwide is insane. What are they doing in Louisiana?",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "From the article: > Louisiana is currently facing the most severe mortgage-equity crisis in the US, as the state has the highest number of 'seriously underwater' mortgages in the country, where a home's worth is less than what is owed on it. > A whopping 11.9 percent of homes in the Bayou State had seriously underwater mortgages in the third quarter of 2025, up from 10.5 percent a year earlier, according to a report from property data provider ATTOM. > Just 2.8 of mortgages nationwide were considered seriously underwater in the third quarter. > A seriously underwater home is defined as having a loan-to-value ratio of 125 percent or above, meaning the property owner owes at least 25 percent more than the estimated market value of the home.",
                "author": "DustyCleaness"
            },
            {
                "raw_content": "The Daily Mail is a rag but it doesn't take a rocket scientist to see why LA has so many underwater mortgages. Hurricane and flood risks, low overall desirability, crap job market, high property taxes and insurance, etc.",
                "author": "fatfiremarshallbill"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Local buyer seeking off-market small multifamily in Fishtown / Port Richmond / Kensington",
        "score": 0,
        "text_content": "Hi- I’m a Philadelphia-based buyer looking for a small multifamily property (2–4 units) in Fishtown, Port Richmond, or Kensington. I’m open to off-market or pre-listing opportunities. Condition is flexible. I’m a long-term owner, not a wholesaler or flipper. If you’re a landlord considering selling, or know someone who may be, I’d welcome a low-pressure, confidential conversation. Financing is in place. Feel free to DM. Thanks.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Prepare for an awesome 2026!",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini 1.5 and o1 felt so long ago. Time doesn't feel real anymore.",
                "author": "f00gers"
            },
            {
                "raw_content": "I suspect that 2026 is going to feel the exact same as 2025 (in broad strokes) but very different at the frontier with some of these models. The time-gap is always on productization & mass adoption. Greatest arb (read: startup) opportunity in the last 20 years.",
                "author": "Manfr3dMacx"
            },
            {
                "raw_content": "I think only in March of 2025 we got the first image generator that could do text at least somewhat consistently with GPT-image o1, followed by improvements by Nanobanana Pro and then GPT Image 1.5.",
                "author": "Profanion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Products Lead Logan Hints about Embodied Ai and Robots in 2026",
        "score": 523,
        "text_content": "As 2025 year ends, **just now** Lead Product Head Logan Hints these in twitter regarding Embodied Ai and Robots in real world for 2026. **Your thoughts,guys?** **Source: Logan(in X)** 🔗: https://x.com/i/status/2002831811823763639",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/2il4ihq4em8g1.png?width=2048&format=png&auto=webp&s=d5465f3a5396298b02c27e65189773a2d4d2e884",
                "author": "challengethegods"
            },
            {
                "raw_content": "Population of US is 340,000,000. Unemployment rate is currently 4.7%. Does a lot more robots mean higher unemployment? Are the robots delivery drones? Autonomous self-driving taxis? Autonomous construction equipment? Humanoids replacing welders?",
                "author": "MechanicalDan1"
            },
            {
                "raw_content": "I think all of this is aligning nicely. We already have the hardware and software to make real world robotics work. It's all about getting the models efficient enough to run locally in a robot. I don't see why this can't be achieved very soon. Imagine Gemini/Gemma running locally on a humanoid robot with some sort of sophisticated action calling. Once that is achieved, it can be optimized for speed.",
                "author": "ZestyCheeses"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Z-Image Turbo is the new #1 open weights Text to Image model, surpassing FLUX.2 [dev], HunyuanImage 3.0 (Fal), and Qwen-Image in the Artificial Analysis Image Arena.",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this thanks to aesthetics? It is definitely not better than flux 2 dev",
                "author": "Far_Insurance4191"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's compute margin said to jump to 70%",
        "score": 154,
        "text_content": "OpenAI's compute margin, referring to the share of revenue excluding the costs of running its AI models for paying users, surged around 18 points from the end of last year to 70% in October, The Information reported on Sunday. The publication reported that the company improved its “compute margin,” an internal figure measuring the share of revenue after the costs of running models for paid users. As of October, OpenAI’s compute margins reached 70%, up from 52% at the end of 2024 and double the rate in January 2024, the publication said, citing a person familiar with the figures. Source: https://www.bloomberg.com/news/articles/2025-12-21/openai-sees-better-margins-on-business-sales-report-says?embedded-checkout=true",
        "comments": [
            {
                "raw_content": "I've been so inundated with heavily truncated y-axes from AI labs that at first I was like \"but nothing even changed?\" lmao",
                "author": "Dear-Ad-9194"
            },
            {
                "raw_content": "waiting for that comment: “openai robbing us of our subscription money when they can give us a discount now”",
                "author": "Humble_Rat_101"
            },
            {
                "raw_content": "Auto mode and slashing free limits do economic wonders",
                "author": "chlebseby"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Open-source AI Tool \"RNACOREX\" peels back the Genetic \"Black Box\" of Cancer: Matches AI-level accuracy with full interpretability",
        "score": 236,
        "text_content": "A major breakthrough was published today (Dec 21, 2025) by researchers at the University of Navarra. They have officially unveiled **RNACOREX**, a powerful open-source platform that finally brings \"Explainable AI\" to the front lines of cancer research. * **Ending the \"Black Box\":** While traditional AI models are great at predicting survival, they often can't explain *why*. RNACOREX matches the predictive power of advanced AI but provides a clear, interpretable molecular **map** of how genes communicate inside tumors. * **Massive Scale:** The tool was tested across 13 different tumor types (breast, colon, lung, etc.) using data from the International Cancer Genome Atlas (TCGA). * **Accelerating Longevity:** By identifying the hidden genetic networks that drive tumor behavior, researchers can now prioritize new biological targets for treatment much faster than before. * **Open Source for All:** The team has released the entire platform on GitHub and PyPI, allowing any lab in the world to integrate this into their workflow immediately. We are moving from \"AI as a mystery\" to **\"AI as a transparent microscope\"** for the human genome. **Sources:** https://www.sciencedaily.com/releases/2025/12/251221043216.htm **GitHub:** https://github.com/digital-medicine-research-group-UNAV/RNACOREX **PyPI:** https://pypi.org/project/RNACOREX/ **Image: from source Sciencedaily(given source)**",
        "comments": [
            {
                "raw_content": "What is AI level accuracy, because it not sounds good.",
                "author": "polawiaczperel"
            },
            {
                "raw_content": "Wow, AI level accuracy!!! Lol",
                "author": "plunki"
            },
            {
                "raw_content": "Bad title, amazing breakthrough! Peeling back the black box is so critical for this kind of work, I can't wait to see how this and studies building on it are able to achieve.",
                "author": "KalElReturns89"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "World’s first trial of lung cancer vaccine launched in UK",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like smokings back on the menu boys",
                "author": "08148694"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "If scaling LLMs won’t get us to AGI, what’s the next step?",
        "score": 59,
        "text_content": "I’m trying to understand what the next step in AI development looks like now that we’ve had a few years of rapid progress from scaling LLMs (more compute + more data + bigger models + more memory context). How do you define AGI in a practical way? What capabilities would make you say ok, this is basically AGI and what would be a clear test for it? If you think scaling stalls out, what is the main reason? Is it lack of real understanding, weak long term planning, no stable memory, no grounded experience, no ability to form goals, or something else? What do you think the next big breakthrough looks like? New architectures, better training objectives, agents that can use tools reliably, long term memory systems, world models, embodiment and robotics, hybrid symbolic methods, or a mix? When people say “AI beyond LLMs,” what do you think that actually looks like in practice? Is it still language at the center but with more modules around it, or something totally different? What are the most realistic use cases for that kind of next generation AI? What would it enable that current LLMs cannot do well, and what jobs or industries would it hit first? Also, what would change your mind either way? What result would convince you scaling is enough, or convince you it is not?",
        "comments": [
            {
                "raw_content": "They would need to propose a new architecture that can actually have memory like a human (not just based on token context window), where it can remember very long things, and instead of a time cut off (like it forgets things past 100k tokens), it forgets less important things (like humans) and preserves the more important memories as persistent That's the first big step for a real human like intelligence.",
                "author": "Maleficent_Sir_7562"
            },
            {
                "raw_content": "Most experts believe the missing piece is Continual learning. the ability of an AI model to **incrementally learn new tasks from a continuous stream of data while retaining previously acquired knowledge.**",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "AGI is simple to define but hard to test. Basically it has to be able to do every task a moderately competent teenager can do. I'd exclude physical tasks there, even though it gets sometimes fuzzy. For example it has to be able to pick up a random new game on steam and play it about as good as a teenager. I can come up with a LOT more examples but that's not the point. A lot things right now are simply not possible or very difficult with LLM's. The issue with hallucinations are way more prominent if used in real world scenarios. The issue that the systems are easily and consistently trickable (even by a dedicated ten year old) show up everywhere. You can trick a 16 year old once who's working their first job at McDonalds. Maybe twice. But if you put in an LLM and someone finds an exploit (which there are basically infinite of) you can consistently use this exploit. Ten thousand times if you want to. Until this issue is fixed and the next is found. And someone has to actively look at it and fix it. That's exactly what happened in reality. We consistently underestimate the complexity of mundane every day tasks while overestimating intellectual work. I don't like this sentiment that the average human is \"so dumb\". We are not. The amount of information we need to have to learn new things is ridiculously low. The issues even popped up with AlphaGo already, as there are very simple strategies which breaks the Ai consistently. Every ten year old can beat AlphaGo with those \"hacks\". With AlphaStar it was even more clear. Thats why they quietly buried it. And most other architectures based on any form of neural nets suffer the same issue, including LLM's. They are consistently breakable. It all comes down to continues learning with very limited data (like maybe ten sentences and a video). Context is not learning. The weights have to be adjusted somehow. That's what the big names realized sooner or later. YanLecun, Hassabis, Sudskever and so on. Scaling is not enough anymore if you don't solve continuous learning. Maybe it's just another research step, maybe needs a lot more work. Who knows? And about the tests? No idea how to test the gigantic real world application space you can teach an average 16 year old. But I think if we get to it, it will be pretty obvious that it's actually intelligent. The question is only asked if it's not obviously fluidly intelligent.",
                "author": "Quarksperre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"How Disney's DuckTales (1980s) was animated\" --- They designed the character, colors, and objects, then \"sent it overseas\" to be animated. AI will soon be doing the 'overseas' part.",
        "score": 30,
        "text_content": "A bit tangential because this clip isn't about AI, but I want to highlight that what this clip shows is that AI can bridge the gap between artists with a mega corporation behind them and independent artists on a budget. Everyone will now be able to make video of their choosing. The money advantage in art is significantly reduced.",
        "comments": [
            {
                "raw_content": "Most TV animation was done this way. Made for some funny animation when they didn’t quite get the color right in Korea.",
                "author": "limpchimpblimp"
            },
            {
                "raw_content": "They sent the frames to Taiwan to be painted frame by frame. They did this also for movies with special lights. Kind of cheap labor?",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "Kinda unrelated but I think Steven universe had a part where they went to korea and steven’s dad notices the korean animators drawing him",
                "author": "des_the_furry"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Prophecy came true",
        "score": 259,
        "text_content": "[Tweet](https://x.com/davidad/status/2002403959676317774?s=20)",
        "comments": [
            {
                "raw_content": "Will be interesting to see if this holds true as we get to multi-day, multi-week and multi-month equivalent tasks. I suppose once a model can do something that would take a human all day, that's probably the most important benchmark, since it mirrors a human's short term memory context. Multi-day, multi-week and multi-month tasks are then basically just a string of days governed by high-level goals, which on surface level doesn't seem like it raises the complexity that significantly?",
                "author": "NoCard1571"
            },
            {
                "raw_content": "Isn't 50% success and pass@2 wildly different? If i could solve half the bench, it doesn't mean I can solve the rest with more tries",
                "author": "ethereal_intellect"
            },
            {
                "raw_content": "https://preview.redd.it/la622b7sgj8g1.png?width=461&format=png&auto=webp&s=eb86df532f6cdab90addf1ac8414ab9e986be071",
                "author": "BaconSky"
            }
        ],
        "subreddit": "singularity"
    }
]