[
    {
        "post_name": "When the Left shows you their true face, you must not look away",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You cannot hate these people enough. Coexistence with these demons is impossible.",
                "author": "BigMikesSwingingCock"
            },
            {
                "raw_content": "These same people were crying their asses off about George Floyd. Maybe we should start rubbing George Floyd's death in their faces and see how they like it. Also rub the deaths of Jordan Neely, Joseph Rosenbaum and Anthony Huber in their faces while we're at it.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Sick, sick, sick. What do we do with rabid dogs?",
                "author": "GoldwaterVoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Four More Days To SNAPAGEDDON",
        "score": 518,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SNAP is part of what keeps food prices high.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "No, Walmart gets 25% of SNAP spending but that isn't 25% of Walmart revenue",
                "author": "ShadowInv"
            },
            {
                "raw_content": "&#65038; More like Walrusmart. &#65038; &#8199;&#8195; &#8199; &#8199; Or Whalemart. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Flight out of Chicago forced to make EMERGENCY LANDING after an Indian National on an expired Biden \"student visa\" ST-ABS 2 TEENS with a metal fork and then slaps a flight attendant. One teen was stabbed in the head, other in shoulder.",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send these inbred demons back to india. None of them belong here.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "GET THEM ALL OUT, WHY ARE THEY STILL HERE??",
                "author": "MakeCaliforniaRED"
            },
            {
                "raw_content": "They use forks as weapons and not as utensils.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keep the shutdown going just to see what America looks like without an entire social class of leeches",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's hilarious is how cheap good food is. A little rice, a few vegetables, and a bag of potatoes, and you can eat like a king for a few dollars per day.",
                "author": "BeauHD"
            },
            {
                "raw_content": "If you know someone who genuinely depends on it (older folks, actually disabled, etc), this is the time to bring them a homemade meal. Good neighbors will appreciate the kindness.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "It will be called the great chimp out, or nothing will happen. I'm fine with either of those things.",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wikipedia vs. Grokipedia Wikipedia smears RFK Jr as a “conspiracy theorist and anti-vaccine activist” in the first sentence, while Grokipedia sticks to the facts.",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Left including Feminazis announced their plans years ago to capture wikipedia, and they succeeded.",
                "author": "SenorTrumper"
            },
            {
                "raw_content": "Sold.",
                "author": "Kricket"
            },
            {
                "raw_content": "Wikipedia has been Wokepedia for a long ass time",
                "author": "NerdRage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Updated",
        "score": 973,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's crazy how we just shrug our shoulders at 9/11 now. This year's anniversary felt like such a \"going through the motions\" deal rather than really honoring the dead. It will get much worse as the years go by and eventually be as forgotten as the fall of the Berlin Wall and end of the USSR. I think WWII will be forgotten and end up with no commemoration as soon as all WWII veterans are dead. The final U.S. WWI veteran died in 2011 and Congress refused to give that hero a Capitol Rotunda lying in state and state funeral. I predict in the 2040s there will be barely any more commemorations of WWII and zero state funeral for the final WWII veteran who passes away.",
                "author": "possibletower"
            },
            {
                "raw_content": "Muslims are the scum of the earth.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "It's never too late to deport them all, is it.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Star-Spangled Banner played in honor of President Trump at the Akasaka Palace in Japan",
        "score": 971,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WE ARE SO LUCKY KAMALA ISNT PRESIDENT RIGHT NOW",
                "author": "CantStumpIWin"
            },
            {
                "raw_content": "Obama bows Trump gets our national anthem played in their country",
                "author": "Politoed"
            },
            {
                "raw_content": "The Prez snapped his down salute like a regular!!!!",
                "author": "GoDonald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohran Mamdani branded a 'despicable liar' over false claim his Muslim aunt was too scared to take the subway after 9/11",
        "score": 1389,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just practicing Taqiyya, something every devout Muslim does to get in power. Lying is literary part of their culture, and is encouraged. https://patriots.win/p/1AR0nd7AA4/30-of-all-somali-mothers-in-minn/c Because of them and their non stop theft, my state is broke. https://patriots.win/p/1AR0UrJFEW/minnesota-is-drowning-in-fraud-i/c",
                "author": "MissingTrump"
            },
            {
                "raw_content": "His only living aunt was living in TANZANIA during the attacks 9/11 on the World Trade Center ...",
                "author": "Toobigtorig1234"
            },
            {
                "raw_content": "If you truly are part of a persecuted ethnic group, why would you need to make up a story?",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is they",
        "score": 813,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what happens when kids fail english class, but their teachers keep passing them because giving them a failing grade would be racist",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "I'm being perfectly honest. We need to demand reparations from the black community and Democrats. They've been stealing our money for 70 years. I've never lived during even Jim Crow. It's not my responsibility to help people 3 generations later. I wrote in to my local paper in 2020 about the debate over reparations. I said I support black people paying reparations and the newspaper refused to run my editorial lol.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "Is ThEy WuZ KaNgS?",
                "author": "vsekvsek"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Man arrested for posting TikTok murder-for-hire threat against Pam Bondi, FBI says",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why go after Queen Puff-Puff who won't arrest a single democrat in her four year tenure? Democrats should be paying her salary at this point, because she ain't on our side.",
                "author": "MythArcana"
            },
            {
                "raw_content": "This is likely the only thing Pam didn't let pile up on her desk before rushing off to appear on Fox News.",
                "author": "MoldyLocksNesMonste"
            },
            {
                "raw_content": "False flag BS to make do-nothing Bondi look good to conservatives.",
                "author": "scrubking"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WAPO EDITORIAL BOARD: In Defense Of The White House Ballroom",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# THE WASHINGTON COMPOST **The Toilet Paper of Record**",
                "author": "BeauHD"
            },
            {
                "raw_content": "Considering Amazon is one of the companies that donated to build the ballroom, not surprising.",
                "author": "MisterGuapo"
            },
            {
                "raw_content": "They've been making VIPs use porta-potties? They should have taken Trump's offer to build it years ago, back when he offered it to them for free, and maybe they would have had more input on it's design. But now, Trump gets to do it his way. It will be glorious.",
                "author": "OnlyTrump20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Boomers, Gen Xers dominate NYC’s early voting tallies — why that could be a bad sign for Zohran Mamdani",
        "score": 1063,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How? Their vote will be split between Cuomo and Sliwa.",
                "author": "ramennov"
            },
            {
                "raw_content": "Nah...the rig is on",
                "author": "Mega_MAGA"
            },
            {
                "raw_content": "I don’t know. When I talk to other Gen Xers it seems like their mind has been taken over by cuckholded submissive blind obedience to metropolitan political correctness. I love honest debate and defending controversial ideas, but my neighbors are just terrified or totally programmed to recite the Democrat dogma.",
                "author": "RiffFantastic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Saaarrrrr",
        "score": 1122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He had the needful saar.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "TFW you wash your truck more than you wash yourself...",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "“DID YOU TRY UNPLUGGING IT AND PLUGGING IT BACK IN, SAARRRR!”",
                "author": "UncleTrumpsBand"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 BREAKING: Bionca Ellis sentenced to life without parole for the 2024 fatal stabbing of 3-year-old Julian Wood at a grocery store in Cleveland",
        "score": 1610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This happened before I had my first child. Now that I have my son all I can think about is this story. All the time. Keep your head on a swivel no matter what. Demons are lurking and waiting….",
                "author": "SGT_Glowie"
            },
            {
                "raw_content": "The state should kill her. Now we have to waste valuable judge time, and everyone’s down the line too to pay for her mischievous life in prison.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "I know I'm supposed to believe they can still be saved, but really want to see the Final Judgement phase timeline reduced significantly. Today wouldn't be soon enough for me.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bruce Springsteen Biopic Flops Like Dead Fish at Box Office",
        "score": 1062,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bruce who?",
                "author": "Mega_MAGA"
            },
            {
                "raw_content": "Bruce is GAAAAEEEEEE!",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "All the way back to my childhood, I would lunge at the knobs on the radio desperately trying to get this jackass out of my ears. Every year that stupid Santa Claus song would play all day, and I finally stopped listening to radio since there are no metal stations to enjoy.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A student government body at Loyola University New Orleans has denied a newly-formed chapter of Turning Point USA the ability to become an official student organization on campus.",
        "score": 1335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok, unofficial club it is then.",
                "author": "Slugbert"
            },
            {
                "raw_content": "95% of the time your “student government” on college campus is going to be a leftist cesspool. The “left of liberal” types. There was an issue not too long ago where far left activists took over the University of Michigan student government and basically tried to divert the budget towards Palestinian (terrorist) causes",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "SUe them",
                "author": "highenergywinning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Describes The Back-to-Back U.S. Navy Aircraft Crashes in The South China Sea As “Very Unusual”",
        "score": 914,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; # We can't round up and deport the 250,000 CCP \"students\"/industrial spies and boot them out of here fast enough. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "4 crashes all from the Nimitz....tainted fuel supply.",
                "author": "jimbobsmith"
            },
            {
                "raw_content": "Tainted fuel from third world countries.",
                "author": "DManthey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Utah judge allows Charlie Kirk murder suspect Tyler Robinson to wear civilian clothes, bans cameras from filming his entrances, exits",
        "score": 1190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another useless faggot judge injecting his politics by showing favoritism",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "He should wear a kitty costume like his furry boy toy.",
                "author": "Bullwinkle"
            },
            {
                "raw_content": "I think that’s pretty standard for cases like this these days.",
                "author": "delnaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ALWAYS... GOVERNMENT OF THE PEOPLE. PAID FOR BY THE PEOPLE. IN SPITE OF THE PEOPLE.",
        "score": 1174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Life will be fairer when the tax rate is 0%. Everyone should keep only what they earn, and nothing that somebody else earned. Charity should be encouraged, but not mandated.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "Love Mr. Sowell",
                "author": "GhostOfTheRepublic"
            },
            {
                "raw_content": "I hope PDJT will consider Dr. Sowell, our national treasure, for a Presidential Freedom Award.",
                "author": "Tacitus1963"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REEEE WTF?! I’d like to have a word with your MANAGER!!!",
        "score": 1541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> There is no way of influencing men so powerfully as by means of the women. These should therefore be our chief study; we should insinuate ourselves into their good opinion, give them hints of emancipation from the tyranny of public opinion, and of standing up for themselves; it will be an immense relief to their enslaved minds to be freed from any one bond of restraint, and it will fire them the more, and cause them to work for us with zeal, without knowing that they do so; for they will only be indulging their own desire of personal admiration. Adam Weishaupt, Founder of the Illuminati",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "I have a theory that a lot of our Victorian era classics were written by their equivalent version of incels. Those least experienced with women. If you’ve ever dated a lot of women you start to realize a ton of them lack for all agency and need a man in their lives to make basic life decisions and plan beyond immediate gratification.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Always remember this. It applies to every ideology, including MAGA as well.",
                "author": "FatigueIsReal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD again reshuffles mobile lineup with Ryzen 10 (Zen2) and Ryzen 100 (Zen3+) series rebrands - VideoCardz.com",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is getting tiring. Just how many Mendocino has AMD made and still have in stock.",
                "author": "zerinho6"
            },
            {
                "raw_content": "Oooof those Zen 2 chips only have 4mb of L3 cache.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "It's so on brand for AMD to come up with a new naming scheme and already be halfway through the names. When Zen 6 comes out it will be Ryzen 4xx. Why even rename the old generations, you are only making it more confusing for general public. It's not like all the text/video reviews, articles, and promotional material are all going to change to reflect the name change.",
                "author": "jeffy303"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This M.2 SSD Can Self-Destruct By Giving Itself a Burst of Voltage: Team Group P250-M80",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The best target for anarchist malware writers since the infamous CIH virus of the 90s ;)",
                "author": "Proglamer"
            },
            {
                "raw_content": "Curious to see testing on this",
                "author": "Slasher1738"
            },
            {
                "raw_content": "I see this as a gimmick, given the [built-in zeroization features of many modern storage devices](https://www.reddit.com/r/sysadmin/comments/1bq5z5i/deleted_by_user/kx0j95j/). But worth a post anyway, since it doesn't seem to have been noted here in /r/hardware.",
                "author": "pdp10"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Unveils AI200 and AI250—Redefining Rack-Scale Data Center Inference Performance for the AI Era | Qualcomm",
        "score": 12,
        "text_content": "Qualcomm Announces their Datacenter CPU+Hexagon chips for rack inference focusing on token/W",
        "comments": [
            {
                "raw_content": "Without excellent software support, this is unlikely to get any traction...The problem is not hardware but software...Look at how Gaudi was received by the market ...",
                "author": "Substantial-Soft-515"
            },
            {
                "raw_content": "These are why the ram price has doubled.",
                "author": "max1001"
            },
            {
                "raw_content": "Wow! Qualcomm is joining the race.",
                "author": "i_shit_not"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive-US Department of Energy forms $1 billion supercomputer and AI partnership with AMD",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The partnership is actually about *two* supercomputers, of which one will come online rather shortly. Article is soft-paywalled, so … The first is the **LUX**-Supercomputer of AMD, co-developed by Hewlett Packard Enterprise (HPE) and Oracle, to be likely located at the *Oak Ridge National Laboratory* (ORNL); * Based upon likely some yet unknown AMD Eypc and their Radeon Instinct MI355X-accelerators, including AMD's self-sourced network-hardware (Pesanto/Xillinx?), which is a first here and a major blow to HPE, for AMD sourcing their own network-stuff (cf. nVidia and Mellanox). * Scheduled to come online in about 6 months (sic!), so they've already been working on it. **Edit:** The second ~~yet unnamed~~ AMD-supercomputer ***DISCOVERY*** is also co-developed with Hewlett Packard Enterprise (HPE) and the Oak Ridge National Laboratory, yet not Oracle, to be housed there likely as well; * Also fully AMD-based upon ~~likely some yet unknown~~ *upcoming* AMD Eypc *Venice* and a custom-tailored version of Radeon Instinct MI430*X*-accelerators for the DoE — ~~The article does neither state the second system to also have AMD-sourced network-hardware (Pensando/Xilinx) or if HPE covers for that (Slingshot?)~~. The respective [NextPlatform](https://www.nextplatform.com/2025/10/27/oak-ridge-discovery-supercomputer-spearheads-new-hpe-cray-gx5000-design/)-article states, #2 will be using HPE's next-generation SlingShot-network (Thx to u/wideruled for the note here!). * Scheduled to be installation-completed by 2028 and to come online in 2029. Original-source is the Reuters.com-article. [Archive.is-Link](https://archive.is/deJ0s). ---- The major Oracle-deal of AMD recently was likely having something to do with the first LUX …",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "Also, depending on how massive and performant AMD's own network-equipment turns out, this will enable AMD to basically fully source a supercomputer *on their own* from top to bottom, especially with their recent acquisition of server-hardware vendor *ZT&nbsp;Systems* — AMD to become a full-grown HPC-vendor with Epyc-CPUs, Radeon Instinct-accelerators, their Pensando/Xilinx (Thx /u/uncertainlyso) network-hardware and the server-housing rack-hardware also sourced in-house by their server-hardware specialist ZT&nbsp;Systems. To be a one-stop shop for supercomputers, that's something neither Intel can offer (no existing AI-/HPC-accelerators nor real datacenter-networks and neither anything supercomputer-class on graphics) nor nVidia can (yet; Only ARM-based using Grace and mighty Mellanox-network). This is a massive and very business-competence instilling move by AMD's leadership here.",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "Very interesting cost and work share > **The Department of Energy will host the computers, the companies will provide the machines and capital spending, and both sides will share the computing power, a DOE official said.** > The two supercomputers based on AMD chips are intended to be the first of many of these types of partnerships with private industry and DOE labs across the country, the official said.",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Can Silicon Photonics Surpass 400 Gbps in Data Centers?",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That would bring top of the line numbers for 8 channel transceivers up to 3.5Tb/s from today's 1.6T. People are sleeping pretty hard on the ongoing photonic|fiber revolution. The industry has a lot of experience and scale with fiber today. Copper continues to hit hard walls which we can not overcome economically. This is fundamental to the the physics of copper so there is no exotic solution to this problem. This has been the story of fiber since the beginning when we realized we could not economically scale copper data lines for transoceanic internet cables. Industry was forced to move to fiber. It is happening today. HDMI2.2 introduces active cable as part of the official spec, meaning for the first time HDMI will be a hybrid fiber/copper spec. This is forced, because we can not reasonably do 100G+ at 6' and more with copper, but we want more than 6' for cables. It will continue to happen if we want to push data speeds beyond were we are today.",
                "author": "1TillMidNight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Level1Techs] Radeon AI Pro R9700 Dual GPU First Look — AI/vLLM plus creative tests with Nuke & the Adobe Suite",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those Blender results are confusing. Did they leave it on CPU rendering? Did they use HIP-RT, Optix? There's no way the R9700 is putting out the same numbers as the 5090. The Blender benchmark results list an average score for R9700 at \\~3k, but \\~15k for the 5090. Something is way off here.",
                "author": "CatalyticDragon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon AI PRO R9700 Linux Performance For Single & Dual GPU Benchmarks",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent and trouble-free performance with open source drivers, as we've come to expect from AMD. Other vendors remain non-options when it comes to an open source stack.",
                "author": "3G6A5W338E"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fungal networks may be a promising alternative to tiny metal devices used in processing and storing digital memories and other computer data, according to a new study.",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most surprising thing is perhaps that it's been done before. This research simply pushes the limits of some earlier ideas. This sentence deserves its place in the annals of r/hardware: >However, performance dropped as the frequency of the electrical voltages increased, but much like an actual brain, it could be fixed by connecting more mushrooms to the circuit.",
                "author": "mycorrhizalnetwork"
            },
            {
                "raw_content": ">\"Being able to develop microchips that mimic actual neural activity means you don't need a lot of power for standby or when the machine isn't being used,” said John LaRocco, lead author of the study and a research scientist in psychiatry at Ohio State’s College of Medicine. “That's something that can be a huge potential computational and economic advantage.”",
                "author": "Vb_33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] From Thermaltake to ThermalFAKE... and back again",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A few times he stated the top IO on the towers made it difficult to use. I have a Tower 100 and it has the best IO access of any case I have used, particularly when it is setting in a room corner on a desk. In fact, it would be hard for me to go back to any case that doesn't have the option for top IO. EDIT: By top IO I mean motherboard IO panel.",
                "author": "TDYDave2"
            },
            {
                "raw_content": "I have a CTE E550 TG in sand colour and super happy with it, it has two GPU's in it and can even fit a third one using the bracket that comes with it. I find the top access to the motherboard and GPU backs to be a godsend no fishing behind it just pop the top panel and its all there, I have the case on the floor so that probably helps me there. This is my forever case, I see all my future builds in it for a good number of years.",
                "author": "Plank_With_A_Nail_In"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Damn, this is getting ridiculous lol",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To make it funnier Sakurai is not even *at* Nintendo. He's not a Nintendo worker. Essentially a contractor with a great relationship with Nintendo.",
                "author": "suentendo"
            },
            {
                "raw_content": "Sakurai never worked at Nintendo, and he left HAL 22 years ago, but Youtube thrives on clickbait.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "What do Nintendo YouTuber have against Miyamoto what did he do?",
                "author": "Malnuq"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk is still the best looking switch 2 game, change my mind",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As someone who has played 100 hours of Cyberpunk on switch 2, it could be the final fantasy 7 remake trilogy as its coming along",
                "author": "EnigmaRainSky"
            },
            {
                "raw_content": "I’m seriously considering starting to buy 3rd party games on switch 2, I did buy everything else on deck but these ports have been amazing on switch.",
                "author": "Lupinthrope"
            },
            {
                "raw_content": "sorry it’s pokemon za",
                "author": "Promen-ade"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Don't think I've ever bought four games in one night before.",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I stopped playing Borderlands 4 because I was too excited to try out Hades 2, which I stopped playing because I was too excited to try Yotei, which I stopped playing because I got sucked into Ball x Pit. I'm forcing myself to finish these 4 before I buy anything else. I swear!",
                "author": "Sad-Marionberry6558"
            },
            {
                "raw_content": "I've also noticed I buy way more games for my switch then I do on PC.",
                "author": "zarif2003"
            },
            {
                "raw_content": "Two Point Museum and Ball X Pit Switch 2 version out tomorrow. Cyberpunk on sale for $40 Hades II because it looks good af",
                "author": "sirms"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So... youtube when?",
        "score": 2809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just the other day [they said](https://x.com/TeamYouTube/status/1982108195817394325) \"we hope to be offering it soon\"...what \"soon\" means is anybody's guess!",
                "author": "DaveLambert"
            },
            {
                "raw_content": "give me netflix and youtube on my switch 2 man wtf",
                "author": "ketketkt"
            },
            {
                "raw_content": "My most played \"game\" On the switch lol",
                "author": "Icy_Ad620"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wait, what?",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That game better be the highest quality masterpiece I've ever seen once it comes out.",
                "author": "Sneaky-Boi22"
            },
            {
                "raw_content": "They said October, but never said what year",
                "author": "wewewi"
            },
            {
                "raw_content": "They heard it was delayed and used a default date I assume",
                "author": "marsgreekgod"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Friendly reminder of all the available Switch 2 demos",
        "score": 553,
        "text_content": "I was (happily) surprised to see some of these having demos",
        "comments": [
            {
                "raw_content": "Just a little disclaimer: the Trails in The Sky and Romancing Saga 2 demos are actually Switch 1 demos so you won't be able see how the upgraded versions look until you buy them. Still better than nothing.",
                "author": "yripdo"
            },
            {
                "raw_content": "Ok thank you. I wasn't aware that TITS had a demo and I'm curious about this game.",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "WAIT, THERE’S A DK DEMO?! SINCE WHEN?!?",
                "author": "Simplejack615"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Apparently a hot take on this sub but It’s a shame we have this beautiful 1080p 8inch screen with nothing to watch on it.",
        "score": 49,
        "text_content": "It would be great for hotels. I know YouTube is supposedly coming but I want everything. Give me Netflix, Hulu (Disney +?) I’ll even take espn. Also please YouTube TV. If anyone at these companies see this just know we are waiting.",
        "comments": [
            {
                "raw_content": "I miss Hulu 😭",
                "author": "bigskinnybubba123"
            },
            {
                "raw_content": "I have no idea why they don’t bring more streaming to it. And I’d love Spotify like the other consoles to have music while I game. People are going to make excuses for why Nintendo can have what everyone else does. Let’s not do the defend the multibillion dollar corporation meme.",
                "author": "terran1212"
            },
            {
                "raw_content": "I loved using YouTube on my OLED switch and I have android tablets that are much better for it but still, YouTube has Movies and TV for free and purchase, Music, and of course regular YouTube as well.",
                "author": "NintendoSense"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends Z-A, and how lessons were learned from Scarlet and Violet",
        "score": 171,
        "text_content": "I went into Legends Z-A with trepidation, given the technical issues presented by Scarlet and Violet but ended up pleasantly surprised by how Game Freak has rectified many of them. Here are the biggest ones which have been addressed, and deserve praise where it's due: **Game released fully featured:** The Switch 2 version shipped with version 1.01 already installed on the game card, suggesting the game was ready to go in a polished state. There is a small patch for the Switch 1 version which enables online play, but this is far as as you can get from Scarlet and Violet's rocky launch. **Choppy animation resolved:** In Scarlet and Violet the decimated animation was an eyesore. While games like Kirby and the Forgotten Land also utilise it, outside of a few egregious instances it is no where as noticeable as it was in Scarlet and Violet. Luckily **Draw distance surprisingly good:** In the [Switch 1 handheld footage](https://streamable.com/3krq4o) here, even distant NPC rendering is much better than I expected with simulated crowds in the far distance animating at full rate. **Scope reigned in, for the better:** A lot has been made to highlight how it only takes 7 minutes to run around the circumference of Lumious City. But that misses the point - somehow it took me 35 hours until the credits rolled. Legends Z-A instead focuses more on density over scale - there are hundreds of NPCs with unique dialogue (addressing an issue in previous Pokemon games where NPC dialogue in towns became at a premium), there are hidden discoveries to find, rooftops to scale, battle zones to strategize in. While I'd love there to be more indoor dungeons, the game also doesn't feel half-baked because the scope was reigned in to an appropriate level. **The lighting artists did a great job.** This is particularly true in interior locations like the hotel, restaurants, and story locations that I wouldn't want to spoil. But even outdoors they've made sure that almost every material has a fitting shader applied to it, making the game look a lot less flat than I was anticipating. **Framerate is solid.** [As depicted by Kimagre gaming](https://youtu.be/AYbcLElWhss), even Switch 1 sees a dramatic improvement here. **Resolution is prioritized over raw detail.** It's surprising how close the game sticks to native resolution in handheld mode and docked modes on Switch 1. It could go far lower in exchange for more environmental detail - similar to Xenoblades 2 and 3 - but I think the focus on readability works in the game's favor too. Given how much time you spend on rooftops hunting for Pokemon and other items, being able to clearly see into the distance has its benefits. On Switch 2, DLSS \"Lite\" makes this even better. *Of course, there's still plenty of room for improvement.* Game Freak should have been invested in voice acting for the small handful of full-on cinematics. And an extra level of detail should have really been made for those windows - only the entrances to key buildings have been fully rendered. But it's a significant improvement beyond Scarlet and Violet. With Game Freak allegedly dropping Switch 1 for the gen 10 games, there's much to look forward to.",
        "comments": [
            {
                "raw_content": "Legends ZA is a good game. But it is a weird game with room for improvement. Imo it is very much a game that you will never understand without *actually playing it for a couple hours*. Not that it's some enigmatic achievement. It's just kind of its own thing.",
                "author": "Metallovingent"
            },
            {
                "raw_content": "Only things I think they could’ve done better is voice acting, and more textures for the buildings. Oh, and being able to go into shops. Since this took 2 years, I admit that this would’ve been what happened, since they can usually do stuff like this in 1 year. Overall, I would give this an 8/10. (SV is like a 4/10 for me)",
                "author": "BoughtSquash665"
            },
            {
                "raw_content": "The game is a lot of fun, and a huge improvement over SV which I did also have fun with in spite of their flaws.",
                "author": "SurroundedByGnomes"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hideo Kojima reportedly had strong interest in making a Matrix game adaptation after the Wachowskis asked him to, but Konami said no.",
        "score": 1205,
        "text_content": "[https://www.timeextension.com/news/2025/10/they-were-big-fans-of-kojima-the-wachowskis-once-asked-the-metal-gear-creator-to-make-a-matrix-video-game](https://www.timeextension.com/news/2025/10/they-were-big-fans-of-kojima-the-wachowskis-once-asked-the-metal-gear-creator-to-make-a-matrix-video-game) TimeExtension: \"The two of them (Wachowskis) came in with their concept artist, and effectively they said to Kojima, ‘We really want you to do the Matrix game. Can you do that?’ Aki translated this into Japanese for Mr. Kitaue, and Kitaue just looked at them and told them plainly, ‘No’. We did still get to enjoy the Matrix Japanese premiere and afterparty, though.\" **However, speaking to another former Konami employee, who wished to remain anonymous, they suggested the story isn't entirely accurate, stating that Kojima had continued to \"show strong interest\" in a Matrix game after Kitaue's comment and revealing that there was \"immense disappointment\" among members of the team that the creators didn't end up collaborating on a project together.**",
        "comments": [
            {
                "raw_content": "The cutscenes alone could have made 3 more movies. We were robbed.",
                "author": "the7egend"
            },
            {
                "raw_content": "Oh, so Konami hates ideas and good money I guess…",
                "author": "Bumblebee2455"
            },
            {
                "raw_content": "\"Konami said no\" really says *a lot* about their business model before they gave Kojima the boot.",
                "author": "scott1swann"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Jez Corden] Microsoft's ambitious new Xbox: Your entire Xbox console library, the full power of Windows PC gaming, and no multiplayer paywall",
        "score": 976,
        "text_content": "https://www.windowscentral.com/gaming/xbox/microsofts-ambitious-new-xbox-your-entire-console-library-the-full-power-of-windows-pc-gaming-and-more",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This is actually a very complicated scheme to bring Lost Odyssey on PC.",
                "author": "Lz537"
            },
            {
                "raw_content": "So just a PC with Xbox brand. Got it",
                "author": "Ielsoehasrearlyndd78"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft to host Xbox Partner Preview event sometime in November",
        "score": 280,
        "text_content": "This is according to Jez Corden, who claims that the event will primarily feature Xbox Play Anywhere games from third-party developers. Worth noting that Partner Preview do not contain first-party games, and the last one of these events was held in October 2024. Jez also claims that Xbox will have a presence at The Game Awards in December, and that they'll host a Developer Direct in January, as usual. https://www.windowscentral.com/gaming/xbox/xbox-has-a-partner-preview-event-slated-for-november-with-xbox-play-anywhere-as-the-headline-act",
        "comments": [
            {
                "raw_content": "If Play Anywhere is effectively superseding Game Pass as \"the point\" of Xbox they really need to crack down on actually ensuring that program support is not just widespread, but consistent. Square Enix has the Final Fantasy Pixel Remasters, Legend of Mana remaster, Trials of Mana and games like FFXVI and VII Remake as Play Anywhere, but they just dropped Final Fantasy Tactics and not only is that not XPA, it didn't even get a release on the Windows Store/Xbox PC launcher at all. Sega was typically almost expected to have XPA support for their tentpole game releases, but after like every Yakuza game got such support, suddenly Pirate Yakuza and Kiwami 3 are dropping it This whole Xbox/PC hybrid thing and integration with the ROG is obviously indicative of Microsoft's plan for a more ubiquitous ecosystem but it certainly doesn't just work to the extent I'd hinge a whole branding image around it yet",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Xbox as a hardware brand is in the gutter for me but I’d be lying if I didn’t say they have a portfolio of games that I’m looking forward to. Fable, Gears, Forza Horizon 6 etc. give me a lot to look forward to in 2026 Hopefully can see some of that in January",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "TGA and/or Dev Direct better have Fable. If they cancel that game I will lose it",
                "author": "drumjolter01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MySims Cozy Collection is coming to PS5 and Xbox Series on November 18",
        "score": 188,
        "text_content": "Source for this is Dealabs/billbil_kun. This is the first time that these games have ever been available on a PlayStation or Xbox console btw. https://www.dealabs.com/magazine/mysims-cozy-bundle-arrive-enfin-sur-playstation-et-xbox-on-vous-devoile-sa-date-de-sortie-60696",
        "comments": [
            {
                "raw_content": "Wait, the Wii ones? Holy shit!",
                "author": "FlyFight2Win"
            },
            {
                "raw_content": "Are these the ones you could play on Wii? I remember having fun with those, tried them after seeing them at the library",
                "author": "shadowlarvitar"
            },
            {
                "raw_content": "I loved MySims, I hope they release the other games.",
                "author": "Tideripper98"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon NDA Technical Test Pastebin Leak (Unreliable)",
        "score": 116,
        "text_content": "[Bungo Deets (real and true) - Pastebin.com](https://pastebin.com/Zcpg8wvm)",
        "comments": [
            {
                "raw_content": "I may or may not have access to the test and this may be true or may not... (It is) Edit: Also they didn't talk about in my opinion the best thing about this game yet.",
                "author": "JRedCXI"
            },
            {
                "raw_content": "A Runner only available for solo’s is interesting. Overall from what I’ve seen people *generally* seem quite a bit more positive than the last test so we’ll see I guess. The marathon ship is what I want to see the most, especially since the interiors are by far the coolest environments in the game imo.",
                "author": "Gen6V"
            },
            {
                "raw_content": "I can already see the negative comments coming in, but having played both this test and arcs server slam, I also prefer this and will be playing it upon release. This test has hooked me unexpectedly.",
                "author": "nowhereright"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dealabs: Stray is the headliner of November's PS Plus lineup",
        "score": 279,
        "text_content": "https://www.dealabs.com/magazine/ps-plus-essential-on-connait-le-titre-phare-des-jeux-mensuels-de-novembre-2025-60690",
        "comments": [
            {
                "raw_content": "It's time for Stray 2 now.",
                "author": "DerLetzteVlad"
            },
            {
                "raw_content": "Already got the platinum when it was on PS+ Extra but I hope this is in preparation for a sequel announcement soon.",
                "author": "ZXXII"
            },
            {
                "raw_content": "I hope that it's not really the main game of the three monthly titles. We're due for a more lacking month after Alan Wake II though, I suppose.",
                "author": "TheCaffeineWriter"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked footage of the Marathon Closed Technical Test",
        "score": 127,
        "text_content": "https://filebin.net/tzxf56bav62ozsek",
        "comments": [
            {
                "raw_content": "lol. if you care to break NDA, at least post some substantial gameplay. Not clips consisting of few seconds of gameplay...",
                "author": "markusfenix75"
            },
            {
                "raw_content": "The file has been requested too many times.",
                "author": "Koopk1"
            },
            {
                "raw_content": "Such random clips, it’s hard to take anything from them really lol. People have been more positive with this test than the previous one from what I’ve seen so we’ll see I guess. I will say the interiors look cool, which makes me really want to see that ship map that’s been hinted at so much.",
                "author": "Gen6V"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD again reshuffles mobile lineup with Ryzen 10 (Zen2) and Ryzen 100 (Zen3+) series rebrands",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so brain dead. 😵",
                "author": "burninator34"
            },
            {
                "raw_content": "The Ryzen 30 is wild. I get that AMD shuffling the names every year (7000 & 8000 series in 2023-2024 where the 3rd digit indicated the architecture, 7520U was Zen 2 from 2019 -> Ryzen AI Pro Max 395+ bullshit where there's 3 words that mean absolutely nothing -> Ryzen 30, Ryzen 40, Ryzen 170, Ryzen 110) is \\*\\*meant\\*\\* to confuse consumers, but... Well... Not really much more to say, is there?",
                "author": "DiatomicCanadian"
            },
            {
                "raw_content": "I don't even know what is what anymore. Maybe this is exactly what they want. Maybe they have such an overabundance of Zen 2 and 3 supply that they don't know what to do with them. Maybe this is their way to get rid of all that without them coming off as outdated. It's purposefully confusing and misleading. I don't like it.",
                "author": "HyruleanKnight37"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock launches Radeon RX 9060 XT Challenger Standard Edition with lower clocks",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Warren Buffett's Berkshire Hathaway and Zillow say mortgage rates can't fall enough for Americans to afford a home | Fortune",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, prices plus interests are disconnected from the average buyer",
                "author": "Gooderesterest"
            },
            {
                "raw_content": "I wouldn’t mind a 6.5% rate if a pile of trash wasn’t 500k",
                "author": "moldy_cheez_it"
            },
            {
                "raw_content": "When the median home price is 8x the median wage, it doesnt matter what the interest rate is, the home price is unaffordable. Soon they will start approving 40-50yr mortgages to pretend its affordable because \"the monthly payment is only 60% of your income, totally affordable!\"",
                "author": "Hot_Ambition_6457"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Amazon targets as many as 30,000 corporate job cuts: Reuters, citing sources",
        "score": 241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A few months earlier: \"We need you all to sign expensive leases to live closer to work. Everyone goes back to the office.\" Now: \"You're all fired.\"",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "Amazon is planning to cut as many as 30,000 corporate jobs beginning Tuesday, as the company works to pare expenses and compensate for overhiring during the peak demand of the pandemic, three people familiar with the matter told Reuters. The figure represents a small percentage of Amazon’s 1.55 million total employees, but nearly 10% of the company’s roughly 350,000 corporate employees. This would represent the largest job cut at Amazon since around 27,000 jobs were eliminated starting in late 2022. ---------------------------------- Pretty big, high salary layoff numbers for the Seattle and Bellevue RE markets. Amazon has just under 50,000 corporate employees in Seattle and approximately 12,000 to 14,000 corporate employees in Bellevue. I see estimates of around 8,000 corporate in Virginia... total corporate numbers are estimated to be roughly 350k https://www.seattletimes.com/business/amazon-added-thousands-to-its-bellevue-offices-last-year/",
                "author": "SnortingElk"
            },
            {
                "raw_content": "This is only the beginning boyyyssss",
                "author": "Mr-cacahead"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fort Myers Housing Market PLUMMETS!",
        "score": 42,
        "text_content": "[https://www.youtube.com/watch?v=aqgMLfg\\_ISg](https://www.youtube.com/watch?v=aqgMLfg_ISg) It rambles on a bit, but the points being made are all symptomatic of what is happening. When I asked ChatGPT to create a mathematical formula to descibe what is happening in the housing market, it came up with a tongue-in-cheek answer. (S+T+U)×(P+I+D) x (G+R+2ED)= CHAOS",
        "comments": [
            {
                "raw_content": "It’s always the first market with Vegas and Phoenix as close seconds",
                "author": "ManufacturerOld3807"
            },
            {
                "raw_content": "👏👏👏👏👏👏👏",
                "author": "endofmyropeohshit"
            },
            {
                "raw_content": "Would be a better video without the AI or otherwise computer generated voice",
                "author": "sillyhobo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The First Bubble of the Mother of All Bubbles is Popping",
        "score": 230,
        "text_content": "Banks just migrated their risky loan practices to auto loans after automakers got greedy and started chasing margins after they realized people were willing to pay more during the chip shortage.",
        "comments": [
            {
                "raw_content": "So many thoughts about this. My main thought is back in the DAY, families usually had 1 nice car and one crappy/paid off car. Now I drive through my neighborhood and nearly every house has 2 brand new cars. If the average payment is $700, they're paying $1,400+ / month for car payments. That has to be a variable here.",
                "author": "macaroonzoom"
            },
            {
                "raw_content": "I mean, that might be bad and might be a bad sign. But the total amount of auto loans held is $1.6T today, and the total amount of mortgage debt back in 2008 was 10 times that.",
                "author": "Allen_Koholic"
            },
            {
                "raw_content": "Jamie Dimon doesn't realize it, but cars are just too expensive!",
                "author": "mrktcrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else having trouble selling their home?",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every home is in either a \"sought-after\" or \"highly-desirable\" neighborhood. It also has \"endless possibilities.\" I know this because I see it in 100% of listings.",
                "author": "Judge_Wapner"
            },
            {
                "raw_content": "List your house for a reasonable asking price and you might end up selling it",
                "author": "kartblanch"
            },
            {
                "raw_content": "There’s economic conditions but also the old *location, location, location* arguments. Noticed a couple weeks ago the hottest real estate markets included Cincinnati, Chicago, and (!) Detroit. There will be many good jobs turning at least some of the rust belt into the steel belt again in the US industrial midwest for “regular” homes in normal neighborhoods (luxury neighborhoods won’t be a problem regardless). Does make me wonder about how old the housing stock is and whether new dwellings, including corporate “to rent” SFH, will add to supply? Meanwhile the desert southwest is having a bit of a fit over water yet again. Namely new potable water recycling plants are getting finished but now data centers want in with their water demands (e.g. household ratepayers subsidized water recycling for … households).",
                "author": "IronyElSupremo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Cities Where Condo Prices Are Now Below their Housing Bubble Peaks 20 Years Ago",
        "score": 32,
        "text_content": "https://wolfstreet.com/2025/10/26/the-cities-where-condo-prices-are-now-below-their-housing-bubble-peaks-20-years-ago/",
        "comments": [
            {
                "raw_content": "Context is important. In Oakland, if you buy a condo in da hood; yes prices there have crashed. But if you buy a condo in a nice neighborhood, prices have increased significantly from 2006. For example, this condo: Sold 2006: $525k Sold 2025: $1.095M [https://www.redfin.com/CA/Oakland/492-Staten-Ave-94610/unit-301/home/1998850](https://www.redfin.com/CA/Oakland/492-Staten-Ave-94610/unit-301/home/1998850)",
                "author": "6360p"
            },
            {
                "raw_content": "What about total cost of ownership - is that below the bubble peak (taking into account the assessments, insurance, interest rates, and taxes). What matters to people is the amount that comes out of their pocket each month.",
                "author": "Dr_Brennan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inmobix – App inmobiliaria creada en Panamá para conectar propietarios, agentes y compradores directamente",
        "score": 0,
        "text_content": "¡Hola a todos! 👋 Acabo de lanzar la **primera versión de mi aplicación móvil: Inmobix**, desarrollada en **Panamá** y pensada para **toda Latinoamérica**. El objetivo es simple: **conectar propietarios, agentes y compradores** de forma directa, sin intermediarios ni procesos complicados. 📱 **Funciones principales:** * Publicar, vender o alquilar propiedades desde el celular. * Gestionar el estado de las propiedades (Disponible, Vendida, Alquilada). * Contacto directo por WhatsApp. * Interfaz ligera y sencilla para cualquier usuario. 💡 **Parte técnica:** * Desarrollada para Android (Flutter + Firebase). * Pensada para escalar e integrar en el futuro módulos con **IA** (como precios inteligentes o análisis de mercado). 🔍 **Busco retroalimentación sobre:** * La **experiencia de usuario (UX)**: ¿se entiende y fluye bien? * Ideas para **hacer crecer la base de usuarios** (especialmente en Latinoamérica). * Consejos sobre **modelo de negocio o monetización** a mediano plazo. 👉 Puedes verla aquí: [https://play.google.com/store/apps/details?id=com.jeremiascortes.inmobix](https://play.google.com/store/apps/details?id=com.jeremiascortes.inmobix&utm_source=chatgpt.com) Es mi **primer lanzamiento completo**, y me gustaría escuchar opiniones sinceras, críticas constructivas o ideas para seguir mejorando 💬 ¡Gracias por leer y apoyar proyectos que nacen desde Latinoamérica! 🙏",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI IPO incoming",
        "score": 156,
        "text_content": "[https://www.reuters.com/business/media-telecom/softbank-approves-remaining-225-billion-openai-investment-information-reports-2025-10-25/?ref=aisecret.us](https://www.reuters.com/business/media-telecom/softbank-approves-remaining-225-billion-openai-investment-information-reports-2025-10-25/?ref=aisecret.us)",
        "comments": [
            {
                "raw_content": "A bit late for that, now it's valued a lot already",
                "author": "adarkuccio"
            },
            {
                "raw_content": "This doesn’t mean it’s “incoming”. Just that the funding is predicated on that happening by year end.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Can we get a meme of OAI faceplanting themselves?",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "First ever PGA Tour event with autonomous robot mowers maintaining the course",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are we gonna see a humanoid hit a hole in one",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Looks like a vehicle from Dune 2000 or KKND",
                "author": "catsRfriends"
            },
            {
                "raw_content": "Goddamn, what is that comment section? I thought we wanted robots to take the monotonous manual labor and leave art to humans?",
                "author": "chaosfire235"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bernie says OpenAI should be broken up: \"AI like a meteor coming.\" ... He worries about 1) \"massive loss of jobs\" 2) what it does to us as human beings, and 3) \"Terminator scenarios\" where superintelligent AI takes over.",
        "score": 282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I agree with his assessment of risks, but I don't think openai has much monopoly power here deserving of a breakup. They have a lot of market share but very little pricing power given the number of competitors with equally good products.",
                "author": "No_Factor_2664"
            },
            {
                "raw_content": "Break up ChatGPT into what? They have only one product. And there are like 6 major competitors. That makes no sense.",
                "author": "JynsRealityIsBroken"
            },
            {
                "raw_content": "The genie is out of the bag, there is no putting it back. There is no stopping it. Even if you get companies to change their position, there are countries where this is not the case. We are in the end game now, there is no stopping and all we can do is lock in.",
                "author": "Nahthanksimfine"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How do you think people would react to the movie Transcendence if it had been released these days instead of 2014?",
        "score": 23,
        "text_content": "This question came to mind, about that 2014 film that wasn't well received by critics and the general public. It also stars Johnny Depp. It's also because of a post on the same subreddit about the film 12 years ago. But if the film had been released in 2025, how do you think people would react? Considering the things that are happening right now, I feel like people would find it plausible, and there would be a lot of debate about this topic compared to what we're currently seeing. I'd like to hear your thoughts on this matter.",
        "comments": [
            {
                "raw_content": "That used to be my favorite movie I don't know why it was so disliked.",
                "author": "BurtingOff"
            },
            {
                "raw_content": "I remember one of the main criticisms of the movie was that the intelligence explosion wasn't realistic. I thought then that it was entirely plausible, and in fact, this is what we now call the fast take off scenario. I think if the movie came out today, this particular criticism wouldn't exist.",
                "author": "pikachewww"
            },
            {
                "raw_content": "Twitter/X and Bluesky will be a war zone right now regarding discussions of this film, posts and comments in favor, but also against related to AI.",
                "author": "Isacobs_35160_LHM"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "TienKung Robot Officially Starts Work at Foton Cummins Factory",
        "score": 257,
        "text_content": "https://x.com/XRoboHub/status/1982720424581710266",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/h7bkn5ylbnxf1.png?width=400&format=png&auto=webp&s=c7621c93558ccfb27529b04ddd0f4d49d76d2385",
                "author": "terra_filius"
            },
            {
                "raw_content": "Why is the video sped up so much?",
                "author": "djaybe"
            },
            {
                "raw_content": "This seems like a job a non humanoid robot would be better suited to do.",
                "author": "Hodr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chris Simon talks about what LLMs can - and can't - do for games -- NPC dialogue, AI Dungeon Masters, and lore generation",
        "score": 199,
        "text_content": "Chris Simon is best known for calling AI a [hype-fueled dumpster fire](https://www.youtube.com/watch?v=0bF_AQvHs1M). Despite the spicy title of his talk above, his views around AI are quite nuanced. After researching the \"LLM supply chain\", including the process for how these models are trained and reinforced, he made an ethical decision to not engage with them at all – but he's still aware of the potential upsides, and charts a likely path forward after the hype bubble has died down. \"Sometimes people point out that every hype bubble we've had in the past has left behind an infrastructure layer that's served the future in a way that was not predictable,\" says Simon, speaking to [grokludo](https://grokludo.com/llms-in-games-infinite-stories-or-infinite-hype-chris-simon-grokludo-13/). As such, it's possible that smaller, highly specialized models that run on your GPU are \"a very probable outcome of this whole phase.\" One of the biggest ways some gamedevs are starting to experiment with LLMs is in story generation and dialogue. The idea here is that one could chat to an NPC indefinitely, or let a robotic Dungeon Master do all the lore work. Chris Simon says it's not so simple, and it's easier to see the problem when you analyze LLM outputs at scale. Referencing a conference organizer who saw thousands of speaking submissions, Simon says \"The creativity is not actually there. Because if you ask 2,000 people, you get 2,000 submissions. You ask the LLM 2,000 times, you get about five submissions with minor variations.\" This chat also goes into the inherent biases that the larger models have, as a result of scooping up all the text on the internet (including its rough edges), as well as all of literature before the civil rights movement. These biases will make their way into games, as game publishers outsource to enterprise AI services -- which we're already starting to see, with EA announcing its new deal with Stability AI.",
        "comments": [
            {
                "raw_content": "The issue is that he is looking at the hype bubble from game devs and thinking that is what people on the ground think, and the reason why no one has actually tried to make an AI game yet is because the technology is not there, but it is getting close. The complexity and duration of tasks that AI is able to do is increasingly getting better, especially in the first 16k context window. He is also mistaking people DREAMING with hype, pushing things to their natural conclusions and seeing what this tech can actually do. Just because a delusional CEO is pushing for it doesn't mean that people on the lower levels are not grounded. He made a lot of weird statements in this video that makes me question if he is just a doomer for the grift. He likes to just brush off 'context window' to dismantle the entire argument for LLMs in the first place, or worse, making statements that were true a year ago but are no longer true today. 'They cannot DM a DnD game' is, uhh, a big statement to make, especially since people are already making DnD campaigns with them, and have, for two years. Sure, there is issues, and it isn't perfect, but god damn, most PEOPLE without a lot of experience cannot do it. 'They are not very creative' is a true statement, but only if you don't realize that a lot of models are being trained for benchmarks and not actual real world tasks. Kimi K2 proved that LLMs can have both, with many variable ways of writing things and do good at a multitude of tasks. These things are only 10% the size of a prefrontal cortex, actually more like 1% the size if you go by the complexity of a neuron compared to a parameter. We haven't even tried scaling to the size of a tenth part of our brain. We do not know how well these things scale after 10 trillion parameters, we do not know a LOT of things about them yet. It is like looking at the first automobiles and going, 'but it doesn't go faster than me running' with a smug little shit eating grin.",
                "author": "Super_Sierra"
            },
            {
                "raw_content": ">Because if you ask 2,000 people, you get 2,000 submissions. You ask the LLM 2,000 times, you get about five submissions with minor variations.\" its not true, first of all you can prompt what llms role should be played, and 2000 people will gravitate to similar answers and few percentage of the people will give unique answers",
                "author": "Valuable_Aside_2302"
            },
            {
                "raw_content": "We already have political correctness in fantasy games. How worse can it get with llm?",
                "author": "Sherman140824"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA Research -Think Twice: Branch-and-Rethink Reasoning Reward Model",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "AnthropicAI - Advancing Claude for Financial Services (Claude for Excel & More)",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These companies seem to be accelerating their work with industry experts now. The writing is on the wall.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "nono, just focus on coding claude, you could be the greatest, you could be the best",
                "author": "Jabulon"
            }
        ],
        "subreddit": "singularity"
    }
]