[
    {
        "post_name": "Trump: President Zelenskyy of Ukraine can end the war with Russia almost immediately, if he wants to, or he can continue to fight. Remember how it started. No getting back Obama given Crimea (12 years ago, without a shot being fired!), and NO GOING INTO NATO BY UKRAINE. Some things never change!!!",
        "score": 487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I dont think Trump thinks this is the win the American people see it as. He keeps hyping this up and 9/10 people give ZERO FUCKS about this war they don't see / know anyone in it and Americans would have had to fight Russians and Ukranians if the Cold War went hot so who gives a fuck?. Meanwhile Americans can't afford a basic bitch poor mans 3 bedroom home lol... USA PROBLEMS> Slava Ukraainaina money laundrying grift",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "This post means that Trump already knows the outcome..",
                "author": "Klaus73"
            },
            {
                "raw_content": "FUCK Zelensky.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Most Consequential President in US History has Arrived",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most consequential president in history is Lincoln. He transformed a federated republic into a centralized top down nation state. Next most consequential is FDR. He twisted SCOTUS's arms and got them to reinterpret the Constitution to make the \"interstate commerce\" and \"general welfare\" clauses into blank checks for absolute fedgov power which he used to embark on the slippery slope of socialism. Third most consequential was Wilson, who started the money debasement, the income tax, and the idea the the US should constantly intervene in world politics with its military. If Trump wants to crack the top three \"most consequential\" he needs to at least undo the harmful actions of one of these three.",
                "author": "keeman"
            },
            {
                "raw_content": "Let’s withhold that designation until he ends the Federal Reserve and income taxes. Gotta give him something to work toward.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Why add him to a mountain on which there realistically isn't room to add anyone else when you *could* just give him his own monument all his own?",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump’s schedule with European leaders Monday is JAMPACKED. Another Oval Office meeting with Zelensky is set for 1:15pm ET, and a multilateral press conference with 5+ European leaders is scheduled for 3pm. Going to be a VERY interesting day! 🇺🇸",
        "score": 446,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s either going to be peace or another punch up between JD and Zelensky. Either way it’ll be a good time!",
                "author": "BarneyFrank"
            },
            {
                "raw_content": "The Italians landed earlier this evening. The Germans landed a few minutes ago.",
                "author": "Moebius"
            },
            {
                "raw_content": "The Eurotards will want to keep it going as long as the US is financing it. They all get to grift from it. Zelensky will do whatever Israel tells him to do. The Israelis have been in there since day 1 of the fighting and possibly before. Undoubtedly, they are also grifting from our tax $s in addition to what they always squeeze from us. The only possible outcome would be for 1. Putin to keep the Donbas and Luhansk majority Russian areas which have been under attack by Ukraine even before the \"special military operation.\" 2. Ukraine should never be allowed into NATO. The reason Putin went in there was because a. The US and Eurotards kept pushing the boundaries decided upon in 1991 when the USSR dissolved. The Russian Federation borders were to be respected which they haven't been since then. b. Putin knows about the CIA labs across Ukraine concocting all kinds of nefarious things. c. Also, as mentioned above, the majority Russian areas had been under attack for a long time. d. Putin also knows that the CIA controls Ukraine in addition to the Israeli connection. Zelensky is a CIA tool. e. If Putin had wanted to, he could have obliterated all of Ukraine on day 1. However, he has been very careful in how he has managed the war.",
                "author": "Tacitus1963"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pro-Merit not DEI",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats confuse DEI programs with Civil Rights laws. They also think \"Black Lives Matter\" is a grassroots slogan and not a racist scam organization.",
                "author": "DeepFrozenOcean"
            },
            {
                "raw_content": "Speaking of sports, that retard should join the Olympics with the mental Gymnastics he put on display",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "The two best players in the NBA are both White, the top draft pick this year was White too.",
                "author": "RINO_fatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If You still not convinced they hate you! Time to return the favor!",
        "score": 1549,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t forget they also tried to compel you to get an experimental vaccine while letting in millions of illegals and not requiring them to be vaccinated",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Keep in mind that American citizens were intensely pressured to take the jab, and illegals didn't even have to take it.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "The entire state of California robs from the citizens and gives to foreigners. Might as well just scrap the bear and put a giant taco on the state flag.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White liberal woman with severe TDS is purposely HOMELESS, to protest Donald Trump",
        "score": 1021,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no she is just lazy and useless",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Lol she thinks she is \"hot\". A hot mess!",
                "author": "Mamapedia"
            },
            {
                "raw_content": "For the simps, Proverbs 21:9 \"It's better to live on the edge of a roof than with a contentious woman in a large house.\"",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roblox Has Lost $12.17 Billion Dollars In Market Capitalization Since August 6th.",
        "score": 1557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would've been cheaper to deal with the pedos.",
                "author": "Farqquard"
            },
            {
                "raw_content": "I had never even heard of Roblox until I saw a post about it on here yesterday.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "Who at Roblox thought this would end well for them? That's the most baffling thing about all of this.",
                "author": "Lurker404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's very simple...",
        "score": 1554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. I was just telling my wife whats really going to fuck them over is when Trump dramatically improves DC in like a week It will show that crime ridden cities are that way simply because their leadership isn't trying. One week of trump giving a fuck and they clean up. I wouldn't be surprised if State Governor's do this with their national guards.",
                "author": "mb5231"
            },
            {
                "raw_content": "The left LOVES the idea of federalized police. LOVES it. As long as all the newly hired federal police officers are LEFTISTS and Democrat loyalist DEI hires.",
                "author": "BastardSonOfCastro"
            },
            {
                "raw_content": "I'm begging now. Do all of California, and empty out the governor's mansion while they're at it. It's time.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He sure does like himself, doesn't he? 🤣😂😇. But you know what, Mr. President? We like you too. Keep up the great work and never stop fighting for America. 🙏😇🙌👍🇺🇸✊️",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And he has every right to brag.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Surely President Trump's self-confidence is far more winning and authentic than the phony humble act put on by Jimmy Carter. Carter wore sweaters to address the public, and he would carry his own bags but only when photographers were present. Who needs more of that shit?",
                "author": "FuzzAldrin"
            },
            {
                "raw_content": "Well the prestitutes won’t toot his horn",
                "author": "Nomad899"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Low IQ Crockett tells reporter Trump should stop being Putin's hoe.",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "classless",
                "author": "T471"
            },
            {
                "raw_content": "her 15 mins of fame is almost up.",
                "author": "raid"
            },
            {
                "raw_content": "The only hoe here is Crockett, that fake ghetto bitch. She whores out her entire existence. Rich girl playing poor and dumb cause she thinks that's what her voters are.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gerrymandered New England: Despite Trump 41%, 0 Republican Districts",
        "score": 1212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you look at the federal level, it can work out in our favor. However, all those districts are screwed since they are under authoritarian communist rule. That means screwball judges, crooked black DAs, violence day and night, HUD/SNAP wasteland, and lots of illegals. Nothing blue will fix those local problems.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I wish New England was based. I would love to be a fisherman, build boats, and maybe care for a little historic lighthouse on the side.",
                "author": "OrthodoxTemplar"
            },
            {
                "raw_content": "An argument can be made that VT and (maybe) RI are fine based on percentages, but those other states, particularly CT and MA, are criminal in their lack of representation.",
                "author": "reDB2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Voters in California overwhelmingly oppose Gov Gavin Newsom's plan to gerrymander the State 64%-36%",
        "score": 1418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We shall see. We say this every \"Red Wave\", and all we get is smelly blue goo. Every single time. He wants to draw disticts starting at the border all the way up to Riverside county. That isn't a district, it's a separate state, FFS.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Newsom: \"SCREW THOSE VOTERS WE MUST PROTECT DEMOCRACY\"",
                "author": "DT170x"
            },
            {
                "raw_content": "Like their votes count.",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NOW: The National Guard presence in DC is growing A contingent is now present near the Lincoln Memorial Over 1,000 more troops are on the way, being sent by several governors",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't help but feel something else is brewing and not necessarily in a bad way.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "It's really amazing to see this country heal after all we've been thru with covid and how close we came to absolute communist rule, arresting trump etc. As shitty as things are in my personal life, this is what i live for.",
                "author": "Kumalasbreakfast99"
            },
            {
                "raw_content": "I hate that I have to cheer on the militarization of our streets when we have police able but not willing to do the job better.",
                "author": "JesusisLordofAll777"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zelensky claims that the Ukrainian constitution doesn’t allow him to give up Ukrainian land. Another way to say it would be: “Our constitution doesn’t allow us to admit we lost a war, therefore we will continue to die.”",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suspending Voting. Arresting opposition. Kidnapping teens and old men off the streets... is all that in the Constitution.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "You didn't give up shit ----- it was taken from you. Keep fucking around and all of it will be taken from you.",
                "author": "cyberrigger"
            },
            {
                "raw_content": "Meanwhile his elected term expired over a year ago but he refuses to leave office or allow another election. Literally a dictator by definition.",
                "author": "MisterMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pamela Bondi : 🚨 Over 300 arrests in D.C. — and counting: Just last night, our federal and DC law enforcement partners made 68 arrests and seized 15 illegal firearms. Homicide suspects, drug traffickers, and more are being charged. I’ll continue to stand with yo",
        "score": 1174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These aren’t the arrests we’re waiting for, Pam.",
                "author": "RiolindasReturn"
            },
            {
                "raw_content": "300 arrests. Are they locked up or are they let go? That's the important part.",
                "author": "Comanche_Moon"
            },
            {
                "raw_content": "This is cool but I prefer arrests of members of elite pedophile rings more.",
                "author": "BidenSniffsLittleKid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cambodian Monks thank President Donald J. Trump for his leadership in stopping the war between Cambodia and Thailand.",
        "score": 1421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Orange Men Good.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Based. Anyone else come across those fake monks, though, in urban cities? The ones who try putting a bracelet on your wrist then demand money.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Democrats outraged!",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft, $MSFT, has said that these are the 40 jobs most at risk by AI",
        "score": 702,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People that check the AI mistakes + 2 million.",
                "author": "rivetjoint2"
            },
            {
                "raw_content": "Historians? Very orwellian.",
                "author": "PenisDickWiener"
            },
            {
                "raw_content": "Notice plumbing isn't on the list. Indians will never steal those jobs since they have never seen a toilet before.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "First they came for the cats",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The people telling me to avoid plane flights are not avoiding plane flights. They might make more money than me, but their lives are not more important than mine.",
                "author": "BillyBillington"
            },
            {
                "raw_content": "Don't worry, the next article will give you recipe ideas on how to \"honor\" the family pet!",
                "author": "Impotent_Weasel"
            },
            {
                "raw_content": "# Members of the world economic forum fly by private jet. # AND THEN they get in a private helicopter for the final leg of the trip that could easily be done by car",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Getting rid of USAID might be one of the best victories we've had...",
        "score": 408,
        "text_content": "<p>I remember during the late 2010s and early 2020s that I kept wondering &quot;where the fuck is the woke ideological machine getting so much money?&quot; It felt like there was a massive stockpile of money funding woke organizations all over the world... And it turns out, there was... It was a government agency!</p> <p>And I feel like you can already feel the difference from USAID getting eliminated. The left seems to be scrambling for money to fund their poisonous ideology. We're probably going to see a shit ton of woke NGOs disappear now that USAID is gone.</p> <p>Kind of like with Twitter. Some of our greatest victories seem to be the ones that we did not fully appreciate when it was happening.</p>",
        "comments": [
            {
                "raw_content": "USAID was basically the Dems unending ATM for everything at the tax payers expense. ...yet not a single fucking neck has seen the chopping block.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Evil rejoices in using our own resources to destroy us.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "And no one is hanged yet",
                "author": "Stanwyk74"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former FBI director James Comey posts bizarre video revealing how he idolizes Taylor Swift & uses her music to cope with the Trump Presidency",
        "score": 947,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a queer.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "James Comey is a Faggot Beta Male",
                "author": "Moebius"
            },
            {
                "raw_content": "Democrats are fucking weird.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Report: Microsoft's latest Windows 11 24H2 update breaks SSDs/HDDs, may corrupt your data",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Further analysis has suggested that SSDs built on Phison NAND controllers especially DRAM-less models exhibit failures at lower write volumes. Reports suggest that select enterprise-grade HDDs also display comparable symptoms under intensive writes. Article includes a table of tested drives with 1-3 tests performed: * Test 1: Restart the PC after each step to ensure the drive cache is cleared before proceeding. Copy the entire \"CyberPunk2077\" data folder (92.16GB) from your Steam library * Test 2: Prepare a 62.42GB file (62.42GB) containing 150 video files, each approximately 250MB, compressed into a 7z archive. Write this to the storage device to be verified. * Test 3: Decompress the 7z archive written in Test 2 within the storage device and write it to the storage device. Drives were scored by: * Good = No errors * NG Lv.1 (Not Good Lv.1) = Drive inaccessible (recoverable by rebooting) * NG Lv. 2 (Not Good Lv.2) = Drive inaccessible (unrecoverable)",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "\"Report\" is doing a lot of heavy lifting when the source is a tweet",
                "author": "Frexxia"
            },
            {
                "raw_content": "I wonder if this could be related to drives dropping out for zfs with heavy writes https://github.com/openzfs/zfs/discussions/14793",
                "author": "Numerlor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus - Special Report] THE NVIDIA AI GPU BLACK MARKET | Investigating Smuggling, Corruption, & Governments",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The section from about 18 minutes in to about 21 minutes explaining how restrictions have changed over time is really good lol, they should probably break that out into a shorter video for people who won't watch the whole thing",
                "author": "wilkonk"
            },
            {
                "raw_content": "Steve: We want 48 GB 4090 Chad: Sure, we can make it right now! Nvidia: \"surprise pikachu face\"",
                "author": "suraj_69"
            },
            {
                "raw_content": "Can you believe this crusade all started because Nvidia asked Steve to include MFG benchmark in his review videos.",
                "author": "hsien88"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hardware Canucks - The Subtle Sabotage of AMD Gaming Laptops",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe things have changed within the past 12 months but AMD has had a long history of failing to provide laptop manufacturers with contractually guaranteed high volumes of its most performant chips. According to Ian Cutress this was due to a lack of cashflow combined with the fact that they were low margin parts for AMD after TSMC took its considerable cut. How does this impact who gets a vapor chamber and cool features and who doesn't? Economies of scale is the key aspect to consider. If you have a contractual guarantee for x million of chips from Intel, you simply can calculate the bill of goods that goes into a laptop completely differently. A production line for the custom vapor chamber has to be set up and financed. How much that costs per unit depends on how many units you sell etc. Meanwhile the lower unit AMD laptop gets the heatpipes off the shelve. I don't see collusion or foul play on the laptop market until AMD can actually provide the same guaranteed delivery volumes as Intel",
                "author": "constantlymat"
            },
            {
                "raw_content": "One small correction when he says that Asus is running a ton of juice into the Intel laptop. From other reviews we know that at 140w setting the 9955 uses 20-30w more than the 275. So Asus is probably running them at the same power.",
                "author": "Bananoflouda"
            },
            {
                "raw_content": "The limitations are real... Capped at 5070Ti, older thermal solutions, older components, etc.",
                "author": "AnechoidalChamber"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] Ryzen 7 9800X3D vs. Core i9-14900K: Who's Really Faster For Battlefield 6?",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: - 9800X3D is roughly 30% faster on average - 14900k consumes 120% more power (~220w vs ~95w) - 1% lows are slightly closer but 9800X3D still ahead by up to ~20% - People that claim their overclock can get them to match the 9800X3D are talking outta their arse",
                "author": "Comprehensive_Ad8006"
            },
            {
                "raw_content": "In the test the 9800X3D was around 30% faster than the 14900K, but was struck me was the power usage: 9800X3D around 90 W while the 14900K around 210 W.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "tl;dw The 9800X3D is much faster and much more efficient for playing BF6.",
                "author": "GhostsinGlass"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Heracles Attack - AMD Secure Environment Virtualization bypass",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The hack requires kernel access on the host, but the workarounds are non-expensive.",
                "author": "agoldencircle"
            },
            {
                "raw_content": "Sick of the trend of named vulnerabilities. Too much focus on fame.",
                "author": "3G6A5W338E"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AllThingsOnePlace: \"UGREEN 500 watt USB charger Tested and Compared\"",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the market for high power USB charging blocks like this really that big? I would imagine most people would be more interested in a high power USB dock instead.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "You Can Save This 1980’s Hard Drive!",
        "score": 7,
        "text_content": "(Yes, this video does have hardware in it.)",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "$400 off of FB Marketplace",
        "score": 872,
        "text_content": "I wasn’t planning on getting a S2 until that new Splatoon spin-off came out. But I’ve been on FB marketplace looking for furniture recently. One thing led to another and here we are. Brand new Switch 2, screen protector, hard shell case, and DK Banza brand new.",
        "comments": [
            {
                "raw_content": "Did the Powerade come with it?",
                "author": "Williekins"
            },
            {
                "raw_content": "Someone's got some recycling to do.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Good thing they threw in the quarter bottle of Powerade otherwise I would say it’s a ripoff",
                "author": "stoneage91"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"It's just a switch 1 pro\" 🤡",
        "score": 780,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is this game? Edit: I did not expect this kind of traction🤣 for those wondering, it’s Minecraft with shaders",
                "author": "Dicklefart"
            },
            {
                "raw_content": "Why are the people on this sub so defensive? The console is a success and you’re enjoying it, just play your console.",
                "author": "Grace_Omega"
            },
            {
                "raw_content": "I mean it is, but that’s not a bad thing. It’s what a lot of us wanted. A bigger more powerful switch :)",
                "author": "HuckFinn98"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Cyber punk",
        "score": 135,
        "text_content": "So I got Cyberpunk for Switch 2. Everyone- it looks AMAZING. I stayed away from this game for a while but am deep in. Great story and mechanics. It’s a visual wonder on the Switch 2",
        "comments": [
            {
                "raw_content": "As someone who owns cyberpunk on every platform and storefront i can say that the switch 2 version is a marvel. How they managed to do this i dont know. I have a legion go and a Steam Dech Oled and cyberpunk on switch is fenomenal. (Not so much the dlc area but thats bad on everything)",
                "author": "slapmybassdaddy"
            },
            {
                "raw_content": "60 hours in on switch 2 and have enjoyed every moment",
                "author": "esketitethan"
            },
            {
                "raw_content": "Such a 🔥game on the switch 2! Nintendo got lucky with this game, especially the way it runs.",
                "author": "InfiltrationRabbit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Enjoy Pokémon Battles Like Never Before in Pokémon Legends: Z-A!",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you can dodge a wrench, you can dodge a Pokeball.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Now all i gotta do is find 3 more people in their 30’s that still play pokemon",
                "author": "ders89"
            },
            {
                "raw_content": "All the recent footage of the game has come from the Nintendo Switch 2 Edition of the game, I am curious to know what the Nintendo Switch version looks like.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Expectations for GamesCom 2025?",
        "score": 67,
        "text_content": "Are we expecting release dates? Shadow drops? Announcements? Or will Nintendo save those for a September direct?",
        "comments": [
            {
                "raw_content": "I expect nothing, I hope for something.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "I feel like they'll save anything big for a direct. They rarely announce things at events like these anymore.",
                "author": "Williekins"
            },
            {
                "raw_content": "Probably not much or nothing, most announcements will be 3rd party focused A September Direct is more likely since Nintendo prefers to announce things at their own events/pacing",
                "author": "reevestussi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The mouse acceleration on the Switch 2 is obnoxious.",
        "score": 39,
        "text_content": "Anyone else finding the mouse acceleration on the Switch 2 really obnoxious? There doesn't seem to be a way to turn it off.",
        "comments": [
            {
                "raw_content": "I have to be honest I never noticed anything wrong with it and trust me I always disable mouse acceleration on my PC. It's probably because I haven't used the mouse feature as much. I'm sorry you're finding it a nuisance though.",
                "author": "XDavide08"
            },
            {
                "raw_content": "Agreed",
                "author": "pie_-_-_-_-_-_-_-_"
            },
            {
                "raw_content": "Yep it sucks. Noticed since launch. It makes playing actual shooter games with it horrible.",
                "author": "ctyldsley"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thoughts on Madden 26",
        "score": 74,
        "text_content": "So I’ve played a handful of games in Madden 26 on Switch 2. Pretty mixed thoughts: - Graphically it’s a huge step up from the FIFA/FC games on Switch. - Framerate is pretty stable but I do agree that 30 fps isn’t great for gameplay. - Resolutions actually seem pretty low and inconsistent. Does not appear to be 1080 and some random screens/elements look very fuzzy. - I do suspect there’s some input lag, especially for moves on the run with the ball and for tackling. - It is sucking down battery like crazy. I think I’m barely getting through 2 6-min quarter games on a full charge. These thoughts are from someone who has played 250+ hours combined of EA soccer titled on Switch and has played a significant amount of Madden on PlayStation, all of which has typically been quick play modes vs. the CPU. I think any casual player could enjoy this Switch 2 version of Madden a lot. It’s still one of the better sports titles I’ve played across the platform. That said, I still believe PlayStation Portal is still a significantly better experience for handheld Madden right now. Not my favorite $70 I’ve spent on games, but I’ll try to get some use out of it. Definitely hopeful for more updates.",
        "comments": [
            {
                "raw_content": "I'm glad the Switch 2 is getting these games and it's at least an improvement thanks to more horsepower.....but you can tell EA's mantra has always been to get a minimum viable product out on store shelves. If you're a football fan and all you have is a Switch 2, you have to take what you can get, which sucks. Wish the NFL would wise up and let other devs compete with EA. It's not that hard to make a better game than any Madden in the last 15 years.",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "The stuttering is making the game look so awful, I hope they'll address this if they plan to update it. I was thinking about getting it... but I'll wait for a sale. A game that is shuttering isn't worth $70 at the moment. Appreciate it for sharing the video and your thoughts!",
                "author": "RY-R1"
            },
            {
                "raw_content": "I think companies like EA are missing out on an opportunity to get those double dip players. You put cross platform saves on there and I can play on my beautiful OLED with my PS5 Pro and have a copy on my switch on the go. I like most gamers understand portability comes with some sacrifices, put out a solid 1080p 60 port and your set. it’s a shame companies don’t understand that as well",
                "author": "All_Rise2019"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Does anyone know if it's possible to buy the physical Switch 1 version of Pokemon Legends: ZA and then pay to upgrade to the Switch 2 version?",
        "score": 4,
        "text_content": "I hate the cover and text on the front for the Switch 2 version, so I want to own the physical copy of the Switch 1 version instead. However, I have a Switch 2 and am willing to pay the increased price for the upgraded version. Does anyone know if it's possible to buy the physical Switch 1 edition of ZA and then pay to upgrade it on the Nintendo Store or something like that?",
        "comments": [
            {
                "raw_content": "I thought about doing this but I honestly just want 1 switch 2 game that’s all on the cart without having to get a digital upgrade path. I’m gonna just put up with the ugly info dumb cover art.",
                "author": "I_Heart_Sleeping"
            },
            {
                "raw_content": "yeah you can, that's what the upgrade packs on the eshop are for, all nintendo-published games have either free patches or dedicated upgrade packs however, if you get the switch 2 physical then both the switch 2 and switch 1 versions come both on the cart, buying the upgrade path will require a substantial download",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Yes, what the ugly text is telling you is that the \"Switch 2 Edition\" cart includes both the Switch 1 game and the upgrade pack you'd get from the eShop, no ugly text just means you'd have to buy the upgrade pack separatedly My physical copy of Zelda Breath of the Wild from 2017 works fine with the upgrade pack from the eShop",
                "author": "Jeff1N"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Possible Gamescom Splinter Cell Remake news?",
        "score": 449,
        "text_content": "I was flying home today through the Denver airport and saw Michael Ironside. I didn’t ask him for a photo or anything, but I did hear him tell his wife that they were looking for the gate for their Munich flight. Potentially flying out to Gamescom for some Splinter Cell Remake reveal?",
        "comments": [
            {
                "raw_content": "This is my kind of leak right here",
                "author": "victini0510"
            },
            {
                "raw_content": "This has the same vibes as that leak where a guy who works at Disney licensing talked about Nintendo calling to clear a track from Kingdom Hearts for a Direct.",
                "author": "thr1ceuponatime"
            },
            {
                "raw_content": "Fuck it, I believe you",
                "author": "Spiderpenguin_2020"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[A9VG rumor] Reliable Chinese leaker teases demo of Trails in the Sky 1st Chapter is coming on August 21",
        "score": 89,
        "text_content": "This leaker never got anything wrong prior, and was the first to tease Yakuza Pirates annoucement at TGS Also I asked Salromano if I could copy his post and post it here. >Thread title is: I Want Tiffany's Mom Image filename is: 094908nwqwoljg6wu66lw1.png Image width: 821px Text in the upper right reads: Unrelated to Nintendo [https://bbs.a9vg.com/thread-9043728-1-1.html](https://bbs.a9vg.com/thread-9043728-1-1.html) [https://www.resetera.com/threads/playstation-studios-ot47-the-wolf-pack.1243551/post-143988963](https://www.resetera.com/threads/playstation-studios-ot47-the-wolf-pack.1243551/post-143988963)",
        "comments": [
            {
                "raw_content": "Is this the first entry point on the saga? I really want to get into it",
                "author": "MiteshuRonin"
            },
            {
                "raw_content": "I know there wont be a Switch 2 version (at least not on release) but I really hope the game runs at a higher framerate/resolution on Switch 2 regardless, similar to Pokemon SV or SM Odyssey I dont want to be stuck at 540p30fps undocked / 720p30fps docked or whatever the Switch 1 performance is on Switch 2",
                "author": "Financial-General163"
            },
            {
                "raw_content": "YES PLEASE YES PLEASE YES PLEASE GIVE GIVE GIVE I CAN'T WAIT TILL SEPTEMBER TO PLAY ITTTTTT",
                "author": "Eliskor89"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rocket League is rumored to be ported to Fortnite in the future.",
        "score": 252,
        "text_content": "[Source](https://xcancel.com/blortzen/status/1957185753064087727) *\"RUMOR: Rocket League port to Fortnite?? (Ok, it sounds weird and fake, but just let me explain* *- This info was said by the playtester who leaked 4-5 upcoming seasons, but this leak was kept hidden for a while (also, they said something about \"Rocket Racing overhaul\")* *- On December 19th, an upcoming mode, codenamed \"RL\" was added alongside Rocket Racing (Codenamed \"RR\"), this new mode will have Octane stuff as default.* *- Some updates ago, a string leaked that the top hat accessories from Rocket League would be coming to Fortnite (string is literally \"Dealership Hats\")* *- Some weeks ago, I heard about this rumor again from a source that has got a lot of collabs right, but still, a rumor* *-* [*And now, Loolo leaked an upcoming \"Dealership\"*](https://xcancel.com/Loolo_WRLD/status/1956791938180600273) *(though, this may not be related becausc Rocket League has a garage.* *Even if I don't see it as something possible (because porting a whole game onto Fortnite sounds weird) but a lot of stuff hints for it to happen.* *Again, it's just a rumor, A RUMOR that I don't believe, but I feel everyone should know.\"*",
        "comments": [
            {
                "raw_content": "I still can’t believe Epic bought psyonix, made the developers make a rocket league racing game and then put it in…Fortnite, instead of rocket league itself. Epic’s treatment of rocket league as a whole has been so bizarre and the community morale is just at an all-time low",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "\"we want rocket league ue5\" *monkeys paw curls*",
                "author": "SupDos"
            },
            {
                "raw_content": "This might finally achieve Epics goal of killing off rocket league",
                "author": "TOP-IS-LIFE"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Vincent Disanti (creator of the never hike alone trilogy of fan films) talks about the upcoming Friday the 13th videogame",
        "score": 43,
        "text_content": "https://youtu.be/-McN3O3DDCk?si=rhDfDPFKKL2queLy",
        "comments": [
            {
                "raw_content": "While he isn’t officially involved, he did attend the Sweet Revenge premiere alongside people who are involved with Jason universe, and I don’t know who else he’s talking about. He’d previously predicted Schuyler White would play Jason in sweet revenge. Plus he’s got 3 successful fan films and a 4th one on the way, I don’t see why’d he just make stuff up. This clip is from the latest episode of his podcast on the womp stomp films YouTube channel.",
                "author": "Sea_Lingonberry_4720"
            },
            {
                "raw_content": "Please. Just be like Friday the 13th The Game.",
                "author": "RemTeeV"
            },
            {
                "raw_content": "The new short film was terrible and sadly Jason needs to rest in Hell. I don't want a Crystal Lake Extended Universe, just a mask, a machete and fresh horny counselors.",
                "author": "brigthebrain"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: 16 total 6v6 maps for BO7. 13 Original maps, 3 remasters from BO2. 2 additional large scale maps for their skirmish mode.",
        "score": 119,
        "text_content": "https://xcancel.com/theghostofhope/status/1957173644649488771?s=46",
        "comments": [
            {
                "raw_content": "BO6 only had 12 6v6 maps at launch and some of them stank so so bad. Hopefully the BO7 ones are better",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "so I got scammed out of black ops 6?",
                "author": "lukas-bruh"
            },
            {
                "raw_content": "Lots of good maps in BO2. 2 of them better be Raid and Hijacked. Maybe even Studio although thats a BO1 remaster.",
                "author": "Zombienerd300"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Ops 7 will be $70 at launch",
        "score": 379,
        "text_content": "https://xcancel.com/billbil_kun/status/1957017550044168449 So basically when Microsoft announced $80 games back earlier this year it was a PR disaster that didn't even come to fruition.",
        "comments": [
            {
                "raw_content": "They were insane for thinking Outer Worlds 2 of all games should have been the one to start the $80 shift. Nintendo was able to mostly get away with it because they did it on fucking Mario Kart. The only other game I could see pulling something like that and people still buying it in droves is GTA",
                "author": "Traitor_To_Heaven"
            },
            {
                "raw_content": "Pre-orders for the Outer Worlds 2 must've been damn near zero.",
                "author": "nicknp16"
            },
            {
                "raw_content": "Feel like we knew that already? >[In a statement, a Microsoft spokesperson said Xbox was \"focused on bringing players incredible worlds to explore, and will keep our full priced holiday releases, including The Outer Worlds 2, at $69.99, in line with current market conditions.\"](https://www.gamesindustry.biz/microsoft-reverses-80-first-party-price-hike-to-keep-full-priced-holiday-releases-in-line-with-current-conditions) \"Full priced holiday releases, including The Outer Worlds 2\" seems pretty cut and dry they were giving up on anything being $80 this year",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Potential Spoilers] TheGhostOfHope has revealed BO7's playable Campaign characters",
        "score": 133,
        "text_content": "https://xcancel.com/TheGhostOfHope/status/1957124861173678175#m",
        "comments": [
            {
                "raw_content": "How the fuck is Harper AND Karma alive at the same time? For one to live the other had to die",
                "author": "keyblaster52"
            },
            {
                "raw_content": "At least with>! harper!< alive that confirms a canon ending for BO2",
                "author": "Dpingthroughlife"
            },
            {
                "raw_content": "So no muted protagonist anymore? Rare Treyarch W these days?",
                "author": "JjoyBboy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA plans to make Battlefield an annual franchise",
        "score": 182,
        "text_content": "https://xcancel.com/charlieINTEL/status/1957081561439879570 Industry analyst Michael Patcher claims Battlefield GM told him they plan to have a yearly Battlefield game release, but it'll probably take 5 years before that happens \"Their goal is 3 studios making Battlefield on a 3-year basis, so they can get to Battlefield annually\" Edit: [Former DICE dev months ago also claimed this was the goal](https://bsky.app/profile/rizible.bsky.social/post/3lfysleqdpb2g)",
        "comments": [
            {
                "raw_content": "Didn't he JUST backtrack about fairgame?",
                "author": "Laughing__Man_"
            },
            {
                "raw_content": "Just for fun, can we have Pachter as a Tier 7 leaker?",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Pachter said it which means the next Battlefield will release in 2031.",
                "author": "Elegant_Shop_3457"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Bartlett Lake-S 12 P-Core silicon steppings confirmed, still no sign of consumer variant",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would love one of these. My 12900KS still serves me fine and will for the far future, but it would be a nice backup chip or even a mini homeserver chip. 12p cores, spread across several vms for several server related tasks out of your own home. My dream.",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "I would love a consumer variant with AVX-512 and would buy one in a heartbeat, but I’m not expecting to see it.",
                "author": "CharcoalGreyWolf"
            },
            {
                "raw_content": "Just give me 12P cores with AVX512 damn intel.",
                "author": "nero10578"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "The Subtle Sabotage of AMD Gaming Laptops",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a well reasoned and argued video, but he does dance around the fact that Intel has had predatory and anti-competitive agreements with OEMs for decades. The findings are framed as a surprise, but it's been well known forever.",
                "author": "got-trunks"
            },
            {
                "raw_content": "I can think of the new Dell 14 Plus laptops. The Dell 14 Plus with Ryzen AI still has the same screen from the previous generations of Inspirons, a 19200x1200 panel with around 54% sRGB coverage. It also has HDMI 1.4. On the other hand, the Dell 14 Plus with Lunar Lake gets a nice 2560x1600 panel with nicer colors and hdmi 2.1. It is ridiculous that if I want the AMD version of the laptop, I get fucked over in the ass by being sold a cheaper device. This is one of the reasons as why I bought a framework laptop to replace my Dell Inspiron 14 5425. Framework put AMD first.",
                "author": "Comrade-Viktor"
            },
            {
                "raw_content": "Did you know intel still hasn't paid amd for the last two times they got caught and convicted of engaging in anticompetitive, anticonsumer practices?",
                "author": "name_it_goku"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New build!",
        "score": 67,
        "text_content": "7800X3D + 5080",
        "comments": [
            {
                "raw_content": "Sick build! I see that you're rocking with the Montech King 95 Pro for your case. I'm planning to get one soon so I would like to know your experience building with it.",
                "author": "TyranWolf"
            },
            {
                "raw_content": "Not a fan of fish tank cases (I've dropped enough glass panels with my butter fingers), but I think the set up is quite aesthetically pleasing. I like the color coordination.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Looks cool mate :)",
                "author": "T_TChaos"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "25 years ago today, the first ever ATI Radeon GPU was reviewed",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss Ruby",
                "author": "techtimee"
            },
            {
                "raw_content": "Playing morrowind on a 9500 Pro was peak.",
                "author": "06035"
            },
            {
                "raw_content": "What a ride it has been. 3850 4890 crossfire 7970 6700 XT",
                "author": "2literpopcorn"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen 7 9800X3D vs. Core i9-14900K: Who's Really Faster For Battlefield 6?",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the 9800X3D and it's not all that close either",
                "author": "CMDR_omnicognate"
            },
            {
                "raw_content": "HUB has to retest the shyt out of CPUs to prove the obvious fact. What a time to live in. Some people can't just admit that Intel lost",
                "author": "Reclusives"
            },
            {
                "raw_content": "I don’t even have to watch the video to know the answer",
                "author": "Spoksparkare"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Apartment rents drop in July as vacancies move to multiyear high",
        "score": 319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vacancies at multi-year highs yet rents also at record highs. Make it make sense",
                "author": "MyOilSpill"
            },
            {
                "raw_content": "Very simple: people are moving in together and sharing spaces. Prices became just too high. For the time being, this is effective to combat this inflation. Long term, it’s not the solution. When or if we ever have a better jobs economy (not holding my breath), I expect people will once again see wage growth that helps them “launch” out on their own. Speaking mainly for 20-something’s, generally.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "“Landlords are not quite as overstocked as they were at the start of this year, but it is still more of a renter's market. Last year more than 600,000 new multifamily units hit the market, representing a 65% increase compared with 2022 and the most new supply in a single year since 1986, Apartment List found.” Wow. Now I understand how so many articles can say that construction starts / permits are down XYZ percent. Because 2025 was the highest since 1986. Even if 2026 inventory is down 30% it’s still going to be way up from the inventory of the last several decades.",
                "author": "SpaceGrape"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Where are housing prices least unaffordable?",
        "score": 32,
        "text_content": "In which countries, cities, regions is a basic home most affordable for the median Joe that's not in the middle of uninhabited wilderness or job deserts? I don't know why this bubble is so global but some countries and places are definitely worse than others. What are these places doing right to keep housing affordable?",
        "comments": [
            {
                "raw_content": "Bad areas. For example some of the worst neighborhoods in Philly have homes for available for $50k or less.",
                "author": "harbison215"
            },
            {
                "raw_content": "Coast of Somalia",
                "author": "PictureDue3878"
            },
            {
                "raw_content": "Place most people don’t want to live, supply and demand also works in real estate",
                "author": "BlazinAzn38"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Autonomous Valet",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was cool as fuck",
                "author": "rifts"
            },
            {
                "raw_content": "Bruh imagine this little dude just steals your car. Why so stronk?",
                "author": "SkaldCrypto"
            },
            {
                "raw_content": "This is the future of towing and vehicle repossession",
                "author": "ticktockbent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Derya Unutmaz, immunologists and top experts on T cells: Please, don't die for the next 10 years. Because if you live 10 years, you’re going to live another 5 years. If you live 15 years, you’re going to live another 50 years, because we are going to solve aging.",
        "score": 202,
        "text_content": "[https://x.com/JonhernandezIA/status/1957036446038073802](https://x.com/JonhernandezIA/status/1957036446038073802)",
        "comments": [
            {
                "raw_content": "Two things: 1. \"don't die\" is generally good advice 2. out of all the topics we discuss in this sub this is the one I am most skeptical of. Not saying it won't happen (genuinely don't know) but there have always been snake oil salesmen selling immortality to emperors and kings.",
                "author": "manubfr"
            },
            {
                "raw_content": "Ok Reddit, do your thang, someone do a background check on this guy please. Is he credible?",
                "author": "More-Economics-9779"
            },
            {
                "raw_content": "If we could just start by eliminating cancers and heart disease, that would be a significant and perhaps more realistic step than reversing aging entirely",
                "author": "WarriorTreasureHunt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "100m humanoid champion",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think that the best thing of this robot competition, assuming it will be an annual event, is seeing how drastically robotics improves every year. I wouldn't be surprised that the next year 100m time will be at least halved and in a few more years, humanoids would break human 100m record.",
                "author": "Rudvild"
            },
            {
                "raw_content": "And how quickly will they run 100m under 3 seconds, and less? In next 10 years?",
                "author": "Worth-Boysenberry-93"
            },
            {
                "raw_content": "hopefully they got banned for coming out of their lane.",
                "author": "Curtilia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"AI Is Designing Bizarre New Physics Experiments That Actually Work\"",
        "score": 1061,
        "text_content": "May be paywalled for some. Mine wasn't: [https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/](https://www.wired.com/story/ai-comes-up-with-bizarre-physics-experiments-but-they-work/) \"First, they gave the AI all the components and devices that could be mixed and matched to construct an arbitrarily complicated interferometer. The AI started off unconstrained. It could design a detector that spanned hundreds of kilometers and had thousands of elements, such as lenses, mirrors, and lasers. Initially, the AI’s designs seemed outlandish. “The outputs that the thing was giving us were really not comprehensible by people,” Adhikari said. “They were too complicated, and they looked like alien things or AI things. Just nothing that a human being would make, because it had no sense of symmetry, beauty, anything. It was just a mess.” The researchers figured out how to clean up the AI’s outputs to produce interpretable ideas. Even so, the researchers were befuddled by the AI’s design. “If my students had tried to give me this thing, I would have said, ‘No, no, that’s ridiculous,’” Adhikari said. But the design was clearly effective. It took months of effort to understand [what the AI was doing](https://arxiv.org/abs/2312.04258). It turned out that the machine had used a counterintuitive trick to achieve its goals. It added an additional three-kilometer-long ring between the main interferometer and the detector to circulate the light before it exited the interferometer’s arms. Adhikari’s team realized that the AI was probably using some esoteric theoretical principles that Russian physicists had identified decades ago to reduce quantum mechanical noise. No one had ever pursued those ideas experimentally. “It takes a lot to think this far outside of the accepted solution,” Adhikari said. “We really needed the AI.”\"",
        "comments": [
            {
                "raw_content": "The [linked paper](https://arxiv.org/abs/2312.04258) might be richer.",
                "author": "Adeldor"
            },
            {
                "raw_content": "So AI was able to read all of the papers associated with the topic, find a report others overlooked and incorporate into a new solution. Humans are garbage at filtering through so much data - AI is built for it.",
                "author": "angrycanuck"
            },
            {
                "raw_content": ">If the AI’s insights had been available when LIGO was being built, “we would have had something like 10 or 15 percent better LIGO sensitivity all along,” So it's something that could be used in the real world and was created by letting an AI brute force solutions in some type of simulation software?",
                "author": "coolredditor3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman says rising wealth and advancing tech will push societies toward new redistribution experiments, like sovereign wealth funds, UBI, or even redistributing AI compute",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We own the electricity production and you pay us to use it Use as much as you need then sell the rest to companies You will be one day be able to measure the exact number of joules that are required for every product",
                "author": "Sea_Sense32"
            },
            {
                "raw_content": "Yeah, “someone else will figure it out” vibes",
                "author": "dergachoff"
            },
            {
                "raw_content": "Code for, \"The rich are going to get richer than they've ever been and everybody else can suck on the crumbs we fling them.\"",
                "author": "nmacaroni"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Computing power per region over time",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US amount will be more than double that by next year if there aren’t any major setbacks.",
                "author": "modularpeak2552"
            },
            {
                "raw_content": "We still need to catch up to China on energy though",
                "author": "TurnUpThe4D3D3D3"
            },
            {
                "raw_content": "Woah, if this is true, I didn't think the US was that far ahead.",
                "author": "iwantxmax"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How CATL Made Batteries 90% Cheaper (breakthrough in sodium metal chemistry, $10 / KwH)",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm from Quebec where the government invested lots of money to produce batteries locally... It failed miserably and quickly, but it was very obvious that nobody could compete with China on battery manufacturing.",
                "author": "Microtom_"
            },
            {
                "raw_content": "W",
                "author": "Psychological_Bell48"
            },
            {
                "raw_content": "man, $10/kwh at 10k cycles would be revolutionary. I don't even think they need to go that far. $20/kwh at 5k cycles would be revolutionary. I hope they can achieve it.",
                "author": "Cunninghams_right"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is Meta the only big company working on alternatives to transformers?",
        "score": 202,
        "text_content": "They're working on Joint Embedding Prediction Architecture and Large Concept Models, which I find extremely commendable, as I've never heard of any other major AI lab doing anything other than improving LLMs. JEPA is essentially Yann LeCun's vision of what an AI should be like to understand the world, and it's fascinating because it works by predicting embeddings instead of tokens. JEPA would only be wrong if his world model was wrong, he couldn't hallucinate like LLMs do, besides being able to play chess, which not even o3 can do. Everyone's rooting against Zuck, but I'm rooting for them to overcome this LLM wave.",
        "comments": [
            {
                "raw_content": "I will put a H200 on the table to say that all of these companies are obviously working on the limitations of transformers. For obvious reasons they are tight lipped and do not disclose.",
                "author": "swiftninja_"
            },
            {
                "raw_content": "Supposedly Ilya Sutskever’s company, SSI (Safe Super intelligence), is working primarily on “post-transformer architecture,” at least according to an interview with him from a while ago.",
                "author": "churningaccount"
            },
            {
                "raw_content": "Iirc. Google is working on something they call \"Titans\" as an alternative to transformers.",
                "author": "UnnamedPlayerXY"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LeCun In 2023: \"On the highway towards Human-Level AI, Large Language Model is an off-ramp.\" Did this age well?",
        "score": 52,
        "text_content": "2 and a half years later, is this aging well or is it aging like milk? I do not have an agenda to pitch. I'm just here for an objective discussion. https://x.com/ylecun/status/1621805604900585472 Lecun also expressed fears that putting billions into LLM could distract us from the true goal of AGI and ironically make it so that true AGI systems are developed much later than sooner. https://x.com/ylecun/status/1793326904692428907 Bill gates also predicted in 2023 that GPT-5 would only be a slight incremental improvement over GPT-4, not a revolutionary leap. https://www.windowscentral.com/artificial-intelligence/openai-chatgpt/from-plateau-predictions-to-buggy-rollouts-bill-gates-gpt-5-skepticism-looks-strangely-accurate Personally, it's becoming increasingly clear that we need a successor to the transformer, and that the transformer will only be an accessory component of future AGI systems, not the main engine. Who is working on developing the engine of AGI? Very few resources are going into it. Even at Meta, Zuckerberg is putting most of the money into LLM's, Lecun's team is moreso like a small moonshot project. At DeepMind, Hassabis has always realized that LLM's are distractions, but he does not have full control over his research direction since he is owned by Google. If it was up to him, he'd be investing a lot more time and resources into R&D of new architectures.",
        "comments": [
            {
                "raw_content": "Just here to remember that LLM ≠ Transformer",
                "author": "Hyper-threddit"
            },
            {
                "raw_content": "Well, bill gates was wrong because the gpt 5 thinking model is leagues better than the original gpt 4, its basically a slight upgraded o3.",
                "author": "fastinguy11"
            },
            {
                "raw_content": "People have been betting against transformers for a long time. I can't predict the future, but I don't think it's wise to bet against them. They can't do X ≠ they will never do X. We have seen that mistake play out several times now. \"Transformers can only do translation, they’ll never generate coherent long-form text.\" \"They just parrot training data, they’ll never reason or follow logical chains.\" \"They can’t program as code is too brittle and structured.\" \"They only handle text, they’ll never understand images, video or speech.\" \"LLMs will never reliably call APIs, browse, or act in a structured environment.\" \"They’re capped at a few thousand tokens, so they’ll never handle books or large codebases.\" \"They’ll never maintain memory across conversations or adapt to individual users.\" \"They can’t do math, symbolic reasoning is impossible for them.\" \"They’ll never write scientific papers or contribute to real research.\" \"They’ll never generate music or art, that requires creativity beyond statistics.\" \"They’ll never pass professional exams, law, medicine, engineering demand deep understanding.\" \"They can’t be trusted for enterprise use, outputs will always be too random and brittle.\" \"They’ll never run efficiently, too big, too slow, too expensive to deploy at scale.\" \"They’ll never integrate with robotics, language models can’t control physical systems.\" \"They’ll never replace search, they hallucinate too much to be useful as information tools.\" Every time, so far, the line shifted.",
                "author": "Rain_On"
            }
        ],
        "subreddit": "singularity"
    }
]