[
    {
        "post_name": "Good luck NYC",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You get what you FUCKING DESERVE!!",
                "author": "geekesmind"
            },
            {
                "raw_content": "Election fraud.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "In 2026, NYC will have more vacant office space than it has ever had in its history. There will be so much fraud/shells setting up, and money laundering in 2026.",
                "author": "1777"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Phillip Rivers vs somali daycare",
        "score": 433,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This Phillip guy fucks",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "The other day I leared Rashida Tlaib is from a family of 14 children. US birthrate is 1.6. I know this post is about the ghost children in daycare fraud.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Not everyone makes a great parent, those people can opt out. Some people love having a large family and lots of children and are fantastic parents, we should reward them and encourage others who also want large families. We have to identify those can have large families and help them out. But in general having job security, affordable housing, and a safe environment is what makes young people feel comfortable with getting married and starting a family. I’m convinced that corporations are not hiring young White men so that the White population doesn’t replenish. We need to start our own businesses and only hire White men who have been shut out of jobs.",
                "author": "MapleMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More immigration judges continue to be FIRED by the Donald Trump Administration. - More than 100 immigration judges were fired in 2025 nationwide - More than 21 immigration judges serving the San Francisco Bay Area have been fired",
        "score": 483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "should have been executed for treason, we live in such soft times",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "This is like the equivalent of DMV employees getting fired for not actually administering road tests. But they put the word \"judge\" in front of these administrative employees so they sound more official lol. Article II \"judges\" don't actually judge anything. They're bureaucrats.",
                "author": "lefty295"
            },
            {
                "raw_content": "More than 100 roaches stomped, thousands more to go. - actual headline",
                "author": "Oruin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Teachers Unions:",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Teachers unions are communist activist groups, tasked with turning your impressionable little kids into a new generation of their comrades.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Why the hell were public employees ever allowed to form a union in the first place? Someone get this in front of SCOTUS, I have a feeling Thomas would see to it that teachers unions, postal worker unions, and all the rest of them were scattered to the winds.",
                "author": "Hikedelics"
            },
            {
                "raw_content": "Normal unions do this too. The \"working class\" at my job were all Trump supporters but the union sent us a Joe Biden endorsement in the mail.",
                "author": "Amaroq64"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Raise your kids to be like Nick Shirley 👍",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfect comparison. Thanks, OP.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "I watched him today on the All In Podcast. One of the guys asked if he was Mormon (he is) and did the 2 year ministry (he did) and speculated that experience helped make him so fearless in approaching and talking to strangers. Nick said it was a factor but not the only one.",
                "author": "BakeByDay"
            },
            {
                "raw_content": "Dude on the right is a retarded faggot",
                "author": "Merica4EVER"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THAT didn't take long!",
        "score": 877,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, so communism working as expected then.",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "He's a socialist. It's not about them - it's about him.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "Mamdani is just DeBlasio 2.0. I know leftists in NYC. They all hate on DeBlasio, and can't recognize Mamdani is pushing the same ideas. It's so obvious. My sister has a major reason she voted Mamdani. To have lower rents. And I asked, what is it that he's proposed that will lead to lower rents? His plans are to raise regulations and costs of doing business. Guess what that means for consumers?",
                "author": "MagaJay02"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John Podesta linked to $375 BILLION dollar slush fund connected to one of the world's greatest money laundering schemes ever played on the public hidden in plain sight, known as \"Climate Aid.\"",
        "score": 667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrests are coming. Any day now.",
                "author": "sixfingerdildo"
            },
            {
                "raw_content": "Ever since Trump took office it’s just a new headline every day about how Americans got fucked in the ass by fraud and previous admins And not a single person has been arrested",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "I was literally just thinking to myself earlier “what the fuck happened to John Podesta” because I’ve seen so little new information on the bastard",
                "author": "Beachboy1b"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It doesn't work anymore...",
        "score": 1530,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based.",
                "author": "Coprolite"
            },
            {
                "raw_content": "Tim Walz is a TRAITOR and a COWARD",
                "author": "TheRPatriot"
            },
            {
                "raw_content": "The young are learning. Their spines are stiffening because they can see they are being attacked and being lied to. This is a good thing as when they finally get fed up, they will drag these lying assholes into the street and start stringing them up. They are getting in touch with their inner American. Back to their roots... Gives me hope for the future.",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An illegal went to a casino in Chicago and won a jackpot “He can't get paid for a jackpot because of his immigration status” 🚨 The illegal confirms he was issued a Real-ID by Chicago Democrats and presented it to the casino Illegals are given IDs and are DEFINITELY voting",
        "score": 1010,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird, because it was my understanding that a ReAl iD would prevent this very thing.",
                "author": "Trump454748"
            },
            {
                "raw_content": "Ever hear of Motor Voter? It's a law that Democrats passed literally decades ago that permits illegal aliens to walk into any DMV and get a drivers license AND immediately register to vote at the very same time. Since then, Democrats have blocked any attempt to require proof of citizenship prior to voting. Non-citizens voting was literally baked into the system by Democrats decades ago to ensure their continued rule over the unwashed masses.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "Good thing we're giving federal tax dollars to illegals so they can gamble in Chicago",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Rules Trump Administration Can Share Immigrants’ Medicaid Data With ICE",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is very big, very great news! Thank you for posting, OP!",
                "author": "TheAftermath"
            },
            {
                "raw_content": "I was assured illegals weren’t getting medicaid",
                "author": "Right0hio"
            },
            {
                "raw_content": "I didn't vote for any fucking judge",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He was so proud of himself.",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This homo missed his calling on Broadway…",
                "author": "Define_Assault"
            },
            {
                "raw_content": "That gay-goosestepping bastard ... there is not enough disgust for this traitorous grifter.",
                "author": "nzsvz9"
            },
            {
                "raw_content": "Your clout and standing within the DC mafia hinges upon the money you bring to the table waltz got a fucking VP NOD, that's how much fraud was making its way back to DC",
                "author": "KennethsFrequency"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I know this may ruin some of your vacation plans but ya'all ain't allowed now...",
        "score": 554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "hmmm. I thought it was spelled with two G's.",
                "author": "DeplorableDreg"
            },
            {
                "raw_content": "Niger Please",
                "author": "Deplorable556"
            },
            {
                "raw_content": "As long as that means they can not travel here, I am glad for it. We don't need any more retarded, inbred, raghead, dress wearing faggots coming to our country.",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Some people are just too far gone",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the lawyers - basically.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "\"Don't feed fingers to the animals\" is actually pretty good.",
                "author": "ThoughtCrimeConvict"
            },
            {
                "raw_content": "Imagine if you will, a warning label on a warning label: \"WARNING: Undue placement may cause undue warnings.\"",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All you need to know about Somalia here in the U.S.",
        "score": 681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Mars Attacks**",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "Funny thing is I think this fraud has been done for a long time in the USA but by a group with much higher IQ. Along comes these low IQ retards and they could not help but get caught and blow the whole thing up for all the scammers out there. Sadly our government is so bad they will all get away with it.",
                "author": "Bigdeal"
            },
            {
                "raw_content": "Somalia Attacks! Ack, ack, ack, ack, ackackackackack!!",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stop bitching and enjoy life for once, you stupid fucking idiots.",
        "score": 556,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that's cool - how about fixing the fraud and theft of the american wealth?",
                "author": "magaspif"
            },
            {
                "raw_content": "Fuck off don't tell me how to feel. No arrests, healthcare sucks ass and nobody can afford to buy anything that can actually build some value. Fuck the jews too while we're at it.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "You do know that these temporary wins can all still be reversed since election integrity hasn't been passed by Congress and Trump's executive orders haven't been codified? How about celebrating after we've won? The 4 years of Trump's first term were pretty good too before the election was stolen. Consider yourself good for the next 3 years though... after that, who knows. I'm looking more long term.",
                "author": "Will-Not-Comply"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "German woman \"stoned\" by Muslim migrants during NYE livestream in Cologne",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of the retards that held the \"immigrants welcome\" sign for their social media points",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "This is the only way leftist women learn…by shit like getting hit in the head with a rock by a koranimal just for the fun of it. Enjoy it, Eurofags. You’re on your own.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "These are the same people that voted to allow Islamic animals in.....enjoy",
                "author": "Albo22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is INSANE",
        "score": 1352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "…and maybe more criminal and treasonous",
                "author": "L74ge9wr"
            },
            {
                "raw_content": "How many people arrested so far?",
                "author": "Sea_Still"
            },
            {
                "raw_content": "And Quality Learing Center is #4 on the list.",
                "author": "Bastard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Babylon Bee: Man Achieves American Dream Of Working Hard And Paying Taxes For 50 Years So He Can Fund Fraudulent Somali Daycare Centers",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My Grandfather was fighting the Japs in the Philippines in WW2. I know he made this sacrifice so we could welcome a bunch of Islamist jugheads with open arms and pamper them with free housing and food.",
                "author": "Bongos"
            },
            {
                "raw_content": "At some point this kind of humor stops being funny.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "I don't find it funny and I hope the dam breaks soon.",
                "author": "UncleSlayton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Even the New York Times is savaging the J-1 visa program for turning a blind eye to blatant, in your face, foreign labor exploitation.",
        "score": 914,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for less-to-none 'cultural exchange' in my country. Thanks but no thanks.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "At one time I thought Swedish Au Pairs was a good idea.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Strange times when the NYTimes correctly identifies the absolute life-destroying wreckage that “legal” oligarch-mandated alphabet soup visas have brought to citizens, and the administration is doing ZERO to stop it. I can’t wait to vote every GOP scumbag out of office this year.",
                "author": "Wontgoquietly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Office of Civil Rights Looking At Racist Attorneys",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s a dude!",
                "author": "Filo76"
            },
            {
                "raw_content": "I'm getting so tired of seeing women being placed in positions of power and being absolutely corrupt.",
                "author": "ListenJack"
            },
            {
                "raw_content": "$10 says the \"investigation\" won't ultimately lead anywhere.",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Destruction of Home Computers: Disappointment PC Build 2025 - Gamers Nexus",
        "score": 497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bubble logic is very interesting - Each individual player might be spending \"reasonable\" sums, but you end up with an insane over-investment industry wide. Because everyone is trying to carve out their chunk of the new business, but you're expecting that 90% of the players would fail. Like, in an \"average\" year, google spends billions and billions in infrastructure ($32 billion in 2023, before the AI frenzy). 2025 was $85 billion: [Google's $85 billion capital spend spurred by cloud, AI demand](https://www.cnbc.com/2025/07/23/googles-85-billion-capital-spend-spurred-by-cloud-ai-demand.html?msockid=3cbd488ea3c36a17040c5e32a2726b33) For a company that does $350 billion a year in revenue, $50 billion to try and conquer a new segment that could completely upend their business is not ridiculous. But then, you have like, \\~10 major players, and a bunch of minor players. Everybody is throwing billions and billions around, and quickly, you'll end up with hundreds of billions if not trillions in total investment.",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "Like the saying goes: “you will own nothing and be happy”",
                "author": "Feisty-Soul"
            },
            {
                "raw_content": "The number of people complaining about GN videos that cover the many unfortunate news bits about PC gaming and hardware these days is becoming absurd. Some of us like to be informed about both the good *and* bad regarding topics we're interested in. If you don't, then great! Don't watch the video! However let the comment section be used for those of us that are interested and/or concerned about something we love.",
                "author": "Shogouki"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Dell set to revive XPS laptops at CES 2026",
        "score": 356,
        "text_content": "“Dell Premium” is apparently done already. XPS is back.",
        "comments": [
            {
                "raw_content": "That was a stupid move, XPS has a lot of recognition and respect. Premium is meaningless.",
                "author": "Old-Benefit4441"
            },
            {
                "raw_content": "The naming convention meant absolutely nothing, it didn't tell you anything you needed and it was vague on purpose. Xps is dells premium product lineup, people people know it, love it, rely on it and recommend it.",
                "author": "rossfororder"
            },
            {
                "raw_content": "Good. The new naming convention they came up with is outdone in stupidity only by Microsoft's Xbox lineup.",
                "author": "OddMoon7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Hardware & Software Survey: December 2025",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The data reporting is broken. AMD+Intel CPU share exceeds 100%.",
                "author": "TwoTimeHollySurvivor"
            },
            {
                "raw_content": "It’s crazy to me that after all this time the 9070 is the only AMD 9000 series card to make this list and it’s only at 0.21%. Also very surprised the 9060 series isn’t on here, they’re a pretty compelling value. Nvidia just continues to dominate.",
                "author": "Prince_Uncharming"
            },
            {
                "raw_content": "This survey is a complete mess. The total share of DX12 GPUs is 131%, and the DX8 GPUs is -32%!",
                "author": "TopSpoiler"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[der8auer] - 12VHPWR Cables Are Just Too Fragile – WireView Pro II Preview",
        "score": 236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is fun, is in the ThermalGrizzly, there are already multiple posts from people who have received them saying they are getting imbalance warnings on what they thought were perfectly working GPU connections...",
                "author": "P_H_0_B_0_S"
            },
            {
                "raw_content": "If you don't watch the whole thing, check out [this part](https://youtu.be/5oYJn1yTUXE?si=VPMu4xpXbgLBjBSA&t=628). He can greatly change the current balance just by wiggling some cables a bit. This problem is not user error, it's Russian roulette when plugging the cable in.",
                "author": "advester"
            },
            {
                "raw_content": "I find the product very interesting and hope people realizes how flimsy and precarious are the 12VHPWR connectors. I'm expecting very good sales. Nvidia should finally take this problem on account and, at least, release the soon-to-be SUPER editions with improved connectors, old trusted connectors or some hardware monitoring solution.",
                "author": "gAt0"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Arrival of CHEAP 10GbE Realtek RTL8127 NIC Review",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time for everyone to upgrade their homelab. Everyone does have a homelab, right?",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Did they actually measure the power draw? That's huge heatsink for \"2-3W\". 10GbE isn't exactly known for power efficiency.",
                "author": "dsoshahine"
            },
            {
                "raw_content": "Apparently 10G cards with an x1 connector were very hard to find?",
                "author": "YairJ"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[PixelPipes] GeForce 6200: A Needlessly Comprehensive Video",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had the GDDR version of this, and it could easily with a bios flash and overclock be upgraded to a much more expensive 6600 (extra shader units or something enabled). Those were times when overclock actually had a huge impact (like 50% or so). Played BF2 for a long time with that. Of course with the cool Zalman cooler [https://www.quietpc.com/images/products/vf700-cu-led.jpg](https://www.quietpc.com/images/products/vf700-cu-led.jpg)",
                "author": "Wrong-Historian"
            },
            {
                "raw_content": "AFAIK TurboCache was only useful in windows XP, after that (Vista?) it became the default behavior for any graphics cards, windows allocates ram as vram if needed",
                "author": "CaapsLock"
            },
            {
                "raw_content": "GT6200 \"TurboCache\" was kind of an interesting take on discrete graphics. It was just a bit *too* ahead of its time. I wonder what would happen if they added two DDR5 slots on the back of the GPU, hooked them up to a dedicated memory controller, and used them as a sort of “TurboCache 2.0,” or at least as a 'spillover memory tank,' kind of like the GTX 660 with a 128+64-bit bus, or, more infamously, the GTX 970 with its 224+32-bit bus. They can also just slap an LPDDR5X chip or two, which is probably a bit more reasonable than having DIMM slots at the back of the GPU!",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Speculative execution vulnerabilities--confusion on why they actually work",
        "score": 6,
        "text_content": "I was reading [this article](https://www.raspberrypi.com/news/why-raspberry-pi-isnt-vulnerable-to-spectre-or-meltdown/) on how Spectre and Meltdown worked, and while I get what the example code is doing, there is a key piece that I'm surprised works the way it does, as I would never have designed a chip to work that way if I'd been designing one. Namely, the surprise is that an illegal instruction actually *still executes* even if it faults. What I mean is, if w = kern_mem[address] is an illegal operation, then I get that the processor should not actually fault until it's known whether the branch that includes this instruction is actually taken. What I *don't* see is why the w register (or whatever \"shadow register\" it's saved into pending determining whether to *actually* update the processor state with the result of this code path) still contains the *actual value* of kern\\_mem\\[address\\] despite the illegality of the instruction. It would seem that the output of an illegal instruction would be undefined behavior, especially since in an actual in-order execution scenario the fault would prevent the output from actually being used. Thus it would seem that there is nothing lost by having it output a dummy value that has no relation to the actual opcode \"executed\". This would be almost trivial to do in hardware--when an instruction faults, the circuit path to output the result is simply not completed, so this memory fetch \"reads\" whatever logic values the data bus lines are biased to when they're not actually connected to anything. This could be logical 0, logical 1, or even \"Heisen-bits\" that sometimes read 0 and sometimes 1, regardless there is no actual information about the data in kernel memory leaked. Any subsequent speculative instructions would condition on the dummy value, not the real value, thus only potentially revealing the dummy value (which might be specified in the processor data sheet or not--but in any case knowing it wouldn't seem to help construct an exploit). This would seem to break the entire vulnerability--and it's possible this is what the mitigation in fact ended up doing, but I'm left scratching my head wondering why these processors weren't designed this way from the start. I'm guessing that possibly there are situations where operations are only *conditionally* illegal, thus potentially leading to such a dummy value actually being used in the final execution path when the operation is in fact legal but speculatively mis-predicted to be illegal. Possibly there are even cases where being able to determine whether an operation IS legal or not itself acts as a side channel. The authors of that article say that the real exploit is more complex--maybe if I knew the actual exploit code this would be answered. Anyway, can anyone here explain?",
        "comments": [
            {
                "raw_content": "> What I don't see is why the w register (or whatever \"shadow register\" it's saved into pending determining whether to actually update the processor state with the result of this code path) still contains the actual value of kern_mem[address] despite the illegality of the instruction. It doesn’t, but it’s loaded from memory and into the cache system, as this is the only way for memory values to make it into the CPU. Once the CPU finds out that the instruction shouldn’t be executed, of course nothing is loaded into any register. But the caches are still affected.",
                "author": "nicuramar"
            },
            {
                "raw_content": "I believe the point is that the processor doesn't know reading that address was illegal until after it was already finished. That's why the load actually took place, not your junk load. The designers thought they could then clean it up as if the load didn't happen. But traces were still left behind that could be carefully read through repeated tries and statistical analysis. Speculative execution is all about doing things out of order, then cleaning it up as if it was in order.",
                "author": "advester"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Building Our Office Storage for the NVIDIA GB10 Agent AI Cluster",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "200 Gbps throughput and it costs 2000 US$ per switch. Not gonna see them near my home server anytime soon.",
                "author": "malisadri"
            },
            {
                "raw_content": "They really invested a good chunk of money, especially since they'll be outdated in a couple of years",
                "author": "Slasher1738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So long, Doug Bowser",
        "score": 583,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It feels sort of like he just got here. I didn't dislike him or his era at all, it just felt like he didn't really do a ton that made it distinctly his era, ya know? He's sort of \"The guy with the cool name who came after Reggie\" to me. I wish him the best though and appreciate the work he did.",
                "author": "final-girls"
            },
            {
                "raw_content": "https://preview.redd.it/4ngokkqhevag1.png?width=957&format=png&auto=webp&s=ce9d36e0f688a031a87f8983250715c5037a69ed Time for a deserved vacation Bowser.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "I want a ceo who stands up for consumer like Reggie. I don’t need them to be super charismatic, but I need them to work with us.",
                "author": "Front-Library5781"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Crazy that this happened a whole year ago",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm happy that I remember that \"era\" of this sub.",
                "author": "LightWarrior71"
            },
            {
                "raw_content": "THAT'S how the water buffalo thing started? I just checked in one day and everyone was making water buffalo comments and I had 0 idea why. It's weird to be there around that time but not know wtf is going on lol",
                "author": "FruitJuice617"
            },
            {
                "raw_content": "\"Depsite everything, it's still you\"",
                "author": "PeepsRebellion"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yoshi-P: \"Please look forward to Final Fantasy 14 on Switch\"",
        "score": 553,
        "text_content": "Source: http://blog.livedoor.jp/umadori0726/archives/62900051.html As part of his new year messages.",
        "comments": [
            {
                "raw_content": "Fine. I’ll buy FFXIV on yet another platform.",
                "author": "General_Boredom"
            },
            {
                "raw_content": "I stopped playing it on the Steam Deck because logging in with a complex password and 2FA every time was a slog. The game itself runs fine. So if they solve the login stuff, I’ll consider rebuying the game on Switch 2.",
                "author": "Historical-Cell-6790"
            },
            {
                "raw_content": "I may be alone when I say this, but I really want Final Fantasy 16 on Switch 2. PC handhelds struggle with that game, I need an optimized Switch 2 version with DLSS support.",
                "author": "Theman457"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The first half of 2026 is STACKED, but not by Nintendo themselves.",
        "score": 67,
        "text_content": "Every month at least until June there is another big game dropping for Switch 2 that I want to pick up. January - FF7 Remake. Yes I already played this on PS5, but it’s a banger and I’m perfectly happy to double-dip for less than $50. February - DQ7 Reimagined. I still haven’t beaten DQ11 yet, nor I have I picked up 1-3 HD2D remakes…but this looks fantastic. I may spend the next month binging DQ11 to clear it from my backlog and get ready for this one. Also February - Resident Evil Requiem. I’ve only played the first section of Resident Evil 0 before but I’m really interested in this one. I love the new female protagonist, and Leon Kennedy looks cool too. Being able to swap between two completely different play styles depending on whose arc you’re following sounds really interesting. This may be the game that finally gets me into RE properly, although I may not get it quite at launch if I decide to catch up with the rest of the series first. March - MHS3: Twisted Reflection. Just seeing this one revealed at the Switch 2 direct last summer instantly made me interested in Monster Hunter as a franchise. I bought the digital bundle for the first two games on sale, and they’re fantastic. I also bought World and Wild for PS5, but honestly I love the turn-based combat in the Stories games much more than the real-time combat in the mankije games. And this one looks even better than the first two. Can’t wait. April - Pragmata. I was not expecting this game to suddenly be announced for Switch 2 at TGA but now that it has been I definitely want to pick it up. I might have still gotten it on PS5 eventually, but I’m very interested to see how Capcom pulls this off. The game looks stunning, and the gameplay looks engaging with an interesting story on top of that. May - 007 First Light. I haven’t played a James Bond game since Goldeneye on the N64, but I like the Uncharted-esque exploration, combat, and puzzle-solving that this one seems to have. It’s probably the closest we’ll ever get to having Uncharted on Switch unless Sony decides to port over Golden Abyss or something, so I’m down to give it a try. The recent developer comments about the game and how they’ve chosen to portray James Bond are concerning, but I’m going to try to keep an open mind for at least a while longer. Meanwhile, the only first-party Nintendo games coming out next year that I have any interest in are Splatoon Raiders and Fire Emblem: Fortune’s Weave, whose release dates are unconfirmed. I’m guessing Splatoon will drop in the summer, maybe in June, whereas Fire Emblem will be in the fall, to serve as both the big holiday release and Nintendo’s submission for GOTY. During the Game Cube, Wii and Switch 1 eras, people got used to Nintendo consoles being carried by first party-titles, but in the Switch 2 era this is clearly changing. Nintendo is spending more time developing its games and allowing third parties to fill in the time in between. This is what Sony has already been doing for years, except that unlike Sony Nintendo has actually put out quality content that made the wait feel worth it. I think this strategy will work out well for them in the long run. Going forward, I will only get a game on PS5 or Xbox if there’s no chance of it coming to Switch 2 at any point in the foreseeable future (i.e., Sony exclusives). Otherwise, I can just wait for the Switch 2 version to eventually come out a few months later, assuming it isn’t already released day and date, which a lot of games are starting to be nowadays. It’s never been a better time to be a Nintendo gamer.",
        "comments": [
            {
                "raw_content": "Which is entirely fine and arguably the \"use“ of 3rd party games on a console. Still, a new Mario Tennis, a new Yoshi and probably even a new Fire Emblem before the first year of its lifetime is over, are pretty good. And we most likely also don’t know everything already, so….",
                "author": "skylu1991"
            },
            {
                "raw_content": "I'm interested in Pokopia, Mario Tennis and Indiana Jones. I'm curious to see how the port of 007 holds up.",
                "author": "kookalamanza"
            },
            {
                "raw_content": ">Meanwhile, the only first-party Nintendo games coming out next year that I have any interest in are Splatoon Raiders and Fire Emblem: Fortune’s Weave You having interest in just those two, doesn't mean Nintendo is not releasing anything else in the first 6 months.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Let's play a game called 'Can you spot when the NS2 was released?'",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What do you use to track that?",
                "author": "Lakster37"
            },
            {
                "raw_content": "what happened in november though",
                "author": "killmealreadyyyyy"
            },
            {
                "raw_content": "This looks a lot like a graph of my bank account.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Limited Run Games Will Start Thier Switch 2 Physical Releases In 2026",
        "score": 195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And they’ll get around to shipping out those physical games sometime in 2027…",
                "author": "MegaDitto13"
            },
            {
                "raw_content": "Order this year, get them in 2028…",
                "author": "CrimsonGear80"
            },
            {
                "raw_content": "What do you reckon is in their switch 2 pipeline?",
                "author": "notevenstevens224"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How was everyone’s first year (well half a year) with Switch 2? I had a blast",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just got a switch 2 a few days ago. Haven’t had a Nintendo console since the Wii. So I am enjoying a ton of games I missed out on",
                "author": "MrPossibilityX"
            },
            {
                "raw_content": "I forgot about Beyond Good and Evil being on Switch. I had it on GameCube and was never able to finish it due to a bug where sometimes the game would freeze on the language select screen. It’s on sale now so even better!",
                "author": "TaurusPeak"
            },
            {
                "raw_content": "I got mine just before Xmas. 1st Nintendo console since the GameCube and never owned a Nintendo handheld before. I’m experiencing for the first time, Breath of the Wild, Mario Odyssey plus DK Bananza.. and some old Gamboy and GameBoy Advance classics as well as reliving some N64 , GameCube and SNES classics I love this thing. It’s right up there with my PS Portal, and will probably surpass it at some point",
                "author": "CtrlShiftAaron"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game is now 39,99€ on e-shop. Would you recommend it?",
        "score": 64,
        "text_content": "Hi guys, I’ve heard controversial things about this game. Do you think it’s worth getting for 39,99€ on Switch 2? I’ve enjoyed both Super Mario RPG and Paper Mario TTYD but I’m unsure about this one. Thanks and happy near year!",
        "comments": [
            {
                "raw_content": "I had a great 25 hours with it. Then another 15 hours where I just wished it would end. But in general there fun to be had. It’s just super simplistic and hand holdy.",
                "author": "hustladafox"
            },
            {
                "raw_content": "My biggest issue with this is PACING. There’s a lot I like but my God the game progresses at a Glacial pace. It feels like it takes forever to really get going and then you get to what you think is the end and it…just…keeps…going. I often compare this to Dragon Quest VII. I like the game and setting but it goes on for waaay too long. Brothership is the DQVII of Mario RPGs",
                "author": "slashingkatie"
            },
            {
                "raw_content": "I was massively let down by it lol",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PlayStation 5 ROM keys leaked — jailbreaking could be made easier with BootROM codes",
        "score": 768,
        "text_content": "https://www.tomshardware.com/video-games/playstation/playstation-5-rom-keys-leaked-jailbreaking-could-be-made-easier-with-bootrom-codes",
        "comments": [
            {
                "raw_content": "What an ass article. Five paragraphs rephrasing the same two sentences worth of information in different ways.",
                "author": "AwesomePossum_1"
            },
            {
                "raw_content": "I’m very curious to see if someone could actually port RPCS3, PCSX2, and DuckStation to the PS5 to make it “backwards compatible” with all generations of PlayStation home consoles. Would be even cooler if they somehow got it to work with PS1-3 physical discs.",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "Huge if true. Last time this happened, the PS3 got open wide, CFW happened, and pírates had the time of their lives playing unreleased games, sometimes a week+ before release.",
                "author": "Orelha3"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "An February 2008 prototype build of Spore is being leaked by hidden palace",
        "score": 249,
        "text_content": "On January 1st 2026, hidden palace shown a stream of a February 2008 prototype build of Spore, serving a \"missing link\" between the final version of Spore and Spore Creature Creator, this build has debugging tools, and a bunch of content leftover from promotional material and early builds of Spore dating far back as GDC 2005 (Aquatic stage, City Stage, early creatures, and etc.). Sources: [Hidden Palace page for this build](https://hiddenpalace.org/Spore_(Feb_19,_2008_prototype)) [Livestream](https://www.twitch.tv/videos/2658546802)",
        "comments": [
            {
                "raw_content": "The lack of a real spore sequel is insane to me",
                "author": "EntrepreneurNice4994"
            },
            {
                "raw_content": "Still got a CD with the Creature Creator that they handed out as promo in a shopping mall when I was little!",
                "author": "kartoffelbiene"
            },
            {
                "raw_content": "This game has an entire wikipedia page about its development, and now we're gonna see more? I wonder how much will be left over from the early stages",
                "author": "AcrobaticCarpet5494"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A new website for Prince of Persia: The Sands of Time has been registered and updated recently.",
        "score": 290,
        "text_content": "https://www.reddit.com/r/PrinceOfPersia/s/ngVozUl3TT Seems like Tom Henderson is right about it being released before Black Flag",
        "comments": [
            {
                "raw_content": "If only they could show it now…",
                "author": "Rubssi"
            },
            {
                "raw_content": "My unlikely prediction is that Ubisoft will be a guest at the Xbox Developer Direct this year and it will be shadow-dropped digitally. Maybe even as part of Game Pass.",
                "author": "OrangeLightning7895"
            },
            {
                "raw_content": "Curious to see what this is like. The first reveal in 2020 was rightfully trashed because the graphics looked like a mid-gen PS3 game, but revamping the graphics alone wouldn't take 5 years. Wonder how much new content they're adding to it.",
                "author": "vashthestampede121"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shpeshal Nick Shares Potential Info on the Next Legend of Zelda Game",
        "score": 185,
        "text_content": "https://www.youtube.com/live/CI8dpwlLOB4?si=6BrlEfFZzRz7sjj8 Timestamp: 1:22:54 -Same engine with enhancements -\"Staying in that same track of breath of the wild & tears of the kingdom\" -A lot of puzzle solving is cross dimensional, so a charging bull could be chasing you in one dimension, and it hits a target to activate something in your dimension -Use your new powers to \"jump over\" dimensions and open tears in reality and merge puzzle bits in different realms -Described as \"Tears in reality\" though unsure if it's tears like teardrop, or tearing through paper -Doesn't know a release date but assuming it's years away Notes: Jeff Grubb is present, but doesn't have any info about this game Jon & Jesse really hate when Nick's rumors are referenced as \"Xbox Era Reports,\" so consider \"Shpeshal Nick Reports\" instead if you make an article or post about this info",
        "comments": [
            {
                "raw_content": "Sounds made up",
                "author": "Lost-Cockroach-684"
            },
            {
                "raw_content": "New year new bullshit from Nick.",
                "author": "LinkedInParkPremium"
            },
            {
                "raw_content": "Unless there is a western codev studio there is no chance in hell anyone in the west gets leaks of this game this early.",
                "author": "soliddd7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloober Team trademarks “Onyx: The Dark Grip”",
        "score": 288,
        "text_content": "https://euipo.europa.eu/eSearch/#details/trademarks/019026286 Could this be related to the teased announcement?",
        "comments": [
            {
                "raw_content": "They're pumping games out quick, SH2R/Cronos and this in 3 years is insane",
                "author": "Connect_Base_217"
            },
            {
                "raw_content": "It’s nice to see a dev so laser focused on wanting to make cinematic horror games. I feel like resident evil, as a major benchmark franchise, discourages devs to make modern horror games anymore because of how huge the gap is",
                "author": "skpom"
            },
            {
                "raw_content": "The question is which project is this? Is this the multiplatform one or the Nintendo exclusive one",
                "author": "Howerev"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PC Build Questions, Purchase Advice and Technical Support Megathread — Q1 2026 Edition",
        "score": 18,
        "text_content": "Welcome to the r/AMD Q1 2026 PC build questions, purchase advice and technical support megathread — if you need help with a purchasing decision, have a PC build question or require technical support, **please read this post in full, as many of the most common issues can be resolved trying the steps outlined in this post or visiting one of the linked websites, subreddits or forums below.** Remember that this subreddit **is not** a technical support, purchase advice or PC building help subreddit. r/AMD is community run and does not represent AMD in any capacity unless specified — there is no guarantee anything posted in this thread or subreddit will be seen by AMD. If you want your issue to be seen by AMD employees, please visit the [AMD Community](https://www.amd.com/en/site-notifications/community-updates.html) or contact [AMD Support](https://www.amd.com/en/support.html) directly. If you've **found a bug and want to report it**, use the [AMD Bug Report Tool](https://www.amd.com/en/resources/support-articles/faqs/AMDBRT.html) and include as much information as possible, AMD can't fix something unless they know it exists and have enough information to reproduce the problem. The [AMD Community](https://discord.com/invite/012GQHBzIwq1ipkDg) and [AMD Red Team](https://discord.com/invite/k4wtjuQ) Discord servers are also available to ask questions and get assistance from other AMD users and PC enthusiasts. The [subreddit wikipedia](https://www.reddit.com/r/Amd/wiki/index) is also available and contains answers to common questions, troubleshooting tips, how you can check if your PC is stable, a jargon buster for FSR, RSR, EXPO, SAM, HYPR-RX and more. AMD Support also has many solutions and troubleshooting guides you may find helpful: * [AMD Software Help Center](https://www.amd.com/en/support/graphics/software.html) * [Troubleshooting Tips for Resolving System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/TS-TIPS.html) * [Troubleshooting System Stability Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS2.html) * [Troubleshooting Common Boot Failures](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS1.html) * [How to Troubleshoot Power Supply Issues](https://www.amd.com/en/resources/support-articles/faqs/GPU-104.html) * [Troubleshooting CPU Performance and Temperature Issues](https://www.amd.com/en/resources/support-articles/faqs/PIBRMATS3.html) * [Information About PCIe Riser Cable and Extender Compatibility with PCIe Gen 4.0 Desktop Systems](https://www.amd.com/en/resources/support-articles/faqs/PA-270.html) **You may also want to consider the following subreddits, websites and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response**. --- r/AMDHelp: Welcome to /r/AMDHelp! In this subreddit, we discuss, troubleshoot, and share knowledge relating to AMD and their hardware and software products on all supported platforms. [PCPartPicker](https://pcpartpicker.com/): PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc: Planning on building a computer but need some advice? This is the place to ask! /r/buildapc is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace: Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubt one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform there exists. The Personal Computer. [OBS (Open Broadcaster Software) Forums](https://obsproject.com/forum/): Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking: All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC and help others! r/techsupport: Stumped on a tech problem? Ask the community and try to help others with their problems as well. [ASRock Forum](https://www.asrock.com/support/forum.asp): Wanna discuss or find out something for your ASRock products? Come and get in ASRock worldwide forums to chat with ASRock global users! [ASUS Republic of Gamers (ROG) Forums](https://rog-forum.asus.com/): Discuss and discover the best ways to make the most out of your ROG gear. [MSI Global English Forum](https://forum-en.msi.com/index.php): Need more people to discuss with? Click here to find help. r/buildapcforme: A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops: Definitive hub for gaming laptop enthusiasts—insights, reviews, news, expert advice, and latest trends. r/SuggestALaptop: A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. --- If you are having an issue with or need to raise an RMA for a product not directly from AMD, you may want to consider contacting the manufacturer of your laptop, graphics card, motherboard or system. Below we have linked the support pages for the most common brands and manufacturers that sell AMD graphics cards, motherboards and systems. --- [XFX Support](https://www.xfxforce.com/support/contact-us) [SAPPHIRE Customer Service](https://support.sapphiretech.com/Default.asp?lang=eng) [PowerColor Service Support](https://www.powercolor.com/contact.htm) [MSI Service And Support](https://www.msi.com/support) [Gigabyte Support Services Center](https://www.gigabyte.com/Support) [ASRock Support](https://www.asrock.com/support/) [ASUS Support](https://www.asus.com/support/) [Dell/Alienware Support](https://www.dell.com/support/home/) [HP Customer Support](https://support.hp.com/) [Lenovo Technical Support](https://support.lenovo.com/) [ACER Support](https://www.acer.com/support) --- # READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes, hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, **please read and try the following before making a post** — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order, if a step has already been performed or is not relevant, please move to the next step. * If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet and any switches on the wall outlet and/or power supply are in the ON position. It's also worth check your front panel connectors to make sure they are connected properly and trying a different wall outlet. * If you have any power related issues, like your system not starting, shutting down, sleeping, restarting or waking from sleep, try to test with another power supply, as unstable voltages, such as on the 12V, 5V, 5VSB and 3.3V rails can cause a myriad of issues that can be inconsistent and hard to diagnose. * Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard or system manual. * If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers or buttons you can use, please consult your motherboard or system manual on how to clear the CMOS. * If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. * Make your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which allows you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual as the BIOS flashback procedure will very depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. * If you are using an AMD Radeon RX 6000, RX 7000, RX 9000 or NVIDIA GeForce RTX 30, RTX 40 or RTX 50 GPU, please ensure you are using separate 6 - 8pin PCIe cables or dedicated 12VHPWR/12V-2x6 cables and not using daisy-chained or splitter cables, as these may not be able to supply adequate power to the GPU. Please consult your GPU and PSU manual for information on how to correctly connect your GPU. * Make sure your Monitor or TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor or TV and if you are using any HDMI or DisplayPort adapters, converters or splitters, remove these and use a direct connection, try switching between HDMI and DisplayPort and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. * Make sure you are running the latest software updates for your operating system, games and applications. * Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware and other unwanted software can cause crashes, freezes, hangs and other performance, security, stability and compatibility issues. * Make sure you are running the latest [AMD Chipset or Graphics Drivers](https://www.amd.com/en/support/download/drivers.html). Some devices, such as laptops and handhelds may have custom hardware IDs or other changes, in which case, you may have to download drivers from the manufacturer support page. * If you need to reinstall GPU drivers, we recommend using the [AMD Cleanup Utility](https://www.amd.com/en/resources/support-articles/faqs/GPU-601.html) or [Display Driver Uninstaller (DDU)](https://www.wagnardsoft.com/display-driver-uninstaller-DDU-) to perform a clean installation of the GPU drivers, a guide on how to use DDU can be found [here](https://docs.google.com/document/d/1xRRx_3r8GgCpBAMuhT9n5kK6Zse_DYKWvjsW0rLcYQ0/edit) * If Windows Update is replacing your GPU drivers (example of what that looks like [here](https://imgur.com/a/DLLMZ3L)) please [view the following thread](https://www.reddit.com/r/Amd/comments/1hdjxba/guide_how_to_resolve_windows_update_installing/) on the steps you can take to resolve and prevent this happening in future. * If you are on Windows 10 or Windows 11 and experience flickering, stuttering or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this [thread](https://www.reddit.com/r/Amd/comments/yvyqc7/disabling_multiplane_overlay_mpo_fixed_all/). * If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through [Steam](https://help.steampowered.com/en/faqs/view/0C48-FCBD-DA71-93EB), [Epic Games Store](https://www.epicgames.com/help/en-US/c-Category_EpicGamesStore/c-EpicGamesStore_LauncherSupport/how-do-i-verify-game-files-in-the-epic-games-launcher-a000084923#:~:text=Find%20the%20game%20in%20your,Click%20the%20Verify%20button), [Ubisoft Connect](https://www.ubisoft.com/en-us/help/connectivity-and-performance/article/verifying-game-files-in-ubisoft-connect-pc/000060529), [EA App](https://answers.ea.com/t5/EA-Services-General-Questions/How-to-verify-game-files-of-installed-games/m-p/6578960), [GOG Galaxy](https://support.gog.com/hc/en-us/articles/360003930017-My-game-data-is-corrupt-How-can-I-repair-my-game), [Battle.net](https://battle.net/support/article/7655) or whichever game client you are using. * If a program is crashing, freezing, not starting, performing poorly or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. * If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values, this can be checked under Control Panel > System and Security > Power Options. * Make sure you are using the latest BIOS, Firmware and Drivers for your motherboard, laptop, desktop and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features and improve compatibility and interoperability. * If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: **revert everything to stock clocks, timings, voltages and settings**, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or similar variation. If you are using other utilities like MSI Afterburner or Ryzen Master, you may also have to restore default settings in those utilities as well. * If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them, a guide is available [here.](https://docs.google.com/document/d/1Y7HOS6UiOBXAWtNFBJ0w70f14izRQcBYD9puuSw6Ghs/edit?usp=sharing) * If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the *below PSU calculators* and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. * PSU Calculators: [FSP](https://www.fsplifestyle.com/landing/calculator.html) — [Cooler Master](https://www.coolermaster.com/power-supply-calculator/) — [Seasonic](https://seasonic.com/wattage-calculator) — [Newegg](https://www.newegg.com/tools/power-supply-calculator/) — [be quiet!](https://www.bequiet.com/en/psucalculator) — [MSI](https://www.msi.com/power-supply-calculator) — You can also add all your components into [PCPartPicker](https://pcpartpicker.com/list/) and it will provide an estimate wattage. * Try and apply common sense to an issue, for example if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, DIMM slot on the motherboard or pins, have you tried reseating it etc... * If you experience crashes, freezes, unexpected shutdown or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that **just because your system turns on, doesn't make it stable** and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. --- [OCCT](https://www.ocbase.com/occt/personal) — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing, varying GPU loads, and much more. [Prime95](https://www.mersenne.org/download/) — Prime95 has been a popular choice for stress / torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. [AIDA64 Extreme](https://www.aida64.com/downloads/latesta64xe) — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. [Furmark 2](https://geeks3d.com/furmark/downloads/) — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. [MSI Kombustor](https://geeks3d.com/furmark/kombustor/downloads/) — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting edge 3D APIs such as OpenGL or Vulkan. [MemTest86](https://www.memtest86.com/download.htm) — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. [MemTest86+](https://memtest.org/) — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium class or later 32-bit or 64-bit x86 CPU. [SeaTools](https://www.seagate.com/support/downloads/) — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. --- For more advanced SSD/HDD diagnostic utilities, please check the website of your SSD/HDD manufacturer, as they usually offer manufacturer specific software to check the health of the drive and update drive firmware, some examples include [Samsung Magician](https://semiconductor.samsung.com/consumer-storage/magician/), [SanDisk Dashboard](https://support-en.sandisk.com/app/answers/detailweb/a_id/31759), [Western Digital Kitfox](https://support-en.wd.com/app/answers/detailweb/a_id/51537/~/download%2C-install%2C-test-drive-and-erase-using-western-digital-kitfox), [Corsair SSD Toolbox](https://www.corsair.com/downloads) and [Crucial Storage Executive](https://www.crucial.com/support/storage-executive). Some motherboards, laptops and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please **backup any important files/data** and perform a reinstall/clean install of Windows, using a USB or DVD. **Only use Windows ISO images that come directly from Microsoft.** The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft [Software Download](https://www.microsoft.com/software-download/) page and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs which modify Windows or to use 3rd party, custom or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the below template for submitting a request, the more detail you can include the better. **If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above.** *Below is an example template you could use...* **Summary of the issue**: ARC Raiders will crash if you enable Radeon Image Sharpening with Adrenalin 25.12.1, this is not an issue if you revert to the Adrenalin 25.11.1 drivers **What I've tried to solve the issue**: I have reinstalled 25.12.1 with the AMD Cleanup Utility, reset my in-game graphics settings, verified game files and tried enabling Radeon Image Sharpening again. **System specifications:** * Operating System: Windows 11 25H2, OS Build 26200.7462 (Windows Key + R and type winver) * CPU: AMD Ryzen 7 9800X3D, default settings * CPU cooler: Noctua NH-D15 G2 chromax.black * GPU: Sapphire Radeon RX 9070 XT Nitro+, default settings * Motherboard: MSI MAG X870E TOMAHAWK MAX WIFI with 7E59v5A10 BIOS * RAM: G.Skill Trident Z5 Neo RGB 32GB DDR5-6000 CL32 with EXPO enabled * Storage: 2TB WD_BLACK SN8100 * PSU: be quiet! Dark Power 14 1000W * Display: Samsung Odyssey OLED G60SD If you are using a prebuilt PC or don't know your full specifications, please include as much information as you can, e.g, HP Z2 Mini G1a workstation with an AMD Ryzen AI MAX+ PRO 395, AMD Radeon 8060S Graphics, 128GB RAM, 2TB SSD and Windows 11. Please include any logs, dump files, videos, screenshots and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling and component installation.",
        "comments": [
            {
                "raw_content": "Already seen card prices here in Canada jump 10-15% since last night. It's insane. Now is not the time to build.",
                "author": "Blue-Thunder"
            },
            {
                "raw_content": "If you're looking to do a PC build...just don't. If you NEED to do one, do it right now. It's not getting any cheaper this year.",
                "author": "ProtonCanon"
            },
            {
                "raw_content": "Here's a dumb question that would be absolutely ridiculed if I dared to create a whole thread around it. Is there any truth to my hypothesis that Play Station PC ports are likely to be relatively well-optimized for AMD GPUs, given that the Play Station 5 itself is indeed some variant of RDNA? I recently got a 9070xt and have been overall very impressed, but its achilles heel seems to be ray tracing. This isn't exactly surprising to me, as I researched my GPU options to death before buying one, and the general consensus is that Nvidia is stronger in the ray tracing department. But if I were to boot up, say, Ratchet and Clank Rift Apart, a game that supports ray tracing at 60 fps on the base Play Station 5, could I expect it to perform better than a similarly demanding game that wasn't particularly optimized for AMD hardware? It's largely hypothetical question, as I already own the GPU, am satisfied with the GPU, and of course did my due diligence before buying the GPU so I would know exactly what to expect. But I just haven't really heard much discussion of what, if any, overlap we get optimization-wise for games that were optimized first and foremost for the AMD-based Play Station 5.",
                "author": "RChickenMan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Is NYC Commercial Real Estate about to crash? I found a massive \"Phantom Vacancy\" problem.",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s like this everywhere. Boston has a very well known huge quantity of vacant lab space, but even within operating labs themselves there are often multiple floors fully vacant and being used for storage of boxed old or new equipment",
                "author": "JuliusCaesarSGE"
            },
            {
                "raw_content": "There is a YouTuber called Louis Rossman that has being reporting this for I think over 6 years and explaining how broken NY is.",
                "author": "Mr-cacahead"
            },
            {
                "raw_content": "I need to dig more into this. But currently these institutions cannot report higher vacancy or reduce rent prices on their portfolios without triggering a huge revaluation of their books. On topic of rents in residential side we seen huge teaser rates or months of free rent deals offered to tenants to keep rent prices high on their books..",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit 2025 low as homebuyers catch a break",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmao 0.2% stop with these articles.",
                "author": "VA_Murse"
            },
            {
                "raw_content": "Breaking news today, mortgage rates are at a 2026 low",
                "author": "fkthisjob14"
            },
            {
                "raw_content": "Looked into refinancing and the refi rates are higher than the 5.375 I’m currently paying…..",
                "author": "w1ngzer0"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How is this ok? And how is no one talking about it??",
        "score": 439,
        "text_content": "How the hell is grok undressing women on the twitter TL when prompted by literally anyone a fine thing or.. just how is this not facing massive backlash can you imagine this happening to normal people?? And it has and will more.. This is creepy, perverted and intrusive! And somehow not facing backlash",
        "comments": [
            {
                "raw_content": "There's laws against revenge porn, deepfakes that kind of stuff. The laws are there. The regulation is there. No one is actually enforcing them. If no one enforces the law, what's it worth.",
                "author": "Elvarien2"
            },
            {
                "raw_content": "This seems like it’s one celebrity noticing this away from a big news story In any sane world it would kill an app, it’s the AI equivalent to a sexual crime",
                "author": "moanysopran0"
            },
            {
                "raw_content": "As outrageous as it feels, this has been possible since the early days of diffusion models. Even before that, deepfakes have been easy to make for years because publicly accessible repos have lowered the barrier to entry. There are hundreds, if not thousands, of ComfyUI pipelines built specifically for this, including ones for video. Yes, grok has made it even more accessible, but I don't think it's a phenomenon we can realistically stop. At this point, the only real option is to learn to live with it",
                "author": "Sarithis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Flash tops the new “Misguided Attention” benchmark, beating GPT-5.2 and Opus 4.5",
        "score": 134,
        "text_content": "We are entering 2026 with a clear **reasoning gap**. Frontier models are scoring extremely well on STEM-style benchmarks, but the new **Misguided Attention** results show they still struggle with basic instruction following and simple logic variations. **What stands out from the benchmark:** **Gemini 3 Flash on top:** Gemini 3 Flash leads the leaderboard at **68.5%**, beating larger and more expensive models like GPT-5.2 & Opus 4.5 **It tests whether models actually read the prompt:** Instead of complex math or coding, the benchmark tweaks familiar riddles. One example is a trolley **problem** that mentions “five dead people” to see if the model notices the detail or blindly applies a memorized template. **High scores are still low in absolute terms:** Even the best-performing models fail a large share of these cases. This suggests that **adding** more reasoning tokens does not help much if the model is already overfitting to common patterns. Overall, the results point to a gap between **pattern matching** and **literal deduction**. Until that gap is closed, highly autonomous agents are likely to remain brittle in real-world settings. **Does Gemini 3 Flash’s lead mean Google has better latent reasoning here or is it simply less overfit than flagship reasoning models?** Source: [GitHub (MisguidedAttention)](https://github.com/Ueaj-Kerman/MisguidedAttention) Source: [Official Twitter thread](https://x.com/i/status/2006835678663864529)",
        "comments": [
            {
                "raw_content": "Someone needs to make a \"random shit thrown at a wall benchmark\" to measure when LLMs obviously have no sources or idea about what you are asking to but still generate highly confident nonsense.",
                "author": "TimeTravelingChris"
            },
            {
                "raw_content": "Thanks for the interesting info. Based on the title, it may seem confusing that topping a Misguided Attention list is actually a good thing. Perhaps you should state that a higher score is better.",
                "author": "Economy_Variation365"
            },
            {
                "raw_content": "So it's sort of like SimpleBench? I did notice how, when LLM is asked to pronounce each E in \"Bejeweled\", they only list three. Unless they're told to count the number of E's first and they guess correctly.",
                "author": "Profanion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla's Optimus Gen3 mass production audit",
        "score": 170,
        "text_content": "https://x.com/zhongwen2005/status/2006619632233500892",
        "comments": [
            {
                "raw_content": "Has anyone from MAGA asked why these are not being made in the USA? Like the Trump Mobile phone will be?",
                "author": "Pyroechidna1"
            },
            {
                "raw_content": "I don't understand why they plan to mass product robots that can barely move",
                "author": "adarkuccio"
            },
            {
                "raw_content": "The post shares unconfirmed supply chain intelligence on Tesla's Optimus Gen3 humanoid robot. It should be taken with a grain of salt.",
                "author": "Agitated-Cell5938"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What did Deepmind see?",
        "score": 52,
        "text_content": "[https://x.com/rronak\\_/status/2006629392940937437?s=20](https://x.com/rronak_/status/2006629392940937437?s=20) [https://x.com/\\_mohansolo/status/2006747353362087952?s=20](https://x.com/_mohansolo/status/2006747353362087952?s=20)",
        "comments": [
            {
                "raw_content": "2024 was the year of agents? We barely have agents now",
                "author": "Formal-Assistance02"
            },
            {
                "raw_content": "2024 as the year of agents is a ridiculous claim.",
                "author": "aderorr"
            },
            {
                "raw_content": "huh??? is this being sarcastic? agents in 2024? so these are failed promises",
                "author": "RedErin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Year Gift from Deepseek!! - Deepseek’s “mHC” is a New Scaling Trick",
        "score": 575,
        "text_content": "DeepSeek just dropped mHC (Manifold-Constrained Hyper-Connections), and it looks like a real new scaling knob: you can make the model’s main “thinking stream” wider (more parallel lanes for information) without the usual training blow-ups. Why this is a big deal - Standard Transformers stay trainable partly because residual connections act like a stable express lane that carries information cleanly through the whole network. - Earlier “Hyper-Connections” tried to widen that lane and let the lanes mix, but at large scale things can get unstable (loss spikes, gradients going wild) because the skip path stops behaving like a simple pass-through. - The key idea with mHC is basically: widen it and mix it, but force the mixing to stay mathematically well-behaved so signals don’t explode or vanish as you stack a lot of layers. What they claim they achieved - Stable large-scale training where the older approach can destabilize. - Better final training loss vs the baseline (they report about a 0.021 improvement on their 27B run). - Broad benchmark gains (BBH, DROP, GSM8K, MMLU, etc.), often beating both the baseline and the original Hyper-Connections approach. - Only around 6.7% training-time overhead at expansion rate 4, thanks to heavy systems work (fused kernels, recompute, pipeline scheduling). If this holds up more broadly, it’s the kind of quiet architecture tweak that could unlock noticeably stronger foundation models without just brute-forcing more FLOPs.",
        "comments": [
            {
                "raw_content": "Paper link: [arxiv.org/pdf/2512.24880](http://arxiv.org/pdf/2512.24880)",
                "author": "pavelkomin"
            },
            {
                "raw_content": "This is what I got from notebooklm. I'm not sure how accurate of an analogy it is, but I thought it was interesting: \"Traditional scaling is like building a taller skyscraper with more floors, this new dimension is like **widening the elevator shafts and corridors** to allow more people (information) to move between those floors simultaneously without needing to change the speed of the elevators themselves.\"",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "This paper is actually so huge. They cooked with this. Not even joking. What a way to enter 2026. Expect 4 to drop soon haha.",
                "author": "amandalunox1271"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The AI paradigm shift most people missed in 2025, and why it matters for 2026",
        "score": 28,
        "text_content": "There is an important paradigm shift underway in AI that most people outside frontier labs and the AI-for-math community missed in 2025. The bottleneck is no longer just scale. It is verification. From math, formal methods, and reasoning-heavy domains, what became clear this year is that intelligence only compounds when outputs can be checked, corrected, and reused. Proofs, programs, and reasoning steps that live inside verifiable systems create tight feedback loops. Everything else eventually plateaus. This is why AI progress is accelerating fastest in math, code, and formal reasoning. It is also why breakthroughs that bridge informal reasoning with formal verification matter far more than they might appear from the outside. Terry Tao recently described this as mass-produced specialization complementing handcrafted work. That framing captures the shift precisely. We are not replacing human reasoning. We are industrializing certainty. I wrote a 2025 year-in-review as a primer for people outside this space to understand why verification, formal math, and scalable correctness will be foundational to scientific acceleration and AI progress in 2026. If you care about AGI, research automation, or where real intelligence gains come from, this layer is becoming unavoidable.",
        "comments": [
            {
                "raw_content": "Has it truly gotten much better in the last month or is that hype? It feels like it, but how does a layman judge its advancements?",
                "author": "Background-South3815"
            },
            {
                "raw_content": "ai written post",
                "author": "snewk"
            },
            {
                "raw_content": "Very interesting and helpful. Thank you very much for sharing. May I ask what you think about the shift in job market in the next 5-10 years? I personally think that any job which demands a high level of personal accountability (such as that of an airline pilot, nuclear plant security, chief editor, CEO, or surgeon) is among the most difficult to automate, because robots and AI cannot assume responsibility for consequential failures where the stakes are exceptionally high. While current machines and AI could handle most of their tasks already, a human must ultimately be in charge. In a way, that human is taking the role of verifying the action of AI. Such positions are currently rare but I wonder if they may become more common in the near future.",
                "author": "LeKhang98"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI preparing to release a \"new audio model\" in connection with its upcoming standalone audio device.",
        "score": 210,
        "text_content": "OpenAI is preparing to release a **new audio model** in connection with its upcoming standalone audio device. OpenAI is aggressively **upgrading** its audio AI to power a future audio-first personal device, expected in about a year. **Internal teams** have merged, a new voice model architecture is coming in Q1 2026. Early gains **include** more natural, emotional speech, faster responses and real-time interruption handling key for a companion-style AI that proactively helps users. **Source: The information** 🔗: https://www.theinformation.com/articles/openai-ramps-audio-ai-efforts-ahead-device",
        "comments": [
            {
                "raw_content": "I’m excited about this. I was blown away by the 4o demo in 2024, but the released product ended up being significantly gimped, likely due to compute constraints. One thing that happened quietly, though, is that ChatGPT’s voice transcription is leagues ahead of any competitors, and it’s one of the main reasons I have trouble switching to Claude or Gemini.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "It would be amazing if they released something better than Eleven v3. Then I’ll be excited to see what Google DeepMind inevitably releases to compete with OpenAI",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "no paywall option?",
                "author": "Chaosido20"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy in 2023: AGI will mega transform society but still we’ll have “but is it really reasoning?”",
        "score": 430,
        "text_content": "Karpathy argued in 2023 that AGI will mega transform society, yet we’ll still hear the same loop: “is it really reasoning?”, “how do you define reasoning?” “it’s just next token prediction/matrix multiply”.",
        "comments": [
            {
                "raw_content": "I mean, we have had philosophers who questioned if the world was real and if we even existed. So yeah, I can imagine people having doubts about AGI.",
                "author": "Savings-Leading4618"
            },
            {
                "raw_content": "If it matrix multiplication and token prediction leads to outcomes we thought only reasoning could achieve, then why does it matter? It’s still taking your job. Not all jobs. Not yet. We don’t know if it will. But results speak for themselves, and if they do… Arguing over whether it truly reasons isn’t going to save us.",
                "author": "Cody4rock"
            },
            {
                "raw_content": "I think a lot of people just have no concept of an emergent phenomenon. The possibility that something could be a token prediction machine and also be reasoning is unfathomable to them. If you start with token prediction, then crank up the power without inserting some sort of essence of reasoning it will never become anything other than token prediction. The real versions of phenomenon are all irreducible in their minds and if you explain an emergent phenomena to them they see it as a trick, a form of mimicry, something pretending to be something it’s not.",
                "author": "Old-Bake-420"
            }
        ],
        "subreddit": "singularity"
    }
]