[
    {
        "post_name": "🇺🇸🇬🇱",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's fun watching the EU pretend like they could take on the US and Russia on two fronts",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Don't let your memes be dreams! Make it happen!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Trump's ability to take the wind out of the sails by shifting between so many topics always amazes me. A chorus of screeching.",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump says he invited Vladimir Putin to join his proposed Board of Peace and warned he could impose a 200% tariff on French wine and champagne after Emmanuel Macron said France would not participate.",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously, WTF is France going to do other than surrender?",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "US & Russia VS Globohomo lets go",
                "author": "Thermopylae_MMXX"
            },
            {
                "raw_content": "Inviting Putin to join the Board is a smart move if you want Greenland.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I had a very good telephone call with Mark Rutte, the Secretary General of NATO, concerning Greenland. I agreed to a meeting of the various parties in Davos, Switzerland. As I expressed to everyone, very plainly, Greenland is imperative for National and World Security.",
        "score": 294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To me, the bigger point is driving home the point of how strategically important Greenland is not just the US, but to the NATO members who we basically defend.",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115925766187001811",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "We could just pull a page out of the good ole jew/mudslime playbook and have our most disenfranchised/blackpilled just...start moving there until it's basically American. Shit, I don't mind the snow.",
                "author": "getup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The United States of North America",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is insane... We need to be removing Leftists from the country not annexing more of them. This would turn the USA into another European Shitlib country. Fuck that.",
                "author": "madisonmaga"
            },
            {
                "raw_content": "mike johnson is a soyboy scum cuck",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Bro, why stop there? Why not take over the South too? The United States of the Americas! I mean, hell! There are so many of these foreigners in the US as it is, we may as well just bring em into the fold.",
                "author": "RogueLeaderX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Democrats have been in power in Virginia for ~48 hours and they’ve already introduced a bill to ban the hand-counting of election ballots…”",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats are playing for keeps while deep red Republican states sit idle",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "Yeah. Hate to admit it but the are better than us. They want to win and don’t waste any time. Meanwhile we can’t even arrest people openly committing treason calling for insurrection and committing fraud",
                "author": "DahnaldTrump"
            },
            {
                "raw_content": "Tell me you're gonna steal an election without telling me you're gonna steal an election",
                "author": "K3719er"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE has deported so many in Minnesota, they are losing a congressional seat. 👍",
        "score": 1444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MOAR MOAR",
                "author": "DenturesNancy"
            },
            {
                "raw_content": "Unfortunately not enough , all of them need to be gone .",
                "author": "Systemfree1632"
            },
            {
                "raw_content": "There should be some kind of penalty for all these Sanctuary States and Sanctuary cities they should lose representation for 10 years. Their Congressman their Senators should be yanked there needs to be penalties for the states.",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One of the protesters who took over a church service and screamed \"shut it down\" works for Minneapolis's local prosecutor, is married to a St. Paul councilwoman, is running for state Senate, and runs HOMES FOR HOMIES",
        "score": 665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m gonna judge him by his character",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I thought prison was *HOMES FOR HOMIES.*",
                "author": "sum1else"
            },
            {
                "raw_content": "Well I'm sure it'll be harder to accomplish anything IF FUCKING BONDI ACTUALLY GOES AFTER THESE FAGGOTS WITH THE FACE ACT.",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michelle Obama, supposedly a woman, says she is mindful to try to avoid white-owned brands and others also should be",
        "score": 1197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The anti-white mask is now fully off. Fuck this man and his faggy husband.",
                "author": "DontTreadOnSnek"
            },
            {
                "raw_content": "The more they spew their hatred and racism the better it will be in the long run. I grew up in the 80's and 90's when we were convinced that we are all equal and deserve and equal shot at anything out there. We gave them institutional control and they decided that they didn't want equality, they wanted revenge. Well, I'm done with that shit now and I'm ready to roll back the hands of time about 70 years.",
                "author": "Danofdestiny"
            },
            {
                "raw_content": "Creating a brand new generation of racists, singlehandedly.",
                "author": "iirc_life"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Approximately 58% of protestors in the Twin Cities are from out-of-state and climbing each day, per @TonySeruga .",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THEY CROSSED STATE LINES",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "He has the means and the options to deal with this and yet he just won't do it.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "It's a federal crime to cross state lines with the intention of engaging in criminal behavior. I know Pam Blondie is as useless as a skintag, but for fucks sake this is getting old.",
                "author": "Danofdestiny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newscum's California is being instructed to return more than $1 BILLION in federal funding after an audit revealed it used massive amounts of taxpayer dollars to provide healthcare to ILLEGAL ALIENS. But I thought Democrats insisted illegals weren’t getting taxpayer-funded healthcare…. 🤔",
        "score": 1536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Pay up Ca.",
                "author": "ohpleaseuhhelpame"
            },
            {
                "raw_content": "Who cares? They are not going to pay it back and the federal government will continue sending them money. Until I see something actually happen all of these investigations and \"demands\" are never going to amount to a thing.",
                "author": "SheevP"
            },
            {
                "raw_content": "WOW commies lied??",
                "author": "Ficklepimper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump and family at College Football Playoff National Championship game in Miami",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kushner's human skin suit looks like it's slipping off of his reptilian face 🐍",
                "author": "Cuomorbidities"
            },
            {
                "raw_content": "Don't fucking care. Get your fucking DOJ to arrest someone Trump, you're becoming a damn joke on all of America with your boomer complacency, or outright complicity.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Fuck Jared Kushner",
                "author": "hackinthebox"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: The Virginia Senate democrats just passed language for a constitutional amendment to enshrine abortion up until birth in the Virginia Constitution. The amendment will appear on the ballot this fall. Voters must REJECT abortion extremism.",
        "score": 521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s going on in Virginia is what’s going to happen if the GOP doesn’t get off its ass and start passing legislation to implement the MAGA agenda we all voted for. Like, yesterday! Pass the SAVE Act…",
                "author": "TNgirl4Trump"
            },
            {
                "raw_content": "It’s amazing that within 15 min the Democrats locked the state down and got everything they wanted while Republicans can’t be bothered.",
                "author": "BasedCostanza91"
            },
            {
                "raw_content": "Guess Satan isn't getting enough of his infant blood...",
                "author": "Kpak76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Faggot Don Lemon could become the most famous negroe in history",
        "score": 1523,
        "text_content": "",
        "comments": [
            {
                "raw_content": "heh heh yeah they are missing out on a beautiful piece of irony here. oh well lol",
                "author": "magaspif"
            },
            {
                "raw_content": "I'll wait until I see the arrest......until then nothing will happen...",
                "author": "flyover_deplorable"
            },
            {
                "raw_content": "I actually saw an ad yesterday for Peacock that said, \"*Come celebrate Martin Luther King Jr with an entire day of basketball*\" 😂 I don't think they meant it to be funny, but I burst out laughing nevertheless.",
                "author": "dr_gonzo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump amplifies call to imprison Don Lemon",
        "score": 1915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In two weeks, I bet he'll finally do something.",
                "author": "PUNCHSPLOSION"
            },
            {
                "raw_content": "An abortion clinic is a leftist religious site",
                "author": "AuslanderRaus"
            },
            {
                "raw_content": "How about instead of publicly reposting this he just tells Suzy Wiles or Stephen Miller, who relays to Pam, exactly what he wants? Why create any grounds for dismissal to a defense attorney or liberal court when they are facing these 40 years in prison? Why doesn't our CIC act like he's in control? Why does he even have to lift a finger? If anything, Trump should have to look like he's restraining his rabid dog AG from disappearing and executing people. Bondi is a terrible disappointment.",
                "author": "referencevariable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Unhinged leftist who attacked an independent journalist on a Philly bus, punching and pepper spraying @FrankJScales, has been identified as Paulina Reyes, an intern at @WHYYNews.",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just slap the life out of the stupid cunt.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "Yea listen guys…your ability to defend yourself needs to be a little better than yelling “whoa whoa whoa” Might even change her behavior and life if she spent 3 months eating her meals through a straw.",
                "author": "Bigblue725"
            },
            {
                "raw_content": "Talking shit about 'islamic people' is a good thing, not a bad thing. Fuck all islamic people.",
                "author": "Seeker_17"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tiananmen Timmy was also asked about foreign ties during Harris vetting, sources tell CNN",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Awkwardly he accepted, thinking it was an offer of little Asian boys.",
                "author": "Skogin"
            },
            {
                "raw_content": "So imagine how much more corrupt PA has to be if Kameltoe went with Tampon Tim. Dems regarded the PA Gov as too much of a liability, too much of a risk. It was partly that they thought him being Jewish could be an issue with their Pro-Pal base. I did hear Dems in Philly admit to that. There was something else that they never talked about in public but seemed to understand. They knew the the pick was Tampon, and when they told me so, sagely, seemed annoyed when I lol'd uncontrollably, hooted, and said, \"That will be a gift to MAGA.\" So what is it? Ellen Greenberg's homicide coverup for a Dem donor's family member? I thought that might have something to do with it, but Dems thought not. There is something else. The other shoe is going to drop.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "He's a coward. It was his turn to deploy and he said \"fuck you\" to the troops in his battalion and retired - three of his troops were killed in action. He then lied about his rank and lied about his service. His own Battalion Chaplain called him a coward. Tim Walz is an absolute piece of shit.",
                "author": "JohnN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Amelia just dropped",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What kind of religion would hate on mans best friend?",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "It just hit me, you can't cancel this AI person like a celebrity.",
                "author": "Icepck"
            },
            {
                "raw_content": "Grok explains Amelia: Amelia is from an educational video game titled Pathways. This interactive learning tool, funded by UK authorities and developed by Shout Out UK, aims to educate young people about extremism, radicalization, and related risks as part of the government's Prevent strategy. In one segment of the game, Amelia appears as a supporting character depicted as a far-right, anti-immigration activist. She is portrayed with distinctive goth or e-girl aesthetics, including purple hair, a pink dress, and a purple sweater, and attempts to persuade the player to join her cause by expressing views critical of mass immigration and advocating for cultural preservation. Intended as an antagonist meant to illustrate the dangers of such ideologies (with \"wrong\" choices potentially leading to a simulated Prevent referral), the character unexpectedly backfired. Online communities, particularly on the political right, reclaimed Amelia and transformed her into a positive symbol - turning her into a mascot for anti-immigration sentiment.",
                "author": "CyanScales"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why you cry like a little girl?!",
        "score": 620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally, a TSA agent does something useful.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "The very first case of TSA being useful in its entire history.",
                "author": "dirtysanchez69"
            },
            {
                "raw_content": "lol fucking sack tapped the transvestite.",
                "author": "Nate_Higgersalot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😳Looks like ICE got some new Take-No-Sh*t orders. They really aren’t playing with these Liberal Karens anymore.",
        "score": 1654,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moar!",
                "author": "PvtSnowball"
            },
            {
                "raw_content": "This is what I voted for 100%",
                "author": "EastTexasMadLad"
            },
            {
                "raw_content": "I think they are still being too polite to those assholes.",
                "author": "Nachos_and_cheese"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota Attorney General Keith Ellison telling packed rooms full of people to go out and protest “Keep your hands off our Somali community — Let me tell you this. If you are a citizen and you cannot deport you, you should think about participating in some of these marches”",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's in a mosque.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": "How is this not treason?",
                "author": "new_guy3"
            },
            {
                "raw_content": "Why is he not in prison ? POS",
                "author": "LookFatty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PCMag: \"Asus Confirms It Won't Launch Phones in 2026, May Leave Android Altogether\"",
        "score": 332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Feels like gaming phones may have had sales cannibalized by dedicated gaming handhelds and ASUS didn't make much beyond that (besides the Zenfone series which was pretty solid, but I'll be damned if I ever saw a single person in the wild with one besides myself). So, not surprising.",
                "author": "RumbleTheCassette"
            },
            {
                "raw_content": "We needed a real gaming phone that has a slide in controller like the old Xperia play. These current gaming phones are just regular phones with slightly better cooling.",
                "author": "No_Figure_6287"
            },
            {
                "raw_content": "Zenfones used to be cool, but like most stuff Asus, it got enshittified a long time ago. So long!",
                "author": "EdgiiLord"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC warns Nvidia and Broadcom of capacity squeeze as AI chip demand surges",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sure Nvidia and Broadcom were very surprised to hear about it.",
                "author": "Vushivushi"
            },
            {
                "raw_content": "Was waiting for this. How long before AMD start to struggle to supply CPUs?",
                "author": "jenny_905"
            },
            {
                "raw_content": "Everyone was worried that AI was going to take away a bunch of jobs, and it might just do that through knock-on effects.",
                "author": "abbzug"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I have 3 friends who do this",
        "score": 1292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's been (checks calendar) 7+ months and I have still yet to set it up or use it on my Switch 2.",
                "author": "WashedOutWizard"
            },
            {
                "raw_content": "I forgot all about this feature, but you needs friends to utilize it, no?",
                "author": "Merk_Um"
            },
            {
                "raw_content": "I got mine on launch day and still dont think I set that up",
                "author": "tsckenny"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I just buy every game on Switch 2 despite owning a PS5 because of portability",
        "score": 423,
        "text_content": "I feel like I just can't buy anything (besides exclusives of course) on PS5 nowadays because I tend to prioritize portability over graphics/performance at this point; and the simple fact that I think I can play a game in portable mode makes me wanna buy them on S2 over PS5",
        "comments": [
            {
                "raw_content": "Yeah, being able to play on the couch while my wife watches TV is a big deal for me. I own RE7 on PS4 but I never got around to playing it. I’m going to buy it again for Switch 2.",
                "author": "AlternativeGazelle"
            },
            {
                "raw_content": "Recently picked up FFX on PlayStation for a steep discount. Regretting it because I wish I could take it on the go with me. Fully understand this take. I just wish I could get achievements is all",
                "author": "FamiliarWithFloss"
            },
            {
                "raw_content": "I'm the opposite. I buy games on Switch 2 if it's the only way it can be played.",
                "author": "Random-Posterer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 helped the Japanese Market expand up to 40%",
        "score": 64,
        "text_content": "The Switch 2 helped the Japanese Market expand up to 40% according to Nintendo wire. And that is also despite the stock shortage of the device on the Japanese Market.",
        "comments": [
            {
                "raw_content": "The stock shortage is a feature, not a bug",
                "author": "Bruhbuhdubdub"
            },
            {
                "raw_content": "Because the Switch 2 is affordable in Japan. It is not affordable in other countries.",
                "author": "dumbledwarves"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Glaciered",
        "score": 62,
        "text_content": "I heard about this game in the indie showcase back in August and I was super excited for it to come out in December or January. Since then I haven't heard a thing. Anybody else care? Has anyone heard anything?",
        "comments": [
            {
                "raw_content": "I had forgotten about this game. It looked awesome in the showcase though, hopefully it comes out soon",
                "author": "acam333"
            },
            {
                "raw_content": "The publisher's website says **February 2026** for switch 2: [https://playism.com/en/game/glaciered/](https://playism.com/en/game/glaciered/)",
                "author": "SubaruHaver"
            },
            {
                "raw_content": "It’s steam page says it’s due to come out in Q2 of 2026, dunno if it will get a period of exclusively on the switch",
                "author": "smolcharizard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MIO: Memories in Orbit is probably the next indie gem on Switch 2",
        "score": 46,
        "text_content": "Embargo is lifted and everyone so far appears to be gushing at how beautiful the game is, from gameplay to visuals and its seemingly incredible soundtrack. Running 60fps and 4K at that. This is going to be a treat.",
        "comments": [
            {
                "raw_content": "The only game not out yet announced in the June 2024 Nintendo Direct is finally releasing.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I am Metroidvania soul’d out.",
                "author": "VaughnFry"
            },
            {
                "raw_content": "Super cool. Imagine it’s asked 100x. Physical?",
                "author": "Keeko_ca"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Leon do it for the love of the game.",
        "score": 6,
        "text_content": "you have middle aged men bobbing and weaving, curb stomping, upper cutting clotheslining mutated freaks all for the love of the game. when I seen this, Leon didn't come to survive. Leon comes to run shit. heck, you might as well make resident evil 10 Leon vs Chris.",
        "comments": [
            {
                "raw_content": "lol the zombie face in the second image",
                "author": "echoess84"
            },
            {
                "raw_content": "![gif](giphy|11N0ycAEaS2AdW)",
                "author": "jpassc"
            },
            {
                "raw_content": "Oh wow, that first picture does not look good at all.😅",
                "author": "Massive_Fly_1709"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FF7 Remake Intergrade or Dispatch to play alongside Animal Crossing?",
        "score": 3,
        "text_content": "I’ve been contemplating both of these games, but I’m having a hard time deciding. I’ve never played a Final Fantasy and have heard it’s one of the best games ever, while Dispatch just looks to be a really fun time with a great cast and story. I’ve recently started playing ACNH and it’s incredibly addicting, but it’s more of a pick up and play for a good hour or so before switching to another game. What do you think would go alongside AC better?",
        "comments": [
            {
                "raw_content": "Remake if you want gameplay, Dispatch if you want story. I love both and Dispatch was my personal favorite game to come out last year, but everyone has a preference",
                "author": "gandalftheokay"
            },
            {
                "raw_content": "Flip a coin. FF7Remake and Dispatch are very different games. I'd vote FF7Remake so you can still get the pre-order bonuses. But if you want a more casual game, get Dispatch.",
                "author": "Code_Combo_Breaker"
            },
            {
                "raw_content": "I think it really depends on how invested you want to get in another game. Dispatch is a pretty breezy affair if the story really strikes you, you can finish it in a day or two. I personally got like 1-2 chapters from the end and just kind of...stopped caring about what happened next and haven't gone back to finish it. I probably should, because I liked some of what it was doing, but hated a lot of it, too. FFVII Remake is going to consume more of your time, especially depending on how much of it you choose to engage with. If you get into it and want to see all the game has to offer, it's easily a 60+ hour game. Dispatch takes about 10 to get through. Then again, if you're going to be playing ACNH primarily, something that you dive into and spend a lot of time with might not be what you're after. Hope this helps!",
                "author": "blasto2236"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MP1st]: Fable Reboot Locations Revealed via Concept Art Images",
        "score": 367,
        "text_content": "Source: [https://mp1st.com/news/fable-rebootconcept-art-showcase-locations](https://mp1st.com/news/fable-rebootconcept-art-showcase-locations) Loads of concept art from an artist feature the locations and art direction. We should see our first gameplay at the Xbox event this week.",
        "comments": [
            {
                "raw_content": "please be good please be good please be good",
                "author": "Armdel"
            },
            {
                "raw_content": "Concept art appears to insinuate there’s multiple castles and larger towns which makes me happy. In the original fable games it felt like the towns were super super small outside of Bowerstone/Farifax castle.",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "The vibe of the concept art is just perfect. Hope so much that gets properly transfered into the game. More Witchwood Lychfield Balverine drip is always better.",
                "author": "NewAd1135"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "+20 Ray Tracing, Scheduling, and other AMD patent grants and filings, hinting at future GPUs and gaming technologies",
        "score": 162,
        "text_content": "\\#1 Patent list - Ray tracing/RT, execution and payload sorting 1. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464433976](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464433976) (Fine grained context saves) 2. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464434024](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464434024) (Shader Engine HW payload coalescer) 3. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464434039](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464434039) (Enhanced resource barriers) 4. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464435335](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464435335) (Animated curved surface patches) 5. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464435300](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464435300) (Deferred any hit shaders) 6. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US464101855](https://patentscope.wipo.int/search/en/detail.jsf?docId=US464101855) (High quality animated Displaced Micro Meshes/DMMs) [Sourced from](https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/post-41521267) \\#2 Patent list - BVH related 1. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469751](https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469751) (Interpolated geometry + Dense geometry format/DGF) 2. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US470603545](https://patentscope.wipo.int/search/en/detail.jsf?docId=US470603545) (DGF + DMMs/subdivision surfaces) 3. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US470603544](https://patentscope.wipo.int/search/en/detail.jsf?docId=US470603544) (DGF without indices (implied)) 4. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469793](https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469793) (Dual use BVH for RT and collision detection) 5. [https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469794](https://patentscope.wipo.int/search/en/detail.jsf?docId=US470469794) (Mass culling/discard of BVH nodes) [Sourced from](https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/post-41554247) \\#3 Patent list - DGF + OBBs + Pre-filtering (low precision/INT-based parallel intersection testing) 1. [https://www.patents-review.com/a/20250111586-pre-filtering-nodes-bounding-volume-hierarchy.html](https://www.patents-review.com/a/20250111586-pre-filtering-nodes-bounding-volume-hierarchy.html) (DGF BVH fallback + Pre-filtering) 2. \\*[https://www.patents-review.com/a/20250131640-intersection-testing-dense-geometry-data-triangle.html](https://www.patents-review.com/a/20250131640-intersection-testing-dense-geometry-data-triangle.html) (DGF + Pre-filtering) 3. \\*[https://www.patents-review.com/a/20250131639-dense-geometry-format.html](https://www.patents-review.com/a/20250131639-dense-geometry-format.html) (DGF description) 4. [https://www.patents-review.com/a/20...w-precision-ray-intersection-accelerated.html](https://www.patents-review.com/a/20250111587-simplified-low-precision-ray-intersection-accelerated.html) (Quantized BVH data for Pre-filtering) 5. [https://www.patents-review.com/a/20250209723-system-method-low-precision-ray-tests.html](https://www.patents-review.com/a/20250209723-system-method-low-precision-ray-tests.html) (Pre-filtering) 6. [https://www.patents-review.com/a/20...s-oriented-bounding-boxes-based-platonic.html](https://www.patents-review.com/a/20250200864-discrete-rotations-oriented-bounding-boxes-based-platonic.html) (Quantized/INT-based OBBs) [Sourced from](https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/post-41490349) \\* = #2 and #3 mentioned previously by Kepler\\_L2 [here](https://www.neogaf.com/threads/mlid-ps6-early-specs-leak-amd-rdna-5-lower-price-than-ps5-pro.1686842/page-12#post-270687172) \\#4 Patent list - Work Graphs-centric scheduling 1. [https://patents.google.com/patent/US20240111574A1](https://patents.google.com/patent/US20240111574A1) (Shader Engine autonomous scheduling (WGS) and dispatch (ADC)) 2. [https://patents.google.com/patent/US12153957B2](https://patents.google.com/patent/US12153957B2) (Hierarchical work scheduling and load balancing) 3. [https://patents.google.com/patent/US20240111575A1](https://patents.google.com/patent/US20240111575A1) (WGS to Command Processor communication scheme) 4. [https://patents.google.com/patent/US20240202003A1](https://patents.google.com/patent/US20240202003A1) (Fixed-function/FF + Work Graphs) 5. [https://patents.google.com/patent/US12436767B2](https://patents.google.com/patent/US12436767B2) (Two FF pipeline modes) 6. [https://patents.google.com/patent/US20250217195A1](https://patents.google.com/patent/US20250217195A1) (WGP-level autonomous scheduling and dispatch) [Sourced from](https://forums.anandtech.com/threads/rdna-5-udna-cdna-next-speculation.2624468/post-41557682)",
        "comments": [
            {
                "raw_content": "![gif](giphy|zXA5VEmXr7OUg)",
                "author": "Cyrisaurus"
            },
            {
                "raw_content": "Ice key graphics in the next Banjo-Kazooie game will be crazy. That’s my main takeaway from this.",
                "author": "AfraidoftheLark"
            },
            {
                "raw_content": "Can someone explain this in Fortnite terms?",
                "author": "normal-dog-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon Is Releasing March 5th",
        "score": 339,
        "text_content": "Original Leak Post: https://www.reddit.com/r/GamingLeaksAndRumours/s/OlRehWevqG New Pre-Order Trailer https://youtu.be/UbNhSVj6WZM?si=7V9ijRkAPhpRZDNV",
        "comments": [
            {
                "raw_content": "**TLDW:** Standard Edition - $39.99 Deluxe edition - $59.99",
                "author": "Ph0enixes"
            },
            {
                "raw_content": "Following the discourse around this game will certainly be interesting",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Same day as Pokopia",
                "author": "HydraTower"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Faith of Danschant: Hereafter is likely cancelled",
        "score": 138,
        "text_content": "\"The answer is simple, the project was canceled. Somewhere around 2022-2023, Wangyuan Shengtang encountered a lot of problems, including budgetary, where they had to cancel several unannounced projects as well as others already shown, and I think this game was among them\" Developers moved to Swords of Legends/Gujian 4 Development after Tencent acquired them. [Source](https://need4games.ro/en/exclusive-heres-what-happened-with-faith-of-danschant-hereafter)",
        "comments": [
            {
                "raw_content": "![gif](giphy|2hgs0dO9V8Ekj8Wvfe)",
                "author": "HaydenScramble"
            },
            {
                "raw_content": "Who???",
                "author": "Lymbasy"
            },
            {
                "raw_content": "I'm all for China having a massive footprint in the gaming industry but can they do something that *isn't* a Soulslike action RPG?",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SAMSUNG confirms Panther Lake-based Galaxy Book 6 Pro price hike, about 20% more expensive than last-gen model",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn't a price hike. It is just Samsung's products division adding the cost of memory when it was previously borne by Intel. It tracks well with the rumors that their memory division doesn't want to do a supply deal with their mobile division. Intel was essentially selling Lunar Lake with the packaged memory at cost. They confirmed it themselves. This is a nothingburger, till the shortages hit when inventories run out.",
                "author": "TwoTimeHollySurvivor"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AYANEO reveals KONKR FIT gaming handheld with Ryzen AI 9 HX 470, 80Wh battery and 7-inch OLED screen",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> ... has not shared details like memory, storage, ports, cooling, weight, or display resolution and refresh rate. > Pricing and a release window have not been disclosed. -_-",
                "author": "CitricBase"
            },
            {
                "raw_content": "No vrr because OLED yay! This is stupid",
                "author": "Sorry_Soup_6558"
            },
            {
                "raw_content": "I'm guessing $1500 MSRP 😵",
                "author": "Suitable_Elk6199"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D reportedly hits 5.75 GHz with all cores",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I remember when 5GHz all core required liquid nitrogen. This is insane. Technology is cool.",
                "author": "mlydon11"
            },
            {
                "raw_content": "That doesn't seem too surprising since the 9800X3D was able to hit 5.5 all core. The whole point of the 9850X3D was that it was just a 9800X3D that tested better so it ran at higher clocks.",
                "author": "CatoMulligan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Free Housing Market Analytics Tool -- Re:Venture Clone",
        "score": 11,
        "text_content": "Over the past year a few of us have been building a free Re:Venture clone -- We believe that everybody should have insights into housing market data since for too long people have been buying and selling homes without a good fundamental market sense of the market context around their purchase. Y'all in REBubble have been some of our best supporters and our first releases to this community were super well received, its kept us motivated so we keep releasing new features. For anyone using this for the first time: a small group of us built a free housing-market dashboard using publicly available data (including many of the same sources you’ll recognize elsewhere, plus a few additions). It includes listings data, price data, rental data, demographics data, mortgage data, census data....about 100 metrics in total. We recently released historical data too, so you can see how prices have evolved for a certain zip code. If you have more feature requests, let us know! Links below: [Example Historical Data View -- Ft. Myers, FL](https://www.prop-metrics.com/zip/33901) [Interactive Dashboard -- Austin, TX](https://www.prop-metrics.com/dashboard?zipcode=78701&cbsa=12420)",
        "comments": [
            {
                "raw_content": "This is really cool, I love the 2009 crash data, super interesting",
                "author": "bostonlilypad"
            },
            {
                "raw_content": "This is really cool! I would say, it is better than reventure, which I have used a lot in the past. Thank you, you guys rock!!",
                "author": "New-Ad-9629"
            },
            {
                "raw_content": "Data metrics seem to be running behind, too much weight given on old market, not on what's been happening the last 12 months. Example for my location, 2024 was 40 days on the market, vs 63 days in 2025. Your app just says 45 days, which is not currently accurate.",
                "author": "AdNatural8250"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "World’s first megawatt-level ‘windmill’ airship rises 6,560 ft and feeds grid",
        "score": 846,
        "text_content": "The helium-lifted S2000 system uses high-altitude winds and a ducted **design** with 12 turbines to reach a rated capacity of up to 3 megawatts. Linyi Yunchuan Energy Tech,Beijing has taken a **major** step toward commercial airborne wind power after completing the maiden flight and grid-connected power generation test. During the maiden flight the system generated 385 kWh and fed it **directly** into the local grid proving real world operation not a lab demo. The system **sends power** to the ground through a tether while operating in steadier high altitude winds that traditional wind turbines cannot access. [Full Article](https://interestingengineering.com/energy/worlds-first-megawatt-airship-rises-6560-ft) **Image(Official):** world’s first MW-class S2000 airborne wind system for urban use completed a successful test flight in Yibin, Sichuan.",
        "comments": [
            {
                "raw_content": "For reference: the mean capacity of wind turbines that achieved commercial operations in 2020 is 2.75 megawatts(US) It looks cool for sure. I'm not sure how would you actually commercialize this though. Maintainence sounds like hell for this.",
                "author": "gretino"
            },
            {
                "raw_content": "Very Cool!",
                "author": "Human-Job2104"
            },
            {
                "raw_content": "Reminds me of Simon Stålenhags artwork",
                "author": "hugothenerd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Thinking Game documentary is sitting at 305M views on Youtube in less than 2 months. Ridiculous numbers.",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.youtube.com/watch?v=d95J8yzvjbQ It's from 2024 but was recently released for free on Youtube at the end of last year, amassing an impressive 300+ million views in just under 2 months. The AlphaGo documentary, released almost 6 years ago back in 2020 sits at 37M. The topic of AI is permeating the everyday life. Edit: 1 hour later and it has gained 100k views.",
                "author": "CheekyBastard55"
            },
            {
                "raw_content": "I enjoyed both. This one actually was lovely. It was about human endeavour rather than the technology itself. Made me love Demis even more.",
                "author": "slackermannn"
            },
            {
                "raw_content": "Is it really that good?",
                "author": "mastertape"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2026 is where it gets very real because if claude code",
        "score": 133,
        "text_content": "Edit: because « of » obviously. So what is actually going on? We have software-writing software writing its own code with humans in the loop who increasingly pretty much press « Y » on all permissions and marvel at the output while collecting feedback. We have a massive amount of compute coming for inference and really big training runs in motion. Huge models with months long reinforcement post training on verifiable signals, massive CoT parallelisation, massive latency and speed improvements and massive costs decrease. We have Anthropic, a company initially focused on safety and alignment with a decel attitude going full on accelerationist, with a CEO who went from « let’s slow down » to « country of geniuses in a data center » over the past 18 months, putting products out there that they vibe coded in under two weeks, with employees maming crazy claims about continuous learning being solves « in a satisfying way ». We have hundreds of billions invested in infrastructure and research from Google OpenAI Meta and many others, just waiting to find any scrap of value to pour more billions in. The moment someone gets a small lead will see everyone fight back desperately to not be left behind. Radical choices will be made. We have Claude Code itself who is improving at lightning speed, each dev behind it has 4-10 terminals at all times blasting away tokens as fast as they can. I am increasingly of the opinion that Claude 5 and the Anthropic IPO will be the start of a hard takeoff. It won’t even be « AGI » as Lecun or Chollet define it. It doesn’t need to he. Superhuman software writing is not something we are ready for at all. I don’t even think we’ll lose software engineering jobs, we’ll create far more of them. In fact everyone will want to, will \\*have to\\* acquire software engineering skills. We just won’t write the code anymore and most won’t care one bit. Onward we go. It’s about to get very real.",
        "comments": [
            {
                "raw_content": "I'm a senior dev with 15 years of experience and Opus is writing 95% of my code. I barely correct it at this point People haven't realized how good these things are. Soon you'll be able to instantly clone any product you want",
                "author": "Altruistic-Toe-5990"
            },
            {
                "raw_content": "> I don’t even think we’ll lose software engineering jobs, we’ll create far more of them. That’s really hard to believe",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "The big problem is ultimately - you have a ton of potential productivity that is open-ended but limited in its ability to push the extreme boundaries without experts overseeing its work, so those experts become the bottleneck in two ways: 1) Asking the right questions. What are the priorities to be solved and deployed with AI? How much of this unlocked productivity is about to be thrown away on vanity projects the same way most software engineering always has been, without addressing the needs of users or finding an audience or an economic profit-making point? 2) Validating the answers - having a dream that AI can happily churn away on doesn't mean you can recognize a good answer when it appears, or design a good spec to instruct your AI to reach. And AI spamming code doesn't solve your marketing and funding issues, especially if customers become more and more averse to \"AI slop\" as early adopters rush to market with problematic products.",
                "author": "YoAmoElTacos"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Blackrock CEO, Lary Fink says \"If AI does to white-collar work what globalization did to blue-collar, we need to confront that directly.\"",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Buckle up butter cup",
                "author": "Alternative_Pilot_92"
            },
            {
                "raw_content": "By confront he means to put mechanisms in place to suppress and subdue the population when they revolt. Don't think for a second this has anyone else's interests in mind other than his own.",
                "author": "Erdeem"
            },
            {
                "raw_content": "Hungry children still exist in our 1st world society despite Gross overproduction of food.",
                "author": "Upstairs_Pride_6120"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI engineer assumed fired for leaking lots of company details in podcast",
        "score": 229,
        "text_content": "https://x.com/sulaimanghori/status/2013261823475097732 https://www.youtube.com/watch?v=8jN60eJr4Ps Potential leak: https://gemini.google.com/share/21ecc9e58c04 Among others.",
        "comments": [
            {
                "raw_content": "Damn he only got his 6 month vest and he’s fired for cause. That might not warrant garden leave I’d be really surprised if a frontier lab picks him up",
                "author": "RobotBaseball"
            },
            {
                "raw_content": "Just finished this podcast 5 mins ago. What exactly were the secrets he revealed? I wasn't thinking that much about it but did he really reveal anything that big?",
                "author": "UnknownEssence"
            },
            {
                "raw_content": "Bro I was just listening to this podcast and wondering if he’s allowed to reveal these details 😭 great episode tho, I genuinely feel bad for the guy",
                "author": "shafinlearns2jam"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Rumors of Gemini 3 PRO GA being \"far better\", \"like 3.5\"",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense as the released 3.0 model feels very high in base intelligence but feels horribly un-fine tuned. Prob a lot of gains still to be realized from this base-model family",
                "author": "PewPewDiie"
            },
            {
                "raw_content": "Can't wait to see.",
                "author": "Electrical_Tune_8254"
            },
            {
                "raw_content": "What does GA stand for?",
                "author": "JawGBoi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DEXFORCE W1 shown in a convenience store (audio translated)",
        "score": 38,
        "text_content": "From r/humanoids",
        "comments": [
            {
                "raw_content": "At that point why bother having a store/space? It could just be a big vending machine with a microwave inside.",
                "author": "unsolvablequestion"
            },
            {
                "raw_content": "What’s its theft prevention like? Does it just fuckin suplex you as soon as you try to cross the counter?",
                "author": "ldwtlotpa"
            },
            {
                "raw_content": "You can see how many modifications they had to make to get this robot to actually do those things. This is nothing but a tech demo. Still a long way from being useful.",
                "author": "stealstea"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BabyVision: A New Benchmark for Human-Level Visual Reasoning",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait for Gemini 18 Pro",
                "author": "TechnologyMinute2714"
            },
            {
                "raw_content": "[https://arxiv.org/html/2601.06521v1](https://arxiv.org/html/2601.06521v1)",
                "author": "Waiting4AniHaremFDVR"
            },
            {
                "raw_content": "This is cool. It shows that the models are still quite vision-limited, which many people argue as one of the main reasons why ARC AGI is so challenging to them. I expect that continuing to scale multi-modal pretraining and RL for vision tasks is going to bring that performance near 100% in the coming years, though. Lots of new applications will be unlocked, and especially robotics will again benefit greatly.",
                "author": "fmai"
            }
        ],
        "subreddit": "singularity"
    }
]