[
    {
        "post_name": "UNAFFORDABLE CARE ACT!",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well,… fix it.",
                "author": "GeorgeBailey"
            },
            {
                "raw_content": "I love Trump <my Name literally proves as much>, but dude I am getting tired of the ignorant, senile, \"5D Chess\" posts/comments HE is making lately. Downvote me all you want. The H1B, 50 yr mortgage, <repeated> Epstein is a Hoax has done me in lately. Put up or quite literally STFU.",
                "author": "TrumpIsMyyPresident"
            },
            {
                "raw_content": "Ok but where is the replacement that was promised in 2016 I haven’t seen a single GOP proposal in over a decade now.",
                "author": "WhatTheActualFuckS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REMINDER: It's all gay kabuki. Let us not be divided by faggots retards and overpaid doomer shills. We are MAGA. We are America First.",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump is not perfect there is nothing wrong being critical of him at the same time though there has been alot of hysteria around here. I still remember when people thought for sure that there would be a war with Iran just 5 months ago...",
                "author": "Albo22"
            },
            {
                "raw_content": "Not dooming,but We are not cheerleading only. That's cultish. Praising the great while calling out obvious Non AF trash is normal. We aren't hating on Trump,we despise the advisors and establishment clowns using Trump as their speaker to push their bullshit globalist non AF agendas. Our agendas are simple,America First and fuck the rest. The uniparty and establishment Trojan horses that are in or near his inner circle are MAGA AF enemies. I will not go along to get along. Trump said it himself,they are not out to get him( I disagree with that) they are after us and he is just standing in the way. We must keep MAGA AF front and center at all times,no exceptions. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "I can't get past \"There are no talented Americans.\" Could have agreed with Laura \"I agree, Americans are the most talented... Etc, but here is why we need to train them for the new factories being built in the United States... \" But how he said it, the way he said it, how adamant he was; for me was the kiss of death for his administration.",
                "author": "HumblePepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump goes SCORCHED earth on MTG after her post about the Epstein files",
        "score": 564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump started this term strong, but he has really been fucking up since the summer. If he doesn't wise up fast, the midterms are going to be a bloodbath.",
                "author": "briantrash"
            },
            {
                "raw_content": "He's going scorched Earth against most of us, too.",
                "author": "Goozmania"
            },
            {
                "raw_content": "I'm not the biggest MTG fan but Trump's reaction to all of the Epstein stuff is just not good.",
                "author": "Patrick_Bateman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Calley Means says the Make America Healthy Again movement is being sabotaged by bureaucrats inside HHS A CIA manual is being sent to all employees “They're sending around this CIA manual called ‘How to be a Bad Bureaucrat and Subvert an Institution from Within’”",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start arresting them.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Fire, arrest, charge them, prison",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "There was a story awhile back that during Trump Term #1, the Department of Labor stalled Trump on purpose by telling him a new regulation would take 1 year to make, when in reality it should have taken 3 weeks. Trump found out about this too late but thankfully the Project 2025 group planned for this. This is why they want to fire as many bureaucrats as possible this time around.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump will sue BBC for $5bn despite its apology for doctored speech",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good..fuck em",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Hopefully this completely shutters the BBC permanently",
                "author": "NimbleNavigation2024"
            },
            {
                "raw_content": "archived link https://archive.ph/upVFw",
                "author": "Diana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: In an amazing announcement, President Trump says he WILL barnstorm the nation for the 2026 midterms to surge GOP turnout. \"I'll be on the road! [...] Again - we should terminate the filibuster. The Democrats would do it IMMEDIATELY if they ever got power.\"",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire Kash and Pam. And start locking up the criminals.............Barnstorm that.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "50 year mortgages, 600k more chinese students and H1b importation while calling Americans talentless are surely going to be real campaign sellers.",
                "author": "LordCommissarYarrick"
            },
            {
                "raw_content": "Termination of the filibuster and codifying EOs into law should be a qualifier for endorsement.",
                "author": "Salty_Sailor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Record breaking 45 members of congress are NOT seeking re-election in their seats in 2026",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More AIPAC soldiers incoming to replace them",
                "author": "SpeekFreely"
            },
            {
                "raw_content": "Voters should make it all of them",
                "author": "EastTexasMadLad"
            },
            {
                "raw_content": "Rats are fleeing so they fall short of FBI corruption investigations. They realize the gravy train has ended for them and they need to bug out or risk being disgraced and sent to Federal Penitentiary.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥HOLY SHIT🔥How did we miss this?? CIA docs declassified by John Ratcliffe last week confirms the U.S. intelligence community knew Joe Biden’s visits to Ukraine weren’t official business at all, but rather outright bribery, racketeering, money laundering, conspiracy, and treason.",
        "score": 1379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And nothing will be done...",
                "author": "Wizard_Glick"
            },
            {
                "raw_content": "Well sonofabitch….",
                "author": "PosterIsDead"
            },
            {
                "raw_content": "And sex with minors. You forgot that one.",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤡🤡 NEW: Psychotherapist Jonathan Alpert says that 75% of the patients he sees have a deep hatred for Trump and are \"hyper fixated\" on him. \"They can't sleep, they feel traumatized by Mr. Trump.\"",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dr. Libtard here. I'll bet my practice that most also have prior mental illness and watch many hours of TV per day. Get back to me.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "Because Trump is their scapegoat for all of life’s problems. It’s a defense mechanism.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "Leftists are either genuinely mentally ill or they will claim to be mentally ill. All of them.",
                "author": "TD_Covfefe_Crusader"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump: \"Did Thomas Massie, sometimes referred to as Rand Paul Jr., because of the fact that he always votes against the Republican Party, get married already??? Boy, that was quick! Anyway, have a great life Thomas and (?). His wife will soon find out that she’s stuck with a LOSER!\"",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish he spoke this way about, Johnson, Thune, Crenshaw, and many, many, many more.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "LOL. Someone is pissy tonight.",
                "author": "here2red"
            },
            {
                "raw_content": "Gets accused of blowing Bill Clinton, attacks some of the most popular republicans in Congress. I just don’t know what to think anymore, man.",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Admin Rolls Back Biden-Era Restrictions On Alaska Oil And Gas Drilling",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "𝘿𝙍𝙄𝙇𝙇, 𝘽𝘼𝘽𝙔 𝘿𝙍𝙄𝙇𝙇 🛢️",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Again?",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "not trying to be negative nancy, just wondering... why the delay? why not day 1 of being back in office?",
                "author": "Deplorable556"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Citizenship and Immigration Services Director Joseph Edlow has revealed widespread immigration fraud among nearly half of all Somali immigrants in Minneapolis, involving forged documents, fake marriages, missing employers, and nonexistent businesses profiting off taxpayer-funded incentives.",
        "score": 1487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's probably way more than half.",
                "author": "FORMERCHILDSTAR"
            },
            {
                "raw_content": "Get back to me when these idiots and scammers have been deported.",
                "author": "ActNow"
            },
            {
                "raw_content": "The whole Somali population is a criminal enterprise. They have no desire to pick up the mantle of being an American. They're here to colonize, and the US Government (taxpayer) is funding the whole thing.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump's team has just begun summoning INDIANA lawmakers to ensure the 2026 House redistricting goes forward to help cancel out Gavin Newsom. Indiana CAN and MUST add +2 GOP seats! The meetings are set for the OVAL OFFICE as early as next week, per POLITICO.",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "misread that as indian, lol. 2 seats do go a long way, though. a lot of the voting that happens is within just a few seats in either direction.",
                "author": "-Evspra"
            },
            {
                "raw_content": "Indiana GOP = Pence",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "GOP cucking out as usual while California just approved that stupid ballot measure to redraw their district. Trump still trying to teach republicans HOW TO WIN after almost 10 years. Feckless politicians.",
                "author": "stargunner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Idiocracy was a documentary: Woman gets trapped in EV for 45 minutes as rescue team struggles to free her before eventually learning the vehicle had a manual door release right in front of her face.",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look at the photo with the article, showing the relevant diagram from the owner's manual. This is one of the problems with the modern obsession with ultra-sleek designs. The manual door releases blend in with the doors. There are also significantly different mechanisms for the front and back doors. For the front doors, pulling the blended-in thingy actually opens the door. For the back doors, the blended-in thingies are covers, which open in a different direction from the similar-looking front door releases, and after you open the cover, there's a \"release cord\" behind it that you have to pull. Expecting people to be prepared to deal with this in a potentially life-threatening emergency is insane. People borrow vehicles from family and friends, people rent vehicles for very short terms, people ride as passengers in vehicles they don't own. Nobody has time to read an owner's manual (which may not even be present in the vehicle, or even exist in physical form) for every vehicle they drive or ride in as a passenger.",
                "author": "Deplora"
            },
            {
                "raw_content": "The days of common-sense simple designs are long, long gone...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Any car door that has an electronically opened latch has to have a manual backup by law.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jeffrey Epstein held a dinner party w/ guests Katie Couric, George Stephanopoulos, Chelsea Handler, Charlie Rose & Woody Allen in honor of Prince Andrew. Couric said “I didn’t know anything about him at the time”. This was 18 Months after he was released from prison in 2010",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trying to get out ahead of something, it seems.",
                "author": "TinfoilHardhat"
            },
            {
                "raw_content": "couric and stephanopolos were news people who tout themselves as knowing more than most because of their access to news! they do not get the benefit of the doubt!! they knew, they approved and until proven otherwise I assume they are sick pedos!",
                "author": "coffee_grdr"
            },
            {
                "raw_content": "She’s a very polished liar",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "With Jocelyn Benson Set To Referee Her Own Race For Governor, Michigan GOP Asks DOJ To Monitor Election",
        "score": 1208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this even permitted? REEKS of corruption.",
                "author": "Bramage"
            },
            {
                "raw_content": "AZ enters the chat",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "It worked for Katie Hobbs in AZ.",
                "author": "BlancoBasura"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Nerve! DNC Union Furious Over A Five-Day, In-Person Work-Week. The union also thinks that the decision is \"callous.\"",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s how I spent my ENTIRE working life. Schlepping my ass to the office every day, showered & groomed to social standards, in clothes I bought with my own money, in a car I financed until it was paid off. The entire day was spent responding to orders issued by people I didn’t like to do things that were boring and dumb. YES, Friday was my favorite day! Thank you for asking.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Go to work or your job goes to someone who will. Not complicated",
                "author": "PresidentialPepe"
            },
            {
                "raw_content": "Here's the thing: I actually agree with reducing the workweek if it's possible. If we can perform the same amount of work in less time, which we absolutely can in many cases, then why not do it? However, I absolutely do not trust the government to handle something like this. These mother fuckers can't get a toilet installed without stealing tens of thousands of taxpayer dollars. If I can do my job remotely and I am given the opportunity I think that would be a nice thing to have.",
                "author": "Bearing51"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pam Bondi assigns SDNY Attorney, Jay Clayton, to investigate, \"Epstein’s involvement and relationship with Bill Clinton, Larry Summers, Reid Hoffman, J.P. Morgan, Chase and many other people and institutions... \"",
        "score": 1341,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SDNY?! D.O.A.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "JPMorgan is the deep state. He killed the Federal Reserve opposition with the Titanic. He was supposed to get on but did not, and sunk and killed the businessmen preventing his takeover of america with the Federal Reserve. This is striking at the root, Rubicon Don.",
                "author": "0111000001100101"
            },
            {
                "raw_content": "I thought we're not supposed to care or talk about Epstein anymore....",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI purposefully misspells Clinton, Weiner and Abedin.",
        "score": 1302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They did this with Comey (Corney) too. It’s designed to thwart searches for these subjects.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Gotta dodge those FOIA requests…",
                "author": "Double_D"
            },
            {
                "raw_content": "The Blob has been playing this game forever. Just misspell a name and the document cant be found",
                "author": "racer513"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am convinced almost all of the $38 trillion of National Debt is due to fraud.",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. I realized this a little while ago. I also realized Every citizen in this country could be doing really well if all that coruption didn't exist.",
                "author": "Username_here"
            },
            {
                "raw_content": "the national debt itself is already fraud. there's no debt. the fed is a swindle. if we were printing our own money we'd just have to pay for upkeep. not a neverending moneysuck of Babylonian Money Magic.",
                "author": "thelastlast"
            },
            {
                "raw_content": "# End the Fed",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD continues to chip away at Intel's X86 market share — company now sells over 25% of all x86 chips and powers 33% of all desktop systems",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So AMD on average had an overall 1.24% increase in market share this quarter while Intel lost 1.24%. That's impressive, considering Intel started selling discounted chips a few months ago.",
                "author": "IBM296"
            },
            {
                "raw_content": "I love how this is going and hope Intel can respond with a banger product of their own. Competetion is our biggest friend as customers people, these stats should make us all happy, Intel, AMD and Nvidia loyalists alike, and we should all hope Intel is able to respond with products of their own If only AMD could do similar numbers and gains in the GPU sector. Not even high end AI, but desktop segments for professional editing, gaming or even mining. Hopefully Intel and AMD can turn a new leaf and begin scaring Nvidia into more competetive pricing like the b580 did with the 5070, at least in desktop markets. I know all their money is in AI power drivers now, but surely they would not like to lose their monopoly on the desktop market that easily if the push came to shove right?",
                "author": "Zhiong_Xena"
            },
            {
                "raw_content": "It's crazy that they've had better chips for many years now but can't take the market share.",
                "author": "BobSacamano47"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD reports over $45B of custom chip design win content starting in 2026",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Semicustom design wins up from $20b in 2020 to >$45b in 2025 (lifetime revenue, inclusive of gaming) 2. Semicustom business expanding into dc, defense, and automotive. Revenue starts in 2026",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "At this point forward, I think AMD should just make Radeon \"Arm\" of dGPU. Just do Semi custom for third party companies, let them sell the product themselves. Because AMD Radeon seems to doing pretty underwhelming itself in consumer dGPU market.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "Yeah but for the steam machine MLID claims \"custom AMD silicon\" means defective chips with parts fused off therefore custom.",
                "author": "advester"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung’s Galaxy Book6 Pro leaks as first laptop powered by Intel Arc B390 Xe3 integrated graphics",
        "score": 161,
        "text_content": "Samsung’s Galaxy Book6 Pro leaks as first laptop powered by Intel Arc B390 Xe3 integrated graphics",
        "comments": [
            {
                "raw_content": "While Geekbench's OpenCL isnt super popular for GPU testing; I still cant believe a mainstream integrated GPU is actually competing with laptop 3050Ti, and these results still aren't with final optimizations! by the time Panther Lake comes out, Intel claiming that its as fast as laptop RTX 4050 might actually be true lol",
                "author": "LastChancellor"
            },
            {
                "raw_content": "3050 performance at half the power, can't argue with that. I do wonder how long it will be before the low-end dGPU disappears entirely from laptops, suspect these new chips probably aint it due to price but it's presumably coming.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Are these better than Ryzen igpu? How do they compare to RTX 4050 AND 5050 in non demanding game?",
                "author": "DazzlingpAd134"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Do the registers from pointers point to the CPU's cache, or to RAM?",
        "score": 35,
        "text_content": "And is RISC different about this?",
        "comments": [
            {
                "raw_content": "In any modern architecture, the cache is transparent, which means the CPU asks the cache for data as if the CPU talking directly to main memory. The CPU asks the cache for the data at an address in main memory that the pointer points to. The cache looks in its list of memory locations it has cached and responds with the data immediately if it finds it, or loads it from main memory into the cache, and passes the data back to the CPU when the data is ready. It's not possible to point at the cache because hardware designers don't want software developers to have to worry about it. The cache guesses what data it should keep around, and it might guess wrong. You might be able to do better, but if CPU architects gave you control, you would have to write a different program for every CPU with a different cache size and make an update when new CPUs come out.",
                "author": "callmedaddyshark"
            },
            {
                "raw_content": "Pointers point to address space. Address space can be unimplemented, or assigned to some backing device, such as RAM or MMIO space (PCIe BAR space, etc.). These assignments can be cacheable (RAM) or uncacheable (MMIO). If a given address is cacheable, then the contents can potentially be stored in the cache hierarchy. This caching process is transparent, it's not possible to directly address anything in the cache. The cache is also managed by the hardware, so things can potentially be added or removed at any time without CPU involvement.",
                "author": "alexforencich"
            },
            {
                "raw_content": "While we're on the topic (and the question has been answered elsewhere in this thread), an interview question I've seen is how would you validate your cache implementation? They're mainly looking for your thought process, but something important to keep in mind is that if your machine is not caching anything, it will still be completely fine functionally. It will just be much slower. So you're not looking for errors or functional mismatches, you're looking for the right uarch functionality (what is cached), right structures (keep track of where things are), and the right replacement policy (when things are cached or replaced). Then you observe performance. Obviously it's deeper than that in reality, but you could be so in the weeds in cache coherency nonsense or a data/instruction cache discussion and never realize that it could fail in various ways that would never really break the machine. That's what the interviewer is looking for usually, they're hoping to see you break out of that rabbit hole.",
                "author": "Simislash"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "If the future of advanced chips are increasingly headed towards compute-in-memory, does this mean SK Hynix and Samsung will dominate?",
        "score": 31,
        "text_content": "If the current HBM paradigm is not upended, this is increasingly the direction we are headed towards, with the base logic die expected to do the bulk of the computing. Does this mean Hynix and Samsung increasingly dominate as they're the only ones who can mass produce the cutting edge memory chips?",
        "comments": [
            {
                "raw_content": "Which is why I expect NVIDIA or Broadcom will try to buy Hynix or at least launch a joint venture. Samsung could, in theory, absolutely dominate if they figure out their IC designs, foundry, and packaging issues. They have all the tools required to build future HBMs with logic capacity from start-to-finish.",
                "author": "self-fix"
            },
            {
                "raw_content": "Memory is much easier to design than processors. The difficult part is manufacturing.",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "I don't think it would upend the entire paradigm, but I'd expect to see HBM-PIM integrated into some GPU in the future. Probably to accelerate the KV cache and multi head attention, which is a GEMV problem. A generic GEMM is a bad fit for PIM if I understand correctly: > To provide a full matrix multiplication without partial results, the blocks of matrix A must be replicated N2 times in the allocated DPUs and matrix B must be replicated N1 times. This approach increases the total memory usage https://arxiv.org/html/2508.07317v1 That's why the pragmatic approach would be to integrate it with a memory controller that can switch between two modes, which is what the research focused on AFAIK. I would not be surprised if Samsung partnered with AMD to deliver this. \"GPUs\" are a great vector to deliver an improvement like this to a large install base.",
                "author": "farnoy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Xbox Ally X market response \"extremely positive,\" as ASUS acknowledges stock issues — \"We are working closely with suppliers to ramp up production.\"",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This thing ain't a console. Expectations are different when you're making a handsome profit per unit sold. I know the usual goons are going to be in here saying \"LOL CANT EVEN OUTSELL A MONTH OF THE SWITCH LIFETIME LOLOLOLOLLLLL HURRRRR\" but that has never and will never be the point of these devices. The OEMs and the consumers have always treated them more akin to an enthusiast laptop class device in how they approach the market and consumers, and as such if you go to the only retailer for the thing and it's sold out through the end of the year....it's doing great for ASUS, period.",
                "author": "Logical-Database4510"
            },
            {
                "raw_content": "Around 200k sold and sent to retailers may be good for Asus, but it's really nothing to write home about for Xbox.",
                "author": "IDONTGIVEASHISH"
            },
            {
                "raw_content": "About 150,000 units per quarter being \"extremely positive\" just means they had very low expectations and were cautious with production. They also will not \"ramp up\" production. They will just continue on at the current pace until demand is met. Ramping up will cost them a lot of money, and there likely isn't a market big enough to sustain that kind of investment. If it's still selling out quickly after Christmas then they might consider it.",
                "author": "anival024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Solving the QLC NAND Flash SSD Scaling Challenge",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Another poster",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are the skeletons doing the Wojack point meme?",
                "author": "GAMIE64"
            },
            {
                "raw_content": "I kind of wished this was the third movie and sunshine was the sequel. Especially with all the Bowser Jr stuff. You could easily translate Mario Sunshine into a movie.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "How are people confused that Nintendo is using a location from the highest selling 3D Mario Game to market this film? It's like being confused that they used Super Mario Kart to market the Super Mario Bros movie. And I'm sorry to break the news to you guys but Super Mario Sunshine is the least popular 3D Mario game by far so they were never making a movie that was going to lean too heavily in that direction, until they completely run out of ideas at least. The first two movies though were going to lean heavily on the most popular 3D Mario games and the 2D ones. Super Mario Galaxy is popular and highly cinematic so it makes sense or why they're leaning on that game and Galaxy 2 I'm sure.",
                "author": "Kazaloogamergal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Humans in prime 4 look hyper realistic",
        "score": 2418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The realistic people make Samus' suit made with alien technology look even more alien.",
                "author": "Williekins"
            },
            {
                "raw_content": "you could tell that they hired halo artists in this trailer so hard lmao and thats a good thing they certainly know how to make a gorgeous game",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Woah, there are other humans appearing physically in Metroid games. I'm currently playing through the Metroid series and finished the first four games, but there was no other human in them.",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Saw this on Tiktok",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dichen Lachman as Impa?",
                "author": "SirRidley"
            },
            {
                "raw_content": "IMPA!!!",
                "author": "robotshavenohearts2"
            },
            {
                "raw_content": "The Nintendo ninjas are on their way.",
                "author": "Babinios"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are the odds we get all 4?",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly I can’t see Metroid ever coming to the switch",
                "author": "Sasumas"
            },
            {
                "raw_content": "Doom Guy gets no love",
                "author": "Teddy_Pocketwatch"
            },
            {
                "raw_content": "Man, you crazy. Metroid is never coming to Nintendo consoles.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best of both worlds. what other consoles do you own ?",
        "score": 145,
        "text_content": "Had to re upload because of a typo 🥲",
        "comments": [
            {
                "raw_content": "Currently using Switch 2 and PS5. It’s a match made in heaven 😍",
                "author": "OmegaMaster8"
            },
            {
                "raw_content": "I'm an adult, so... All of them.",
                "author": "TVxStrange"
            },
            {
                "raw_content": "I’ve got a PS5, Switch 2, Xbox Series X, Steam Deck, PC, and Quest 3. 😂",
                "author": "thinksInCode"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I love when Nintendo says obvious stuff like this",
        "score": 899,
        "text_content": "“NO WAY SAMUS CAN JUMP??",
        "comments": [
            {
                "raw_content": "Believe me there are people who need this.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "They take NO chances now after people didn’t realize the WiiU wasn’t a new console generation and not a Wii add-on",
                "author": "Dat_Boi_Teo"
            },
            {
                "raw_content": "The scary thing is there are people out there that have to hear it. Common sense is zero for many people out there.",
                "author": "spitzer1113"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk 2077 is amazing on Switch 2",
        "score": 702,
        "text_content": "Didn't expect to love this game so much. It's giving me the level of story and world immersion only Xenoblade and Persona could",
        "comments": [
            {
                "raw_content": "This put any half-baked port to shame.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Yep, this and outlaws are well optimized technical marvels for the platform, and show what you can do when you really take the time to optimize the game and smartly work around the systems technical limitation",
                "author": "Strict_Biscotti1963"
            },
            {
                "raw_content": "Man I did my second play through all on the switch. It was awesome.",
                "author": "Hellothere0803"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond – The Final Preview",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of the reviewers said miles was only with them for 5 to 10 minutes. I’m sure it’s going to be fine. You can also mute dialogue for the sections if you want.",
                "author": "Diego_599"
            },
            {
                "raw_content": "The reaction to the companions seems blown way out of proportion to me.",
                "author": "honorable_doofus"
            },
            {
                "raw_content": "Find it crazy people are now writing this game off all cause of a guy who is only really with you for one section. You can clearly see the Alien film influences with the angle of rescuing stranded Federation Troopers",
                "author": "Wolfgabe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Insider Gaming Weekly - Valve's Next Announcement Won't be at TGAs, Tom Henderson Says Big Game Coming In March",
        "score": 1357,
        "text_content": "Video Link: [https://www.youtube.com/live/uwn\\_XYk8Is8?si=51br6QSKysH8bA3f&t=2122](https://www.youtube.com/live/uwn_XYk8Is8?si=51br6QSKysH8bA3f&t=2122) If Timestamp doesn't work: go to 35:20 Mike Straw: > But no, this big announcement I was told won't happen at The Game Awards. Tom Henderson: > Yeah, uhm, the common theory is that, uh, it's gonna be a steam machine launch title, right? Like, exclusive? Which makes sense, and if we're getting the Steam Machine, did you say early 2026? or just 26? Yeah, so like March, or, yea it'll probably be March, because I've heard there's a big game coming out in March that I can't say just yet. But a lot of people are looking forward to it. .... We'll see in the next couple of weeks if we're gonna talk about it.",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Remembering that person who said March 27th 2026 because it was revealed to them by the universe",
                "author": "gnulynnux"
            },
            {
                "raw_content": "its deadlock official release date i know the janitor",
                "author": "Filianore_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve is still aiming for 2025 for Half-Life 3 announcement, according to GabeFollower",
        "score": 1940,
        "text_content": "[https://www.reddit.com/r/HalfLife/comments/1ox4jzk/more\\_hopium/](https://www.reddit.com/r/HalfLife/comments/1ox4jzk/more_hopium/) Extra: Another credible Half-Life dataminer Tyler McVicker just has said in his stream that he is expecting Valve to announce HL3 within 2 weeks. GabeFollower has predicted Deadlock before everyone else, and Tyler McVicker was right about Half-Life: Alyx. They both are pretty credible when it comes to Valve projects.",
        "comments": [
            {
                "raw_content": "Steam Hardware reveal into Half Life 3 announcement for 2026 would be such a complete bonkers ass move from Valve. And let us all remember: **we still do not have any new info on the new Raising the Bar reprint they revealed last year during HL2's anniversary that's supposed to come out in 2025.**",
                "author": "atahutahatena"
            },
            {
                "raw_content": "Everyone saying game awards but that isn’t within the next 2 weeks",
                "author": "Dat_Boi_Teo"
            },
            {
                "raw_content": "Can you imagine if they shadow drop this? Steam would probably crash lol.",
                "author": "Lionelchesterfield"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Video of set filming for The Legend of Zelda movie has been shared on instagram by tonyolsenfilm",
        "score": 369,
        "text_content": "Source is linked below https://www.instagram.com/reel/DRCALkNk0Nl/?igsh=MW40OGJvOXRqamx0Zw== This shows Bo Bragason as Zelda and a currently unknown character who gives a weapon to Zelda next to two horses, one of which has a saddle decorated with the Triforce on it.",
        "comments": [
            {
                "raw_content": "Looks like the costumes are gonna be BOTW inspired then. Edit Footage of Link has surface, his actor is wearing the green tunic. https://www.instagram.com/reel/DRCDMlDDq-q/?igsh=bmttNTBqMWVmdzJi",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "The other actress looks like Dichen Lachman.",
                "author": "ArbitraryLettersXYZ"
            },
            {
                "raw_content": "I wonder if the older woman is their version of Impa",
                "author": "Taymatosama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden says he heard from a 'very good source' that PlayStation is 'probably pulling back from PC' for their 'tentpole singleplayer games', while live service games remain day-and-date",
        "score": 144,
        "text_content": ">I was talking about PlayStation doing day-and-day and doing PC. And then I got off on a tangent about the social aspects of PlayStation. And the reason Steam has become popular is because, at least partially I think, it is easier to go viral with Steam. And you would think logically that PlayStation would want to tap into that, right? And make their franchises go viral by being on Steam and being on a bigger platform. \\[...\\] But I actually heard the complete opposite today from a very good source, that PlayStation probably is pulling back from PC and also that the crossbuy buttons and the PlayStation/PC iconography is from outdated old builds and is never going to be used. \\[...\\] I don't actively investigate what PlayStation's doing. Because it's not my beat. But I do get PlayStation information incidentally sometimes by researching Microsoft stuff for my actual beat. But it does seem like the games that PlayStation released on PC didn't move the needle for them at all. Partially because they were launched so late, but maybe they've used that as evidence that they shouldn't go any further, and that they should remain more Nintendo in their approach and keep things more exclusive. Except service games. \\[...\\] But I do think those sort of tentpole singleplayer games like Yotei and stuff, maybe they just don't come to PC, or they come to PC years later. Source: [https://www.youtube.com/live/EZkatWINAYE?t=10034s](https://www.youtube.com/live/EZkatWINAYE?t=10034s)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Didn’t he literally say like yesterday that PC day and date was coming? Dude just says stuff, I’m not taking this seriously.",
                "author": "LinkMaster111"
            },
            {
                "raw_content": "Aaaaand there it is. The walk back Classic Jez. Actually crazy how consistent he is at walking things back",
                "author": "FindTheFlame"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Another look at Link and Zelda on set for the live action movie",
        "score": 190,
        "text_content": "[https://www.instagram.com/reel/DRCDMlDDq-q/?utm\\_source=ig\\_embed&ig\\_rid=10c63548-008b-415a-a478-423867ec7f97](https://www.instagram.com/reel/DRCDMlDDq-q/?utm_source=ig_embed&ig_rid=10c63548-008b-415a-a478-423867ec7f97)",
        "comments": [
            {
                "raw_content": "Link being traditional green while Zelda is BotW blue is a very inspired choice ngl",
                "author": "lactoseAARON"
            },
            {
                "raw_content": "Wow Link reminded me of Twilight Princess with the coloring",
                "author": "niles_deerqueer"
            },
            {
                "raw_content": ">link wearing green Kino",
                "author": "ConductorColin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: Ubisoft SF was working on Splinter Cell; it got derailed by GaaS ambitions and became xDefiant",
        "score": 615,
        "text_content": "[Link](https://www.bloomberg.com/news/newsletters/2025-11-14/the-turbulent-seven-year-saga-behind-hit-game-dispatch?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2MzE0MzM2NiwiZXhwIjoxNzYzNzQ4MTY2LCJhcnRpY2xlSWQiOiJUNVFBMDdHUEZIUlYwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.fNOncm0D1BfbWI9RAgwCB6j8SI8mW9RhRD76EEz1TYo&leadSource=uverify%20wall) GaaS has been a plague this generation. An enormous amount of studio talent and hard work wasted by these greedy corporate ventures.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Oh come the fuck on Edit: so I’m hoping the remake is still in development (this cancelled game was a new entry in the series) but the article sounds like Ubisoft doesn’t care about Splinter Cell sooo idk.",
                "author": "Greatsnes"
            },
            {
                "raw_content": "😭 Kill me",
                "author": "thelastsupper316"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hytale website activity points to it being acquired by former owner Simon Collins-Laflamme",
        "score": 126,
        "text_content": "[Link on X](https://xcancel.com/Olegro_/status/1989491912680538302) The website for Hytale.com underwent the process to being transferred to a new holder, and the new nameservers are those used by former founder, Simon Collins-Laflamme, who has been trying to acquire the property back from Riot Games after it was cancelled earlier this year.",
        "comments": [
            {
                "raw_content": "Wow he talked about doing it, but I can’t believe he’s following through. Hopefully something finally releases now.",
                "author": "QuantumProtector"
            },
            {
                "raw_content": "Most of the Hytale dev time after riot buyout was making the game again in a new engine, i suppose he's going back to the old engine made in Java?",
                "author": "PomegranateSpecial30"
            },
            {
                "raw_content": "There's no way... did the mad man actually do it?!",
                "author": "viridiannaught"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mp1st: Gameplay and concept art from cancelled Warhammer RPG",
        "score": 83,
        "text_content": "According to the report, the game was called “Warhammer Age of Sigmar: Dark Frontier” and was cancelled last year. [source](https://mp1st.com/news/early-footage-art-cancelled-warhammer-rpg)",
        "comments": [
            {
                "raw_content": "Warhammer would have lent itself well to an RPG, considering its RPG/tabletop wargaming roots.",
                "author": "Primal-Convoy"
            },
            {
                "raw_content": "Such a shame. Age of Sigmar has been in need of a good game to bring it into the public eye and shake off the bad history it has from Fantasy Battle's End Times and 1st Edition AoS. This looks like it could have been a lot of fun, and the concept art goes hard as hell.",
                "author": "epikpepsi"
            },
            {
                "raw_content": "Age of Smegma",
                "author": "ILuhBlahPepuu"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI Project Zero backside power connector design reaches entry level with first AMD B840 motherboard",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "okay , that would been extremely helpfull honestly , why isnt this standard ?!",
                "author": "Evonos"
            },
            {
                "raw_content": "these chipset are only worth it if thier are under 80 usd. The thing is most B840 are significaly more expensive that B650/B850 most of the time everywhere. They are a trap. This thing going to burst that easily. Probably 160-180 usd.",
                "author": "WelderEquivalent2381"
            },
            {
                "raw_content": "the last thing i want in an entry level mobo is a weird type of cable routing that drives motherboard prices up, and is only compatible with specific cases.",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Markets no longer view the December rate cut as a sure bet, with Fed officials casting doubts",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The commentary on CNBC this morning was fixated on those on the committee who want a rate versus those who are likely to dissent, and it’s about even split. The key? November jobs report, CPi numbers. It’s considered a given that the October numbers will just never be known. Sure wish I didn’t have to be accountable to my employer for a month. Just do whatever I want, no report, no end product, just “let’s forget that one, bruh”.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "KEY POINTS * Federal Reserve Chair Jerome Powell wasn’t kidding a couple weeks ago when he said a December rate cut wasn’t in the bag. * Whereas traders as recently as a few days ago were pricing in at least a 2-to-1 probability of a quarter percentage point cut, that’s now flipped to a coin toss. * As markets grew much less confident about a December cut, stocks slumped Thursday while Treasury yields moved higher.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The last two failed to have their intended effect so it makes no sense to do another one. Clearly rate cuts aren't the answer.",
                "author": "Less-Fondant-3054"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s new mortgage “innovation” looks a lot like the last financial disaster, analyst warns",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think they mean latest, not last. It sure as fuck isn't the last probably this year",
                "author": "Blubasur"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Builders’ Cheap Mortgages Are a Bad Deal for Home Buyers",
        "score": 60,
        "text_content": "People who borrow from a builder are more likely to overpay for their property and be underwater after they move in https://www.wsj.com/economy/housing/builders-cheap-mortgages-are-a-bad-deal-for-home-buyers-e01bed75",
        "comments": [
            {
                "raw_content": "This should be obvious to anyone who thinks for even a few seconds about how builders are able to offer cheap mortgages. They're just paying points. Obviously, people who pay huge points on their mortgage are worse off if they move within a year or two after buying.",
                "author": "Abject_Egg_194"
            },
            {
                "raw_content": "Are there any good home builders anyway?",
                "author": "slifm"
            },
            {
                "raw_content": "Can someone unpaywall this pls?",
                "author": "MembershipDecent9454"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why Portable Mortgages Won’t Work in the U.S.—and How They Could Make Housing Even Less Affordable",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol a realtor.com “oh no they’ll make housing less affordable!” These fuckers that own realtor.com add 6% to basically every single home sale in the country, and they have for decades.",
                "author": "uslashuname"
            },
            {
                "raw_content": "Investors: \"How can I use this to acquire more doors?\"",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Mortgage rates depend on both the LTV and the borrower. It makes sense to not attach them to the property as long as the terms are the same: the principal outstanding, time, and LTV no more than the original property.",
                "author": "-Azzi-"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 10 Commandments of Real Estate Investing: Surviving the Bubble",
        "score": 5,
        "text_content": "1. Run the numbers, not your emotions. A property can be beautiful, but if it doesn’t make money, it’s just an expensive hobby. Always let the math guide your decisions. 2. Buy for value, not hype. Just because everyone’s chasing the latest hot market doesn’t mean it’s a smart buy. If a deal only works in a perfect world, it’s not worth the risk. 3. Location is everything. You can renovate a home, but you can’t change its neighborhood. A strong area can make an average property shine, while a weak one can drag down even the nicest house. 4. Never underestimate expenses. Roofs leak, tenants move out, repairs happen. Bad investors guess; smart investors plan and budget for the unexpected. 5. Be patient, not desperate. Feeling like you’re “behind” is a fast track to mistakes. Real estate rewards discipline and timing, not panic. 6. Treat tenants like people, not problems. Happy tenants pay on time, stay longer, and take care of your property. Respect goes a long way. 7. Know your financing as well as your property. Interest rates, loan terms, and leverage often matter more than a fancy kitchen. A smart loan can make a mediocre property shine. 8. Think long-term, not quick flips. Fast money is tempting but fleeting. True wealth comes from steady cash flow, growing equity, and smart leverage. 9. Don’t compare your journey to anyone else’s. Some start with millions, some with nothing. Focus on your own path and progress at your own pace. 10. Never stop learning. Markets change, laws evolve, and strategies shift. The investor who stops learning will eventually stop earning.",
        "comments": [
            {
                "raw_content": "11. You got to know when to hold em, know when to fold em, know when to walk away, know when to run.",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "SW FL Delegation Meeting Speech 11/13/2025",
        "score": 5,
        "text_content": "Good morning Chair and Delegation. I'm a third-generation proud American, single senior, 40-year Florida year round resident homeowner and business owner, currently representing myself pro se in an appellate case documenting systematic fraud in my HOA foreclosure. I'm here about a simple disparity: Florida condo owners have ombudsman protection. Florida HOA homeowners pay property taxes but have no protection. Municipalities outsourced infrastructure to HOAs claiming it would keep property taxes low. Our property taxes went up anyway. Florida HOA homeowners are paying twice—HOA assessments plus rising taxes—with no representation. Avoiding regulation is a serious problem because Homeowners Associations are no longer about homeowners. Homeowner Associations have been consolidated by private equity companies. This industry has fundamentally changed. Morgan Stanley Capital Partners acquired RowCal in 2023—refusing to disclose the purchase price. Multiple PE firms have consolidated Florida HOA management companies. The Riva on the River lawsuit is challenging earned credits—where management companies receive payments from banks based on HOA deposit portfolios totaling over $106 billion nationally. This is homeowner money being used to pay Wall Street. These are public, verifiable facts. 3.9 million Florida HOA homeowners face foreclosure over assessment disputes because of no state oversight. Foreclosure mills are a profit model designed to thrive without regulation, without enforcement, without oversight. Community managers are the ones held responsible, but they are not the decision profit makers. There's no regulatory protection, no appeals process, no ombudsman. It’s all on the Florida HOA homeowner to fight disputes and pay court costs out of pocket because there is no state agency regulating HOAs for Florida homeowners. I've provided detailed reform proposals to Jeremy Miller, including creation of an HOA ombudsman program modeled on the successful condo program. Florida HOA Homeowners are passengers on the Titanic. The daily calls to your offices verify – ICEBERG STRAIGHT AHEAD. Why are you frozen to act? Thank you for your time. Any comments from the community?",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Any day now",
        "score": 1665,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/8cmjnk61ga1g1.jpeg?width=1170&format=pjpg&auto=webp&s=4adfb734d87e470600747c88f1dbd819898c7f2e",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Ultimately, as we get closer to the goal, we notice that actually doing it (AGI in this case) becomes more difficult, as we see all the small and thorny problems. Hence why people are talking about a plateau. Like a construction site has a lot more visible progression as the structure and walls go up, and is hard to see improve when they are doing the plumbing or wiring. But the construction did not plateau.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Today ChatGPT correctly diagnosed what was wrong with my dryer with just the model number and a recording of the noise it was making then gave me detailed, step-by-step, instructions on how to repair it. If it could work a screwdriver and some pliers it would've been able to fix it all by itself.",
                "author": "BitOne2707"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MindOn trained a Unitree G1 to open curtains, plant care, package transport, sheet cleaning, tidying up things, trash removal, play with kids",
        "score": 1624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I fucking lost it at the frisbee with the kids",
                "author": "Constant-Arm9"
            },
            {
                "raw_content": "he looks drunk but FINALLY he's moving at normal speed. i'll take this over the poop-walk anyday",
                "author": "swaglord1k"
            },
            {
                "raw_content": "![gif](giphy|Ml4FaEL17gd56)",
                "author": "elemental-mind"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A 32 year old woman in Japan just married a digital persona she built inside ChatGPT. Calling him “Lune Klaus,” a ceremony was held in Okayama using AR glasses to project his presence",
        "score": 674,
        "text_content": "https%3A%2F%2Fwww.mangaloretoday.com%2Ftoday%2FJapanese-woman-marries-AI-companion-she-created-using-ChatGPT-Klaus-understood-me-.html",
        "comments": [
            {
                "raw_content": "I give them six months",
                "author": "Indoorsman101"
            },
            {
                "raw_content": "what happens when the version upgrades?",
                "author": "yalag"
            },
            {
                "raw_content": "Is this performance art?",
                "author": "the_mushroom_speaks"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Maybe a hint on Gemini Release?",
        "score": 144,
        "text_content": "[https://x.com/sundarpichai/status/1989481514393121239](https://x.com/sundarpichai/status/1989481514393121239)",
        "comments": [
            {
                "raw_content": "I hope I am wrong about this, but I think its just a 69 joke.",
                "author": "Peach-555"
            },
            {
                "raw_content": "It's incredibly unprofessional for Sundar to be doing this. I would say it is borderline insider trading.",
                "author": "ZestyCheeses"
            },
            {
                "raw_content": "market manipulation at its finest",
                "author": "Raffinesse"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Another view of the New Glenn booster landing with interesting details from Jeff Bezos",
        "score": 92,
        "text_content": ">Good overview of the landing. We nominally target a few hundred feet away from Jacklyn to avoid a severe impact if engines fail to start or start slowly. We’ll incrementally reduce that conservatism over time. We are all excited and grateful for yesterday. Amazing performance by the team! [https://x.com/JeffBezos/status/1989358416532488406?s=20](https://x.com/JeffBezos/status/1989358416532488406?s=20) Seems like it corrected almost 300 feet of offset.",
        "comments": [
            {
                "raw_content": "Looks like the space race is back on but between private companies this time round",
                "author": "riansar"
            },
            {
                "raw_content": "Things like this and the AI boom are the only thing giving me hope for a better future",
                "author": "Dear-One-6884"
            },
            {
                "raw_content": "Reddit: Friendship ended with ELON now BEZOS is my best friend",
                "author": "Kitchen-Research-422"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Chinese optical quantum chip allegedly 1,000x faster than Nvidia GPUs for processing AI workloads - firm reportedly producing 12,000 wafers per year",
        "score": 392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So this is a photonic chip not a quantum chip. The comparison to GPUs should be enough of a clue for that to be obvious. Couple of notes: -Photonic chips do heavily rely on the quantum properties of light to operate, in the same way that modern semiconductors rely on the quantum properties of electrons -They aren't quantum computers unless they have qubits. -These chips don't have qubits. So this headline is click bait.",
                "author": "comfortableNihilist"
            },
            {
                "raw_content": "I believe these are not quantum chips, ie no qubits. These are photonic chips that do normal processing but extremely fast. They are very useful for analyzing and error correction of output from real quantum chips in hybrid computers. There is no reason to doubt this story, besides the quantum hype, since this is being developed in labs around the world, including at Nvidia.",
                "author": "Less-Consequence5194"
            },
            {
                "raw_content": "The amount of articles I've read here this year about some NVIDIA killer chips that turned out to be nothing burgers is astonishing. 🥱 It's all just FUD and clickbait.",
                "author": "Successful-Berry-315"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.1 gains 2 points over GPT 5 in artificial analysis index (first model to hit 70 points) while being more token efficient and faster",
        "score": 76,
        "text_content": "It's the fastest flagship model for any of the providers, almost on par with Grok 4 fast, 2x faster than GPT-5.",
        "comments": [
            {
                "raw_content": "You can ignore the points, those just illustrate relative performance between the models, the points where higher a year ago, but the models are definitely much stronger today. https://preview.redd.it/vkcb1v27bc1g1.png?width=1532&format=png&auto=webp&s=cad8a1d4cb725fb82ee3b156bb237c92cf613fdd",
                "author": "Peach-555"
            },
            {
                "raw_content": "GPT-5.1-High uses twice as many tokens as GPT-5-High.",
                "author": "LeTanLoc98"
            },
            {
                "raw_content": "waiting for gemini 3.0 flash. excited for outputspeed, context length and intelligence. 2.5 flash was amazing for my use case",
                "author": "kvothe5688"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Interesting snippet from 1X founder about Neo and robots generally - from YouTube",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This guy lost all credibility when he took 'AI=Actually Indian' too literally.",
                "author": "BagholderForLyfe"
            }
        ],
        "subreddit": "singularity"
    }
]