[
    {
        "post_name": "\"Giant Pussies\"",
        "score": 541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Vile and inexcusable language\" is classic RINOspeak.",
                "author": "JamesBlomey"
            },
            {
                "raw_content": "At least JD Vance didn't stoop to the level of condemning it. He instead rightfully called out the Jay Jones texts for being infinitely worse. Most of the GOP is embarrassing, but not Vance. Trump actually chose well with his new VP pick.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "whoever wrote that Young Republicans tweet is a retarded faggot",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These are the people calling us Fascists and a threat to Democracy. UFB.",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are we going to return to pitchforks, tar, and feathers?",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Caldwell is super conservative..I bet the community is pissed.",
                "author": "dorkana"
            },
            {
                "raw_content": "I stopped caring about school board meetings a while ago",
                "author": "FearGodTheAlmighty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "do y'all think Stephen King is on the Epstein List™?",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably not, he's not really a power player, just some loser who writes make-believe for a living. I'm sure he wishes he was though since he's a pedophile like most democrats",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Epstein had a Ranch in New Mexico as well...jus saying King quietly spent time in the southwest during the days he was researching for the books Desperation and The Regulators and published 1996 And for the TV movie for Desperation and King was onsite for the movie production in 2006. Tucson 6hr drive to the Ranch Tombstone...even less. Speculation I realize but there was time and if he had a opportunity to visit without prying eyes...do we think he would decline the moment to visit?",
                "author": "eel003"
            },
            {
                "raw_content": "He probably has at least one kid tied up in his own Chomo Dungeon right now.",
                "author": "seangalt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: WINNER IN NEW YORK GOVERNOR RACE ANNOUNCED EARLY BEFORE ANY VOTES COUNTED!!!",
        "score": 154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This Jeb meme will always be funny. Probably even funnier as more time passes.",
                "author": "Bushwookiee07"
            },
            {
                "raw_content": "Please clap",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I have voted for ¡Jeb! In every record breaking election sweep he has pulled off (that's a lot). Not so much because I love the Bush family, I quite dislike them. But fuck I love guacamole and ¡Jeb's! guacabowlie is handy AF. Not only you do you make it in the guacabowlie, you serve it in the guacabowlie too!! Fucking genius",
                "author": "Giant_Schwartz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She's right you know",
        "score": 1447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Male suicide is the 2nd leading cause of death below age 50. Divorce and subsequently losing access to raising and seeing their children is a major reason.",
                "author": "Stossels_stach"
            },
            {
                "raw_content": "Holy shit that's a banger",
                "author": "IForgotToAddAnEmail"
            },
            {
                "raw_content": "She's not wrong.....",
                "author": "bill_in_texas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump will participate in a press conference with FBI Director Kash Patel tomorrow at 3PM.",
        "score": 714,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please be about John Bolton.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "My guess is John Bolton’s getting indicted. But it also seems unusual for a president to participate in a press conference announcing someone’s indictment",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "we really need to do something about the economy and fast, its going to hurt us in the mid terms",
                "author": "Theosco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "INCREDIBLE: For the First Time in American History A Christian Cross has been Engraved onto the Presidential Medal of Freedom in honor of Charlie Kirk. Erika Kirk wanted to share this with you as a testament of Charlie’s powerful work advancing The Kingdom of Jesus Christ.",
        "score": 1445,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Christ is king!",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "He certainly deserves it. Wholesome man.",
                "author": "Kumalasbreakfast99"
            },
            {
                "raw_content": "Holy finger bling Batman! \"M\", \"G\", what's the symbol on that last one...? 🤔",
                "author": "Mortal_Wombat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Gutfeld NAILS IT on Democrats calling President Trump and conservatives \"authoritarian\": \"It's a surrender. This is not real. They know it's not real - they have NOTHING LEFT!\" \"This is like a guy on his sofa watching his team lose and just throwing the beer can at the TV.",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being authoritarian was exactly what the Democrats were during the COVID lockdowns: * mask mandates, * vaccine mandates * stove mandates * lightbulb mandates * car mandates * capacity restrictions * one-way aisles in store It's all projection.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I remember this same whistling past the graveyard in 2017.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "How long until they start calling Trump a *communist?* It's obvious projection, but they'll always double down with the projections. I'm surprised they haven't already started calling him a *communist* of all things. They call him nearly every other tyrannical term, and they LOVE to compare him to Hitler.",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴BREAKING: The U.S. has REVOKED the Visas of SIX foreigners for their VlLE and DISGUSTING comments about Charlie. They were from Argentina, Brazil, Germany, Mexico, Paraguay and South Africa. They were not identified.",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like how they picked them like the Planeteers!",
                "author": "BeauHD"
            },
            {
                "raw_content": "How about revoking the visas of the millions of others who come to steal, cheat, destroy, and plunder our country. You know like the millions of pajeets, Muslims, Asians, south Americans. Get them all out.",
                "author": "invalid_data"
            },
            {
                "raw_content": "I can't imagine getting a visa, going to another country, then talking shit when something happens to a political figure. They ain't sending us thier best",
                "author": "rastren"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Director of National Intelligence, Tulsi Gabbard says Trump NEVER SLEEPS on OVERSEAS Trips. “He takes these long trips, long flights, doesn’t sleep, works throughout the flight, hits the ground running, and immediately gets down to business.”",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's said that he seems roughly 15 years younger based on his health.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Dude didn't take a day off when his brother died during his campaign. Always worried about his health but he has some incredible genetics going on.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "He's also 79 years old and needs a fucking nap every once and a while. GEOTUS needs to stay healthy!",
                "author": "TrumpIsMyyPresident"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHOOPI: \"We have to take a break.\"",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember, Whoopi, the obese retard, once nominated fake doctor Jill Biden to be the Surgeon General.",
                "author": "raptormissle"
            },
            {
                "raw_content": "Whoopi is racist and hates white people with a passion. She also hates Jews, even though she appropriated the name Goldberg. Make it make sense. She is also very pro Palestine, supports Hasan Piker, George Floyd, BLM, and is a staunch advocate for abortion. No one should care what she thinks, and she needs to fade away into obscurity.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "These stupid fuckin people believe RFK is just spouting this shit off the cuff as if he doesnt have a full research team giving him this info. You dont have to be a fuckin Dr to understand this stuff and form an opinion.",
                "author": "MolonAABE"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 Breaking - James Comey is contesting the legality of President Trump's appointment of Lindsey Halligan as U.S. Attorney in court.",
        "score": 1058,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grasping at straws. He knows he's fucked.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "When he was FBI Director, he thought he was a Federal prosecutor. He decided not to forward the email case on Hillary for prosecution, because \"no reasonable prosecutor\" would bring a case against Clinton for emails. Now he thinks he's a Federal Judge.",
                "author": "mass55th"
            },
            {
                "raw_content": "Wasn't that tactic used with Jack Smith? Except I think this is a slightly different situation.",
                "author": "SisterCovfefeToo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So terrible!",
        "score": 478,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Time # to # make # some # A R R E S T S",
                "author": "DJT_is_King"
            },
            {
                "raw_content": "This is like an ongoing TV Soap Opera . Two years from now I will see the same breaking news like I jave for the last 10 years.",
                "author": "Stolen"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115376185480428142 Sauce https://justthenews.com/government/congress/congress-collected-30-million-lines-phone-data-trump-j6-probe-raising-civil",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senate Democrats just BLOCKED reopening the federal government for the EIGHTH TIME.",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. The longer it's shut down, the better.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Zero fucks given",
                "author": "Magma_Biscuit"
            },
            {
                "raw_content": "Do Not Care",
                "author": "NadlersNads"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Javier Milei has my Complete and Total Endorsement — He will not let you down. MAKE ARGENTINA GREAT AGAIN!",
        "score": 1227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't cry or Reeeeee Argentina...",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Javier is in the unique marketing position of being able to reuse Trump's MAGA merch for his own campaign.",
                "author": "raptormissle"
            },
            {
                "raw_content": "Bit worried that his bid for reelection has become shaky",
                "author": "NimbleNavigation2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : Freedom is not a theory, it's a testimony. Every single day the Trump Administration will continue to carry out the mission for which Charlie Kirk lived. For Charlie. ❤️",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do love my Freedom, I didn't risk it like Charlie Kirk did but he leaves a legacy bigger than himself. I regret not being able to protect him. Even though we are free, we live in a dangerous society and I regret I didn't protect even my son enough, or prepare him for such a hateful country. One of the many gifts Charlie left us with is there was enough love to grow and raise the next generation and I just don't have it in me like he did for us. My son thanked me for never physically hitting him and for being kind and loving. That's all I ever saw Charlie Kirk be, I still don't understand how the left painted such a different light of him and how could they not see that his intentions were to help them be better and ind the love of Jesus. There was something that we all missed and didn't do. Happy Birthday Charlie! Enjoy your freedom son.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Charlie would want justice for Epstein victims",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "Of course people can't post anything from the White House truth social right...... Have to go to Twitter so f****** annoying",
                "author": "Texasnumber1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jasmine Crockett: Won’t acknowledge Trump bring peace to Middle East, won’t say Happy Columbus Day, just posted glowing remembrance of George Floyd on his birthday. 🤮",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happy heavenly birthday Charlie Kirk.",
                "author": "rugburnd"
            },
            {
                "raw_content": "George Floyd killed himself. His life sparked nothing. His suicide was exploited by grifting BLM faggots to leech money off retarded lefties.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "How many years sober is he now?",
                "author": "PMSocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOUSE RETARDS",
        "score": 570,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My town actively kicks them out. Guess what, we don't have tents and trash everywhere and crime and open drug use.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "OK hair retard.",
                "author": "BarrysOFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dan Scavino REPOSTS his 2024 post exposing the disappearance of John Bolton’s documents from top-secret meetings.",
        "score": 344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "release the yellow notepads!",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "It is time to throw John Bolton in prison! Guantanamo Bay, Cuba would be a fine destination for this crook!",
                "author": "BeauHD"
            },
            {
                "raw_content": "keep prosecuting these deep state traitors and they will turn on each other",
                "author": "Choppermagic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KEK",
        "score": 2102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love that we have a government that can shitpost now",
                "author": "HellNoKameltoe"
            },
            {
                "raw_content": "Too bad it's a shitpost. I hope they do everything to the no kings protesters that was done to the J6ers.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "If they broke out the K9's and water cannons, I would be ok with it",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Google Pixel 10 Pro Fold exploded during JerryRigEverything's review",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I held my breath. Would not wanna be breathing in those fumes.",
                "author": "Flintloq"
            },
            {
                "raw_content": "I get that it's absurdly extreme testing, but it's *still* quite bad to have the weak point of the structure setup for maximum battery damage, especially when you have a fundamental phone layout that would let it break between the sections.",
                "author": "MumrikDK"
            },
            {
                "raw_content": "Burndown Skin incoming, I hope.",
                "author": "manicdan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Announces \"Crescent Island\" Inference-Optimized Xe3P Graphics Card With 160GB vRAM",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, so they salvaged something from Falcon Shores, it sounds like. Think LPDDR is a great fit. Better capacity and energy efficiency than GDDR, and better capacity and cost than HBM. And speed should be plenty sufficient for this tier of card. Probably a couple hundred watts, mostly PCIe form factor. Edit: Xe3p is giving me pause. Was not the IP version used for FCS. So that implies this is either more a leverage of the client IP (NVL-AX?), some combo of client+server, or something new entirely. Doesn't seem like Celestial (client dGPU), at least.",
                "author": "Exist50"
            },
            {
                "raw_content": "This seems interesting, though could be really late to the table. No word on the bus width and current Strix Halo and DGX Spark memory bandwidth are \\~256GB/s and \\~273GB/s respectively (both 256-bit busses). It'll fall flat if it's around those numbers especially to something like an M4/5 Max with \\~546GB/s of MBW. So, token generation could be slower or not much different to current machines and I'm not too optimistic on it's prefill/prompt processing as DGX Spark will probably hold that crown till then (M5 could be a surprise in this category, I will say). But, from what I read it seems to be a DC product, to which I guess is more related to Rubin CPX? As in, cost effective, perf/watt, so no expensive HBM (though, CPX uses GDDR7) or maybe complicated packaging (so not comparing it to MI450 or Vera Rubin). Just fitting the largest model in memory seems to be the goal.",
                "author": "Noble00_"
            },
            {
                "raw_content": ">160GB :) >of LPDDR5x :(",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] Leaked FSR4 INT8 Test: RDNA 3, RDNA 2, Steam Deck, Asus ROG Ally, Nvidia + Xbox Series X Simulation",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully this is made official sometime soon; would be nice to have competent upscaling on consoles.",
                "author": "jenesuispasbavard"
            },
            {
                "raw_content": "1:48 Strobe light warning",
                "author": "GrumpySummoner"
            },
            {
                "raw_content": "What an incredible phrase at 6:36. I should start using that.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] The best 360mm AIOs right now",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder what's up with the Arctic Liquid Freezer III PRO? It seems so unlike Arctic to go from leading the pack to being at the back by a noticeable margin. Does anyone have any insight on this?",
                "author": "BeTheBestBeast"
            },
            {
                "raw_content": "Tested: * Arctic Liquid Freezer III PRO * ASUS PRIME LC360 * Cooler Master Atmos Stealth * Corsair Nautilus RS no RGB * Corsair Nautilus RS ARGB * Corsair Nautilus RS LCD * Endorfy Navis F360 * ID Cooling FX360 INF * ID Cooling FX360 PRO * Lian Li Galahad 2 Lite Performance * Montech HyperFlow Silent * Phanteks Glacier One M25G2 * ROG Ryujin III Extreme * Thermalright Frozen Edge * TRYX Panorama",
                "author": "kikimaru024"
            },
            {
                "raw_content": "Tldw: Which is the quietest and best performing one?",
                "author": "Aggravating_Ring_714"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intels Panther Lake Recap",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mildly cringe delivery at times .. BUT a coherent summary of Intels Patnther Lake tech. My take : I was hoping Intel didnt drop the ball after some excellent Lunar Lake innovations. I'm a fan of CPU-GPU-cache all being close with low latency between. I think it has a lot of potential for things like local ML and Reinforcement Learning apps, which could bounce data between CPU and GPU [ simulation on CPU then Neural Network or rendering on GPU ] These kind of balanced CPU-GPU on a single package - such as Panther Lake and Strix Halo - might lead to new kinds of AI games, AI engineering apps, 3D in web browser etc. Fantastic win to have PantherLake on 18A also. OG devs like me grew up with Intel and AMD pushing the envelope every 6months .. we want Intel to survive and give us economic growth : now that Moores law has slowed down, that growth will come from many core and applied AI.",
                "author": "justgord"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD \"Sound Wave\" Arm-Powered APU Appears in Shipping Manifests",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Finally got a switch 2",
        "score": 656,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want chick fil a",
                "author": "dankpie"
            },
            {
                "raw_content": "Welcome to the club!",
                "author": "No-Ice-7982"
            },
            {
                "raw_content": "You started with one of the best games on the platform. I’m sure DK is good too.",
                "author": "twili-midna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A | Switch vs Switch 2 | Graphics Comparison",
        "score": 334,
        "text_content": "Thanks to ElAnalistaDeBits for the video. Increased resolution and 60fps is nice. Would've liked to have seen them go further with the Switch 2 improvements though, considering the higher price point.",
        "comments": [
            {
                "raw_content": "Switch 2 version still looks better. Even if by not much. Maybe Gen 10 will finally change the graphics since it’s just Switch 2?",
                "author": "Reddit_newguy24"
            },
            {
                "raw_content": "Why is there still pop-in on the Switch 2? Jesus... Gamefreak...",
                "author": "rooky711"
            },
            {
                "raw_content": "game freak never change",
                "author": "skynovaaa"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Pickups",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does the Gex trilogy work on switch 2 now?",
                "author": "TheBraunstr"
            },
            {
                "raw_content": "How much better does BoTW run on Switch 2 honestly?",
                "author": "Gridiron_Geek_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A Version 1.0.1 is now available.",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Patch Notes: * We have added data that needs to be updated in order to play online features.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Just let me play it already :/",
                "author": "6Y1O3W"
            },
            {
                "raw_content": "patch notes before actual release",
                "author": "Teufel9000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I added coloured sticker buttons on my switch",
        "score": 150,
        "text_content": "And they actually help me with rhythm games! (since arrow colours match with the letter colours) Also i love the soft rubbery feeling of them. I didn't really plan on getting those, just the joystick caps, but since i found them as a package deal, i said why not lol",
        "comments": [
            {
                "raw_content": "Reminds me of the Japan/PAL SNES design, good stuff",
                "author": "ZeldaFan158"
            },
            {
                "raw_content": "\"New\" Switch 2 coming out 2029 (includes motion tracking 3d)",
                "author": "Vinderman64"
            },
            {
                "raw_content": "Where did you get them?",
                "author": "sraymonds80"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends: Z-A - Reviews Thread",
        "score": 264,
        "text_content": "# Game Information **Game Title**: Pokemon Legends: Z-A **Platforms**: * Nintendo Switch (Oct 16, 2025) * Nintendo Switch 2 (Oct 16, 2025) **Trailers**: * [Pokemon Legends: Z-A - Official Trailer | Pokemon Presents 2025](https://www.youtube.com/watch?v=Jju96VEcZvk) * [Pokémon Legends: Z-A Official Announcement Trailer](https://www.youtube.com/watch?v=5AlzqemqVs0) **Publisher**: Nintendo **Review Aggregator**: [**OpenCritic - 83 average - 60% recommended - 5 reviews**](https://opencritic.com/game/18645/pokemon-legends-z-a) [**MetaCritic - 81 Average - NIntendo Switch 2 - 5 Reviews**](https://www.metacritic.com/game/pokemon-legends-z-a/) # Critic Reviews [**Gfinity**](https://opencritic.com/outlet/803/gfinity) \\- [Alister Kennedy](https://opencritic.com/critic/10213/alister-kennedy) \\- [7 / 10](https://www.gfinityesports.com/article/pokemon-legends-z-a-our-review) >A decent enough game that fails to innovate in the same way Legends Arceus did, Pokemon Legends Z-A feels like a wasted opportunity that may only be worth it for die-hard fans. [**Glitched Africa**](https://opencritic.com/outlet/687/glitched-africa) \\- [Marco Cocomello](https://opencritic.com/critic/2466/marco-cocomello) \\- [9 / 10](https://www.glitched.africa/pokemon-legends-z-a-nintendo-switch-2-edition-review) >Pokemon Legends: Z-A changes the pace with an exhilarating new combat system and exciting new Mega Evolutions to discover, all centred around a familiar yet oddly different setting that pays tribute to one of Game Freak’s most underrated regions. [**PPE.pl**](https://opencritic.com/outlet/642/ppe-pl) \\- [Wojciech Gruszczyk](https://opencritic.com/critic/5528/wojciech-gruszczyk) \\- *Polish* \\- [9 / 10](https://www.ppe.pl/recenzje/386684/pokemon-legends-z-a-recenzja-gry-zaskakujaco-przyjemne-odswiezenie.html) >Pokémon Legends: Z-A is exactly what this series needed – a fresh idea, technical refinement, and new energy. The developers finally dared to combine experimentation with classic elements, creating an adventure that is engaging, looks great, and proves that the world of Pokémon can evolve without losing its identity. It's not perfect – the pace is uneven and the difficulty level is too conservative – but it's still one of the most satisfying installments in the series in years. [**Shacknews**](https://opencritic.com/outlet/62/shacknews) \\- [Donovan Erskine](https://opencritic.com/critic/4485/donovan-erskine) \\- [9 / 10](https://www.shacknews.com/article/146331/pokemon-legends-za-review-score) >Quote not yet available [**XGN.nl**](https://opencritic.com/outlet/810/xgn-nl) \\- [Luuc ten Velde](https://opencritic.com/critic/8359/luuc-ten-velde) \\- *Dutch* \\- [7 / 10](https://www.xgn.nl/review/pokemon-legends-z-a-review-legendarisch-uitstapje) >Pokémon Legends: Z-A offers a great, new way of play while offering an expansive city to explore. Though the game isn't pretty in the slightest, it's hard not to enjoy everything this package has to offer. Sixth Axis - 10.0/100 >Unlike the most recent Pokémon Scarlet & Violet, Pokémon Legends: Z-A is a game that really holds your attention. The spiritual successor to Legends Arceus, it's learned from the mistakes of the distant past and beautifully shows what city life is like in the Pokémon universe. I can see myself playing this for another hundred hours as I finish my Pokédex, shiny hunt and generally have a great time. This is easily the best Pokémon game on the market. Shacknews - 9.0/100 >Pokemon Legends: Z-A gave me just about everything I wanted from a new Legends game. It continues the trend of bucking against series norms while maintaining the essence of what makes these games so special for fans. RPG Site - 9.0/100 >Years ago, I said that Pokemon Legends: Arceus proved that there was room in the Pokemon world for more games like Pokemon Colosseum to exist, and to even thrive. While Pokemon Legends: Z-A wasn't quite what I had in mind, it feels like validation nonetheless. Pokemon is at its best when Gamefreak is allowed to experiment with what a Pokemon game can actually be, and Pokemon Legends: Z-A is an affirmation that the series isn't done evolving, much like the Pokemon themselves. If this is the future of the series - more experimental \"Legends\" titles which attempt to broaden the Pokemon world in ways that only they can, instead of merely retreading old ground with remakes - I couldn't be happier. Siliconera - 9.0/100 >Pokemon Legends: Z-A is a follow-up to Arceus that feels both similar and different due to its focus on living alongside Pokemon in a modern city. The two themes are Mega Evolution and embracing life alongside Pokemon, and Game Freak and Nintendo are constantly showing and telling how that works. Admittedly, I miss the more varied biomes and locations from Arceus. But I do appreciate the story, the ambiance, the attention paid to characters, and how much it feels like a real city. After over 35 hours with it, I'm quite pleased. GamesRadar - 8.0/100 >Pokemon Legends: Z-A offers a true slice-of-life Pokemon experience thanks to its anime-style real-time combat system and wholesome worldbuilding elements. While its single-city setting can sometimes feel a bit samey, Lumiose is densely packed with things to do and discover. This is a world worth getting lost in. VG247 - 8.0/100 >Hopefully Game Freak will continue using the Legends series as a playground (maybe a return to pixel graphics, just a suggestion), but, for now, Lumiose City has been a treat to revisit. Nintendo Life - 7.0/100 >Pokémon Legends: Z-A should be celebrated for its fabulous real-time combat and its largely smooth jump to the Switch 2, but in condensing things down to one single location, it loses part of the Pokémon magic that Arceus and many other entries managed to amplify. I'll forever find filling up my Pokédex fun, and for the Switch 2 generation, this is a good starting point for the franchise. But if the Legends series is to continue, it needs to recapture its personality and fuse that real-time system with a bit more freedom. Eurogamer - 6.0/1.0 >Lumiose City could do with work, but Pokémon Legends: Z-A is a much more tightly focused - and delightfully goofy - return to better form. At least by modern Pokémon's standards. IGN - TBD >I'm just so genuinely excited about what Game Freak has done here. \\[Review in Progress\\] # Videos [VGC - ](https://www.youtube.com/watch?v=haH-EGFHlJM&pp=ygUbcG9rZW1vbiBsZWdlbmRzIHotYSByZXZpZXcg) 5/5 >Pokémon Legends Z-A is a grand adventure that once again proves that the Legends series is home to the most interesting ideas Game Freak has. It's a game that understands its audience, and feels like a love letter to both players who grew up with X & Y, and those who've been here the whole time. The new battle system really worked for me, and the Rogue Mega Battles are bombastic fun, even if, like the traditional turn-based offering, it can get very easy as you level up your team. I hope the Pokémon Legends series is here to stay.",
        "comments": [
            {
                "raw_content": "These reviews both love and hate the same things its kinda nuts. I guess it all depends on what you want out of this franchise.",
                "author": "thebigcrawdad"
            },
            {
                "raw_content": "I love the first quote says the game doesn't innovate like Arceus and the second review's quote says it's a breath of fresh air lol",
                "author": "DueSeesaw6053"
            },
            {
                "raw_content": "I personally didn't enjoy the gameplay loop of Arceus with trainer battles and gym battles being non existent, so I'm excited to give ZA a try. I also never got a chance to play with Mega Evo's since I never had a chance to buy or play a 3ds and during my time, it was super hard to emulate 3ds games so I was stuck playing DS/GBA pokemon games. Mega Evo's where the one thing I always wanted to experience even as a kid, so I'm glad I can finally experience them with ZA. And also, my favorite pokemon Sceptile is here...",
                "author": "-Thalas-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Early Technical Impressions of Elden Ring from PAX Australia",
        "score": 17,
        "text_content": "I am a huge fan of this game and I have played the game on PS5, PS5 Pro, and Steam Deck. I even pre-planned my route so that I could speedrun to Liurnia of the Lakes as this is quite a graphically intensive area. All impressions below are from handheld mode. * The image quality of the game is exceptional. They are clearly targeting medium to high settings that looks closer to the current-gen versions of the game. The visuals exceeded PS4 and PC's low settings. * Visual features like draw distance, fog, and foliage density looked great. * The game isn't native-res and appears to be reconstructing its image from 720p-900p. Unfortunately, performance is still very shaky and more work needs to be done here. In the starting area (Precipice of Anticipation), the game runs quite poorly at around 15-20fps, likely due to the dust and fog in this area. Performance improves once we get to Limgrave with the game generally holding 25-30fps. It was quite striking at how the game just doesn't look downgraded in this area. Once I got Torrent, I rode to Liurnia of the Lakes to really test the game's performance. This area is very demanding as it features heavy water reflections, prominent fog, and panoramic vistas of the area. Performance did suffer in this area but I felt that the game was still playable at around 20-30fps. In this area, foliage pop-in was quite bad. Dense tufts of grass and foliage would pop-in literally right in front of me which was extremely distracting. The screen space reflections in the water are retained in this game but they render at quite a low resolution. The fog was also dense and matched the visual acuity seen on other platforms. --- I get the impression that they are prioritising visual appearance over performance with this port. As you've gathered by now, the game's graphics settings are quite high to the detriment of performance. The Low preset on Steam Deck generally averages 40fps so I am surprised that they didn't just put it on low settings and called it a day. There is still a lot of work to be done based on the version I played but it does seem like they are putting in the effort to create a bespoke Switch 2 version. It seems unlikely at this stage but a 40fps performance mode would be amazing!",
        "comments": [
            {
                "raw_content": "Hmm I wonder if this was a newer build than PAX West or if they are just using the same build for all public events. Either way, it definitely makes me a little nervous about their 2025 release date. We are already halfway through October which just leaves November and December. Maybe we get a surprise drop at TGA along with a first look at the next FromSoft game.",
                "author": "TerminatorJ"
            },
            {
                "raw_content": "Elden Ring at that booth is the only Switch 2 game that wasnt docked. It was explained to me they got rid of the TV's because the game ran so poorly when they tested it. It still ran poorly on handheld. I think this should give you a pretty clear indication.",
                "author": "Bombasaur101"
            },
            {
                "raw_content": "We don’t even have a release date for this game. I wonder if they delayed it to optimize the game more.",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What’s the deal with the passive battery use?",
        "score": 26,
        "text_content": "I had my Switch 2 charged to 100% for a trip, put it in airplane mode, wifi off, and turned the console completely off. Not even 3 days later I went to use it and the battery was completely dead… what gives? What is the console doing to be completely dead in just 3 days without even turning it on? Edit: yes it was completely powered off. Held down the power button and selected “Power Off”. I know the difference between sleep mode and a powered off console…",
        "comments": [
            {
                "raw_content": "This probably doesn't matter in your case, since you had it powered off completely and not in sleep mode, but in system settings, under \"sleep mode\", there's a setting called \"keep wired connection active in sleep mode.\" It's only supposed to affect downloads and updates while docked, but I swear there's a bug where it's constantly looking for an internet connection in sleep mode and it drains the battery. I take my Switch with me to work sometimes, and before I turned that setting off it'd be down below 50% several hours later when I had some down time. Now it's still around 95% after the same amount of time. Sounds like your situation is different but it might still be worth checking that setting to see if it makes a difference.",
                "author": "Filthy_Luker"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "I just had mine in a bag powered off from Wednesday to Monday while I was on a trip and I think it went down like 7% . It really seems like it wasn't actually off",
                "author": "GIANT_Dom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Halo Combat Evolved Remake to feature sprinting, game is a Full Remake",
        "score": 621,
        "text_content": "Information via Infinite\\_leaks: >I can definitely confirm the Halo CE Remake will have sprint & \"modern gameplay mechanics\". I'm of the belief it's gameplay will be similar to the new Halo Multiplayer game, which I also believe is Halo 7's MP. >it's a full remake similar to the Resident Evil remakes. [Source 2](https://xcancel.com/leaks_infinite/status/1977798436612165691#m) [Source 1](https://xcancel.com/leaks_infinite/status/1977798315686137943#m)",
        "comments": [
            {
                "raw_content": "10 more years and 2 new playerbases to join in sprint discourse! Let the chaos begin",
                "author": "notewise"
            },
            {
                "raw_content": "i hope we can fly a pelican",
                "author": "Cooz78"
            },
            {
                "raw_content": "I mean this is cool but I was really hoping for Halo 3 anniversary. H3 is my favorite FPS campaign of all time and it’d be nice to see with a fancy coat of paint even though it still doesn’t look all that bad today (apart from the faces)",
                "author": "Narrow_Technician_25"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Universal Studios takes down video for a portion that included allegedly leaked prototype Luigi and Bowser Jr. toys for The Super Mario Galaxy Movie.",
        "score": 247,
        "text_content": "Original leak: [Reddit post](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nibj5l/character_possibly_leaked_for_the_super_mario/) YouTuber explains takedown: [YouTube video](https://www.youtube.com/watch?v=nnNU8UIJJd8)",
        "comments": [
            {
                "raw_content": "The [original post](https://www.reddit.com/r/WorldOfNintendo/s/GkrlfFSEVD) also got taken down via a copyright notice.",
                "author": "ornjos"
            },
            {
                "raw_content": "Never heard of this channel before. But it looks like a normal Youtube channel with news and commentary on Nintendo. \\*checks out a few videos It is in fact a normal channel, don't know why OP felt the need to poison the well. Especially when he provides screenshots of the copyright claims he got",
                "author": "mattattack88"
            },
            {
                "raw_content": "His video titles *are* clickbait, there's nothing alleged about it haha but it's interesting I guess. But he's a commentator, not a leaker overall",
                "author": "Hydroponic_Donut"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC: Assassin's Creed Boss is leaving Ubisoft after two decades due to Tencent subsidiary",
        "score": 551,
        "text_content": "[https://www.videogameschronicle.com/news/assassins-creed-boss-marc-alexis-cote-quits-ubisoft-following-start-of-new-subsidiary/](https://www.videogameschronicle.com/news/assassins-creed-boss-marc-alexis-cote-quits-ubisoft-following-start-of-new-subsidiary/) >In an internal note sent to staff on Tuesday, Ubisoft thanked Coté for his contribution to the action-adventure series, which he’s worked on for nearly two decades as a designer, director, and producer. >Since 2022, Marc-Alexis Coté has led Ubisoft’s global teams on the Assassin’s Creed franchise, shaping the long-term strategy of the series. >Notably, he was co-director for Assassin’s Creed III (2012), the creative director for 2014’s Assassin’s Creed: Syndicate, and producer for every release since.",
        "comments": [
            {
                "raw_content": "Unless I’m mistaken, no where in that does it say he leaving because of the subsidiary? He was offered a leadership position but declined it. Now is there a good chance he left because of that? With the timing of it all, yeah probably. But I don’t think it’s a fact like the title suggests it is.",
                "author": "Gen6V"
            },
            {
                "raw_content": "Good. He was one of the names mentioned during the Ubisoft fiasco of 2020 as a bad and controlling boss. Edit: https://www.gamedeveloper.com/business/new-allegations-show-the-cycle-of-abuse-and-misconduct-runs-deep-at-ubisoft",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "He wasn’t the right fit for leading the entirely of Assassins creed. All of his projects, while enjoyable for a group of players, did not retain any of the unique building blocks that made AC what it was. He was great at leading good general history action games, but not really interested in the universe of AC and what it meant. The Montreal studio and more recently the Bordeaux studio have a much better grasp of this, and so I hope someone from one of those teams takes over to spearhead the franchise. But for me personally, I think this is actually a good thing.",
                "author": "ajl987"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Junichi masuda and Shigeru Ohmori were outed as directors for the Pokemon series",
        "score": 298,
        "text_content": "https://xcancel.com/CentroLeaks/status/1978095519286050884 This is also coming from the Pokemon Gigaleak that happened a few days ago. It seems masuda was a very dominant games director that lead to him being banned from making games at the company. The full document can be found here, in Japanese https://files.catbox.moe/fbnop6.pdf It also seems that Ohmori was also outed as a director Which can be found here https://xcancel.com/CentroLeaks/status/1978101555510272426",
        "comments": [
            {
                "raw_content": "You mean ousted?",
                "author": "codefreak8"
            },
            {
                "raw_content": "These are all being machine translated so I would wait for someone to properly translate it.",
                "author": "thetiredjuan"
            },
            {
                "raw_content": "Masuda has only directed two games in the last 12 years anyway (Let's Go and BDSP) Ohmori basically had taken his role of series director after ORAS. I know Masuda did consult and still contributed to soundtracks but it feels like he's been soft retiring for a while now.",
                "author": "Andybabez20"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Shadows will be dropped on Switch 2 on December 5th",
        "score": 359,
        "text_content": "https://www.dealabs.com/magazine/assassins-creed-shadows-debarquera-bientot-sur-switch-2-on-vous-devoile-la-date-de-sortie-60629",
        "comments": [
            {
                "raw_content": "I was expecting 2026, very surprised. Curious to see how it looks but not sure I'm keen to play again so soon.",
                "author": "KingMan753"
            },
            {
                "raw_content": "50€ is unexpected",
                "author": "Enryx25"
            },
            {
                "raw_content": "Not gonna lie, I’m kinda excited for this. I was marginally interested in an AC game for the first time in years with Shadows, but just never pulled the trigger on Steam for some reason. I know Outlaws was a neat graphical showcase for the Switch 2 but I have very little interest in Star Wars so this is perfect. Assuming it isn’t a technical nightmare of course.",
                "author": "adeepkick"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "LittleBigPlanet Builds Leak (LBP July 2008 Build + LBP3 April 2013 Pitch Build)",
        "score": 364,
        "text_content": "From [Imagisphere's Channel, home of the LittleBigPlanet builds](https://www.youtube.com/@in-imagisphere/videos). They were able to score two LBP builds from a LBP mid-2008 build with a LBP3 2013 pitch build that's now shown to the public containing goodies of content that was changed from the final retail releases. [LBP3 2013 Pitch Build](https://www.youtube.com/watch?v=LpA6SoslFpU) [LBP1 Freezeatron (Ice Hazard Showcase)](https://www.youtube.com/watch?v=LpA6SoslFpU) Two weeks late, but I want to showcase that LittleBigPlanet fans have gotten something good, with Sony sadly neglecting the little sack in favor of other franchise priorities. This, along with [LBP2's 2010 April build](https://www.youtube.com/watch?v=daM3Fu1AN88&list=PLEginNl41c0YZFlbxC_VyF_SNPMhPB8Lg) ([June 2010 Pre Beta ](https://www.youtube.com/watch?v=FhLds--GR5Q&list=PLEginNl41c0bnl0sT6D_-mIPt4rU5qsoc)and [May 2010 Build](https://www.youtube.com/watch?v=D-jXTHdKfwM&list=PLEginNl41c0ZMS4oOuLzCZnM4OGHo1dOX)), is a treasure trove for preservationists and us fans with leaked builds of older games.",
        "comments": [
            {
                "raw_content": "Always love seeing this kind of thing NOW GIVE US LBP4 ![gif](giphy|l4JyRYDsbS2EbPbtS)",
                "author": "TopBoog"
            },
            {
                "raw_content": "I know we probably never will, but it would be cool to get the 2007 build that was in the [early GDC demo](https://youtu.be/oS0eaRnbC6Y) before the game had its 3 layer system.",
                "author": "Dasnap"
            },
            {
                "raw_content": "Bring back the sack 🫡",
                "author": "CuteBoyHarry"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel confirms Xe3p GPU architecture for Nova Lake-S in new Linux kernel update",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best, finally stepping in the right direction",
                "author": "ClockResponsible4866"
            },
            {
                "raw_content": "Not all NVL.",
                "author": "Exist50"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Core Ultra 300 “Panther Lake” CPUs appear in HWMonitor update, flagship Core Ultra X9 388H confirmed",
        "score": 30,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "“The low inventory excuse doesn’t work anymore” — the peculiar reason why Americans are shunning real estate",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reality is lots of people went crazy into real estate because of the pandemic. Passive income from real estate and people just moving because being trapped at home made them crazy. Everything has cooled down and people have realized being a landlord isn’t free money. I’ll say this all the time but the problem with home prices isn’t supply and demand but it’s turnover. The more transaction going on will drive up prices no matter the supply and demand.",
                "author": "Glock99bodies"
            },
            {
                "raw_content": "Im in the dmv area and the 500-1.5 million dollar homes are all seeing price reductions. Interestingly ive seen price increases for houses above 1.5",
                "author": "Prudent_Knowledge79"
            },
            {
                "raw_content": "I think the issue is partly psychological in nature, it’s one thing to get taken advantage of by Uncle Sam or some huge corporation, but those of us on the sidelines see our peers and neighbors asking us to fund their financial freedom in spite of the fact they may have done little in their own careers to help themselves compared to the person looking in. No one wants to look like a sucker in their own neighborhood. The American dream became a screw over the next person scheme. No thanks. The fact that they are only willing to sell at a massive profit instead of a respectable one demonstrates this clearly. I know people triple leveraged and playing landlord in spite of a very modest income. meanwhile I can’t find a reasonable first home to stop wasting money on rent. Let it burn",
                "author": "sirpsychosexy8"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed's Powell suggests tightening program could end soon, opens door to rate cuts",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, economic downturn? I mean that's the only reason where rate cuts make sense, right?",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Rate cuts lmaooo stagflation here we come",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "We’re actually so fucked",
                "author": "malaka_alpaca"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Andrew Ross Sorkin on worrying similarities between Wall Street today and 1929's pre-crash market",
        "score": 183,
        "text_content": "The multi-asset bubble. [https://www.youtube.com/watch?v=26WMF7Xdb0E](https://www.youtube.com/watch?v=26WMF7Xdb0E)",
        "comments": [
            {
                "raw_content": "1928: \"Don't worry, the fundamentals are strong.\" 2008: \"Don't worry, the fundamentals are strong and we have the FDIC and SEC.\" 2025: \"Don't worry, the fundamentals are strong and we have the FDIC and SEC and Dodd-Frank.\" In 1928, you knew there was a problem when everyone from the guy shining your shoes to the Pharmacist owned stocks. In 2008, you knew there was a problem when everyone from strippers to the local pastor was flipping houses. In 2025, you know there's a problem when the same stripper is a real-estate agent and her and the mail man own multiple rental properties, are underwater by tens of thousands on their cars, almost everything costs 40% more, and everything is \"AI\". When the government needs to remind you that the \"fundamentals are strong\", time to run for the hills.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "“We can’t lose!!” -Wall Street before every big crash",
                "author": "slifm"
            },
            {
                "raw_content": "So what does an everyday plebe like me actually DO to prepare for something like this? Other than transferring everything to MREs & ammo, it feels like my only option is to ride the wave, eh?",
                "author": "CoinMaple101010"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Chicago leads the nation in apartment rent growth amid tight supply",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chicago alderman, city zoning, building codes, and NIMBYs are to thank for the skyrocketing rent. If Chicago allowed more apartments, condos, townhomes, and single family homes to be built on vacant land, we wouldn’t be in this mess.",
                "author": "MikeMak27"
            },
            {
                "raw_content": "Housing prices in the burbs are still going over asking. A considerable amount too.",
                "author": "the_perfect_v1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "a poster of the latest humanoids",
        "score": 845,
        "text_content": "After almost a year since the last humanoid poster, here’s the new one! What a year for humanoids, in my 10+ years in the industry, none has been this productive. We tried to keep it fair, with a solid analysis of all nominees. I also talked directly with most of these companies to make sure they’re seriously working on biped capabilities, that was the main criterion this time. Feedback is always welcome. Enjoy, and grab the high-res version from the link in the comments.",
        "comments": [
            {
                "raw_content": "There's a company called Borg?? ![gif](giphy|TJawtKM6OCKkvwCIqX)",
                "author": "omenmedia"
            },
            {
                "raw_content": "wtf is Italy doing?",
                "author": "Ok_WaterStarBoy3"
            },
            {
                "raw_content": "I think Germany is missing an opportunity here. They have all the industrial infrastructure to shift from the automotive industry to becoming a world leader in developing humanoid robots.",
                "author": "hruhru"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "From Walking to Working: Spot Stacks Tires - RAI institute",
        "score": 84,
        "text_content": "Source: [https://www.youtube.com/watch?v=nM\\_ZHzp8nQA](https://www.youtube.com/watch?v=nM_ZHzp8nQA)",
        "comments": [
            {
                "raw_content": "It certainly is not well equipped for this task. That makes it much more impressive for me.",
                "author": "IWindyI"
            },
            {
                "raw_content": "Those movements are so lifelike. It actually looks like a new species.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "I suppose at some point the robots shouldn’t just be mindlessly pursuing some goal. If there’s some unexpected obstacle it should be able to stop, determine what the obstacle is, then have ways of dealing with it, like telling a human to please stop poking the tire with a stick so it can do its job",
                "author": "Different-Froyo9497"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Adult version in ChatGPT on December",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have to give ChatGPT my passport in exchange for esex😭",
                "author": "Butt_Plug_Tester"
            },
            {
                "raw_content": "I put on my robe and wizard hat",
                "author": "egg_breakfast"
            },
            {
                "raw_content": "Elon Musk forced their hand on this by offering it unapologetically.",
                "author": "MjolnirTheThunderer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "3.5",
        "score": 464,
        "text_content": "like seriously",
        "comments": [
            {
                "raw_content": "I still remember my amazement after trying AI Dungeon 2 (which was based on GPT2) in 2019. It was my first experience with AI. It's fascinating how much progress has been made since then.",
                "author": "ZCFGG"
            },
            {
                "raw_content": "Maybe I shouldn't get a dog after all.",
                "author": "Ignate"
            },
            {
                "raw_content": "It was GPT-3 that started it lmao. Arguably GPT-2 but most of you were still eating crayons",
                "author": "mumBa_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Veo tomorrow.",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Likely 1080p, 1 minute video length.",
                "author": "avilacjf"
            },
            {
                "raw_content": "Sora killler??",
                "author": "1artvandelay"
            },
            {
                "raw_content": "Does anyone know how long after that kind of announcement is the demo actually shown?",
                "author": "GraceToSentience"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jensen hand delivering a DGX Spark to OpenAI",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "next jensen post, is about delivering dgx spark to meta and markzuck",
                "author": "Nobel-Chocolate-2955"
            },
            {
                "raw_content": "1 petaflop? Isn’t that what supercomputers did a few years ago? A decade ago?",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "Anyone know what this will be used for?",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Japanese Government Calls on Sora 2 Maker OpenAI to Refrain From Copyright Infringement, Says Characters From Manga and Anime Are 'Irreplaceable Treasures' That Japan Boasts to the World",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't even think of how much of Japan's economy is boosted up by anime.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "Now they are worried about their animators when they’ve been treated like actual slaves for decades",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Look at the comments some say ai isn't good enough some say it should be banned because it is too easy with ai to generate content fuckers want ai to fail because they have made up their minds that they hate ai, without giving any valid argument",
                "author": "ProperBlood5779"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "@Chetaslua UBUNTU Gemini 3.0 Pro - ONE SHOTTED",
        "score": 236,
        "text_content": "https://x.com/chetaslua/status/1978079564761907376#m",
        "comments": [
            {
                "raw_content": "Damn it can do everything except for releasing",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Gemini 3.0 has inherited all the expectations initially reserved for GPT-5 and then some. I wonder if Deepmind was forced to push back their release schedule because of this?",
                "author": "torrid-winnowing"
            },
            {
                "raw_content": "How many hours or days would it take someone to manually code something like this?",
                "author": "Weekly-Trash-272"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Western executives who visit China are coming back terrified",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">local authorities have offered large tax breaks that reimburse firms for a fifth of their spending on industrial robots. This is under a policy known as “jiqi huanren” – which translates to “replacing humans with machines”.",
                "author": "blueSGL"
            },
            {
                "raw_content": "The article mentions that China has 2 million industrial robots. In contrast, Japan has 0.4 million and the U.S. also 0.4 million. On the other hand, only a small percentage of these industrial robots are able to parse natural language which is English or Chinese. The assumption is, that most of the installed base was programmed with classical computerized numerical control (CNC), so there is space for improvement ...",
                "author": "ManuelRodriguez331"
            },
            {
                "raw_content": "Meanwhile we have a president who is focused on hoping our economy resembles the 1970s. Let’s bring back coal and manufacturing jobs that no one wants from those that are left who would want those blue collared jobs. The manufacturing tax breaks will likely mean we get more robotics ourselves but that ultimately will not help the economy for many years. Good times.",
                "author": "Annual-Replacement26"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OPENAI - TOMORROW - 9AM PST",
        "score": 15,
        "text_content": "Karina Nguyen, research & product @ openai, teases something for tomorrow 9am PST tweet just after VEO/V3O echoes from google",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/335iy4gub8vf1.png?width=860&format=png&auto=webp&s=e4c48a385e7aeb35e497ccc43930662865e134f0 openai vs google",
                "author": "Intelligent_Tour826"
            },
            {
                "raw_content": "View in your timezone: [TOMORROW - 9AM PDT][0] [0]: https://timee.io/20251016T1600?tl=OPENAI%20-%20TOMORROW%20-%209AM%20PST ^(_*Assumed PDT instead of PST because DST is observed_)",
                "author": "timee_bot"
            },
            {
                "raw_content": "gpt 5 new checkpoint perhaps maybe",
                "author": "XInTheDark"
            }
        ],
        "subreddit": "singularity"
    }
]