[
    {
        "post_name": "The Wall Street Journal printed a FAKE letter, supposedly to Epstein. These are not my words, not the way I talk. Also, I don’t draw pictures.",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Also, I don't draw pictures. Not sure why this made me chuckle.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "It's time to Shut Down the Wall Street Dishrag.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Trump art, so rare, would be worth billions",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please don’t show this to the Wall Street Journal. It is a hand sketch. They may think I’m a sex trafficker",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; It still needs some type of poem, or mystical words on top of the dress. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "would",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "She drew a stick tranny, ha.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fucking Rat Running.",
        "score": 305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember when he said that the only reason to pardon someone is if they're guilty? Pepe farm remembers.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "That fucker is going to be dropping the soap on purpose. I hope a giant black dude is next to him when he does.",
                "author": "NoFats"
            },
            {
                "raw_content": "same reason everyone bought a hummer when Bush put a tax cut on vehicles weighing over a certain weight Epstein was a honeypot just as much as ignored homestead tax loopholes were because no one was getting caught.",
                "author": "LibertyOrigins"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🦄 Government Employee Indicted for Threatening to Kill Rep. MTG, Staff, and Families 🚔",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "EVERYTHING YOU DO ON A GOVERNMENT DEVICE IS MONITORED. YOU GET POP UPS TELLING YOU THIS. YOU SIGN DISCLOSURES TELLING YOU THIS. What a dumb ass.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Most sane democrat voter",
                "author": "inksday"
            },
            {
                "raw_content": "**Archive Link**: https://archive.is/dv5he **Direct Link**: https://www.breitbart.com/politics/2025/07/17/government-employee-indicted-threatening-kill-rep-mtg-staff-families/ **Pepe Link**: [🐸👌](https://static01.nyt.com/images/2016/09/28/us/28xp-pepefrog/28xp-pepefrog-superJumbo.jpg)",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump says he will sue WSJ over “fake” story about letter to Epstein.",
        "score": 1235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If this ends up being the hoax Trump kept referring to and just somehow in his Boomer brain thought everyone knew ahead of time like he did, that's gonna be the funniest shit.",
                "author": "DatTrumpDoh"
            },
            {
                "raw_content": "This isn’t going to end. They’re going to endlessly pepper him with guilt by association. Better rip that Bandaid off and get it over and done with. We focus on the pedo angle, but there’s no doubt a lot of those on the list were lied to about ages or what have you. You have to keep in mind that mossad and Epstein were in the business of blackmail. So this means deception and lying were all on the table. Aka you drag someone rich out to the island and tell them if they don’t spirit cook they’re going to die on the plane ride back. I’m not apologizing for pedos, but just pointing out there is probably a fair deal of grey when it comes to Epstein. The blood libel, pedo, and satanic rituals not withstanding.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Lawsuit leads to discovery. He wouldn't sue if it were true.",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based on the ridiculous amount of publicity given to Jeffrey Epstein, I have asked Attorney General Pam Bondi to produce any and all pertinent Grand Jury testimony, subject to Court approval. This SCAM, perpetuated by the Democrats, should end, right now!",
        "score": 910,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should’ve done this on day one sir; but I do appreciate it nonetheless",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "notice how he didn't say release any relevant documentation? there isn't anything in a grand jury testimony that isn't public",
                "author": "DoMe22"
            },
            {
                "raw_content": "\"based on the ridiculous amount of publicity given to Jeffrey Epstein\"...........Trump was kidnapped and replaced by a shapeshifting space lizard. Its the only thing that logically makes sense.",
                "author": "HankScorpio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Wall Street Journal, and Rupert Murdoch, personally, were warned directly by President Donald J. Trump that the supposed letter they printed by President Trump to Epstein was a FAKE and, if they print it, they will be sued.",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sue the fuck out of them. They deserve to be destroyed.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "I will gladly eat crow and have all the eggs in the world on my face if he's actually baiting the fuckers into exposing themselves. I JUST WANT THE PEDOS FUCKING JAILED. And then America to get moving along again and get things really on track",
                "author": "My_dick_screamed"
            },
            {
                "raw_content": "Excellent 🍻🔥",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump—we are ready to move the court tomorrow to unseal the grand jury transcripts.",
        "score": 823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unseal it ALL. Everything. Just fucking do it. Rip off the Band-Aid. 🩹",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It's not just grand jury transcripts, we want everything. This sounds like more releases where we get info that we already knew.",
                "author": "MacaroniMAGA"
            },
            {
                "raw_content": "I think that Fake WSJ story finally sent him over the edge. Who want some 🍿 because I got a lot.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The lawsuit brought against the Trump administration by leftist FBI agents who conducted the corrupt J6 and Mar-a-Lago investigations has been THROWN OUT by a federal judge. Their case against the White House was SO WEAK that it was thrown out by a BIDEN judge 🤣🔥",
        "score": 1136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "&#65038; # NEVER FORGET, # they spent a MILLION MAN HOURS on the J6 persecutions. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "So seriously, what are these former FAGGOT FBI agents names?",
                "author": "HillaryRodhamCunton"
            },
            {
                "raw_content": "Now play the Uno reverse card and prosecute the corrupt parties involved. Otherwise, nothing changes.",
                "author": "HurtzLocker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Colbert Is Saying Goodbye",
        "score": 851,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mein Furher! I can talk show!",
                "author": "TheRedPike"
            },
            {
                "raw_content": "He finally going to prison?",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "No more amazing dance routines like the vax-scene? How sad.",
                "author": "fjobb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Libs of TikTok @libsoftiktok Remember that woman who Democrats and the media claimed was kidnapped from a parking lot by ICE, shoved into an unmarked car, held in a building, starved, to force her to self-deport???",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Lying media ate it up with ZERO investigation",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Now maybe she'll actually be deported, hopefully!",
                "author": "hillaryforprison"
            },
            {
                "raw_content": "What a fucking idiot",
                "author": "ERIC_CIARAMELLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seashells By The Seashore Are Based. 🐚",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "James Comey is actually G-Man from Half Life",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "No she didn't, she retired because her job of intentionally botching both the Maxwell case and Diddy case to ensure that no rich and powerful person got implicated in either case was complete, why was she not fired on Jan 20th",
                "author": "FKH2"
            },
            {
                "raw_content": "Hahaha, dumb bitch.",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seems legit cuz I'm a retard 🤷🏻‍♂️",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I asked the Ghost of Kiev if this was true and he said nothing because he died from not having the covid shot. The media doesnt lie.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "Lmao imagine all the handshakes here calling us doomers that are confused af about this post 😂😂",
                "author": "Snooptwo"
            },
            {
                "raw_content": "About as accurate as the average headliner story they post.",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: WSJ reports it reviewed a copy of a letter Trump allegedly sent to Jeffrey Epstein for his 50th birthday. President Trump denied writing the letter or drawing the picture. “This is not me. This is a fake thing. It’s a fake Wall Street Journal story,” he said.",
        "score": 877,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even their fanfic sucks.",
                "author": "shadypollster"
            },
            {
                "raw_content": "Oh yeah, that sounds like Trump. /s",
                "author": "inksday"
            },
            {
                "raw_content": "Ah. So they're not even trying to make it believable.",
                "author": "dogofwar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MTG Submits Amendment to Cut $500M in Missile Defense Spending for \"Nuclear Armed Israel\": \"They have universal healthcare and subsidized college. Meanwhile, Americans are $37T in debt.\"",
        "score": 1693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "America first.",
                "author": "flashersenpai"
            },
            {
                "raw_content": "Universal healthcare and subsidized college are two things we should stay very far the fuck away from, but she has a point.",
                "author": "dr_morgenes"
            },
            {
                "raw_content": "Incredible. Love her so much. \"Healthcare in Israel is universal and participation in a medical insurance plan is compulsory. All Israeli residents are entitled to basic health care as a fundamental right.\"",
                "author": "dailystreak"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: White House officials are preparing an executive order targeting tech companies with what they see as “woke” artificial-intelligence models — WSJ",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The government is never the best solution to any problem.",
                "author": "Repentnow"
            },
            {
                "raw_content": "Get rid of the H1B's and the problem will correct itself",
                "author": "yurimodin"
            },
            {
                "raw_content": "Don’t care. Epstein list or fuck off.",
                "author": "bubadmt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It gets worse…WSJ releases letter to Little Rocket Man",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At this point WSJ is fan fiction",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "This at least sounds more believable.",
                "author": "ElectionDenier2020"
            },
            {
                "raw_content": "I don't know if a single human being, let alone with average IQ, even edits WSJ anymore.",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: A man decided to SLASH the tires of ICE vehicles during a raid in California, and got absolutely TAKEN DOWN by ICE agents They maced him in the face and threw him in jail",
        "score": 1492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this. Hold the line.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "This guy isn’t working on a Thursday afternoon, figure out who put him up to this.",
                "author": "bck-"
            },
            {
                "raw_content": "When clicked on this, all I could think is \"please be video, please be video.\" Not the best footage, but I'll take it.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‼️🇺🇸 BREAKING: Nancy Pelosi is now AGREEING with TRUMP that Epstein is a 'distraction' and we need to \"focus on Trump's budget\" What alternate universe are we in? 👀 Is Nancy on the list? 🤔",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too many from both sides are on it?",
                "author": "Bidenthedumbass"
            },
            {
                "raw_content": "Nancy may not be on the list but I bet her hammertime husband is.",
                "author": "Talen_Card"
            },
            {
                "raw_content": "that's the LAST person i'd want defending me. wtf man",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dear Mr. Bolsonaro: I have seen the terrible treatment you are receiving at the hands of an unjust system turned against you. This trial should end immediately! I am not surprised to see you leading in the polls; you were a highly respected and strong leader who served your country well.",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Brazil needs some regime change....",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "Literally the same playbook. Stolen elections, corrupt judges and political lawfare, etc.",
                "author": "HurtzLocker"
            },
            {
                "raw_content": "Tropical Trump 👍🏽",
                "author": "Cali_kid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Firefox dev says Intel Raptor Lake crashes are increasing with rising temperatures in record European heat wave — Mozilla staff's tracking overwhelmed by Intel crash reports, team disables the function",
        "score": 909,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the mastodon thread, worth a read: https://mas.to/@gabrielesvelto/114813152373394985 from the firefox dev: > yes, this is a 100% Intel problem yikes....",
                "author": "ElementII5"
            },
            {
                "raw_content": "I would suspect most users do not associate their crashing with Intel and just accept it as something normal while using a PC. I am on AM5 and was on AM4 for some years before that. Can't even remember when my last crash was.",
                "author": "ElementII5"
            },
            {
                "raw_content": "These chips are still dying even though intel fixed the overvolt issue?",
                "author": "violet_sakura"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardwareluxx] Cyberpunk 2077 on Mac: Benchmarks with the M3 Pro (Cyberpunk 2077 auf dem Mac: Benchmarks mit dem M3 Pro)",
        "score": 54,
        "text_content": "First look so far on a Macbook Pro M3 Pro. Resolution is 1800 x 1125. Auto or \"For this Mac\" preset was used, unsure of the exact settings. MetalFX dynamic res is applied, 50% scaling min and 80% max. No FG was used (which uses FSR 3.1 FG). 30 FPS Setting Target: 29.95 FPS AVG (28.36 min/31.81 max) 60 FPS Setting Target: 49.48 FPS AVG (38.25 min/96.37 max) RT + 60 FPS Setting Target: 25.51 FPS AVG (21.16 min/30.63 max) Also, Schilling has stated in their test Metal FX upscaling has temporal stability problems.",
        "comments": [
            {
                "raw_content": "MFX upscaling looked pretty good at release, which was to be expected as it was an ML solution competing against FSR 2, but it looks like apple hasn't worked on it since. Maybe we'll see a new model with the release of frame gen?",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Maybe still early, or needs more updates, but first impressions is kinda meh, I guess? Do share of other hardware configs, if you do find articles or videos on CP on Mac silicon. Those interested I know youtuber [Andrew Tsai](https://www.youtube.com/@Andytizer) makes good gaming content for Mac Silicon and there's always r/macgaming which I found a [video on a Mac M4 Max (Mac Studio) ](https://www.youtube.com/watch?v=jghLKpzf_18)on that sub from [this post](https://www.reddit.com/r/macgaming/comments/1m2dghu/cyberpunk_2077_for_this_mac/).",
                "author": "Noble00_"
            },
            {
                "raw_content": "Interesting to see CPU performance here. After all, latency not IPC tanks Arrowlake. How is Mac M",
                "author": "ResponsibleJudge3172"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[AMD GPUOpen] Generative AI model for Global Illumination effects",
        "score": 20,
        "text_content": "Also wanted to share their update on there previous blog, [Neural Supersampling and Denoising for Real-time Path Tracing](https://gpuopen.com/learn/neural_supersampling_and_denoising_for_real-time_path_tracing/). Scroll down to the heading: *Multi-branch and Multi-scale Feature Network* and you'll see a video demo on what seems to be Ray Regeneration? Though, from what they described is more \"multi-branch, multi-scale feature extraction network for joint neural denoising and upscaling\".",
        "comments": [
            {
                "raw_content": "This research is an interesting one I suppose. From what I understood, taking diffusion models and implementing that for (real time?) global illumination. This is their early demo and research on using a diffusion model for caustic effects. This reminds me of those bizzare and uncanny Veo 3 videos, due to at times how well it generate lighting. Least to say, graphics tech will be very interesting to keep track of in the future, with neural rendering, coop vectors, work graphs etc",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Stagnation: 5 Years Of Radeon x600/x60 Class GPUs",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here before 8gb vram cards were released in 2014 and amd still making 8gb in 2025",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "9060XT 8GB looks incredibly good.....until it doesn't. Glad Steve addressed that.",
                "author": "HyruleanKnight37"
            },
            {
                "raw_content": "I never ever understand the argument of \"Its a good upgrade for X generation\" argument to justify stagnation. Nvidia glazers and Apple marketing use it endlessly. When to upgrade is a personal matter. It depends on budget. Patience or expectations of what to buy. But reviews has to justify the new launch compared to ehat it offered before and what progress has been made. Right now for my brother even a 7600 or 5050 is a major upgrade to toss his old 960M laptop chip. Or for me even a 5070 is a major upgrade even though how it underperforms compared to 4070super on an older gen Thats the key word here. When value proposition is low. No matter how it stands as an upgrade. A better upgrade will always be lurking for those who browse for deals.",
                "author": "Sevastous-of-Caria"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Q2 profit surges 60%, reaches historic high",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm, people see this, and think TSMC has nothing to do with chip pricing in the end. Edit: They don't have to be manipulative, they just have to charge double for wafers now then 3 years ago with no end in sight.",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "The CEO also said that N2 ramp is capacity constrained, and here we expect everybody and their grandpas to use N2 for their upcoming products.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": ">“Surging demand from the AI boom is highly sustainable in the near term, with AI still in its very beginning stages and continues to expand across industries,” Wang added. Yep. Agreed. Been saying this for a long time. A lot of people, especially gamers here, wish/think AI is a fad. It's clearly not and clearly just the very beginning of something that will go on for decades. My 1 year old post spells out my thoughts on AI chip industry: https://www.reddit.com/r/hardware/comments/1da3mqg/amd_is_right_about_ai_pcs_being_the_biggest/l7hzy4l/ Snippets: >In some ways, we're really like the 1960s in terms of computers. Back then, you needed computers the size of a small room to run basic software that we can run on a calculator today. Today, running something like GPT4 probably takes a small room full of GPUs in a datacenter somewhere. Over time, small computers could run demanding software and the personal computer was born. It'll likely happen in AI as well. Initially, small computers are hopeless. But the software (AI models in this case) mature and stop growing exponentially while the hardware gets exponentially better. >It's been a long time since we have mass-market software that modern chips are too slow to run. CPUs, RAM bandwidth/size, and even GPUs have long been in a \"good enough\" state. GenAI is the first mass market application I've seen that renders a modern computer hopeless. So for me, I'm getting excited about chips again and I think we will see some major leaps in AI accelerators in each generation. The race just got started.",
                "author": "auradragon1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Samsung Galaxy Z Flip7 features a more power efficient polarizer-less display",
        "score": 29,
        "text_content": "**TL;DR:** The Flip7 display is more efficient due to the removal of the circular polarizer which increases light transmittance, reducing the power required to maintain the same brightness. With the announcement of the Flip7 last week, Samsung [subtly](https://www.youtube.com/watch?v=0cMS8qECR0A&t=2289) hinted at the use of a display with colour filter on encapsulation (CoE) technology. The keynote mentioned a thinner and vibrant panel with an embedded polarizer, which appeared to describe CoE perfectly. I had the opportunity to speak with VP Minseok Kang, Head of Smartphone Product Planning at Samsung Mobile eXperience, who confirmed the application of CoE on the Flip7 display. A conventional OLED display includes a circular polarizer which reduces ambient light reflection, resulting in better contrast and image quality. The polarizer also reduces light transmittance by about 50%, which decreases the brightness of the display. As a result, more light and power is required to produce the same brightness, compared to a display without a circular polarizer. An OLED display with CoE replaces the circular polarizer by integrating an RGB colour filter, black matrix, and black pixel define layer into the panel. This increases light transmittance while minimizing ambient light reflection. As a result, less light and power is required to produce the same brightness, compared to a display with a circular polarizer, resulting in a more efficient display. Furthermore, less heat is generated, and the overall lifetime of the panel is extended. Alternatively, the increased light transmittance can allow for a brighter display with the same power consumption as a display with a circular polarizer. Samsung first commercialized the technology under the name [Eco^2 OLED](https://global.samsungdisplay.com/28402) on the Fold3, and it has been featured on every Fold series device ever since. According to their data, the first generation Eco^2 OLED reduces power consumption by up to 25%, while the second generation [Eco^2 OLED Plus](https://global.samsungdisplay.com/31345) reduces power consumption by up to 37%, compared to a conventional OLED display. The Flip7 is the first Flip series device from Samsung to adopt a CoE display. Given that the Flip6 and Flip7 main displays share the same peak brightness of 2600 nits, the Flip7 display should be much more efficient. Foldables from other OEMs also feature CoE displays. Xiaomi has used it since the [Xiaomi MIX Fold2](https://www.mi.com/global/discover/article?id=2756). Oppo has used it since the [Find N2](https://omdia.tech.informa.com/blogs/2023/feb/oppo-launches-two-new-foldable-smartphones-with-displays-from-samsung-display-and-boe), and [Find N3 Flip](https://www.oppo.com/en/smartphones/series-find-n/find-n3-flip/). Motorola has used it since at least the [moto razr 60 series](https://www.prnewswire.com/news-releases/tcl-csot-display-technology-sets-new-trend-in-foldables-with-lenovo-moto-razr-60-series-302502313.html) ([Ross Young](https://xcancel.com/DSCCRoss/status/1663904514229911553) mentioned it was expected on the razr 40 ultra, but I couldn't find any mention of it). According to [Chosun Biz](https://biz.chosun.com/en/en-it/2025/03/03/EFIIRPVGSRGORAAIIPPUU5PVLM/), the Vivo X Fold2, and Google Pixel Fold also have CoE displays. CoE displays aren't limited to foldables either. The [Realme GT7 Pro](https://www.realme.com/global/realme-gt-7-pro) released last year was actually the first bar type phone to feature a CoE display. We should start to see more bar type phones with CoE displays next year. The Galaxy S26 Ultra is [rumoured](https://www.thelec.kr/news/articleView.html?idxno=32201) to include it which should contribute to widespread adoption. Disclosure: Samsung invited me to the Fold7/Flip7 launch event in New York, and provided flights and accommodations. They did not have any editorial input, nor the chance to preview or approve the contents of this post.",
        "comments": [
            {
                "raw_content": "I was wondering how Realme GT7 Pro managed to have one of the brightest phone displays, on a \"flagship killer\" tier of device, now we know, very nice to see the tech trickle down from foldables too. Still, I'd like to see a test of ambient light rejection. Somewhat different display technology, but polarizer free QD-OLED TV's have problems with lifted blacks, and phones are bound to see much more ambient light than TV's - that said, if it was an obvious issue, I'd imagine someone would have noticed it by now.",
                "author": "LockingSlide"
            },
            {
                "raw_content": "Savior for people who like to wear polarized sunglasses?",
                "author": "EasyRhino75"
            },
            {
                "raw_content": ">Samsung CoE displays used in Google Fold, Xiaomi Vivo & Mix Folds, etc. I wonder how they feel giving their patented tech to competitors who are trying to eat into their own market share. Whats more profitable, to be one of, if not the largest smartphone brand or be a supplier of components to others and slowly lose that market share? Will Samsung just become a parts producer in the future? Seems like it since they can't even get fab customers because they compete with Samsung on the same end product. Something has to change.",
                "author": "REV2939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How many of you are using auto routing while designing PCBs?",
        "score": 2,
        "text_content": "Is it even used by professionals? Does it make existing designs more cumbersome?",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Found a significant bug in Donkey Kong Bananza that’s easy to discover",
        "score": 1350,
        "text_content": "Once you open the game and start playing, it’s impossible to close it and stop playing. No matter how much you try, it’s literally impossible to tear yourself away from the screen. You may even forego food in this scenario. Just be careful out there - I fear this may happen to every player.",
        "comments": [
            {
                "raw_content": "I was almost late for work. Be careful.",
                "author": "GerbiJosh"
            },
            {
                "raw_content": "Can confirm, work keeps calling me. They sound pissed in the voice mails.",
                "author": "frankie_donkiebrains"
            },
            {
                "raw_content": "Literally ununplayable",
                "author": "Enkanel"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is this game going to give me OCD?",
        "score": 608,
        "text_content": "I've been playing for, like, 3 minutes and I haven't even moved 5 meters. It seems to me that, given how I am, this game is going to make me need to clean everything clean of debris. Does this happen to anyone else?",
        "comments": [
            {
                "raw_content": "Lol. I know exactly what you mean. I can't even enjoy it yet as I feel the need to smash everything. I'm still in the opening stages, so hopefully I move away from this. It's the same reason I struggle with open world games. I get overwhelmed with having to do everything and then stop playing.",
                "author": "Itsacone"
            },
            {
                "raw_content": "I collected about 1,000 gold and 20 of those special coins before I left—it's really not necessary, though!",
                "author": "SmokyMcBongPot"
            },
            {
                "raw_content": "I wish you the best of luck soldier this game might take you 1000 hours",
                "author": "Zagmag27"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game is gorgeous",
        "score": 190,
        "text_content": "I mean, just look at it.",
        "comments": [
            {
                "raw_content": "And damn I was worried about performance but besides minor hitches it runs amazing so far",
                "author": "rawzombie26"
            },
            {
                "raw_content": "I’m just smashing everything",
                "author": "theerealdeal"
            },
            {
                "raw_content": "![gif](giphy|k93eyfruK6qa1xTZMv|downsized)",
                "author": "Revanche1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Doesn’t get much better than this.",
        "score": 299,
        "text_content": "Launch day of Donkey Kong Bananza timed out perfectly with a cabin trip to upper Michigan. Lakeside fire, pontoon boat, beer, and DK destruction!",
        "comments": [
            {
                "raw_content": "Sounds lovely. I love vacations like that. Playing a game, reading a book, watching a show, theyre all just amplified by how nice your environment is. You can easily pause it and just take in nature if you want. And I'm sure you do. But for you, and me and a lot of others, the nature itself isn't nice to just \"be in\". Gotta have a mix. But you can still appreciate both",
                "author": "OpeningConfection261"
            },
            {
                "raw_content": "It’s really fun! I’m on world 3 i think",
                "author": "Careless-Shelter6333"
            },
            {
                "raw_content": "Sounds perfect. Enjoy!",
                "author": "Ireland914"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you're looking for a better deal on DK Bananza, Costco has copies for $62.99",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best Buy pricematch as well, just have to show membership proof. Edit: It seems this doesn’t work online",
                "author": "Sparescrewdriver"
            },
            {
                "raw_content": "You can also get eshop cards for 10% off at Costco and get any digital game with a discount.",
                "author": "godspeedbrz"
            },
            {
                "raw_content": "DK Bananza has infinitely more satisfaction than a three day Disney trip. There, I said it.",
                "author": "CH4OT1CN1C3"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Costco over delivered today",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "are those all just digital codes or do u gotta take them to the register for a physical copy",
                "author": "Teufel9000"
            },
            {
                "raw_content": "Wow and they’re selling it below MSRP on LAUNCH DAY. Why don’t we ever get these deals in Canada…",
                "author": "bmnawroc"
            },
            {
                "raw_content": "And I drove to fucking GameStop in the mall today and bought a pro membership 😡 god dammit why does this stuff always pop up after I buy",
                "author": "Tasteful_Taint"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Someone said Donkey Kong …?",
        "score": 1252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Either you’re a store or Amazon fucked up again",
                "author": "memeaste"
            },
            {
                "raw_content": "I hate that Nintendo made it so you can only play each cart for 1 hour before they “expire”, but I’m glad you’re prepared to beat the whole game",
                "author": "frankandsteinatlaw"
            },
            {
                "raw_content": "r/tomorrow would kill for this kinda post",
                "author": "Theheavyfromtf3"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yet another person banned for playing a used game on the Switch 2 (supposedly) but also admits to using a MIG..... Yeah",
        "score": 729,
        "text_content": "Wondering what you guys think of this article.",
        "comments": [
            {
                "raw_content": "I got banned yesterday for not buying Donkey Kong Bananza... and I also modded my Switch.",
                "author": "Impressive_Wafer_287"
            },
            {
                "raw_content": "Lmao. \"Yea I used a MIG but I swear it's the copy of Bayonetta I bought\"",
                "author": "ah_shit_here_we_goo"
            },
            {
                "raw_content": "Cool im gonna play donkey kong now",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FromSoftware Deep Into Development on Unannounced Project Codenamed “FMC”",
        "score": 491,
        "text_content": "https://mp1st.com/news/fromsoftware-i-development-unannounced-project-codenamed-fmc",
        "comments": [
            {
                "raw_content": "FullMetal Chemist",
                "author": "ValkyroMusic"
            },
            {
                "raw_content": "Fromsoftware Master Collection",
                "author": "ShinBernstein"
            },
            {
                "raw_content": "Fuck My Chunguslife",
                "author": "NotRiceProfile"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel's Blade budget seems to be 94m euros according to France committee of finance",
        "score": 240,
        "text_content": "France's committee of finance recently released a report about French video companies. The interesting part here is the stuff about budgets and expenses over many years, and they specify two games here, Star Wars Eclipse from Quantic Dream with a 100m euro budget, and Arkane's new game, which we know is Blade, with a 94m euro budget. [https://xcancel.com/bogorad222/status/1945897664857481541?t=NBQuzIoAUISplSxzECX2EQ&s=19](https://xcancel.com/bogorad222/status/1945897664857481541?t=NBQuzIoAUISplSxzECX2EQ&s=19)",
        "comments": [
            {
                "raw_content": "It’s gotta be Arkansas most expensive game but my concept of game budgets is ruined due to the past few years that this oddly looked “cheaper” at first.",
                "author": "Melancholic_Starborn"
            },
            {
                "raw_content": "Is it the biggest arkane game so far? In terms of budget",
                "author": "Esnacor-sama"
            },
            {
                "raw_content": "Does that include the Disney cut?",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hellraiser Game in development? ⛓️",
        "score": 89,
        "text_content": "Saber Interactive has put up a cryptic teaser on social media of an active tv with candles surrounding it in an abandoned older home. In the teaser, you can hear static noises from the tv set with what appears to be the iconic Doug Bradley as Pinhead speaking about how someone has a dark void filled with desires. A loud booming sound of bells are playing from the puzzle box being opened Chatterer and his teeth click before the sound of chains rattle around. Victims screaming in pain as their attacked by chains and dragged away? Saber also put up an image \"55\" on a website hinting at Kirsty Cottons house from the first Hellraiser movie. July 22nd will be when more information gets revealed. Teaser: https://www.youtube.com/watch?v=RMlWH3renGA",
        "comments": [
            {
                "raw_content": "I’m not interested in another online game that gets nuked like a year after release.",
                "author": "TAJack1"
            },
            {
                "raw_content": "Kinda makes sense with DBD losing the Hellraiser license not too far back.",
                "author": "catpiss-martini"
            },
            {
                "raw_content": "Cool story, how did Evil Dead turn out? Guarantee this is some asymm garbage they'll bury in a year.",
                "author": "SexyDragonMagic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostofHope: SHG's 2027 Call of Duty is Modern Day but a new subfranchise that isn't Modern Warfare and *may* feature Martial Arts",
        "score": 243,
        "text_content": "[https://xcancel.com/TheGhostOfHope/status/1945886720441888775](https://xcancel.com/TheGhostOfHope/status/1945886720441888775) >EXCLUSIVE: COD2027 by Sledgehammer Games will NOT be Advanced Warfare 2 and will instead be set in a completely new subfranchise. Set during the Modern era. >No Jetpacks but movement is planned to be a big focus. >Zombies is currently not planned for the game. >Get High is planned to return. >There may be a focus on martial arts within the gameplay with \"karate kicks\" and \"karate chops\" as examples Sounds... awfully bizarre decision and direction in a few ways at least.",
        "comments": [
            {
                "raw_content": "![gif](giphy|164G4BQmtJ2GXRbml3) Me when COD user “RealAnneFlank” comes at me with the “martial arts” in my shooty gun game",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "That headline was an absolute ride",
                "author": "Calhalen"
            },
            {
                "raw_content": "Will the new movement be called Omni-Fu?",
                "author": "ViperFive1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Avalanche Still Hiring For Contraband Despite Rumors of Cancellation",
        "score": 101,
        "text_content": "> Avalanche Studios is still hiring a Product Lead for Contraband, following the layoffs. The job ad was posted around 1 week ago, and Xbox announced its layoffs exactly two weeks ago. This means that Avalanche Studios continued to hire more developers for Contraband after the cancellations of Perfect Dark and Everwild. Source: https://tech4gamers.com/avalanche-hiring-contraband-despite-rumors/",
        "comments": [
            {
                "raw_content": "Crazy they’re publicly hiring people to smuggle, didn’t know business was that understaffed.",
                "author": "Melancholic_Starborn"
            },
            {
                "raw_content": "The way you phrased it makes it sound like Avalanche is smuggling.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "The rumours of cancellation was assumptions because we’ve not heard anything in so long and they were cancelling games that were in development for a long time.",
                "author": "SparkingLight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Overwatch season 18 Mythic skins were apparently leaked for Lifeweaver and Mauga",
        "score": 19,
        "text_content": "https://xcancel.com/SkaVorah/status/1945854913403044065",
        "comments": [
            {
                "raw_content": "As of right now, **Lifeweaver appears to be getting the mythic skin.** **Mauga is getting the Mythic weapon.**",
                "author": "Waluigiwaluigi_"
            },
            {
                "raw_content": "Just fell to my knees in a Walmart.",
                "author": "MadeByHideoForHideo"
            },
            {
                "raw_content": "Im gonna cry. All ive wanted is lifeweaver mythic",
                "author": "Cheesygoose25"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Reportedly Plans to Bring a \"Unified Core\" Architecture After Next-Gen Razer Lake CPUs; Combining P-Cores & E-Cores in One Package",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "original source is from Chinese Zhihu, I don't think it's a reliable leaker",
                "author": "Several-Insect-5108"
            },
            {
                "raw_content": "Griffin Cove is rumored to be another tock I think. What this means after LNC's disappointing uplift, and then NVL's P-core also looking to be of a [similarly mediocre uplift](https://videocardz.com/newz/intel-nova-lake-performance-leak-claims-10-single-and-60-multi-threaded-uplift) despite it also being a tock, is a bit more murky.",
                "author": "Geddagod"
            },
            {
                "raw_content": "So let me get this straight, big turn around was at first Arrow Lake with 20A which didn't hit the timeline. Then it was Nova Lake x3d with 18A. once again not 18A and leaks are not inspiring a turn around. Now it's a Cpu in 2028? Given Intels track record there is no way this is %20 better compared to Nova Lake so not much to be excited about. (Though big core team not working on it gives some home)",
                "author": "No-Relationship8261"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Nova Lake-AX specs leak: 28 CPU cores, Xe3P GPU with 384 EUs, launch uncertain",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Raichu belives its likely not going to launch. Even worse, the BLLC could only launch in the full flagship config (or a cut down of it) with 2 compute tiles instead of just 1 8+16E+BLLC competitor to 10800X3D)",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "Raichu thought that an 'Ultra 3' Arrow Lake desktop processor would launch too before deleting those tweets. He clearly says that those who comment on his tweets should be careful about distinguishing statements that he posts as 'probable' facts and his opinions on what may or may not happen. This clearly falls in the latter category.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "how big is an intel EU? wasnt arrow lake like 32? that sounds fucking nuts",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD reveals Ryzen Threadripper PRO 9000WX pricing: $11,699 for 96-core 9995WX",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's insane price, but it gives insane performance i guess",
                "author": "Public-Nebula4096"
            },
            {
                "raw_content": "Here I am happy to have some 2011 socket Xeons and my flair.",
                "author": "trekxtrider"
            },
            {
                "raw_content": "I remember buying my first ever 2 core (with 2 threads). I was amazed that I could play a game and have Winamp running the in the background as well. Many years later; 96 cores; 192 threads. GG AMD. Not for private folk, I get that, but damn. That thread count.",
                "author": "vBDKv"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Yeston Radeon RX 9070 XT Mercury Nova OC debuts at $899, Cyberpunk-inpired design developed by GravaStar",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sexy but not worth $900",
                "author": "san_25659"
            },
            {
                "raw_content": "Yikes, these people just don’t get it. Good luck selling that beauty 💀",
                "author": "SumOfAllTears"
            },
            {
                "raw_content": "These guys are like 2 months too late with that price imo.",
                "author": "just_change_it"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Stagnation: 5 Years Of Radeon x600/x60 Class GPUs",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird they'd compare the RX 5600 XT and 9060 XT 8GB to 7600 and 6600 non-XT cards instead of the 7600 XT and 6600 XT. All of them are the full unlocked Navi X3 variants (excluding the 9060 XT which is Navi 44, and the 5600 XT which is Navi 10, the same die as the 5700 XT.) Why not include the 5600 non-XT if you want to compare the non-XT cards? Weird?",
                "author": "DiatomicCanadian"
            },
            {
                "raw_content": "A lot of youtubers just engagebait during downtime. Personally, I Just right-click not uninterested or unsub when they go too deep into engage bait territory",
                "author": "RS_Games"
            },
            {
                "raw_content": "AMD has one year of chill and affordable gpu's and suddenly AMD has a problem. This is why I dislike HWU. Most of the time they praise intel and then when AMD comes around with something good they quote \"have to agree\" that they perform better.",
                "author": "GhostDoggoes"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ZEPHYR teases new flagship GPU featuring iconic Radeon VII \"Vega\" design",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it 2-slot? Was a good time when flagship cards like the Radeon VII actually fit inside the computer, with option to put several of them side-by-side for a workstation.",
                "author": "ProjectPhysX"
            },
            {
                "raw_content": "looks sick!",
                "author": "riba2233"
            },
            {
                "raw_content": "Frontier edition blue looked great too~ Do that next!",
                "author": "simukis"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon AI PRO R9700 launches July 23, DIY availability in the coming weeks",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "RX 9070 GRE Tested VS RTX 5070, RX 7900 GRE & More",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Coming Up on 3 Years Above 6% Mortgage Rates.",
        "score": 249,
        "text_content": "Marry the house date the rate",
        "comments": [
            {
                "raw_content": "3% -> 7% over doubles the cost of the house. Absolutely insane",
                "author": "DesignerCalendar5104"
            },
            {
                "raw_content": "They married that rate.",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "If you’re waiting for a bubble to pop, remember, this sub is five years old",
                "author": "Bradical22"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Money Is the Main Reason for Renters Not to Buy",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In the metropolitan areas, with 20% down, your mortgage is still higher than rent. Rent is expensive but at the same time, it’s easier to afford than spending way above for a mortgage. Then consider taxes and HOA. It’s especially true here in NJ/NY. With 20%, I’m still looking at about 1-1.5K over what the rent is.",
                "author": "LegalDragonfruit1506"
            },
            {
                "raw_content": "It turns out that lack of money is indeed a problem for many people.",
                "author": "sarge1016"
            },
            {
                "raw_content": "I mean.. yeah? That's why people are complaining about high house prices and how it's a bubble.",
                "author": "babypho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US News International Buyers Purchased $56 Billion Worth of US Homes in 1 Year",
        "score": 354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://archive.ph/k7Wlo Foreign buyers purchased $56 billion worth of existing homes in the United States between April 2024 and March 2025, up by 33.2 percent from the previous 12 months, the National Association of Realtors (NAR) said in a July 14 statement. In terms of the number of properties, they bought 78,100 units, a 44 percent increase from the prior year. This was also the first annual increase since 2017. The average purchase price was $494,400, a “record high,” NAR said. “International interest in buying U.S. real estate increased following the global economic recovery from several years of pandemic-related disruptions,” NAR chief economist Lawrence Yun said in a statement.",
                "author": "CautiousMagazine3591"
            },
            {
                "raw_content": "What will be done about this realistically. Will Americans just allow this forever going forward? It’s the norm that everyone’s landlord is overseas? Like, really? We’re not gonna do anything about it? Like damn so there’s no point in waiting- people should buy homes ASAP?",
                "author": "yeet20feet"
            },
            {
                "raw_content": "Private Equity REITs are money laundering for organized crime and overpaying for properties as it is part of the grift. Where is all this money coming from when the U.S. supposedly is the wealthiest nation yet its own citizens cannot afford homes in their own country anymore? Organized crime…",
                "author": "InvestingArmy"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why Blackstone is buying rental homes in the U.S.",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To get rich and screw the common person. Next article",
                "author": "Kriznick"
            },
            {
                "raw_content": "Why? Because the American people allow the mechanisms of finance that they take advantage of. That's why.",
                "author": "GuerrillaSapien"
            },
            {
                "raw_content": "Blackstone is an American alternative asset manager with significant interests in rental housing. In recent years, the company spent billions acquiring brands such as Tricon Residential, American Campus Communities and AIR Communities. Blackstone’s rental housing portfolio contains apartment complexes, student housing, mobile home parks, and single-family rental properties. Many of their U.S. assets are concentrated in major cities such as New York and in Sun Belt states including Texas, Georgia and Florida. “There tends to be a high degree of consistency across our different pools of capital,” Kathleen McCarthy, global co-head of Blackstone Real Estate, said in an interview with CNBC. “Really what we try to follow across the globe is job and population growth.” Blackstone says it owns less than 1% of the 46 million rental homes scattered across the country. The Blackstone Real Estate Income Trust currently has an ownership interest in at least 274,859 rental housing units. But this is a narrow slice of their overall portfolio. “Of their $315 billion in real estate, only roughly $55 billion is in the BREIT product, which is sold to retail investors,” said Craig McCann, principal at SLCG Economic Consulting. Blackstone Real Estate launched in 1991 with funds raised from accredited and institutional investors. Its parent company, The Blackstone Group, began as a private equity firm that used techniques such as leveraged buyouts to acquire and improve distressed assets. “They recognized early on the value of diversification,” said Greggory Warren, senior equity analyst at Morningstar. Blackstone could benefit from their recent acquisitions in the years to come. “Buying is still cheaper than building in many markets, as is typical at the start of a new cycle. This is limiting construction and supporting rent growth,” Will Pattison, head of real estate research at MetLife Investment Management, said in a statement to CNBC.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Jobless claims drop for fifth straight week to lowest level since April. It's a 'no-hire, no-fire story,' economist says.",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the \"I Gots Mine\" economy.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Purgatory if you are employed, but better than the version of purgatory you are in if unemployed. There are few choices for movement. Few choices, yet millions of ghost opportunities, for the unemployment. Yet, many will still seek a mortgage, which is a 30 year contractual guarantee of one’s income. Confounding.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "Companies learned from COVID - no overhiring anymore... but also, let folks quit on their own to avoid being blown up in a TikTok story.",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuilders are slashing prices at the highest rate in 3 years",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Which creates new market comps...! Homebuilders will sell their inventory, they won't sit on it.",
                "author": "a_trerible_writer"
            },
            {
                "raw_content": ">Builder confidence has been in negative territory now for 15 straight months. >Confidence rose slightly in July due to the recently passed budget bill. >Buyer traffic saw a 1 point drop to 20, which is the lowest reading since the end of 2022.",
                "author": "sifl1202"
            },
            {
                "raw_content": "Insert MORE meme here",
                "author": "BarracudaMore4790"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Good News For Homebuyers: Sellers Start Pricing Lower, Monthly Mortgage Payments Dip to 4-Month Low",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"4 month low\". Nah, try again. Wake me up when it's a \"four year low\".",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Sellers will sell at appropriate rates only if they lose jobs. 150k price rise in 4 years is inhumane and will be punished",
                "author": "Hour-Marionberr"
            },
            {
                "raw_content": "It’s barely making a difference. Prices seriously need to drop.",
                "author": "rangoldfishsparrow"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Los Angeles area inventory climbs back to prepandemic levels",
        "score": 24,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "LIVE: Introducing ChatGPT Agent",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think Sam is uncomfortable with how long this agent is taking lol",
                "author": "g15mouse"
            },
            {
                "raw_content": "Please for the love of God, make It do some actual work.. I ain't asking for It to be AGI, even a small thing would feel like we are getting somewhere...",
                "author": "Own-Assistant8718"
            },
            {
                "raw_content": "How many weddings/holidays are these guys going to that this is still their go to scenario everytime lmaoo Edit:Plus users too let's goooo",
                "author": "Batman4815"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We just calling anything agi now lmao",
        "score": 940,
        "text_content": "I remember when that was a real thing not just a load of hype and a way to scare people Anyways maybe you disagree let me know what yall think lol",
        "comments": [
            {
                "raw_content": "He had many feels of agi lately. I wish I had one of those too",
                "author": "Primary-Discussion19"
            },
            {
                "raw_content": "Sam knows if he adds “feel the agi” to his tweet it’ll get more engagement to whatever they are trying to demo. It’s all marketing.",
                "author": "Aaco0638"
            },
            {
                "raw_content": "Are the “complex” tasks in the room with us right now, Sam?",
                "author": "mightbearobot_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "White House Prepares Executive Order Targeting ‘Woke AI’",
        "score": 347,
        "text_content": "speedrunning the enshitification stage??",
        "comments": [
            {
                "raw_content": "The bigger issue at hand here is the president wielding a power to try and control independent companies. For anyone who doesn't understand, these are not government organizations. They are independent companies. The president nor anyone in the government has any say in how they run their operations. If true AI ever emerges, and the government wants to take control of it, that's one thing, but for now this is the equivalent of Trump telling Burger King they can't sell Impossible burgers anymore because he doesn't like it. A true declaration of an AI race would be the US government funding their own AI project, not using independent companies to hopefully achieve that goal.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "Release the Epstein files and client list first, then we can talk. Ai isn’t “woke”, it’s just not agreeing with you.",
                "author": "NotMyMainLoLzy"
            },
            {
                "raw_content": "So more MechaHitler?",
                "author": "winelover08816"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT Agent is the new SOTA on Humanity's Last Exam and FrontierMath",
        "score": 459,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think what happened today is that we shifted what benchmarks matter. HLE and frontier math are important. But today, we see agentic benchmarks as a bigger deal for most people. You'll see more agentic benchmarks going forward. For most folks, the intelligence is enough on breadth - we need agent capabilities. That means tools, memory/context, modalities. This is a step.",
                "author": "Gratitude15"
            },
            {
                "raw_content": "I think that by having the agent create the PowerPoint presentation from scratch, that was basically their way of saying that benchmarks are beside the point. Like, who cares if it gets a slightly higher or lower number on some test, when it's an AI system that can actually do work and create a real-world artifact.",
                "author": "Klutzy-Snow8016"
            },
            {
                "raw_content": "And ARC-AGI2? I’m highly skeptical of benchmarks which aren’t truly private and therefore can have extremely similar questions & answers on the internet. Provide a terminal and then you have a method to testing the results before submission. This isn’t apples to apples with a human. ARC-AGI2 is definitely a better benchmark when we start adding in tools, terminal, and browser.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok is #1 in Japan, likely due to Companions feature",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats almost too stereotypical. LOL",
                "author": "endofsight"
            },
            {
                "raw_content": "Ai companion apps such as character ai and janitor ai have been the number 1 entertainment use for ai for a while now. A big company getting in on it was inevitable and it was inevitable it would blow up",
                "author": "doubleoeck1234"
            },
            {
                "raw_content": "Elon undertands unspoken hacks. Other companies don't or refuse to. Elon will gain market share for this one feature alone while every other player puts on their puritan hat.",
                "author": "giveuporfindaway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"The era of human programmers is coming to an end\"",
        "score": 713,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The era of investors and founders bullshitting is really ramping up to new heights though.",
                "author": "rorykoehler"
            },
            {
                "raw_content": "The more they say it, the more I'm convinced they are wrong. I would even bet that they know they are wrong but they just want to make programmers concerned and accept that from now on they should work for peanuts.",
                "author": "anthrgk"
            },
            {
                "raw_content": "In my 20+ years as a business analyst, programmer and project manager the one thing I can say for certain is that most CEOs and upper management can't describe what they want, and a million AIs will not change that.",
                "author": "MinimumCharacter3941"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "You know it’s serious when they bring out the twink",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the beginning of the GPT-5 era. Perhaps they've decided to not even go with the actual name but take from the whole \"Agent 1\" inspiration from Daniel's 2027. Suppose we'll find out soon enough, but \"unified model\" is exactly what they referenced GPT-5 to be.",
                "author": "Stunning_Monk_6724"
            },
            {
                "raw_content": "Excuse me?",
                "author": "jimmcq"
            },
            {
                "raw_content": "Beating the fossilized horse with this one",
                "author": "NoCard1571"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Does this subreddit feel particularly Luddite recently?",
        "score": 159,
        "text_content": "Seriously, the strongest agents yet are being deployed and all people can focus on is that \"it's not AGI.\" This subreddit used to be capable of looking at the trendlines and being in awe that the technology we have is progressing so quickly, but it's quickly devolved into Luddites literally dismissing literally anything and everything including agents that autonomously use computers to solve problems. Genuinely very disappointing. Being in this sub for a long time it feels like a bunch of strangers coming into your home and destroying all your furniture. It is not just that the subreddit dislikes AI now, it is that they are actively hostile towards the idea that AI is improving. I'm over it sorry.",
        "comments": [
            {
                "raw_content": "This sub fluctuates pretty hard. Depending on news and year this sub is sometimes pure hype sometimes the opposite.",
                "author": "Quarksperre"
            },
            {
                "raw_content": "It's not just this subreddit. Everywhere is filled with \"LLMs will never be AGI\" posts. It's not like I'm opposed to discussing whether or not LLMs are on the path to AGI, it's a fun subject. But having the same posts with the same standard arguments under almost any topic in the entire AI / machine learning space does get old.",
                "author": "Cronos988"
            },
            {
                "raw_content": "Most people want to be part of an in-group. It's easier to portray your status by being as jaded and unimpressed as possible and mocking anyone with more positive opinions.",
                "author": "phaedrux_pharo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deep research and Operator",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ChatGPT is getting merged with other more sophisticated technology you say?",
                "author": "Glittering-Neck-2505"
            },
            {
                "raw_content": "First demo better not be booking a flight again...",
                "author": "YakFull8300"
            },
            {
                "raw_content": "Buzzword 🤝 Synchronicity 🤝 Dynamism",
                "author": "Spirited-Camel9378"
            }
        ],
        "subreddit": "singularity"
    }
]