[
    {
        "post_name": "At the end of the 20th century, which has seen the evils of communism, Nazism, and other modern tyrannies, the impulse to centralize power remains amazingly persistent in the 21st century.",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sometimes, I'm glad I'm \"old\".",
                "author": "AnnieMm"
            },
            {
                "raw_content": "Communism with technology, fancy corporate buzzwords and investors' money is still communism. China has already been turned into a digital surveillance gulag by the CCP regime, and it's heralded as the role model for other countries to emulate by the Davos demons.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Yet a lot of fuckers on here were ok with the REAL ID system. Which is another step towards a central federal digital ID system. Yet proven to be useless given the massive amounts of commercial drivers REAL IDs given to illegals.",
                "author": "gaijin_ronin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember when all of the moderate GOPers condemned a bunch of young republican men for telling Hitler jokes in a private chat? Now’s a good time to watch. Because the mainstream left will not disavow this guy. You’ll see why leftists have won for decades and the Right lost every issue.",
        "score": 355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wonder what the faggots over at Reddit will have to say about this Oh wait of course they won't care lol",
                "author": "Axiom502"
            },
            {
                "raw_content": "Uh, the reason we lose the culture war is because we give a single flying fuck what the other side's opinion of us is. Our best defense is \"NOOOO WE'RE NOT NAZIS! IT'S THE OTHER SIDE THAT'S NAZIS!\" The only winning move is not to play. \"What will the degenerates, axe wounds, and the faggots think about us? How will we be remembered in history?\" I'll answer that last one for you though, Bush alumni: As cowards",
                "author": "TPMJB"
            },
            {
                "raw_content": "I'll just come out and say it. It's not a big deal when we do it, it's not a big deal when they do it, it wasn't a big deal when Hitler did it.",
                "author": "EDDIT_IS_CUCKED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cognizant is one of the largest sponsors of H-1B Visas. Big companies outsource IT grunt work to them, it's not high-skill. The company is almost 100% Indian, and they were convicted of massive racial discrimination. Yet they're still approved for 100s of new H-1Bs every year.",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hi Patriots ~ Live Thanksgiving not only in 2 weeks. But *Each day of your life....* Mark 12 : 30 as you LOVE God/Jesus with ALL of you ❤️ your self-image will grow in Him, & by growing food, He helps feed your belly too.",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨 BREAKING: Tucker Carlson announces he is releasing evidence tomorrow proving the FBI is lying about the assassination attempt on Donald Trump in Butler, Pennsylvania by Thomas Crooks",
        "score": 1387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tucker Carlson announced on November 13, 2025, plans to release evidence the next day proving FBI deception in the July 13, 2024, Trump assassination attempt in Butler, Pennsylvania, summarizing a Joe Rogan podcast clip where he, Rogan, and Elon Musk dissect anomalies like the shooter's scrubbed home and lack of digital footprint. The clip emphasizes suspicious details, including Thomas Crooks' appearance in a BlackRock ad, possession of five phones, immediate body cremation, and cellphone signals traveling between his home and FBI D.C. offices, fueling speculation of coordinated involvement without formal FBI reports or press briefings. These claims echo persistent public scrutiny of Secret Service failures, such as unsecured roof access despite visible warnings from bystanders, contrasting with rapid evidence handling in past cases like JFK, and highlighting demands for cellphone records and unredacted files amid no confirmed updates on the announcement as of the post date.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Why do people always make these preview announcements? Just release your shit already",
                "author": "tholinz"
            },
            {
                "raw_content": "We got “the murder on live television” part of their plan. His name was Charlie and he was also arguing for what’s right. We keep arguing. They keep killing, cheating, slandering, projecting and gas lighting. They have been at it for quite some time. Seems to me many are done with it, and more are moving that way. Would be nice if the Trump administration would start going ham on these people.",
                "author": "JBlaze056"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Absolutely no lies told! 🎯💯",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good luck getting the welfare idiots to understand this simplicity.",
                "author": "LaPastillaEscarlata"
            },
            {
                "raw_content": "Hi! I'm from the government and I'm here to help!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Socialism/communism. Exactly. And we are electing them at a record pace. This will be interesting.",
                "author": "DManthey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Islamophobia.\"",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i despise pisslamics. I don’t like muslims either.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Im starting to hate everyone. Terrorists for being cowards trying to come in under the guise of please help me then snaking people and the terrorists victims for being weak cucks and bowing down to them in your own homeland... At this point who gives a fuck if mankind goes on for much longer bunch cowards who don't deserve to live..",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Christianophobia, also referred to as Christophobia, is defined as the irrational fear or hatred of Christians or Christianity.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: \"They just want to burn it down. They don't care if the troops don't get paid. They don't care if you cause billions of dollars in lost productivity... They just want to get Trump\"",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Democrat party will be completely rudderless once Trump's term is over if they don't correct course (they won't lol)",
                "author": "wartooth6"
            },
            {
                "raw_content": ">They just want to get Trump I’ve elected Trump several times and I’ve gotten him only a couple of times",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "It's not about just getting Trump. I never imagined in my lifetime such a lack of caring. They don't view Mr. President as a person because they've lost all those feelings of empathy that being hateful overpowers. We lost Charlie Kirk and they are thirsty because they had a taste of celebrating that. VP JD Vance has not taken enough risks to pressure and persuade some issues that a wing man making the President successful should be doing. I am referring to the locking the fuck up of all the traitors. His pancake job position is getting on my nerves.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🪽 The FBI has launched a new X/Twitter account called 𝙁𝘽𝙄 𝙍𝙖𝙥𝙞𝙙 𝙍𝙚𝙨𝙥𝙤𝙣𝙨𝙚, created specifically to address and respond to users’ posts in real time...",
        "score": 739,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now they can ignore crime in real time instead of waiting 2 weeks",
                "author": "SirWompalot"
            },
            {
                "raw_content": "So they can knock on your door about the antisemitic posts",
                "author": "ParadigmShift2070"
            },
            {
                "raw_content": "Lick my balls in real time.",
                "author": "PurloinedOffice"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tommy Robinson 🇬🇧 : A constant stream of invaders are being flown to mainland SPAIN from the Canary islands, all paid for by NGOs. Every NGO group needs exposed, dismantled, and proscribed. (And they're ALL Military Aged Males, No Less)...",
        "score": 1248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I took a vacation to Barcelona last year. The amount of African Muslims there was absolutely nuts. It completely ruined the experience because in the touristy areas they were constantly getting in my face aggressively hawking wares. They make their living by intimidating tourists into giving them money for shitty baubles. It's barely a step above a shakedown.",
                "author": "mykillk"
            },
            {
                "raw_content": "1500 years later, they once again opened the Gates of Toledo. They are eternal shitheads.",
                "author": "MAG_n_KAG"
            },
            {
                "raw_content": "NGO's are THE globalist weapon of choice and should be 100% focused on.",
                "author": "auntjemima"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FIRMWARE UPDATED GOING TO SUBROUTINE REEEEEEEEEE",
        "score": 614,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone saying \"MAGA is dead\" at this point is a fucking faggot.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Can’t stop the inevitable vote on Epstein; and don’t worry Trump told me that I’m not a real supporter for being concerned about an international pedophile ring getting swept under the rug Sorry Trump the truth is coming out and your Israeli friends will be named",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Credit to X Link post. https://x.com/TheRicanMemes/status/1989063462241403000?t=J5gJsMHC5y8YU2noO0JLSA&s=19",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Rapid Response Running Cover For The Thomas Crooks Investigation Eric Trump Said Was Wholly Unsatisfactory",
        "score": 459,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm wholly unsatisfied with government beyond hope. I felt better when it was shut down, to be honest.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Crooks was another CIA patsy, like Paddock. Same shit, different day.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "FBI doing FBI things",
                "author": "FBIAREFAGGOTS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Rep. Chip Roy to Introduce Bill That Would 'Freeze All Immigration'",
        "score": 1534,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't he just endorse Byron Donalds, who is Pro- HB-1 Visas?",
                "author": "loooooof"
            },
            {
                "raw_content": "Should have been done after 9/11!!",
                "author": "annieS"
            },
            {
                "raw_content": "So just so everyone’s aware. Yes, h1b is a problem. The fact that this happened almost overnight should be concerning. This was an issue put to bed and Trump did a 180. Why? This is a psyop meant to distract and redirect your anger from Kirk and Israel onto pajeets. There’s no other reason Trump would make such a basic gaffe in an interview. Much less let them release it. Here a few weeks ago Israel put several hundred million into an influence campaign and suddenly you have every mildly right of center influencer tweeting up a storm about jeets being the best ever. It’s all a distraction to demoralize you and distract you from Zionists. Who are also the ones letting these sex pests in.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pencil-Neck Adam Schiff Seeks to Block $230 Million DOJ Payout to Trump",
        "score": 668,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trying to figure a way to skim some off the top, Shitforbrains?",
                "author": "Beelzy"
            },
            {
                "raw_content": "Why is this piece of shit traitor still a free man?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "The law is the law, and nobody is above the law, remember?? The judgment STANDS.",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrats' new \"Golden Boy\" Congressional candidate Jack Schlossberg (NY-12) has been exposed in a now-deleted video performing a NAZI SALUTE.",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pampered, entitled, useless trust fund baby.",
                "author": "12points"
            },
            {
                "raw_content": "They don't give a shit. The right has to stop giving a shit too",
                "author": "bananafone"
            },
            {
                "raw_content": "Is he retarded?",
                "author": "charlesthehammer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAHA",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because of... Statistics... Yeah... Statistics...",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "How else are you going to get HPV if you don't get the vaccine?",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "You're going to whore house school. They may or may not zipper your tits.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🏃🏿 Elon Musk Plans to End Prisons by Having His Robots Follow Crooks and Stop Them from ‘Doing Crime’ 🤖",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Painted blackface to fit in",
                "author": "BoomShtick"
            },
            {
                "raw_content": "This is gay and probably out of context because it was reported by Futurism which is a clickbait site.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "Is the criminal responsible for charging the battery?",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clinton-tapped judge could toss Tish James, James Comey cases after hearing arguments Trump’s prosecutor is illegitimate",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We The people can toss the black ropes into Alligator Alcatraz, game time is long gone.",
                "author": "MeMargie"
            },
            {
                "raw_content": "Oh they are going to toss them alright. They won't be able to win 1 case unless it's in Florida and hey all should be there.",
                "author": "TrumpLandslide20201"
            },
            {
                "raw_content": "they should withdraw the charges at this time as new evidence has come to light.then do like the dems and pick and choose your judge of choice.",
                "author": "cherokeepeople"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump was the informant who helped take down one of the most prolific pedophile and blackmail operations in history. A lot of people are gonna owe him an apology when this is done.",
        "score": 1506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Michael Wolff looks like a PDF file himself.",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "So the reason that they didn't release the Epstein Files is because Trump is the one who brought him down. That definitely was not on my bingo card. Man, what a time line.",
                "author": "Threaper666"
            },
            {
                "raw_content": "I can't even BEGIN to see why he didn't just RELEASE IT ALL the moment he was in orifice.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REPORT: Foreign Owned Corporate Landlord Behind Mass US Evictions",
        "score": 533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems like youtube is blocking links on this site",
                "author": "lul_cheto"
            },
            {
                "raw_content": "The Nation is owned by a socialist that keeps pushing communism, Islam, and Mamdani. I disregard all the shit they report on as propaganda. Seriously, just read this shit. https://www.thenation.com/article/politics/mamdani-jessica-tisch-nypd-policing/ This is what they push. I did enjoy the jew bashing before I found out about the socialist Karen owner. Having said that, I already heard about Joe Lubeck and American Landmark Apartments. Just another Jew trying to make a buck at our expense. The whole company needs to be investigated ASAP.",
                "author": "DManthey"
            },
            {
                "raw_content": "Our greatest ally at it again.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SK hynix reportedly merges DRAM and NAND into unified High-Bandwidth Storage package to boost on-device AI performance",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One day a SoC chip will actually be the entire system on one chip",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "\"When paired with the application processor (AP), SK hynix’s HBS module will enable smartphones and tablets to handle AI workloads better\" Something the world desperately needs...",
                "author": "nisaaru"
            },
            {
                "raw_content": "I would LOVE for SSDs to have DRAM on top of NAND. Imagine every write being buffered and every read being cached. This would SIGNIFICANTLY help with IOPS and latency while cutting down on write amplification.",
                "author": "Intrepid_Lecture"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s Tech Giants Race to Replace Nvidia’s AI Chips",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would obviously have happened eventually anyway. US restrictions just sped things up.",
                "author": "Ploddit"
            },
            {
                "raw_content": "quite interested on how would they implement them cause cuda has a monopoly",
                "author": "pwet123456789"
            },
            {
                "raw_content": "Well they better hurry up and make good chips. I want good, affordable GPUs again like how it was before the crypto mining boom :(",
                "author": "NC16inthehouse"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve Steam Frame Engineering Deep-Dive: Water Cooling, Thermals, Power, Acoustics",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "8GB of vram?! Wtf valve. To quote GN: “waste of sand”",
                "author": "lolatwargaming"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tiny386 emulator turns tiny microcontroller into a full i386 PC — tiny virtual machine can boot Windows 95 and Linux on ESP32-S3 chip",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One step closer to being able to host a Wildcat BBS running locally on a WiFi enabled LED lightbulb. It will have Trade Wars. It will have Barren Realms Elite. It will have Legend of the Red Dragon. It will be excellent. >Why a BBS cannot run on a smart bulb >**No operating system:** Smart bulbs lack the necessary software and processing power to run a complex application like a BBS. >**Limited user interface:** They don't have a screen or keyboard to display information or receive commands from a user. >**Simple function:** Their core function is to emit light, with connectivity allowing for remote control of color and brightness. I'll show you, Gemini AI overview. ***I'll show you all!***",
                "author": "AK-Brian"
            },
            {
                "raw_content": "Hello rkhunter_! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Openchip and NEC Moving Ahead with RISC-V VPUs for Aurora - HPCwire",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a surprising development! After the unenthusiastic launch of the third-generation VE30 in 2022, *The Next Platform* [reported](https://www.nextplatform.com/2023/03/23/is-this-the-end-of-the-line-for-nec-vector-supercomputers/) on the rumored demise of SX-Aurora TSUBASA platform. The ambitious original roadmap, which stretched out to the fifth-generation VE50, was not met, with no word whatsoever of the VE40. It appeared for a while that the SX-Aurora was truly dead, but it appears that NEC has been and is busy working on moving it to a RISC-V-based vector processor co-designed with Openchip. What does concern me is that it appears they're targeting it at AI as opposed to HPC with AI on the side as with earlier systems. AI, as we all know, is largely dominated by NVIDIA, AMD, and a handful of proprietary processors from hyperscalers; and completely over-saturated with mostly unproven startups. Historically, there was a 7 year hiatus in the SX series, between 2007's SX-9 and 2014's SX-ACE, which was caused by NEC and Hitachi bailing out of Japan's original K supercomputer design, which would have featured NEC and Hitachi co-designed vector processors bolted onto Fujitsu SPARC64-based scalar processors. It would be quite a feat if NEC could pull off another resurgence of vector supercomputers in this day and age, when NVIDIA and AMD release a new GPU yearly.",
                "author": "NamelessVegetable"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AI Boom Sends Samsung and SK hynix Profit Forecasts Soaring",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can someone name a company supplying AI datacenters that *isn't* posting massive profits?",
                "author": "TerriersAreAdorable"
            },
            {
                "raw_content": "Just waiting to see where all this \"surplus\" is going to end when the bubble pops.",
                "author": "Ohlav"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sony announces 240 Hz PlayStation gaming monitor",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$549 1440p regular backlight = DOA",
                "author": "ryanvsrobots"
            },
            {
                "raw_content": "how many games support 240hz? and how many games can the ps5 even display with that frame rate? Except 2d games and maybe indies",
                "author": "fuddlappe"
            },
            {
                "raw_content": "549 USD for a plain edge-lit LCD panel in 2025.",
                "author": "rubiconlexicon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel adds XeSS Frame Generation support to Meteor Lake iGPUs, XMX requirement dropped",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was XeSS ever open sourced like Intel said it would be? I know the GitHub pages used to not have any actual source code",
                "author": "dparks1234"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Now official: Free SW2 upgrade for Red Dead Redemption coming December 2nd",
        "score": 1320,
        "text_content": "source: https://x.com/wario64/status/1989047000864526424?s=46",
        "comments": [
            {
                "raw_content": "Per Rockstar's website >On Nintendo Switch 2, we’ve taken full advantage of this new hardware with support for DLSS, HDR, mouse controls, and the same fluid 60 frames per second gameplay at high resolution.",
                "author": "oilfloatsinwater"
            },
            {
                "raw_content": "That's good to hear. I own the S1 version and really enjoyed playing it a year or two ago.",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "This is very surprising on Rockstars part, I assumed they'd expect money... At least for an upgrade. I'm pleasantly surprised. Now where's GTA IV and RDR2 👀",
                "author": "Mishimotsu"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "CHROMAGUN 2 will be releasing on switch 2 on a full cartrige on 2026",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Impressive. I love the goodies inside too. I’m definitely a little more interested in",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "I want to buy it just to support a company actually putting a manual in the case. I know nothing about the game but this",
                "author": "SquishmallowPrincess"
            },
            {
                "raw_content": "What is this game like...Portal?",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Okay, Age of Imprisonment, it's good that you have a lot of content, but, uh, I think you might have taken things a bit far",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That moment when you haven't opened the map in a while.",
                "author": "alexanderpas"
            },
            {
                "raw_content": "![gif](giphy|OsfVaOer7N2265YTRF)",
                "author": "FunWrangler666"
            },
            {
                "raw_content": "The cozy infinite grind is why I like musou games.",
                "author": "tlrd2244"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sparking zero on switch 2 split screen on handheld",
        "score": 33,
        "text_content": "Gameplay by : Philippine Gamers Lounge",
        "comments": [
            {
                "raw_content": "I pre-ordered it on my Switch 2, and at first, I thought I'd regret it because of the comments I read. But it turns out playing it on Switch 2 isn't too bad.",
                "author": "iampatricktan"
            },
            {
                "raw_content": "How’s the frame rate? I saw someone posting that it was bad",
                "author": "_chaoder"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders: Global Test Ride Demo Version 1.0.1 is now available",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they ever nerf Rick I'll riot.",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "Addressed the following: * Improved communication stability during online play. * Fixed an issue where City Trial matching sometimes did not successfully connect after a long period of time. * Fixed an issue where City Trial matches would sometimes not start properly. * Fixed an issue where other players’ games might not progress, such as a player experiencing a communication error in a paddock. * Made several other miscellaneous gameplay fixes. You may still experience matching and communication issues after this update. If a match does not start after 90 seconds or more on the matching screen, try exiting the matching screen. If you cannot exit, try restarting the software.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Where can I access this",
                "author": "ADXII_2641"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hyrule Warriors: Age Of Imprisonment Sells 73,183 At Launch In Japan",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's fun. a good game to play before the 20th. and then gotta beat those before metroid on December.",
                "author": "zebrasmack"
            },
            {
                "raw_content": "For context, Age of Calamity sold 173,215 copies in its first week, which is higher, but the Switch 1’s install base was 13 million in Japan at the time compared to Switch 2’s 2.6 million now. It was also released in the midst of COVID, which certainly helped. These are good numbers for a Dynasty Warriors game, eclipsing Dynasty Warriors Origins first week sales in Japan.",
                "author": "Cutcutman"
            },
            {
                "raw_content": "Great game, been really enjoying it",
                "author": "CelticSith"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ball X Pit is so fun",
        "score": 20,
        "text_content": "Was unsure about this game just by watching it but decided to take a gamble and now i cant stop playing. Its buttery smooth and addictive, what do you guys think of it?",
        "comments": [
            {
                "raw_content": "Agreed!",
                "author": "ThatCurryGuy"
            },
            {
                "raw_content": "I really enjoyed it, the loop just had me hooked. The base building I was fine with, I know quite a few people didn't like it. But the core gameplay is great. I didn't get to NG+, had my fill at that point, but was great fun.",
                "author": "hermanbloom00"
            },
            {
                "raw_content": "I’ve heard it gets too easy past a certain point",
                "author": "Silver_Song3692"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rdr1 switch 2 port has been rated",
        "score": 490,
        "text_content": "https://www.esrb.org/ratings/40987/red-dead-redemption/ Ahhh... Life finds a way I guess",
        "comments": [
            {
                "raw_content": "Tought it was 2 for a second. Probably 60 fps and stuff, but cmon we have the game already. Give us Red dead redemption 2",
                "author": "kalaspuffar16"
            },
            {
                "raw_content": "Better be an upgrade path",
                "author": "moneycity_maniac"
            },
            {
                "raw_content": "Ngl it is one of the most beautiful open worlds on the OG Switch. Even gameplay wise many people including myself find it more enjoyable and less of a drag than the sequel. Looking forward to seeing it shine with better resolution and fps!",
                "author": "senkinsky"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate reiterates that RDR2 is still gonna happen",
        "score": 372,
        "text_content": "https://xcancel.com/natethehate2/status/1989053149097976264?s=46",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I think it happened in 2018",
                "author": "4000kd"
            },
            {
                "raw_content": "I sure hope we get a Red Dead Redemption 2, that would be so cool",
                "author": "weallfloatdownhere7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mike Straw, Senior Editor of Insider Gaming, says \"Valve isn't done with the big announcements.\"",
        "score": 1210,
        "text_content": "X: https://xcancel.com/MikeStrawMedia/status/1988802493221142968#m Full text: > \"BTW, Valve isn't done with the big announcements. Soon enough there's going to be something else\" With this and then Shpeshal Nick doubling down on Valve not being done that means it's time to hit more hopium, boys!",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Valve buying Ubisoft.",
                "author": "HomeAloneDwarf"
            },
            {
                "raw_content": "I can't believe that we're probably days away from saying \"Half Life 3 Confirmed\", and not as a joke.",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ubisoft just postponed its earnings report and halted the trading of its shares. Unclear why at this point but could indicate a major announcement related to the company.",
        "score": 794,
        "text_content": "[https://xcancel.com/ZhugeEX/status/1989019828938764642#m](https://xcancel.com/ZhugeEX/status/1989019828938764642#m)",
        "comments": [
            {
                "raw_content": "Tencent or Saudis?",
                "author": "Datdudecorks"
            },
            {
                "raw_content": "1. Tencent 2. The Saudis 3. Bankruptcy Choose your fighter.",
                "author": "Aggressive_Rope_4201"
            },
            {
                "raw_content": "“Hello everyone, I wanted to let you know that we are taking extra time to finalize the closing of the semester, and as a result we will publish our first-half earnings results in the coming days instead of tonight. Due to legal regulations, we cannot share more information with you at this time. To limit unnecessary speculation and market volatility during this short delay, we have asked Euronext to suspend the trading of our stock until the results are announced. We know this is likely to raise questions and drive media coverage. I encourage you all to listen to the conference call – which will be available via the Investor section of our site — just after the results are released so that you have a more detailed view of our earnings. Thanks for your understanding. Fred” This is from Insider Gaming today. “Ubisoft has requested Euronext to halt trading of its shares and its bonds from the market opening on November 14, 2025, until the publication of its first-half 2025-26 results in the coming days,” the company said in a statement.",
                "author": "arkhamtheknight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pragmata and Romeo is a Dead Man have been rated in Korea",
        "score": 40,
        "text_content": "[https://bsky.app/profile/gematsu.com/post/3m5l5wetmus2z](https://bsky.app/profile/gematsu.com/post/3m5l5wetmus2z) The Game Awards Date annoucements?",
        "comments": [
            {
                "raw_content": "Potential generational year coming up for Capcom",
                "author": "jinifluff"
            },
            {
                "raw_content": "Hopefully we get a release date soon, pragmata and Onimusha where both both announced before re9 and mh stories 3 but neither have a release date yet.",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "So he finally dumped Juliet?",
                "author": "Retro1088"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Red Dead Redemption may be releasing on Netflix, iOS, Android, PS5, Xbox Series X|S and Nintendo Switch 2",
        "score": 565,
        "text_content": "Source: https://xcancel.com/SrGarrus/status/1988983095887032552 A Twitter user claims to had an old YouTube video copyright claimed today by Take 2 because it contained audio from a video titled *\"Red Dead Redemption Coming to Netflix, iOS, Android, PS5, Xbox Series X|S and Nintendo Switch 2\"*",
        "comments": [
            {
                "raw_content": "What about my smart fridge? Any news?",
                "author": "Desperate-Response75"
            },
            {
                "raw_content": "We really got RDR on Netflix before RDR2 60fps patch.",
                "author": "SkywalkerRanchSauce"
            },
            {
                "raw_content": "Rockstars trolling the fuck out of us. \"Oh we thought ya'll wanted Red Dead Redemption TOO on current gen\".",
                "author": "Ace-0001"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "All Far Cry 7 mission names leaked in order",
        "score": 365,
        "text_content": "1. Grand Hyatt 2. Lincoln Memorial 3. Ronald Reagan 4. World Bank 5. Cold War Bunker 6. Red Cross 7. American History 8. Lenfant Plaza 9. Airspace 10. NASA HQ 11. Newseum 12. Verizon Centre 13. JFK Centre 14. Rose Velt 15. Capitol 16. Tidal Basin - Supposedly these are mission codenames and while referring to Washington, it is still set in Alaska - Unfinished list but information comes from Rogue, same leaker from yesterday who leaked the FC7 artwork/assets Source: https://xcancel.com/AgaiinTx/status/1989032673826811945#m",
        "comments": [
            {
                "raw_content": "This is either the mission list for Far Cry 7 or an itinerary for a trip to Washington D.C.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "Several of these seem plugged from Division 2. Maybe it's a mixup?",
                "author": "the_blue_flounder"
            },
            {
                "raw_content": "Ubisoft about to say their game isn’t ’political’ whilst showing gameplay where you infiltrate a Cold War bunker and use Lincoln’s top hat to somehow assassinate JFK. All whilst having Ronald Reagan as a companion. (Just for reference I would be very ok if the above were actually true)",
                "author": "Gen6V"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Andy Robinson (VGC) on the latest Far Cry 7 leaks - \"FYI I understand most of the details / assets here are muddled, wrong, or from cancelled projects\".",
        "score": 208,
        "text_content": "On Bluesky, Andy Robinson says \"FYI I understand most of the details / assets here are muddled, wrong, or from cancelled projects\". Source: [https://bsky.app/profile/andyrobinson.bsky.social/post/3m5jrpkyw5a2y](https://bsky.app/profile/andyrobinson.bsky.social/post/3m5jrpkyw5a2y) On Resetera, Shinobi602 also responded to the latest Far Cry 7 leaks: \"Outdated and many things have changed\" Source: [https://www.resetera.com/threads/gameplay-images-and-information-of-far-cry-7-leak-online-a-second-far-cry-game-extraction-game.1352968/#post-147645223](https://www.resetera.com/threads/gameplay-images-and-information-of-far-cry-7-leak-online-a-second-far-cry-game-extraction-game.1352968/#post-147645223)",
        "comments": [
            {
                "raw_content": "#Andy Robinson is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Knew somethin was off",
                "author": "Sprite_King"
            },
            {
                "raw_content": "Matches with Tom Henderson's post about the extraction shooter game being rebooted: https://insider-gaming.com/far-cry-multiplayer-rebooted/ It's safe to assume that those pics were from the original version that has been since scrapped.",
                "author": "HearTheEkko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Someone Posted There Metroid Prime 4 Preview a Day Early, Contains New Footage",
        "score": 223,
        "text_content": "https://www.youtube.com/watch?v=frEgZLx-b84 is extremely positive about the game despite never having played a Metroid game before. states that there are other sections of the game he played, but will save it for a future video EDIT: Video has gone private",
        "comments": [
            {
                "raw_content": "Bro really said you can play the game with \"one Joycon up your ass\".",
                "author": "Ljink"
            },
            {
                "raw_content": "\"It turns out that the enemy of the game is a guy named 'Sylux,' who is in a bad mood with the world because, I don't know, his prostate failed a little bit there, and he's in a bad mood with everyone.\" Either YouTube's auto-dub still needs work, or what the fuck is this guy saying lmao",
                "author": "GomaN1717"
            },
            {
                "raw_content": "I know, I know, \"They have to do it because of algorithm!\", but that creator o-face thumbnail is going to be a marker that our era here on earth was a bad one. I fucking hate it.",
                "author": "PHXplz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel documents confirm AVX10 support on next-gen Nova Lake",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🙏Native thunderbolt 5 IO (not happening)",
                "author": "Dirt_Antique"
            },
            {
                "raw_content": "Good. Just in time to upgrade my 10980xe.",
                "author": "Jempol_Lele"
            },
            {
                "raw_content": "I am far more interested in APX",
                "author": "Isacx123"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel adds XeSS Frame Generation support to “Meteor Lake” iGPUs, XMX requirement dropped",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats pretty cool",
                "author": "mustangfan12"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.11.1 Release Notes",
        "score": 412,
        "text_content": "# Highlights * **New Product Support** * AMD Ryzen™ 5 7500X3D * **New Game Support** * Call of Duty®: Black Ops 7 * Anno 117: Pax Romana * ARC Raiders # Fixed Issues * Intermittent application crash may be observed while playing games with Easy Anti-Cheat enabled when using the Radeon™ Overlay. * CPU metrics/tuning may not appear in the AMD Software: Adrenalin Edition™ Application after updating the graphics driver using the AMD Software Install Manager. # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370 * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. * Radeon Anti-Lag 2 option may not be available while playing Counter-Strike 2 (DX11) with Radeon Anti-Lag 2 enabled on some AMD Graphics Products, such as the Radeon™ RX 9070 XT. Users experiencing this issue are recommended to use the Vulkan API as a temporary workaround. * Intermittent system crashes may be observed while using some high-bandwidth HDMI 2.1 displays during display standby. Users experiencing this issue are recommended to use a DisplayPort connection as a temporary workaround.",
        "comments": [
            {
                "raw_content": "wait, so the branching did not happen? for RDNA2? I was under the impression that it was already in effect.",
                "author": "bombaygypsy"
            },
            {
                "raw_content": "My PC won't wake up after sleep on previous 25.10.2 so I have downgraded to 25.9.2. It seems that AMD has added into Known Issue in 25.11.1. >Intermittent system crashes may be observed while using some high-bandwidth HDMI 2.1 displays during display standby. Users experiencing this issue are recommended to use a DisplayPort connection as a temporary workaround. Ahhh. It is caused by HDMI 2.1... I can't use a DisplayPort on my LG C2 42\" TV sadly so I'll have to stay on 25.9.2 for now.",
                "author": "psycovirus"
            },
            {
                "raw_content": "That last known issue is what a lot of us experience. Not fixed, can't use this one either. Leaving your pc for long enough, like 25 minutes and your system just BSOD quickly into reboot.",
                "author": "vladi963"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches first feature from FSR Redstone with Call of Duty Black Ops 7, only for RX 9000 GPUs",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i own a 9070 xt but damn i dont care about cod anymore",
                "author": "csch1992"
            },
            {
                "raw_content": "I thought COD didn't have ray tracing any more?",
                "author": "Celcius_87"
            },
            {
                "raw_content": "Is this like FSR5 or what?",
                "author": "iibergazz_94"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Trump administration is 'evaluating' portable mortgages.",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So anyone who bought a home at 3% interest and still has the property gets a great interest rate for life, no matter how often or when they move, while everyone else gets royally screwed and probably has to pay more so the banks can make just as much money while still letting the privileged class keep their low interest rates. Fun.",
                "author": "i__hate__you__people"
            },
            {
                "raw_content": "I don‘t see how this does anything but help the people that already own homes, who are not suffering in this economy. This administration couldn’t possibly be less qualified to be in charge.",
                "author": "throwawaypackers"
            },
            {
                "raw_content": "This cannot work for existing mortgages. It would be a total mess and probably a Takings question. Maybe you could create a new type of portable mortgage in the future. You know, for a much higher rate.",
                "author": "CosmicQuantum42"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Foreclosures surge 20% as Americans struggle to pay mortgages - and fears of 2008-style crash soar",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s crazy is that a family member has been in foreclosure procedures since about 2-3 years ago and I’m not sure how they’ve hung on so long. They bought a house they couldn’t afford and when the economy slumped they couldn’t make payments on it.",
                "author": "These-Resource3208"
            },
            {
                "raw_content": "The covid era mortgage assistance for FHA loans ending September went down very quietly…everyone talking about the absence of a subprime mortgage crisis this time around should go look at the millions of mortgages who could simply not pay their mortgage with zero questions asked and the government made the payment for them and added the amount to the lien. Government basically paid off rightful foreclosure situations…until now. Watch this space now that programme is over.",
                "author": "Extension_Degree3533"
            },
            {
                "raw_content": "It’s okay. AI will pay the mortgage.",
                "author": "Weikoko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In just 15 years, the average U.S. homebuyer went from 39 to 59 years old: Top analyst reveals how the housing market has warped in one generation | Fortune",
        "score": 218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s the same people buying 15 years later drawing equity from their current homes I guess",
                "author": "Nomaad2016"
            },
            {
                "raw_content": "Thank you boomers, ironic generation that are entitled/ benefited from the time of flourishing middle class and now likes to piss on millennials and Gen Z for being entitled because their pull yourself by the bootstraps brain can't comprehend not buying avocado toast will not yield you enough money to buy a million dollar crapshack...",
                "author": "Scblacksunshine"
            },
            {
                "raw_content": "The age is 61 now.",
                "author": "AdNatural8250"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New foreclosures jump 20% in October, a sign of more distress in the housing market",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This sub is being brigaded by realtors",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Don't worry! History is not repeating itself. It's literally impossible for 2008 to happen again. Doody Frank fixed everything. Buyers are so highly qualified now. They even have to put down 0.008% nowadays. Trust me guys, it's no big deal. The NAR told me so.",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "Why is this getting posted again? 2.3 million foreclosures happened in 2008. 2025 has had 35k. Percentages don’t matter when the disparity in numbers is massive between the two years.",
                "author": "Traditional-Pilot955"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "China's dumping $500B in US bonds while buying gold for 12 straight months. The housing market connection nobody's talking about.",
        "score": 369,
        "text_content": "Everyone's focused on the Fed and mortgage rates, but there's a bigger shift happening that directly impacts US housing. China held $1.3 trillion in US Treasuries at the 2013 peak. They're now down to $775 billion — a $500+ billion reduction. At the same time, they've bought gold for 12 consecutive months and their central bank reserves just hit record highs. Why does this matter for housing? When foreign central banks dump Treasuries, yields rise. Higher Treasury yields = higher mortgage rates, even if the Fed pauses. We're not just fighting the Fed anymore — we're fighting a global de-dollarization trend. The 10-year Treasury yield directly influences 30-year mortgage rates. If China (and other BRICS nations following the same playbook) keep reducing Treasury holdings, mortgage rates stay elevated regardless of what Powell does. Here's the kicker: This isn't temporary trade war posturing. This is structural. China's building an alternative system where they settle trade in yuan backed by commodities (gold, oil). Less demand for dollars = less demand for Treasuries = persistently higher yields = higher mortgage rates. So while everyone's waiting for the Fed to \"pivot\" and save housing, there's a parallel force keeping rates high that has nothing to do with US monetary policy. The 2020-2021 housing boom happened partly because foreign central banks were still buying Treasuries aggressively, keeping yields suppressed. That tailwind is now a headwind. Just something to consider when people say \"rates will drop soon.\" The Fed's only half the equation now.",
        "comments": [
            {
                "raw_content": "This has been a process 50 years in the making...everybody talks about the US's \"reserve currency status\" like its some binary title, not realising its a spectrum. In 1970s? 78% of foreigns reserves held in USD In 1980s? 70% In 1990s? 60% In 2000s? Back up to 70% becasue of the Euro introduction (US got lucky) In 2010s? Back down to low 60's% In 2020? 59% In 2025? 57.8% In Q2 2025? 56.3% Point being, the USD has been in a steady decline. The Euro introduction was a one off and will never happen again for another country competing with the dollar. Given this year's tariffs and threats you can only expect this decline to continue quickly. Some estimates suggest the dollar loses majority in late 2020's or early 2030's depending on a number of factors. Like every empire before it, the cost of maintaning its status at the top of the mountain is crippling the US's ability to carry its own weight. Like every empire before it, it will fall to another eventually....this is coming from an American!!!",
                "author": "Extension_Degree3533"
            },
            {
                "raw_content": "I have said before we could very well have Fed fund rate be below 200 bps while 10 yr still hovers around 4% as bond market essentially rejects the rate cuts. This scenario is very very bad for Fed, banks and could cause unc which will tighten up credit including private lending.",
                "author": "Dmoan"
            },
            {
                "raw_content": "Once again, mortgage rates are not elevated, the historical average from 1971 to 2025 is 7.70%. The current mortgage rates are below average, people saw 3% mortgages for a few years out of 50 and lost their minds thinking this is how it should be forever. It was not and will not, you wouldn't see 3% mortgages again for a long time.",
                "author": "Giantmeteor_we_needU"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Slip As Would-Be Buyers Wait For Lower Rates and Economic Clarity",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The same report says that the median home-sale price increased 2.4% year over year, the biggest jump in six months.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "“The homes that are selling are staying on the market longer: Homes are taking a median of 49 days to go under contract, the longest span for this time of year since 2019.” Since 2019, when the market was normal and rates were even lower. So, basically, today’s market is closer to normal. Yeah, sounds real dire.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "I keep a close eye on things since I have a downpayment saved and I'm nearly 30. I've seen a home drop $1000 each month for 4 years straight in Kansas City without selling. These people think someone will pay them half a million dollars to live in a racist Missouri suburb that spends all their time trying to ban abortion and Trans people from existing.",
                "author": "GrubberBandit"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google DeepMind - SIMA 2: An agent that plays, reasons, and learns with you in virtual 3D worlds",
        "score": 1123,
        "text_content": "[https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds](https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds)",
        "comments": [
            {
                "raw_content": "This will help train robots in realistic worlds, in a very cheap and safe manner. Should help boost research training for AI.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "If it can learn and adapt to virtual worlds that it has never seen before, what prevents it to learn and adapt to real world as humanoid robot ai? I mean right now, no \"one day\"?",
                "author": "Normaandy"
            },
            {
                "raw_content": "https://preview.redd.it/c3u185ept11g1.jpeg?width=1536&format=pjpg&auto=webp&s=3b2a314ce13c8342a9cc9406e51c0228f45458fe \\> One of SIMA 2’s most exciting new capabilities is its capacity for self-improvement. We’ve observed that, throughout the course of training, SIMA 2 agents can perform increasingly complex and new tasks, bootstrapped by trial-and-error and Gemini-based feedback. \\> For example, after initially learning from human demonstrations, **SIMA 2 can transition to learning in new games exclusively through self-directed play, developing its skills in previously unseen worlds without additional human-generated data.** In subsequent training, SIMA 2’s own experience data can then be used to train the next, even more capable version of the agent. We were even able to leverage SIMA 2’s capacity for self-improvement in newly created Genie environments – a major milestone toward training general agents across diverse, generated worlds. This is essentially the beginning of the singularity. They're using Genie 3 to create worlds and SIMA 2 to recursively self-improve in that world.",
                "author": "MassiveWasabi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jeff Bezos's Blue Origin launches New Glenn rocket with payload headed to Mars and becomes second company to successfully capture reusable rocket booster",
        "score": 1392,
        "text_content": "Twitter post: https://x.com/blueorigin/status/1989076977245122908?s=20 Livecast: https://x.com/i/broadcasts/1OdJrOyrXwyxX?s=20",
        "comments": [
            {
                "raw_content": "When will Amazon sell these?",
                "author": "MechanicalDan1"
            },
            {
                "raw_content": "Soon this will become commonplace for all rockets",
                "author": "FarrisAT"
            },
            {
                "raw_content": "More details from AP news https://apnews.com/article/blue-origin-mars-nasa-new-glenn-bezos-4e3e6c380b8294b557618a6fea92282b > Blue Origin launched its huge New Glenn rocket Thursday with a pair of NASA spacecraft destined for Mars. > It was only the second flight of the rocket that Jeff Bezos’ company and NASA are counting on to get people and supplies to the moon — and it was a complete success. > The 321-foot (98-meter) New Glenn blasted into the afternoon sky from Cape Canaveral Space Force Station, sending NASA’s twin Mars orbiters on a drawn-out journey to the red planet. Liftoff was stalled four days by lousy local weather as well as solar storms strong enough to paint the skies with auroras as far south as Florida. > In a remarkable first, Blue Origin recovered the booster following its separation from the upper stage and the Mars orbiters, an essential step to recycle and slash costs similar to SpaceX. Company employees cheered wildly as the booster landed upright on a barge 375 miles (600 kilometers) offshore. An ecstatic Bezos watched the action from Launch Control.",
                "author": "Terrible-Priority-21"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Shattering the Illusion: MAKER Achieves Million-Step, Zero-Error LLM Reasoning | The paper is demonstrating the million-step stability required for true Continual Thought!",
        "score": 158,
        "text_content": "Abstract: >LLMs have achieved remarkable breakthroughs in reasoning, insights, and tool use, but chaining these abilities into extended processes at the scale of those routinely executed by humans, organizations, and societies has remained out of reach. The models have a persistent error rate that prevents scale-up: for instance, recent experiments in the Towers of Hanoi benchmark domain showed that the process inevitably becomes derailed after at most a few hundred steps. Thus, although LLM research is often still benchmarked on tasks with relatively few dependent logical steps, there is increasing attention on the ability (or inability) of LLMs to perform long range tasks. This paper describes MAKER, the first system that successfully solves a task with over one million LLM steps with zero errors, and, in principle, scales far beyond this level. The approach relies on an extreme decomposition of a task into subtasks, each of which can be tackled by focused microagents. The high level of modularity resulting from the decomposition allows error correction to be applied at each step through an efficient multi-agent voting scheme. This combination of extreme decomposition and error correction makes scaling possible. Thus, the results suggest that instead of relying on continual improvement of current LLMs, massively decomposed agentic processes (MDAPs) may provide a way to efficiently solve problems at the level of organizations and societies. This connects to the Continual Thought concept I wrote about in a comment on reddit recently: >But we also need continual thought! We also think constantly about things to prepare for the future or to think through different Szenarios the ideas that we think are most important or successful. We then save it in our long term memory via continual learning. We humans are also self critical thus I think a true AGI should have another thought stream that constantly criticizes the first thought Stream and thinks about how some thoughts could have been thought faster or which mistakes could habe been avoided or have been made by the whole system or how the whole AGI could have acted more intelligent. I think this paper is a big step in creating the thought streams i was talking about. The Paper solves the reliabilty problem that would prevent the creation of thought streams until now. This paper allows an AI that would normally derail after a few hundred steps to go to one million steps and potentially infinite more with Zero errors! Thus I think it is a huge architectual breakthrough that will at least in my opinion allow for far smarter AIs then we have seen until now. Together with [https://research.google/blog/introducing-nested-learning-a-new-ml-paradigm-for-continual-learning/](https://research.google/blog/introducing-nested-learning-a-new-ml-paradigm-for-continual-learning/) and [https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds/](https://deepmind.google/blog/sima-2-an-agent-that-plays-reasons-and-learns-with-you-in-virtual-3d-worlds/) that are beginning to solve continual learning we could see truly remakable AIs in the near future that solve problems we could not even begin to accomplish with AIs that were made befor these breakthroughs! **Website:** [https://www.cognizant.com/us/en/ai-lab/blog/maker](https://www.cognizant.com/us/en/ai-lab/blog/maker) **Paper:** [https://arxiv.org/abs/2511.09030](https://arxiv.org/abs/2511.09030) **Youtube:** [https://youtu.be/8OvIeJUc1N0?si=1GI1C3N6l477A5MV](https://youtu.be/8OvIeJUc1N0?si=1GI1C3N6l477A5MV)",
        "comments": [
            {
                "raw_content": "That graph is insane lol.",
                "author": "torrid-winnowing"
            },
            {
                "raw_content": "id be excited to be proven wrong on this but it seems like “Solving a Million-Step LLM Task with Zero Errors” is more like \"Solving a deterministic puzzle with a trivial recursive algorithm and a known optimal sequence that can be coded in 20 lines of python\". that headline is doing a ton of work and they have essentially created the most expensive tower of hanoi algorithm - this is nowhere near “a million step arbitrary reasoning chain” and i have serious doubts as to this having any ability to scale to even the simplest open ended problems. this seems okay for problems with a known solution and algorithm but then at that point might as well just code it. also that graph is textbook misleading data representation. they are comparing general models to an orchestration of millions of calls to a small model. the rightmost point is a single successful run with a lot of special machinery and hand made choices. its like plotting single violinists on the left then putting an entire orchestra with a conductor and post production editing on the right and calling that a fair comparison of musicians. if the authors are willing to do that id be incredibly skeptical of the rest of the content of this paper.",
                "author": "a300a300"
            },
            {
                "raw_content": "There are zillions of these papers but whether they scale to more complex problems or not is the question. Still, as a way to achieve low error rates on rote tasks, it's interesting I suppose.",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrew Ng pushes back against AI hype on X, says AGI is still decades away",
        "score": 483,
        "text_content": "[https://x.com/AndrewYNg/status/1989003741316673714](https://x.com/AndrewYNg/status/1989003741316673714)",
        "comments": [
            {
                "raw_content": "Pretty incredible that even the \"good outcome\" here of no work and UBI is despair inducing.",
                "author": "drkevorkian"
            },
            {
                "raw_content": "Apologies if the text is hard to read, not sure why the image upload came out blurry. Mirrored on imgur [https://imgur.com/a/lk8oKGT](https://imgur.com/a/lk8oKGT)",
                "author": "Mindrust"
            },
            {
                "raw_content": "i'm immediately skeptical about anybody that claims to know what the future holds... whether its pessimistic, optomistic, dystopian, utopian, etc.",
                "author": "miked4o7"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT 5.1 Benchmarks",
        "score": 312,
        "text_content": "A decent upgrade—looks like the focus was on the “EQ” Part rather than IQ.",
        "comments": [
            {
                "raw_content": "Remember, Plus users don't get access to the high thinking setting of GPT-5 (\"extended thinking\" is about equal to medium on the API). So if you are a Plus subscriber, this doesn't mean much to you. OpenAI doesn't seem very eager to release benchmark scores for the specific version of ChatGPT-5 Thinking that's actually available to Plus users.",
                "author": "Medical-Clerk6773"
            },
            {
                "raw_content": "Nice jump for just .1",
                "author": "Sharp_Chair6368"
            },
            {
                "raw_content": "Not surprised because it feels smarter. Compared to 5, I think it's better and understanding the user's context and assumptions behind the prompt, which makes it feel a little less tunnel-vision-ey than 5.",
                "author": "ObiWanCanownme"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Robot Revolution",
        "score": 165,
        "text_content": "Source: [Humanoid robot guide](https://humanoid.guide/) (price included).",
        "comments": [
            {
                "raw_content": "Where's the OG, my boy Asimo?",
                "author": "ExoTauri"
            },
            {
                "raw_content": "https://preview.redd.it/bk8142pji41g1.png?width=630&format=png&auto=webp&s=c284c6417a31d37fe836452a50be0f0cffb95b76",
                "author": "codestormer"
            },
            {
                "raw_content": "Huh, I don't want to have sex with any of them.",
                "author": "UnderpaidModerator"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"AI isn't capable of intelligence\"",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even in this sub there are many commentators with the same beliefs.",
                "author": "DepartmentDapper9823"
            },
            {
                "raw_content": ">we know what it does and how Besides the fact that frontier models are black boxes and we still don't fully understand how they actually work as well as they do, this part of the comment really exposes how some people think about these things. The fact that we have something which produces aspects of our intelligence is proof to them that it's not intelligent. Once we know how something works, it's no longer magical. To them, intelligence is a mysterious spooky thing and we'll never know how it really works. It's their God of the gaps.",
                "author": "Mindrust"
            },
            {
                "raw_content": "Next up, can a submarine actually swim?",
                "author": "Additional-Bee1379"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I have access to Nano-banana 2, send prompts/edits and I'll run them",
        "score": 177,
        "text_content": "Was able to gain access to nb2, send prompts/edits and I'll output",
        "comments": [
            {
                "raw_content": "12-frame pixel art sprite sheet of a medieval knight riding a horse, side view. Smooth gallop animation loop where the knight’s cape and the horse’s mane and tail move naturally. Clear silhouette, readable at small size, limited color palette, no background, transparent background, evenly spaced frames in a single horizontal row.",
                "author": "Due_Plantain5281"
            },
            {
                "raw_content": "https://preview.redd.it/dro17jhb721g1.jpeg?width=3120&format=pjpg&auto=webp&s=5669645eeae856f52564f6413e7c1c30420cfe33 Edit these mushrooms so that there is a jazz band of cats playing music on top of them.",
                "author": "Additional_Ad_7718"
            },
            {
                "raw_content": "A composite of all US presidents including images of their face, name, and term in office.",
                "author": "iaintfraidofnogoats2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 is too good at frontend",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It looks nice, crazy where we are headed. But i personally hate websites like this. I don't need things flying all over the place to read some text.",
                "author": "djamp42"
            },
            {
                "raw_content": "That one logan tweet of \"I'm now more confident in google than I have ever been\" tweet makes perfect sense, since than we have gotten this, and genie 3.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Is the link broken or what? I get just blank page with x.com at the top. Can someone please post it here as a hyperlink?",
                "author": "RudaBaron"
            }
        ],
        "subreddit": "singularity"
    }
]