[
    {
        "post_name": "Trump reads The Night Before Christmas!",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sauce https://x.com/i/status/2004013363345707102",
                "author": "Whenagain"
            },
            {
                "raw_content": "A classic is born!",
                "author": "Mamapedia"
            },
            {
                "raw_content": "🤣 This is awesome!!! # ***TOP KEK***",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania wishing everyone a Merry Christmas",
        "score": 565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mrs. Melania Claus is 💯🔥🔥🔥",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Don't miss this, u/ItsFunToSay-M-A-G-A",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "🇺🇸❤️🎄❤️🇺🇸",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✨️To the fair pedettes on Pdw✨️ Merry Christmas Lady pedes",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any woman tough and brave enough to endure this place has my undying respect. Truly the best of the best supporters.",
                "author": "Emodius"
            },
            {
                "raw_content": "Awwww, Merry Christmas to OP, too !! (From a pedette)",
                "author": "walls4america"
            },
            {
                "raw_content": "And they didn’t believe that there were so many of us here. Smart women, indeed do love President Trump.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rita Loncharich was reading a magazine at the bookstore in Palm Beach Gardens when she was stabbed in the back without warning by Antonio Moore, 40, who came to Florida just days earlier, according to an affidavit that said he confessed.",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“He stabbed me!” the married shopper cried out in extreme agony. An overwhelming recurring pattern is happening in The United States of America. Call it what you like, it must be stopped. Rita Loncharich was reading a magazine at the bookstore in Palm Beach Gardens when she was stabbed in the back without warning by Antonio Moore, 40, who came to Florida just days earlier, according to an affidavit that said he confessed. The store’s surveillance cameras caught Moore running off to nearby woods, where he was quickly arrested, police said. Moore “willfully admitted to stabbing a woman in the back inside Barnes and Noble and running out of the store,” the affidavit said — saying he had “no prior interaction” with or motive to kill her. He instead blamed a psychotic “internal build up” that made him pick on “the closest person in the store,” investigators said in the affidavit. Prosecutors say, Moore will likely be found \"incapable of understanding a trial\", and ultimately will be found 'too simple' to be found guilty. He'll be sent to a mental health facility, where he'll continue to play the psychotic role for a few months, then miraculously get better, and be released back into the community within a few years. https://t.co/x47L4E8jlV",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Reading in a book store is peak White Supremacy. Seems a book store is no longer the camouflage it used to be. RIP peaceful undeserving lady.",
                "author": "SpellingContable"
            },
            {
                "raw_content": "Stay frosty out there, pedes.",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump and Melania Trump looks happier and younger than ever before.",
        "score": 1018,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have the best POTUS and FLOTUS don't we?",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "They are so adorable. What a great photo!",
                "author": "TNgirl4Trump"
            },
            {
                "raw_content": "MAGA ENERGY makes you young at heart! *Believe me.* 🇺🇸😄",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas to all, including the Radical Left Scum that is doing everything possible to destroy our Country, but are failing badly.",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All I want for Christmas is to know future elections are secure.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Bold of the President to assume the leftists are still capable of reading English. They are on a speed running mission to having everyone speak and read either Spanish and Arabic in America.",
                "author": "Trumportellagain"
            },
            {
                "raw_content": "The people trying to destroy our country don't celebrate Christmas.",
                "author": "Made_in_America"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas??? DROP and GIBS memes",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Drop and gibs me twenty memes you faggots 🐸🤣",
                "author": "Deadpool"
            },
            {
                "raw_content": "https://imgflip.com Be the Change",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Is that you, John Wayne? Is this me?",
                "author": "Iliterallylovejv"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We are supposed to be upset about this",
        "score": 493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I wish Trump would hook up Santa with ICE and start delivering these illegals back to their shitholes",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "why’s Trump touching his third leg?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Follow the money 🐸 ✌️",
                "author": "StrongIsland"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump explains the true meaning of Christmas",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuckin rekt. Merry Christmas. # CHRIST IS KING",
                "author": "WesternCivilization"
            },
            {
                "raw_content": "Original video: https://m.youtube.com/watch?v=6DlDGOsa8fc",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "👌🏻",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh Santa!!",
        "score": 871,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be fair, he might get shot breaking into homes in red cities.",
                "author": "Cheesemaker"
            },
            {
                "raw_content": "We'll hear news stories tomorrow about Santa getting sleigh-jacked tonight. An hour later videos of fat Shaniquas twerking on top of Comet and Blitzen will roll out as thugs run past with hands full of cookies and red pants sagging down their ass.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "He's missing his tank.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - A 92-page report by the California State Auditor has found that over $70 billion in taxpayer funds have been lost, including $2.5 billion in SNAP fraud, $24 billion on fighting homelessness, and $18 billion for a high-speed rail where not a single track has been laid.",
        "score": 1278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its much higher than that.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Any place there are democrats you will find absurd levels of fraud.",
                "author": "booblitchutz"
            },
            {
                "raw_content": "So many tracks of fraud. Amazing that there are still pawns that believe the politicians actually care about Americans.",
                "author": "AllahFubar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"REDACTED\"",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So let's talk about the 0 arrests. At what point does it move beyond Pam and become Trump's fault?",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Do you have a digital copy of the list? You can just copy-and-paste.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "FBI \"just found\" a million Epstein files laying around. At what point is enough enough with this cunt?",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They're coming over tonight",
        "score": 622,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Merry Christmas Pedes",
                "author": "Yourpersonalfbiagent"
            },
            {
                "raw_content": "AI produces better content than Hollywood these days",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Ok, that was fun!",
                "author": "TruthyBrat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: “The birth of Jesus Christ is the true miracle we celebrate each Christmas. He is the ultimate source of our joy, our hope, & our sense of peace.”",
        "score": 1165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amen.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "Merry Christmas to everyone here. Glory to God for the greatest gift of all, our Lord and Savior Jesus Christ.",
                "author": "RedWhiteBlue15"
            },
            {
                "raw_content": "Jesus Christ is King! Christ cometh!",
                "author": "UncleTrumpsBand"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bari is such a hard-ass.",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah yes, the hard hitting “journalism” of bari israel first weiss.",
                "author": "Flying_Pede_121"
            },
            {
                "raw_content": "Bari Weiss is not your friend",
                "author": "modded"
            },
            {
                "raw_content": "Jew",
                "author": "xanaxagoras"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CHILD: Will Santa get mad if we don’t leave him out cookies?! TRUMP: “He won't get mad, he'll be VERY disappointed. Santa tends to be on the CHERUBIC side. You know what cherubic means? On the heavy side. Santa would like some cookies. You'd like to leave some cookies, right?”",
        "score": 893,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There will NEVER be another President Trump 🤣 CHILD: Will Santa get mad if we don’t leave him out cookies?! TRUMP: “He won't get mad, he'll be VERY disappointed. Santa tends to be on the CHERUBIC side. You know what cherubic means? On the heavy side. Santa would like some cookies. You'd like to leave some cookies, right?” 😂🔥 “I'd leave them. I think Santa has a serious appetite.”",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "If half of all Christians leave cookies out, the average being 3 cookies, that's over 3 billion calories in 24 hours. Bro has some skills.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "> You know what cherubic means? * fat Vance walks in",
                "author": "killedmytv"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas frens!",
        "score": 751,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Merry Christmas! Jesus Christ is King!",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Merry Christmas to you all!",
                "author": "bsamson22"
            },
            {
                "raw_content": "Jesus is God. Obama is gay. Michelle is a man. The GOP is half bitches. Kirk was assassinated by the deep state. Trans people are retarded. Olive oil is cancerous. MMORPGs are dead. America is superior Merry Christmas to ALL",
                "author": "Paydro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Breaking: The FBI just found a million new Epstein files",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, for the love of Christ! They have been sitting on these files for over 5 years! WTF does this mean?",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Impossible. I was told that these didn't exist. I believe we were called \"stupid people\" for asking for these documents that were on Bondi's desk but then told that it was all a conspiracy theory.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Wake me when someone gets arrested.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "My wife was murdered by Joe Biden's Vaccine Mandates while Congress exempted themselves from those same Mandates.",
        "score": 701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its not. You’re correct. I’m sorry for your loss. My boss had to take it or his wife would divorce him. He chose wrong.",
                "author": "MkultraUSA"
            },
            {
                "raw_content": "My hubby was mandated to take it and he refused. I told him I don’t care if you get fired n we live in our car you are not getting that vax! He didn’t and he kept his job n got a raise n promotion jan 2024!",
                "author": "AngelMark2"
            },
            {
                "raw_content": "If you ask liberals, I’m sure they’ll say they can’t find anyone who regrets taking it, because they all obviously died in the winter of severe illness and death of 2021, 2022, 2023 and 2024.",
                "author": "thisisatestof2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MERRY CHRISTMAS VS. HAPPY HOLIDAYS!!!!",
        "score": 963,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Greta is starting to look like a dude",
                "author": "AutPaxAutBellum300"
            },
            {
                "raw_content": "Little Green Greta is going full Oompa Loompa.",
                "author": "Neonentity"
            },
            {
                "raw_content": "BY THE POWER OF GRAYSKULL, HAPPY HOLIDAYS!",
                "author": "Meddlesom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia to buy AI chip startup Groq for $20 billion",
        "score": 287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn and to think they acquired Mellanox for only 7bil",
                "author": "tecedu"
            },
            {
                "raw_content": "Are they buying the company to invest in developing alternative chips for training LLMs or are they buying it to prevent the development of alternative chips for training LLMs?🤔",
                "author": "1oarecare"
            },
            {
                "raw_content": "CNBC was wrong. https://groq.com/newsroom/groq-and-nvidia-enter-non-exclusive-inference-technology-licensing-agreement-to-accelerate-ai-inference-at-global-scale > > Groq and Nvidia Enter Non-Exclusive Inference Technology Licensing Agreement to Accelerate AI Inference at Global Scale > Share this article > > Today, Groq announced that it has entered into a non-exclusive licensing agreement with Nvidia for Groq’s inference technology. The agreement reflects a shared focus on expanding access to high-performance, low cost inference. > > As part of this agreement, Jonathan Ross, Groq’s Founder, Sunny Madra, Groq’s President, and other members of the Groq team will join Nvidia to help advance and scale the licensed technology. > > Groq will continue to operate as an independent company with Simon Edwards stepping into the role of Chief Executive Officer. > > GroqCloud will continue to operate without interruption.",
                "author": "bobj33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to delay its planned DDR4 end-of-life due to signing a long-term 'non-cancellable, non-returnable' contract with key customer — agreement will not alleviate consumer shortage, supply earmarked for server clients",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh thank god they included that bit after the em dash. I was worried for a second something positive had happened for average Joes.",
                "author": "explosiv_skull"
            },
            {
                "raw_content": "server ddr4 earmarked for a key customer, on a long term NCNR contract suggests this customer is one of the big server OEMs. but which server OEM is still pumping out epyc7001/2/3 or cascade lake/icelake racks?",
                "author": "randomkidlol"
            },
            {
                "raw_content": "AMD could pull the greatest stunt in history and release a 5850X3d or something.",
                "author": "atape_1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix expands U.S. presence with new Bellevue, Seattle office in efforts to get closer to its largest customers — offices near Nvidia, Amazon, and Microsoft highlight co-designed HBM efforts",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello snowfordessert! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What is preventing SSD prices from dropping in a similar fashion that HDD drives have?",
        "score": 19,
        "text_content": "**edit:** people have pointed out that long term there has been downward pressure, but short term there’s been a slight spike which is likely aligning with my anecdotal experience buying drives. HDDs have gotten very cheap in terms of $/GB. NVME SSDs as far as I can tell over the past \\~10 years have not seen major price drops. the price has gone down yes but I was hopping for like $200 4 TB NVMe drives by now. What gives?",
        "comments": [
            {
                "raw_content": "[https://www.reddit.com/r/DataHoarder/comments/17sljc1/as\\_requested\\_an\\_improved\\_chart\\_of\\_ssd\\_vs\\_hdd/#lightbox](https://www.reddit.com/r/DataHoarder/comments/17sljc1/as_requested_an_improved_chart_of_ssd_vs_hdd/#lightbox) The price going down was the norm until very recently. It was actually falling faster than HDD prices.",
                "author": "Deep90"
            },
            {
                "raw_content": "Hasn't HDDs gone up in price in the past few years instead of going down?",
                "author": "TortieMVH"
            },
            {
                "raw_content": "Not sure what you're talking about. SSDs had gotten dirt cheap. Now, the highest capacity drives like 4TB and 8TB were more expensive, but that's because they're the highest capacity. At one point, 1TB was prohibitively expensive, but at least until recently, you could get a 1TB now for like $50-60. Their prices are on the rise again because of the DRAM shortage, but that's relatively new.",
                "author": "webjunk1e"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Tested Intel's 18A Node but Did Not Commit to Intel Foundry",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't Intel already say earlier this year that their goal for external customers was for 18AP and 14A, because 18A had teething issues and they were going to use 18A internally? How is this a story?",
                "author": "nyrangerfan1"
            },
            {
                "raw_content": "[In a late 2023 interview](https://stratechery.com/2023/an-interview-with-intel-ceo-pat-gelsinger-about-intels-progress-towards-process-leadership/), just a year before Pat Gelsinger was fired: >**PG:** In no way do I think that just because we’ve now demonstrated **18A**, we’ve given the first PDKs (Process Design Kit) for it, the world is going to say, “Oh, let’s stop doing all that 3 nanometer stuff and let’s move over here”, that’s not going to happen. **But I am pretty dead set that we are going to capture major designs because everybody**, when they finish their 3 nanometer designs, they’re going to say, “What’s next?”, and the combination of RibbonFET and PowerVia is **proving to be very compelling**. Compelling on area, compelling on performance, compelling on power capabilities. It boggles the mind that Intel and PG *truly* believed—for *all* of Gelsinger's tenure—that 18A was going to capture major designs away from TSMC. Nobody went TSMC N3 to Intel 18A, did they? Basically everyone re-upped for TSMC N3 or N2, or Samsung internally for its mobile APs.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Intel can't even win Intel as a GPU fab customer.",
                "author": "OttawaDog"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia buying AI chip startup Groq for about $20 billion in its largest acquisition on record",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In an email to employees that was obtained by CNBC, Nvidia CEO Jensen Huang said the agreement will expand Nvidia’s capabilities. >“We plan to integrate Groq’s low-latency processors into the NVIDIA AI factory architecture, extending the platform to serve an even broader range of AI inference and real-time workloads,” Huang wrote. >Huang added that, “While we are adding talented employees to our ranks and licensing Groq’s IP, we are not acquiring Groq as a company.” A fascinating deal, especially with news on TPUs and ASICs being hot right now with Google on Gemini and their TPUs ([cough cough](https://nitter.net/nvidianewsroom/status/1993364210948936055)). I've been loosely been aware of HW from the likes from Groq and Cerebras on their solutions for high speed and low latency inferencing so if even Nvidia thinks this is an interesting avenue, then I wonder what the future holds for DC AI. Probably nothing much changes with their current roadmap for training, but cloud compute to deploy inferencing for massive concurrency could maybe see a shift, after all, it seems efficiency is of importance until power gen infrastructure catches up to demand. I wonder what AMD and Intel are currently thinking. I mean, if they want to give [Cerebras ](https://www.cerebras.ai/blog/cerebras-cs-3-vs-groq-lpu)a call... Also both companies are sitting on their own ASIC/NPU IPs, I wonder what's up with that if they want to scale it up for DC.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Incredible move by Nvidia.",
                "author": "LargeSinkholesInNYC"
            },
            {
                "raw_content": "Okay, so that’s why their hat wasn’t in the WB race. Will they go for Comcast next? All these trillionaire CEOs(once retired) want their own media empire, right?",
                "author": "happy_oblivion"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's HBM4 SiP tops Nvidia's performance tests, heating up memory race",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you link full article?",
                "author": "binge_readre"
            },
            {
                "raw_content": "How about we just get the volume right, so ram can be cheap again?",
                "author": "corruptboomerang"
            },
            {
                "raw_content": "Bring them both up on antitrust charges. Apparently some here don’t like that.",
                "author": "nonaveris"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Record-breaking anode-free battery hits 1,270 Wh/L energy density, ‘doubles’ EV range",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is an increase in Volumetric density (Wh/L) most batteries today are already around 800-900 Wh/L This would've been more exciting if they had achieved such figures in gravimetric density (Wh/Kg) where most batteries today currently have around 270-330 Wh/kg at cell level",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "make sense for EV but unfortunately for laptop it only means lighter laptop. Because all laptop is capped at max 99wh.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "My boys are getting a Switch2 for Christmas",
        "score": 1803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Gets excited about the XBox* Awkwaaaaard.",
                "author": "Valnaire"
            },
            {
                "raw_content": "Switch 2 inside of an xbox box is crazy",
                "author": "Technical_Device2513"
            },
            {
                "raw_content": "In a Series X box is wild",
                "author": "No_Opportunity9053"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Look what my mom gave me for Christmas a switch 2",
        "score": 608,
        "text_content": "I wasn’t expecting this",
        "comments": [
            {
                "raw_content": "And mom got me the MKW bundle",
                "author": "supersentailfan13"
            },
            {
                "raw_content": "congrats!",
                "author": "bigtech100"
            },
            {
                "raw_content": "Console is a fucking blast",
                "author": "memeaste"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My son with his present",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s awesome! Great job mum! Hope you both have a great day!",
                "author": "43ddit77"
            },
            {
                "raw_content": "I love seeing people get super happy about things, this was great of you",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "Sweet family vibe. Your son even kept the Switch box ready for you. So thoughtful!",
                "author": "Deathzone622"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Games i got this Christmas",
        "score": 85,
        "text_content": "what games should i get next?",
        "comments": [
            {
                "raw_content": "How about you play those first? That’s 100s of hours worth of content",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "Persona 3 Reload just got fixed. Perfect timing. Bananza is a sublime game.",
                "author": "Medd-"
            },
            {
                "raw_content": "It seems bananza is the shortest comparing to the others",
                "author": "conkerlikeN64"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think Wind Waker HD and/or Twilight Princess HD will come to Switch 2 next year for the 40th anniversary?",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You’ll get Twilight Princess on the GameCube NSO app for $50/year, and you will like it, mister!",
                "author": "Docile_Doggo"
            },
            {
                "raw_content": "It will. Because this past weekend, I picked up a copy of Twilight Princess HD for $80 at a local shop and it seems like I have a tendency to buy old versions of games a few months before the announcement of a remake/port. Last time it happened with Red Dead Redemption. I grabbed a copy for PS3 and then the Switch port came out. Before that, I got Silent Hill 2 on PS2 and then the remake got announced. This is the ultimate test. If we get a Twilight Princess announcement in the next Direct, I'll have to use this power responsibly. /j",
                "author": "kyuubikid213"
            },
            {
                "raw_content": "No. It will be an Ocarina of Time remake.",
                "author": "munchyslacks"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "About damn time... Though I should have saved money by buying the bundle instead of base + physical :/",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Congratulations 🎉🎊 Don’t forget to add a screenprotector, if you haven’t already. 😁",
                "author": "Forstmaschine"
            },
            {
                "raw_content": "Nice. You did the right thing getting the physical.",
                "author": "NestAffect"
            },
            {
                "raw_content": "Congratulation! Although you have a physical game the way you did it (although in my case, I got the bundle, and got a physical game in the box).",
                "author": "SnowPenguin_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Honestly Peak",
        "score": 55,
        "text_content": "Got mine on launch day, and i can say that i’ve been thoroughly impressed. Six months in and the game library has expanded quite a bit, definitely not a perfect system but after playing it docked for the first time(after being forced by P3 60 fps docked mode only lol) I can say that this system was worth the money. 9/10",
        "comments": [
            {
                "raw_content": "Honestly it’s everything that I wanted from the original switch and this might end up being my favorite Nintendo console ever. Regardless the next 7 years are going to be awesome with this thing and I can’t wait for the new fire emblem game next year. Definitely worth the money I paid for it",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "Mega Man Battle Network!!!!! I cannot wait to play star force 3 on switch next year.",
                "author": "Wooden-Coffee6708"
            },
            {
                "raw_content": "so happy i got p3r literally days before the patch 😭",
                "author": "jellojama"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin’s Creed: Shadows - Pushing the limits of open world games on Switch 2?",
        "score": 178,
        "text_content": "Really loving AC: Shadows (and Outlaws) and everything else, but following the recent interview from Ubisoft about the game on Switch 2, I wonder if we’ve already hit the limit for overall fidelity and graphics? Shadows has \\*a lot\\* going on with some very detailed environments, generous NPC visibility, super complex game physics/geometrics - and it’s totally open world. In the recent interview, they explained that they pushed things pretty far while pairing bits and pieces back to allow the game to run without removing key features and gameplay. Because of that, the resolution isn’t native and the gap between handheld and docked is quite obvious. They noted we shouldn’t expect that to change as a result. Do we think this is the limit of the Switch 2, and we will need to wait for DLSS improvements to keep new multi-platform games coming to the console in a like-for-like manner - or is there more juice in the tank?",
        "comments": [
            {
                "raw_content": "Just wait until whatever Monolithsoft is cooking comes out, that will be a real showcase.",
                "author": "Megabuster900000"
            },
            {
                "raw_content": "I don’t think so, it’s always hard to say what the max fidelity of a console is early into its life. It’s pretty common for games at the end of a consoles life to be much higher fidelity than those early onto its life. As more people develop for the console, more rendering/development techniques are discovered specifically for the consoles hardware allowing for overall more polish",
                "author": "Ninjaluc8401"
            },
            {
                "raw_content": "There's really some additional optimizations that can be done later on the consoles lifecycle. Both because of firmware updates, specific game engine optimization for the Switch, and more importantly, dev teams getting more familiar with the hardware. I don't suspect it's gonna be a huge jump, but if you go back to the start of the Xbox One and PS4 Gen, the early games didn't even compare to what was released at the end of it",
                "author": "Wasilisco"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lenovo to launch Yoga Mini 1-liter cylindrical Panther Lake mini PC with Arc B390 iGPU, first AIO PCs leaked as well",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These 12Xe3 cores are pretty neat, and because it fits in a normal socket it isn't ludicrously expensive to make. I suspect we'll see a ton of these different form factors for this chipset.",
                "author": "grumble11"
            },
            {
                "raw_content": "Mac Pro Trashcan 2.0 is crazy",
                "author": "Ortana45"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Case Study: Austin 2023-25",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The median home ownership length is 12 years. If you had bought in 2013, you would be up 100%.",
                "author": "xlb250"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "60 showings ( 72 total) 72 families open house, 100k price drop zero offers weird update and still confused..",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s the problem with relying on Zillow, Redfin etc for your home value estimates as they are based on algos. These algorithms use comps and when not many homes have sold and most often it is mostly new homes it can skew up. Leading to false belief from home owners their home is worth much more than actual value.",
                "author": "Dmoan"
            },
            {
                "raw_content": "579k for a 2 bedroom that is in a flood zone? What the hell? Also note, he only bought it for $250k in 2019 and is trying to make more than double the money in barely 5 years.",
                "author": "GreenGardenTarot"
            },
            {
                "raw_content": "The lemming has a difficult time understanding why there are fewer and fewer lemmings in front of them as they approach the cliff's edge. Maybe they are going down some stairs or simply squatting? They seek reassurance from those around them, always deducing that the best available option is simply to stay the course.",
                "author": "ShatterTheFlimFlam"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5.2 Pro Solved Erdos Problem #333",
        "score": 259,
        "text_content": "For the first time ever, an LLM has autonomously resolved an Erdős Problem and autoformalised in Lean 4. GPT-5.2 Pro proved a counterexample and Opus 4.5 formalised it in Lean 4. Was a collaboration with @AcerFur on X. He has a great explanation of how we went about the workflow. I’m happy to answer any questions you might have!",
        "comments": [
            {
                "raw_content": "UPDATE I am really sorry to say guys, but it’s now been discovered that the problem had already previously been solved in an old paper that hadn’t been recorded on the site prior. https://preview.redd.it/gjexllrnw99g1.jpeg?width=1320&format=pjpg&auto=webp&s=305837f7b8209d5c5d7e239335d4db18f38c241f Back to the drawing board to trying to find a first for LLMs solving an Erdős problem before humans, I’m afraid. Sorry for the false hype 🙏",
                "author": "KStarGamer_"
            },
            {
                "raw_content": "Hey there, Acer here! Feel free to ask me things as needed too!",
                "author": "KStarGamer_"
            },
            {
                "raw_content": "Looks like #333 had already been solved. But, in Nov/2025, GPT-5 Pro assisted in solving Erdős Problem #848. \\- Paper (OpenAI, [PDF](https://cdn.openai.com/pdf/4a25f921-e4e0-479a-9b38-5367b47e8fd0/early-science-acceleration-experiments-with-gpt-5.pdf)) \\- Full list of 2025 LLM discoveries: [https://lifearchitect.ai/asi/#32](https://lifearchitect.ai/asi/#32)",
                "author": "adt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA to buy Groq",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought this was grok misspelled",
                "author": "rafark"
            },
            {
                "raw_content": "Oh I think this is kinda the \"grab the parts you want\" acquisition like the windsurf deal so they don't need to deal with regulators on the whole company. The founders and top engineers are joining Nvidia with the technology but the whole company isn't going along with it...",
                "author": "Charuru"
            },
            {
                "raw_content": "This is NOT an acquisition, NVIDIA has NOT bought Groq, they have entered into a licensing agreement with them Direct source - https://groq.com/newsroom/groq-and-nvidia-enter-non-exclusive-inference-technology-licensing-agreement-to-accelerate-ai-inference-at-global-scale",
                "author": "DevilsAdvotwat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic co-founder warns: By summer 2026, frontier AI users may feel like they live in a parallel world",
        "score": 457,
        "text_content": "**Anthropic co-founder, Jack Clark:** By summer 2026, the AI economy may move so **fast** that people using frontier systems feel like they live in a parallel world to everyone else. Most of the **real** activity will happen invisibly in digital, AI-to-AI spaces, with only surface signs showing up in everyday life (datacenters, compute/power constraints and the startup ecosystem). **Source: Jack new X article post** **Full article:** https://x.com/i/status/2003526145380151614",
        "comments": [
            {
                "raw_content": "Tell me, is this parallel crypto world in the room with us right now?",
                "author": "alejandro712"
            },
            {
                "raw_content": "Lol crypto gamblers are definitely living in a parallel reality, but probably not the way he means",
                "author": "vanishing_grad"
            },
            {
                "raw_content": "People are quickly learning how these incredibly vague \"warnings\" being pushed by these companies are really just free marketing.",
                "author": "LordFumbleboop"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "METR: Claude Opus 4.5 hits ~4.75h task horizon (+67% over SOTA)",
        "score": 58,
        "text_content": "Updated METR benchmarks show Claude Opus 4.5 completes software engineering tasks requiring approximately 4 hours and 45 minutes of human effort (50% pass rate). This marks a 67% increase over the previous capability frontier established by GPT-5.1-Codex-Max. The data substantiates a continued exponential trajectory in the temporal scope of autonomous agentic workflows.",
        "comments": [
            {
                "raw_content": "this is misleading, it is 30 minutes for 80% pass rate which is most important for real work and automation.",
                "author": "d00m_sayer"
            },
            {
                "raw_content": "where is the gemini family?",
                "author": "kvothe5688"
            },
            {
                "raw_content": "oh yeah its all coming together",
                "author": "Different-Incident64"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's CEO Sam Altman says in 10 years time college graduates will be working 'some completely new, exciting, super well-paid' job in space",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Musk says we wont be working and money will be worthless, this guys says we will be working super well paid jobs...",
                "author": "terra_filius"
            },
            {
                "raw_content": "nobody will bother sending people to space in 10 years",
                "author": "whyisitsooohard"
            },
            {
                "raw_content": "Oh yeah when AI can do everything a human can do, surely the greedy corporation will pay 200k salaries to everyone for, uhh, reasons. Anyone believing these grifter at this point is a lost cause.",
                "author": "Creed1718"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "karpathy's nano banana section made something click",
        "score": 21,
        "text_content": "reading karpathy's 2025 review (https://karpathy.bearblog.dev/year-in-review-2025/). the part about LLM GUI vs text output. he says chatting with LLMs is like using a computer console in the 80s. text works for the machine but people hate reading walls of it. we want visuals. made me think about how much time i waste translating text descriptions into mental images. been doing some design stuff lately and kept catching myself doing exactly this. reading markdown formatted output and trying to picture what it would actually look like. tools that just show you the thing instead of describing it are so much faster. like how nano banana mixes text and images in the weights instead of piping one into the other. we're gonna look back at 2024 chatbots like we look at DOS prompts.",
        "comments": [
            {
                "raw_content": "Can't wait to hop on a live video call with Ai avatar that talks to you while providing necessary information at the bottom like location maps to a restaurant",
                "author": "HyperspaceAndBeyond"
            },
            {
                "raw_content": "karpathy always points out stuff that seems obvious after he says it",
                "author": "No_Radio_8318"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Big update: OpenAI’s upcoming ChatGPT ads, targeting a 2026 rollout",
        "score": 183,
        "text_content": "Got this **exclusive** update from The Information(paid) on **how OpenAI is planning ads inside ChatGPT.** OpenAI is actively testing how advertising could be integrated into ChatGPT responses. **1. Sponsored information inside answers:** For certain commercial queries, AI models may prioritize sponsored content so it appears directly within responses. **Example cited:** a Sephora sponsored mascara recommendation when asking for beauty advice. **2. Sponsored modules beside the main reply** Ads could appear in a sidebar next to ChatGPT’s main response, paired with a clear disclosure such as **includes sponsored results.** Another tested approach **keeps** ads out of the first reply entirely. Ads only surface after the user signals deeper intent. **Example:** Clicking a location in a travel itinerary could trigger a pop up showing paid tours or experiences, such as sponsored links after selecting Sagrada Familia. The stated goal **internally** is to keep ads unobtrusive while protecting user trust. **Source:The Information(subscribed)** [ChatGPT Ads Update](https://www.theinformation.com/articles/openais-ads-push-starts-taking-shape)",
        "comments": [
            {
                "raw_content": "> For certain commercial queries, AI models may prioritize sponsored content so it appears directly within responses. I don't necessarily have a problem with ads if they're not intrusive, but this sounds way worse than I expected. The whole appeal of AI is that you are getting impartial answers to your queries from this omniscient oracle.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "This is going to kill trust in AI. I’d much rather have traditional banner ads and pop-ups than this",
                "author": "jaundiced_baboon"
            },
            {
                "raw_content": "Well the day that happens is the day that I cancel my ChatGPT subscription.",
                "author": "141_1337"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists boost mitochondria to burn more calories",
        "score": 110,
        "text_content": "[https://phys.org/news/2025-12-scientists-boost-mitochondria-calories.html](https://phys.org/news/2025-12-scientists-boost-mitochondria-calories.html) [https://pubs.rsc.org/en/content/articlelanding/2026/sc/d5sc06530e](https://pubs.rsc.org/en/content/articlelanding/2026/sc/d5sc06530e) \"Mitochondrial uncoupling by small molecule protonophores is a promising therapeutic strategy for leading diseases including obesity, diabetes and cancer, however the clinical potential of these agents is complicated by their associated toxicity. Protonophores that exclusively produce mild uncoupling can circumvent toxicity concerns, but these compounds or a framework to guide their design is currently lacking. In this study, we prepared a series of atypical arylamide-substituted fatty acid protonophores and found that specific aromatic substitution patterns can fine-tune their uncoupling activity. Notably, 3,4-disubstituted arylamides were found to increase cellular respiration and partially depolarise mitochondria without compromising ATP production or cell viability. These are hallmarks of mild uncoupling. In contrast, 3,5-disubstituted arylamides mimicked the full uncoupling effects of the classical uncouplers DNP and CCCP. Mechanistic studies revealed a diminished capacity for the 3,4-disubstituted arylamides to self-assemble into membrane permeable dimers in the rate limiting step of the protonophoric cycle. This translated into overall slower rates of transmembrane proton transport, and may account for their mild uncoupling activity. This work represents the first exploration of how proton transport rates influence mitochondrial uncoupling and provides a new conceptual framework for the rational design of mild uncouplers..\"",
        "comments": [
            {
                "raw_content": "Mitochondria take in nutrients. Normally they convert that into ATP. If you force them to \"waste\" some of that energy as heat, they burn more fuel. Burning more fuel means more calories used. if you can safely increase this uncoupling in regular cells, you raise baseline calorie burn without needing stimulants or appetite drugs. The research teams are trying to find molecules that can trigger this safely. Brown fat already does it naturally. Cold exposure does it too. The drugs are trying to mimic that effect without freezing yourself.",
                "author": "Desirings"
            },
            {
                "raw_content": "I knew being aware that mitochondria is the powerhouse of the cell would help me one day!",
                "author": "Agitated-Cell5938"
            },
            {
                "raw_content": "Wait, no These are toxic chemicals that leak the intramitochondrial proton gradient. We've known about these substances since the WWII.",
                "author": "AerobicProgressive"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Brave new world is what would happen in a post singularity future (the good ending)",
        "score": 51,
        "text_content": "This book is a very good glimpse into the future. It shows a future where humans don’t need to work and live for pleasure, with no pain ever felt. There is a lot you can take from this, both pro and anti singularity. I suggest you read the book but if you can’t you can watch a summary. What I mean by “good ending” is not the story’s end, but rather the society in the book. It is obviously a dystopian society but it is one of the better outcomes of the singularity. It’s called a singularity for a reason.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/pe2vgng9c59g1.png?width=1080&format=png&auto=webp&s=72e65d99c8aa1ba7901a71aea03ad461cc2662c7",
                "author": "boostman"
            },
            {
                "raw_content": "Did we read the same book? There is no good ending to this book. A man kills himself because there's nothing sacred in a world where everything is content. I wouldn't call that a good ending but it's prescient of what's happening in our world now. That's why it's known as a DYStopian novel and it was actually a criticism of American culture at the time of writing. That's why everyone prays to the model T. It's making fun of our consumerism and our obsession with industrialization at any cost which is funny to bring up in this pro acceleration sub reddit if you ask me.",
                "author": "festeseo"
            },
            {
                "raw_content": "did we read the same book? it might be better future than 1984 but by no mean I hope this is what humanity gets... but if I were a betting man I would put my money on \"idiocracy\"",
                "author": "Alternative-Nerve744"
            }
        ],
        "subreddit": "singularity"
    }
]