[
    {
        "post_name": "Luke Healy was groomed online, affirmed by doctors, & nearly lost to transition—until his mother, a nurse of over 3 decades, said no. Now, they’re exposing the medical betrayal.",
        "score": 681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And to think my mother got mad because I was listening to Black Sabbath in high school. Holy shit, that was the only problem we had back then, and it was glorious.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Excellent mother. She saved her son's life.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "In some states like WA, you can have your kids taken from you for standing up like this. If you refuse to use your child's \"pronouns\" you are abusive and CPS can take your kid. The fight is far from over.",
                "author": "Wide_Peepo_Happy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🧠NEVER trust a doctor who says men can get pregnant. Ridicule their retardation and do everything you can to get their license revoked until they recant the belief.🚨",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "get the license permanently revoked",
                "author": "perma-maga"
            },
            {
                "raw_content": "If CNN wants to get their viewers back, giving Scott Jennings his own show wouldn't be a bad move.",
                "author": "WassermanSchultz"
            },
            {
                "raw_content": "When I go to the zoo, I generally don't argue with the monkeys. But good on Scott.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. Joni Ernst to Step Aside in 2026",
        "score": 291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One less RINO!",
                "author": "BladesOfSteel2020"
            },
            {
                "raw_content": "All the RINOs are stepping down so Dems can win the house in 2026 and spend the nest 2 year impeaching Trump for sneezing or eating ice cream or whatever the fuck they feel like.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Great news. She is terrible.",
                "author": "Axiom502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance just CONFIRMED there are as many as 40 MILLION illegals in America and they got housing. This drove up the cost of our homes and rent",
        "score": 1646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As a man in my 20s, few things enrage me more than this. SEND THEM ALL PACKING.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Cost of apartments and homes goes up because the government pays for the illegal aliens. The poor and middle class are competing with the government. Democrats did this.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "40 million illegals + 55 visas + who knows how many anchor babies = why this country looks NOTHING like it did when I was a kid in the 90's.",
                "author": "DingDongDitch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Benny Johnson: Florida Republicans Plan on Adding 4 New Republican Congressional Seats. The current plan will redraw 4 new congressional seats, specifically targeting key population centers around Orlando, Tampa, and surrounding Miami districts.",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gavin Newscum in shambles",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Get rid of Debbie Ramenhair if at all possible. Pure numbers are nice, but I would be willing to not gain a couple seats if it meant getting her out of Congress.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Damn, actual winning? Feels good, man!",
                "author": "RockyBalboa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ALL TARIFFS ARE STILL IN EFFECT! Today a Highly Partisan Appeals Court incorrectly said that our Tariffs should be removed, but they know the United States of America will win in the end.",
        "score": 1319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get fucked judges.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "Would be great if the useless republicans in Congress would start backing Trump up instead of being useless.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "I love how he chooses to capitalize certain words",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Which Trump?",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’d love to see Don Jr. test the political waters.",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Haha! I could support that!",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Eric’s speech at the Convention was inspiring. He has an old school statesman quality. He’s definitely a contender.",
                "author": "Jimmy33"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GREAT Governor Mike Kehoe, of the Wonderful State of Missouri just called a very Special Session to begin passage of a new, much fairer, and much improved, Congressional Map, that will give the incredible people of Missouri the tremendous opportunity to elect an additional MAGA Republican",
        "score": 1313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's 8 Congress members from Missouri. 6 Republicans, 2 Democrats. [2 Democrats from Missouri] - 1st Congressional District: Wesley Bell - 5th Congressional District: Emanuel Cleaver Missouri Republicans have a majority in the House (109-52) and a majority in the Senate (24-10). And a majority in the Supreme Court (5-2). Redistrict both Democrats out. --- **Breakdown of why Democrats don't want a redistricting war with Republicans, they'd lose badly.** Republicans can gain up to 45 House seats from these 16 states: **Alabama (2 Seats Max)** There's 7 Congress members from Alabama. 5 Republicans, 2 Democrats. [2 Democrats in Alabama] - Alabama's 2nd Congressional District - Shomari Figures - Alabama's 7th Congressional District - Terri Sewell Alabama Republicans have a majority in the House (71-29). A majority in the Senate (27-8). And all 9 Justices are Republican. So we could get 1, maybe 2 seats, if both Democrats are redistricted out. **Arizona (3 Seats Max)** There's 9 Congress members from Arizona. 6 Republicans, 1 Democrat. 1 Vacant. [2 Democrats in Arizona] - Arizona's 3rd Congressional District - Yassamin Ansari - Arizona's 4th Congressional District - Greg Stanton - Arizona's 7th Congressional District - Vacant Arizona Republicans have a majority in the House (33-27). A majority in the Senate (17-13). And a majority in the Supreme Court (6/7). Arizona Republicans can override Governor Hobbs. So we could get up to 3 seats, if both Democrats plus the vacant seat are redistricted. **Florida (8 Seats Max)** There's 28 Congress members from Florida. 20 Republicans, 8 Democrats. [8 Democrats in Florida] - Darren Soto - Florida's 9th Congressional District - Maxwell Frost - Florida's 10th Congressional District - Kathy Castor - Florida's 14th Congressional District - Sheila Cherfilus-McCormick - Florida's 20th Congressional District - Lois Frankel - Florida's 22nd Congressional District - Jared Moskowitz - Florida's 23rd Congressional District - Frederica Wilson - Florida's 24th Congressional District - Debbie Wasserman Schultz - Florida's 25th Congressional District Florida Republicans have a majority in the House (86-32). A majority in the Senate (26-10-1). And all 7 Justices on Florida's Supreme Court are Republican. We could get up to 8 seats, if all Democrats are redistricted out. **Georgia (5 Seats Max)** There's 14 Congress members from Georgia. 9 Republicans, 5 Democrats. [5 Democrats from Georgia] - Georgia's 2nd Congressional District - Sanford Bishop - Georgia's 4th Congressional District - Hank Johnson - Georgia's 5th Congressional District - Nikema Williams - Georgia's 6th Congressional District - Lucy McBath - Georgia's 13th Congressional District - David Scott Georgia Republicans have a majority in House (100-80). A majority in the Senate (32-23). And a majority in the Supreme Court (8-1). We could get up to 5 seats if all Democrats are redistricted out. **Indiana (2 Seats Max)** There's 9 Congress members from Indiana. 7 Republicans, 2 Democrats. [2 Democrats from Indiana] - Indiana's 1st Congressional District - Frank J. Mrvan - Indiana's 7th Congressional District - André Carson Indiana Republicans have a majority in the House (70-30). A majority in the Senate (39-10). And all 5 Justices on the Supreme Court are Republican. We can get 2 seats if we redistrict both Democrats out. **Kansas (1 Seat Max)** There's 4 Congress members from Kansas. 3 Republicans, 1 Democrat. [1 Democrat from Kansas] - Kansas' 3rd Congressional District - Sharice Davids Kansas Republicans have a majority in the House (88-37). A majority in the Senate (31-9). And are tied in the Supreme Court (2-2). We can get 1 seat. **Kentucky (1 Seat Max)** There's 6 Congress members from Kentucky. 5 Republicans, 1 Democrat. [1 Democrat from Kentucky] - Kentucky's 3rd Congressional District - Morgan McGarvey Kentucky Republicans have a majority in the House (80-20). And a majority in the Senate (32-6). We can get 1 seat. **Louisiana (2 Seats Max)** There's 6 Congress members from Louisiana. 4 Republicans, 2 Democrats. [2 Democrats from Louisiana] - Louisiana's 2nd Congressional District - Troy Carter - Louisiana's 6th Congressional District - Cleo Fields Louisiana Republicans have a majority in the House (73-32). And the Senate (28-11). And a majority in the Supreme Court (4 Republicans, 2 Democrats, 1 Independent). We can get up to 2 seats if we redistrict both Democrats out. **Mississippi (1 Seat Max)** There's 4 Congress members from Mississippi. 3 Republicans, 1 Democrat. [1 Democrat from Mississippi] - Mississippi's 2nd Congressional District - Bennie Thompson Mississippi Republicans have a majority in the House (80-40-2). And a majority in the Senate (36-16). We can get 1 seat. **Missouri (2 Seats Max)** Already covered above. **North Carolina (4 Seats Max)** There's 15 Congress members from North Carolina. 11 Republicans, 4 Democrats. [4 Democrats from North Carolina] - North Carolina's 1st Congressional District - Don Davis - North Carolina's 2nd Congressional District - Deborah Ross - North Carolina's 4th Congressional District - Valerie Foushee - North Carolina's 12th Congressional District - Alma Adams North Carolina Republicans have a majority in the House (71-49). A majority in the Senate (30-20). And a majority in the Supreme Court (5-2). We could get 4 seats if all Democrats are redistricted out. **Ohio (5 Seats Max)** There's 15 Congress members from Ohio. 10 Republicans, 5 Democrats. [5 Democrats from Ohio] - Ohio's 1st Congressional District - Greg Landsman - Ohio's 3rd Congressional District - Joyce Beatty - Ohio's 9th Congressional District - Marcy Kaptur - Ohio's 11th Congressional District - Shontel Brown - Ohio's 13th Congressional District - Emilia Sykes Ohio Republicans have a majority in the House (65-34). A majority in the Senate (24-9). And a majority in the Supreme Court (6-1). We can get up to 5 seats if all Democrats are redistricted out. **South Carolina (1 Seat Max)** There's 8 Congress members from South Carolina. 7 Republicans, 1 Democrat. [1 Democrat from South Carolina] - South Carolina's 6th District - Jim Clyburn South Carolina Republicans have a majority in the House (88-36). And a majority in the Senate (34-12). We can get 1 seat. **Tennessee (1 Seat Max)** There's 9 Congress members from Tennessee. 8 Republicans, 1 Democrat. [1 Democrat from Tennessee] - Tennessee 9th Congressional District - Steve Cohen Tennessee Republicans have a majority in the House (75-24). A majority in the Senate (27-6). And all 5 Justices on Tennessee's Supreme Court are Republican. We can get 1 seat. **Texas is going to add 5 new Republican House seats** **Wisconsin (2 Seats Max)** There's 8 Congress members from Wisconsin. 6 Republicans, 2 Democrats. [2 Democrats from Wisconsin] - Wisconsin's 2nd Congressional District - Mark Pocan - Wisconsin's 4th Congressional District - Gwen Moore Wisconsin Republicans have a majority in the Wisconsin State Assembly (54-45). And a majority in the Senate (18-15). We could get up to 2 seats if both Democrats are redistricted out. --- Some might be asking, \"But couldn't Democrats just redistrict every Republican out of states that have a Democrat majority in the House/Senate?\" They could, but it wouldn't make any difference. Republicans would still have a super majority. **Democrats control both the House and Senate in these 9 states:** - California (9/52 Republicans in Congress) Newscum is trying to remove 5 Republican House seats, so we'd still have 4. His map is unlikely to pass. - Colorado (4/8 Republicans in Congress) - Illinois (3/17 Republicans in Congress) - Maryland (1/8 Republicans in Congress) - Nevada (1/4 Republicans in Congress) - New Jersey (3/12 Republicans in Congress) - New York (7/26 Republicans in Congress) - Oregon (1/6 Republicans in Congress) - Washington (2/10 Republicans in Congress) Democrats could gain up to 27 seats, Republicans could gain up to 45 seats. So Republicans would have 237 seats (219 current seats +45 gained - 27 lost =237) Democrats would have 194 seats (212 current seats +27 gained - 45 lost =194) That adds up to 431, but there's currently 4 vacancies. 3 in Democrat strongholds, 1 Republican stronghold. Republicans = 238 House Seats Democrats = 197 House Seats [But wait..there's more!](https://m.youtube.com/watch?v=TJoBMayjlUo) ---- [Democrats are poised to lose nearly 25 seats of representation if the Supreme Court moves forward with ending race-based gerrymandering.](https://x.com/Rightanglenews/status/1951625316687839478) **So the final count is:** Republicans = 263 House Seats (219+1+45-27+25) Democrats = 172 House Seats (212+3+27-45-25)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Once we get 100 seats from redistricting we can amend the constitution to end birthright citizenship. Trump is saving America. Never thought we had a chance but things keep getting brighter under this admin.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "This is great, but remain vigilant.. Democrats are pursuing a different angle through ranked choice voting ballot initiatives. This is where their focus is, I'm surprised we don't see that talked about much here. It's a big deal with the liberals right now.",
                "author": "tuaris"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mosques across England are being DEFACED.",
        "score": 1771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deus Vult!",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "That's not defacing, it's an improvement. They should all be burnt to the ground w/ all of the filthy muzzies inside in a perfect scenario.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Per the ADL, \"Christian Identity is a religious ideology popular in extreme right-wing circles\".",
                "author": "loooooof"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🏛️ South Carolina Asks Supreme Court to Allow State to Enforce Transgender Bathroom Policy 🚽",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There becomes a point where you have to say fuck the courts . Their mentally ill decisions have to be ignored. The military has to round up the judges and jail them. Stupid decisions. Will NOT be tolerated. It’s time to jail all of the psychiatrist that continue to say transvestite female impersonators are normal. It’s over otherwise.",
                "author": "Theoldmaster"
            },
            {
                "raw_content": "Why is the biggest focus on trannies? Is that our biggest issue? Less than 1% of the population?",
                "author": "AmericanForever"
            },
            {
                "raw_content": "This is a State issue that the federal government should have no say in, in the first place.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Federal Appeals Court Rejects Trump’s Authority to Impose Sweeping Tariffs",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To the supreme court then. This law fare is ridiculous and wasting so much of our golden term.",
                "author": "icecreamheadache"
            },
            {
                "raw_content": "And on and on and on it goes. I'd be happy if I was wrong, but I'm pretty sure it's going to be this exact bullshit song and dance from the judicial system for the next 3 and a half years.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "President Trump responded in a Truth Social post. “ALL TARIFFS ARE STILL IN EFFECT! Today a Highly Partisan Appeals Court incorrectly said that our Tariffs should be removed, but they know the United States of America will win in the end. If these Tariffs ever went away, it would be a total disaster for the Country. It would make us financially weak, and we have to be strong. The U.S.A. will no longer tolerate enormous Trade Deficits and unfair Tariffs and Non Tariff Trade Barriers imposed by other Countries, friend or foe, that undermine our Manufacturers, Farmers, and everyone else. If allowed to stand, this Decision would literally destroy the United States of America. At the start of this Labor Day weekend, we should all remember that TARIFFS are the best tool to help our Workers, and support Companies that produce great MADE IN AMERICA products. For many years, Tariffs were allowed to be used against us by our uncaring and unwise Politicians. Now, with the help of the United States Supreme Court, we will use them to the benefit of our Nation, and Make America Rich, Strong, and Powerful Again! Thank you for your attention to this matter,” Trump said.",
                "author": "DickTick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI explains how Trump exposed Elite Politics and absolutely nails it !!",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why use AI when she can simply come here and read about 2,000 articles per day about the subject?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Things many of us have known for years, but it’s nice that more are finally waking up…..what the fuck took so long?!",
                "author": "C0drus"
            },
            {
                "raw_content": "That AI pauses and says \"uum\" between words? 😉",
                "author": "SweetBeef"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alina Habba has declared E Jean Carroll with receive \"ZERO\" from the $83 million dollar settlement and will have to pay Trump's legal fees.",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good! Carroll is a scammer and a crackpot.",
                "author": "perma-maga"
            },
            {
                "raw_content": "She had no time, no date, no Witnesses, no physical evidence and the only testimony they used was hers. And she said on live TV that she finds rape exotic yeah that was the biggest bullshit verdict I've ever fucking seen almost as bad as the 486 million dollars that fucking Leticia James did",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Habba is so hot. Especially with a garbage can on the left",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The 9th Circuit Court of Appeals has BLOCKED the Trump admin from ending legal status for 600K Venezuelan \"migrants\" MORE JUDICIAL ACTIVISM! So they're saying Biden could UNILATERALLY give illegals \"legal status,\" but Trump can't unilaterally revoke it? BULLSHlT!",
        "score": 1539,
        "text_content": "",
        "comments": [
            {
                "raw_content": "then just say that biden never had the power to do it if another president cant undo it",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "They're doing this because these Blue Judges are fully on the Democrat side. They also want to flood the country with illegals so they can skew the 2030 Census and illegally grab more power. They're sick of Republicans existing at all.",
                "author": "McFatty7"
            },
            {
                "raw_content": "The 9th circuit does this shit all the time, it will get overturned by Supreme Court",
                "author": "Albo22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'm almost embarrassed for them. Almost.",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Geriatric hippies with one foot in the grave trying to relive their youth. Pathetic.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "This is a Rorschach test: some people look at this image and see 'Boomers'; while others see 'Leftists'.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "So much cringe. We have obtained a level of cringe that should be unachievable.",
                "author": "Fiddycentipede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ELON MUSK: In order to survive, an ideology that fails to reproduce itself must necessarily infect the minds of the children of those who do reproduce. That’s why they push so hard to control education. It is a vampire cult.",
        "score": 2160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“He alone, who owns the youth, gains the future” - some man with a mustache",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Yes, we've known this for years. He's late to the party, and it's unfortunate he had to find this out the hard way because of what happened to his kid.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "We don't want his pajeets infecting America, either. He had his chance and he BLEW IT.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When can we finally have these freaks locked up and CPS called to take their kids?",
        "score": 1246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“We knew before they did”. These fucking but cases shouldn’t be allowed within a 1000 feet of a child",
                "author": "IAmRetard"
            },
            {
                "raw_content": "There is no such thing as a trans person. Only mentally Ill freak",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "\"Emotional support demon\"",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I think about this CIA tweet a lot",
        "score": 426,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spy’s everywhere.",
                "author": "Maxmax"
            },
            {
                "raw_content": "They forgot NEWS ANCHORS",
                "author": "boomerbutnotOKBoomer"
            },
            {
                "raw_content": "Assassins, faggots and pedophiles…",
                "author": "HeatherSwanson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hateful RETWEETS are now a criminal offense.",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's not about hate speech, it's about controlling speech and thought.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "\"Hate speech\". \"Hate crimes\"... Noticing a slippery slope?",
                "author": "loooooof"
            },
            {
                "raw_content": "# The UK is a literal dystopia",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RIP. Beautiful, Based Martyr Woman.",
        "score": 607,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hers was a needless death perpetrated by a sorry excuse of a human being who shot an unarmed woman in the face because he could. This individual should be up on murder charges.",
                "author": "OneTrickPony"
            },
            {
                "raw_content": "That pardon pissed me off the most. Shot and murdered an unarmed girl and gets a pardon while the cop who kneeled on an overdosing crackhead gets prison.",
                "author": "Sodak"
            },
            {
                "raw_content": "She wasn't a **rioter**.",
                "author": "MehNahMehNah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Developer Unlocks Newly Enshittified Echelon Exercise Bikes But Can't Legally Release His Software",
        "score": 358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The manufacturer reaching over the network and turning the lock on something I've purchased honorably is what should be illegal.",
                "author": "ProfessionalPrincipa"
            },
            {
                "raw_content": "Oh no, my house was broken into, they only stole the USB key with all my work on the jailbreak...",
                "author": "Buzz1ight"
            },
            {
                "raw_content": "This should have never been a problem in the first place but it could probably be made legal by having two teams write complete software in a way where one team reverse engineers and describes functionality of original while the other team write completely fresh code based on specification without seeing actual source code. Choose a country where software functionality is not a subject to copyright if necessary. Edit: to be clear, this is not my idea. I just know it was done before.",
                "author": "Kinexity"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] AM4 Lives: AMD Ryzen 5 5500X3D CPU Review & Benchmarks",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm waiting for the AMD 3100x3d",
                "author": "Method__Man"
            },
            {
                "raw_content": "Waiting for a special edition die-shrink of the 5800x3d as a last hurrah of AM4.",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "I'm lazy why doesn't gamers nexus just have an average data slide",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CFO admits Arrow Lake missed expecations: “We didn’t have a good offering this year”, pins hopes on Nova Lake",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrowlake HX testing by Geekerwan basically plateaud after 80W in performance which I find intersesting. Are they saying this is reversed or is it \"we''ll get em next time!\" Also, how do you lose hyperthreading but still regress clocks. Was the bring up stage incomplete? Needs more steppings? N3B being shit because even Apple floundered with it? I have already guessed that latency has been locked at (reduced ring stops by clustering P cores) and aiming at dodging DRAM latency by upping L3 hit rate and increasing the bandwidth quite a bit. But those are system level tweaks and choices. Are the core themselves a meaningful upgrade?",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "All that money spent on TSMC.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "At least they’re admitting it instead of spinning it",
                "author": "TheAppropriateBoop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Patent: Software Defined Super Cores",
        "score": 91,
        "text_content": "Someone on the Intel subreddit found a patent about \"Software Defined Super Cores\" Is this the long thought to be canceled Royal Core? Seems like Intel restarted development of Royal Core awhile ago or they're developing RYC technologies to use on future cores designs. Maybe this could be what they're planning for Hammer Lake? Here's the abstract: Abstract Techniques for software defined super core usage are described. In some examples, a fist and second processor core are to operate as a single virtual core enabled by the operating system to fetch the first set of instruction segments of the single threaded program and the second set of instruction segments of the single threaded program concurrently using flow control instructions that have been inserted into the single threaded program. 2024-11-26 Application filed by Intel Corp 2025-07-02 Publication of EP4579444A1",
        "comments": [
            {
                "raw_content": "Probably they plan on renaming Hammer Lake to Hand Lake. Otherwise I don't really know what a fist core should be. Jokes aside, how serious can a patent be with a typo in the intro.",
                "author": "MrHighVoltage"
            },
            {
                "raw_content": "\\>Maybe this could be what they're planning for Hammer Lake? Maybe not, Hammer Lake will be iterating on Titan lake's Unified Core which is basically PPA-optimised design Vs the crazy experimentation that RYC was supposed to be working on. Me and others here as PC Gamers obviously would've loved RYC but the PPA cost sadly didn't seem worth it which is why Pat killed it.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Filing patents does not mean they plan to do anything with it, especially since it seems like this would need changes to software for the added control flow instructions and it's not a transparent micro-architectural change. But I am curious to see how this compares to just making a wider core. Will be quite surprised if this approach wins.",
                "author": "Cortisol-Junkie"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DOOM: Path Tracing and Bechmarks",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">If anything, the poor equation of performance loss X quality gain against RT shows how good its regular RT is. And I think that's in part because of the “forced RT”. Without a Raster mode every line of code, every piece of level design, mesh, texture — everything is built and tested and optimized for RT first & RT only, and it shows. I am convinced this is a new trend: we will have more “RT-only” games hitting a great sweet spot of visual fidelity + performance and making the Path Tracing option look silly— until new GPUs are fast enough in PT. Couldn't agree more tbh.",
                "author": "Kryohi"
            },
            {
                "raw_content": "TL;DR: At 4K+Q upscale at RT Ultra Nightmare 9070XT wins over RTX 5080 by 2% \\^ vs PT 4K+Q upscale results: \\- 5080 PT -56%, or RT Ultra Nightmare 2.27X/127% faster. \\- 9070XT PT = -76% or RT Ultra Nightmare 4.17X/317% faster. 9070XT performance in Abyssal forest completely craters (-82%). RT max vs PT think it's roughly: \\- 5080 82-83FPS vs 34FPS \\- 9070XT 82FPS vs 15FPS Tied vs 2.27x NVIDIA advantage. Normalised to 5080 RT = 100 the averages are: 9070XT RT = 102 5080 RT = 100 9070XT PT = 24.5 5080 PT = 44.4 Tied vs 1.81x NVIDIA advantage. **Conclusion:** AMD has a long way to go before matching NVIDIA Blackwell. Total frame time is more than just PT ms, so difference larger there. As an example Chips and cheese Cyberpunk 2077 PT sample frame was 78.5% PT and 21.5% other. [https://chipsandcheese.com/p/shader-execution-reordering-nvidia-tackles-di](https://chipsandcheese.com/p/shader-execution-reordering-nvidia-tackles-di) The rumoured AMD RDNA5 has a mountain to climb if hypothetically they're serious about PT with nextgen consoles. 50 series isn't even there yet.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Last time I profile this game, the ray tracing portion occupied less than 5% of the frame.",
                "author": "OutlandishnessOk11"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "nVidia \"AI-Blackwell\": Chips, Products, Naming, Hardware",
        "score": 7,
        "text_content": "The hardware data for Blackwell-based AI products is often reported very inaccurately or even incorrectly, as nVidia does not make a clear distinction between chip and product and sometimes provides contradictory information. The following lists are intended to clarify (to the best of our knowledge) what the hardware of the actual Blackwell chips and the AI products based on them looks like. &nbsp; &nbsp;|Class|Naming|Hardware|max. TDP|Notes |:--|:--:|:--:|:--:|:--:|:--:| **GB102**|chip|-|4 GPC, 80 SM, 4096-bit HBM3e, PCIe 6.0|-|104 billion transistors at ~800mm² die-size on TSMC's 4nm manufacturing **GB100**|dual-chip (2x GB102)|\"Blackwell\"|8 GPC, 160 SM, 8192-bit HBM3e, PCIe 6.0, &#8804;192 GB, die-to-die interconnect|1200W|2x 104 billion transistors at 2x ~800mm² die-size on TSMC's 4nm manufacturing **GB100U**|chip variant (2x GB102)|\"Blackwell Ultra\"|8 GPC, 160 SM, 8192-bit HBM3e, PCIe 6.0, &#8804;288 GB, die-to-die interconnect|1400W|2x 104 billion transistors at 2x ~800mm² die-size on TSMC's 4nm manufacturing **B100**|product (1x GB100)|-|_unknown_|700W|SXM modul for \"HGX\" plattform **B200**|product (1x GB100)|-|_unknown_|1000W|SXM modul for \"HGX\" plattform **B300**|product (1x GB100U)|-|_unknown_|1200W|SXM modul for \"HGX\" plattform **GB200**|product (2x GB100)|\"Blackwell Superchip\"|16 GPC, 288 SM, 2x 8192-bit HBM3e, PCI 5.0, 2x 192 GB|2700W|nVidia's own-created server module with 2x GB100, 1x \"Grace\" CPU & NVLink-Switch **GB300**|product (2x GB100U)|\"Blackwell Ultra Superchip\"|16 GPC, 320 SM, 2x 8192-bit HBM3e, PCI 6.0, 2x 288 GB|&gt;3000W|nVidia's own-created server module with 2x GB100, 1x \"Grace\" CPU & NVLink-Switch &nbsp; \"GB100U\" is a self-invented, completely unofficial code name used purely to distinguish the Ultra variant of the GB100 chip. Technically speaking, this is not correct, because nVidia has not released any new chips for Blackwell Ultra, only new products consisting of existing chips. Uncertain points: - GB100 has never been officially confirmed, but there is at least a clear indication that this code name exists. - GB102 exists as a code name only in the rumor mill; so far, there has been no mention of it by nVidia. - Whether 160 SM is really the maximum hardware for GB100 is currently known only to nVidia. &nbsp; &nbsp;|Chip|**&#8594;**|Dual-chip|**&#8594;**|Product |:--|:--:|:--:|:--:|:--:|:--:| Blackwell|GB102, 80 SM, 4096-bit HBM3e, 104 billion transistors, ~800mm² die-size|**&#8594;**|GB100 (2x GB102), 160 SM, 8192-bit HBM3e, 208 billion transistors, ~1600mm² die-size|**&#8594;**|GB200 (4x GB102), 288 SM, 16384-bit HBM3e, 416 billion transistors, ~3200mm² die-size (+ \"Grace\" CPU & NVLink-Switch) Blackwell Ultra|GB102, 80 SM, 4096-bit HBM3e, 104 billion transistors, ~800mm² die-size|**&#8594;**|GB100U (2x GB102), 160 SM, 8192-bit HBM3e, 208 billion transistors, ~1600mm² die-size|**&#8594;**|GB300 (4x GB102), 320 SM, 16384-bit HBM3e, 416 billion transistors, ~3200mm² die-size (+ \"Grace\" CPU & NVLink-Switch) nVidia naming|-|&nbsp;|\"**one GPU**\"|&nbsp;|\"**Superchip**\" &nbsp; Unfortunately, nVidia itself sometimes only provides data for a single GPU, even though it is actually referring to the GB200/GB300 \"superchips\". For example, the \"Blackwell Architecture Technical Brief\" ([PDF](https://resources.nvidia.com/en-us-blackwell-architecture/blackwell-architecture-technical-brief)) specifies 15/20 petaFLOPS FP4 as the computing power for \"GB300\" and 8 TB/s as the bandwidth. However, according to the [nVidia blog](https://developer.nvidia.com/blog/inside-nvidia-blackwell-ultra-the-chip-powering-the-ai-factory-era/), these are clearly the specifications for a single GB100 GPU. The (correct) data for GB300 with two GB100 GPUs is also noted there: 30/40 petaFLOPS FP4 computing power. If only \"15/20 petaFLOPS\" is noted for GB300 anywhere, this has been incorrectly copied from nVidia's own PDF. &nbsp; Source: [3DCenter.org](https://www.3dcenter.org/news/news-des-26-august-2025)",
        "comments": [
            {
                "raw_content": "Thank you for putting this together. NVIDIA's naming for Blackwell chips and data center products has been incredibly annoying this generation. With Blackwell Ultra being perhaps the worst offender. I can't wait until the Vera CPU is done, so that the codenames for superchip products stop starting with 'G'. > - GB100 has never been officially confirmed, but there is at least a clear indication that this code name exists. For what it's worth, while NVIDIA didn't use \"GB100\" in their Hot Chips GB10 presentation, the speaker did know what that code name meant when asked about how GB10 compared to GB100.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "How much RAM/VRAM and for what price is what really matters.",
                "author": "Plank_With_A_Nail_In"
            },
            {
                "raw_content": "Blackwell ultra has a different SM structure.",
                "author": "XYHopGuy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Designed and 3d printed a cover for my Switch 2 dock",
        "score": 434,
        "text_content": "Drew it up in Illustrator then dropped it into Fusion to create the actual 3D print file and printed on my Bambu P1S. I think it really ties the room together.",
        "comments": [
            {
                "raw_content": "That is absolutely amazing! Well done",
                "author": "OK_Commodor64"
            },
            {
                "raw_content": "You can sell these. I’d definitely buy one",
                "author": "Whoa_Im_Cooking_Yay"
            },
            {
                "raw_content": "Great job, looks great.",
                "author": "shadow0wolf0"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Been a good first summer for Switch 2",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is Kirby good? I am thinking about getting after I beat 3D world since it looks similar.",
                "author": "aPiCase"
            },
            {
                "raw_content": "No it hasn’t. Lmao",
                "author": "Deep_Sea_Exploring"
            },
            {
                "raw_content": "People with fish memory are gonna disagree, but the Switch 2 really has a solid launch library and more amazing games are coming very soon. It's been great so far, having a ton of fun with both old games with performance boost, as well as the new stuff.",
                "author": "TyleNightwisp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Deku Deals/GameStop say HK: Silk Song will cost $20",
        "score": 216,
        "text_content": "According to this listing: https://www.dekudeals.com/items/hollow-knight-silksong?platform=all",
        "comments": [
            {
                "raw_content": "I was sure it would be $25 or more. Honestly I would have paid full price. $20 is astonishingly cheap for what will likely be at least a 50 hour game",
                "author": "El__Jengibre"
            },
            {
                "raw_content": "Fingers crossed.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Cool",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rollin' Rascal is officially confirmed to be releasing on the Switch and Switch 2!",
        "score": 28,
        "text_content": "Source: Rollin' Rascal Rundown 8.29.2025 (Both [YT ](https://www.youtube.com/watch?v=enyKyAmKZC4&t=687s)and [Kickstarter](https://www.kickstarter.com/projects/curiomatic/rollin-rascal/posts/4471146))",
        "comments": [
            {
                "raw_content": "So this means an actual switch 2 version and not just the switch 1 version on switch 2?",
                "author": "BlackSunshine86"
            },
            {
                "raw_content": "I backed it yesterday. The animated facial expressions really got me and I've found a new love for 3D platformers so I thought why not since I get a copy of the game for most likely the same price, or less, at release. Seems like they still need a lot of time to cook but I'm looking forward to when the game comes out.",
                "author": "Bazz_B"
            },
            {
                "raw_content": "Now we just need a Spark the electric jester 3 upgrade",
                "author": "Enviromentalghost45"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yooka Replayee Releases on Oct 9th, 2025",
        "score": 214,
        "text_content": "Yooka Replayee Releases on Oct 9th, 2025. The switch 2 version is confirmed to be fully on cartridge.",
        "comments": [
            {
                "raw_content": "I know people complain but it’s getting to the point where there are just too many games I want to play this year….",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "This game is a real card on Switch 2, just so ya’ll know. So if your kinda interested it might be worth it to support it.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Why do publishers do this? 😅 I feel like every game is coming out in October while August and September are pretty light.",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 version High on Life",
        "score": 22,
        "text_content": "Just downloaded the new Switch 2 version of the game High on Life from Squanch Games and Oh. Emma. Gee. It is a huge upgrade from the Switch 1 port of the game. The graphics actually look like something on console and not weird clay figures that were in the Switch 1 port. The audio is more crisp and the overall performance is so much better. I turned it off as soon as the aliens landed in the very beginning of the game cause I just couldn't stand looking at completely ugly models. Since I had already bought the Switch 1 version the upgrade was free to me and now I really want to play the game now. I'm still only in the beginning parts(my house just got warped to Blim City) but with this major upgrade I can't wait to see what else the game has in store. I am also a user who plays mostly in handheld mode since my TV isn't the best there is and is a few years behind in the resolution specs. Just wanted people to know that if you have this game and a Switch 2 please give it a chance since Switch 2 upgrade is free and most definitely improved everything so far.",
        "comments": [
            {
                "raw_content": "Would love one for outer worlds.",
                "author": "name-__________"
            },
            {
                "raw_content": "Is there any difference on handheld vs docked? Definitely gonna try this game out when it’s on sale",
                "author": "ChilliWithFries"
            },
            {
                "raw_content": "I would still play on the tv even if it’s not the best. A lot of games this gen, especially when the the ps6 rolls around will be 1080p 30fps (3rd party games anyways)",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tony Hawk Pro Skater 3+4 Remastered upgrade path",
        "score": 20,
        "text_content": "I just wanted to give a little PSA to the group because I’ve only found 2 or 3 posts about this and none with definitive answers. I went to GameStop to purchase Tony Hawk Pro Skater 3+4 Remastered for Switch 2. They told me they were out of the game, but they had one copy of the Switch 1 version left as a display copy. The employee said that if I bought it, It would unlock both the Switch 1 and Switch 2 versions of the game. I wasn’t too keen on just taking his word, so I quickly checked Reddit in the store and found this post: https://www.reddit.com/r/NintendoSwitch2/s/GsRsatyuOf I skimmed it and decided to buy the game. --- What happened after I got home: 1. I put the cartridge in — it downloaded the normal update. 2. After the update, it added a virtual game card for the Switch 2 version. 3. I now had two versions of the game on my home screen. 4. When I tried to launch the Switch 2 version, it said I needed to purchase it — but the eShop said I was unable to purchase. I contacted Nintendo Support, and they told me there’s currently no upgrade path. So, I took the game back to GameStop (not realizing you can’t return opened/“new” physical games, especially ones already unsealed as display copies). Out of frustration, I bought it again online. I was only able to do on the eshop website, as on my device, the game was unavailable for purchase. --- The weird part: When I unlocked the Switch 2 version this time, it actually prompted me to transfer my save files from Switch 1, with a whole unique UI menu that appeared on first launch. So why would they not offer a upgrade but have this implemented? --- My theory: This makes me think they either: Originally planned to have a Switch 2 upgrade path, or They will be adding one in the future. So I am putting this post here so that the next guy who has to google it in gamestop doesn't buy the wrong one like I did.",
        "comments": [
            {
                "raw_content": "Well, yet another reason to say fuck gamestop. They lied to you then hid behind \"policy\" to say they couldn't help you because you bought a \"new\" game that had already been opened and you cant return an opened game. Thanks for the PSA though. Sorry it cost you double",
                "author": "Healthy-Marketing-26"
            },
            {
                "raw_content": "That’s very interesting, I hope so eventually the game looks really incredible on switch 2",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Im glad i now know the answer to my question i had a few weeks ago. I was in a gamestop trying to figure out if i bought the switch 1 version, it upgrades to the switch 2 version (i want the game card). The employee also told me it will be a free upgrade, but google was telling me otherwise so i decided to not pull the trigger. Im sorry this happened to you!",
                "author": "robertsjj"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Heavily liquid damaged but still working",
        "score": 37,
        "text_content": "source: TronicsFix https://youtu.be/b5Qr2-qt_ZI?si=mFIJ_WlA7rJ9Jfm6",
        "comments": [
            {
                "raw_content": "Had to double check that this wasn't the person who dumped isopropyl alcohol on their Switch 2.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Nintendium is alive and well",
                "author": "kksliiiider"
            },
            {
                "raw_content": "That was a pretty interesting watch. I wonder if they’d get an update from the seller after showing proof of the liquid damage.",
                "author": "Stryker_T"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GameStop appears to have leaked Silksong's price. ($20)",
        "score": 740,
        "text_content": "Source: [https://www.gamestop.com/video-games/nintendo-switch/products/hollow-knight-silksong---nintendo-switch/432032.html](https://www.gamestop.com/video-games/nintendo-switch/products/hollow-knight-silksong---nintendo-switch/432032.html) EDIT: Page got taken down. Was it real info given out too soon, or false info? We'll know by September 4th.",
        "comments": [
            {
                "raw_content": "they specifically made HK affordable so more people could play it and now they're like. definitely millionaires If they have that mindset I can get why they'd make it 20. I was expecting 30-40 personally but I'm also not shocked if this is real",
                "author": "shsluckymushroom"
            },
            {
                "raw_content": "Hollow Knight was already crazy cheap for what you get so I wouldn't be surprised if they just repeat that",
                "author": "Theonearmedbard"
            },
            {
                "raw_content": "If that's true that is crazy, I expected higher",
                "author": "Wassersammler"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Witcher 4 might have online multiplayer features per the recent CDPR investor's chat.",
        "score": 209,
        "text_content": "Link to the chat so you can read it yourself [https://www.cdprojekt.com/en/wp-content/uploads-en/2025/08/individual-investors-chat-session-29-08-2025.pdf](https://www.cdprojekt.com/en/wp-content/uploads-en/2025/08/individual-investors-chat-session-29-08-2025.pdf) Copied from the chat: Dave: If you decide to add a multiplayer mode to one of your games – will it be developed in parallel and made available on the release date, or added later on, when the game is already on the market? PN: According to our strategy we plan to add online features to our future games. What we can confirm right now is that Project Sirius will be a multiplayer game. If by \"future games\" they also mean TW4 then unless it was said before that it won't have any, then it's looking like it might have multiplayer components to it. They might just mean Project Sirius but that seems unlikely given the wording imo. I personally would like them to solely focus on singleplayer, but I'm curious to hear anyone else's thoughts on this.",
        "comments": [
            {
                "raw_content": "online features isn't necessarily multiplayer tho, they make that distinction there Project Sirius always known to be MP project",
                "author": "rickreckt"
            },
            {
                "raw_content": "I wonder what kind of gameplay The Witcher would have for online multiplayer? Especially considering lore-wise there aren't many Witchers left. Maybe we could travel to another world or something where there were lots of Witchers? Would be cool taking down monsters and doing quests with friends tho",
                "author": "Srovium"
            },
            {
                "raw_content": "Cyberpunk was supposed to be multiplayer too",
                "author": "JoeBidensProstate"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Russian Game Store Website lists Metroid Prime 4 Release Date on Thursday, September 18th",
        "score": 187,
        "text_content": "If Metroid Prime 4 does have a Release Date of September 18th, 2025 that’d be crazy as it’s almost a Shadow Drop. This would probably mean a big final trailer in the rumored Nintendo Direct on September 12th alongside maybe a Metroid Prime 4 Direct right before release on the same week? https://videoigr.net/product_info/metroid-prime-4-beyond-nintendo-switch-2-edition-switch-2/26590/?fbclid=IwZnRzaAMesu1leHRuA2FlbQIxMQABHg7bhESVbLb4zNUpqdkKQxdxxIw_Voi1wYakTeBbzJm0hG4PaaHPxUDvxAaY_aem_2cqMDx7MfmTR69VmyLDxAg",
        "comments": [
            {
                "raw_content": "Metroid Prime 4: Silksong, I accept your challenge.",
                "author": "Vagabond_Texan"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "I can’t imagine Nintendo doing a shadow drop for such a huge game. I’d expect a holiday release",
                "author": "Meb2x"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Phil LaMarr and George Newbern (Voice actors for Green Lantern and Superman) talk about working on Injustice 3",
        "score": 305,
        "text_content": "https://xcancel.com/Brendan_Batman/status/1959321357428121616 https://xcancel.com/DannySoul0/status/1961261275813449776?t=1f2fGSihh2e7fCr7TRBKnQ&s=19",
        "comments": [
            {
                "raw_content": "I have flashbacks to when Kevin Conroy annouced Arkham Knight by accident.",
                "author": "MKW69"
            },
            {
                "raw_content": "Wonder who they'll cast for Batman, probably Roger Craig Smith seeing as he's done the voice a few times.",
                "author": "Hayterfan"
            },
            {
                "raw_content": "alright voice actors have been on a fucking roll with leaks. Promote to tier 0.",
                "author": "n__o__"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 Mirak Valley Gameplay on YouTube",
        "score": 5,
        "text_content": "[https://www.youtube.com/watch?v=MAtBw-X2Hjw](https://www.youtube.com/watch?v=MAtBw-X2Hjw)",
        "comments": [],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Accepts That Arrow Lake CPUs Weren’t A Good Desktop Offering, Says Nova Lake Will Address The High-End Desktop Market Better Next Year",
        "score": 291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a \"good\" desktop from a purely gaming focus PC setup. I don't think Arrow Lake was a big letdown if ones usage is a mix of work-station + gaming? [https://chipsandcheese.com/p/intels-lion-cove-p-core-and-gaming](https://chipsandcheese.com/p/intels-lion-cove-p-core-and-gaming)",
                "author": "Primary_Olive_5444"
            },
            {
                "raw_content": "I'll just wait and see the same as I do whenever im building used to be. i only used Intel because they were the best. Now I use amd because those are the best. If Intel new chipnl are the best gaming wise, I'll grab one. If not, I'll go amd again. For the rest of the stuff I do with my computer, any cpu is good enough, so gaming will be the end all be all.",
                "author": "dade305305"
            },
            {
                "raw_content": "Which gen is Arrow Lake?",
                "author": "Sushi-And-The-Beast"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Patent: Software Defined Super Cores",
        "score": 137,
        "text_content": "\"Software defined super cores (SDC) seek to aggregate the Instructions-per-Cycle (IPC) capabilities of neighboring cores into a \"super core.\" A super core is a virtual construct grouping of two or more cores (in some examples, physically adjacent core) that are virtually \"fused\" such that they each run different portions of an application's instructions, but retire the instructions in original program order. Thus, the virtually fused \"super cores\" gives to software applications and/or an operating system the semblance of being a single core. A super core enables energy-efficient, high-performance capability at the same voltage/frequency. SDC-enabled platforms have a wide dynamic range and flexibility depending on system load and task requirements using just a core intellectual property substrate. SDC is a software and hardware solution enabling neighboring cores to run as virtual clusters of a super core - reducing the traditional process technology node dependence on scaling core size.\"",
        "comments": [
            {
                "raw_content": "Yeah I remember AMD trying to implement something like that back in the day, I think they called it \"Reverse Hyper-Threading\". They never did obviously.",
                "author": "D4m4geInc"
            },
            {
                "raw_content": "That sounds like an interesting concept that could boost some use cases tremendously.",
                "author": "I_Am_A_Door_Knob"
            },
            {
                "raw_content": "i am not too depp in nowadays, but wasnt this design slashed a few months back? royal core or so?",
                "author": "Sani_48"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Core inflation rose to 2.9% in July, highest since February",
        "score": 255,
        "text_content": "Core inflation rose to 2.9% in July, highest since February The personal consumption expenditures price index showed that core inflation ran at a 2.9% seasonally adjusted annual rate in July, meeting estimates but higher than June. Consumer spending increased 0.5% on the month, in line with forecasts and indicative of strength despite the higher prices. Personal income accelerated 0.4%. https://www.cnbc.com/2025/08/29/pce-inflation-report-july-2025.html Wonder what happens when you try to cut rates as inflation is surging..",
        "comments": [
            {
                "raw_content": "I mean literally the de minimis loophole was closed today as of 12 am EST. Shipments are not even getting shipped to the US. If you don't think prices are going to go way higher in the future you are kidding yourself. https://www.cnn.com/2025/08/29/business/end-of-an-era-billions-of-packages-of-cheap-goods-shipped-to-the-us-are-now-subject-to-steep-tariffs",
                "author": "Personal_Analyst3947"
            },
            {
                "raw_content": "Definitely FEELS higher than that My groceries are 20%+ more expensive than the start of the year",
                "author": "Justasillyliltoaster"
            },
            {
                "raw_content": "Seems low",
                "author": "FriarNurgle"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Las Vegas Housing Supply Rises 31% As Demand Stumbles, Pushing Sale Prices Down Slightly",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know what I got",
                "author": "dandykaufman2"
            },
            {
                "raw_content": "Prices dropped 1% YoY Lol",
                "author": "Babygirl_Alert411"
            },
            {
                "raw_content": "The order of events historically is demand goes down, after a couple years layoffs happen in housing-related industries, and then prices come down in real terms.",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "With Buyers Sidelined, Affordable Listings Climb to Highest Level Since 2022",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Affordable\"",
                "author": "whisperwrongwords"
            },
            {
                "raw_content": "Housing markets across the country are becoming more buyer-friendly, but affordability hurdles continue to hold many would-be buyers back * In July 2025, about 439,000 homes were affordable to a median-income household. That’s the most since August 2022 and 20% higher than a year ago. * The growth in affordable listings comes primarily from an overall inventory recovery that has slowed price growth — total inventory is up 18% from last year. Only 31.7% of listings were affordable in July 2025, similar to last year and far below the 53.7% share in July 2020. * More than half of July listings were affordable to the typical household in Buffalo (55.1%), St. Louis (54.5%), Pittsburgh (54.3%), Detroit (52.8%) and Cleveland (50.1%). For first-time buyers, the housing market finally feels like it’s cracking open a little. More homes on the market are within reach of a median-income household than at any time in nearly three years, giving buyers more choices and a bit more leverage. But affordability hurdles remain steep, keeping many would-be buyers from seizing that opportunity. A typical mortgage payment has more than doubled in the past five years, keeping many renters from making the leap to ownership. Sellers, meanwhile, are seeing homes linger on the market longer, and a record number (27.4%) cut their list price in July. Inventory surge lifts affordable listings Affordable listings are surging. In July, roughly 439,000 homes for sale were affordable to a household earning the median income — meaning they would spend no more than 30% of their earnings on the total monthly payment, including the mortgage, taxes, insurance and maintenance. That’s a 20% jump since last year and the biggest total since August 2022. The jump in affordable listings is directly tied to a rebound in inventory overall. There were more homes for sale in July than in any month since November 2019. Despite the higher count, less than a third (31.7%) of listings in July were affordable to a median-income household. That’s roughly in line with last year (31.1%) and far below July 2020, when more than half of listings were affordable (53.7%). This means that overall affordability has not meaningfully improved, even if there are far more affordable listings for a median-income household to choose from. Affordable new listings show a slight improvement, a signal that it’s not only stale leftovers making up the pool of affordable homes. In July, 33.7% of new listings were affordable to a median-income household, up from 32.4% a year ago. Sellers may be adjusting to today’s more buyer-friendly environment, pricing homes more competitively to help buyers over the affordability hurdle. The regional divide grows Affordability looks very different depending on where you live. While the housing market is becoming friendlier to buyers just about everywhere, that transition is happening at different speeds in different regions. More than half of listings are affordable to median-income households in Buffalo (55.1%), St. Louis (54.5%), Pittsburgh (54.3%), Detroit (52.8%) and Cleveland (50.1%). Sellers generally continue to hold the upper hand in these markets and others across the Midwest because of this affordability advantage. More buyers are able to afford homes, leading to more competition for each listing. Major coastal markets typically have the smallest share of affordable listings, with Los Angeles at the bottom with just 3%. The picture is similarly bleak for median-income households in San Diego (6.4%), Providence (9.1%), Sacramento (11.3%), San Jose (11.4%) and Boston (11.9%). The most buyer-friendly markets can be found across the Sun Belt. Compared to a year ago, the share of affordable listings has grown the most in Austin (+7.9 percentage points), Phoenix (+6 percentage points) and Orlando (+4.9 percentage points). Builders have kept up with demand better in the South, helping inventory grow and price pressure ease. Zillow outlook calls for only modest affordability gains Zillow forecasts home values will fall by about 1% nationwide this year. However, getting the typical U.S. home affordable to a median-income household would take much more. Mortgage rates would need to drop to 4.43% or home values would need to fall 18% — either of which would likely follow a serious slowdown in the economy and heavy job loss. The only sustainable path to improve affordability is to build more homes. The nationwide housing deficit has grown to 4.7 million homes, which is the root of the affordability crisis. Policies that allow more homes to be built more quickly can help.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I think the major hurdle for descending prices (not just stagnation), is new housing. With canada as our #1 source of wood and high tariffs, that's going to be incredibly tough. There's too many cities with 50% less homes than needed, and so there could be a long road ahead for much of the country. We'd need major innovation in affordable housing to fill that void to finally convince sellers their homes are not just overpriced, but not needed. Then it'll be a buyers market!",
                "author": "reedthemanuel"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US housing market sees prolonged summer slowdown",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And coming up next: The fall slowdown.",
                "author": "Strange-Tension6589"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "PCE Measure of Shelter Declined to 4.0% YoY in July",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Great Deflation is about to happen!",
                "author": "running_to_empty"
            },
            {
                "raw_content": "I’m kinda dumb what does this mean if anything",
                "author": "Shoddy_Pomegranate16"
            },
            {
                "raw_content": "Can someone translate for me please?",
                "author": "Capital-Giraffe-4122"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Baltimore Loan Concerns Raise Questions for Wall Street-Backed Lender…",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is where the bubble was always going to crack. Deniers here always point to how it's not 2008 because \"highly qualified buyers\" aren't like the subprime borrowers of yore. Well, guess what? Now it's the overextended investors' turn to fail and bring the house of cards down because their valuation expectations aren't coming to fruition. edit: Funny how this post has absolutely no engagement after six whole hours. I'm honestly surprised the elk hasn't removed it yet lol",
                "author": "whisperwrongwords"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Actually not bad at all.. from Brett Adcock today.",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Been posted a month ago. No progress? It's over.",
                "author": "Weltleere"
            },
            {
                "raw_content": "It’s not doing laundry at all. He just moved laundry from a bucket into the open machine— no collecting, no sorting, no closing the door and running the machine, no taking it out and folding… One easy step demo.",
                "author": "Error_404_403"
            },
            {
                "raw_content": "Loading the washer is temporary. Why even have a washer when your domestic robot can wash everything by hand.",
                "author": "Temporal_Integrity"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "i Robot 2004 predicting 2035 - do you think it kind of holds up",
        "score": 583,
        "text_content": "10 years left If you ignore the whole rogue AI controlling everything part, because realistically we wouldn't put a machine in charge of all machines Think more about the beginning",
        "comments": [
            {
                "raw_content": "10 years is a long time in the AI world. AI seemed so basic even just 4-5 years ago.",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Will Smith: Can a robot rap? Robot: Can you? Smith: (stares) Robot: (stares back)",
                "author": "OKStamped"
            },
            {
                "raw_content": "> because realistically we wouldn't put a machine in charge of all machines That's sarcasm, right?",
                "author": "jan_kasimi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is cooking something....",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kingfall was on the confidential tab last time.",
                "author": "lolsai"
            },
            {
                "raw_content": "**in the Slack group chat** “Hey Reshi, go make a fake tweet acting confused so we can build hype”",
                "author": "Condomphobic"
            },
            {
                "raw_content": "Agent mode maybe?",
                "author": "AsideNew1639"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Taco Bell rethinks AI drive-through after man orders 18,000 waters",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI has nothing to do with this event. This is simply an input validation problem. If the order is invalid, why does the system allow the user to place it?",
                "author": "htraos"
            },
            {
                "raw_content": "This is just shitty software. They need to fire whoever coded that feature. Building AI features doesn’t mean you stop using your head.",
                "author": "stopbsingman"
            },
            {
                "raw_content": "Dude got a thirst.",
                "author": "ForsakenChocolate878"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok-Code dethroned Claude on OpenRouter (for now...)",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably because KiloCode offers it for free for 7 days.",
                "author": "bambamlol"
            },
            {
                "raw_content": "of course, 90% of those tokens are to clean up the mess it makes.",
                "author": "eonus01"
            },
            {
                "raw_content": "Too bad the model sucks .. mediocre. Hope they get v2 out soon",
                "author": "Kingwolf4"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tensor has introduced the Robocar, a Level 4 autonomous vehicle built specifically for private ownership",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "level 4 auto is huge if true tbh",
                "author": "YaBoiGPT"
            },
            {
                "raw_content": "Something about this video feels off. Not because I think it's AI generated, but because it's horribly staged, horribly acted, and shows absolutely nothing new about the technology. Show us the car in busy traffic, making complicated decisions at higher speeds, avoiding potential accidents, on country roads, in bad weather etc, then we might be impressed. This is just boring and lame.",
                "author": "Jenkins87"
            },
            {
                "raw_content": "I, too, like to wave to objects.",
                "author": "nothing_pt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "yo I think I must have amnesia or something. weren't we supposed to get 🚢🚢🚢 geminis this week or what?",
        "score": 28,
        "text_content": "Ok cool image gen banana nano. We could count that as 1 ship. Wth happened to the others? they sink?",
        "comments": [
            {
                "raw_content": "Google staff hyping in their spare time: https://preview.redd.it/jql72d43b2mf1.png?width=928&format=png&auto=webp&s=4d8c21999de53b1f37e73d2b061c372b826f1400",
                "author": "sdmat"
            },
            {
                "raw_content": "You guys gotta stop reading tea leaves",
                "author": "jjjjbaggg"
            },
            {
                "raw_content": "Can confirm I was the ship that sank",
                "author": "Similar-Cycle8413"
            }
        ],
        "subreddit": "singularity"
    }
]