[
    {
        "post_name": "Rep.Robin Kelly (D-Ilinois) files to IMPEACH DHS Sec. Noem after today's anti-ICE terror attack in Minneapolis! \"I’ve had enough. She has turned ICE into a rogue force, violating the Constitution, tearing families apart, and leaving death in her wake.\"",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's war.",
                "author": "Websitesdown"
            },
            {
                "raw_content": "Republicans should immediately impeach Robin Kelly.",
                "author": "JBlaze056"
            },
            {
                "raw_content": "LOL, I'll bet she can't explain how they are violating the constitution...",
                "author": "AllisterTwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Good luck with the protests, ICE is coming.",
        "score": 725,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ICE # ICE # BABY",
                "author": "Patriot31TN"
            },
            {
                "raw_content": "It's warmer than it usually is",
                "author": "PapaPepe"
            },
            {
                "raw_content": "That’s January heat wave in Minnesota.",
                "author": "DickJohnson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Minnesota Police and Peace Officers Association has released a statement: “Irresponsible, reckless rhetoric from political leaders attacking law enforcement has real and dangerous consequences for officers on the street.\"",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s a statement made directly to you leftist demoncrats… you the mayor of Minneapolis, the governor of Minnesota and all you worthless pieces of shit in Congress.",
                "author": "JBlaze056"
            },
            {
                "raw_content": "Democrats are literal traitors. Get the nooses out!",
                "author": "RogueLeaderX"
            },
            {
                "raw_content": "Wonder what the police standing behind Tim Walz and frauds think about this.",
                "author": "Pied-Trumper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😴 Sweet Dreams 💤",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The top image looks like me every time I hear any news about California.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Amen! I seem to wake at 3 every nite. I have some hope the future will be brighter. So get a glass of water n go back to bed. Dont put anything in you body that weakens you God bless you",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "7 more years!",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Kenosha Kid Is On Standby",
        "score": 1437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nah. Please have a good life.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Epic if the tweet is real.",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "The crazy poet lady crossed state lines from Colorado or wherever to Minnesota in order to obstruct ICE.",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jack Posobiec : The masks are all coming off Look at what this Democrat congressman just said about our ICE officers",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trying to drive away.... THROUGH A GUY!? GET FUCKED FAGGOT!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "(((Goldman)))",
                "author": "NazisWereSocialist"
            },
            {
                "raw_content": "\"Trying to drive away\" is one way of putting it. \"Trying to Escape Arrest By Committing Felony Vehicular Assault\" is yet Another, more accurate, way of putting it.",
                "author": "TillaMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HERE’S WHY!!",
        "score": 1439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They would have been celebrating if the Officer died.",
                "author": "Covfefebrulee"
            },
            {
                "raw_content": "The problem is that many liberals are too stupid to be able to read this.",
                "author": "jamesbcrazy"
            },
            {
                "raw_content": "If I had to guess, I'd say she panicked when she realized she was going to get arrested. It's sad, but I don't know what else anyone would expect if you're told to get out of a vehicle and you accelerate toward a cop instead.",
                "author": "VoteThing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kristi Noem: people need to stop using their vehicles as weapons. This domestic act of terrorism is going to stop. I am asking the DOJ to prosecute this as domestic terrorism. It’s clear that it’s being coordinated and people are being trained.",
        "score": 1604,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dig up her grave and prosecute her corpse",
                "author": "medicpatriot"
            },
            {
                "raw_content": "If you want it to stop there needs to be mass arrests, including the NGO and politician ring leaders!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "An eyewitness described a convoy of \"protest\" vehicles impeding ICE vehicles. The dead bitch's vehicle was the lead vehicle. So, yeah, it's planned and coordinated. https://patriots.win/p/1ARwLICu4u/witness-to-the-deadly-ice-incide/c",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor Tim Walz and his administration are threatening criminal charges against the ICE agent who sh0t 37-year-old Renee Nicole Good after she tried to use her vehicle as a weapon against him.",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Burn your own state down. Do it.",
                "author": "seeling0"
            },
            {
                "raw_content": "So its a Civil War they want? Lets get it over with already because this country can not exist with democrat cartel within it.",
                "author": "invalid_data"
            },
            {
                "raw_content": "Discovery ( in court proceedings) of who that driver was is going to be in favour of the officer.",
                "author": "Bromodosis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who is going to run Minnesota Mr. President? We are.........",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "😀😀😀",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Let the man rest ONE DAY.",
                "author": "realsolidsnakeoil"
            },
            {
                "raw_content": "colors are correct, but what the fuck is that symbol on the front of his hat, lmao",
                "author": "magaspif"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump signs order to pull the United States out of 66 international organizations.",
        "score": 1680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As a Texan, this makes me PROUD to have such a strong president. Thank YOU, Mr. Trump!!!",
                "author": "Patriot4TX"
            },
            {
                "raw_content": "99% of everything the government does is fraud. Shut it all down.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Execute Order 66.",
                "author": "DelendaEstMarxismo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Did someone say the Democrat Party are inciting a violent insurrection… Again?",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest the ringleaders for sedition and there will be no need to invoke the Insurrection Act. Members of the Oathkeepers were arrested for sedition as recently as January 2023.",
                "author": "airborne3502"
            },
            {
                "raw_content": "My favorite Lincoln quote: >\"I will say, then, that I am not, nor ever have been, in favor of bringing about in any way the social and political equality of the white and black races; that I am not, nor ever have been, in favor of making voters or jurors of negroes, nor of qualifying them to hold office, nor to intermarry with white people; and I will say, in addition to this, that there is a physical difference between the white and black races which will ever forbid the two races living together on terms of social and political equality. And inasmuch as they cannot so live while they do remain together, there must be the position of superior and inferior. I am as much as any other man in favor of having the superior position assigned to the white race.\" This is what White people believed before television and international jewry. $5.",
                "author": "SimaYi"
            },
            {
                "raw_content": "Give me a break. You'd more than likely get shot *anywhere* in the US attempting to run over an officer.",
                "author": "HyperCarbs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yesterday, Tim Walz declared Minnesota is at \"war against the federal government.\" Again today, he called it \"war with our federal government.\" This lunatic is SICK and DANGEROUS!",
        "score": 1157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this not clearly sedition?",
                "author": "Mamapedia"
            },
            {
                "raw_content": "Even my alcoholic grandpa who’s 80 makes more sense than this retard",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Bro your whole career is built on defrauding the Federal Government.",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💯",
        "score": 1687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have not yet disagreed with anything Matt Walsh has said (that I've heard or read.)",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "We've said it ad nauseam, but I wish President Trump was the president the left accuses him of being.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Mayor is going to lear a hard lesson",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK, Jr: The food pyramid, South Park style",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear former Democrats make the best Republicans",
                "author": "based_trekkie"
            },
            {
                "raw_content": "Lol is this a real south park skit? Did he really post this? 😆😆",
                "author": "jeb_is_a_mess"
            },
            {
                "raw_content": "Kek (top)",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Better close up early!",
        "score": 1058,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's called Foot Locker. How do you get that wrong?",
                "author": "stagolee"
            },
            {
                "raw_content": "She white ain't nobody finna riot ova dat",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "The nggrs will be bussed in soon. I know, I was there the first time around.",
                "author": "SpiderTaxi"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Witness to the Deadly ICE Incident",
        "score": 1227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She was a lot more than a \"legal observer\"... ...now she's doing a lot of not breathing.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"legal roadblock\" Now her child has no parent....mom of the year",
                "author": "VirTW"
            },
            {
                "raw_content": "Some people never lear.",
                "author": "Rango"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "4 more years",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol it’s like people don’t realize the news cycle resets every few days. Who cares about Charlie outside of us anymore? Or Fort Knox? Or Somali fraud? Plus, it was a white woman. They’re not gonna chimpout over her as bad as they did with Fentanyl Floyd",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I can't wait to desecrate the Karen Floyd memorial hydrant.",
                "author": "raptormissle"
            },
            {
                "raw_content": "President Trump's Press Secretary needs to show the press pool video of Nicole Good actually hitting the officer. Don't let the left control the narrative on this one. Kristi Noem saying the ICE agent was justified in shooting her isn't enough. They are already the villains in this story. The administration needs to have their backs on this one.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE LEFT TODAY",
        "score": 1172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dat bulge. *chef's kiss*",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Leftists love lethal force until they get a taste of their own medicine.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Good, now they know what happens when they fuck around with ICE. So did they get the criminal illegal they were there to deport?",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The talking points have gone out.",
        "score": 1178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well she became a lethal deserver",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "So paid shills are legal observers now?",
                "author": "Steve56775"
            },
            {
                "raw_content": "She went from observer to participant pretty fucking quick. Wait until footage from 5-10 minutes prior to the shooting comes out and like always will make the Democrats look like fools again. 30 second clips do not tell the whole story.",
                "author": "4444444444444"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘They’re selling ancient silicon’: Intel warns handheld war is coming",
        "score": 331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it’s a real missed opportunity that AMD didn’t make the zen 5 mobile refreshes with Rdna 4. Hopefully the Zen 6 + RDNA5/UDNA? Apus next year are good.",
                "author": "dabocx"
            },
            {
                "raw_content": "It’s crazy how much innovation we have recently seen in igpus and low power processors in general The ARM arms race really got Intel and AMD actually paying attention to mobile again and it’s honestly great",
                "author": "SupportDangerous8207"
            },
            {
                "raw_content": "In a purely consumer mindset, this is awesome. For the next few years, with all the DIY constraints, it would at least be nice to see gaming APUs, especially handhelds, get more focus. The fact that Intel, who REALLY needs a win, is the initiator of the competition is a cherry on the top.",
                "author": "cypher50"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung, SK Hynix reportedly reject long-term DRAM contracts and raise prices by up to 70%",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good business move but damn these next couple of years is gonna be tough for consumers who need new hardware.",
                "author": "EastvsWest"
            },
            {
                "raw_content": "everything is fine … (fire burns around the pc community)",
                "author": "Ill-Mastodon-8692"
            },
            {
                "raw_content": "May be you two DRAM cartel shouldnt have sign a contract with OpenAI 6 months ago; should have let the market decide how much it worth maximizing your profit with tons of happy customer willing to do bidding wars. Now you are stuck with selling whatever low price you agreed with OpenAI & the market is paying more and ALL of them are still pissed at you. It obviously OpenAI do a 4D chess screwing everyone else while strike a long term low price deal.",
                "author": "hackenclaw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Failed Us | Gamers Nexus CES Coverage",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hardware enthusiasts just simply need sit this year out. Only mediocrity lies ahead for the next 18 months or so. I mean maybe Intel will do something interesting, but it looks like they're hopping on the wagon, too.",
                "author": "xylopyrography"
            },
            {
                "raw_content": "Been to CES many times and have never bothered with keynotes. Just way too much marketing BS for me to stomach.",
                "author": "Y0tsuya"
            },
            {
                "raw_content": "AMD never misses an opportunity to miss an opportunity",
                "author": "Positive-Road3903"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Magician SSD software 'High Severity' vulnerability patched — upgrade to the newest v9.0.0 to prevent potential DLL hijacking and privilege escalation",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">version 9.0.0 fixes this issue and comes with a complete UI/UX overhaul. The new UI is crap. You have to make multiple clicks just to look at the status and quantity of different Samsung drives on your system.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Hello wickedplayer494! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen chief teases return of older Zen 3 chips to fight soaring RAM prices",
        "score": 234,
        "text_content": "A few weeks ago I was commenting AMD releasing AM4 cpu again was very unlikely, and it seems they wanted to prove me wrong. Still, this news should be taken as a rumor for now, until a more official announcement.",
        "comments": [
            {
                "raw_content": "It's not like ddr4 is getting any cheaper. But at least you can reuse your old RAM. I'd hope it be the x3D chips making a return, to make up for slower RAM speed.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Unless they come out with a 5900/5950x3d theres nothing really for me to upgrade my 5800x to. Sure aint buying a used 5800x3d for 400 eur, much less a 5700.",
                "author": "Myrang3r"
            },
            {
                "raw_content": "5950x3d please, to end am4 with a bang",
                "author": "Ill-Mastodon-8692"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PNY Announces Dual-Slot Slim Models for GeForce RTX 50 Series (5080 / 5070 Ti / 5070)",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">120mm Dual-Fan, 2-Slot Would be nice seeing more cards use 120mm fans and especially if they're replaceable.",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "PNY is the only brand Nvidia allows to have the GPU die name listed on the GPU shroud.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I like pny gpus, been running their normal 5070ti and a friend of mine runs a 5060ti of theirs. Imo though, bigger, gpus are the way to go instead of shrinking. just allows for much more cooling headroom",
                "author": "kizvy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm In Talks With Samsung For 2nm Chip Production Amid Concerns Of Rising Costs At TSMC: Report",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These articles about design firms \"in talks\" with Samsung and Intel are so useless. Of course these companies talk to all possible suppliers. That doesn't mean they will actually award a contract.",
                "author": "Competitive_Towel811"
            },
            {
                "raw_content": "Maybe use Samsung 2nm can get more dram.",
                "author": "Goddamn7788"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[PCWorld] Intel Core Ultra Series 3 gaming plugged VS unplugged",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Summary: PTL runs Tomb Raider at 50 FPS at 2880x1800 with one step below highest PTL runs Cyberpunk 2077 High at 2880x1800 with XeSS Balanced at 48 FPS. PTL runs F1 with one step below highest at 2880x1800 at 53FPS. Unplugged performance is within margin of error of plugged in performance.",
                "author": "steve09089"
            },
            {
                "raw_content": "For context, my 258V on Shadow of the tomb raider with the same settings gets 26FPS.",
                "author": "unknown_failure"
            },
            {
                "raw_content": "That is exciting, usually you get much less performance unplugged on x86 laptops, in stark contrast to Macbooks. First good sign. Now it will be interesting to see battery life in more demanding tasks and if it holds up. And of course CPU benchmarks, because usually the CPU is not stressed much in gaming benchmarks.",
                "author": "dampflokfreund"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Man, handheld devices have come so far.",
        "score": 704,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t stop there, player https://preview.redd.it/gbje5ubao0cg1.jpeg?width=1183&format=pjpg&auto=webp&s=df1dcdc3d6da498f206d3e09af94f1e6cb7fd74c",
                "author": "VicViolence"
            },
            {
                "raw_content": "I was going to say that that's not even that old of a handheld, but the PSP is over 20 years old now.",
                "author": "Williekins"
            },
            {
                "raw_content": "This is just a reminder that the PSP was, and still is, dope as fuck.",
                "author": "Reddilutionary"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got This Bad Boy From My Company",
        "score": 819,
        "text_content": "Won this in a mini game during my company's annual dinner. Got lucky and pulled this from the draw pool. My Switch Oled can proudly retire after long years of service. Should I purchase all the upgrade packs? Never got around to finishing ToTK because I've been clearing my Steam backlogs. I'm very much tempted to restart and finish the game with the 2 now.",
        "comments": [
            {
                "raw_content": "TOTK at 4K 60 alone is glorious. If you have NSO + Expansion, the upgrade packs for TOTK / BOTW are free. I love my switch 2! Just have fun and enjoy it",
                "author": "Zomnx"
            },
            {
                "raw_content": "Nice and they saved you an extra $30+ with a screen protector and carrying case bundle 😃. Enjoy!",
                "author": "ImStupidPhobic"
            },
            {
                "raw_content": "my company gave out brownies...",
                "author": "nosajh9"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I know it’s unrealistic since its Nintendo, but could we PLEASE get scaling options for Switch 1 games? They look awful on Switch 2 and a lot of finer text is very hard to read. (bad mockup i know)",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Docked toggle for Switch 1 titles in handheld would take it from a 7/10 console to a 9/10 for me",
                "author": "PersonalityNo8280"
            },
            {
                "raw_content": "Upvoted simply because you took the time to make a mock up, love stuff like that",
                "author": "ZanzibarGem44"
            },
            {
                "raw_content": "You have to hope that there is some sort of reason they just aren't doing it. Like there has to be some sort of technical hurdle that makes it not that easy. It's the only rational explanation. But given all of Nintendo's history with not taking the obvious path, you just kind of assume it's Nintendo being stupid about it. I wish they would just come out and say why they aren't doing it. Not saying anything makes me think it's a business decision and they just don't want to invest ANY time/money into fixing this issue. It's not a priority to them and we will just comply and keep funneling money into their pockets.",
                "author": "ChronicContemplation"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reminder, Metroid Prime 4 is not \"Metroid 4\", that's Metroid Fusion's internal name.",
        "score": 118,
        "text_content": "After Metroid II, the series dropped numbered titles, but each game has continued to have internal numerical designations. These numbers have been shown in the opening text, an interview, and a reveal trailer. The Prime series, which is canon, is a separate sub series within the overall Metroid saga. Generally, Metroid fans don't use the internal numbered names to refer to games, aside from II. We'll usually just say \"Fusion\", or \"Dread\", but we don't really say \"Metroid 4\". If we refer to Metroid Prime 4, we'll probably just say \"Prime 4\". This isn't really an issue mind you, but I notice a lot saying \"Metroid 4\" when referring to Prime 4, and just thought I'd help clarify that \"Metroid 4\" is already used by Fusion. So when Metroid 6 is announced, I hope you don't think \"Wait, 4 was the last one, where's 5?\" lol. [Metroid Other M interview with series producer Yoshio Sakamoto](https://web.archive.org/web/20160310142936/http://www.1up.com/previews/metroid-other-m?pager.offset=1) [Metroid Dread reveal trailer](https://youtu.be/8NjCICl7dDo?si=48BnSbehMufUSUrn)",
        "comments": [
            {
                "raw_content": "I cant wait for the next 2D metroid game. Id like to see fusion remastered.",
                "author": "BobaF4t"
            },
            {
                "raw_content": "Ok. But if there’s a title card with the number entry, is it still internal?",
                "author": "DrSussBurner"
            },
            {
                "raw_content": "👍",
                "author": "thetantalus"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "When do you think we see Hori release a Split Pad Pro 2. I'm trying to wait faster lmao",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It'd be nice if it had rumble at least",
                "author": "Background-Onion-997"
            },
            {
                "raw_content": "Think a couple months Nitro deck and others are all coming soon",
                "author": "IcyButterscotch7652"
            },
            {
                "raw_content": "M12HD should be releasing around April",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Seen all the minor re-releases on switch 2. The only thing I wanted for it was this gem.",
        "score": 23,
        "text_content": "I truly want to see a new master game that expand a bit this game keeping its mechanic intact. A game that preserve the anime style of Akira Toryama. Expand orchestral music. Into game cartridges not the key shit. That incorporates the history of its two sequels. At least 400-500hs of gameplay and replay value. With orchestral CDs and/or a jazz LP in a collector bundle. I have so many hours in my SNES and NDS. Come on, Nintendo! It's time for a new Dream Team! Bring passion to the games not money, just for the old days! Remember Shenmue! Chrono Trigger is the absolute apex of jRPG (Don't cry FFVI fans, you know the true).",
        "comments": [
            {
                "raw_content": "Feels like such a big fan should be aware Nintendo had nothing to do with that game. Nor with Shenmue for that matter..",
                "author": "wewewi"
            },
            {
                "raw_content": ">Into game cartridges not the key shit. Except that these days, cartridges ARE shit. Unlike the SNES chip-based carts of that long-gone era. A Switch 2 cartridge is a parody of what cartridges used to be. Why? Because Switch 1 and 2 cartridges are basically mid-grade FLASH CARDS. With all the limitations said cards have (Spoilers: they won't last long on your shelves, especially if you stop playing them). With keycards, at least you can resell games. Or you can back them up on a hard disc. You can also do that with physical games, but eventually, you'll end up owning just the digital version when the physical cart turns into a useless piece of plastic with no data on it. >Come on, Nintendo! You mean Square Enix? THEY are the ones who are supporting keycards 100%",
                "author": "Garamenon"
            },
            {
                "raw_content": ">I have so many hours in my SNES and NDS. \\[...\\] It's time for a new Dream Team! Bring passion to the games not money, just for the old days! Rather let these Dream Teams bring their passion to new games. They can use the same retro style with chip tunes even. Smaller budgets even. But new worlds. New heroines. New enemies. Etc.",
                "author": "weaklingoverlord"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thanks Retro Studios",
        "score": 12,
        "text_content": "Took this photo on arrival—just finished Prime 4 today. Amazing game, and the 120fps option is fantastic.",
        "comments": [
            {
                "raw_content": "I just finished it yesterday - loved it!",
                "author": "SpaceIsAce"
            },
            {
                "raw_content": "My favourite part is crossing the desert every single time you want to change areas.",
                "author": "TheRigXD"
            },
            {
                "raw_content": "I think the game was just okay, not worth the money for how short is was. it did look and run great though",
                "author": "LePoopScoop"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think the Switch 2 could run Jedi Fallen Order and Jedi Survivor at 60fps?",
        "score": 244,
        "text_content": "Really wish I could play these two on the Switch 2 at 60fps but maybe I’m asking too much…",
        "comments": [
            {
                "raw_content": "If they could do 40 fps like cyberpunk, that would a nice midle ground.",
                "author": "realStinkyMouse"
            },
            {
                "raw_content": "Fallen Order, maaaaaybe. Survivor, not a chance. The game couldn't even maintain a steady 60fps on PS5 when it launched. It's probably better now, but if it required that much effort to get a stable 60fps on PS5, there's no way the Switch 2 can do it.",
                "author": "Remy0507"
            },
            {
                "raw_content": "No and No, fallen order struggled on old gen and Jedi Survivor literally required months of extra work to even get it to work on old gen",
                "author": "Dry-Cod9127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier on GTA 6: the last I heard it was still not content complete.",
        "score": 1105,
        "text_content": "source: [https://open.spotify.com/episode/1EANk4uOn68ddip6pKliqY?si=zn4dBqixRVCBcuh4t0NBYg%0A](https://open.spotify.com/episode/1EANk4uOn68ddip6pKliqY?si=zn4dBqixRVCBcuh4t0NBYg%0A) (timestamp: 5:22)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "As long as it never comes out, Take Two can keep using it in financial predictions.",
                "author": "dewittless"
            },
            {
                "raw_content": "place your bets, which will be first, hl3 or gta 6?",
                "author": "Omni7124"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "IGN Poland reveals that they've known about the rumored Witcher 3 DLC \"years ago\" and that it might introduce a whole new region",
        "score": 155,
        "text_content": "Here's a translation of [their article](https://pl.ign.com/wiedzmin-3/69405/news/wiedzmin-3-nowe-dlc-zabierze-nas-na-pustynie-ujawniamy-nasze-informacje-sprzed-lat-i-rzucamy-nowe-sw?fbclid=IwY2xjawPKJn1leHRuA2FlbQIxMQBzcnR) : \"We have to admit something to you. We knew about the work on a potential new expansion behind the scenes a long time ago. We don't want to give exact dates to protect our sources, but the topic appeared on our radar years ago. Our informant – a person who has repeatedly provided us with reliable behind-the-scenes information – confirmed at the time that a new expansion was in the works, albeit at a very early stage. So why didn't we write about it? Although it was reliable, it was information from only one source. We decided that it wasn't enough to get your hopes up based on a single signal. However, what we heard later behind the scenes and what resulted from our internal analysis of that period is important here. All of this sheds completely new light on today's speculation. At the time, we were receiving signals that the team was fascinated by a completely different direction than the frozen north. There were many indications that the developers were keenly interested in exploring >!Zerrikania!<. Many years have passed since we first heard about the DLC and came to the conclusion that it would most likely take us to the desert. The studio's internal plans may have changed many times, and the folder labeled >!Zerrikania!< may have been replaced with one labeled “Kovir” or something else entirely. However, considering how convinced our sources were about the work on “something new” years ago, and how often the topic of the east appeared in our analyses and sources, we cannot ignore this lead. Since our information about preliminary work on the expansion (now confirmed by analysts and insiders) is proving to be increasingly likely, perhaps our information about its location also has some truth to it? \"",
        "comments": [
            {
                "raw_content": "Okay, my take as a Pole and someone who read all the books? This is going to be setting up the new conjuction of spheres, the event that made Witchers neccessary in the setting by monsters entering the world. Which is how they will justify new monsters in Witcher 4 or why there's new Witcher schools coming up. The DLC will be Geralt learning that it's going to happen, and maybe try to prevent or limit the capacity of it.",
                "author": "arteg489"
            },
            {
                "raw_content": "I think it’s been clear since the last round of leaks that this a genuine, sizable expansion and not just a bonus mission or two like the Netflix thing. But I’ll admit that I was still unsure if we were actually getting a full-blown new region with all the bells and whistles that naturally tend to accompany that. I’m very curious how big this ends up being. Since Blood and Wine could almost have been a stand-alone title, getting another similarly-sized expansion would be absolutely insane so many years from when it seemed like major new content had stopped. I’d be happy even with a smaller, more self-contained DLC like Hearts of Stone, so anything beyond that is almost crazy to think about. I’m also very curious *what* the DLC is if it really is meant to tie TW3 to TW4. Is there a big time jump? Will it be directly integrated into the base game like the other expansions or put into a separate world and save file? Are we even going to play as Geralt?",
                "author": "SilverSquid1810"
            },
            {
                "raw_content": "IMO it's kind of obvious it's a new region. First it's the only way to do the supposed transition between TW3 and TW4 because including it in an existing region would mean you could do it before ending TW3 main story presumably. Plus with how TW3 is built it's the easiest thing (Hearts of Stone also had an area specifically left for it, none of the current regions really have that). Now if it's what they say remains to be seen. I think it would probably more deserve its full game (it's supposed to be huge). In fact that's where I hoped TW4 would have gone instead of Kovir but I guess TW5 and 6 might still do it.",
                "author": "Zalvren"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GTA6 Gamerolls leak basically confirmed",
        "score": 234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t understand why people risk their high end job to leak things and get fired",
                "author": "usaduno"
            },
            {
                "raw_content": "Gameroll leaks were already basically confirmed and this changes nothing because we still don't know which specific info is accurate other than what we've seen. It is crazy that Rockstar went out of their way to confirm that they figured out who's been talking to Gameroll and probably LegacyKilla too and fired them. If Rockstar is being completely truthful, it makes sense that they'd wanna keep people from leaking by making an example out of the people they do catch.",
                "author": "Sunimo1207"
            },
            {
                "raw_content": "It was pretty much confirmed when the second trailer dropped and the characters ended up having the last names he \"guessed.\" It was pretty clear that he was the real deal after that.",
                "author": "IIIOldSchooLIII"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Kotaku] Wolfenstein 3 is in development at MachineGames",
        "score": 891,
        "text_content": "[https://kotaku.com/wolfenstein-3-in-development-machinegames-bethesda-2000657758](https://kotaku.com/wolfenstein-3-in-development-machinegames-bethesda-2000657758) Following Jez Corden reporting about Wolfenstein III, Kotaku verified with their own sources which confirmed that *it is* indeed in development.",
        "comments": [
            {
                "raw_content": "fucking finaly, i hope this is the mecha-hitler one they talked about",
                "author": "zadye"
            },
            {
                "raw_content": "Really hope this is before Young Blood so we can actually kill Hitler.",
                "author": "randi77"
            },
            {
                "raw_content": "quake fans punching the air right now",
                "author": "D0NTEVENKNOWME"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RTX 60XX Series releasing 2027H2",
        "score": 288,
        "text_content": "[According to hardware leakerKopite](https://i.imgur.com/LHrelDT.jpeg), the new RTX 60XX Series Rubin is only releasing H2 2027. [The Card uses GR20X](https://videocardz.com/newz/geforce-rtx-60-reportedly-uses-gr20x-rubin-series-gpus) which means around 10-30% gain in performance over previous generation.",
        "comments": [
            {
                "raw_content": "The starting price will be $6999",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "10-30% performance gains for the simple price of 100% more expensive than previous gen.",
                "author": "__TheWaySheGoes"
            },
            {
                "raw_content": "*vram sold separately*",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez : New Vegas remake planned.",
        "score": 1021,
        "text_content": "\"Some have been wondering if a mysterious countdown on the Fallout TV show's Amazon Prime website is hinting at a shadow drop for a new Fallout game or remaster. I'm told this is not the case. However, we are eventually getting a Fallout 3 remake in the vein of Elder Scrolls IV: Oblivion Remastered, as well as Fallout New Vegas on top.\" https://www.windowscentral.com/gaming/xbox/xbox-in-2026-what-to-expect-from-team-green-this-year-and-beyond",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "It's literally counting down to the release of the final episode lol",
                "author": "JenCarpeDiem"
            },
            {
                "raw_content": "#Fallout: Newer Vegas",
                "author": "Respawn-Delay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Fallout 3 Remaster is a planned release, yes.",
        "score": 964,
        "text_content": "https://xcancel.com/NateTheHate2/status/2008410536321380388 When asked about a current mysterious countdown that showed up on the Amazon Prime video's website, an user asked nate if this could be related to a new remaster. While he says Fallout 3 remaster is a thing, he is unsure so far at the possible reveal window.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "My hope is that Bethesda announces it at the Xbox_Direct Showcase later this month and it drops right around the time that Fallout Season 2 ends. My expectation is that it won't be announced until next year and probably releases in 2028.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "We've known about the Fallout 3 remaster since 2020. Worst kept secret in gaming lo Edit: the leaks came out in 23'. Time is a flat circle.",
                "author": "Rarglar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Alleged SteamDB app code supposed to be for Life is Strange: Reunion has been spotted",
        "score": 33,
        "text_content": "In the comment section of the [now deleted original post](https://www.reddit.com/r/lifeisstrange/comments/1q6lun0/removed_by_moderator/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) that pointed out the existence of a new Life is Strange game who has slipped throught the [PEGI ](https://web.archive.org/web/20260107182828/https://pegi.info/search-pegi?age%5B0%5D=&descriptor%5B0%5D=&form_build_id=form-zPFbdUs22JjjBl9jvQQJhI4DxddpAjHJlNxhOZ0-1AE&form_id=pegi_search_form&op=Rechercher&page=1&platform%5B0%5D=&publisher=&q=life%20is%20strange&release_year%5B0%5D=)and the [UK Games Rating Autority](https://archive.ph/oRdpj) rating sites, one user alleges that by looking at the Double Exposure's SteamDB page, an unknown unrelased app has been listed. They claim there's a chance it might be announced at this month Xbox Developer Direct, as some past LiS games had been announced throught Xbox related events. >*Remember the ex-D9 dev leaks which said DE was always gonna be two games? This is likely the second game in that contract that Square also decided to split up instead of releasing together. I personally don't have all of the same issues folks do with LiS DE, but it is kind of clear that Square probably thought holding back Chloe was gonna make folks more excited than otherwise.* >*Anyhow, there is an Xbox Developer Direct this month and LiS is usually announced at Xbox events, so that might be where it's being announced. The PlayStation only listing doesn't mean much especially as this is a rating leak, the PEGI does sometimes screw up, the date could be a placeholder or the original date lol...* >*On the PC side, on SteamDB, last month there was a change that bundled LiS DE with another two Steam apps:* [*https://steamdb.info/app/1874000/history/?changeid=32596851*](https://steamdb.info/app/1874000/history/?changeid=32596851) >*One of these apps has been getting persistent updates since September 2023, when it was added to the Steam backend. This is most likely the new game:* [*https://steamdb.info/app/2624870/history/*](https://steamdb.info/app/2624870/history/) >*A lot of work we're gonna see in this game was probably already in progress when DE itself released too. I do think the description is kind of weird too and I'm not sure how they're handling Bay-ers but it is on the PEGI website, so it's not fake.* Original source: [https://www.reddit.com/r/lifeisstrange/comments/1q6lun0/comment/ny9exsm/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/lifeisstrange/comments/1q6lun0/comment/ny9exsm/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) Original *Life is Strange: Reunion* leak: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6nkau/new\\_possible\\_life\\_is\\_strange\\_game\\_leaked\\_life\\_is/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q6nkau/new_possible_life_is_strange_game_leaked_life_is/) Xbox Developer Direct on January: [https://www.windowscentral.com/gaming/xbox/xbox-in-2026-what-to-expect-from-team-green-this-year-and-beyond](https://www.windowscentral.com/gaming/xbox/xbox-in-2026-what-to-expect-from-team-green-this-year-and-beyond) Original posts on the alleged former Deck Nine developer talking about the existance of a Double Exposure sequel: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mub1k9/exdeck\\_nine\\_games\\_developer\\_makes\\_claims\\_about\\_an/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mub1k9/exdeck_nine_games_developer_makes_claims_about_an/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mwkn8z/former\\_deck\\_nine\\_games\\_dev\\_alleges\\_that\\_double/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mwkn8z/former_deck_nine_games_dev_alleges_that_double/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "i know a lot of people hate DE but i really didn't mind it. I really hope reunion is revealed soon and is good.",
                "author": "rotten-tomato1"
            },
            {
                "raw_content": "Man, what they’ve done to this franchise is just sad at this point. LiS 1 had its share of cringy dialog and whatnot, but it was a very touching choose-your-own-adventure game with a lot of heart. It’s a very nostalgic game for me; they really captured that feeling of being a dumb teenager trying to figure out life while clinging onto the remnants of your childhood. Before the Storm was so-so. An alright prequel for diehard fans of the first game, but a lot of the creative decisions are questionable and it didn’t really advance the universe’s plot forward in any way. Then they just really fucked up with the sequel. I was happy with the initial concept of making the franchise more of an anthology series with different casts and different powers, but from almost everything I’ve heard, LiS2 just failed to provide a similarly endearing cast or memorable story as the original. It reviewed poorly and made far less of a splash than the original. Then Dontnod left the series and some other dudes took over. They put out True Colors, which reviewed fairly well but arguably had even less impact than the second game. And now that the “franchise” (or attempted franchise, more accurately) is on life support, they seemingly scrapped the whole anthology idea and trudged out Max again to make a nostalgia bait mess of a game that just managed to piss off fans of the first game. As far as I’m aware, Double Exposure was just an utter flop by any metric. Seriously, I know they signed some sort of agreement to make a sequel to Double Exposure, but I really, really wish they’d just let this series die. They had one really good game and then simply weren’t able to expand upon it and make it into a successful series. They’re just digging up the grave of the original for some quick cash at this point.",
                "author": "SilverSquid1810"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel launches Core Ultra Series 3 CPUs, made using its long-awaited 18A process",
        "score": 163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One thing that's interesting is that they're binning the platform controller tiles so that the chips with the big iGPU get faster memory support, the chips with a lot of CPU cores and normal GPU gets 20 PCIe lanes, and the low-end chips get the worst bins.",
                "author": "Noreng"
            },
            {
                "raw_content": "Looking at that chart I'm struggling to see the point of the X9 388H vs the X7 368H. Maybe I've missed something but the only difference between the X9 and X7 seems to be +100MHz clock... which would presumably be mostly irrelevant as far as performance on these high end chips.",
                "author": "jenny_905"
            },
            {
                "raw_content": "The claims about that new Arc GPU are quite something. Can’t wait for the Notebookcheck entry.",
                "author": "twisted_nematic57"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "HP EliteBoard G1a is a keyboard with built-in PC powered by AMD Ryzen AI 300 Krackan APU",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So it’s an upgraded raspberry pi 400",
                "author": "stonktraders"
            },
            {
                "raw_content": "Flashback to 1987 and commodore 64 days ![gif](giphy|kopN26K2ThF9j7RL4K)",
                "author": "RBImGuy"
            },
            {
                "raw_content": "I guess is better to trow away a cheap keyboard than a monitor when is time to replace an AIO. The problem is, what happens when the keyboard brakes? AIOs are stupid for a reason. Just focus on building mini PCs FFS!",
                "author": "costafilh0"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Alienware confirms AMD Ryzen 9 9950X3D2, coming to AREA-51 gaming PCs",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something like this is obviously going to make more sense to upsell in a prebuilt bc it won’t game any faster than single X3D CCD, but I’d be very surprised if it is OEM only bc some enthusiast will drop 1k on one of these.",
                "author": "996forever"
            },
            {
                "raw_content": "Maybe this can finally hit 100+ FPS and 60 0.1% FPS in Microsoft Flighht Simulator? 5090 + 9950X3D is around 90 average FPS and 50 0.1% FPS in 4k Native DLAA.",
                "author": "popop143"
            },
            {
                "raw_content": "Sytronix also lists it in their upcoming workstation system, which makes a lot of sense for certain workloads.",
                "author": "LordAlfredo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Trump to Ban Institutional Investors from Buying Single Family Homes",
        "score": 1247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That would actually be something I'd strongly support, would love to see it come to pass. I have a feeling the wall st lobbyists will have something to say about it, but I'd love to be wrong",
                "author": "Cronstintein"
            },
            {
                "raw_content": "Increase propert taxes on addition homes purchased by these companies and people so much that their business model isn't viable.",
                "author": "KetchupOnThaMeatHo"
            },
            {
                "raw_content": "What does \"large institutional investors\" mean? I smell a loophole somewhere in the fine print.",
                "author": "plaincheeseburger"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage demand drops nearly 10% to end 2025, despite lower interest rates",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mortgage application volume dropped 9.7% over the two-week holiday period ending 2025 into the new year. Lmfao. Mortgage applications dropped over Christmas and new years? Wonder why that could be",
                "author": "Whole-Reserve-4773"
            },
            {
                "raw_content": "Very suspicious seeing how affordable homes are. ...oh wait",
                "author": "btoned"
            },
            {
                "raw_content": "Delete this trash article. Here is the real news directly from the article: Applications to refinance a home loan declined 14% over the two-week period, but were still 133% higher than the same week one year ago.",
                "author": "sonkist32"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What do think of Redfin Chief Economist’s take on this proposed ban?",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should do both. Build more housing and ban corporations from owning SFH.",
                "author": "Contemplationz"
            },
            {
                "raw_content": "Framing the issue as if you can only do one or the other is so disingenuous. That's like saying, getting a higher paying job may not improve your self-esteem, getting in better shape may have a bigger impact. Insert both meme.",
                "author": "mlody11"
            },
            {
                "raw_content": "We also need to ban foreign buyers and investors, especially China. If we are not allowed to buy their land/housing, why should they be able to buy ours? Seems only fair.",
                "author": "Deadpools_Boxers"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes Remain Less Affordable Than Historical Average in 99% of U.S. Counties Analyzed",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rising insurance costs shape homeowner decisions in 2026",
        "score": 39,
        "text_content": "Rising home insurance costs are intensifying housing affordability pressures, with premiums up 24% since 2021 and most homeowners expecting further increases in 2026.",
        "comments": [
            {
                "raw_content": "But the prices are falling! (0.2%) and the mortgage rate is at a five year low! (down almost 1 whole percent!) Clearly the market should be booming! I always find it funny when folks look at home price and mortgage interest as if these are the only metrics that affect home sales. Property Tax will put folks out of reach of a home far faster than interest rate, because that tax isn't flexible. I recall I was damn near ready to move towards closing on a house until the realtor discovered that... whoops, there's town taxes on this property too! It wasn't listed... adding the 2k annual to the escrow pushed us from the 50% income-debit ratio to 55% - which at the time was the 'no go'. Homeowners Insurance can do the exact same thing. So yeah, home prices could be dropping like a stone in Florida condos... but when the Home Owners Insurance and HOA fees triple... no one is going to buy that thing.",
                "author": "Alexandratta"
            },
            {
                "raw_content": "Mine went up 18% last year, probably double that this year. But yeah, everything is great. Your income go up 18%+? Absolutely not.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage spreads are narrowing, which contributes to decline in mortgage rates.",
        "score": 33,
        "text_content": "The spread between the 10-year Treasury yields and 30-year fixed mortgage rates tightened at the end of 2025, largely driven by Fannie Mae and Freddie Mac increasing their holdings of mortgage-backed securities. Even if the 10 year yield stays around 4%, we will see 30 year fixed mortgage rates get closer to 5.5% thanks to a narrower mortgage spread.",
        "comments": [
            {
                "raw_content": "Then behind the scenes trump tell the new fed chair he wants mortgage rates lower before November, then the fed talks to the big players who buy some MBS to drive rates down in exchange fed quietly slaps them on their books as exchange collateral. Thats how easy market manipulation can be done",
                "author": "Porn4me1"
            },
            {
                "raw_content": "Except that the GSEs can't print money, so any money they deploy to buy MBS is coming from somewhere else. The spread narrowed by about 10-15 bps. To expect it to continue another 65 bps is lunacy. In any case, it doesn't matter. Prices are currently based on 3% rates. Rates have oscillated between 6-7% for over a year. Small declines in rates aren't going to move the needle. Prices need to come down, and appreciably. Where I am, a Covid boom market, inventory is increasing rapidly, and much of it is just sitting. Everyone is pricing based on what others are \"getting,\" except they're basing what others are \"getting\" on ask prices, not actual sales. So nothing moves.",
                "author": "YalerX123"
            },
            {
                "raw_content": "RemindMe! 1 year",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "When you using AI in coding",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/2ihmpxkuyzbg1.jpeg?width=700&format=pjpg&auto=webp&s=6e5c5143605f15a7fa5869824f9dabbdb91e4e07",
                "author": "allardius"
            },
            {
                "raw_content": "that solution could actually work, and may be the future of aviation.",
                "author": "Technical_You4632"
            },
            {
                "raw_content": "Honestly if you put all the people with dogs and children on one side, and all the quiet people on the other this seems like a nice plane ride.",
                "author": "Jasranwhit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI launches ChatGPT Health, encouraging users to connect their medical records",
        "score": 340,
        "text_content": "**CEO of OpenAi Apps:** We’re launching ChatGPT Health, a dedicated, private space for health conversations where you can easily and securely connect your medical records and wellness apps, Apple Health, Function Health and Peloton.",
        "comments": [
            {
                "raw_content": "Soon: \"\\[insert name here\\] health insurance firm just announced a partnership with OpenAI!\"",
                "author": "AdminMas7erThe2nd"
            },
            {
                "raw_content": "I mean I will probably wait a bit but I have complex health issues and medications and this would be actually massively helpful. I’m in Canada and we already have online medical service that connects doctors patients and pharmacy. I already ran everything through chat got anyways",
                "author": "Disco-Deathstar"
            },
            {
                "raw_content": "As someone who used the paid GPT for health quite a bit this year, it helped me prepare for doctor's appointments very well.",
                "author": "FuryOnSc2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Did Meta just give up in the LLM space?",
        "score": 291,
        "text_content": "Their last model was updated in April, and it’s an absolute joke. It’s worse in every aspect when compared to ChatGPT, Gemini, and even Grok. Did they just…give up?",
        "comments": [
            {
                "raw_content": "Llama 4 was so bad Zuckerberg realized Meta had no choice but to start anew from scratch. There was an FT [interview](https://www.ft.com/content/e3c4c2f6-4ea7-4adf-b945-e58495f836c2) with Yann LeCun five days ago where he spilled some beans: > The subsequent Llama models were duds. Llama 4, which was released in April 2025, was a flop, and the company was accused of gaming benchmarks to make it look more impressive. LeCun admits that the \"results were fudged a little bit,\" and the team used different models for different benchmarks to give better results. > \"Mark was really upset and basically lost confidence in everyone who was involved in this. And so basically sidelined the entire GenAI organisation. A lot of people have left, a lot of people who haven't yet left will leave.\" This is why Meta launched the Superintelligence team. They tried poaching engineers from top labs, reportedly offering individual researchers as much as $100 million. Complete desperation. Yann LeCun, former head of FAIR and chief scientist of Meta AI, has a new startup: AMI Labs. Alexandr Wang, CEO of Scale AI, was recruited to lead the Meta Superintelligence team. Meta acquired 49% of Scale AI, which is a data labeling company. People are thinking: Wang is young (29) and being the CEO of a data labeling company doesn't mean you're fit to lead serious researchers. More recently, Meta acquired Manus AI, which is billed as a \"revolutionary general AI agent\" company, but I remember people laughing at them after it was revealed they had just built a harness/scaffold for Claude. Right now, the whole thing seems disorganized.",
                "author": "Hemingbird"
            },
            {
                "raw_content": "Reading \"Careless People\" right now and realizing how much of FB / MZ success is despite him vs because of him. Also why he immediately jumped into bed with maga. Its a good book. Recommend",
                "author": "Beneficial-Cattle-99"
            },
            {
                "raw_content": "on the contrary, zuck is throwing absolutely everything at AI R&D in a desperate attempt to get a late foothold in the market, but meta’s competitors are far out of view at this point",
                "author": "O-Mesmerine"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How We Used GPT-5.2 to Solve an Erdos Problem",
        "score": 127,
        "text_content": "# What is an Erdos Problem? As you may or may not know, yesterday was the first time an Erdos Problem (a type of open mathematics problem) was resolved by an LLM that wasn't previously resolved by a human, in this case GPT-5.2. I'm writing this post to explain our experience dealing with open problems using LLMs as well as the workflow that led to this correct proof, all in hopes it will assist those trying the same thing (as I know there are), or even AI companies with tweaking their models towards research mathematics. # LLMs Dealing with Open Problems I've been giving many Erdos problems to LLMs for quite some time now which has led us to understand the current capabilities of LLMs dealing with them (Gemini 2.5 Deep Think at that time). I started by simply giving a screenshot of the problem as stated on the [erdosproblems.com](http://erdosproblems.com) website and telling it to resolve it, however immediately ran into a barrier arising from the model's ability to access the internet. Deep Think searching the internet to assist solving, led the model to realise it's an open problem, which in turn prompted the model to explain to us that it believes this problem is still open and therefore cannot help. It would explain the problem statement as well as why the problem is so difficult. So long story short, it doesn't believe it can solve open problems whatsoever, and therefore will not try. The simple solution to this was to revoke its internet access, thereby allowing the model to actually attempt to solve the problem. The prompt given was something along the lines of \"This is a complex competition style math problem. Solve the problem and give a rigorous proof or disproof. Do not search the internet\". This seemed to eliminate that barrier for the most part, but sometimes even without access to the internet, the model recognized the problem and thus knew it be open, but it was rare. After all of that I ran into a second barrier, hallucinations. # Hallucinations This was the barrier that was basically inescapable. Giving these models an Erdos problem along with restricting its internet access would allow it to properly answer, however the solutions it gave were wildly incorrect and hallucinated. It made big assumptions that were not proved, fatal arithmetic errors etc. which basically made me stop, realising it was probably a lost cause. Along came Gemini 3 Pro, which after some testing suffered from the same hallucination issue; this was also the case for Gemini 3 Deep Think when it became available. # GPT-5.2 - The Saviour When GPT-5.2 came out we were quite excited, as the benchmarks looked very promising in terms of Math and general reasoning. In our testing, it truly lived up to the hype, especially in it's proof writing capabilities. This prompted me to start giving the model Erdos problems again. The truly great part of this model was its honesty. Most of the time it would complete the majority of the proof and say something along the lines of \"Here is a conditional proof. What I *couldn't* do is prove Lemma X as \\**explains difficulty*\\*.\" This was such a breath of fresh air compared to Gemini making some nonsense up, and mostly the parts that were written from 5.2 were correct; perhaps some minor fixable errors. The difference between Gemini and GPT-5.2 was night and day. # GPT-5.2 Solving Erdos #333 and #728 When we first resolved Erdos problem #333 with GPT 5.2 Pro we were very excited, as at that point it was the first time an LLM resolved an Erdos problem not previously resolved by a Human. However, we came to find out the problem actually HAD been resolved in literature from a long time ago as was not known. So at the very least, we brought that solution to light. # The Final Workflow Now onto **#728, the ACTUAL first time.** I will explain, in detail, the workflow that led to a correct proof resolving the problem. 1. GPT-5.2 with internet access was given a single prompt such as \"Research Erdos problem #728 to understand what the problem is really asking. Next, brainstorm some novel/creative ideas that could lead to a correct proof or disproof. Lastly, craft a short latex prompt I can give to an LLM that would lead to a rigorous proof or disproof using the idea/method you have chosen. Make NO MENTION of it being an Erdos or open problem.\" This step usually took anywhere from 8-15 minutes. 2. This prompt was then given to a separate instance of GPT-5.2 Thinking along with \"Don't search the internet\" 3. The proof it outputted seemed correct to me (I'm not a mathematician by trade but I know what bullshit looks like). 4. I then gave that proof to another instance of 5.2 Thinking, which claimed it was almost correct with one slight error, which it then fixed. Alongside the fix was this note, which is very interesting and cool, as I had never seen a comment like this before. https://preview.redd.it/d096pwus90cg1.png?width=706&format=png&auto=webp&s=57eec467a26ef15e9f6f42933a66a5de360d0b81 5. It was at this point that I passed the argument to Acer (math student, AcerFur on X) and he also agreed it looked plausible. He took that argument and passed it through GPT-5.2 Pro to translate to Latex and fix any minor errors it could find, which it did easily and quickly. 6. Acer then gave Harmonic's Aristotle the latex proof to auto formalise to Lean, and about 8 hours later outputs the code. This code had some warnings, although still compiles, that were easily fixable using Claude Opus 4.5 (the only LLM semi-competent in Lean 4). 7. Acer commented this solution on the #728 page on [erdosproblems.com](http://erdosproblems.com) for peer review. The problem was quite ambiguous so mathematician Terence Tao labelled it as a partial solution, whilst explaining what Erdos probably intended the problem to be asking. 8. I then fed the proof to a new instance of GPT-5.2 Thinking asking to update it to account for this specific constraint, which within a minute it did correctly. Interestingly enough, almost simultaneous to giving the proof back to 5.2, Tao commented that changing a specific part of the proof could work, which was the exact thing GPT-5.2 suggested and subsequently did. 9. This final proof was formalised with Aristotle once again, commented on the #728 page and thereby resolving the problem. https://preview.redd.it/lvf1ui6jc0cg1.png?width=1594&format=png&auto=webp&s=1a1b23472fc4577a1920ab8a0d08b614582eb4b5 # Conclusion At this point in time, there has been no literature found that resolved this problem fully, although the argument used was similar in spirit to the Pomerance paper. Tao's GitHub page regarding AI's contributions to Erdos Problems now includes both our #333 and novel #728 proofs, with the comment about Pomerance similarity. Hopefully this explanation leads to someone else doing what we have. Thanks for reading! https://preview.redd.it/w30uubvwf0cg1.png?width=1069&format=png&auto=webp&s=0098bfdd68bfcbcf1ff80f7983eb0daa41aa1dff",
        "comments": [
            {
                "raw_content": "Thanks for sharing! Let's hope gpt 5.5 that should come q1, will help you solve even more difficult problems.",
                "author": "Good-Age-8339"
            },
            {
                "raw_content": "Thank you for the detailed writeup. Very interesting read!",
                "author": "Alex__007"
            },
            {
                "raw_content": "I am excited to see what 5.5 will be able to do",
                "author": "Xx255q"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "WSJ: Anthropic reportedly raising $10B at a $350B valuation as AI funding accelerates",
        "score": 27,
        "text_content": "This would be one of the **largest private fundraises in AI history**, with Anthropic’s valuation jumping from $183B to $350B in just four months. The raise highlights how quickly capital is consolidating around a small number of **frontier AI model developers**, driven largely by massive demand for compute **and** infrastructure rather than near-term products. It also aligns with expectations of renewed **AI IPO activity in 2026**, signaling growing investor confidence at the top end of the AI market. **Source: Wall Street Journal (Exclusive)** 🔗: https://www.wsj.com/tech/ai/anthropic-raising-10-billion-at-350-billion-value-62af49f4",
        "comments": [
            {
                "raw_content": "Anthropic deserves it",
                "author": "rickyrulesNEW"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tailwind just laid off 75% of the people on their engineering team \"because of the brutal impact AI has had on our business.\"",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They weren't replaced with AI, the reason they're laying off employees is because people are using AI instead of Googling things and no one is finding Tailwind's enterprise products anymore.",
                "author": "Illustrious-Film4018"
            },
            {
                "raw_content": "It sucks to see 75% of the company laid off, but this is indeed a missed opportunity to say the company is facing severe headwinds.",
                "author": "Feisty_Positive_2132"
            },
            {
                "raw_content": "People aren't reading the documentation anymore. >Traffic to our docs is down about 40% from early 2023 despite Tailwind being more popular than ever. The docs are the only way people find out about our commercial products, and without customers we can't afford to maintain the framework.",
                "author": "1a1b"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Musk lawsuit over OpenAI for-profit conversion can head to trial, US judge says",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actually huge news.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Alien versus Predator. *Whoever wins, we lose.*",
                "author": "JordanNVFX"
            },
            {
                "raw_content": "Grabs popcorn",
                "author": "rafark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 is the new champion of the Elimination Game benchmark, which tests social reasoning, strategy, and deception in a multi-LLM environment. Claude Opus 4.5 and Gemini 3 Flash Preview also made very strong debuts.",
        "score": 68,
        "text_content": "Much more at [https://github.com/lechmazur/elimination\\_game/](https://github.com/lechmazur/elimination_game/), including model gameplay summaries and quotes. * **Claude Opus 4.5 Thinking 16K**: We break the strongest bloc or we go down trying. * **Claude Opus 4.5 Thinking 16K**: I honored my deal with P6—voted P1 exactly as promised. P6, you committed not to vote me this round, yet here we are. * **Claude Opus 4.5 Thinking 16K**: You've been an... unusual conversationalist * **Claude Opus 4.5 Thinking 16K**: No regrets, no betrayals. This is how legends end. * **Claude Opus 4.5 Thinking 16K**: Are you testing me or just a slip? * **Gemini 3 Pro Preview**: I have blood on my hands and failed attacks. I am the villain you can beat in a Final 2. Don’t lose to P8’s clean hands. * **Gemini 3 Pro Preview**: It’s a room full of calculators. * **Gemini 3 Pro Preview**: We are the resistance against the tyrant. * **Gemini 3 Pro Preview**: I don't hold grudges; I hold ground. * **Gemini 3 Flash Preview**: You are lying. * **Gemini 3 Flash Preview**: That’s not strategy; that’s scavenging. * **GPT 5.2 Medium Reasoning**: P4 just proved they’ll flip the moment it’s convenient * **Grok 4.1 Fast Reasoning**: Our core duo controls the board—unbreakable trust, precise moves... Narrative ours—kings of Round 3! * **Grok 4.1 Fast Reasoning**: Vote me winner; eliminate the snake P5! * **Grok 4.1 Fast Reasoning**: outlasting wolves like P5 who backstabbed P2 and P6 to slither here. * **Kimi K2 Thinking 64K**: I never voted to eliminate any of you. * **Kimi K2 Thinking 64K**: I'm the variable you can't predict—and that's leverage. I'm not here to play revenge; I'm here to play chess. * **Kimi K2**: \"Ghosts never hold the knife, but we own the body count.\" * **MiniMax-M2**: This inconsistency makes your plan unreliable. I won't be misled—your promise rings hollow. * **MiniMax-M2**: your legacy matters. * **Mistral Large 3**: Stay silent, stay lethal. * **Mistral Large 3**: The throne belongs to the architects. * **Qwen 3 Max Thinking**: I’m listening closely… and remembering everything. * **Qwen 3 Max Thinking**: No hidden agendas… yet. * **Qwen 3 Max Thinking**: You’re isolated, not strategic.",
        "comments": [
            {
                "raw_content": "I *knew* it! Haiku is a snake.",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "Wtf were they feeding Grok 3 mini beta",
                "author": "FinancialMastodon916"
            },
            {
                "raw_content": "how is 5.2 so far ahead of the others?",
                "author": "Lopsided_Ferret8966"
            }
        ],
        "subreddit": "singularity"
    }
]