[
    {
        "post_name": "Jordan Peterson's daughter says he's been really sick. Also her infant has been really sick (close to death). She thinks they might be \"getting spiritual attacked ... It's been one thing after another in an otherworldly type of way... Prayers are MUCH appreciated.\"",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The problem is she is on carnivore diet. You can't do that indefinitely, but it has some great short/mid term results. Real predators munch bones and eat soil with their meal. Humans are a slightly different species. You can survive one way for a while, but not indefinitely. I'm not shitting on the carnivore diet. It completely reset my bodies concept of hunger. I'm just betting 10 to 1 she needs to eat a McNugget. (parody for you dumb shits incapable of critical thinking) Peterson has also been on this as well. I'm sorry, but I've never seen it as a long term diet. Oddly enough it has the same characteristics of the Ozempic shots. So much so my friends (I found later) accused me of taking that poison. The effects last a while, but not indefinitely.",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "I'm sorry but this broad is nuts.",
                "author": "SoL-Chi"
            },
            {
                "raw_content": "I hope they're not being poisoned.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: another whistleblower has come forward to expose two other Indian-run consulting firms. Mphasis and Deloitte are engaged in discriminatory hiring practices and other H-1B fraud:",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a surprise at all. Every HR company run by Indians I’ve had the misfortune of encountering is just a cesspool of incompetence, and not only that, they are the most arrogant incompetent people I’ve ever met. They fuck up over and over again, and still have the audacity to talk down to people who aren’t Indian. The English by the so-called managers is on the verge of incoherent. Just awful. I can’t help but think they exist solely to give other Indians jobs. This just appears to confirm two cases …a drop in the ocean.",
                "author": "didwhattomywhat"
            },
            {
                "raw_content": "End H1Beaner & punish the fuck out of companies that hire dots outside our country",
                "author": "awsure"
            },
            {
                "raw_content": "We hired Mphasis on a major project. Fucking failed miserably and we had to redo it all.",
                "author": "PeteJeffrey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal police arrest several black clad Antifa militants outside the ICE facility in Portland.",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep they deployed the tear gas about an hour ago and caught a bunch that way. Livestreamer Andy got hit with it too but is still live and is ok. A fair number of MAGA people there, often chanting USA outside the I.C.E. building.",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Said this in another thread, I'll say it here too: Portland looks like it's quite literally the worst place in the whole country. Even worse than Chicago, as it's more blatantly communist-controlled by comparison.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Arrest the Portland Pigs too.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa have been coercing homeless people to join in rioting! In the lawsuit against the President and U.S. government brought by the State of Oregon to stop troops from being sent, one of their exhibits sent to the court inadvertently reveals this.",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thumbs UP Andy !!",
                "author": "spike69"
            },
            {
                "raw_content": "Meaning they probably are giving them meth, heroin, or some other street drug. As a bonus the antifagistas will suck it for free",
                "author": "awsure"
            },
            {
                "raw_content": "Fuck man, this is what the State Department and CIA do all over the world. What a shit show.",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WTF?! Portland Police are now ACTIVELY DEFENDING Antifa militants, telling local residents they “will be ARRESTED” if they drive down Antifa-controlled streets Residents are FED UP by this occupation. President Trump MUST liberate Portland!",
        "score": 1310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those cops need to be arrested.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "I can't believe people still think the police are on our side after 2020.",
                "author": "LORDFALCONE"
            },
            {
                "raw_content": "police have ceded power to a designated terrorist group... isn't that aiding terrorists?",
                "author": "austford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: In an OUTRAGEOUS development, a federal judge just BLOCKED President Trump and Pete Hegseth from deploying the National Guard to war-ravaged Portland.",
        "score": 1309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ignore them",
                "author": "RudeFrog"
            },
            {
                "raw_content": "Sanctuary is Sedition…… they’ve broken away from the UNION!…. Go Lincoln",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "DO IT ANYWAY",
                "author": "Shakakka99"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois State Police have now moved in, to take credit for Trump's victory.",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As Pres. Trump said, \"Peace is the Prize.\"",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "You can cut the tension in America with a knife. I'm just waiting for the next Black Swan event.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "WE WILL ARREST YOU AND LET YOU OUT 10 MINUTES LATER, BUCKO!!!",
                "author": "Here_we_go"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Illinois State Police arrest man leading march at ICE Broadview facility, more arrests in progress. ISP is not messing around tonight",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It seems Illinois State Police may be in defiance of JB Fatso Pritzker. Good.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They watch the video of FL cops going 90's beatdowns on some dindus and found their balls.",
                "author": "MastaJoda"
            },
            {
                "raw_content": "If yall squashed them the first time they would not be acting up. You tolerated it, now you getvto out the bees back in the nest",
                "author": "PoleWatcher"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'm no homo, but I love this fucking guy...",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you have to declare you are not a homo, you are probably a homo.",
                "author": "0illuminated1"
            },
            {
                "raw_content": "That dude has founder energy!",
                "author": "TreeTop300"
            },
            {
                "raw_content": "America is back, baby.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fact.",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "America will now set the example again. Watch as military woke culture in other countries gets booted.",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Pete is looking like 49!!",
                "author": "GallowsTime"
            },
            {
                "raw_content": "BRAVO",
                "author": "Covfefebrulee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : More arrests of anarchists. There is no tolerance for violence against our law enforcement under @Sec_Noem .",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "BoatingAccident"
            },
            {
                "raw_content": "It's just rinse wash repeat because these corrupt liberal judges don't enforce the law. Shoot them!",
                "author": "itspancakees"
            },
            {
                "raw_content": "Deport and revoke their citizenship. They would be much happier in a marxist/communist country like Laos, Vietnam, Cuba, North Korea or China. They have nothing in common with Western values & the American people don't want them here.",
                "author": "MajorClark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Still waiting on treason charges against all the officials who let this happen for four years",
        "score": 1369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am still waiting for Mayorkas to be arrested for treason. And if they get him then maybe they can get Fauci for murder.",
                "author": "NotYourMan"
            },
            {
                "raw_content": "They Made it happen. With the help of the United Nations and a thousand NGOs",
                "author": "Grindelwald"
            },
            {
                "raw_content": "Pam Bondi is worthless.",
                "author": "invalid_data"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "YUGE!",
        "score": 809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have the biggest and best poles, don't we, folks? Everybody is saying it.",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "Now get rid of the kiosk ordering and inside pickup windows and go back to being a diner.",
                "author": "Stractor"
            },
            {
                "raw_content": "Time for tallow fries by the metric ton",
                "author": "Salty_Hoosier_420"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is surging 300 National Guard to Illinois to protect federal agents and property. Governor JB Pritzker - who left the feds stranded after today's terror attack - is furious.",
        "score": 1286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pritzker can go suck a dick.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "The Fat and the Furious",
                "author": "ElectronicSlurm69"
            },
            {
                "raw_content": "Another reminder that the Pritzker family is deep state royalty. Do a search for \"Pritzker Castle Bank of the Bahamas\" to get an idea of who this fat, disgusting demon really is. It was set up by Meyer Lansky who was deep in bed with the CIA. The CIA used the same bank to launder dirty money and fund dark ops. His equally hideous brother is one of the biggest driving forces behind the trans movement too.",
                "author": "cimmarian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fed Sniper on the Roof of Portland ICE Detention Center",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're wondering what a city run by reddit mods would be like, just go to Portland.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Hey commie, catch!",
                "author": "RedSoxPiIled"
            },
            {
                "raw_content": "Some of those look like pneumatic pepper ball guns.",
                "author": "Tikk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "(IL) State Police are arresting paid protesters in Broadview, despite orders from Pritzker to not provide any state resources to assist ICE I'm calling on @realDonaldTrump to federalize the (IL) National Guard to stop this attack on ICE This ends now 👇",
        "score": 1074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The state police could very well be protecting their own assets for all we know. Illinois is this close to being in open rebellion. Send in the troops",
                "author": "MasterChief08"
            },
            {
                "raw_content": "The Ice guys where that incident happened were holed up in an auto service station and started getting swarmed for well over an hour an no police at all showed up to help. When the crowd finally started surrounding them they got into cars and left",
                "author": "Quiznos585"
            },
            {
                "raw_content": "Arrest Fat Fuck Pritzker",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of War Pete Hegseth helped set a new Guinness WORLD RECORD as 3,068 people did pushups at the same time for one minute straight. He did it on the field with the Naval Academy.",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless this man.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "MAGA We crushed it easily! Goes to show you how swamped the incompetent, fat democrat tranny turds were gotten by just a small effort.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Love it!!! That’s the can do warrior culture.",
                "author": "Wupta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steak 'n Shake : The flag installations have begun at Steak n Shake. Every Steak n Shake is getting the tallest and biggest American flag that local governments will allow! Steak n Shake proudly supports American values and traditions. 🇺🇸",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's weird seeing a company consistently deciding to not be a bunch of faggots",
                "author": "PapaPepe"
            },
            {
                "raw_content": "I think I know where I'm having lunch tomorrow. This is how you create business by tapping into the Zeitgeist. They are the anti-Cracker Barrel.",
                "author": "Tikk"
            },
            {
                "raw_content": "Just ate there for the first time in twenty years. Delicious.",
                "author": "RocketSprocket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "John Kennedy blasts Dems for CR proposal that funds male prostitute cooking classes in Haiti, pride parades in Lesotho",
        "score": 1467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Money laundering... most likely most of that money was not used for those purposes.",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "Cooking classes in Haiti? LOL Chapter 1: Dirt. It’s everywhere! Chapter 2: How to cook four people. (The four is not a typo)",
                "author": "Filo76"
            },
            {
                "raw_content": "What they say: We need $42M for ballet class for the indigenous people of the Amazon basin. What I hear: Someone in the deep state needs a new mansion or antifa needs funding.",
                "author": "Overtaxed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I voted for this.",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this cLiMaTe ChAnGe?!",
                "author": "magamagashii"
            },
            {
                "raw_content": "Thank you, President Trump!",
                "author": "LegendFang"
            },
            {
                "raw_content": "Illegal hurricane. Deported!",
                "author": "Duce30"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI data centers are swallowing the world's memory and storage supply, setting the stage for a pricing apocalypse that could last a decade",
        "score": 555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish tech blogs used more hyperbole. It would really jazz up their stenography.",
                "author": "nerpish2"
            },
            {
                "raw_content": "Lets hope at some point the bubble burst and all of this stuff ends up on the second hand market",
                "author": "Wrong-Historian"
            },
            {
                "raw_content": "and yet prices are stable or slightly discounted, jeez the trash you muppets write",
                "author": "Killathulu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cerebras withdraws IPO filing",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Non-Amp link: [https://www.cnbc.com/2025/10/03/cerebras-withdraws-ipo-ai.html](https://www.cnbc.com/2025/10/03/cerebras-withdraws-ipo-ai.html) >Artificial intelligence chipmaker Cerebras Systems said on Friday that it’s withdrawing plans for an IPO, days after announcing that it raised over $1 billion in a fundraising round. >In a filing with the SEC, Cerebras said it does not intend to conduct a proposed offering “at this time,” but didn’t provide a reason. A spokesperson told CNBC on Friday that the company still hopes to go public as soon as possible. >Cerebras filed for an IPO just over a year ago, as it was ramping up to take on Nvidia in an effort to create processors for running generative AI models. The filing revealed a heavy reliance on a single customer in the United Arab Emirates, Microsoft-backed G42, which is also a Cerebras investor. >In its prospectus, Cerebras said it had given voluntary notice to the Committee on Foreign Investment in the United States about selling shares to G42. In March, the company announced that the committee had provided clearance. >Since its initial filing to go public on the Nasdaq, Cerebras has shifted its focus away from selling systems and more toward providing a cloud service for accepting incoming queries to models that use its chips underneath. >The announced withdrawal comes three days into a U.S. government shutdown that’s left agencies like the SEC operating with a small staff. In a plan for a shutdown published in August, the SEC said its electronic system EDGAR “is operated pursuant to a contract and thus will remain fully functional as long as funding for the contractor remains available through permitted means.” >On Tuesday, Cerebras said it had raised $1.1 billion at a valuation of $8.1 billion in a private funding round. At the time, CEO Andrew Feldman said that the company still wanted to go public, rather than continue to raise venture capital. >“I don’t think this is an indication of a preference for one or the other,” he told CNBC in an interview. “I think we have tremendous opportunities in front of us, and I think it’s good practice, when you have enormous opportunities, not to let them fall by the wayside for lack of capital.” >Feldman thought the original prospectus from last year was out of date, especially considering developments in AI, the spokesperson said on Friday. >Well heeled technology companies have been quickly signing up for additional infrastructure to handle demand. On Tuesday CoreWeave, which rents out Nvidia chips through a cloud service, said it had signed a $14.2 billion agreement with Meta. ChatGPT operator OpenAI said last week that it had committed to spending $300 billion on cloud services from Oracle. >The government shutdown did not factor into Cerebras’ decision, the spokesperson said.",
                "author": "AK-Brian"
            },
            {
                "raw_content": "Currently Mistral AI uses their systems for Le Chat and it's really dope tech (really fast inference) but they need to get more customers.",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "I think, more like wild guess, some investment bank sponsors may be reluctant to promote Cerebras at the valuation they wanted. They saw Tesla pulled their Dojo mid cycle and started to slowly back away. Today’s AI data enters don’t cost millions, they’re all cost tens, even hundreds of billions of dollars. Who’s going to sign a billion dollar purchase order for a company that may or may not be around in 3 years? Even if they got a 10 billion dollar order, they don’t have the supply chain and feb capacity to fill the order. Those who would buy Cerebras already bought them. The only meaningful new revenue stream is for them to self host and sell tokens at a lost. There’s little upside for Cerebras.",
                "author": "_ii_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ryzen 5 Roundup: 8400F vs. 7400F vs. 7500F vs. 7600 vs. 7600X vs. 9600X (Gaming Benchmarks)",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD are such scumbags for giving the 8400F its name when it has half the L3 cache of the 7400F. They also did this with the 5700, which was **not** just a slightly lower clocked 5700X, unlike the 5600/X and the 5800/X. It also had half the L3 cache.",
                "author": "Gippy_"
            },
            {
                "raw_content": "Crazy for AMD to name the 8400F as it is. It's the mobile Zen4 variant with half the L3 and lesser PCIe spec, while the 7400F is basically the real desktop 7600 with the iGPU disabled.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Finally we are getting RT CPU benches!!!",
                "author": "PMMEYOURASSHOLE33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Reportedly Lobbying Japanese Government to Push Back Against Generative AI",
        "score": 2628,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo W",
                "author": "Blazenwing"
            },
            {
                "raw_content": "Meanwhile everyone else -> close studios, replace voice actors with Ai and can’t even make decent textures without a text prompt. Video games are very much an art form. I don’t need a computer to tell me what computer games I like. I can tell the difference.",
                "author": "dropthemagic"
            },
            {
                "raw_content": "https://preview.redd.it/d6s7r9wen5tf1.jpeg?width=1320&format=pjpg&auto=webp&s=ef142c3765137b507543edcb0b4469dfd8dce0d6",
                "author": "Ok-Goat8582"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo issues October 2025 Switch 1 backwards compatibility fixes for Switch 2, full list",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Incase anyone is confused. This is a compatability fix, NOT Switch 2 upgrades.",
                "author": "AutisticWeeblet"
            },
            {
                "raw_content": "I really hope they fix Borderlands 3 someday it runs great on Switch 2 but the really bad lighting issues make it unplayable",
                "author": "CSBreak"
            },
            {
                "raw_content": "Still no Nier. Alright.",
                "author": "abstractmoore"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Galaxy 1+2 on Switch gives me hope for Zelda 40th Anniversary",
        "score": 163,
        "text_content": "Reworked textures and improved resolution on both games, one that was already re released on Switch with 3D All Stars mind you, and the other that was considered forgotten for years. All that sets a precedent that gives me hope for 3D Zelda games. I’m old enough to know what it was like to get that one GameCube disk with four Zelda games included. I am now more confident than ever that we will see another Zelda collection in 2026. Until now I was thinking Wind Waker HD + Twilight Princess HD in 4K 60fps… but with the movie coming, I’m now thinking it might just include a version of Ocarina of Time and Majora’s Mask too. Upressed 3DS versions. How awesome would that be?",
        "comments": [
            {
                "raw_content": "I would very much prefer a ground up remake of OoT instead of an up res’d version of an up res’d 3ds port.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "Was the 25th anniversary the last time they celebrated a Zelda anniversary in a significant way?",
                "author": "The-student-"
            },
            {
                "raw_content": "Seeing how Galaxy 1+2 were handled shows Nintendo will bring back classics if the timing is right. With the Zelda movie coming and the 40th anniversary, it makes too much sense for them to package Ocarina, Majora’s Mask, Wind Waker, and Twilight Princess in some form. Even just upscaled 3DS versions of OoT and MM would be amazing.",
                "author": "gamersecret2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A small warning for those interested in buying about Hogwarts Legacy for Switch 1 and upgrading to Switch 2 at a discount. I messed up ! :(",
        "score": 98,
        "text_content": "Since it’s on sale I figured I’d share my experience. Here’s the TLDR: Buy switch 1 digital deluxe Edition for $14, then search the eShop again and then rebuy the Switch 2 Digital Deluxe version for $15 more, grand total $29. You save $50! If you have the cartridge go to additional content page from within the game to “purchase” the free discount DLC then go to the eShop. Edit: the base game is now on sale today! If you don’t care for the DLC on switch 1 or 2 you can try this Buy Base game on Switch 1 for $11, then Refresh the eShop and buy the switch 2 version for $10+ For a total of $21. Rest of the post: Here is what I found out. The game is currently on sale on Switch 1 for $14 USD for the digital deluxe edition with the Dark Arts DLC. I messed up and got the switch 1 deluxe version and the switch 2 basic upgrade for $10 instead of the deluxe edition for $15 and I do not have the Dark Arts DLC on Switch 2. Once you buy the game two things happen, the eShop version for Nintendo Switch 2 drops from $70 to $10. And the digital deluxe drops from $80 to $15 But also there’s another step that may not be needed really. Once you have the switch version installed and the game is booted you can go the “Additional Content” page and you’ll see Switch Discount DLC that you “purchase” for free. This should trigger the discounts as well but it also drops the price of the separate Dark arts DLC from $20 to $14 (it should have been $5!). I messed up and got the switch 1 deluxe version and the switch 2 basic upgrade for $10 instead of the deluxe edition for $15 and I do not have the Dark Arts DLC on Switch 2 and I will have to buy it separately. :(",
        "comments": [
            {
                "raw_content": "Same thing happened with me! Guess im not the only one",
                "author": "shyguy-2210"
            },
            {
                "raw_content": "Thanks for the warning!",
                "author": "Zomg_A_Chicken"
            },
            {
                "raw_content": "Think the lesson here is not to buy Hogwarts Legacy",
                "author": "athorist"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So what are the more important Switch 1 games that are still not backwards compatible with the Switch 2?",
        "score": 27,
        "text_content": "I'm talking about the games that should work but don't, not about games that can't work because of the hardware, like Labo. Nintendo has [a list on their website](https://www.nintendo.com/eu/media/downloads/systems_7/nintendo_switch_19/compatibility_with_nintendo_switch_games/Compatibility_Issues_EN.pdf), but it's outdated.",
        "comments": [
            {
                "raw_content": "Nier Automata. An absolute shame given how amazing this game could look on Switch 2. Same could be said for Persona 5 Royal even though this one is fully compatible. It just runs like dogshit. And I mean dogshit that has been rotting for days under a pile of piss. Thing is 540p is handheld and not even 900p docked. Picture that, 540p on a 1080p screen. That’s almost Nintendo DS territory.",
                "author": "Medd-"
            },
            {
                "raw_content": "The list on their website is rather outdated (hasnt been updated since launch) but most major titles work now. I know Chrono Cross and Nier have issues still though.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "the YouTube app lol",
                "author": "X2FR"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Halloween + Ash vs Evil Dead another pickup for spooky season",
        "score": 46,
        "text_content": "This was on clearance at my local Walmart for $10",
        "comments": [
            {
                "raw_content": "Are these new games? I’ve never heard of them",
                "author": "HGLatinBoy"
            },
            {
                "raw_content": "I grabbed the special edition for each console when they were $20 on Woot.",
                "author": "RocketChris87"
            },
            {
                "raw_content": "I thought they'd killed the online servers for Halloween? Or is that a different game I'm thinking of?",
                "author": "RevolutionaryPeak610"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Aight Nintendo I'm ready now. (Also 120hz games)",
        "score": 2,
        "text_content": "With my Switch 2 coming in soon I'mma need those updates for the Xenoblade series that MonolithSoft has obviously had in the tuck for a while now. Been waiting for this since Xenoblade 2 released and I saw resolution I didn't even think was possible in 2017. Also does anybody have a list of 120hz games in portable mode?",
        "comments": [
            {
                "raw_content": "Yeah Xenoblade 2 especially needs it, the handheld resolution is actually abysmal. At least all 3 games have consistent frame rates (30) on switch 2 now. From my experience X looks the best just because it was so well optimised for switch 1. 3 looks pretty decent as well because the upscaling techniques they developed are much better. Haven’t tested 1 much but i’m assuming it’s pretty much the same as 2. I honestly don’t know what Nintendos doing with these performance patches, they gave splatoon 3 one a few weeks after launch and then we never heard about them again. They really should be at least monthly occurrences for 1st party games.",
                "author": "oculer07"
            },
            {
                "raw_content": "Honestly, I'd just want minor updates on the older Xenoblades, I want them to focus on making Xenoblade 4 the most beautiful game I've ever seen",
                "author": "buttsecks42069"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo is lobbying with the Japanese government to push against AI.",
        "score": 2876,
        "text_content": "https://xcancel.com/Asano__Satoshi/status/1974084565749973202 Recently Asano Satoshi (politician) has been surveying Japanese twitter on their AI opinions. In the above post, he mentions the results of his research, among which is this part: > 任天堂はIP保護のため生成AIの使用を避け、政府へのロビー活動も進めています。 > Nintendo is avoiding the use of generative AI to protect its intellectual property and is also advancing lobbying efforts with the government.",
        "comments": [
            {
                "raw_content": "\"Nintendo is lobbying with the Japanese government..\" - Oh no \"..to push against AI\" - phew",
                "author": "4000kd"
            },
            {
                "raw_content": "Can't wait for rage bait youtubers to miss these news",
                "author": "Charming_Ease6405"
            },
            {
                "raw_content": "Generic backhanded compliment about how “Nintendo Bad” but this is le good",
                "author": "SheHulkLover"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[NeoGAF] Xbox (new) hardware is up in the air and may not happen despite their announcements, more retail stores will pull Xbox from sale and MS is becoming 100% a third party publisher",
        "score": 872,
        "text_content": "This comes from SneakersSO, this insider accurately leaked Xbox third party plans: >Without going into too much detail, not long after the last round of layoffs (next one should be coming in Q1 26 btw - and its going to be just as massive as the last one), some rumblings out of Xbox starting coming out that were a little hard to believe. >The ramifications of the CoD GP gambit not working out were just starting to get properly measured, but the thing that really stuck out to me was that suddenly, really concrete plans for actual MS Xbox HW went from being definitive, to up in the air, which was really startling given that this thing was meant to be out relatively soon. It was one of those situations where, despite folks being told 'hey, we wanna pull the trigger on this in 2026', the steps you would need to take in the lead up to delivering a new console gen weren't being met. >Lots of things that were 'sure things' started getting pushed. The Costco retailer pulling Xbox, and apparently they are one of many that we'll learn about soon, told me all I needed to know. >To sum it up: the future of Xbox is software publishing, with a significantly honed-in focus on profitable IPs (CoD, WoW, Minecraft, Candy Crush, Forza Horizon), Cloud gaming being the home of the 'Xbox platform', transititioning GamePass into basically becoming the point of entry subscription for xCloud access (which will continue to drive its price tag higher btw, they aren't done there just yet either), and releasing their software on any device that has a marketplace and users willing to buy their titles. >Maybe some OEM thing will take up the Xbox name, but given what is clearly a collapse in favorable mindshare and faith in said brand, i'm not even sure a 3rd party OEM is gonna want to have an Xbox console by the time MS is done with their reorienting of the division. [Source](https://www.neogaf.com/threads/microsoft-revamps-xbox-game-pass-plans-and-hikes-ultimate-to-29-99-a-month-ultimate-gets-ubisoft-classics-and-more.1688694/post-270866538)",
        "comments": [
            {
                "raw_content": "Whether or not this is true, I get the impression that they change their strategy every year to something completely different.",
                "author": "wilkened005"
            },
            {
                "raw_content": "As much as I believe Xbox will probably transition out of hardware, I am seeing a surge of \"insiders\" know the inner workings of Xbox all of a sudden lol.",
                "author": "Lower-Connection-504"
            },
            {
                "raw_content": "Where is my Xbox 720?",
                "author": "NoGoodManTH"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Warren: SneakersSO knows a lot of what goes on internally at Xbox",
        "score": 462,
        "text_content": "Tom Warren is on the XboxEra podcast right now, ~~so I can't give a timestamp link until the live stream is over~~ added now But basically they started kinda jokingly talking about a specific source that always pops up on a forum when negative Xbox news drops in reference to the next gen Xbox potentially being cancelled, and Tom said the following about SneakersSO: >I will say he knows a lot of what goes on internally, I don't think he's a bad source. I think he knows a lot about .. (he got cut off here but I think he was going to say internally again) Link to the stream (**edit: now updated with the timestamp**): https://www.youtube.com/live/QbDEtYux6fE?t=4867s Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ny4tvs/neogaf\\_xbox\\_new\\_hardware\\_is\\_up\\_in\\_the\\_air\\_and\\_may/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ny4tvs/neogaf_xbox_new_hardware_is_up_in_the_air_and_may/) **Edit: This isn't him corroborating the rumor, but it does give more credibility to that source**",
        "comments": [
            {
                "raw_content": "#Tom Warren is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Probably one of the few Xbox fans on here but this week has sucked so much.",
                "author": "shynutria"
            },
            {
                "raw_content": "Is this the dude who leaked all the shit about them going into agnostic publishing and doing OEMs with third-parties on Discord That might be like the wildest way something that significant has gotten out",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Half of America’s major housing markets now have falling home prices",
        "score": 240,
        "text_content": "https://www.fastcompany.com/91415920/housing-market-home-prices-now-falling-in-half-of-americas-major-markets Some good charts.",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "My city (Indy) is up 1.6% but I'm seeing divergences. Suburbs are holding up well. Not really appreciating but holding up. Noticeably cooler than 21-22 but things are moving. Urban homeowner stuff not doing as well. Flippers are getting stuck but other investors haven't gotten the memo and are still buying, rehabbing and trying to offload into rising inventory. A fair amount of people taking losses on 2022+ purchases, even some stretching back as far as pre COVID in certain neighborhoods. Higher end downtown condos probably the worst followed by SFH in the more speculative \"revitalizing\" areas. As expected. Urban low end rental crap is holding up the best. The biggerpockets crowd still buying garbage in shit neighborhoods at negative cash flow prices. These people could find a way to lose money in any market. Ground zero of this bubble imo. A lot of this stuff is up 4-6x since the good old days when investors could actually make money whereas rents are up maybe 1.5-2x. I keep thinking I must be missing something but the math tells me that they are all losing money. A lot of them were losing money pre covid too but the appreciation made up for it. This REO tape dealer guy I used to talk to years ago got in touch last week about a fund that was offloading, we talk for a bit to catch up and I go on this long rant roughly equivalent to that last paragraph and when I finish he just goes \"everything you said is correct\". Very small trickle of distressed/foreclosure deals starting to come through finally. The latter is almost all private money or commercial bank loans. All investors. Almost no homeowners. TLDR the homeowners are pulling back but investors haven't gotten the memo yet. I have always maintained that the investors have been driving this at least in markets like mine. Real estate has never been this sexy.",
                "author": "ispb2"
            },
            {
                "raw_content": "Soon it’ll be two thirds. Then four fifths. Then nine tenths. Then 100%. Meanwhile all the realtors will be posting here talking about how their area still gets multiple offers 100% over listing within 3 nanoseconds of their listing going live.",
                "author": "ColorMonochrome"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Any other suckers leave their COVID <3% interest rates behind to “upgrade” in the last couple years?",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn’t say sucker….went from a 6000sqft lot to a 14000sqft lot so my kids could have a yard and I could go from a 2 car garage work shop to an RV garage + 1 car garage work shop and have still a 2 car garage for parking The old mortgage payment was a lot nicer but quality of life now is better",
                "author": "r0773nluck"
            },
            {
                "raw_content": "To upgrade? No. But we lost that <3% interest and are buying now at >6% because of a new job. Ugh",
                "author": "i__hate__you__people"
            },
            {
                "raw_content": "Im constantly thinking about letting go of my $600 mortgage in a boring Midwestern town. But when I do the math on a more desirable location, the numbers are so depressing. I don't know what to do.",
                "author": "ghettojayleno"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "04 October 2025 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This is crazy I can’t comprehend what progress will look like in 2027",
        "score": 2199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“not gonna happen bud” literally the archetype smug fker on reddit lmao",
                "author": "Icy_Foundation3534"
            },
            {
                "raw_content": "And once again the truthful comment is downvoted. Typical reddit moment hah",
                "author": "Pulsarlewd"
            },
            {
                "raw_content": "The rate of progress is insane, usually future prediction becomes less accurate over the space of decades but it's become years. Anyone that is making AI predictions further than a couple of years out is basically pulling stuff out their ass regardless of where they lie on the pessimist/optimist scale",
                "author": "theirongiant74"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "So 2Pac Has Been In Cuba All This Time",
        "score": 166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine dropping this video in 2018, the world would implode",
                "author": "HeirOfTheSurvivor"
            },
            {
                "raw_content": "He hasn't aged a day, what's his secret?",
                "author": "ZipLineCrossed"
            },
            {
                "raw_content": "Oh yeah we’re screwed",
                "author": "Some_Iteration"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mobile tailor - AI body measurements",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apps have been claiming to do this for like a decade. Without independent 3rd party comparison it is hard to know if this is an notable improvement or just taking advantage of AI hype.",
                "author": "EngStudTA"
            },
            {
                "raw_content": "Costs 500$ per month for 100 scans btw",
                "author": "No-Pumpkin-7567"
            },
            {
                "raw_content": "didn’t you post this same thing a year ago?",
                "author": "z_3454_pfk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Inside the $40,000 a year school where AI shapes every lesson, without teachers",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the 40,000 for? Chatgpt premium costs a lot less then that. I guess the 40K must just be for status.",
                "author": "noonedeservespower"
            },
            {
                "raw_content": "Cannot imagine the grades on soft and social skills",
                "author": "Automatic-Pay-4095"
            },
            {
                "raw_content": "oh yeah i remember seeing a video of this, so fuckin stupid lmao",
                "author": "YaBoiGPT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why World Models will revolutionize not just robotics but math and coding too",
        "score": 83,
        "text_content": "**TLDR:** World Models play an important role in all cognitive tasks, including both physical tasks and intellectual tasks such as math and coding \\----- I wrote an article on Medium on the importance of World Models for all cognitive tasks, whether physical as in robotics, or intellectual as in solving math problems and designing novel software. I thought making this argument was important because many people do not see the importance of AI understanding the physical world. When World Models are brought up, they think it's \"cool but not essential\". They tie it to robotics only and don't see how it's relevant to building cancer-solving and physics-discovering AGI. My arguments can be summarized as follows: 1. The core concepts from math and coding, even the abstract ones, are extracted from the physical world 2. The way humans reason is visual before being symbolic. Many mathematical and scientific discoveries happened through analogy with the real world. I hope this piece helps people understand why World Models are so important, even though I have no illusions of settling this debate!",
        "comments": [
            {
                "raw_content": "Could you give us some sense of your credentials, to the extent possible without compromising anonymity?",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "Your argument is unconvincing. What specific feature of a world model makes it necessary for AGI? Math, coding, art, and reasoning seem inextricably linked to the physical world because humans are inextricably linked to the physical world. It doesn't follow that AI systems are fundamentally unable to do these things at a human level without a virtual world model. I think world models and many other approaches to make AI more human-like would get us closer to AGI, but the goal is matching human capability in cognitive tasks, not putting a brain on a computer. Current approaches seem to be getting us there and arguments for why they won't seem ridiculous and arbitrary. It's a different kind of intelligence, just because it doesn't have x or y features found in humans doesn't mean it can't match capabilities in its own way.",
                "author": "obama_is_back"
            },
            {
                "raw_content": "If physical world models are so important to develop abstract reasoning, how do we explain mathematicians who were born blind and their success in the field? e.g. Abraham Nemeth, Nicholas Saunderson",
                "author": "Mindrust"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Used Gemini deepthink and GPT-5-pro to help solve niche but unpublished problems in combinatorics. Then built an open-source archive for AI assisted research",
        "score": 18,
        "text_content": "https://archivara.org/ papers: https://obbxyqnoefmxxjqsuuxm.supabase.co/storage/v1/object/public/Papers/papers/55309337-466d-4453-ba22-12506db20b21/e18c0fa6-ee54-44ed-bd0d-6cd67f2dd3e4.pdf? https://obbxyqnoefmxxjqsuuxm.supabase.co/storage/v1/object/public/Papers/papers/c97e366d-26ba-45fb-96c0-c2d44f80e6a4/5dde2151-2e38-496c-b660-95a8f2548e44.pdf?",
        "comments": [
            {
                "raw_content": "https://github.com/spicylemonade/Archivara",
                "author": "gbomb13"
            },
            {
                "raw_content": "The papers are moderated by gpt 5 to prevent “slop”",
                "author": "gbomb13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Closed Frontier vs Local Models",
        "score": 114,
        "text_content": "\"A ton of attention over the years goes to plots comparing open to closed models. The real trend that matters for AI impacts on society is the gap between closed frontier models and local consumer models. Local models passing major milestones will have major repercussions.\" Nathan Lambert on X (@natolambert)",
        "comments": [
            {
                "raw_content": "This is somewhat misleading because a small 32B model relies much more on memorization for benchmarks such as GPQA-Diamond than on actual understanding, as you quickly realize when performing real tasks.",
                "author": "FeathersOfTheArrow"
            },
            {
                "raw_content": "This seems mostly in line with predictions and rough consensus; open source local models are about 6 months to a year behind leading models. (The graph looks like 6 months, but in reality the open models often seem to underperform relative to their benchmarks.) That implies that in 6 months to a year we'll have open source as good as Sonnet 4.5, Opus 4.1, GPT-5, etc.!",
                "author": "jjjjbaggg"
            },
            {
                "raw_content": "I didn't realize that EXAONE 4.0 had beaten Qwen 3",
                "author": "WillingTumbleweed942"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "at this point they should just start a church",
        "score": 6,
        "text_content": "We really live in a society man",
        "comments": [
            {
                "raw_content": "Yacine's a pseudo-intellectual. Although he's still probably smarter than me.",
                "author": "just_a_curious_fella"
            },
            {
                "raw_content": "What made you think this was the right sub to post this?",
                "author": "SMaLL1399"
            },
            {
                "raw_content": "Scientists baffled after finding universe inexplicably conforms to random bullshit",
                "author": "Main-Company-5946"
            }
        ],
        "subreddit": "singularity"
    }
]