[
    {
        "post_name": "BREAKING: The Active Shooter on Canfield Mountain in Coeur d'Alene Idaho has been NEUTRALIZED! @KootenaiSheriff will update more at 9:30 pm Press Conference.",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They powers that be are scrubbing his social media right now....and rebuilding it as they see fit.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "So how much you want to bet its a patsy with MAGA stickers all over \"his\" \"truck\" :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I watched the 9:30 presser. Sad statements, zero details. Norris ducked every question about the shooter and weapon found. They said a cellphone lit up where the shooter was located just before they found the body.",
                "author": "Neonentity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thanks to Chuck Schumer, Democrats were forced to read the definition of a WOMAN included in the Big Beautiful Bill.",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn’t Chuck You hospitalized recently? Did he recover after an infusion of child’s blood?",
                "author": "Filo76"
            },
            {
                "raw_content": "Imagine having to work through those tough ideas.",
                "author": "MythArcana"
            },
            {
                "raw_content": "This is great... As im sure many of you are aware, the demonrat party is a huge proponent of cultural marxism, especially transgenderism and other types of satanic queer degeneracy... Few people know this, but there is a deeper meaning to transgenderism than just grooming kids and turning them into suicidal freaks/ groomers... Want to see something that will send a chill down your spine? search a picture of the demonic idol baphomet... Notice anything? baphomet has the body of a man, and the head of the beast, female breasts and a male penis. just like a tranny.. In the normal unification of man and woman, through marriage and procreation, like God intended for us, we have new life being born. Trannies are the same principle, but a satanic inversion, a combination of male and female, with the end result being infertility and suicide usually, and often grooming/ raping more children into being trannies... The whole idea of transgenderism is a deeply satanic mockery of marriage and life as God intended for us.. Make no mistake, these democrats and cultural marxists serve only satan..",
                "author": "kanako_yasaka"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMAO Canada is fake and gay",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump: Give me Alberta and I’ll forgive you.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I believe the words were \"Canada will always play hardball with Trump.\" Ten days later...",
                "author": "DeploraBen"
            },
            {
                "raw_content": "Canada is a unique place that marries the worst features of both America and Europe together into an absolute dumpster fire of a country.",
                "author": "LordKuroTheGreat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happening now in Idaho: Crowds of people are lining the streets, many holding American flags, to honor the brave firefighters and first responders who lost their lives. Authorities have begun a solemn procession away from the scene.",
        "score": 725,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t care who the shooter was. Hang their body in the town square for the crows.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "2 dead, but 11 shot. Hoping for no more deaths.. praying for all involved.",
                "author": "B-2StealthTrump"
            },
            {
                "raw_content": "Full heart condolences to the First Responders - but this whole event reeks of a PSYOP.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Officials have sadly announced that at least 2 firefighters have been killed by the active shooter in Idaho from the wildfire, police say. Shooter still actively firing",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In a perfect world the local citizens would all be armed, form a posse and eliminate the shooter(s). Unfortunately they will get \"due process\" and probably given less than half the punishment deserved",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Left already calling it a \"MAGA shooter.\"",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "I'm in Idaho. Rumors swirling all over from state officials. So far, no officers shot. Only firefighters. 2 confirmed dead. The sheriff called them \"clean shots\". One suspect rumor that may be plausible is Travis Decker. Theres been a manhunt for him for a month for killing his daughters. Believed to be in the area.",
                "author": "I_am_the_glowie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is set to attend the opening of Alligator Alcatraz on Tuesday, per NBC",
        "score": 1582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ALLITRAZ!!!! 🐍🐍🐊🐊🐍🐍🐊🐊🏝️🐊🐊🐍🐍🐊🐊🐍🐍",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Could there be an Alaskan island that could be used? Cold, isolated and surrounded by freezing water.",
                "author": "Azarak"
            },
            {
                "raw_content": "We have the best gators, believe me",
                "author": "Beast_Pot_Pie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: An active shooter situation is currently underway as Multiple firefighters have been shot while responding to wildfire",
        "score": 1346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who the fuck hurts firefighters?",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Climate terrorists",
                "author": "BigBootyJudy"
            },
            {
                "raw_content": "If we're taking bets let's not forget MURDEROUS BEANERS AT AN ILLEGAL GROW SITE. I mean, who knows what it could be, but I just think it's important to not discount murderous beaners.",
                "author": "thejuicycrab"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Great Congressman Greg Steube is 100% correct. An unelected Senate Staffer (Parliamentarian), should not be allowed to hurt the Republicans Bill. Wants many fantastic things out. NO! DJT",
        "score": 1586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's great that President Trump has finally spoken out about this. Flood Vice President JD Vance's inbox about how crucial him overruling the commie Senate Parliamentarian Elizabeth MacDonough is, after she went after the BBB with a hatchet. She was appointed by Harry Reid in 2012. She wasn't fired from 2017-2020 because the Senate Majority Leader (Mitch McConnell) and the President of the Senate President (Mike Pence) are Rino's. John Thune as Senate Majority Leader has the authority to fire/overrule her, he's already said he won't. President of the Senate JD Vance has the authority to overrule her. (**Contact the Vice President**) https://www.whitehouse.gov/contact/ [Contact JD Vance on X](https://x.com/JDVance) **Elizabeth MacDonough is trying to remove:** - Defunding sanctuary cities - Reining in activist judges - DEFUNDING the Consumer Financial Protection Bureau, a huge target of DOGE - Rolling back the EV mandate - Allowing states to conduct border security and immigration enforcement - A provision in the Bill to accelerate approval of offshore gas and oil projects (Drill Baby Drill) - She wants to keep the Green New Scam funded - Immigrant Medicaid eligibility - Prohibiting Medicaid and Children's health insurance (CHIP) from funding 'gender affirming care' - Restricting certain states from increasing taxes on providers - Limiting noncitizen immigrants from qualifying for premium tax credits or cost-sharing reductions - Disallowing premium tax credits during periods of Medicaid ineligibility due to immigrant status - Removing the Hearing Protection Act (silencers) - Removing the SHORT Act Sources: https://www.zerohedge.com/political/republicans-scramble-after-senate-parliamentarian-nixes-deep-cuts-big-beautiful-bill https://x.com/EricLDaugh/status/1937230250242359357 --- **Summary from Brave Search about the Hearing Protection Act:** >The Hearing Protection Act (HPA) is a legislative effort aimed at reclassifying firearm suppressors, commonly known as silencers, to regulate them like regular firearms. The act seeks to remove suppressors from the regulatory framework of the National Firearms Act (NFA), which has imposed additional burdens on their ownership and use. The HPA would replace the current NFA regulations with an instantaneous National Instant Criminal Background Check System (NICS) background check, making suppressors more accessible to law-abiding Americans. **Summary from Brace Search about the SHORT Act:** >The SHORT Act, formally known as the \"Stop Harassing Owners of Rifles Today Act,\" is a proposed piece of legislation aimed at removing certain restrictions on firearms under the National Firearms Act (NFA). The bill seeks to remove short-barreled rifles (SBRs), short-barreled shotguns (SBSs), and certain other weapons from the definition of firearms for purposes of the NFA. This would effectively eliminate the need for federal registration and taxation of these items, which are currently subject to a $200 tax stamp and strict regulatory controls.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "She doesn't have any real power aside from advisory. Thune is just eating a bag of dicks that's all.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "**The jig is up with the parliamentarian dodge.** DataRepublican told us that \"just two months ago, Thune overrode that same parliamentarian on a different bill. https://patriots.win/p/19BZgLYWlJ/just-two-months-ago-thune-overro/c Thank God for DataRepublican, quit gas-lighting us !",
                "author": "wblboo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 Trump Truth: For all cost cutting Republicans, of which I am one, REMEMBER, you still have to get reelected. Don’t go too crazy! We will make it all up, times 10, with GROWTH, more than ever before",
        "score": 1362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let Trump cook. He'll either impound the appropriated funds, or if that's not allowed he'll spend them in the most MAGA way possible.",
                "author": "sorrytodisagree"
            },
            {
                "raw_content": "In other words, politicians have to keep increasing spending in order to get re-elected, and then they can cut spending, but only after raising spending to get re-elected.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "cut baby cut",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Lara Trump is seriously considering making a run for Senate to replace Thom Tillis, per NOTUS",
        "score": 1598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As long as she votes MAGA all the time. No more RINOS please.",
                "author": "Stormeyworld13"
            },
            {
                "raw_content": "no more women please.",
                "author": "stick_in_the_eye"
            },
            {
                "raw_content": "I like Lara, but I also have several decades of experience watching the toxic, poisonous results of women in positions of power.. Both in government and in the workplace.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sometimes the White House does a little trolling",
        "score": 1197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How do I get $10K from this bill? I don't get tips or overtime.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "Omnibus bills should be illegal.",
                "author": "Bramage"
            },
            {
                "raw_content": "Fuck the BBB, it’s a piece of trash.",
                "author": "bubadmt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There goes this musician's US tour. VISA REVOKED!",
        "score": 612,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Faggot Found Out",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "oh man that sucks. anyway...",
                "author": "turdinthepunch"
            },
            {
                "raw_content": "Hahah he’s gonna lose a lot of money",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oregon's New Gun Laws Only Affect Law Abiding Gun Owners. Do They Believe Criminals Will Start Following the Law Because They Passed Some NEW Bullshit Law?",
        "score": 1092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "psst They know exactly what they are doing.",
                "author": "RonBohr"
            },
            {
                "raw_content": "i thought...courts were agreeing en masse that there ARE NO restrictions on concealed carry, isn't Oregon breaking the law?",
                "author": "thelastlast"
            },
            {
                "raw_content": "Bolsheviks gonna Bolshevik.",
                "author": "loooooof"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Portland (June 28) — “Turn that s—t down! It’s midnight… You’re worse than ICE” A disabled black resident in the community terrorized by Antifa & the far-left in their month-long rioting at the ICE facility confronts them",
        "score": 1193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look how quickly they turned on her. Their hierarchy of intersectionalism means nothing to them.",
                "author": "Friendly_B"
            },
            {
                "raw_content": "Good for her. Let the dark MAGA grow inside of you.",
                "author": "KattWilliams2024"
            },
            {
                "raw_content": "all i see are retarded democrats!",
                "author": "stick_in_the_eye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "END WOKENESS: Zohran says his worldview is inspired by the 3rd world while eating rice with his hands (VIDEO)",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is that the hand he wipes his ass with?",
                "author": "Tikk"
            },
            {
                "raw_content": "His family’s 5 million dollar net worth couldn’t even affect it!🙄🫩🫩",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "His policies are why the US got flooded with the 3rd world for four years. They all voted for people like him, and then had to flee the results of the policies they voted for.",
                "author": "Herpawinski"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Can't wait",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Restore the Holy Roman Empire. Deus Vult.",
                "author": "elementaryMyDearFags"
            },
            {
                "raw_content": "Fuck yes.",
                "author": "FuttBucker2000"
            },
            {
                "raw_content": "Muslim numerical advantage never wins against an actual force willing to fight.",
                "author": "Elencher"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Spoiler alert: They don't",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "...said the jewish zionist that is an agent of Israel.",
                "author": "ghettometal"
            },
            {
                "raw_content": "The right has no interest in feminist whiners.",
                "author": "GetWokeGetBr0ke"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VICTORY: Caving to Trump, Canada RESCINDS their digital services tax on American companies.",
        "score": 360,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL to be expected from the Snow French.",
                "author": "Mitzhatzmakoph"
            },
            {
                "raw_content": "\"So you see, that's where the trouble began. That smile... that damn smile\"",
                "author": "wartooth6"
            },
            {
                "raw_content": "I can't imagine what was going through their heads to think that was gonna work out for them.",
                "author": "OpusX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Radicals turning on Zohran?",
        "score": 1031,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wut? Edit: this is obviously some sort of bullshit performance",
                "author": "EdBuck"
            },
            {
                "raw_content": "&#65038; The knives are out a little early! &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "Adams is going to get reelected.",
                "author": "rdvs34283"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republican Sen. Thom Tillis won't seek reelection. The news comes a day after the North Carolina lawmaker voted against Trump's domestic policy bill.",
        "score": 1540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok, now let's also Trump curse every worthless GOP fuck that took things out of the bill.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "His polling has been shit since before the vote. Not a surprise. He doesn't want to waste money on a failed campaign. They'd rather try to dump all their cash on the next establishment douchebag.",
                "author": "flashersenpai"
            },
            {
                "raw_content": "Useless Faggot. Always has been.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[ExplainingComputers] Testing MicroSD Express: Very Fast SD Storage",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actually pretty surprising that a UHS-II card has higher sustained write speeds. I get that the read speed is obviously superior, but being beaten by 20% on write? Crazy.",
                "author": "TheGreenTormentor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Blackwell: Nvidia’s Massive GPU – Chips and Cheese",
        "score": 148,
        "text_content": "A deep dive into the changes of rtx 50 (GB202) vs rtx 40 and 30 (AD103, GA102) with RDNA4 to Compare",
        "comments": [
            {
                "raw_content": "> Example from RDNA2 with pixel shader (blue) and compute (yellow) work overlapping. Blackwell is now capable of this Interesting note about subchannel switches not being a thing anymore but I'd like to see what that looks like in nsight. The AMD profiler makes it obvious when and what work you're overlapping. You can literally have it paint each draw call/dispatch in a unique color on that stacked wave occupancy chart. I could never get compute on the same queue to overlap on Ampere nor Ada, even without any WFI or subchannel switches in between. Nvidia seems to just use a one active command per queue model (with a huge exception for draw calls which do overlap) and AMD has an async command processor with split release/acquire barriers and chip-wide context registers. You don't even need to use multiple queues to be able to express every kind of overlap the chip is capable of.",
                "author": "farnoy"
            },
            {
                "raw_content": "Good ol chips and cheese",
                "author": "ExplodingFistz"
            },
            {
                "raw_content": "Would have been fun to see AMD try to scale this up.",
                "author": "boringestnickname"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Data 620 Minicomputer Executes an Instruction!",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't expect to see Usagi in this subreddit.",
                "author": "airfryerfuntime"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This is what I was expecting Mario kart world to be like.",
        "score": 1309,
        "text_content": "I was really hoping it to be full of different types of races and missions like Forza Horizon.",
        "comments": [
            {
                "raw_content": "I was more or less expecting more races that are kinda like the rally/cross country roading races where they just go crazy with the paths you take. Lowkey dissapointed a bit Edit: the closest I'd say we got to that was the ramps off the swerving rode in that one knockout tour. Just more crazy antics like that.",
                "author": "Slugbugger30"
            },
            {
                "raw_content": "Free roam had so much potential and that’s what frustrates me about it. Just a few things you have a great mode. -Find characters in the world, beat them in a race or some kind of challenge to unlock them -Races on the tracks, maybe with a little twist like collect these coins and win or something, to unlock karts There’s plenty of other ideas but just these make it way more worth exploring and I think they’re just very basic things. Diddy Kong Racing did it better 30 years ago.",
                "author": "dixie12oz"
            },
            {
                "raw_content": "Honestly if they were going for open world, burnout paradise / forza horizon and countless others of the same genre should’ve been their blueprint The open world honestly isn’t fun. Some of the p switches are. But man that really ain’t what MK is about.",
                "author": "MrMunday"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "played the demo for bananza!",
        "score": 698,
        "text_content": "only got to play 5 mins, but the main thing i noticed was that in handheld mode the frame rate and resolution was better than i expected. it FELT like 1080p 60. I guess we’ll see what the final product ends up being like.",
        "comments": [
            {
                "raw_content": "Don't know why they don't just put the demo on the eshop",
                "author": "Death_Metalhead101"
            },
            {
                "raw_content": "Man, if Nintendo offered a demo with the preorder of the game I'd preorder RIGHT NOW.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "I played it on the TV at target and it was really fun and ran without much issues. I think there might’ve been a couple frame drops but it could’ve also been me seeing things.",
                "author": "TheJohnny346"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Foundry tested Switch 1 games on Switch 2, specifically the ones who got free updates.",
        "score": 1676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if Nintendo will release upgrades for the Xenoblade series",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I love this But I'm also begging Nintendo to do the same thing to Animal Crossing and Smash Bros. 🙏",
                "author": "iusethisatw0rk"
            },
            {
                "raw_content": "Can't wait to play my favorite game Slatoon 3",
                "author": "ArcaneFlame05"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Happy Bday to meeeeeee. Finally found one last week. Going to try and play BoTW & Luigi’s Mansion 3!",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad to see you found a birthday last week <3",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Question: I play Hogwarts Legacy on my PS5. Is there any way to sync it to the switch version? I know they’re diff consoles but wishful thinking lol",
                "author": "77xyz88"
            },
            {
                "raw_content": "LM3 hasn’t been updated for Switch 2 yet. I’m patiently waiting lol",
                "author": "Southernboyj"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s a good day.",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have fun! The Switch 2 versions of BotW and TotK look amazing, especially on a good TV!",
                "author": "nikers93"
            },
            {
                "raw_content": "Have fun! See you on the tracks!",
                "author": "bowlofpasta92"
            },
            {
                "raw_content": "Today was a good day",
                "author": "Skott_stabb"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NYC PSA: Waltzed into Nintendo New York and they are in stock.",
        "score": 484,
        "text_content": "Hi everyone! If you’re in NYC then you’ll know that it’s been difficult to find stock. I went to Nintendo New York on 48th street and they had a few behind the counter, regular and bundle edition. The clerk said that they are releasing a limited amount in-store without the need of warp pipe pass, but it was 5PM and there were like 10 left.",
        "comments": [
            {
                "raw_content": "Does Shigeru Miyamoto come with it?",
                "author": "tadaoverlord"
            },
            {
                "raw_content": "Don't let this guy lie to you. I saw him and he wasn't waltzing it was more like a scurry into a skip",
                "author": "FitDingo7818"
            },
            {
                "raw_content": "FINALLLYYY... NOW SHIGGY CAN EAT. IM GONNA BUT 3 MORE SO HE CAN EAT AND FEED HIS FAMILY",
                "author": "Ashamed-Soil128"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Talk about an overly dramatic defeat",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You just took the last of his money. He was hoping to win, just enough to cover his wife’s hospital bill. But now she’s going to die. And without her, he has no reason left to stay in this world. The love of his life, gone in an instant, taken by Pokerus. All because he lost a Pokémon battle.",
                "author": "0rbsy"
            },
            {
                "raw_content": "Is bro gonna be ok?",
                "author": "wackywizard54"
            },
            {
                "raw_content": "I've seen things you people wouldn't believe. Team Rocket blasting off again off the shoulder of Mt. Moon. I watched Hyper beams glitter in the dark near the Indigo Plateau. All those moments will be lost.. in time. Like.. tears in rain... time to black out. ![gif](giphy|xTiTndQ1jDqHQ6ejPG)",
                "author": "VoicePope"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Here's a neat little comparison video comparing switch 2 enhanced/switch 2 games against the steam deck, as well as battery drain tests and load times, all done by ElAnalistaDeBits on YouTube",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But but i could just emulate sw2 on the sd /s",
                "author": "profchaos111"
            },
            {
                "raw_content": "But how fast can the Steam Deck load Mario Kart World?",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "I think it's a win for both consoles, it's amazing valve has managed to get linux to work so well for gaming, it's actually playable in a handheld format and has a pretty good console experience And the switch 2 runs really well, it can run a lot of more demanding games and probably can get more ports from current gen consoles",
                "author": "Admirable_Gazelle414"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Rogue Prince of Persia has been rated for PS5, Xbox Series, Switch, and PC in Australia",
        "score": 105,
        "text_content": "[https://bsky.app/profile/gematsu.com/post/3lssklr5nbk2d](https://bsky.app/profile/gematsu.com/post/3lssklr5nbk2d) The game was only announced PC release at Early Access previously",
        "comments": [
            {
                "raw_content": "Good. The later updates leading to 1.0 were massive improvements and the game is now really enjoyable. Its very interesting how different its movement and parkour is compared to Lost Crown and yet they both are great. Hope they take it as a good sign and make a 3D Prince of Persia soon.",
                "author": "federico_alastair"
            },
            {
                "raw_content": "Im so excited for this and Hades 2 both of them look amazing but I want to play the final version",
                "author": "Rbtmj2"
            },
            {
                "raw_content": "I forgot this existed. Hoping the launch gives it more buzz.",
                "author": "littlebiped"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Edward Kenway's voice actor strongly hints at Assassin's Creed 4 Remake",
        "score": 695,
        "text_content": "https://xcancel.com/TheRealZephryss/status/1939392046151926243?t=TwkFG62dMpthQvGOFslZ_Q&s=19 At this point, it's an open secret. I'm extremely curious to see how Ubisoft handles this since this is their first remake (correct me if I'm wrong)",
        "comments": [
            {
                "raw_content": "Yeah, that’s just straight up an announcement by him. Lmao The words that are missing are only the obvious ones.",
                "author": "Disastrous-Pair-6754"
            },
            {
                "raw_content": "this really is Ubisoft's worst kept secret",
                "author": "scott1swann"
            },
            {
                "raw_content": "I would also like to show some appreciation to Matt Ryan for his amazing performance as Edward. Still one of my favorite performances to this day. Edward had an amazing arc, but the performance behind the character was equally as important.",
                "author": "KvasirTheOld"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RTX 5070 Super 18GB and RTX 5070 Ti Super 24GB leaked",
        "score": 441,
        "text_content": "It seems like Nvidia is already cooking some of the the Super refresh variant of GeForce RTX 50 series and here is the specs of them according to Kopite7Kimi a highly accurate leaker of Nvidia Hardware in general. **GeForce RTX 5070 Super** PG147-SKU65 GB205-400-A1 6400FP32 192-bit GDDR7 18GB 28 GBps 275W **GeForce RTX 5070 Ti Super** PG147-SKU55 GB203-350-A1 8960FP32 256-bit GDDR7 24GB 28GBps 350W [https://videocardz.com/newz/nvidia-geforce-rtx-5070-super-reportedly-features-6400-cuda-cores-and-18gb-memory](https://videocardz.com/newz/nvidia-geforce-rtx-5070-super-reportedly-features-6400-cuda-cores-and-18gb-memory) [https://videocardz.com/newz/nvidia-also-planning-geforce-rtx-5070-ti-super-with-24gb-gddr7-memory](https://videocardz.com/newz/nvidia-also-planning-geforce-rtx-5070-ti-super-with-24gb-gddr7-memory)",
        "comments": [
            {
                "raw_content": "Now let's see the prices lmao",
                "author": "Dycoth"
            },
            {
                "raw_content": "Bro, what a fkin joke of a company. Imagine giving them the confidence, you buy an overpriced 5070, just to see how the company releases what the 5070 should have been since day one, 6 months later.",
                "author": "Joker28CR"
            },
            {
                "raw_content": "So higher wattage and more VRAM is the only difference between the 70 ti super and 80 super? Wonder what the performance increase will be then.",
                "author": "Nice_promotion_111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "All black 9070XT + 7800X3D",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was my first ever build done at the age of 33 but having been wanting to do it since 8th grade. I followed the steps and did the things and overall it wasn't too much of a headache. The smallish size of the case complicated things but thanks to its design you can just take off whichever panel you want easily. Airflow is actually amazing and temperatures are at around 60 under I'll say medium load with a +15 CO on both the CPU and GPU which is perfectly fine by me; I don't see the point of stress testing my components. In hindsight, the only thing I wish I had done differently was installing certain cables and wires first rather than last. Managing the cables and wires took BY FAR the most amount of time and it's something I'm still not satisfied with completely.",
                "author": "Desmond_Winters"
            },
            {
                "raw_content": "Yeah cables are a pain in smaller cases. I have that looks almost like that one. 1 of 4 im trying to sell lol",
                "author": "ApprehensiveTip8343"
            },
            {
                "raw_content": "is it just me or does the cooler look tilted?",
                "author": "Swooferfan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New to the PC scene",
        "score": 69,
        "text_content": "Radeon rx580 GPU; Ryzen 5 1600 6core; 16gb RAM; and 3tb HDD.",
        "comments": [
            {
                "raw_content": "Nice bro, hope ya have a great time on it. Obligatory comment on cable management. I'd definitely use the cut out at the bottom for your gpu's psu cable. Would make the build look much cleaner already.",
                "author": "lioboii"
            },
            {
                "raw_content": "Nice clean build!",
                "author": "TuneComfortable412"
            },
            {
                "raw_content": "Everything is solid and it’s a good looking build! I hate to be that guy because obviously this is meant to be a budget build, but just an obligatory warning about ADATA. I’ve had a couple of their SSDs fail on me. But no big deal. Just keep everything important backed up and it will serve you well :)",
                "author": "GarrettB117"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Is Florida a Gigantic Warning Sign For the Rest of the Country?",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, but it is a gigantic warning sign for anywhere prone to massive natural disasters every single year",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "I could see areas like the Carolinas, having similar issues later down the road. The climate effects wrecking Florida's insurance market are causing a lot of flooding in other coastal states. It's not realistic though to say that the whole country is equally vulnerable to the storms, extreme politics, and poorly diversified economy that Florida has.",
                "author": "Meet_James_Ensor"
            },
            {
                "raw_content": "Yes. Always is . This is going to be 2008 all over again but with bigger losses and a slower burn. It won’t be a “crash” because the Fed and the media won’t let the narrative get out of control like 2008. There will be no mass sell off. Just a lot of bankruptcies and horror stories, slower over a longer period. Big metros might be safe because they have jobs. Anywhere else is fair game.",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlanta sees fourth largest yearly home price drop in US, data shows",
        "score": 136,
        "text_content": "Home prices across metro Atlanta have dropped markedly in the last year, as a recent influx in available supply has helped bring balance to the housing market. https://www.bizjournals.com/atlanta/news/2025/06/27/metro-atlanta-home-prices-decline-may-2025.html I have said it last year the Atlanta suburbs are primed to become the next Austin. And that is slowly starting to happen, rampant amount of RE investors and WFH crowd bought here during COVID boom. Now they are realizing what they got themselves into, in mean time builders are cranking out home left and right.. One of our friends who has been RE industry in GA for decades was appalled by all this he started cashing out last year and locked up rest with long term leases. He is expecting things to get bad there..",
        "comments": [
            {
                "raw_content": "Inventory in Decatur GA is up a whopping 25% from last year. Homes sitting unsold all summer.",
                "author": "vblade2003"
            },
            {
                "raw_content": "\\-1.8% YoY. It's going to be many years of small YoY declines like this before things are brought into balance and prices can start continually rising again with inflation.",
                "author": "pegunless"
            },
            {
                "raw_content": "I dont see where. Shit is still over priced as fuck everywhere.",
                "author": "evil_illustrator"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeownership: Not Enough Supply for Middle-Income Buyers / For teachers, nurses and other skilled workers, few options.",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not housing supply... it's negative real wages and has been for 40 years. [Nationwide ground beef prices](https://fred.stlouisfed.org/series/APU0000703112) averaged $3.88 in December 2019, and are at $5.98 now. Has your income gone up 55% in five years? Hell, the M0 money supply in general is up 65% in the past five years, which looks suspiciously similar to the S&P 500 and real estate price gains. Again, wages aren't up 65%, so that money's not exactly trickling down to workers. FWIW, I am not interested in CPI data... the guys publishing those statistics have 36 trillion reasons to under-report inflation.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Fuck out of here with these lies lol every metric says supply is at or above pre pandemic levels",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Gee, I wonder why there's such a nurse and teacher shortage where the house prices are highest. Truly a mystery.",
                "author": "Skyblacker"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Median household income by education",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird cause most people I know who don’t have a degree make more money than those with a degree. Guess that’s just blue collar trade jobs I’m around",
                "author": "fart_huffer-"
            },
            {
                "raw_content": "What is the data source for this? Some of these numbers seem off.",
                "author": "Haluszki"
            },
            {
                "raw_content": "Doesn’t seem accurate considering around 24% of the national workforce is underemployed. https://www.bet.com/article/gyv13v/beyond-the-numbers-the-reality-of-americas-underemployed",
                "author": "LittleThisLotThat"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI Is shutting down next week to give employees a break. Staffers have been working 80-hour weeks.",
        "score": 818,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“I feel a visceral feeling right now, as if someone has broken into our home and stolen something,” Chen wrote. “Please trust that we haven’t been sitting idly by.” **Mark Chen, the** chief research officer at OpenAI, sent a forceful memo to staff on Saturday, promising to go head-to-head with the social giant in the war for top research talent. This memo, which was sent to OpenAI employees in Slack and obtained by WIRED, came days after Meta CEO Mark Zuckerberg successfully recruited [four senior researchers](https://www.wired.com/story/four-openai-researchers-leave-meta/) from the company to join Meta’s superintelligence lab.",
                "author": "NutInBobby"
            },
            {
                "raw_content": "https://preview.redd.it/kwxroj1bkx9f1.png?width=680&format=png&auto=webp&s=512e84759bd0deaba6c3240d555c7ad8a179a462 \"Excellent.\" EDIT: Also, as a side note-- assuming OAI employees are working 5 days every week, this means they're working 16 hours everyday. Holy shit.",
                "author": "MemeGuyB13"
            },
            {
                "raw_content": "Never buy it when a tech company says \"unlimited vacation days\" lol At least they're being compensated well and believe in the work.",
                "author": "FakeTunaFromSubway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Some more info/hype on the OpenAI's open-source model coming out next month",
        "score": 171,
        "text_content": "They confirmed later in the thread that it is a reasoning model in the dropdown. My guess is that they are talking about o4-mini. It would indeed be wild if we can run a o4-mini level model on a single consumer GPU.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/002v6gjguy9f1.png?width=610&format=png&auto=webp&s=b79d279c129a0e6f23bc5d71178b0ee5ae4a2d76 good",
                "author": "Sky-kunn"
            },
            {
                "raw_content": "https://preview.redd.it/9ekn8o9i3z9f1.png?width=660&format=png&auto=webp&s=54e8991865503d16943119441537d2b06e3bf0e0 NEW OPENAI MODEL IS INSANE! YOU'LL WANT TO UNALIVE YOURSELF WHEN SEEING IT!",
                "author": "PwanaZana"
            },
            {
                "raw_content": "OpenHype",
                "author": "Additional_Bowl_7695"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "After 5 years of struggle, ChatGPT solves medical mystery in seconds and sparks debate in Silicon Valley",
        "score": 125,
        "text_content": "We just getting started.",
        "comments": [
            {
                "raw_content": "AI in theory will always be better than any human doctor. The ability to cross reference millions of patient scans and illnesses is something no doctor can do. The medical field is an area I'm sure that will be mostly dominated by AI in a few years.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "After reading the article \"Mystery\" is doing A LOT of work here.",
                "author": "TimeTravelingChris"
            },
            {
                "raw_content": "Sexy medical tip",
                "author": "greeneditman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAi scrambling to stop the bleeding of talent",
        "score": 244,
        "text_content": "https://www.wired.com/story/openai-meta-leadership-talent-rivalry/ Zuck really has them spooked lol",
        "comments": [
            {
                "raw_content": "OpenAI's souring relationship with Microsoft also left them vulnerable to this",
                "author": "TipRich9929"
            },
            {
                "raw_content": "OpenAI offers PPUs (profit participation units). Due to their weird structure (franken-hybrid of non-profit/public-benefit/corporation) they don't grant RSUs or ISOs. So you have a base salary of $300k and then the equity side which is a few million worth of PPUs. But what is the future potential of PPUs? Can you sell them in tender offers? If OpenAI is able to convert properly to a corporation, do they convert to RSUs? If they go public do they convert to stock? I wonder if it's just better to go to literally any other company that has equity that's more of a guarantee, whether it's equity that's already liquid with Meta or another public company, or with a start-up offering ISO/RSUs.",
                "author": "ConstantExisting424"
            },
            {
                "raw_content": "They'll be fine, we all thought it was over when Ilya left as well. They still have a bunch of heavy hitters like Mark Chen, Noam Brown etc",
                "author": "IlustriousCoffee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nick Bostrom says AGI won’t stop at the human level, it will quickly lead to superintelligence. From there, machines will outthink the best scientists and invent everything else -- faster and better than humans. \"It's the last invention we’ll ever need.\"",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "when",
                "author": "gfy_expert"
            },
            {
                "raw_content": "If this happens why does the AGI need humans. I do understand the difference between ASI and AGI.",
                "author": "Willdudes"
            },
            {
                "raw_content": "Huh, he's just repeating what I've already heard two thousand times.",
                "author": "Swimming_Cat114"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini CLI Organizing My 400 Files Notes In A Half Hour, Even Made Meaningful Connections Between Various Topics",
        "score": 311,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow that’s an actual use case and also I can see that it was entirely done by flash and not pro",
                "author": "horse_tinder"
            },
            {
                "raw_content": "I take notes in Anytype (another note taking app), I exported those notes, they were just bunch of markdown Files with attachments, I added it to Obsidian Vault and ran Gemini CLI over it. First I asked it to just rename, organize and properly structure the notes and then asked it to make useful and meaningful connections for graph view in Obsidian. It nailed it perfectly and what's unbelievable is it did it with 90% context window always remaining free. I'd say accuracy is approximately 95% which cab be made 100% for sure if you tell it to read the Full Files. It'd take significantly more time though (around 2 Hours for the same task).",
                "author": "Ryoiki-Tokuiten"
            },
            {
                "raw_content": "I'd love to test this idea using symbolic decoder mapping. It should help significantly.",
                "author": "GhostArchitect01"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic’s AI utterly fails at running a business — 'Claudius' hallucinates profusely as it struggles with vending drinks \"It's like a business graduate with no common sense.\"",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think if you had one instance of Claude specialize in a single area, and each instance had a clear system prompt with guidelines, it would have done way better. Making the same instance handle all of this with potentially vague instructions is a recipe for disaster.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "I'm no expert, but it seems clear that one of the biggest limitations in current AI systems is memory. You can have brilliant reasoning capabilities, but if you constantly forget what just happened or can’t retain more than a sliver of context at a time, you're practically useless for most complex tasks. Genius without memory is like a calculator with no screen -- technically capable, but ultimately useless. Running a business, for example, is easily one of the top ten most demanding things an average person could attempt. It’s not just hard, it’s a relentless juggling act of priorities, decisions, systems, and human factors. You need to track dozens of variables in parallel, make long-term plans, and adapt to constant change. That’s not something you can do if your memory resets every few seconds/minutes. That’s why testing AI on real-world, high-complexity tasks like running a business is promising. It gives us a much clearer picture of what these systems can actually do, far more than acing theoretical benchmarks in math, code or science (not that those don't matter, of course). It looks like an excellent benchmark that will be very hard to beat in less than 5 years because even humans *really* struggle with that in real life, it's genuinely challenging. Maybe it's time we rethink the mantra. If “attention is all you need” got us this far, perhaps the next breakthrough is “memory, adaptability and context are all you need.” AI has learned to think. Now it needs to *remember* and *adapt* if it ever wants to *act*.",
                "author": "jschelldt"
            },
            {
                "raw_content": "You have to train AI just like a real employee. These \"one size fits all\" AIs have zero memory, zero adaptive ability, and only know whatever was in there training data and prompt. Custom, task focused AI, fine funed for the actual job, would do a lot better.",
                "author": "Papabear3339"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever says future superintelligent data centers are a new form of \"non-human life\". He's working on superalignment: \"We want those data centers to hold warm and positive feelings towards people, towards humanity.\"",
        "score": 319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "when is this from ? old or recent ?",
                "author": "Loud_Seesaw_6604"
            },
            {
                "raw_content": "When did this interview happen? Where is the source?",
                "author": "DiogneswithaMAGlight"
            },
            {
                "raw_content": "every time I say Please and Thank You to chatgpt, I am training the model on my data, to be nice. I am preventing Skynet, or at least delaying it. You're Welcome",
                "author": "NonPrayingCharacter"
            }
        ],
        "subreddit": "singularity"
    }
]