[
    {
        "post_name": "Past the point of fatigue",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Up yours, jogger!",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Making awesome memes like this you should never have to work a day in your life lol your so talented and I love the Pepes",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "This is a strange one, seen a load of \"this is what happened before they started filming\" narratives built up being shared as fact, but no actual proof. \"Nuisance streaming\", another shameful 2020s thing we have to now put up with as a society. So who knows what exactly went down before the actual clips shared. Heard she's made hundreds of thousands in donations already.",
                "author": "brainphreeze"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Immigrants from Somalia overwhelmingly rely on government welfare - Norway: 73% of Somali immigrants are on government aid - Sweden: 64% of Somali immigrants do NOT have jobs or education - Denmark: 69% of Somali immigrants are on public benefits - America: 88% of Somalians reply on a welfare progr",
        "score": 590,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With the large populations of Somalians sll over the globe, are there any actually left in Somalia? 🤪🙄",
                "author": "beachbirdie"
            },
            {
                "raw_content": "They have to all be deported, legal or illegal.",
                "author": "BuzzBuzzard"
            },
            {
                "raw_content": "Everyone with an IQ knew Wew lads",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Replace EBT/SNAP with MRE's",
        "score": 521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That kind of food is WAY better than they deserve! And WAY too expensive!",
                "author": "BeauHD"
            },
            {
                "raw_content": "Make them out of pork and it's a deal",
                "author": "FakeNametag"
            },
            {
                "raw_content": "What about this. When You applied for government assistance. The person(s) join a work crew building/maintaining infrastructure ,power plants and,etc. And if they refused......Well they can starve. The only assistance that should be free is the elderly and some people that are too physically disable to work.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LNC CHECKING IN",
        "score": 420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I miss The_Donald 2015-2018 era",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "this takes me back... specifically to July 14, 2025 when I made this one... lol 👍🏼",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "TP worth a fortune 5 years ago. Still worth more than USD.",
                "author": "utfanx2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The illegals are getting rounded up and Americans are getting jobs. Who knew?",
        "score": 1189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But I was told that Americans are lazy and don't want these jobs.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Next thing you know, food and housing prices will go down. Crazy!",
                "author": "MegoThor"
            },
            {
                "raw_content": "More of this young man. More and more and more and more. Everyone needs to hear it.",
                "author": "freedom-thinker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "X today became the No.1 News App in EVERY SINGLE EU nation",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't call X a free speech platform, but the world is much better off having X instead of Twitter.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Even European citizens hate the EU. The European Union should be broken up.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Good job EU you stupid dipshits. You just made X more popular after you tried to fine Elon Musk.",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fuck no. We jeed to be doing far LESS for \"migrants\". Send them home.",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not less migrants. Reverse migration. Everyone Biden let in must go. We need a hard reset.",
                "author": "thunderdroid"
            },
            {
                "raw_content": "I think the Congresscritter who wants to make them feel more welcome should lead by example and welcome them into his home. I want the 1 bedroom apartment near my house with 12 illegal Hispanics who don't speak a word of English to go live with him. Let the 10 men who cut lawns for cash bunk with his daughters. Let him feed them and pay their bills.",
                "author": "Moose_Antlers"
            },
            {
                "raw_content": "Read the room, retard. Fucking GOP squinty-eyed grifting cucks. This is why we can't have nice things.",
                "author": "LostElf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Free Beer: ‘We’re Not Backing Down’ – Owner of Pro-ICE Idaho Saloon Undeterred by Violent Threats",
        "score": 1166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Come on out to play, leftists. Try your shit in a small town.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "He should start a fundraiser. We're in the era of political statements coming with enrichment. May as well capitalize off of leftists' rage. No unity with evil.",
                "author": "KuonFan"
            },
            {
                "raw_content": "Old State Saloon. Cool place.Everyone carries in Idaho.",
                "author": "Shaffro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fed-up Europeans have begun placing condoms into the begging cups of Muslim women on the streets, angry that their governments provide generous child benefits to them that encourage large families while they continue to beg.",
        "score": 998,
        "text_content": "",
        "comments": [
            {
                "raw_content": "European badged faggots will arrest him for rape. 😐",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Old news. The people are not going to shame these illiterate inbreds out of their nation. They will have to be expelled at the end of a gun. Their governments are all far too corrupt to ever stop the flow until the people rise up and do it themselves. Sadly I don't think that point will come before the jihadi reach critical mass and boil out en mass to burn rape and kill.",
                "author": "SquiggyMcPepe"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Send the Engineers and Astronauts back to Somalia so they can enrich their homeland",
        "score": 1230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah but do Rome 2025.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Fun fact: Before the dutch ships landed in sub Saharan Africa in 1596 the tallest structures were built by termites.",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "The majority of Africans simply haven’t evolved past the caveman state hardly at all. Plain and simple. Their brains aren’t capable of higher thought.",
                "author": "lockgr2002"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Import more Octopi",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport Somalis ... import more Octopus",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "This meme is bullshit. There is *no way* Somali's have higher IQs than polar bears or cheetahs or crocodile's.",
                "author": "LokiHelmsdeep"
            },
            {
                "raw_content": "It's corrupt and multiply incompatable with western society. DEPORT.",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Feminism was created by ugly bitches” 🤣",
        "score": 932,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rush Limbaugh said this forever.",
                "author": "Toddyoungsvagina"
            },
            {
                "raw_content": "Suffrage too",
                "author": "RudeFrog"
            },
            {
                "raw_content": "Every young woman needs to watch her “Women Are Retarded” videos https://youtu.be/2GH7EhLsxPI",
                "author": "ninabobby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canucks are mad! Fire Franklin meme cannons to the North!",
        "score": 1327,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They still don't understand the Streisand Effect.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Mike was in the Navy, the Canadian Navy, no less. That explains why he is such a massive faggot.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "A lot of Canadians love these new memes. No surprise that the original authors are upset though :) https://freecanada.win/threads/34659/",
                "author": "lothrop_evola"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's 10 o'clock, do you know where your mind is? ⌚🤔🧠🐸",
        "score": 505,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We’re gonna make it my pedes.",
                "author": "grandfather_nurgle"
            },
            {
                "raw_content": "I am going to be President one day, just you wait",
                "author": "TimWaltz"
            },
            {
                "raw_content": "Where's my mind at? I must have watched this video a hundred times by now and little by little, over time, I went from laughing to cringing to crying. I like the fall from grace, it's always a slow crawl back. I painted me inside this universe and I turn the canvas upside down depending on how I feel when I look at it. It's either me falling or me crawling back up a mountain of stars and dreams in one painting, depending on how it's hung on the wall. I titled it 'Fall, from grace'.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'I' .... CAN ... NOT 'HANDLE 'THE TRUTH'",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Christ is King!",
                "author": "FreedomPatriot4547"
            },
            {
                "raw_content": "There is nothing more destructive to humanity than sin and contra-Christian worldviews.",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "To my unbelieving frens, I was you a few years ago. I'm not great with words, all I can say is I wish you could just have a taste of the deep joy and peace beyond description that is living a Christian life. FRENS, HE IS REAL! And he wants to give you spiritial treasures beyond your imagination. He's always waiting...if you won't call on him now, know you always can as long as you live. That's it. God bless you all!",
                "author": "DrVSGGEOTUSPhD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a massive development, ICE is RAMPING UP Somali illegal alien raids in Minnesota. They’re showing up armed and storming the property that is packed with Somalis.",
        "score": 1539,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get them all out.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "Make sure to pick up 5 or 6 million scamming H-1B Indian credential-fraud, chain-migrating, lying scammer job thieves on your way back to DC, guys. What the Somalis got away with is a spit in the ocean compared to the operation that H-1Bs are running on this country. OUT.",
                "author": "expertnoticer"
            },
            {
                "raw_content": "Somalians are mentally retarded and offer ZERO to America",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🌷 Retarded Faggot.",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tampon Tim Tip-Toes Through The Tulips",
                "author": "Shimmy_Shanahan"
            },
            {
                "raw_content": "Lindsey Graham is mad he stole his Easter suit",
                "author": "MasterChief"
            },
            {
                "raw_content": "He's so gay he makes Elton John look straight",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Get this. These Somali people actually believe that Minnesota was promised to the Somalis 3,000 years ago. We have reached peak stupidity in our timeline",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a joke. They're riffing on zionist claims to the Levant.",
                "author": "PM-Melania-feet-pics"
            },
            {
                "raw_content": "They were put in Minnesota by the same interests that also put them in Sweden. Not so coincidentally, Minnesota is the state with the highest percentage of its White population being of Swedish descent.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Minnesota was promised to me 4,000 years ago motherfuckers! Ha! Take your somalia colonizer ass back to somalia!",
                "author": "Nezock_theKnight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Q: Who’s on your naughty list? RESIDENT TRUMP: “Oh, it’s a LONG list…I better not say, or it’ll cause absolute CHAOS out there in the world!” [That list isn't the same as Epstein list, is it?]",
        "score": 696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make some arrests already",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "# P",
                "author": "magnokor"
            },
            {
                "raw_content": "That expression, the things FLOTUS must know...",
                "author": "Roguepepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Spread the cheer!",
        "score": 979,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There’ll be fewer Blue - Districts - without you! 🎄",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Merry Christmas, ya filthy animals!",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "🎵 They’ll be home for Christmas, Thanks to the I., C., E. 🎶",
                "author": "MegoThor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung could earn billions by supplying HBM4 chips for Google's TPU",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh... TPUs have a tiny market. Ridiculous.",
                "author": "Decayedthought"
            },
            {
                "raw_content": "Google doesn't want Samsung in a phone why would they want them for their TPUs. Correction: Intel could earn Billions by supplying HBM4 Chips for Google's TPU.",
                "author": "DarianYT"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I'd like to offer a friendly suggestion to one of the moderators.",
        "score": 13,
        "text_content": "Since I sent the message to the entire moderator team, I don't know who you are (and I don't have much interest or ill will towards you). A couple of days ago, I tried to post about concerns regarding a backdoor vulnerability in a decentralized hardware VPN router project developed by a Chinese team. I checked the \"rumor\" category and included supporting evidence, news reports, and discussions from others. You deleted it without giving me any reason. When I asked you about it, you told me the \"content was inappropriate\" (which was quite arbitrary and vague). Only after I pressed you further did you tell me that VPNs are software, not hardware. I then clearly explained to you that it was a hardware project and provided a link, but received no response, and you directly banned me for three days. I want to say that I have no ill intent, but your reasoning is incorrect. I wasn't focusing on politics, but rather on the potential backdoors in this hardware product itself. In short, perhaps I need an explanation, any explanation, such as why you don't allow content from China to be included, or why you don't allow hardware-based VPN products, etc. I look forward to your reply.",
        "comments": [
            {
                "raw_content": "The Chinese have taken over mod positions and are censoring all negative news about China in this sub? Sure looks like it.",
                "author": "erickbaka"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung set to retake No. 1 DRAM spot from SK hynix with massive earnings",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello self-fix! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thunderobot Technology Exhibits at CES 2026, Showcasing Gaming Laptops Powered by Intel Panther Lake [Newsfile]",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> The CES exhibition features a robust lineup of products designed to provide a one-stop gaming hardware solution for players and creators with diverse needs, among which two flagship products stand out. **The ZERO Air, one of the world's lightest gaming laptops with dual full-power performance based on the new Intel Panther Lake platform, boasts a weight of about 1.6 kg while delivering frame rates, thanks to the revolutionary energy efficiency improvements of the new processor.** Now I've never heard of Thunderobot before this, but anyone making a light, probably 14 inch gaming laptop immediately puts themselves on my notice",
                "author": "LastChancellor"
            },
            {
                "raw_content": "What's up with Thunderbolt these days anyway? Wasn't Thunderbolt 4 essentially being wrapped up in USB4? Does Thunderbolt even exist independently for itself past USB4, after TB4 and USB4 essentially merged into one?",
                "author": "Helpdesk_Guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "High-Performance Computing-Center Stuttgart: HLRS Announces Details of Herder-Supercomputer [Zen 6 + MI430X]",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MI430X being the HPC-oriented one with higher FP64 performance than the MI450X.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "The article states … > *Herder* [the Supercomputer] will be based on the **HPE Cray Supercomputing GX5000**-system. Announced by HPE in November 2025, it is designed to support the large-scale numerical simulations that are essential within HLRS's traditional user communities, as well as data-science approaches for AI model training and generative AI. … > Herder will incorporate the HPE Supercomputing Management Software, which supports the containerized methods needed for HPC/AI workflows. The new supercomputer will use the **Lustre-based HPE Cray Supercomputing Storage Systems E2000** to alleviate bottlenecks in the management of large datasets and improve overall system performance. **HPE Slingshot 400-switches** will move data across the system at high speeds and with low latency. > Delivery of Herder is scheduled for the second half of 2027 and it is expected to go into service by the end of 2027. Herder will replace HLRS's current flagship supercomputer, called *Hunter*. > When it arrives, Herder will be in good company among the world's most advanced high-performance computing systems. HPE Cray Supercomputing GX5000 is the same platform being used in the upcoming *Discovery*, *Mission*, and *Vision*-supercomputers in the United States and the *Blue Lion* system at *Leibniz Supercomputing Centre* near Munich. > ####Faster GPUs, denser CPUs from AMD > Herder will contain next-generation processors from AMD, including the **AMD Instinct™ MI430X GPU** and **AMD EPYC™ “Venice” CPU**. Each MI430X supports 432GB of HBM4 memory at 19.6TB/s of memory bandwidth, offering powerful capabilities for data-intensive operations in both HPC and AI — The Venice CPU is the world's first processor to use TSMC's (Taiwan Semiconductor Manufacturing Company's) 2-nanometer fabrication methods …",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "Oh, so now they are gonna hog the new Zen 6 CPUs... Wow... This industry is dying faster than I thought...",
                "author": "Dark_ShadowMD"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why I'm choosing non-Elite performance for my next smartphone",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do people even need \"phone performance\" for?",
                "author": "GrapeAdvocate3131"
            },
            {
                "raw_content": "Im not sure budget phone market will be in the same state as it is now after a year or two of this NAND shortage",
                "author": "kindaMisty"
            },
            {
                "raw_content": "All a person needs is just 8 GB of Ram and a Snapdragon Processor and 256 GB of Storage with Stock Android (No Samsung Bloat).",
                "author": "DarianYT"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lenovo Chromebook Plus 14 is a fine stage for ChromeOS' future",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Speaking first to the chipset, I’m not super impressed. With the strides we’ve seen in ARM-based laptop chips over the past couple of years, I was hoping for more here. Kompanio Ultra is capable of basic work, but **I don’t think I’ve had a single session using this laptop where I didn’t run into a tab freezing up or lag of some kind**. Even relatively light workloads seem to occasionally lead to the laptop not being able to keep up. That really shouldn’t be the case for a machine with 16GB of RAM. I don’t want MediaTek to throw in the towel here, as I want Chromebooks to have their own Snapdragon X Elite moment like Windows did, but this certainly isn’t it. \\^\\^ This is not the first report of lock-ups and freezes on the Chromebook Plus 14 with its MediaTek Kompanio Ultra 910. Tabs freezing is plainly unacceptable on **any** new laptop north of $100, but especially on such an expensive ChromeOS laptop. It's not just annoying: if you're uploading large files, editing a document, etc., tab freezes might mean you've lost data and need to start over.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Canucks] A Ryzen cooling MONSTER - be quiet Silent Loop 3 review",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "I don't think I've liked a modern game this much since Breath of the Wild",
        "score": 1654,
        "text_content": "Except for the original trilogy, it reminds me of games like Twilight Princess, Skyward Sword, Starfox Adventures or Okami. Just classic, core game-design, like it stepped out from 2005. Right down to the collection of diffuse magical keys. Especially the Ice Belt reminds me of Snowpeak Ruins in Twilight Princess. Or Flare Pool, the Fire Temple in Ocarina of Time. The HDR-effects are absolutely beautiful and the soundtrack could become iconic. Samus silent confidence as she explores combined with the bangers is such a haunting mix. The thunderous rain in Volt Forge is a slam-dunk in atmosphere. Even the desert being empty doesn't really bother me, it's obviously not meant to be an open-world, more like a classic overworld similar to the ocean in Wind Waker or even the map in Mario. One thing I do agree with the critics regarding is Miles, who's quippy handholding is a bad fit for Metroid. People have likened him to the Marvel-movies, but I don't think that's quite it. I think he's rather a leftover from the Wii-era when Nintendo tried to branch out to casuals and needed to be sure **everyone** was having fun. But other than that, seriously Nintendo & Retro - thanks for this. Games like this makes me believe gaming didn't actually peak in 2007 and that there are still content out there for us who prefer artefacts, mini-bosses and powers-ups over microtransactions and battle passes. Best regards, a grumpy 33-year old who unboxed a Nintendo 64 in 1996 and has loved this medium ever since.",
        "comments": [
            {
                "raw_content": "They've designed the different control schemes and customization very well. They want your movements to be as smooth as the framerate. Gyro Mouse Separate sensitivity sliders Multiple inversion settings Button mapping",
                "author": "GerbiJosh"
            },
            {
                "raw_content": "I like this game but it has its flaws. The desert and yadda yadda, but I don't really care since it does what it's supposed to do - be a Metroid Prime game - really well. The \"discussion\" (or rather shit throwing) and arguments from both sides are far more annoying. Made me unfollow some of its defendants and accusers alike. Better off this way, can finally enjoy the game in peace",
                "author": "holdmypilsener77"
            },
            {
                "raw_content": "Dude the nods to Zelda and old school rpgs are so real. The desert feels like Hyrule field and ive found so many upgrades by just exploring a bit. I'm absolutely loving the game. Just got to snow belt and it is so cool. The music and atmosphere are amazing even if the NPCs butt in every once in a while. Took me a sec for it to click, but now that it has this game is hittin.",
                "author": "DredgenGrey"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "HDR implementation of Metroid Prime 4 is putting every other game to shame!",
        "score": 754,
        "text_content": "The HDR implementation in this game is seriously impressive. I am playing at only 20% of brightness on an old LG B7 Oled. The calibration at the start of the game was really simple. Even at this low level of brightness everything is perfectly clear from very bright to almost dark. This TV does not even have HGIG support and calibrating HDR in Switch 2 settings was a pain. This is the first game where I feel that HD$ is truly shining. I wonder why other games, even first party Nintendo games cannot implement this quality of HDR? In any case this bodes well for future games and hopefully the HDR implementation will get better and better.",
        "comments": [
            {
                "raw_content": "It is the only Switch 2 game so far that is simply too nice looking for me to play in Handheld Mode. Just looks too wild on a 4K screen.",
                "author": "Alernet"
            },
            {
                "raw_content": "Every other Switch 2 game",
                "author": "OkMixture5607"
            },
            {
                "raw_content": "You're underselling your TV. That's an excellent TV! But also your brightness setting isn't what controls the light emission for HDR; that's another setting called OLED Light. I think it goes to 20 so anything above 15 would be bright (as it should be) depending on your room. My experience is the older TV's are easier for HDR. I have none of the issues people complain about with S2 on my 4 year old Bravia. Did you have issues on other Nintendo games for 2? The biggest different for me is MKW and Bananza don't have much going on HDR-wise. It's just not used much and I think people think it's their TV when it's the game. Metroid is very clearly using it and we'll. Like Cyberpunk.",
                "author": "junglespycamp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "“Physical” games I have so far!",
        "score": 61,
        "text_content": "What does your lineup look like so far in terms of physical games? Would love to see everyone’s lineup!",
        "comments": [
            {
                "raw_content": "I got legends za, age of imprisonment, Hitman, and Yakuza 0 for physical switch 2 games! Love them! I’m waiting on AC shadows for a bit until a sale and patch released!",
                "author": "FireEmblem47"
            },
            {
                "raw_content": "Only physical game I bought since getting my Switch 2 is Final Fantasy Tactics Ivalice Chronicles.",
                "author": "OfficialNPC"
            },
            {
                "raw_content": "Only physical game I have is BOTW",
                "author": "Re7oadz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just started my second playthrough of BOTW (first time on switch 2)",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's honestly like playing a new game. I've been playing it again and I'm in awe of how awesome everything looks.",
                "author": "frankie_donkiebrains"
            },
            {
                "raw_content": "I last played it on wiiu and started another playthrough on switch 2. Definitely a night and day difference. I do enjoy totk more I think though",
                "author": "ChissInquisitor"
            },
            {
                "raw_content": "Korok forest will amaze you on switch 2",
                "author": "BelowAverageSloth"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Absolute cinema ✋️😐🤚",
        "score": 21,
        "text_content": "Sometimes they're just lined up perfectly for one swift sequence.😅 Game: AC Shadows.",
        "comments": [
            {
                "raw_content": "It's great to see games like this running so well on a device like the Switch 2, given its size. Props to Ubisoft again.",
                "author": "uchuskies08"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thanks Ubisoft for this banger of a port!",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ve hesitated to ask, because I don’t want to call out any one specific person/post… So please don’t take this personally. Anyone else wonder how many of these posts are legit? It just seems like there’s a flood of posts that skate between fan post that doesn’t delve into the game, and ad.",
                "author": "gobobro"
            },
            {
                "raw_content": "Is this game any good if you’re a more casual Star Wars fan?",
                "author": "SharpPink_GlitterInk"
            },
            {
                "raw_content": "Man I know this game kinda flew under the radar at its original launch, but I gotta say, I LOVED the hell out of it. The \"old star wars\" aesthetic, the rep system, tailoring loadouts to your playstyle, I thoroughly enjoyed it.",
                "author": "Playful_Lecture7784"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game is so much better than the Switch one. It is actually playable now, and it looks great.",
        "score": 14,
        "text_content": "Game: fortnite",
        "comments": [
            {
                "raw_content": "I haven’t played Fortnite since 2018. Looks quite a bit different.",
                "author": "VaughnFry"
            },
            {
                "raw_content": "Got a ps5 and yet I still prefer playing this on Switch 2 cause the Pro Controller 2 is goated.",
                "author": "skag_boy87"
            },
            {
                "raw_content": "Yea it’s not my main way of playing but at least you aren’t suffering anymore at sub 30fps.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you guys getting any of the Resident Evil titles?",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the Switch 2 will be my hardware of choice for Requiem. The other 2 i'll probably wait until they go on sale.",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "I plan get the 3 game bundle.",
                "author": "Mysticwaterfall2"
            },
            {
                "raw_content": "2 spooky 4 me",
                "author": "PjDisko"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] The Game Awards 12.11.25",
        "score": 385,
        "text_content": "|| |:-:| |**The Game Awards 12.11.25**| |**Date/Time:** December 11, 2025 [7:30PM EST](https://dateful.com/eventlink/3026395181) (Click for your Timezone) | |**Where to Watch:** [TGA's Youtube](https://www.youtube.com/@thegameawards), [IGN's Youtube](https://www.youtube.com/c/IGN) | |**[What to expect](https://thegameawards.com/faq)**",
        "comments": [
            {
                "raw_content": "Kinda early, no?",
                "author": "4000kd"
            },
            {
                "raw_content": "1. Total Warhammer 40k. 2. Star Wars Kotor Remake 3. Light No Fire 4. TES6 promo That's the Christmas list for this one boys.",
                "author": "Skeletor_with_Tacos"
            },
            {
                "raw_content": "This is the one. The Legend of Dragoon returns. Edit: Glad to see love for this game is still alive.",
                "author": "Ok-Assistance-3213"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tainted Grail: Fall of Avalon DLC has leaked on the Xbox store.",
        "score": 159,
        "text_content": "Uma foto em uma postagem no fórum /taintedgrail vazou o DLC chamado “Sanctuary of Sarras”. [Aqui](https://www.reddit.com/r/taintedgrail/comments/1pgpsrr/what_is_this/) A página Tainted Grail no X já estava postando algum conteúdo não presente no jogo, o que levou todos a acreditar que se tratava de uma atualização futura. [Aqui](https://xcancel.com/TaintedGrail_AR/status/1997721367211597977#m) e [aqui](https://xcancel.com/TaintedGrail_AR/status/1997350324483621282#m) \\----------------- Apenas para contextualizar, Sarras é uma ilha mítica e um local lendário no ciclo de histórias arturianas, para onde o Santo Graal é levado. Então pelo menos o DLC é condizente com algo presente na história, e no jogo (se não me engano) alguns personagens vão em busca do Santo Graal e desaparecem da história. Não sei se um jogo indie como Tainted Grail conseguiria aparecer na TGA, mas parece uma boa previsão a considerar.",
        "comments": [
            {
                "raw_content": ">A photo in a post on the /taintedgrail forum leaked the DLC called “Sanctuary of Sarras”. >The Tainted Grail page on X was already posting some content not present in the game, leading everyone to believe it was a future update. \\----------------- >Just to contextualize, Sarras is a mythical island and a legendary location in the Arthurian cycle of stories, where the Holy Grail is taken. >So at least the DLC is consistent with something present in the story, and in the game (if I'm not mistaken) some characters go in search of the Holy Grail and disappear from the story. >I don't know if an indie game like Tainted Grail would manage to appear at TGA, but it seems like a good prediction to consider.",
                "author": "ThucydidesJones"
            },
            {
                "raw_content": "Really liked tainted grail but I had such a bad experience with it crashing non stop on ps5 during the last half of the game I didn’t finish it and it left a bad taste unfortunately. I may try and get back into it",
                "author": "StoneShadow812"
            },
            {
                "raw_content": "I am glad this did well enough to get more content. Out of all of the Scrollslikes I think this came the closest to capturing the magic.",
                "author": "Crazykiddingme"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AOOSTAR MAX+ 395 Mini-PC features 140W TDP mode, 128GB LPDDR5X-8533 memory and 2800+ USD price tag",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do they still include spyware with their mini pc's?",
                "author": "ConsistencyWelder"
            },
            {
                "raw_content": "I’ve never seen another chip getting a separate post every time there’s a niche mini pc from a no name oem with no global presence using said chip quite like strix halo. All that and we’re yet to see a third device (whether a mini pc or handheld or a laptop or a tablet) from a top 5 vender after almost a full year since release.",
                "author": "996forever"
            },
            {
                "raw_content": "I just wanted a 385 with less than 2000$ worth of ram on it",
                "author": "mokkat"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Job cuts hit over 1.1 million on 2025",
        "score": 123,
        "text_content": "https://m.",
        "comments": [
            {
                "raw_content": "Layoffs while corporations complete massive stock buybacks in 2025. \"American Companies Are Buying Their Own Stocks at a Record Pace Buybacks are expected to top $1.1 trillion in 2025, led by big banks and tech firms\" https://www.wsj.com/finance/stocks/stock-buybacks-2025-3b0ddedd",
                "author": "WufBro"
            },
            {
                "raw_content": "Stock market in record highs though. Just insanity.",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "Wanna know what will make this housing market a lot like the 08 crash? Unemployment above 10% like it was then.",
                "author": "Buuts321"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Powell on Track for Fed Rate Cut Despite Some Dissent",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It'll be funny if the 10 year yield rises or stays flat given how much debt the current administration is generating.",
                "author": "WufBro"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/87AfL Takeaway: - Federal Reserve Chair Jerome Powell is expected to push through another quarter-point interest-rate cut this week despite growing unease among fellow policymakers that inflation remains too high. - The Fed's decision comes after a government shutdown limited the availability of fresh economic data, and economists expect the Fed to take a break before two more reductions in 2026. - President Donald Trump is expected to name a successor to Powell soon, with Kevin Hasset as the frontrunner, prompting worries that the next chair will pursue rate cuts at Trump's direction and risk spurring inflation.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Can’t see any good reason for dissent tbh. Inflation isn’t high and on the items that are higher, rates are doing nothing to touch them. Meanwhile, rates being restrictive while unemployment is rising is absolutely bad policy.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What’s the chance AI is actually gonna be TIME’s person of the year?",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "40%",
                "author": "Plenter"
            },
            {
                "raw_content": "Look through the history. There was been equally wild ones",
                "author": "Difficult-Candy-4341"
            },
            {
                "raw_content": "i think you wait till the year humanoid robotics take off to make them person of the year if you're going to do this sort of thing, but no idea if they're that forward looking.",
                "author": "Healthy_Razzmatazz38"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "They served well up to 2024, I don’t know what happened to them",
        "score": 451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They were perfectly named honestly",
                "author": "OldGord"
            },
            {
                "raw_content": "When the big cloud boys joined the race, all the ai companies started to fade just like what happened in the cloud race. Money and a mass amount of staff wins",
                "author": "airsoftshowoffs"
            },
            {
                "raw_content": "I really like their style, very cinematic rather than purely realistic. But look at the details and Midjourney images just fall apart.",
                "author": "piggledy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is how we build on Mars: GITAI autonomous robots assembling a 5-meter communication tower for off-world habitats.",
        "score": 30,
        "text_content": "This demo by **GITAI** (a space robotics startup) showcases their *\"Inchworm\"* and Rover robots cooperatively building infrastructure in a mock lunar environment (Mojave Desert). **The Breakdown:** * **The Task:** The robots successfully assembled a **5-meter communication tower,** installed antennas and connected power cables all without direct human hands. * **The Tech:** The \"Inchworm\" arm features grapple end effectors on both ends, allowing it to act as both a hand and a foot. This lets it **climb the structure it is currently building** to reach higher levels. * **Scale:** They are also demonstrating tasks like welding panels, changing rover tires and excavating regolith. This is the **missing link** for colonization. Before humans arrive on Mars or the Moon, fleets of autonomous units like these will need to land first to build the habitat, solar array and comms tower. **The Goal:** GITAI aims to reduce space labor costs by **100x** and remove the risk of EVA (spacewalks) for simple assembly tasks. They have already passed DARPA LunA-10 selection for lunar architecture. **Does this convince you that a lunar base is actually feasible in the next decade or is the harsh environment (dust/radiation) still too much for current robotics?** **Source: GITAI** 🔗 : https://x.com/GITAI_HQ/status/1997335375975485565?t=2p8-h9BK_2qOlYbI8IyAOw&s=19",
        "comments": [
            {
                "raw_content": "I'll pay off my own bank account to send Musk up there to supervise operations",
                "author": "ClickF0rDick"
            },
            {
                "raw_content": "Update from the official source (GITAI on X): https://preview.redd.it/0b8hd2dr0y5g1.jpeg?width=1080&format=pjpg&auto=webp&s=430404ccb9ff9b43ecef83cb14ec82b1b48ea9b2",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Flash on LMarena",
        "score": 137,
        "text_content": "Seahawk and Skyhawk. One is definitely 3 Flash, the other might be 3 Flash Lite or another checkpoint",
        "comments": [
            {
                "raw_content": "I really really want real time native voice to voice with Gemini 3 Flash. My most looked forward to feature in Q1 if we're lucky.",
                "author": "showMeYourYolos"
            },
            {
                "raw_content": "About time",
                "author": "lordpuddingcup"
            },
            {
                "raw_content": "Maybe one day Google will stop optimizing for this god awful benchmark and their models will be even further ahead of the competition. Imagine how good Gemini would be if they focused on hallucinations instead of optimizing for a benchmark that encourages them",
                "author": "LazloStPierre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The era of jobs is ending",
        "score": 628,
        "text_content": "Very worthwhile article for the writing and the passion alone. But if you don't have the time, here are some AI-generated bullet points: * **AI + robotics are accelerating the collapse of “jobs as duty.”** Most people still think of 2022-era ChatGPT, but newer systems already handle large chunks of office work (docs, code, analysis, planning) and robots are creeping from “awkward demos” toward replacing physical routines—meaning the job-based survival system is heading for a hard collision with machines that don’t need humans. * **The core target isn’t “work,” it’s the coercive institution of jobs.** The essay argues humans will always *work* (create, care, tinker), but *jobs* are an architecture that ties dignity and survival to market usefulness—shaping identity (“what do you do?”), morality (“hardworking = good”), and time itself (life as a timesheet). * **Jobs cause social/psychological/spiritual damage—especially “bullshit work.”** A lot of modern labor is portrayed as ritualized busywork (emails, meetings, metrics theater) that breeds dissociation, conditional self-worth, and a split self: one performing employability, one grieving their real life. * **Automation will hurt unless we build a transition narrative + safety net.** Jobs currently provide structure, community, and identity; mass redundancy without replacement institutions risks despair, not liberation. * **A post-job world requires decoupling survival from employment.** Proposed contours: universal basic services (housing/health/education/mobility/internet), income floors (UBI/variants), shorter workweeks, fair rotation of necessary unpleasant tasks, stronger labor protections, taxing automation gains, and more public/co-op ownership of AI infrastructure. * **Meaning shouldn’t be monopolized by employment.** The essay imagines new “temples of meaning” (libraries, makerspaces, studios, clubs, gardens, research hubs) where status comes from contribution, care, curiosity, and creation—plus a revalidation of leisure as the precondition for art, thought, and a life that’s actually yours.",
        "comments": [
            {
                "raw_content": "I will be so curious to see how all of this works out. I do worry and a decent amount. I live half time US and the other half in Bangkok. I suspect the robots are going to enable manufacturing to move back to the US and putting out of work millions of South East Asians. This is an area that is not talked about that much that should be huge and an opportunity for investors. I am NOT talking robots that look like humans. I am talking robots that put screws in boards and things like that.",
                "author": "bartturner"
            },
            {
                "raw_content": "I mean i hope so. I f. hate jobs",
                "author": "Comfortable_Bat2182"
            },
            {
                "raw_content": "Governments better make sure this can benefit everyone then instead of just a select few.",
                "author": "Fable-Teller"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The singularity is near...",
        "score": 263,
        "text_content": "[Cosmo announces breakthrough Phase III Topline results from Scalp 1 and Scalp 2 for Clascoterone 5% Solution in male hair loss, showing up to 539% relative improvement in Target-Area Hair Count vs placebo; US and EU submissions are underway - Cosmo Pharmaceuticals NV](https://www.cosmopharma.com/news/cosmo-announces-breakthrough-phase-iii-topline-results-from-scalp-1-and-scalp-2-for-clascoterone-5-solution-in-male-hair-loss-showing-up-to-539-relative-improvement-in-target-area-hair-count-vs-place)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/maq2hyrz4u5g1.jpeg?width=1056&format=pjpg&auto=webp&s=228ee44329531217d6adc9f5fe0433df658fc6b3",
                "author": "agonypants"
            },
            {
                "raw_content": "Now hearing loss and tinnitus please",
                "author": "Ok_Conclusion_1065"
            },
            {
                "raw_content": "Así must be.",
                "author": "Damiandcl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A human from 10000 years ago would have been able to learn how to drive a car",
        "score": 48,
        "text_content": "I'm not anti scaling, it has loads of uses, might even take us to AGI with only one or two other upsets on the level of reasoning tokens, but I feel like in chasing short term deliverables and competing in the same field some teams have lost sight of other possible avenues. In this universe when it comes to a level of general intelligence that's useful to us we have a single data point, n = 1, us. Other animals would be called weak general intelligence at absolute best. So idk why more isn't done to replicate how our general intelligence came about, artificially, to get AGI. Isn't relying on troves of data putting the cart before the horse and/or a crutch? lots of knowledge definitely can be a substitute for intelligence, especially with an ability to chain/blend knowledge together. but it's not AGI as we know. If humans could evolve general intelligence sufficient to drive a car long before inventing writing, then why does training AGI require reading more than a billion times what the most well read person? imo, it doesn't. imo with enough compute we can probably get there with a sufficiently crafted simulation. as for the details of such a simulation, I'm definitely not qualified, all I am sure about is obviously computing individual atoms, molecules, even cells (except maybe neurons) is a waste of compute. it doesn't need physics identical to ours because just like we can adapt to a VR game with wacky physics super easily, they would be able to adapt to our physics super easily provided it was remotely similar. but it probably can't be done in an environment too simplified, idk if an \"AGI\" evolved from a minecraft world could ever generalise to our world sufficiently, it'd be like humans trying to work in 4D I think, probably impossible. use visual, auditory, smell, taste, and tactile input: not converting things to text and feeding them into an LLM. obviously an evolutionary \"algorithm\" worked for us, but we could probably make it more efficient. obviously most species didn't evolve to our level of intelligence, in fact like >99.999% didn't. so the simulation should definitely be guided by a supervisor/manager. creating an environment where intelligence is more rewarded than on earth, and other evolutionary approaches like rabbits breeding and hiding are not rewarded past an early point (where hiding might be the most intelligent behaviour seen so far). honestly it'd probably be slow enough that a person could be watching for milestones and pressing the next stage button. since we're basically starting from 700 million years ago, if the simulation was ran fast enough to complete the goal of AGI in 1 year from start, that'd mean that each 6 minutes in real time would be equivalent to 7990 years of our evolution -> 700000000years/(24h*365)/10 = 7990 which isn't that long, obviously if you believed in this working you could leave a couple humans on shift 24/7 for a full year with no gaps. the compute is the hard part. simulating skyrim in real time with it's grossly simplified physics is fine, but simulating a complex world with ideally as many AGI candidates as you can, millions of them at a time ideally, at 700mil times real time? not so easy! well as I say, we would try and make evolution go a bit faster, rely on luck less, reward intelligence more, focus less on things like evolving sweat glands and crap so maybe we could get 70x more efficient than irl evolution, ofc that's a number pulled out of my arse, but you get the idea. still hard to simulate. anyway, I've rambled more than enough. the fact the world leading experts apparently don't agree probably means I'm wrong, seen zero of them calling for anything remotely similar, but personally I figure stick with what works. this problem has been solved exactly once that we know of and instead of trying to use the first solution as even inspiration they're trying to solve it in a completely different and novel way and that just seems wrong to me.",
        "comments": [
            {
                "raw_content": "Rest assured all labs are trying hard to find better and more efficient methods, including trying to model human intelligence. Specifically learning fast from small amounts of data is one of the areas of research. Scaling is the most straightforward but also by far the most expensive method to more intelligence.",
                "author": "Gallagger"
            },
            {
                "raw_content": "I think what you've overlooked is the sheer amount of data that the human mind receives from all of its senses. By the time that a human being is two years old, that person has seen more visual data than all that we use to train LLMs.",
                "author": "crimsonpowder"
            },
            {
                "raw_content": "AI is something completely different than human brain. I wouldn't necessarily say that it's worse, but it's just very different. It has different strengths and different weaknesses. However, pretty much every lab is trying to develop something more general, something that can fidure out things on its own. This has been a theme for a while, pointing out that humans can learn from a small fraction of the data than an LLM.",
                "author": "Singularity-42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I built a 'Learning Adapter' for MCP that cuts token usage by 80%",
        "score": 15,
        "text_content": "Hey everyone! 👋 Just wanted to share a tool I built to save on API costs. I noticed MCP servers often return *huge* JSON payloads with data I don't need (like avatar links), which wastes a ton of tokens. So I built a \"learning adapter\" that sits in the middle. It automatically figures out which fields are important and filters out the rest. It actually cut my token usage by about **80%**. It's open source, and I'd really love for you to try it. If it helps you, maybe we can share the optimized schemas to help everyone save money together. Repo: [https://github.com/Sivachow/mcp-learning-adapter](https://github.com/Sivachow/mcp-learning-adapter)",
        "comments": [
            {
                "raw_content": "A lot of this stuff relies on cache hits so you might not be saving as much as you think.",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "Hey yo this has been done why dont you add your ideas onto https://github.com/Chen-zexi/open-ptc-agent. You might be able to improve that approach drastically or borrow ideas",
                "author": "cloudyboysnr"
            }
        ],
        "subreddit": "singularity"
    }
]