[
    {
        "post_name": "BREAKING: The NFL’s first transgender cheerleader has abruptly quit The Panthers just days before the start of the season. Bye Bye.",
        "score": 649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a man.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Please tell me that's not its balls hanging out 🤮",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Headline is a lie. There is no such thing as transgender. That is all.",
                "author": "BahamaDon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "55 MILLION?!",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wait till we find out only like 10 million are for work, and the rest are spouse/child/parent/cousin/niece/nephew/bullshit dependents I've always been curious about how far chain migration goes",
                "author": "nuhbin3"
            },
            {
                "raw_content": "If ever there were a time to pull a total moratorium on migrationof all kinds,this would be it",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "\"Thank you so much in investing 4 months of your life to apply with this company, where we lead you into thinking it's ok to give a two weeks notice and put your household income in jeopardy. Unfortunately, we decided to move forward with another applicant. We won't tell you by the way that it's because you are white and or a male. We don't actually wish you the best of endeavors but pretend to give a shit because that's what was typed in the memo from Jafar in India. Regards, HR DEI Representative who moved from a liberal state destroyed by my voting habits. *Sent via email from my remote job at home in an HOA that was built over a farm from eminent domain.\"",
                "author": "TheWingedStormfag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OMG",
        "score": 306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine where we’d be right now if this cunt was elected",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "She the one that would enjoy her “time in the barrel”.",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "Walz is here for a stomach full of cum. Is that on the menu?",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom - “woke is dead”",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"You know, I am something of a non-woker myself.\"",
                "author": "cyberrigger"
            },
            {
                "raw_content": "He's abusing the AI programs again",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Lol faggot trying to be like Trump",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steak 'n Shake unleashes on Cracker Barrel",
        "score": 1109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pass the tallow.",
                "author": "rugburnd"
            },
            {
                "raw_content": "Damn. There’s one nearby. I might go in there for a shake tomorrow just to show a little support.",
                "author": "One-Man_Riot"
            },
            {
                "raw_content": "Justice for old timer !",
                "author": "Dispatch911"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. pauses all issuing of worker visas for commercial truck drivers as the increasing number of foreign drivers \"is endangering American lives and undercutting the livelihoods of American truckers.\"",
        "score": 1801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do H1Bs",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Now revoke all of the street shitters visas and send them home on a slow boat",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "**I VOTED FOR THIS**",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Welcome",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Land o lakes got rid of the Indian, kept the land. Still funny",
                "author": "thoughtcriminal"
            },
            {
                "raw_content": "We should start a betting pool on who or what is next. Colonel Sanders and Mr. Clean could be danger.",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "Inch by inch American Culture is being removed. Everything is becoming bland canvasses. All same. Harrison Bergeron .",
                "author": "RuleoVicus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 HOLY CRAP: Trump is setting up for something bigger than Washington DC. He's going to first prove to the public that it CAN be done - blue cities can be cleaned up. Then? \"We're going on to OTHER places.\" Major cities across the homeland are next.",
        "score": 1160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love what he's doing. Make DC the example to prove it can be done. The question is what city is next? And I stress \"one\" city so they can concentrate forces (don't get spread too thin). The city should be manageable in size (so not NYC or LA, yet). But still a major city in terms of population. I'm thinking Philadelphia? Pretty blue, but lots of working class that would support this. Maybe Miami? Blue, but not as much, and sitting in a deep red state overall. Any other candidates for the next Dem-run crime-ridden city to be cleaned up?",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "I'm all for it, but what authority would he have over other cities? DC is a special case, being federal and everything -",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Do big cities in red states next. Clear out the riffraff",
                "author": "salbro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Update from Boston Mayor",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CNN: \"is this doctored?\"",
                "author": "Choppermagic"
            },
            {
                "raw_content": "What are star bellies?",
                "author": "Alaskan"
            },
            {
                "raw_content": "she love you long time",
                "author": "austford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Supreme Court rules 5-4 that Trump can cut $783 million in NIH \"diversity, equity, and inclusion\" funding — AP",
        "score": 1842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "5-4? Why is this complicated?",
                "author": "guidothekp"
            },
            {
                "raw_content": "Which Moron sided with the DEI idiots?",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "4 faggots siding with DEI. what a joke",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Watch as hundreds of D.C. (paid) protesters chant Black Lives Matter while President Donald Trump prepares to tour with law enforcement 📌#Washington | #DC",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had the privilege the other day of flipping off an entire group of \"No Kings\" protestors on a bridge over the freeway. Drove right past them, flipping them off and telling them to go fuck SOROS. It was fun, got them angry and then the best part....1 hour later I drove past them again and did the same thing lol",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "I don't think that gives the optics they hope it does. Trump ia about to go Crack down on crime, and they're out there yelling about black people? Why yes, I too agree the darkies are responsible for crime. Thanks for admitting it",
                "author": "Mcrumples"
            },
            {
                "raw_content": "This shit again ?",
                "author": "hughjasske69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAKE WASHINGTON, D.C. GREAT AGAIN!",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're gonna need a bigger boat....back to afriKa",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Knock down every square centimeter of public housing, then sell the lots to young Whites for pennies on the dollar and allow them to build their own homes there. And yes, I do mean build their own homes, not hire contractors to build them, especially not illegal aliens. That's how you make DC great again",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115069649774874469",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Gavin Newsom signs legislation to gerrymander California for +5 Democrat seats before the 2026 Midterms, now requiring a special election Gavin has promised on MAGA Republicans: \"We're gonna punch these sons of b*tches in the MOUTH.\"",
        "score": 923,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So basically he ignored the voters on this.",
                "author": "Greenhills"
            },
            {
                "raw_content": "Please support Mike Lindell of MyPillow to fight for election integrity! His legal battle against Dominion Voting Machines is still ongoing. https://patriots.win/p/19BtL8YNaE/",
                "author": "DCPower"
            },
            {
                "raw_content": "I dont give a shit about California. Once the census is redone they will lose all of those seats and more.",
                "author": "gbfloyd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEI judge releases the violent criminals who attacked Big Balls",
        "score": 453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hunt these fucks down and end them. If the judges don't take a hint, end them too.",
                "author": "Nephrum"
            },
            {
                "raw_content": "I'm sure someone with more integrity can find some excuse to arrest them again immediately, they always can when they really want to.",
                "author": "splink"
            },
            {
                "raw_content": "At some point, good men will have to just start dealing with these little baboons ourselves.",
                "author": "Snooptwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Consummate Performer",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# The lefts says they only care about violent crime. Then, they say they don't care about violent crime as long as their fake numbers show a decline. So, what crime do they care about?",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "They just simply do the opposite Trump is doing, like they did the first term.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Next up- visiting a Children's Hospital with a box full of puppies.",
                "author": "RobinNet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Failed politician Stacey Abrams says Trump is a \"Grand Ayatollah\" with \"mystical power.\" \"Elections are not real.\"",
        "score": 737,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She ate a batch of special brownies and weed gummies someone left out",
                "author": "killedmytv"
            },
            {
                "raw_content": "When you love KFC so much you have a framed poster of black Colonel Sanders hanging in your home.",
                "author": "orcwordlaugh"
            },
            {
                "raw_content": "I’ll agree with the “elections are not real” part. None can be validated.",
                "author": "Fundadores"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UPDATE: Villanova is now saying the active shooter situation was a “CRUEL HOAX”. WTF? Someone wanted to TERRORIZE the opening mass. And they succeeded. FBI needs to find this person and put them in PRISON!",
        "score": 1169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever phoned it in should be flogged.",
                "author": "OrthodoxTemplar"
            },
            {
                "raw_content": "I'm not a gambling man, but if I was, I would bet literally all my money that if there is a man going around claiming he's a woman on campus, it was him. He called in the fake active shooter because Orange Man and Christ Man bad.",
                "author": "agave_lime"
            },
            {
                "raw_content": "Mass should always be capitalized.",
                "author": "THELEADERSOFMEN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Marketing Manager",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trannys at Hooters is next.",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "Cracker Barrel CEO - Julie Felss Masino > The surname **Felss** likely originated as an English or Jewish (Ashkenazic) variant of the name Fels, meaning \"rock\" or \"cliff,\" or Fell, which means \"hill\" or \"mountain\". The \"ss\" ending is either a plural form or a post-medieval addition to the name. Every single time. The omission of the hyphen fooled me, but not for long.",
                "author": "MythArcana"
            },
            {
                "raw_content": "...what did I miss?",
                "author": "slimcoat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Minnesota DFL is REVOKING the party's endorsement of Democrat Socialist Omar Fateh for Minneapolis Mayor after there were “substantial failures in the convention’s voting process.”",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# He won't be the captain now",
                "author": "CommieCrats"
            },
            {
                "raw_content": "# ThErE iS nO sUcH tHiNg aS eLeCtiOn fRaUd.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "Some will claim this picture is AI I still can hardly believe it is real!",
                "author": "Ligersrule1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: President Trump delivers dozens of pizzas to DC law enforcement",
        "score": 717,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When he was a patient at the Walter Reed Army Hospital in Bethesda, Maryland, I kept vigil for him outside the hospital for 3 days, with hundreds of other patriots. During the daylight hours we had dozens of pizzas delivered every hour. I've never eaten so much pizza in my whole life. It was an incredible experience!",
                "author": "Trump2024"
            },
            {
                "raw_content": "McDonald’s drivethru, garbage truck driver, pizza delivery… who else but Trump",
                "author": "Pepe_longcockings"
            },
            {
                "raw_content": "Just like he sent pizzas out to well wishers when he was briefly in the hospital. Nice guy",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "12VHFRPWR Connector Claims its First AMD RX 9070 XT Victim",
        "score": 212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Figured it was only a matter of time.",
                "author": "Best_VDV_Diver"
            },
            {
                "raw_content": "AFAIK only 3 cards in that AMD generation use the connector. The AsRock 9070 XT Taichi they're talking about and both the Sapphire 9070 + 9070 XT Nitro. In case you're thinking about getting those.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": "this spec is cursed atp",
                "author": "skyagg"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel Reportedly Starts Glass Substrate Licensing, Offering Potential Boost to Samsung and Absolics",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">As the report highlights, this marks a strategic shift in Intel’s glass substrate business. Rather than prioritizing in-house production, the company is now expected to rely more heavily on external suppliers. ... >In the meantime, with mass production not anticipated until 2030, Intel appears to be turning to licensing as a way to monetize its technology. As the report points out, the company’s ongoing struggles in foundry operations are widely viewed as a key factor behind this shift.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA on RVA23: “We Wouldn’t Have Considered Porting CUDA to RISC-V Without It”",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It still surprises me that the bigger vendors with in house hardware development haven't begun reducing or eliminating ARM from their stacks and moving to RISC-V.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Well, a CPU architecture's usefulness today sinks a lot if it has no SIMD to speak of. RVA23 finally makes vector (SIMD) extensions mandatory, after them being missing for years. Those SIMD extensions also happen to be RVV with no alternative, which I'm not sure is a good thing. With Arm, there's Neon as an alternative to the variable-width SVE/SVE2, RISC-V only has the complicated variable-width SIMD instructions.",
                "author": "jocnews"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Reportedly Ends H20 GPU Production, Makes Room for B30A",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Liquid Cooling to Scale in AI Data Centers, Penetration to Surpass 30% in 2025",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jiushark JF15K Review: An air cooler like none other",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shame that too many space-constriction related compromises making this practically unviable",
                "author": "SunnyCloudyRainy"
            },
            {
                "raw_content": "For what it's worth, the swept area of dual 90mm fans is only about 12% greater than a single 120mm fan, and 5% less than a 130mm. Not too surprising that performance would be about the same as other dual tower coolers. Watercooling continues to be the only effective way to get more thermal dissipation than can fit in the clearance zone around the socket on a modern motherboard.",
                "author": "Thrashy"
            },
            {
                "raw_content": "/u/bizude I would like to see if there is a higher-than-placebo benefit to the airflow over the DRAM and over the VRMs. I don't know if that testing would require a reliable motherboard and HWinfo readings or additional thermistors. Also, it would be a nice edit to include which platforms the mounting hardware is for. A little googling turned up the product page which reports a welcome breadth for people like me with an older CPU. Intel:LGA 1200/115X/1700 /1851/2011 and AMD:AM4/AM5",
                "author": "hieronymous-cowherd"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Kioxia Achieves Successful Prototyping of 5TB Large-Capacity and 64GB/s High-Bandwidth Flash Memory Module\"",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No mention of latency, but this wants to be a PCIe flash replacement for DRAM. Same idea as CXL memory, but it looks like they're too ashamed of the latency numbers to talk about them at all.",
                "author": "tux-lpi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "USB-C / Thunderbolt docking station or port extender with VRR support?",
        "score": 1,
        "text_content": "As the title says – does anyone know of a USB-C or Thunderbolt docking station (or even just a port extender) that actually supports VRR? I’m trying to upgrade my current home office setup, but no matter how I search, I just can’t seem to find one. Already went through a bunch of blogs and even asked AIs, but still came up empty. Any leads would be super appreciated!",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Donkey Kong Bananza’s Dig Button Placement Is All Thanks To Miyamoto",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the biggest non issue. It makes intuitive sense for B to be smashing down, but if you don’t like it, they made it super easy to remap in settings.",
                "author": "Daveyjones25"
            },
            {
                "raw_content": "I don’t understand the complaints. The buttons are set to the direction that DK punches (up down and forward). It’s perfect IMO.",
                "author": "w1ckizer"
            },
            {
                "raw_content": "I’m so use to swapping between PlayStation and Nintendo and the controls being swapped for select and back that it really doesn’t feel like a big deal anymore when the controls are flipped for something.",
                "author": "4umlurker"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hmm starting to not like my weather app",
        "score": 280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Objectively hilarious",
                "author": "Kenomachino"
            },
            {
                "raw_content": "Is this real? If so this is hilarious",
                "author": "Joventer567"
            },
            {
                "raw_content": "I love Carrot!! Been using it since 2019.",
                "author": "navidee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2s seem to already be in stock everywhere without fail",
        "score": 263,
        "text_content": "Every Walmart and Target I've been into has had multiple Switch 2s in stock everytime I've been there, surprised the whole stock shortage ended so quickly and that they're just straight up always in stock and available already. And I work at one of these Walmarts so I know they're always in stock because I see it every day lol",
        "comments": [
            {
                "raw_content": "Incredible job by Nintendo to keep producing consoles.",
                "author": "twovles31"
            },
            {
                "raw_content": "It's almost like they told us this was their plan.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "I have yet to see a Non-Mario Kart World bundle either",
                "author": "WeAreNephilim"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hollow Knight: Silksong",
        "score": 1207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "American's confused thinking why did you post the 9th of April...",
                "author": "rub3nius"
            },
            {
                "raw_content": "Sometimes it just feels good to see the date in the order you are used to, lol",
                "author": "Successful-Bar2579"
            },
            {
                "raw_content": "Anyone know the price?",
                "author": "DrSussBurner"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elden Ring: Tarnished Edition Runs So Badly On Switch 2 That Bandai Namco Isn't Allowing Recording At Gamescom",
        "score": 985,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, it does say up front that it's the Tarnished edition.",
                "author": "bransby26"
            },
            {
                "raw_content": "If it's not in a solid finished state, why even bother demoing it? I feel like this is just bringing bad press.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Anyone surprised by this is blinded by their love for From. Their games are great, but they’ve always been awful at optimization and performance.",
                "author": "Avawinry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No More Excuses on Bad Optimization",
        "score": 297,
        "text_content": "If Cyberpunk 2077 can run well, so should Elden Ring. I'm so sick and tired of these companies who put in minimum effort to port over games. If you can't get it functioning on Switch 2, FromSoft, pass it off to Panic Button or someone to do it for you. We spent a lot of money on this console for a more powerful experience. No more excuses on poorly optimizing it and giving the fans the middle finger. Elden Ring is one of my favorite games of all time. I have it on Series S, a console about as powerful as the Switch 2, and it runs very well. I was going to double dip just to have an option of playing it portable, but now I'm thinking twice about that. Get your shit together, FromSoft, and give the fans the experience they deserve.",
        "comments": [
            {
                "raw_content": "Unfortunately, bad ports is not gonna end and that's not an issue exclusive to Nintendo consoles. Look the amount of bad ports on PC in the last couple of years. But regarding Switch 2, I think it's pretty obvious how some of these publishers do the most bare bones ports for Switch and now Switch 2. Nobody is expecting these current gen games to look and run the same way they do on PS5 and Xbox. But come on, there's a lot of games that were cross gen, there's no excuse for ports to look/run worse than a base PS4, when Switch 2 is way more capable. That being said, it just show how the audience is incredibly selective when it comes to which games with performance issues are a problem. While I think the majority is rightfully pointing out that FromSoftware is not the best when it comes to optimization, you know the narrative that will go around is how it's Switch 2 fault... just because Elden Ring is a beloved game, completely ignoring how this game doesn't have stable performance in every platform.",
                "author": "linkling1039"
            },
            {
                "raw_content": "There are poorly optimized third party games on every platform that has ever existed. It’s not going to change, there will always be games that are too ambitious or have minimal effort put into their port.",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "1. Cyberpunk ain't perfect. 2. Elden Ring isn't out yet. Wait and see how it ruins when it's released",
                "author": "Versucher42"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ITS TRUE",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Notice they didn't say of what year. 😝",
                "author": "Nosey_Neighbors"
            },
            {
                "raw_content": "What game?",
                "author": "Disastrous_Ad7575"
            },
            {
                "raw_content": "What is this about?",
                "author": "EpicQuackering437"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Elder ring switch 2 gameplay",
        "score": 232,
        "text_content": "Finally found a gameplay of Elder Ring on switch 2 dockes",
        "comments": [
            {
                "raw_content": "Docked footage doesn’t look that bad tbh. Guess it’s the handheld mode that needs more work",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Really need to see handheld",
                "author": "AverageJun"
            },
            {
                "raw_content": "Man this makes me excited of a new generation of Nintendo fans having access to this kind of games.",
                "author": "residentbio"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Dusk Golem]: \"From what I've heard a few times now actually, Code Veronica Remake not only is being handled by a lot of the same people as RE:2 & RE:4, but it's being treated as a big budget mainline Resident Evil game in every way.\"",
        "score": 171,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1958748949239800202?t=6isnOW5B2E6pGwUw4MghZg&s=19)",
        "comments": [
            {
                "raw_content": "As it should be. Story-wise its more what you would expect RE3 to be than what RE3 actually was. RE3 always felt like side-story in grand scheme of things. While Code Veronica actually important part of RE1-6 lore. It's that missing link where the modern RE weirdness started. First time you see Neo Wesker and such.",
                "author": "RUNPROGRAMSENTIONAUT"
            },
            {
                "raw_content": "I hope this is true because the original is one of the most richly atmospheric games ever made. I still remember seeing preview screenshots in an issue of EGM — I think — that featured a panicked scientist banging on a window because he’s locked in a room with a new enemy. Claire watches with horror, unable to help. (Incidentally, the opening scene of Jurassic World: Rebirth reminded me of this.) Character models looked so expressive, and the game seemed state of the art. It felt like no game would ever be newer — these were the kind of screenshots that makes one dream/think in hyperbole, basically. That magazine issue became, for a time, a kind of holy relic among my possessions. Really added to the Dreamcast’s otherworldly mystique. Played it at last on PS2 a few years later, and then again via the PS4 re-release. Some of the best locations in the franchise. It’s not perfect but it’s fascinating. And a masterclass in mood. That undefinable Dreamcast mystique is still intact even today, all these years later. Claire wakes up in an underground jail cell at the outset of the game, speaks briefly to her wounded captor, and then wanders upward toward the surface, armed only with a knife and a lighter. Out of the cell, down the hall, up the stairs, and out into the rain, where she’s suddenly standing in a cemetery on some weird island of horrors. tl;dr: This game is a shining star in the firmament of vibes-based gaming. Just the memory of approaching the house behind the Ashford office still haunts me…",
                "author": "AfraidoftheLark"
            },
            {
                "raw_content": "Bro this guy is actually just yapping leaks atp",
                "author": "FahdaadTD"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Former Deck Nine Games dev alleges that Double Exposure 2 new game director is a nazi, claims similar behaviour is still protected by the studio due to their lack of transparency",
        "score": 446,
        "text_content": "Alleged ex-Deck Nine developer under the account of LadyDevHeart, after claiming the existance of a supposed sequel to Life is Strange: Double Exposure being contractually mandated, and new upcoming waves of layoffs due to lack of contracts at the company, has stated further rumors regarding the internal work culture at the company and their relationship with Square Enix Europe, who holds the Life is Strange IP rights, including some quite dmaning In response to a user asking about a possible return of fan favourite character Chloe Price in DE2, username states the situation is a lot more complex between the current studio management and Square Enix, and using a metaphor implies the next game director in charge of the current project, subsequent the layoffs of both Felice Kuan and Jonathan Stauder in Decemeber 2024, respectivly former narrative and game director: >*You really need to understand that no one is driving this car.* >*It is like taking a driver's test but there is a group of eight British tourists in the backseat yelling at you, and when you asked them what they want they have to text their friends in Japan before they can give your an answer. Also in this metaphor you, the driver, have no idea what you are doing as you have never driven a stick-shift before, and are only driving because the last four drivers were killed. You are also a nazi.* >*Chloe's appearance, if it happens at all, will be reactive, directionless, and unplanned for by DE1.* OP asked them if Stephan Frost, game director for D9 and Telltale Games's *The Expanse: A Telltate Series* and current creative director at the studio, is a nazi as well and then referrring to a D9 environment artist who allegedly was responsable for the snucking of nazi dog whistles inside the game. To which they replied: >*RT was not the user attached to the P4 submits for the nazi dog whistle environment art assets. By not releasing a statement, or taking transparent action, Deck Nine allowed (and based on this comment, still allows) the harassment of RT to continue.* >*Frost is categorically not a nazi. He also categorically has no problem working at a company that protects them.* Claims of far right actors or neonazi working at Deck Nine, despite the company stated progressive goals were originally made in [a IGN article detailing many instances of toxic work culture](https://www.ign.com/articles/how-hidden-nazi-symbols-were-the-tip-of-a-toxic-iceberg-at-life-is-strange-developer-deck-nine) behind the scenes, including the afromentioned attempt by an unknown dev to put racist and neonazi symbols into Double Exposure. Previous post: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mub1k9/exdeck\\_nine\\_games\\_developer\\_makes\\_claims\\_about\\_an/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mub1k9/exdeck_nine_games_developer_makes_claims_about_an/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button) Original post from the r/Pricefield subreddit: [https://www.reddit.com/r/Pricefield/comments/1mltalu/de\\_right/?utm\\_source=share&utm\\_medium=web3x&utm\\_name=web3xcss&utm\\_term=1&utm\\_content=share\\_button](https://www.reddit.com/r/Pricefield/comments/1mltalu/de_right/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button)",
        "comments": [
            {
                "raw_content": "How the hell is this studio still active, let alone making a sequel to a game that bombed last year?",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I feel like Deck9 has to be done with the franchise after this one. I don't think the franchise is done but probably a long break between games.",
                "author": "zZTheEdgeZz"
            },
            {
                "raw_content": "This is admittedly a little confusing, so I might be missing something. Is the claim being made that the fired employee was not a Nazi or that there are multiple Nazis? Edit: LDH didn’t claim that the director was a Nazi, unless we’re counting running cover for the person who posted those graphics as being a Nazi, which is fair",
                "author": "MaximumConflict6455"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hollow Knight: Silksong release date (finally) announced: September 4, 2025",
        "score": 911,
        "text_content": "[https://www.youtube.com/watch?v=6XGeJwsUP9c](https://www.youtube.com/watch?v=6XGeJwsUP9c) Previous Rumour: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l3f8kq/natethehate\\_hollow\\_knight\\_silksong\\_is\\_releasing/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l3f8kq/natethehate_hollow_knight_silksong_is_releasing/) r/GamingLeaksAndRumours Hall of Famer right here, Ladies and Gentlemen...",
        "comments": [
            {
                "raw_content": "Back to the Half-Life 3 mines we go.",
                "author": "Victor4156"
            },
            {
                "raw_content": "They didn’t specify the year, btw.",
                "author": "Kirbykoopa"
            },
            {
                "raw_content": "We can finally move on from asking when Hollow Knight: Silksong is going to release, and now we can start asking \"Where's Silksong 2?\"",
                "author": "MuptonBossman"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mario + Rabbids double pack Amazon exclusive listed as a Switch 1 and 2 game",
        "score": 139,
        "text_content": "[https://www.amazon.com/dp/B0FKCXCHRP](https://www.amazon.com/dp/B0FKCXCHRP) Screwup on Amazon's part? Or another Ubisoft leak? Also, not sure whether to put this as \"Grain of Salt\" or \"Leak\". Edit Note: the double pack has already been announced by Ubisoft, the rumor is of the Switch 2 version.",
        "comments": [
            {
                "raw_content": "That’s definitely a juicy leak! Hope there’s an upgrade path for switch 1 owners.",
                "author": "AwesomePossum_1"
            },
            {
                "raw_content": "Yves *did* say they [\"will update [Sparks of Hope] for the new machine that will come in the future.\"](https://www.gamedeveloper.com/business/ubisoft-s-yves-guillemot-thinks-mario-rabbids-sequel-came-out-too-early)",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "They've talked about the second game getting an upgrade but it's never been confirmed only danced around",
                "author": "profchaos111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "007 first light gamescom gameplay description",
        "score": 200,
        "text_content": "Brazilian article describing the 25 minute demo of the game on https://www.comboinfinito.com.br/principal/007-first-light-preview/",
        "comments": [
            {
                "raw_content": "Sounds like the only thing they didn't care for were the stiff animations of NPCs, reminding them of the Hitman games.",
                "author": "Mindless_Stuff9179"
            },
            {
                "raw_content": "Really hoping they’ve given it an original Bond theme like the other games.",
                "author": "Robsonmonkey"
            },
            {
                "raw_content": "Is the demo available anywhere to watch? Or did they only show it to the press",
                "author": "BusDriverer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Halo Studios just hired their new Creative Director (JJ Williams), may indicate a large scale multiplayer Halo game is coming.",
        "score": 211,
        "text_content": "Source: https://youtu.be/iaXcA4CBh0s?si=8COAy1NxY9fDvQxk According to Rebs Gaming: Last September Halo Studios listed a Creative Director role, and they finally just hired John “JJ” Williams to be their new Creative Director. Previously JJ was the Principal Designer for Apex Legends and Associate Creative Director for Call of Duty Warzone for several years. Since their experience includes leading the creative vision and design for two of the top battle royale games, this could indicate Halo Studios hired him to help lead the creative vision for a new large scale multiplayer-only Halo game is coming. Rebs previously revealed Project Ekur, which first started as Halo Infinite’s canceled Project Tatanka battle royale mode at 343 Industries and was rebranded into Ekur by Certain Affinity. They also reported (https://youtu.be/bmHVUVZJKiI?si=sUKA41iIXi4chE_-) there have been constant updates to Ekur in the Halo API. So if this project exists, maybe JJ will help lead the creative vision for it post launch and other new Halo projects.",
        "comments": [
            {
                "raw_content": "I was scrolling past and thought I saw \"JJ Abrams\" lmao",
                "author": "RinRinDoof"
            },
            {
                "raw_content": "NGL splitting halo into separate solo and MP games is the right call",
                "author": "Laj3ebRondila1003"
            },
            {
                "raw_content": "To clarify, I meant a multiplayer only game.",
                "author": "DeepSeaAnusDiver"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Devil May Cry Season 2 Trailer Leaked",
        "score": 154,
        "text_content": "[https://www.youtube.com/watch?time\\_continue=3&v=bnp38H4WkHE](https://www.youtube.com/watch?time_continue=3&v=bnp38H4WkHE)",
        "comments": [
            {
                "raw_content": "Dante working with Arius and Vergil is the demon race savior I except nothing less but the most PREMIUM of coals from Adi",
                "author": "Dastanovich"
            },
            {
                "raw_content": "Adi Shankar is a hack and should be banned from making series/film adaptations.",
                "author": "PlatDisco"
            },
            {
                "raw_content": "Unleak it please",
                "author": "Gabrielhrd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gears of War Reloaded - Game in the physical PS5 version must be downloaded from the internet",
        "score": 230,
        "text_content": "The editorial team at [PPE.pl](https://www.ppe.pl/news/379798/gears-of-war-reloaded-w-pudelku-na-ps5-wymusi-pobranie-gry-przez-siec-ekskluzywny-news.html) has just received new details from the reliable source Graczdari about the contents of the Gears of War Reloaded box. According to this information, in order to play the refreshed adventure of Marcus Fenix, players will need to download the game data online. This is a situation similar to what we saw with DOOM The Dark Ages (another Microsoft-published project), where the disc acted more like an \"installer.\"",
        "comments": [
            {
                "raw_content": "Game Key Disc",
                "author": "Bumaye63"
            },
            {
                "raw_content": "The disc version is basically just a transferable license at this point.",
                "author": "nizerifin"
            },
            {
                "raw_content": "Lol, not buying the Key card version of this disk.",
                "author": "PhantomZoneJanitor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Trump Is Betting Big on Intel. Will the Chips Fall His Way?",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US government is aiming to take an equity stake in [Intel](https://www.wired.com/tag/intel/) in exchange for grants the company was already committed to receive under the [Biden era CHIPS Act](https://www.wired.com/story/chips-act-52-billion-semiconductor-production/), according to comments US commerce secretary Howard Lutnick made in an [interview with CNBC.](https://www.nbcnews.com/business/corporations/intel-equity-stake-trump-administration-rcna225814) The move is part of the government’s efforts to boost US chip manufacturing. “We should get an equity stake for our money, so we’ll deliver the money which was already committed under the Biden administration,” Lutnick said. “We’ll get equity in return for it.” Previously, the government was discussing taking a 10 percent stake in Intel, [according to the *New York Times*](https://www.nytimes.com/2025/08/18/technology/intel-trump-government-stake.html). The deal could help the venerable chipmaker fund its US-based semiconductor fabrication plants, or fabs, which have required billions of dollars to construct and maintain, even as demand for Intel chips has waned in recent years. Some chip industry experts and members of the Trump administration say that keeping Intel afloat is essential to US national security, because it lessens the country’s reliance on chipmakers overseas. But analysts and one notable economist say a potential tie-up between Intel and the US government could present a conflict of interest, and may not result in the kind of domestic chip-making industry the administration is angling for. Read more: [https://www.wired.com/story/golden-shares-tsmc-micron-trump-equity-stake/](https://www.wired.com/story/golden-shares-tsmc-micron-trump-equity-stake/)",
                "author": "wiredmagazine"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Home Purchases Are Getting Canceled at a Record Rate",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "15% of home purchases fell through last month—the highest July rate on record—as high homebuying costs made buyers skittish. Cancellations were most common in Texas and Florida. Roughly 58,000 U.S. home-purchase agreements were canceled in July, equal to 15.3% of homes that went under contract last month. That’s up from 14.5% a year earlier and marks the highest July rate in records dating back to 2017. Roughly 1 in 7 U.S. Home Purchases Fall Through This is based on a Redfin analysis of MLS pending-sales data. The data are seasonal, which is why we compare this July to past Julys. Please note that homes that fell out of contract during a given month didn’t necessarily go under contract the same month. For example, a home that fell out of contract in July could have gone under contract in June. Home purchases are falling through more than usual because high prices, high mortgage rates and economic uncertainty are making buyers uneasy. Buyers also have more homes to choose from than in the past, which means they hold the negotiating power in many markets and often aren’t in a rush. They may back out during the inspection period if a better home comes up for sale or they discover an issue they don’t want to fix. Cleveland Redfin Premier real estate agent Bonnie Phillips said the most common reasons buyers back out of deals are cold feet, high standards and issues with inspections, and she noted that cancellations are particularly common among buyers who use FHA and VA loans. But some would-be buyers have other reasons for backing out: “I recently had an older first-time buyer get cold feet the week before the deal was supposed to close,” Phillips said. “It was a beautiful house, we got it for the price she wanted and there were no issues in the inspection, but her neighbors convinced her that owning is too much of a hassle and she should rent instead.” It’s worth noting that the housing-market tides are starting to shift slightly. Mortgage rates have been coming down, which could bring some sidelined buyers back to the market, and supply is also ticking down, which could increase buyer urgency. Home Purchases Are Most Likely to Fall Through in Texas and Florida In San Antonio, 730 home-purchase agreements were canceled in July, equal to 22.7% of homes that went under contract last month—the highest percentage among the metros Redfin analyzed. Next came Fort Lauderdale, FL (21.3%), Jacksonville, FL (19.9%), Atlanta (19.7%) and Tampa, FL (19.5%). Redfin analyzed the 50 most populous metro areas, and included the 44 with sufficient data. Florida and Texas have been building more homes than anywhere else in the country, prompting some buyers to back out of deals because they’re confident they will be able to find a different home that works better for them. Some buyers in the Sunshine State are also getting cold feet due to increasing natural disasters and soaring insurance and HOA fees. Home purchases were least likely to fall through in Nassau County, NY (5.1%), Montgomery County, PA (8.2%), Milwaukee (8.3%), New York (9.5%) and Seattle (10.2%). Virginia Beach, Newark See Biggest Upticks in Cancellations In Virginia Beach, VA, nearly 500 home-purchase agreements were canceled in July, equal to 16.1% of homes that went under contract last month. That’s up 3.6 percentage points from 12.5% a year earlier—the largest increase among the metros in this analysis. Rounding out the top five are Newark, NJ (+3.3 ppts), Baltimore (+3 ppts), San Antonio (2.8 ppts) and Houston (2.8 ppts). Virginia Beach has a higher share of homeowners with VA loans than any other major metro, according to a separate Redfin analysis, with Baltimore also near the top of the list. Cancellations fell from a year earlier in 11 metros, with the biggest drops in Phoenix (-2.4 ppts), Orlando, FL (-1.4 ppts), Tampa (-1.3 ppts), Sacramento, CA (-1.3 ppts) and Philadelphia (-1.2 ppts).",
                "author": "SnortingElk"
            },
            {
                "raw_content": "And this article was also published this morning, right on cue to \"intercept\" Redfin's negative housing market news headine. \"[Home Sales Surprisingly Rose in July While Prices Eased](https://www.wsj.com/economy/housing/home-sales-rose-2-in-july-while-prices-eased-e6db4499)\"",
                "author": "McFatty7"
            },
            {
                "raw_content": "Wait till powell says no rate cuts. It's gonna get worse.",
                "author": "Strange-Tension6589"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Condo Prices Already Dropped by 12%-26% in 21 Bigger Cities through July. Condo Bust Takes Shape",
        "score": 66,
        "text_content": "https://wolfstreet.com/2025/08/20/condo-prices-already-dropped-by-12-26-in-21-bigger-cities-through-july-condo-bust-takes-shape/",
        "comments": [
            {
                "raw_content": "Nice to see something specifically about condos.",
                "author": "hesathomes"
            },
            {
                "raw_content": "100% loss on a 25% down payment",
                "author": "GPwner"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sales of Existing Single-Family Homes Crushed, Supply Highest since 2016. Condo Sales Near Low in the Data, Supply Highest since Housing Bust. Prices Begin to Bend",
        "score": 45,
        "text_content": "https://wolfstreet.com/2025/08/21/sales-of-existing-single-family-homes-crushed-supply-highest-since-2016-condo-sales-near-low-in-the-data-supply-highest-since-housing-bust/ Prices of condos drop year-over-year, single-family price growth “near zero.” West & South take serious hits. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "Yet the next article is **\"US home sales rose in July as mortgage rates eased a bit and home prices grew more slowly\"** One or both is spinning the actual facts. .",
                "author": "PenAndInkAndComics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Drop to 10-Month Low, Pushing Down Monthly Housing Payments",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it was a good time to buy, mortgage applications wouldn't be at a 30 year low. 30 years. Think about that. Buyers agree there hasn't been a worse time to buy in 30 years. A home is just the most expensive thing you'll ever purchase in your life, prices have never been higher, and guess what?! You'll only have to pay 2.5x the cost of it over a 30 year loan!! What's not to like, guys? These [tulips](https://en.wikipedia.org/wiki/Tulip_mania) won't last long at \"on sale\" prices. Get yours today! /s",
                "author": "h4ms4ndwich11"
            },
            {
                "raw_content": "How can this be the Low when I read somewhere it was 6.4 not long ago. Oh wait... redfin, yup used car salesman stuff. Let's twist how we word things Unless you have Great Great credit you are not seeing Great rates.",
                "author": "tigger19687"
            },
            {
                "raw_content": "Man, how I wish this were true. But sadly it is not.",
                "author": "Situnario"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Kansas City Fed's Schmid shows hesitation about widely expected September rate cut",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Data is showing it’s where it needs to be, technically it should be increased.",
                "author": "Original-Debt-9962"
            },
            {
                "raw_content": "The FED is neither a federal agency or a bank of reserves",
                "author": "Fast_Air_8000"
            },
            {
                "raw_content": "lol the markets now say nearly 30% chance of no cut in rates not that it really matters, rates were cut 100 bps last year and demand for houses only went down further JPow at JHole is speaking tmrw morning only one way out of this 🔥🏠🔥",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Existing Single-Family Homes Median home price $428,500, up 0.3% from last year. A 2.0% increase in sales to a seasonally adjusted annual rate of 3.64 million, up 1.1% from July 2024.",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sell sell sell no buy buy buy Oh I forgot they are just in it for the $$$$$$$ I so stopped reading shit from these places.",
                "author": "tigger19687"
            },
            {
                "raw_content": "Without deflation in this category, the situation only becomes worse. We’ll not be seeing deflation in our overall economy anytime soon, thanks for corporate profit-making using the new excuse of “bUt mAh tArIfFs!!”. As opposed to 2022’s excuse “bUt mAh SuPpLy cHaIn!!” or “dUe tO cOvId!!” Really, any excuse is good enough to hike those prices and revenue numbers, and stock prices, and it’s because Americans are largely still working and haven’t thought “maybe I should cut out X, Y, or Z from my budget”. We need shelter deflation. It is the only solution that works. And it will not happen until employment moves from, as officially shown, 4.2%.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "I'm tired of reading these national sales stats as if they mean anything where I live.",
                "author": "Moviecaveman"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seven Apartment Markets with Deep Supply Drops in the Next Year",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As supply volumes drop across the U.S., some individual apartment markets are logging pronounced declines. In the U.S. overall, just over 354,000 units were under construction at the end of 2nd quarter and scheduled for completion in the coming year. That is a 33.9% decline from the roughly 535,800 units completed in the year-ending 2nd quarter 2025, according to data from RealPage Market Analytics. Next year’s scheduled supply in the U.S. marks a return to a more normal supply environment. In the past decade, supply volumes averaged roughly 360,000 units annually, elevated notably by the record volumes from the past few years. Across the nation, most big and small apartment markets alike are set to see declining supply volumes in the coming 12 months. Among the nation’s 50 largest apartment markets, seven are scheduled to see delivery volumes fall by roughly twice the national pace – about 60% or more – in the coming year. The sharpest decline in apartment supply in the coming year is set for San Jose. New apartment completions in San Jose hit a record pace of 5,122 units delivered in the year-ending 2nd quarter 2025. At the end of the quarter, there were 2,008 units under construction in San Jose, with 1,151 of those units scheduled to complete in the coming year. That’s a 77.5% decline from last year’s pace and hits well behind the market’s decade average of 3,092 units delivered annually. The only other West region market on this list is Denver, which was one of the nation’s biggest centers for apartment deliveries in the year-ending 2nd quarter 2025 with the completion of 17,462 units. Just over 6,600 units are slated to wrap up construction in the next 12 months in Denver, which represents a decline of 62.1%. Three Midwest region markets are scheduled to see drastic supply declines in the coming year. Minneapolis, Indianapolis and Milwaukee are all slated to see their supply volumes come down by roughly 60% to 70% by the end of 2nd quarter 2026. San Antonio is seeing the South region’s deepest relative decline in apartment supply in the coming year. Roughly 3,600 units are under construction and scheduled to complete by the end of 2nd quarter 2026, which is 68.2% less than completed last year. Just missing the 60% decline mark were South region markets Austin, Memphis and Houston, where supply volumes are scheduled to come down by 56% to 59%. Austin is the market with the nation’s deepest volume decline in the coming year, with deliveries dropping by 15,874 units. It’s worth mentioning, fellow Texas market Dallas is also seeing supply come down by about 15,000 units in the coming year, representing a relative decline of 44.4%.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Figure 02 obstacle challenge",
        "score": 713,
        "text_content": "https://youtube.com/shorts/ejJLrGPEJ0U?si=w3jhkOdOYkCYJzH3",
        "comments": [
            {
                "raw_content": "Damn, cats and dogs better watch out if these things start coming into houses. lol",
                "author": "twbassist"
            },
            {
                "raw_content": "Can we make it a lot heavier and test how it walks on human skulls?",
                "author": "Jesus_H_Christ_real"
            },
            {
                "raw_content": "[Important to note that it's walking blind, no cameras attached](https://xcancel.com/adcock_brett/status/1958193624241545487#m)",
                "author": "NoCapNova99"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta Signs $10 Billion-Plus Cloud Deal With Google",
        "score": 332,
        "text_content": "Well, well, we'll...",
        "comments": [
            {
                "raw_content": "So Gemini, Claude, GPT and Llama all use Google Cloud?",
                "author": "zaimonke"
            },
            {
                "raw_content": "The whole world went from Google is dead a couple years ago to Google to the moon now",
                "author": "LiveNotWork"
            },
            {
                "raw_content": "Wow, google is selling so much compute to so many people, how are they going to have any left for themself? or are they not AGI pilled?",
                "author": "DoubleGG123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The state of META Ai",
        "score": 96,
        "text_content": "Meta will take the gooning way.",
        "comments": [
            {
                "raw_content": "My favorite is DavidAU/Llama-3.2-8X3B-MOE-Dark-Champion-Instruct-uncensored-abliterated-18.4B-GGUF",
                "author": "bucolucas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We Got 100% Real-Time Playable AI Generated Red Dead Redemption 2 Before GTA 6...",
        "score": 386,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The similarity between this and dreams is scary. When he turns around and the environment suddenly morphs into a city that feels exactly like some dream shit. Reminds me of when image generation was still in it's earlier phases a few years ago, they said the things it had the most trouble with creating an accurate image of were hands and numbers/letters, which is apparently the same thing that we struggle to accurately recreate in dreams",
                "author": "psychonautix66"
            },
            {
                "raw_content": "What is it exactly? Like, what AI product?",
                "author": "AlvaroRockster"
            },
            {
                "raw_content": "u/baphaddon Said it best I think. We seem very much to be at the nightmare Will Smith eating spaghetti point of generative world models. We’ll be lassoing innocent NPC’s soon enough.",
                "author": "Plsnerf1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jeff claims Gemini’s environmental impact has dropped significantly year over year",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This lends a lot more credence to Altman's claims from a few months ago. Which is *tiny* compared to everything else we humans use. For instance did you know the average American uses 2200 gallons of water a day? Now the question is how much energy does training take? How many orders of magnitude difference?",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "Somehow, I doubt any of the environmentally concerned citizens counting AI water consumption would even consider not owning a car, or similar terribly sinful things. (Because obviously, if they are doing it, it's totally fine. Besides, they need it! Can't live without. It's not the same thing at all.) I hope they will draw as few of the actually useful people into their circus as possible.",
                "author": "ohHesRightAgain"
            },
            {
                "raw_content": "Video efficiency is the biggest problem right now. An 8-second gif generation shouldn't use up as much energy as an hour of microwaving.",
                "author": "RLMinMaxer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A new mRNA cancer vaccine creates lasting immunity in patients, with some remaining cancer-free for years",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a shame that RFK Jr. is terminating mRNA research funding in the US.",
                "author": "Economy_Variation365"
            },
            {
                "raw_content": "Just as well the Trump administration didn't recently make a decision to remove 100% of government funding from this research because RFK thinks it's all fake as that would be one of the dumbest moves in human history.",
                "author": "cuddlemycat"
            },
            {
                "raw_content": "Can’t wait to never hear about this again",
                "author": "bigbluemelons"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alexandr Wang pushes back on rumors of Meta freezing AI hiring",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/owcefbrg5gkf1.png?width=1341&format=png&auto=webp&s=6c039a77bcca94f179e5d8e34347ade66102cbb6",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "He didn’t deny a hiring freeze",
                "author": "m3kw"
            },
            {
                "raw_content": "The moment the Zuck appointed this fraud to be the head of Meta's AI effort is when I knew they were doomed. This guy essentially ran a data entry company riding on the AI hype train.",
                "author": "lolwut778"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT5 did new maths?",
        "score": 622,
        "text_content": "https://x.com/vraserx/status/1958211800547074548?s=46",
        "comments": [
            {
                "raw_content": "https://nitter.net/ErnestRyu/status/1958408925864403068 I paste the comments by Ernest Ryu here: >This is really exciting and impressive, and this stuff is in my area of mathematics research (convex optimization). I have a nuanced take. >There are 3 proofs in discussion: v1. ( η ≤ 1/L, discovered by human ) v2. ( η ≤ 1.75/L, discovered by human ) v.GTP5 ( η ≤ 1.5/L, discovered by AI ) Sebastien argues that the v.GPT5 proof is impressive, even though it is weaker than the v2 proof. >The proof itself is arguably not very difficult for an expert in convex optimization, if the problem is given. Knowing that the key inequality to use is [Nesterov Theorem 2.1.5], I could prove v2 in a few hours by searching through the set of relevant combinations. >(And for reasons that I won’t elaborate here, the search for the proof is precisely a 6-dimensional search problem. The author of the v2 proof, Moslem Zamani, also knows this. I know Zamani’s work enough to know that he knows.) >(In research, the key challenge is often in finding problems that are both interesting and solvable. This paper is an example of an interesting problem definition that admits a simple solution.) >When proving bounds (inequalities) in math, there are 2 challenges: (i) Curating the correct set of base/ingredient inequalities. (This is the part that often requires more creativity.) (ii) Combining the set of base inequalities. (Calculations can be quite arduous.) >In this problem, that [Nesterov Theorem 2.1.5] should be the key inequality to be used for (i) is known to those working in this subfield. >So, the choice of base inequalities (i) is clear/known to me, ChatGPT, and Zamani. Having (i) figured out significantly simplifies this problem. The remaining step (ii) becomes mostly calculations. >The proof is something an experienced PhD student could work out in a few hours. That GPT-5 can do it with just ~30 sec of human input is impressive and potentially very useful to the right user. However, GPT5 is by no means exceeding the capabilities of human experts.\"",
                "author": "Stabile_Feldmaus"
            },
            {
                "raw_content": "\"Humans later closed the gap\" is a lie, see: https://www.reddit.com/r/artificial/s/oSokkPMNMN",
                "author": "plunki"
            },
            {
                "raw_content": "AI isn't just **learning** math, it's **creating** it. And that's *rare*.",
                "author": "Puzzleehead"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google offers full AI and Workspace suite for the US government for $0.50 per agency.",
        "score": 362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The amount of data they're collecting from this probably makes it worth losing all that money in the compute resources needed for all these people.",
                "author": "ryan13mt"
            },
            {
                "raw_content": "Wait, can someone explain to me the total breakdown on how and why they are charged $0.50-$1.00 Are governments paying for token usage and the $1.00 is just the fee to get the model access? I'm so confused",
                "author": "0_Johnathan_Hill_0"
            },
            {
                "raw_content": "NotebookLM alone is much more useful than a \"chatbot interface\" that OpenAI offers, been using to to compile case studies and its basically a \"repository\" at this point. The management of rules/regulations/paperwork done in an gov agency can be done easily be done with it. OpenAI really gotta think of other form factors/UIs, or at least diff usecases, not to mention Veo simply curbstomps Sora.",
                "author": "Sharp_Glassware"
            }
        ],
        "subreddit": "singularity"
    }
]