[
    {
        "post_name": "Sick libtards are now terming Turning Point USA which is basically a grassroots voter registration and GOTV group as a \"vehicle of hate\"...the fucks are setting the stage so their loons can target and kill more of us",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If her words are hate, sign me up. I’ll gladly be the “ hateful “ bastards they say we are.",
                "author": "john9985"
            },
            {
                "raw_content": "Wajahat Ali ? Sounds like someone who is a member of the worst hate group in the world, that has killed the most people - Islam. https://www.americanthinker.com/articles/2014/05/the_greatest_murder_machine_in_history.html",
                "author": "Washington_Redskins"
            },
            {
                "raw_content": "They have lost the argument. They have nothing left but violence.",
                "author": "bejeavis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Erika's goodbye to Charlie",
        "score": 787,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry, but some things should never be photographed. Last moments like this is definitely one of them, IMO.",
                "author": "Herc130"
            },
            {
                "raw_content": "This is so heavy. Rest in peace, Charlie Kirk and Godspeed, Erika. To our enemies: **WAR**",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fuck man... This is heavy.",
                "author": "Girthquakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An LAFD source has sent me this internal email, that LA Mayor Karen Bass has instructed Los Angeles city flags NOT be displayed at half staff. “Flags shall remain raised to full staff each day … unless directed by the Mayor.” This despite POTUS signing a half-staff proclamation.",
        "score": 780,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think she's about to hit the FO part of her actions. The insurrection act can easily and legitimately be put into.place and enforced.",
                "author": "RoninIV"
            },
            {
                "raw_content": "Go find and lower those flags yourself pedes",
                "author": "KekistanRanger"
            },
            {
                "raw_content": "Imagine a world where adults consistently behave more childish than actual children. Sorry, no need to imagine that.",
                "author": "Herc130"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A.F. Branco: Charlie Kirk is in the arms of the Lord now, no doubt hanging with Rush Limbaugh. Well done, good and faithful servants.",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's in good company. In heaven, there are no leftists",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Branco: https://comicallyincorrect.com/branco-cartoon-next-man-up/",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller just revealed that the last message Charlie Kirk sent him was a call to dismantle radical left organizations fomenting violence across the United States, confirming that mission will be carried out in his name.",
        "score": 1226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wish Miller was our AG",
                "author": "Rosebud4Jesus"
            },
            {
                "raw_content": "Seize reddit, bluesky, discord immediately. Shut down the propaganda news agencies by passing the Charlie Kirk act. Arrest all Marxist professors under the communist control act. Do it swiftly.",
                "author": "shadilayylmao"
            },
            {
                "raw_content": "Let’s start by dismantling the Democratic Party. Deus Vult!",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING UPDATE: Following Office Depot called Charlie Kirk tribute posters “POLITICAL PROPAGANDA” and REFUSED to print them, FedEx Office stepped in and printed them for FREE THANK YOU, @FedEx!",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire the Fat Fucks",
                "author": "GallowsTime"
            },
            {
                "raw_content": "Well played FedEx. Your move Office Depot.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "Just an FYI, Office Depot didn't authorize this action. The fucking leftards working at the printing desk did. The people at the Office Depot where I live are pretty based. Contact Office Depot HQ and get them to fire the staff at that particular store and make it public.",
                "author": "RoninIV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Governor Greg Abbott signs law banning Sharia law dictating transactions and business, and banning Muslim-exclusive cities and land-selling.",
        "score": 1856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now deport all Muslims. The Spanish did this as bfew hundred years ago. Think about how Spain would look if they didn't!",
                "author": "newuser8"
            },
            {
                "raw_content": "best news this year since technically Trump won last year and nothing Trumps that",
                "author": "Thermopylae_MMXX"
            },
            {
                "raw_content": "Let's just deport Muslims and be done with it. We're sitting here celebrating all these laws that we're having to pass, that's not a victory. The fact that we have to pass these laws is the problem.",
                "author": "Flptplt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "At least pretend you don't want us dead, and maybe we'll stop thinking you want us dead.",
        "score": 1004,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Change right to correct in the third paragraph and repost.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "They also say, \"well there's bad actors on both sides\". Never taking responsibility for anything.",
                "author": "LLegendary"
            },
            {
                "raw_content": "You cannot have civil discourse with people who celebrate baby killings, gender mutilation of children, cheer assassinations, and shames victims or think men can be women. No, I am not them",
                "author": "Stolen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Life comes at you fast",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need a BLOWBACK flair! u/-f-b-i- u/hocuspocusfocusjeep",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "It's okay if they do it. I'm still a Pureblood, so that campaign didn't work, either.",
                "author": "MythArcana"
            },
            {
                "raw_content": "RollingStone is a cumrag",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS IS HOW WE GOT HERE",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love how the director got mad and the second movie was purposefully shit and now it just plays right back into our hands. Perfection!",
                "author": "terribletwos"
            },
            {
                "raw_content": "Boy, it's a damn good thing America isn't a democracy.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Stickied before I even comment tagging a mod, impressive. Love y’all.",
                "author": "Johnrgalt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please Mods sticky this! This is going to get ugly. How can we let them know this is unacceptable?",
        "score": 1604,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Office Depot is going to be hiring at this location in the near future if anyone is looking for a job.",
                "author": "Usernametaken2021"
            },
            {
                "raw_content": "BAKE THE CAKE? PRINT THE POSTER, BITCH. See how that works now?",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "Someone should go to that same place and see if they'll print an Obama poster and record the whole thing. I doubt they'll say it's \"propaganda\" and that \"they can't print it.\"",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Hundreds of people are currently singing \"God Bless America\" at the Charlie Kirk vigil in Manhattan. This is an amazing sight. Everyone is honoring Charlie. 🙏🇺🇸",
        "score": 1555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Theyre singing Amazing Grace",
                "author": "Cyber1776"
            },
            {
                "raw_content": "> God Bless America Must be something wrong with my hearing. Beautiful regardless 🥲",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "We are not the same.",
                "author": "uniformist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The blood is on your hands",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After seeing how Reddit responded to this, in the 2028 primary, I’m voting for whatever candidate is closest to Augusto Pinochet. I’m not even close to kidding. Hopefully the American commies like helicopters",
                "author": "Obamaisalbaghdadi"
            },
            {
                "raw_content": "They won't shut down reddit because of big techs and large investors will lose a lot of money. I expect investors are buying time to unwind their positions and risks. A bad earning and then reddit will fold.",
                "author": "Tomis_4"
            },
            {
                "raw_content": "Discord isn't evil, bro. Reddit on the other hand...",
                "author": "CRKFIEND"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: The FBI is now investigating doorbell camera footage that allegedly shows 22-year-old Tyler Robinson speaking about the shooting just moments after the tragic event",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The whole Utah troon and goon community knew about it apparently. Of course the authority can never say that because it will cause the extermination they're afraid of.",
                "author": "bills_gash"
            },
            {
                "raw_content": "When are they gonna start investigating all the other scum involved, huh?!",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "Put the thumbscrews to the roommate. He was on discord along with the perp. The authorities have admitted that.",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "they’re all Nazis",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They think they’re socialists and call us Nazis. Crazy irony.",
                "author": "TakingAction"
            },
            {
                "raw_content": "Killing someone for just speaking. I dunno, but that sounds like something a Nazi would do.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "Imagine being such a dumb smoothbrain piece of shit retard you think actual Nazis still exist.",
                "author": "sully"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don't care how fast or how much they backpedal. FUCK OFFICE DEPOT!",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm willing to let this one slide, it was probably one employee who thought their ideology trumped corporate, and here is corporate laying down the law and taking immediate ownership of the issue which is good. You have to realize how a business this large operates, and they cannot micro-manage every employee at that moment of sale, some employees are just assholes.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Why? This wasn't company policy, it was some psychotic employee who was immediately terminated. Office Depot did everything correctly and should not be punished for this.",
                "author": "SouthernFriedFreedom"
            },
            {
                "raw_content": "\"The associate involved is no longer with the organization\" Libtards are speedrunning getting fired from their jobs at a record pace lmao",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I wonder if they'll print this \"propaganda\"",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Between them they have 3500lbs and 4375.4 genders",
                "author": "IslandMan69"
            },
            {
                "raw_content": "They refused to print something for Turning point, this is a lawsuit and probably illegal.",
                "author": "BigJoe555"
            },
            {
                "raw_content": "Office Hippo ®",
                "author": "TraitorJoes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You media shills aren't THAT retarded. Here, let me make it easy for you:",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hot take: If conservatives adopted the same mentality as leftists/communists, MSM buildings would have been burned to the ground and their executives beaten to death in the street by now.",
                "author": "EJay_Scott"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Every single one of them knew what they were doing, the entire time.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk's beloved wife, Mrs. Erika Kirk will address the nation tonight at 8:15 PM EST.",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope she isn't going to ask for forgiveness for the assassin, or peace with the left... because I CANNOT DO THAT.",
                "author": "FiDollaMilkshake"
            },
            {
                "raw_content": "\"You have no idea what you just unleashed across this country\".",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "She is saying exactly what I wanted to hear.",
                "author": "bringbackthe80s"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Erika Kirk to President Trump: “My husband loved you. And he knew that you loved him too. He did.”",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow. that was a tearful moment",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "This video was hard af to watch. You can see the seething hatred and grief she feels that she can barely compose herself. Towards the end I was hoping someone would just jump in and stop her from collapsing or something. She did well and I'm particularly appreciative that she didn't play the \"come together\" card. Oh she absolutely did not. She expressed her love and rage is a classy way, I believe.",
                "author": "_Sully_"
            },
            {
                "raw_content": "She was beautiful inside and out. Wonderful Christian woman. Loved her message.💛",
                "author": "SomecatsareMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Europe's first exascale supercomputer is now up and running, using 24,000 Nvidia GH200 Superchips to perform more than one quintillion operations per second with nearly 1,000,000 terabytes of storage",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When I was in high school I read about the world's fastest supercomputer being capable of 1 PetaFLOP and how it was such a big deal. Now we can have 0.1 PetaFLOPs of FP32 in our PCs. How time flies.",
                "author": "HyruleanKnight37"
            },
            {
                "raw_content": "Tech \"journalists\" try not to use large numbers instead of using appropriate units and SI prefixes challenge (impossible). It's \"over 1 EFLOPS\" and \"almost 1 EB\" ffs.",
                "author": "Kinexity"
            },
            {
                "raw_content": "\"Superchips.\" I'm feeling hungry already...",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel tiles, chiplets like in the rx 7900 and nvlink bridges. How do these multichips setups differ?",
        "score": 16,
        "text_content": "Are they basically the same? Are all chio to chip interconnects that bypass the pcie bus the same, but with a hit to latency depending on the distance?",
        "comments": [
            {
                "raw_content": "It's all different. They are as similar as a submarine and a helicopter in the sense they both move you from point A to point B. Intel Foveros uses basically separate 22nm dies beneath the tiles to carry the wires. AMD (TSMC) has the wires going through the interposer. And NVLink has a bunch of different shapes so we can't compare them directly. Latency, bandwidth, cost and complexity are different depending on the implementation. In general the farther you want to go, the interconnect gets more expensive, higher latency and less bandwidth. If you want to go from one PCB to another through a cable then it all goes to hell, latency explodes, cost explodes, bandwidth goes down the drain.",
                "author": "Just_Maintenance"
            },
            {
                "raw_content": "There are quite a few different ways to connect multiple chips together on a package. It's fundamentally a bunch of wires, though there are a number of different ways to route them. If the wires are short enough, you can effectively treat the dies as one, with no special communication protocols required. The V-cache that AMD uses on some processors is like this, as is the connection between CPU and media die (I/O and GPU) with Strix Halo. When the wires get longer, you need to transmit the data from one end and receive at the other, which is usually just shortened as SERDES (serialize/deserialize, as it sends a stream of bits in serial). This adds power consumption, so you want to avoid it for low-power applications. Even when you could do direct link instead of SERDES, you might go with the latter to make the packaging simpler, cheaper, and more reliable.",
                "author": "RealThanny"
            },
            {
                "raw_content": "No. The interconnects are made on different processes by different manufacturers, with different specs, speeds, use cases, and costs associated with them. Also you seem to be confusing in package connections with external connections. None of these are the same.",
                "author": "Applesnozz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX 5060 vs RTX 4060 - 25 Game Laptop Comparison",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a good look The faster 5600 ram probably attributed to some of those gains",
                "author": "Present_Hornet_6384"
            },
            {
                "raw_content": "TLDW: Laptops used: 1) Asus TUF F16 2024: Intel Core i7-13650HX, 16GB DDR5-4800, Mobile Nvidia RTX 4060 8GB DDR6, TGP: 35-140W 2) Asus TUF F16 2025: Intel Core i7-14650HX, 16GB DDR5-5600, Mobile Nvidia RTX 5060 8GB DDR7, TGP: 45-115W 25 Games Average: 1080P (Mix medium, high, ultra RT settings): Mobile RTX 5060 was 8.78% faster 1440P (Mix medium, high, ultra RT settings): Mobile RTX 5060 was 10.31% faster 1080P: Mobile RTX 5060: 84.77 FPS Mobile RTX 4060: 77.98 FPS 1440P: Mobile RTX 5060: 62.25 FPS Mobile RTX 4060: 56.4 FPS",
                "author": "Antonis_32"
            },
            {
                "raw_content": "8.7% uplift at 1080p is horrendous. Nvidia does not care lol. mfg shouldnt be able to sell as most laptops will come 144hz-160hz. Yes 3x works but meh. Laptop market yikes",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo's Back in VR With a New Virtual Boy, Coming Next Year for Switch",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn't calling Virtual Boy a VR system be kind of a stretch?",
                "author": "yungfishstick"
            },
            {
                "raw_content": "\"While the games are free (with a subscription), the accessory costs $100 for the authentic plastic recreation or $25 for the cardboard version.\" \"The games themselves will be part of the Nintendo Switch Online subscription service. Nintendo's promising 14 titles released over time, including Tetris. \" Too bad, seems like a waste",
                "author": "hollow_bridge"
            },
            {
                "raw_content": "google cardboard with virtualboy branding",
                "author": "MysteriousBeef6395"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "No freaking way Nintendo.",
        "score": 3375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is exactly how much I thought it would be, actually. Surprised we don't get a controller though.",
                "author": "Mysticwaterfall2"
            },
            {
                "raw_content": "The first Nintendo product to be rereleased and bomb TWICE",
                "author": "Effective_Poem7629"
            },
            {
                "raw_content": "Ok nevermind lol. Not paying $100 for something ill use for 10 minutes",
                "author": "Pdeeznutsington"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A message to the Pokemon Studio for DLC being at launch",
        "score": 1619,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and Bananza",
                "author": "sirms"
            },
            {
                "raw_content": "Paid DLC on disc is withheld content, paid DLC within six months of launch is just a planned content roadmap. Reminder BotW literally did this with the expansion pass and no one batted an eye.",
                "author": "ob_knoxious"
            },
            {
                "raw_content": "Honestly I would much rather have DLC within a few months of the release so I still care about the playing the game, rather than like a year later where I have to relearn the mechanics/controls, etc.",
                "author": "Silvers1339"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This Nintendo Direct and previous directs really showed that...",
        "score": 1779,
        "text_content": "Gamers nowdays have tik tok brain rot and 0 patience. Getting a new DK, Mario Kart, and Metroid is not enough. All the new 3rd party games are not enough. Everyone wants sequels to every big Nintendo franchise every single year and they want it NOW.",
        "comments": [
            {
                "raw_content": "I'm just hyped for Metroid Prime 4, I'll decide what to play next once I'm done with that.",
                "author": "Williekins"
            },
            {
                "raw_content": "Please remember social media is not a true test of what most people want To add: Nintendo does 10x better than the other companies with releasing major titles every few years. Feels like we have to wait 9 years to get a new AAA game in a franchise now",
                "author": "NoIdeaWhatIm_Doing0"
            },
            {
                "raw_content": "I think it’s mostly that people mostly associate Nintendo with Mario first and Zelda second. No new big Mario or Zelda games on the horizon. The reality people need to face is that we probably aren’t getting a 3D Mario game for a couple of years. DK replaced Mario as the early generation 3D platform game. A new 3D Zelda is also probably at least a couple of years away as well. TotK is like 2 years old.",
                "author": "More_Lavishness8127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "With the power of Switch 2, Game Freak has finally achieved average Switch 1 graphical quality",
        "score": 1797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can I just say I love how odd the main character is. The ditto human is so uncanny in the best way.",
                "author": "Substantial_Bell_158"
            },
            {
                "raw_content": "Honestly I assume this was made for switch 1 with how it looks",
                "author": "ContributionVisual40"
            },
            {
                "raw_content": "This game wasn’t developed by gamefreak",
                "author": "Remy149"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After that Direct..",
        "score": 1423,
        "text_content": "The",
        "comments": [
            {
                "raw_content": "Really thought we would get DLC for MKW",
                "author": "brandont04"
            },
            {
                "raw_content": "Dont worry in 9 years Mario Kart Galaxy will be peak trust",
                "author": "Impossible_Ease_1460"
            },
            {
                "raw_content": "Swap 3D Mario and MKW, the latter actually exists",
                "author": "JohnnyNole2000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Galaxy Bundle and Amiibo Announced",
        "score": 1733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Worth noting that the games are being sold separately digitally so for those of us who already have 3D All Stars you only need to buy Galaxy 2",
                "author": "TheDLBinc"
            },
            {
                "raw_content": "3d all stars collectors 9/11",
                "author": "KaiHavertzhatewatch"
            },
            {
                "raw_content": "It's a weird decision to not just add 2 to a 3D All Stars update as now people will have to buy this and own Galaxy again.",
                "author": "Sjknight413"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hades II is NOT a game key card",
        "score": 390,
        "text_content": "Good to see a third party game not being a key card",
        "comments": [
            {
                "raw_content": "Because it's a Nintendo Switch 2 edition of a Switch 1 game. I don't think any of these were game key cards.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I’ll buy it to support physical",
                "author": "Wonderful_Onion_7639"
            },
            {
                "raw_content": "Good, even though I never really got through Hades 1, will buy it just to support devs that do offer their games on a cartridge.",
                "author": "null-interlinked"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Individual prices for Super Mario Galaxy 1/2",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Personal Thoughts: bruh",
                "author": "SplatoonOrSky"
            },
            {
                "raw_content": "Man, remember in 2020 when everyone thought $60 for three Mario games was an insane price? Good times.",
                "author": "blueberrypizza"
            },
            {
                "raw_content": "Both of these games were $50 brand new in 2007/2010 Galaxy 2 was sold for $20 on Wii U. Nintendo really bending their fans over",
                "author": "Organic-Storm-4448"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Three \"sevens\" show up at the Nintendo Direct: Final Fantasy VII, Resident Evil 7, and Dragon Quest VII.",
        "score": 672,
        "text_content": "Source: [Nintendo Direct 9.12.2025](https://www.youtube.com/watch?v=tWIEv_aksvo) Prior SwitchForce leak: [here](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n9qetv/switchforce_hints_at_3_mysterious_7_games_for_the/) I think at this point we should tier SwitchForce, he's Tier 2 at minimum.",
        "comments": [
            {
                "raw_content": "also disgaea 7",
                "author": "cjenvy"
            },
            {
                "raw_content": "Though indeed no Ace Attorney 7 T\\_T Ah well, there's always next time.",
                "author": "ThatIsAHugeDog"
            },
            {
                "raw_content": "This journey from mildly interesting leak to mildly interesting reality has truly been an exciting one. Akin to hearing a forecast of rain and then noticing the first few droplets on the window the next morning.",
                "author": "AfraidoftheLark"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Final Fantasy VII social media confirms the entire Remake trilogy will be available on multiple platforms",
        "score": 457,
        "text_content": "[After previously being hinted at](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1kg4u6u/final_fantasy_vii_remake_trilogy_coming_to_switch/) by series director Naoki Hamaguchi during the Switch 2 Creator's Voice video on *FFVII Remake Intergrade*, the official *Final Fantasy VII* accounts on[ X](https://xcancel.com/finalfantasyvii/status/1966514225117118813#m) and [Instagram](https://www.instagram.com/p/DOgZACVjNlv/) have announced that the entire trilogy is going to be available on **PlayStation 5, Nintendo Switch 2, Xbox Series X|S and PC (Steam/Microsoft Store/Epic Games)** This was not previously mentioned by Square Enix nor did it appear during Nintendo Direct, but it is also the first official confirmation that [*Final Fantasy VII Rebirth* will be coming to Switch 2 and Xbox](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ncbjy4/natethehate_final_fantasy_7_rebirth_to_launch_on/) in the near future, and that the untitled third part of the trilogy will likely be on everything day one as opposed to releasing first on PlayStation like the first two games.",
        "comments": [
            {
                "raw_content": "Part 3 mention Hope this means we're actually at the stage where we're reasonably close to seeing footage especially after the Cody Christian tweet of him in the booth doing voiceover. Game Awards maybe",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Does this mean that Part 3 won’t be a timed exclusive?",
                "author": "Zenthon9"
            },
            {
                "raw_content": "I wonder if FFXVI will ever be ported over. Would be cool, but would certainly need effort to scale it down to a playable level. And FFXIV almost seems like it's inevitable at this point.",
                "author": "Paetolus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem Confirmed for Nintendo Switch 2",
        "score": 370,
        "text_content": "**Confirmed:** Resident Evil 7 & Village Gold Editions confirmed for Switch 2, also out Feb 27th along with Requiem [https://www.youtube.com/watch?v=0KO8axfgBkw](https://www.youtube.com/watch?v=0KO8axfgBkw) Preivous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nckk78/dusk\\_golem\\_all\\_resident\\_evil\\_games\\_running\\_on\\_re/?tl=pt-br](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nckk78/dusk_golem_all_resident_evil_games_running_on_re/?tl=pt-br)",
        "comments": [
            {
                "raw_content": "Resident Evil 2 (N64) on NSO in January is a no-brainer, but I fear it will not happen. Resident Evil 2, 3, and CV (GameCube) on NSO *anytime* is a some-brainer, but I know it will never happen.",
                "author": "AfraidoftheLark"
            },
            {
                "raw_content": "Probably won't pick it up on Switch specifically but it's great that Nintendo's finally starting to get release parity with major AAA Japanese games. Or at the very least the window between it coming to other systems and then Nintendo is now nowhere near as large as it used to be during the Switch gen Surprised the remakes weren't also immediately confirmed but they have to be locks now. Honestly I'd imagine Onimusha and Pragmata are probably coming to Switch 2 as well now",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "I can’t believe they are releasing all three games on the same date… feels like prime cannabilization of sales",
                "author": "IndividualCautious78"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Super Mario Galaxy Movie Announced - Coming 2026",
        "score": 350,
        "text_content": "Confirmed: [http://variety.com/2025/film/news/super-mario-galaxy-movie-sequel-1236515440/](http://variety.com/2025/film/news/super-mario-galaxy-movie-sequel-1236515440/) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nen3fa/it\\_seems\\_that\\_the\\_old\\_spice\\_super\\_mario\\_galaxy/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nen3fa/it_seems_that_the_old_spice_super_mario_galaxy/)",
        "comments": [
            {
                "raw_content": "Odd they didn’t announce new characters. I’m betting we’re getting an NY Comic Con panel next month. That’s what they’re waiting on clearly.",
                "author": "MOVIELORD101"
            },
            {
                "raw_content": "But I was told it was called Super Mario World and the third film would be Galaxy!",
                "author": "Gold_Taro3168"
            },
            {
                "raw_content": "Somebody check in on Scott the Woz",
                "author": "New_Student_6526"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem again Emphasizes on Leon been in RE Requiem and Reveal maybe TGS or State of Play",
        "score": 180,
        "text_content": "[https://xcancel.com/AestheticGamer1/status/1966520029169496413](https://xcancel.com/AestheticGamer1/status/1966520029169496413)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Only reason I'm inclined to believe this or at least that they're hiding a big reveal is because the original announcement for RE9 they mentioned the game being action packed and they've also shown nothing outside of the same tiny slice since the reveal (gameplay-wise). It feels like since the beginning they've been holding a lot about this game extremely close to the chest.",
                "author": "mr_shogoth"
            },
            {
                "raw_content": "I don't know much about Dusk Golem but I just think it's really funny seeing people on this sub get insanely mad at the sight of any mention of them",
                "author": "leoo210"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem For PS4",
        "score": 157,
        "text_content": "[https://xcancel.com/AestheticGamer1/status/1966506832681177443](https://xcancel.com/AestheticGamer1/status/1966506832681177443) As per Dusk Golem",
        "comments": [
            {
                "raw_content": "The year is (nearly) 2026 and we’re still seeing PS4 games",
                "author": "Crimsonclaw111"
            },
            {
                "raw_content": "I think the Switch 2 saved the PS4 from dying off for another 7ish years.",
                "author": "GenSpicyWeener"
            },
            {
                "raw_content": "I guess PS5 is still expensive for some countries so that's good for whoever still has PS4. But they shouldn't expect the same performance as PS5.",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"We really can’t go down much lower without taking a substantial loss on the home.\"",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sellers have forgotten the concept of \"cutting your losses\". They have been blinded by easy money and unrealistic 10% gains, and so now they will relearn that it's often better to dump it now for a loss than it is to sit and continue paying for it. They just kick the can down the road until it's too late.",
                "author": "reedthemanuel"
            },
            {
                "raw_content": "So... Negative equity. The last time this happened, people just walked away from their additional properties.",
                "author": "NorCalJason75"
            },
            {
                "raw_content": "Too bad, your neighbors can, and that’s how comps work…..",
                "author": "bigmean3434"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates fall ahead of Fed meeting. Will it help the struggling housing market?",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While we saw some short term rate decline long term rates will rise again because it just doesn’t make sense to hold these long rated bonds given the continued inflation, increasing deficit and political instability. This means mortgage rates will go up again.",
                "author": "Dmoan"
            },
            {
                "raw_content": "All over the world, rate cuts are leading to rising yields. I think a buy-the-rumor, sell-the-news event is occurring now in long-duration bonds. Long-duration bond rates will likely rise after the Fed cuts. Short-term rates will decrease.",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "No",
                "author": "GreenGardenTarot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Exodus: Affordability Crisis Sends Americans Packing From Big Cities",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t know about other area, but I lived in the Greenville/Spartanburg area for many years. Nobody moved to Spartanburg pre-covid. They were so many “affordable” neighborhoods being built in surrounding areas like Simpsonville, Traveler’s Rest, Powdersville. It was only once these neighborhoods got built out and more expensive that people bought in Spartanburg. It was crazy to see the prices increase so much during covid, mostly due to demand of relocators. I remember one neighborhood had homes around $300k and couldn’t sell homes so some buyers were getting as low as $275k. Within a year of covid, they were selling out of homes listed at $400-450k.",
                "author": "cusmilie"
            },
            {
                "raw_content": "Wendell cox and Joel Kotkin? These guys are known anti-density propagandists who cherry pick data to suit their narrative. This is even in the article: > much of the urban growth in the Midwest has come from migration from smaller towns in their region instead of from the coasts. The demographic vitality of places like Indianapolis and Columbus, for example, has been primarily from surrounding metro areas and rural regions. Exactly. People aren’t moving halfway across the country to cheaper metros. They’re staying within the same region. Also - Population may be stagnating in HCOL cities, but the number of households are growing. Why? Because now there aren’t as many working class families of 7 living in shitty 2 bedroom apartments anymore. It’s a lot of dual income no kids. And If people are fleeing HCOL metros, why do prices keep going up? Another gem: > This development has helped spur significant gains in net domestic migration in states like Alabama, Oklahoma, Arkansas, Maine, New Hampshire, and South Dakota First off - Southern Maine and New Hampshire are within commuting distance of Boston. This is Boston area growth. These other states - their “domestic migration population gain” is from nearby states. People aren’t “fleeing” NY for Alabama. They’re moving from Tennessee, florida, Georgia… and probably not because of cheaper housing - more likely job opportunities or moving closer to family.",
                "author": "Badtakesingeneral"
            },
            {
                "raw_content": "Can we really blame them? Cost of living rise in the cities have out paced rural areas. Better air, water, traffic.",
                "author": "Love-for-everyone"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, September 12, 2025: New low sparks big application demand",
        "score": 56,
        "text_content": "With rates on a downward trend, purchase applications saw the highest year-over-year growth rate in four years, according to Freddie Mac.",
        "comments": [
            {
                "raw_content": "Yeah I was among them. Still low-balling though. I’m not looking to buy at a high price regardless of rates.",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "Interest rates are a factor, but prices are more important. With the job market struggling, inflation picking up, and the looming threat of AI taking more jobs away in coming years, committing to a huge 30 year loan is a daunting proposition IMO",
                "author": "Dapper_Mud"
            },
            {
                "raw_content": "Increased mortgage applications can only mean one thing: The crash is coming!!!",
                "author": "zer0sumgames"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Consumer Sentiment Falls to Lowest Since May on Job Worries",
        "score": 42,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Apartments Are Increasingly Likely to Get Snapped Up Quickly As Construction Slows",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The current “fake luxury” apartment I am renting was on rental listing for about six months (back in February for 3 grand). I just rented it six months later (August,2025) for 2,850. Location: Manalapan, NJ",
                "author": "omar893"
            },
            {
                "raw_content": "Guess rents are going up. Luxury apartments 3-3.5k by me fly off the market. Invest the difference.",
                "author": "Sufficient-Flower775"
            },
            {
                "raw_content": "> Still, the odds of an apartment getting rented quickly are lower than they were during and before the pandemic moving frenzy, when the absorption rate was above 50%. Like, am I misunderstanding what this means? Cuz this line seems to be in conflict with the headline and earlier parts of the article. There’s also no accounting for the trend of property holders delisting from sale to list for rent instead of lowering price. There’s got to be at least some pressure on filling apartments from that too. Eh I’m not buying this…smells weird. Edit: typo",
                "author": "Apprehensive_Rip_930"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Oracle of Wall Street Warns US Housing Market Faces Demographic Trouble",
        "score": 21,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Within 40 min codex-cli with GPT-5 high made fully working NES emulator in pure c!",
        "score": 327,
        "text_content": "Within 40 min codex-cli with GPT-5 high made fully working NES emulator in pure c! Is even loading roms. I thought AI will be able to write NES emulator not faster than 2026 or 2027 .. that is crazy. https://preview.redd.it/7oz0b3jjjtof1.png?width=1375&format=png&auto=webp&s=f0265fb2e4bdf2441b65e2dfb1badcbef639d4bf https://preview.redd.it/63w5h2jjjtof1.png?width=1403&format=png&auto=webp&s=2b81eda9d79a5199755d39cfa89c4440b412fa36",
        "comments": [
            {
                "raw_content": "How does it handle running this NES rom that tests emulator accuracy? https://github.com/100thCoin/AccuracyCoin",
                "author": "fleshthrows"
            },
            {
                "raw_content": "I mean you have dozens of examples. Even GPT5 without internet access probably have dozens if not hundreds of literal lines doing exact same thing. One second search shows multiple repos: [https://github.com/idircarlos/NES](https://github.com/idircarlos/NES) (Literally description is \"**NES Emulator written in pure C**\") [https://github.com/ObaraEmmanuel/NES](https://github.com/ObaraEmmanuel/NES) Still impressive for a LLM to achieve this of course. If you ask it to create a simple nes game designer in pure c that will generate nes file that we can run with these emulators, then that would be an interesting case (since I'm not aware of such repo) Edit: LOL getting downvoted because I'm explaining what overfitting is why it's not groundbreaking. You don't have to be ML Engineer to understand overfitting rule is not as impressive as you think it is and why ML field don't like that.",
                "author": "puzzleheadbutbig"
            },
            {
                "raw_content": "Ok, now ask it to convert to a novel game emulator and produce a game for it",
                "author": "the_ai_wizard"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s internal models can think for hours",
        "score": 668,
        "text_content": "We have to within AGI territory at this point",
        "comments": [
            {
                "raw_content": "He is not saying their internal unannounced models can think for hours, he is saying that their best reasoning models can think for hours. He is comparing o1-preview, which was thinking for a very short amount of time to current models which are thinking way harder and doing wider search than o1-preview. And yes current models can think for minutes or even up to an hour with research: https://preview.redd.it/2ylu7wkj0sof1.png?width=439&format=png&auto=webp&s=518c829def5179c94a3e6b4f8f19ed596051da5b Probably can see hours if they don't limit it internally",
                "author": "puzzleheadbutbig"
            },
            {
                "raw_content": "I'm pretty convinced the recipe for engagement on this sub is to: - take a tweet from an OpenAI employee - slightly misinterpret it, but in a way that changes the meaning by a lot - post and then watch people argue",
                "author": "garden_speech"
            },
            {
                "raw_content": "It can, and it can deliver, but with diminishing returns. Also, why do we count thinking in times? If I throttle the same application 10 times, can I say that it becomes 10 times smarter? My expectation for a good service is to think more, but **FASTER**.",
                "author": "amarao_san"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This Guy got ChatGPT to LEAK your private Email Data 🚩",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No he didn’t. This is the equivalent to downloading a random browser extension and giving it permission to your emails.",
                "author": "Warm-Letter8091"
            },
            {
                "raw_content": "If the user has to click accept to allow an email to be sent to a “hacker” it isn’t a hack. Sorry man, try again.",
                "author": "redonculous"
            },
            {
                "raw_content": "Meh. Wake me up when ChatGPT leaks all 230 million user email addresses.",
                "author": "SUNTAN_1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Math, Inc.'s Gauss - an autoformalization agent that just completed Terry Tao & Alex Kontorovich's Strong Prime Number Theorem project in 3 weeks",
        "score": 48,
        "text_content": "https://www.math.inc/gauss",
        "comments": [
            {
                "raw_content": "Noob question: why is this a big deal? What will this enable that non-mathematicians will notice?",
                "author": "TikkunCreation"
            },
            {
                "raw_content": "If Math, Inc. manages to solve P vs. NP and discovers that P = NP, they'll gain a lot of fame. I'm also curious that they're using the .inc domain, which isn't that common. Although I have a feeling they'll be acquired in the future, whether by OpenAI, Anthropic, xAI, or another company.",
                "author": "Casq-qsaC_178_GAP073"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana is so incredibly useful.",
        "score": 1083,
        "text_content": "My parents wanted to repaint their living room, but they couldn't settle on a colour to use. So I decided to generate some random variations and send it over to them to see what they think. they were amazed with the results. Word of warning It can't do exact pantone, colours or anything, but it's pretty good to get a general look on what some basic colours would feel like. (Dont mind the mess)",
        "comments": [
            {
                "raw_content": "That’s how an image edit ai should be used.",
                "author": "Glittering_River5861"
            },
            {
                "raw_content": "I'm trying to build a tool to do exactly this, but for exterior buildings and nano banana has failed me so many times, it works likes once in 10 tries. Not at all consistent",
                "author": "No_Impression8795"
            },
            {
                "raw_content": "Slate gray is the winner.",
                "author": "spinozasrobot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Japan advances embryo research without eggs or sperm, sparking ethical concerns",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they talking about in vitro gametogenesis, or an alternate path? Either way, the point for them is clear. More than 10% of their people are already born from IVF, and the biggest roadblock in IVF is embryo creation. Their birth rate is low too. Boost the success, lower the health burden, and decrease the cost of embryos, and they will see an uptick in births. Not to replacement or anything crazy like that, but maybe a solid 0.1 improvement in TFR. This is one of the best national investments they can make. Of course, improving embryo creation also enables substantial embryo selection. Probably not their goal, but it'll happen regardless.",
                "author": "Temp_Placeholder"
            },
            {
                "raw_content": "Actual ethics or just christians being fucking annoying again and pushing their belief system onto everyone else? There's a huge difference.",
                "author": "incompletemischief"
            },
            {
                "raw_content": "Fuck ethics. All my homies hate ethics.",
                "author": "s1stersnuggler"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese Academy of Sciences Releases \"Linear Complexity\" Brain-Inspired Large Model with Domestic GPU for 100x Faster Context Processing",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Full details, including a 27 page PDF are at this [link](https://arxiv.org/abs/2509.05276)",
                "author": "lughnasadh"
            },
            {
                "raw_content": "\"Scientists have invented new brain inspired AI that bests LLMs\" is a line that has been uttered a thousand times but has never borne fruits",
                "author": "New_Equinox"
            },
            {
                "raw_content": "They take pre-trained model, convert it to something close to linear attention, and then boast about performance in very specific edge cases. It's similar to RWKV models, as they also convert models to something akin to linear attention. They don't show that those models maintain quality at those long context, which is usually what breaks down with those conversions.",
                "author": "FullOf_Bad_Ideas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Apple, Google and Meta are trying to perfect a science-fiction gadget: The universal translator\"",
        "score": 238,
        "text_content": "[https://www.cnbc.com/2025/09/12/apple-google-meta-universal-translator.html](https://www.cnbc.com/2025/09/12/apple-google-meta-universal-translator.html) \"Pocketalk’s Miller believes that the potential of the technology goes far beyond a tourist ordering a glass of wine in France. He says that it’s most powerful when its used in workplaces like schools and hospitals, which require privacy and security features that go beyond what Apple and Google provide. “This isn’t about luxury tourism and travel,” Miller said. “This is about the intersection of language and friction, when a discussion needs to be had.”\"",
        "comments": [
            {
                "raw_content": "about time",
                "author": "redditnosedive"
            },
            {
                "raw_content": "\"[T]he poor Babel fish, by effectively removing all barriers to communication between different races and cultures, has caused more and bloodier wars than anything else in the history of creation.\" Douglas Adams, The Hitchhiker's Guide to the Galaxy.",
                "author": "motophiliac"
            },
            {
                "raw_content": "Did google use gemini to improve google translate because it seems the most obvious low hanging fruit Gemini can give amazing translations",
                "author": "Jeannatalls"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How can those countries who rely on importing massive energy and food build UBI after AGI?",
        "score": 27,
        "text_content": "There are many countries have to import massive energy and food from other countries to feed their local industry, if global unemployment caused by AGI and their industrial strength is compromised by AGI, then they can't get foreign exchange, under this case, their economy will break because they can't import energy and a disaster will happen, how can these countries survive this singularity and build UBI? AGI can't conjure up energy and food from void",
        "comments": [
            {
                "raw_content": "Before fusion is solved I don't think realistically you get UBI for anyone. Fusion leads to widespread usage of desalination (extremely energy hungry process), those 2 solve energy and water. If you solve energy and water the next follow up is food since you should be able to harvest salty water and make vertical gardens almost everywhere that has access to a sea/ocean. Basically you get AGI, you make it solve fusion for you, then you make it build the fusion plants asap with robots and that leads to everything else becoming so much cheaper, then UBI is viable for everyone. Of course the above point doesn't take into account human greed which is a different topic all together.",
                "author": "Daskaf129"
            },
            {
                "raw_content": "The poor country buys a dozen robots. In a week, the robots build a solar panel factory that spews out panels and they have the energy they need. Then the robots build huge hydroponic farms in greenhouses that provide their food. Then, they build robot factories so everyone gets a free robot to work for them. It could til soil during the day and build homes or EVs or jetliners or more robots at night. Everyone becomes unimaginably wealthy.",
                "author": "Less-Consequence5194"
            },
            {
                "raw_content": "US is fucked. Too much opposition leading pretty much inevitably to rebellion. Only the EU centralized zone, China, and the wealthy countries in the east continents like australia, japan, korea and \\*maybe\\* Thailand stand any real chance at it. Maybe Saudi Arabia too, if they get their shit together.",
                "author": "DaHOGGA"
            }
        ],
        "subreddit": "singularity"
    }
]