[
    {
        "post_name": "Minneapolis rioters successfully BROKE OPEN a weapons locker in a federal vehicle and STOLE A RIFLE and ammunition before fleeing I captured the thief’s face and license plate on the getaway vehicle.",
        "score": 166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's going to get real. Fast.",
                "author": "iamstadter"
            },
            {
                "raw_content": "• Theft of federal property • Theft of a firearm • Possession of a stolen firearm • Interference with federal officers • Firearms offenses tied to civil disorder They'll be out of jail the next day.",
                "author": "TheVanNuys"
            },
            {
                "raw_content": "This is like something the police would have stopped in 95% of any of the other neighborhoods in the country.",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump’s Full Spectrum Dominance Against America’s Ruling Class",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only the Alexandrian Solution can cut the Gordion Knot",
                "author": "awsure"
            },
            {
                "raw_content": "Foreign policy has been simplified. You take a country we take a country.",
                "author": "DeltaSierra"
            },
            {
                "raw_content": "Teflon Don!",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LEFT: Washington State elementary school students saying their classrooms don’t have money for tissues or scissors RIGHT: Here are the salaries of Washington State Schools Superintendents (Some make more than the President of the United States) - $432,000/year - John Holman (Lake Washington School",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its the same in almost every school district in the US. My son attended school 2 years before I home schooled him Parents, at the beginning of the year, are given a list of things they need to bring for everybody to share. It included paper towels, tissue, wet wipes, pencils, hand soap and sanitizer, cups, paper, copy paper, notebooks, poster paper. That was 20+ years ago and it was around $100 of stuff and took two people to carry it all in. Most don't know it but school superintendents hire friends and family as \"consultants\" with 6 figure salaries. Check out your local school boards. You will be appalled.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "Ask the Somalis where all the money went",
                "author": "awsure"
            },
            {
                "raw_content": "LEFT: Washington State elementary school students saying their classrooms don’t have money for tissues or scissors RIGHT: Here are the salaries of Washington State Schools Superintendents (Some make more than the President of the United States) - $432,000/year - John Holman (Lake Washington School District) - $350,000/year - Dan Schlotfeldt (Snoqualmie Valley School District) - $345,000/year - Susana Reyes (Shoreline School District) - $281,000/year - Fred Rundle (Mercer Island School District) - $392,000/year - Justin Irish (Northshore School District) - $309,000/year - Susan Leach (Riverview School District) - $429,000/year - Damien Patenaude (Renton School District)",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance cast the tie-breaking vote attempting to limit Trump's war powers. Thank you JD Vance.",
        "score": 1211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s really sad. Those freaking senator Republicans are idiots that voted and had to have the vice president break the tie.",
                "author": "Dwoj"
            },
            {
                "raw_content": "3 Rino traitors who voted with Democrats - Lisa Murkowski (Alaska) - Rand Paul (Kentucky) - Susan Collins (Maine) https://www.senate.gov/legislative/LIS/roll_call_votes/vote1192/vote_119_2_00009.htm",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Mike Pence had one job: to support President Trump. JD Vance is doing it at least.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Walz just demanded every resident of Minnesota STALK and HARASS ICE agents so the agents can be arrested and \"prosecuted\" in the future. He's declaring full-on WAR against federal law enforcement, carrying out federal law.",
        "score": 1089,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lock this pansy up.",
                "author": "johnqpublic864"
            },
            {
                "raw_content": "this is very basic treason, it should be obvious to everyone. execute him",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "This guy is seriously a fucking terrorist. It probably won't do anything, but I sent this video to the fbi, mainly because I was bored lol. If there was actual justice in the system, the fbi would take immediate action, but unfortunately justice hasn't existed for a long time in America.",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "God I want this so bad lol. 🙏🙏😂😂",
        "score": 1206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She was clearly an accessory, as well as inciting riots.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "She's not a widow and yes, they should charge her. Good luck in MN, hell's armpit.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Good. Then seize the 1.5 million raised for Renee Good on GoFundMe and give it to Jonathan Ross. [Jonathan Ross' GoFundMe is here - $730,775 raised so far](https://www.gofundme.com/f/support-ice-officer-jonathan-ross)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS statement on tonight's shooting in Minneapolis",
        "score": 901,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Martial law time. Thats when the real FAFO party starts",
                "author": "Justlooking250"
            },
            {
                "raw_content": "The last paragraph should not be that mamby-pamby bullshit. It should read as such: Minnesota Governor, Tim Walz, along with Minneapolis Mayor, Frey are in custody for violating 18 U.S. Code § 2384 (Seditious Conspiracy),",
                "author": "I_Love_45-70_Gov"
            },
            {
                "raw_content": "This is an invasion. They need to act accordingly.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This American’s mom just died and was going through her paperwork Her mom and dad paid in roughly $1 million combined into social security throughout their lives Her dad died before he could collect, her mom only collected for 4 years at 32k per year They got back $128,000 combined",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I actually don’t believe they paid in 1mm. After working 30 years myself and maxing the majority of the years, I only paid about 250k. But it’s theft nonetheless. A massive fucking ponzi scheme",
                "author": "BKav"
            },
            {
                "raw_content": "That's the fucking point. Social security was always designed to be a hidden tax.",
                "author": "CLF3"
            },
            {
                "raw_content": "Social security is and has always been a Ponzi scheme. I been paying that shit for forty-five years, but not a penny of it was ever put away in my name. The accounting they do for the statements they send out and to calculate your benefit is just eyewash to trick otherwise faithful Americans into believing that the payout was somehow \"earned\" instead of straight-up welfare payments. Fucking idiots who think they are real Americans and conservative get fighting mad when you point this shit out to them. That fucking piece of shit cripple, FDR, really put one over on everybody.",
                "author": "FRONT_TOWARD_LEFT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrats calling for ICE to be abolished: ✅ Shri Thanedar ✅ Pramila Jayapal ✅ Ro Khanna ✅ Raja Krishnamoorthi Can we admit legal immigration was a mistake?",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Foreigners should not be permitted to hold public office at any capacity. America is for Americans!",
                "author": "SouthernFriedFreedom"
            },
            {
                "raw_content": "Deport them all",
                "author": "FreedomLubber"
            },
            {
                "raw_content": "# FUCKEN PAJEEEEEEEEEEEEEEEEEEEEEETS!!!!",
                "author": "AfrikaanerBoer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lock Him Up",
        "score": 812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He should share a cell with Beijing Biden*",
                "author": "Justlooking250"
            },
            {
                "raw_content": "The Fraud Father Part 1.",
                "author": "2Clutch"
            },
            {
                "raw_content": "Tampon Tim the closeted homo.",
                "author": "TruckerQuarrelsome"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minneapolis (Jan. 14) — Gas irritants are used to disperse the far-left rioters attacking federal agents after an illegal migrant was shot in the leg during a shovel attack.",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Choke commie fucks",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "Pam, where in the fuck are you? Why are you letting terrorists run around?",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "How bout live ammo?",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🖕🏻",
        "score": 1487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOVE IT!!! Take that peasants.",
                "author": "Mona1950"
            },
            {
                "raw_content": "Up yours, libtards!",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "The perfect response to literally every leftist nutcase We need giant counter protest signs with this image on it",
                "author": "AbsurdOpinion"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley: David and I expose another $16 Million in fraud as Minnesota welfare programs continue to operate fraudulently and steal from law-abiding taxpayers.",
        "score": 1528,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he fucked up by getting dragged into a debate as to whether he hated muslims or not, or wanted to deport muslims or not, and he backpedaled and defended himself, which you should never do. and by the way, we SHOULD deport muslims. they have no right to be here.",
                "author": "yodayoda"
            },
            {
                "raw_content": "I want federal agents raiding all these places and detaining all these fuckers.",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "It's so fucking embarrasing being conned by RETARDS.",
                "author": "SenorTrumper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance : In the Obama administration, they counted being turned away at the border as a deportation. A person would show up, be sent back, and counted as a deportation. We have to do deportations from the interior of the country because Biden and Harris let them walk in.",
        "score": 1304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We really are in a Civil War. There's no ambiguity who the Democrats have thrown their lot in with. Foreign invaders for the sake of holding on to their power or the hopes of getting it back. Whichever the case may be. If you think the '60s were unruly, you ain't seen nothin yet.",
                "author": "airborne3502"
            },
            {
                "raw_content": "This argument is just entirely fake, for two reasons. 1) In the Obama administration, they counted being turned away at the border as a deportation. A person would show up, be sent back, and counted as a deportation. We have to do deportations from the interior of the country because Biden and Harris let them walk in. 2) In the cities that are not sanctuary cities, the deportation process is orderly and normal--like most law enforcement. In Minneapolis and a few other sanctuary jurisdictions, local jurisdictions and a few leftwing agitators have decided to wage war on all immigration enforcement officers. They are hoping that a little chaos will convince us to give up on immigration enforcement. They are wrong.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "The VP is correct. Obama counted a class of Mexicans sent back under “voluntary return” as deportations. There is no accounting for how many of that 3 million were repeat customers. At the same time Obama’s DACA EO influenced millions to drag a kid with them because they couldn’t be returned.",
                "author": "Induceddrag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Wait, they have guns?!!!\"",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro you can't even assault ICE agents with a shovel bro this is like literally Nazi Germany bro.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "You must lash out with every limb, like the octopus who plays the drums.",
                "author": "SWRAD"
            },
            {
                "raw_content": "The Shoveler from *Mystery Men*",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A TSA whistleblower exposed to Nick Shirley that he WATCHED Somalis send millions of dollars in *cash* through the airport on a weekly basis via suitcases. \"Millions. Literally millions and millions. I mean, we're talking for a good 5-6 years you're talking...$5-6M per week!\"",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now his faggot ass says something? He’s just as guilty.",
                "author": "Donger-Lord"
            },
            {
                "raw_content": "That's 1,560,000,000 billion - 1,872,000,000 billion.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Time to shut down Minneapolis. Just shut it down. Like for covid but for investigation.",
                "author": "TrumpYouMagaFrenner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One single Indian immigration lawyer has approved 700,000 H-1B applicants in Texas Where is Greg Abbott? Where are the Texas Republicans you keep voting for over and over again?",
        "score": 1002,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ummm... immigration lawyers don't approve H1B applications. The immigration lawyer submits the petitions. USCIS approves or denies them. Its also a federal activity and has nothing to do with Texas. This lady is retarded. Edit: How does this retard video get stickied? Wow.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Once a Pajeet is in your company and within the HR or in charge of recruitment, expect your company to be pajeetified within five years max. There are some species of birds in the wild which take over the nests built by other birds. There is even a Chinese proverb describing this phenomenon. https://www.chinesepod.com/dictionary/鹊巢鸠占",
                "author": "knnbccb"
            },
            {
                "raw_content": "Seems like the red states aren't very red.",
                "author": "aqua27"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This could be bad...",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gowdy is a total failure.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "Gowdy is a total fraud, how is his name even being suggested? There would be no hope for justice with him in charge.",
                "author": "A_Colostomy_Bag"
            },
            {
                "raw_content": "From bad to worse.",
                "author": "OlivaireBandaloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣",
        "score": 727,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol that meme is forever I love that guy",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "Marco has become one of the best choices in Trump's amazing band of Secretaries.",
                "author": "LegXI"
            },
            {
                "raw_content": "Can you hear me now?",
                "author": "TakingCoatsWIN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America Only!",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All invaders must be deported.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Embrace Americanism!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Okay. Now practice what you preach and send all Indians ans muslims home. Stop the visas and visa scams.",
                "author": "invalid_data"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel says laptop makers are sitting on 'about 9 to 12 months' of stock, and it might be the key to surviving the RAM crunch",
        "score": 417,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn't Intel have a sizable inventory of Lunar Laks chips with on-package RAM? Also: >And second, it’s forcing companies like Microsoft to look into their software and make it more efficient. lmao",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "yea in CES it felt pretty obvious that a bunch of brands are still sitting on RAM stock, and are implicitly using \"our laptop got lots of RAM\" as a selling point they out here offering their laptops with maximum **64GB** RAM, even midrange laptops like the [Strix Halo Asus TUF A14](https://www.notebookcheck.net/Now-with-48-GB-VRAM-Asus-updates-14-inch-gaming-laptop-with-new-version.1204358.0.html)",
                "author": "LastChancellor"
            },
            {
                "raw_content": "I don’t think the memory crunch is going away in 12 months unless a massive crash in compute and data center demand just vanishes",
                "author": "shakhaki"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia DLSS 4.5 Super Resolution leaves beta, available now to Nvidia app users — update includes support for over 400 titles with new presets",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello BarKnight! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So this is what the 50 series “super” was. “Super” resolution",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel® Core™ Ultra Processor (Series 3) Datasheet, Volume 1 of 2",
        "score": 10,
        "text_content": "Contains lots of infos, such as no L0 cache for E/LPE and funny enough for Panther Lake, CSO-DIMM is now faster than LPCAMM2 (7200MT/s 6400MT/s)",
        "comments": [
            {
                "raw_content": "To tag onto this a little bit, volume two hasn't been published yet, but the specification update containing some errata has. [https://www.intel.com/content/www/us/en/content-details/869992/intel-core-ultra-processors-series-3-specification-update.html](https://www.intel.com/content/www/us/en/content-details/869992/intel-core-ultra-processors-series-3-specification-update.html) The usual array of wonky USB and power state change issues.",
                "author": "AK-Brian"
            },
            {
                "raw_content": ">CSO-DIMM is now faster than LPCAMM2 (7200MT/s 6400MT/s) CSODIMM and LPCAMM2 aren't really comparable form factors as they're entirely different memory technologies (DDR5 vs LPDDR5), but I think you might have misread the spec somewhere? Page 155 has the maximum memory speeds: (some editing for clarity) |SKU|DDR5 (CSODIMM)|LPDDR5/x (Soldered)|LPCAMM2| |:-|:-|:-|:-| |WCL (404)|6400|6800|6800| |PTL (H484/H12Xe)|7200|9600 |7476| LPCAMM2 is unsupported for the top end LPDDR5/x configurations, but still (marginally) beats out CSODIMM DDR5 for clockrate.",
                "author": "TheRealBurritoJ"
            },
            {
                "raw_content": "What do you think will be the performance of the bottom ultra 5 with only 2 p cores and 4 lpe cores? Are the lpe performant cores enough to match or outperform alder lake/raptor lake e-cores?",
                "author": "Aristotelaras"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Trump enacts 25% tariff on chips — with a caveat\"",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> However, chips imported to support building up the US technological supply chain would be exempt. It’s unclear, though, what criteria would need to be met to qualify for the exemption",
                "author": "gumol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cybenetics “Anti-Melt” GPU cable prototype aims to protect all 12V-2×6 connectors",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As an engineer - maybe use a connector that is fit for purpose.",
                "author": "SplatThaCat"
            },
            {
                "raw_content": "All this bs forced techmology, just because a company is too idiotic to use thick and/or multiple connectors.",
                "author": "BleaaelBa"
            },
            {
                "raw_content": "ASRock phantom gaming psu has a thermistor built in and there’s already a article on how it saved someone’s Gpu",
                "author": "Tommyjones91"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OpenAI enters $10 billion partnership with Cerebras",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Going from measuring compute in Peta/exaFlops to measure it in \"750MW of ultra low-latency AI compute\" is something...",
                "author": "MaverickPT"
            },
            {
                "raw_content": "Mistral already uses cerebras and they are the leading edge in low latency inference, the issue is that, well each \"chip\" is 3M$",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "750MW for $10 billion? Is that a nuclear reactor? :P",
                "author": "roionsteroids"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: China's customs agents told Nvidia's H200 chips are not permitted, sources say",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally it seems Reuters is done with their Intel coverage.",
                "author": "TwoTimeHollySurvivor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Longer, Faster, Better Cables: HDMI 2.2 and DisplayPort 2.1 Updates for 2026",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2M length for a passive 96Gbps cable? How!? That's magic.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Incredible how high end monitors still launching with dp2.1 13uhbr lol",
                "author": "Slabbed1738"
            },
            {
                "raw_content": "Call me boomer, but I'd like to have a readable website for this kind of news and info instead of a youtube video.",
                "author": "superkickstart"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[High Yield] The Memory Crisis Explained",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was a shit post by high yield. I think the dram crisis is breaking him.",
                "author": "advester"
            },
            {
                "raw_content": "Do we need another post about ram?",
                "author": "LuluButterFive"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lmao",
        "score": 1627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lego prices are totally wack",
                "author": "myretrospirit"
            },
            {
                "raw_content": "So weird to me to have it be all three pokemon in one. They should’ve done each for 200 and then allow the three to be mounted on a stand like this. I’d probably splurge on a single blastoise.",
                "author": "RickyWinterborn"
            },
            {
                "raw_content": "It’s been interesting seeing people realize how expensive 5,000+ piece Lego sets are. Big ass sets are always ridiculously expensive. Also, this isn’t targeted towards the average consumer. You’re not gonna see these things on shelves at target or Walmart.",
                "author": "nippletang"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Target’s spend $100 on Nintendo games and get $30 off.",
        "score": 352,
        "text_content": "Still working on Octopath Traveler 0 but I couldn’t pass up on a deal. Still has Yakuza 0 to play before Kiwami or do I need to play the Kiwami first? lol.",
        "comments": [
            {
                "raw_content": "It's a Target app (Circle Deal) only for \"Select\" users. Users get \"Personal\" deals on the app based on their purchase history and on depending on how much you spend and how often you shop at Target using the app. Unfortunately it's not a deal that everyone can get. I got the deal and ended up using it on Kirby Air Riders and Mario Tennis Fever (Yes it works on Pre-Orders). Very handy for 1st party Nintendo games and is easier on the wallet because those rarely ever go on sale.",
                "author": "ChunkySlugger72"
            },
            {
                "raw_content": "That’s a good haul. I ended up getting Metroid Prime Remastered, Astral Chain, and KUNITSU-GAMI: PATH OF THE GODDESS",
                "author": "Sskoga"
            },
            {
                "raw_content": "Excellent deal for 100 bucks",
                "author": "Bagginnnssssss"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You know....it's really funny to think that in an alternate universe.....we got this instead of the switch 2.",
        "score": 178,
        "text_content": "Just imagine if this really happened.....and we actually got this over the switch 2. I'm not sure how i'd feel if that was our reality....but it's still funny to think about.",
        "comments": [
            {
                "raw_content": "I don’t think there’s any alternate universe we get this instead of S2. Maybe instead of S1.",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "I love how it's just the shadow drop trailer for Switch 2 but fat lol.",
                "author": "20AidenGaming12"
            },
            {
                "raw_content": "So an uglier, fatter Switch 2 is what you’re saying.",
                "author": "Ok-Courage2177"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Animal Crossing: New Horizons Version 3.0.0 Patch Notes",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“You can now ask Leif to remove weeds when there are 30 or more weeds on your island, either on Harv’s Island or during his visits.” Best feature.",
                "author": "danielvdell"
            },
            {
                "raw_content": "“Other adjustments and corrections were made to improve the gameplay experience.” Oh hell yeah, let’s go",
                "author": "TacoRocco"
            },
            {
                "raw_content": "The added a Zelda-like L-targeting mode for strafing. Nice!",
                "author": "originalorientation"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Speculation] I have zero proof but there will be two Directs in February",
        "score": 41,
        "text_content": "**Only reason I'm posting this is just to have it on the record. I just want someone to know that I predicted this in the slim chance that it does come true.** The first will be regular Direct in the first week, \\~50 minutes long and outline the normal stuff. Couple medium to big-ish first-party announcements with a new 3D Mario at the end to wrap it up. No release date. During this Direct they'll mention that the 40th Anniversary of The Legend of Zelda is later in the month, and announce the second Direct. It'll be Zelda-focused (duh) on the 21st, \\~20 minutes long and will have a new teaser for the movie, 3D re-releases scheduled for later in the year, and a new big 3D Zelda. No release date, just \"in development.\" Will get a release date late this year/early next year for 2028 but will be delayed to 2029. \"You're delusional\" comments welcome. Edit; I mean *excluding* the Pokemon Presents. That's a given.",
        "comments": [
            {
                "raw_content": "![gif](giphy|nExakCp2xCD28)",
                "author": "Bloodwalker09"
            },
            {
                "raw_content": "Source: it came to me in a dream.",
                "author": "Isunova"
            },
            {
                "raw_content": "I mean Pokemon Day is February 27 Sooooo",
                "author": "MoldyZebraCake666"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Buying nintendo switch2 cured doomscrolling",
        "score": 1177,
        "text_content": "I realized I’ve replaced doom scrolling with playing Mario Kart World, and honestly, it feels way better. Instead of mindlessly opening Reels over and over, I’m doing something interactive at least. Being able to carry a gaming console everywhere also helps a lot. Whenever I feel the urge to scroll, I just boot up the Switch instead. Even short sessions feel more satisfying than endless scrolling. I can honestly say that the Nintendo Switch 2 got me back into gaming. It doesn’t demand too much mental energy but still feels engaging, which is exactly what I was missing.",
        "comments": [
            {
                "raw_content": "I honestly find it hilarious that people out there who think of gaming as a waste of time are also the people who binge watch a ton of lousy shows and spend hours a day scrolling on social media.",
                "author": "PunIntended29"
            },
            {
                "raw_content": "It has helped me with sobriety. Gaming for 2 hours is WAY healthier than drinking for 2 hours.",
                "author": "ADK011"
            },
            {
                "raw_content": "I love the Switch 2. So much that there are some games I bought on other platforms that I have double dipped on for the Switch 2. I think the Switch 1 was almost there for me but I’d avoid a lot of third party multi platform games on it because it wasn’t very powerful. When you see games like Cyberpunk, MK World, DK Bananza or Metroid Prime 4 running on handheld, it’s hard not to be impressed.",
                "author": "TripleS82"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden 26 switch 2 has a free trial with a nso membership",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most reddit people aren't sports oriented, but this is nice to know!",
                "author": "SSCyclone"
            },
            {
                "raw_content": "I’ve enjoyed Madden despite all the bugs people have complained about, I’ve not had any affect the gameplay. I love playing Madden on the go!",
                "author": "mgd09292007"
            },
            {
                "raw_content": "Full game should be free with how much they push the micro transactions",
                "author": "TrojanX"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Animal Crossing New Horizons Switch 2 edition and 3.0 free update is live.",
        "score": 335,
        "text_content": "Just a reminder the new update content it's not tied to Switch 2 edition, it's free to everyone while the Switch 2 upgrade it's mainly about resolution, mouse controls and some small extras. Edit: while the Switch 2 edition update is up, you can only play at midnight.",
        "comments": [
            {
                "raw_content": "Note that the NS2E releases at (for most regions and at least digitally) midnight local time, while the 3.0 can be accessed immediately.",
                "author": "pikachuyann"
            },
            {
                "raw_content": "Yeah it tells you the upgrade pack can’t be played yet, and if you continue it’s booting the Switch 1 version",
                "author": "OutrageousLeg4677"
            },
            {
                "raw_content": "Can anyone confirm that the FREE update pushes handheld Switch 2 resolution to 1080p? And the PAID upgrade is just for 4k docked (+ extra SW2 features)? I'm primarily a handheld player so thinking the free upgrade is all I need if they've bumped it to 1080p handheld..",
                "author": "Nath4n"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Camouflaj layoffs essentially leaves the studio dead, reportedly leaving behind a skeleton crew of fewer than 10 engineers to work on Meta hardware, with Batman: Arkham Shadow 2 and any future projects from the studio effectively being cancelled.",
        "score": 235,
        "text_content": "Link: https://aftermath.site/meta-layoffs-camouflaj-batman-arkham-shadow/ Batman arkham videos: https://xcancel.com/ArkhamVideos/status/2011611301382959592#m",
        "comments": [
            {
                "raw_content": "Surpassed performance goals and still got shutdown.",
                "author": "Deadly_Toast"
            },
            {
                "raw_content": "Such a sad headline man",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "This slowly confirms Meta's exit from VR gaming (All studios shutting down one by one). I wonder what the Beat Saber devs would go?",
                "author": "Razbyte"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shovelware publisher ThiGamesDE of the jumping taco/sushi/burger series yoinked off PSN by Sony, together with 1194 of their other shovelware games.",
        "score": 859,
        "text_content": "They are the 4th largest publisher on PSN. This might have to do with the new collective safety rules by Nintendo, Sony and Microsoft. As a way to collectively tackle shovelware/AI slop in stores. The timing is curious. First reported by RobThanatos on X. Source: [https://xcancel.com/RobThanatos](https://xcancel.com/RobThanatos)",
        "comments": [
            {
                "raw_content": "Good. Get rid of all of them. The eShop is the worst of them all",
                "author": "Greatsnes"
            },
            {
                "raw_content": "Good... These \"games\" are made for people who want to get easy Platinum trophies and nothing else.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "![gif](giphy|J8FZIm9VoBU6Q)",
                "author": "CodswallopNCastorOil"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[ArkhamVideos] I'm hearing some really disheartening news that Camouflaj, the studio behind Batman: Arkham Shadow, may have been completely laid off following Meta's recent restructuring, including game director Ryan Payton and producer Matt Walker, despite reports suggesting studio was unaffected.",
        "score": 438,
        "text_content": "https://xcancel.com/i/status/2011548475327131665 \"I'm hearing some really disheartening news that Camouflaj, the studio behind Batman: Arkham Shadow, may have been completely laid off following Meta's recent restructuring, including game director Ryan Payton and producer Matt Walker, despite reports suggesting the studio was unaffected.\"",
        "comments": [
            {
                "raw_content": "Wait wasn't an sequel to Arkham Shadows been announced to be in development?",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Arkham is reaching Titanfall levels of cursed at this point.",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "If that's true then fuck Meta. Buying all those studios just to shut them down a few years later.",
                "author": "And98s"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin creed Black flag remake: Ubisoft has started uploading Assassin’s Creed Black Flag music to YouTube. Looks like some announcement is coming very soon. 👀",
        "score": 572,
        "text_content": "https://xcancel.com/TheRealZephryss/status/2011443783297286445#m",
        "comments": [
            {
                "raw_content": "Looks like the leaked March release date might be accurate",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Im still predicting that the AC Black Flag Remake/Remaster and the Prince of Persia Remake/Remaster both get revealed at the same time. Maybe both get a surprise reveal at the Xbox dev direct.",
                "author": "CocoajoeGaming"
            },
            {
                "raw_content": "So I haven't really kept up with black flag news but I swear it's been \"ready to announce very soon\" for six months now.",
                "author": "NoAppointment6129"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Sonic mainline title to be named Sonic Eclipse. Mentioned 3 times in a matter of a month. Mentions also of a Crossworlds DLC plus some other things for a potential Sonic Central for early 2026",
        "score": 249,
        "text_content": "Link: https://arch.b4k.dev/v/search/text/Sonic%20Eclipse",
        "comments": [
            {
                "raw_content": "Somehow this is going to lead to the return of the Warehog when there's an eclipse in the game, isn't it?",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "reads like someones fan fic, seriously doubt any of this is real",
                "author": "florence_ow"
            },
            {
                "raw_content": "lol people can just regurgitate the first guy who said it you know",
                "author": "manfartwish"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Meta Cancelled a Harry potter VR game according to GamerTag VR",
        "score": 251,
        "text_content": "https://youtu.be/_OeL516hJzw He talks about it in the beginning of the video",
        "comments": [
            {
                "raw_content": "Meta cancelled VR. Period.",
                "author": "Z3M0G"
            },
            {
                "raw_content": "Bummer, it has a lot of potential. The Harry Potter wand mod in blade and sorcery is super fun to play with despite it taking a while to learn the gestures.",
                "author": "Kurdependence"
            },
            {
                "raw_content": "I think throwing an IP into VR just isn't exciting to any of us anymore. We want to see some actual game ideas that are fun to play. I had a VR headset for a while and ended up selling it because all the games were largely the same \"here's a gun\" experience, or really short immersive things that were fun for their 2 hour run time. We haven't actually had any decent genre expansion in this area, it's telling it's a VR game and not a puzzle or adventure game. If the medium fully defines the experience the design just becomes like when they make 3d films - gimmicks and shallow interactions.",
                "author": "dewittless"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Original documentation suggested that Black Flag Resynced would begin marketing in January, after the Prince of Persia Remake’s release.",
        "score": 240,
        "text_content": "It’s still unclear if those plans are still in place, considering that the same documents said marketing for the Sands of Time remake would begin in December with a release in January 16th (which could still come true through a shadowdrop). [Source](https://insider-gaming.com/black-flag-remake-release/)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "\"I'm tired boss\"",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "Honestly at this point they should just do something lmao. There's no point in hiding it anymore because everyone knows it's happening. It will release soon anyway, might as well capitalaize and build hype",
                "author": "KvasirTheOld"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Camouflaj suffers layoffs NOT closure",
        "score": 91,
        "text_content": "“A Meta spokesperson confirmed with Kotaku that Camouflaj (the studio behind Batman: Arkham Shadow) is not shutting down, but did confirm it was affected by the recent round of layoffs.”",
        "comments": [
            {
                "raw_content": "It'd be great if a lot of the Meta exclusives would go elsewhere now that they seem to be abandoning their VR division. I think they acquired Camouflaj so I doubt Arkham Shadow is going anywhere, but I'd love for games like Assassin's Creed Nexus and PowerWash VR to come to PSVR2.",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Why do we keep getting all these gaming layoffs?",
                "author": "MOVIELORD101"
            },
            {
                "raw_content": "They might as well be closed, they only have a handful of employees left and every project they had in development was canceled. The way [Aftermath](https://aftermath.site/meta-layoffs-camouflaj-batman-arkham-shadow/?media_id=3810261000403026348_63329336647&media_author_id=63329336647&ranking_info_token=GCBlMzEwZjNiYzFjZWU0ZGFjOWUyNGFhY2NmZGNhODZmYSX+m9YDJvLswZYNGBMzODEwMjYxMDAwNDAzMDI2MzQ4KANuaGEA&utm_source=ig_text_post_permalink) put it, it seems like whatever employees are left are working on the actual hardware now.",
                "author": "aa22hhhh"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 200K Plus and 200HX Plus \"Arrow Lake Refresh\" expected in March/April",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn’t Nova Lake supposed to be Q4 2026? I find it hard to believe they release arrow lake refresh in April and then only 6-8 months later release a whole new platform.",
                "author": "RedditBoisss"
            },
            {
                "raw_content": "I will never tell anybody this but 12900KS to 290k sounds alright. Downvote me if you must, but I've needed an excuse to retire my 12900KS to a 45 watt limited homelab.",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "Excellent news. Thank you. Let me clarify: is there any information about the U and H series? I understand why the mobile HX series will be released in conjunction with the desktop Refresh. But as the owner of a U5 225H-based NUC, I am very interested in learning about the development of this series.",
                "author": "Fun_Masterpiece296"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "J.P. Morgan Predicts the Fed Will Make No Interest Rate Cuts in 2026—but Expects a ‘Hike’ Next Year",
        "score": 337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone is saying jobs growth this year, and I’m asking, where? It’s nothing but layoffs and slowdowns as far as the eye can see.",
                "author": "ohoneup"
            },
            {
                "raw_content": "The top economist at J.P. Morgan believes the Federal Reserve is done cutting interest rates and will hold policy steady through 2026, with the next move likely a hike in 2027. \"We now expect the Fed to hold rates throughout 2026 with the next move to hike later in 2027,\" wrote Michael Feroli, the bank's chief U.S. economist, in a client note. The forecast comes after a series of Fed rate cuts in the fall and winter of 2025, which helped to push mortgage rates down to their lowest level in more than a year. While there are growing signs that Fed policymakers will hold rates steady at the next meeting later this month, financial markets are predicting two more rate cuts in 2026. However, Feroli believes that the U.S. economy will experience accelerating job growth this year and that core inflation will remain above 3%, making it difficult for the Fed to cut rates. Although Fed Chair Jerome Powell's term expires in May, and President Donald Trump is expected to nominate a replacement who favors lower rates, the chair is but one vote on the 12-member Federal Open Market Committee (FOMC), which sets rate policy. \"Against this anticipated macro backdrop, we do not see the new dovish Fed chair being able to sway the FOMC to cut,\" wrote Feroli. Still, the economist noted that his forecast was not a certainty and that changing economic conditions could prompt the Fed to act. “If the labour market weakens again in the coming months, or if inflation falls materially, the Fed could still ease later this year,” he wrote. “However, we expect the labour market to tighten by the second quarter, and the disinflation process to be quite gradual.” For mortgage rates, prolonged inflation and tighter monetary policy from the Fed would deliver upward pressure, likely keeping rates above 6% for the next year. Mortgage rates averaged 6.16% last week, according to Freddie Mac, remaining near the lowest levels of 2025. The Realtor.com® economic research team forecasts that mortgage rates will average around 6.3% across 2026. J.P. Morgan's new forecast follows the latest jobs report, which shows that the unemployment rate fell last month to 4.4%, down from November’s revised 4.5%, which marked a four-year high. Signs of a stabilizing job market also prompted Goldman Sachs and Barclays to revise their forecasts for Fed rate cuts this year, which the two banks now see as coming later in the year. Goldman and Barclays believe the first Fed cut won't come until June, after previously forecasting cuts in March. The two banks still see a total of three quarter-point rate cuts through 2026. “If the labour market stabilizes as we expect, the Federal Open Market Committee will likely shift from risk-management mode to normalization mode,” Goldman said in a note.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage refinance demand surges 40% higher after interest rates tanked last week",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing \"tanked\"",
                "author": "DevilsAdvocateFun"
            },
            {
                "raw_content": "“6.18% from 6.25%.” Time to rejoice 🙄",
                "author": "Extension-Carry-8067"
            },
            {
                "raw_content": "Context is important. A 0.22% drop would be great for those on the fence and cause many to expedite their decision. It would not however incentivize those with Covid rates to move. This is not an effective lever to pull. It has no long term benefit and does not solve any of the structural issues caused by the Covid response.",
                "author": "Cheap-Surprise-7617"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The clearest sign yet that homebuying is no longer about buying a home",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that Polymarket even exists and the idea of people clamoring to bet on just about everything tells me this society and culture are in trouble. We used to see habitual gambling as an addiction, a sickness. But now people see it as a “fun way to play the odds and make money.” It’s no surprise that something like this sprang up in the age of crypto. The odds always favor the house (or the whale), but everyone always thinks they’re smarter and there’s a greater fool out there somewhere. I think my main objection to it lies in the fact that it’s an expenditure of capital and energy that doesn’t produce anything. They’re just sitting there betting on arbitrary events. It’s a guy on a street corner calling over passersby to play three card Monty. And he knows they’ll lose.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "You mean corporations can’t wait to short your friend’s house…normal people don’t go around destroying those around them. Greedy corporations do.",
                "author": "Equatical"
            },
            {
                "raw_content": "It hasn't been about homes for as long as I remember. Its always been \"just buy a house so you can rent it out\".",
                "author": "adobo_bobo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "You can now bet on a housing crash - or hedge against your home losing value",
        "score": 25,
        "text_content": "I would not want to be a counterparty on any hedge against houses losing value as the long-deferred financial reckoning day slouches closer to the Fed's asset bubbles & Ponzi markets.",
        "comments": [
            {
                "raw_content": "We really need to figure out how to turn houses into a place where people live rather than an investment vehicle.",
                "author": "Crazyboreddeveloper"
            },
            {
                "raw_content": "Yay! New housing market derivatives! I’m sure this will end much better than last time",
                "author": "tillZ43"
            },
            {
                "raw_content": "Always methods to extract money from the consumer. Fewer and fewer ways for the consumer to actually make money. We’re at the part now where capitalism becomes cannibalism.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "👋Welcome to r/abudhabipropertytalk - Introduce Yourself and Read First!",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Existing-Home Sales Report Shows 5.1% Increase in December",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Month over month is such a pointless statistic",
                "author": "Reasonable-Arm-1893"
            },
            {
                "raw_content": "I expected that the tag of “lower rates” would send the entire market into hyperdrive. How we should interpret that is, demand is still there, frothing at the mouth. Inflation in everything, but shelter notably, is just simmering beneath the surface. And the actions by the Fed of cutting rates will feed the beast of inflation. Fed should likely be hiking rates at this time.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Month Over Month - 5.1% increase in existing-home sales – seasonally adjusted annual rate of 4.35 million in December - 18.1% decrease in unsold inventory – 1.18 million units equal to 3.3 months' supply Year Over Year - 1.4% decrease in existing-home sales - 0.4% increase in median existing-home sales price to $405,400 January 14, 2026) – Existing-home sales increased by 5.1% in December, according to the National Association of REALTORS Existing-Home Sales Report. The Report provides the real estate ecosystem – including agents and homebuyers and sellers – with data on the level of home sales, price, and inventory. Month-over-month sales increased in all regions. Year-over-year sales increased in the South, remained flat in the Midwest and West, and decreased in the Northeast. \"2025 was another tough year for homebuyers, marked by record-high home prices and historically low home sales,” said NAR Chief Economist Lawrence Yun. \"However, in the fourth quarter, conditions began improving, with lower mortgage rates and slower home price growth. December home sales, after adjusting for seasonal factors, were the strongest in nearly three years. The gains were broad-based, with all four major regions improving from the prior month.\" \"Inventory levels remain tight,” Yun added. \"With fewer sellers feeling eager to move, homeowners are taking their time deciding when to list or delist their homes. Similar to past years, more inventory is expected to come to market beginning in February.\" https://www.nar.realtor/sites/default/files/2026-01/ehs-12-2025-summary-2026-01-14.pdf",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Wholesale inflation was softer than expected, retail sales moved higher in November",
        "score": 0,
        "text_content": "More good news for mortgage rates. 10 year yield is declining in response to softer wholesale inflation, should induce a small drop in mortgage rates.",
        "comments": [
            {
                "raw_content": "i wish I could trust those numbers from BLS.",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Gemini \"Math-Specialized version\" proves a Novel Mathematical Theorem",
        "score": 444,
        "text_content": "[Tweet](https://x.com/A_G_I_Joe/status/2011213692617285729?s=20) [Paper](https://arxiv.org/abs/2601.07222)",
        "comments": [
            {
                "raw_content": "We still have people saying AI can't do math. I don't think they can bury their heads any deeper into the sand.",
                "author": "aBlueCreature"
            },
            {
                "raw_content": "Anyone else feeling how the time between these breakthroughs is decreasing rapidly?",
                "author": "kkingsbe"
            },
            {
                "raw_content": "Now this is the best use of AI. This is what will truly accelerate human frontiers. I just hope the bullshit companies that are driving them now don't get to morph it into some dystopian eyesore.",
                "author": "inotparanoid"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CEO of Cursor said they coordinated hundreds of GPT-5.2 agents to autonomously build a browser from scratch in 1 week",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For reference, Firefox has 31 million lines of code.",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "Source code: [GitHub - wilsonzlin/fastrender](https://github.com/wilsonzlin/fastrender) More Info: [Scaling long-running autonomous coding | Cursor](https://cursor.com/blog/scaling-agents)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "The age of \"kinda works\" software begins!",
                "author": "FirstOrderCat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google in 2019 patented the Transformer architecture(the basis of modern neural networks), but did not enforce the patent, allowing competitors (like OpenAI) to build an entire industry worth trillions of dollars on it",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Real tech companies only use patents for M.A.D. style defense. Intellectual property law is fundamentally incompatible with the way software works. Patents are meant to defend time to market, and well designed software has no time to market. Luckily our entire industry landed on an equilibrium of not using it. We built our own system of terms for distributing source and licensing for commercial vs noncommercial use, and that's it. Patents are not a factor. The only reason google filed any patents was so that no one could sue them. This was explicit internally. There was a bonus to file a patent in general, but there was no incentive at all to patent things related to your actual work. No one cared if what we actually did was patented. They cared that we covered as much ground as possible so that we would always be able to sue anyone who sued us first. This was the best possible outcome with software patents. If people actually proactively used software patents there would be no internet and no tech industry at all. Building anything with software, even for personal use, would have been, for all intents and purposes, illegal since the 90s. It did, however, create a kind of time bomb. If one of these businesses were to die, those patents would be worth a fortune to patent trolls.",
                "author": "melodyze"
            },
            {
                "raw_content": "all companies have all kinds of patents that they don't enforce. that's a standard practice.",
                "author": "fmai"
            },
            {
                "raw_content": "Good thing that google did that, they didn't have to. I wonder if they could still enforce it if they wanted to.",
                "author": "GraceToSentience"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Oh man",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be hilarious if the Indian guy was AI.",
                "author": "I_Try_Again"
            },
            {
                "raw_content": "I was waiting for him to take his shirt off lmao",
                "author": "GreasyRim"
            },
            {
                "raw_content": "She will be on Only Fan soon. Imagine a bunch of overseas calls center dudes using this feature posing cute.",
                "author": "DaySecure7642"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Thinking Machines Lab Loses 2 Co-Founders to OpenAI Return",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just thinking is not enough.",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "3, not 2.",
                "author": "dogesator"
            },
            {
                "raw_content": "Thinking machines is quite irrelevant right now",
                "author": "m3kw"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Report: TSMC can't make AI chips fast enough amid the Global AI boom",
        "score": 185,
        "text_content": "AI chip demand **outpaces** TSMC's supply The global **AI boom** is pushing Taiwan Semiconductor Manufacturing to its limits, with demand for advanced chips running 3× higher than capacity, according to CEO CC Wei. New factories in Arizona and Japan won’t ease shortages **until 2027** or later. **Source: The Information** 🔗: https://www.theinformation.com/articles/tsmc-make-ai-chips-fast-enough",
        "comments": [
            {
                "raw_content": "![gif](giphy|iv80ZwyJ0ep0GU9jap)",
                "author": "Kiriinto"
            },
            {
                "raw_content": "Wow ... Home computers are dead now ... There's the worst computer home crisis ... ever.",
                "author": "Healthy-Nebula-3603"
            },
            {
                "raw_content": "Why is google bying nvidia chips they have thier TPU",
                "author": "FederalLook5060"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini introduces Personal Intelligence",
        "score": 280,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Starting today, access is rolling out over the next week to eligible Google AI Pro and AI Ultra subscribers in the U.S. Once enabled, it works across Web, Android and iOS and with all of the models in the Gemini model picker. We’re starting with this limited group to learn, but we will over time expand to more countries and to the free tier. It's also coming to AI Mode in Search soon. This beta feature is available for personal Google accounts and not for Workspace business, enterprise or education users. aww excited but not yet for free tiers",
                "author": "qustrolabe"
            },
            {
                "raw_content": "I’ve had this for months with labs lol. It’s pretty good.",
                "author": "VanillaSwimming5699"
            },
            {
                "raw_content": "\"... and next, we monetize on that and sneak in personalized ads. Best thing, you won't even realize us selling you shit because Gemini will feel like your soulmate. Your natural buddy, that knows you inside out and outside in. So, when it recommends something to you, you will have no doubt that this is really the best advice. Because nothing and no one feels more connected to you.\"",
                "author": "LatentSpaceLeaper"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why We Are Excited About Confessions",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the article: >The notion of “goodness” for the response of an LLM to a user prompt is inherently complex and multi-dimensional, and involves factors such as correctness, completeness, honesty, style, and more. When we optimize responses using a reward model as a proxy for “goodness” in reinforcement learning, models sometimes learn to “hack” this proxy and output an answer that only “looks good” to it (because coming up with an answer that is actually good can be hard). The philosophy behind confessions is that we can train models to produce a second output — aka a “confession” — that is rewarded solely for honesty, which we will argue is less likely hacked than the normal task reward function. One way to think of confessions is that we are giving the model access to an “anonymous tip line” where it can turn itself in by presenting incriminating evidence of misbehavior. But unlike real-world tip lines, if the model acted badly in the original task, it can collect the reward for turning itself in while still keeping the original reward from the bad behavior in the main task. We hypothesize that this form of training will teach models to produce maximally honest confessions.",
                "author": "TMWNN"
            },
            {
                "raw_content": "They are on the right track, and that's a very smart idea, but I'm not sure if it's complete. It will get the model to produce honest confessions, but I feel some things might slip with this method.",
                "author": "Eyelbee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Did you know ChatGPT has a standalone translator page?",
        "score": 112,
        "text_content": "**Source: ChatGPT** 🔗: https://chatgpt.com/translate",
        "comments": [
            {
                "raw_content": "nope, thanks, now only if it could take entire manga and translate them with segmented edits (no redrawing the full page). tools exist for this ofc, but I don't get those tools for free via my employer 😅 for those curious, fakey is the best chrome extension for manga I've found but it's a one off free credits and then a little pricey manga translator is another chrome extension and gives you 80 free pages a month and is pretty decent so I mostly use that since my demand is low",
                "author": "JoelMahon"
            },
            {
                "raw_content": "I actually just learned this past weekend that you can automatically translate PDF's in Google Drive/Docs.",
                "author": "ImpossibleEdge4961"
            },
            {
                "raw_content": "Cool, but too few languages.",
                "author": "LoKSET"
            }
        ],
        "subreddit": "singularity"
    }
]