[
    {
        "post_name": "Bernie Sanders just FLIPPED on his immigration stance, says he supports deporting people who are just \"undocumented.\"",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we make him undocumented?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "He's boarding the train. This is actually really good for us. One step closer to banning h1b.",
                "author": "Theosco"
            },
            {
                "raw_content": "Sanders was the populist option on the left before he sold out. He could have given Trump a tougher battle than Clinton, nasty tricks aside. (ex. Bernie Bros) Alas. NO REFUNDS",
                "author": "flashersenpai"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Omar Fateh, who wants to be the next mayor of Minneapolis, says immigrants are not a domestic threat but white people are.",
        "score": 672,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t care that foreign invaders think I am a threat to them.",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Dude looks like an inbred rat. Idc what he says, it's irrelevant Peoplel like him are funded by foreigners to sow chaos in western nations. It's so obvious at this point that's it not organic We aren't fooled. We know it isn't popular. Ot only exists because evil people work power/money fund these dimwit dipshit shit head ass wipes.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Back in 2000, I heard this Somali temp say the triangle head shaped ones were the fucking dumbest of them all.",
                "author": "bringbackthe80s"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How Much has Trump Crossed Off his To-Do List for America? WHOA",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can’t really check off #3 yet.",
                "author": "KrakenWakin4JoeBacon"
            },
            {
                "raw_content": "Seems he missed hanging treasonous politicians.",
                "author": "grenades_and_ham"
            },
            {
                "raw_content": "I want 19 so we get fair elections and kick out the Democrats and RINOs.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don’t even drink coke.",
        "score": 252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol",
                "author": "CBombardmentsEgo"
            },
            {
                "raw_content": "We're going to have dueling moderators like dueling banjos!?!",
                "author": "Websitesdown"
            },
            {
                "raw_content": "and now coke is saying even that isn't true 🚨#BREAKING: The Coca-Cola Company has confirmed and put out a statement that it did not agree to any changes. This comes after President Donald Trump claimed that Coca-Cola would begin using real cane sugar in products sold in the U.S.",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "📂 BREAKING: The House of Representatives is set to vote on a measure that would force the release of the Epstein files...",
        "score": 1184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What in the actual fuck is going on today",
                "author": "WhitePowerRanger"
            },
            {
                "raw_content": "Would like to know the sponsors of this bill. Trying to figure out who's on the side of holding pedophiles accountable and figuring out who runs our government.",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "But we were told its a hoax",
                "author": "MemphisMontoya71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: The Justice Department fired Maurene Comey from the U.S. Attorney’s office for the Southern District of New York today, where she most recently led the prosecution of Sean Combs",
        "score": 1507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How TF didn't this already happen from Day 1??",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Epstein and Maxwell prosecutor. Odd timing. https://www.nytimes.com/2025/07/16/nyregion/maurene-comey-prosecutor-fired-jeffrey-epstein.html",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Firing the pedophile protector after she’s saved a New York pedo. Great job Trump and Bondi. You really did your base a solid.",
                "author": "HeatherSwanson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Damage Control in progress. James Comeys Daughter fired from Manhattan US Attorneys Office. She kept Epstein files underseal and was prosecutor in Ghisilene Maxwell's and PDiddy's case.",
        "score": 1383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is not \"damage control.\" It's how you get Epstein clients prosecuted - you remove the obstacle installed to block their prosecution. That is the Comey family business. Or was.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Gah damn Comey your daughter is ugly as fuck. Woof!",
                "author": "EdBuck"
            },
            {
                "raw_content": "So in other words, things are happening in the background that we're not privy to? \"FFS! Why won't they let the pedo elites know they're coming after them!?!?!?!! Rreeeeeeee!!!!\". Trump was right, the panty pissing cry babies are weak losers. Just give it time and let the DOJ work.",
                "author": "mailinvoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Goes Off on Governor “Newscum,” Cancels Funding for California’s Failed $130 Billion “High Speed Train to Nowhere”",
        "score": 889,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump should just make federal funding paid upon completion... Since it will never be completed they will never see the funding! :D",
                "author": "thebeercules"
            },
            {
                "raw_content": "Newsom - California Nero",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "High speed rail in CA would be great. Unfortunately they've spent a decade and billions of dollars doing nothing.",
                "author": "SouthernFriedFreedom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Jill Biden’s top aide pleads the 5th to everything. Not suspicious at all.",
        "score": 1319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These people need to be properly incentivized, and that obviously hasn't happened. Yet.",
                "author": "Deplora"
            },
            {
                "raw_content": "seeing an autoPattErN",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "It their right. It’s also our right to try them for treason and sedition.",
                "author": "SCP0073"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Makes you wonder how many illegal immigrants have exploited birthright citizenship in recent years.",
        "score": 714,
        "text_content": "",
        "comments": [
            {
                "raw_content": "random british airport lady doing more for the united states than all of our congressmen",
                "author": "kestral"
            },
            {
                "raw_content": "So many! I work with multiple ones that have their entire family here because \"They were born here!\" Another question, how many illegals got citizenship because under the incorrect interpretation of The 14th Amendment they had children who were considered \"citizens\" and had an easier pathway?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Sara doing the lord's work 🙏",
                "author": "Litterboxer1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Watch: Adam Schiff Meltdown Video After Criminal Referral, Ducks Questions From Reporters",
        "score": 732,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope you enjoy what you have been dishing out, pencil neck. But in his case, there are actual grounds for prosecution.",
                "author": "Mamapedia"
            },
            {
                "raw_content": "He played the victim card, like EVERY democrat caught committing a crime does!",
                "author": "thebeercules"
            },
            {
                "raw_content": "What happened at the Standard Hotel, Adam? 👦🏿⚰️",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You can't deny that this is better than when President autopen was in the Oval office",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember when they stole the election, tried to shoot President Trump, let in 10's of million illegal invaders & had trannies in the White House? Not to mention a million other anti American policies. The Epstein files could've been handled differently no doubt but Maureen Comey was fired today. I'm rambling a bit but all I wanted to say is that this is way better than the 100% Uniparty alternative.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Trump only had to deport ONE ILLEGAL for it to be \"better than when President Autopen was in the Oval Office.\" That's a low bar.",
                "author": "Lunar"
            },
            {
                "raw_content": "Despite Trump’s utter failure regarding Epstein. All I have to do is remind myself of the dark age of Biden and suddenly I’m not so sad anymore.",
                "author": "aaafirefly123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEPORT!!! California Couple Asshoe!! Ran a baby factory by hiring multiple surrogates to carry & deliver the babies, (probably) for trafficking. 21 kids rescued.",
        "score": 682,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sum Ting Wong in California",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Chinese with NO morals. Shocking!",
                "author": "NecturusMaculosus"
            },
            {
                "raw_content": "That looks like a fine american couple there... I'm sure they definitely aren't recent immigrants",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have been speaking to Coca-Cola about using REAL Cane Sugar in Coke in the United States, and they have agreed to do so. I’d like to thank all of those in authority at Coca-Cola. This will be a very good move by them — You’ll see. It’s just better!",
        "score": 1763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mexican coke uses cane sugar, and it's one of the few things Mexico does better than the US, in addition to tacos, tequila, and gang violence",
                "author": "OTher55"
            },
            {
                "raw_content": "I stopped drinking coke when they started telling people how to be less White.",
                "author": "Lowersidecustoms"
            },
            {
                "raw_content": "Should replace the high fructose corn syrup in all foods.",
                "author": "akasteve"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh, New York Times, you never cease to amuse us",
        "score": 947,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lots of positive coverage from them lately . Who’s working there who’s on the list that doesn’t exist and never existed? 🤔",
                "author": "Groundpounder"
            },
            {
                "raw_content": "This is what they do. They lay little breadcrumbs to prime their voters and hold onto their false sense of credibility. Next time a dem is in power and does something stupid like ban electricity they can point to trumps tariffs as the reason the economy goes to shit",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "These are the same people that were disappointed the unvaccinated weren’t dying in droves.",
                "author": "Right0hio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The FBI has released a photo of the suspect who fired a gun at federal agents during the weed farm raid in California. There is a $50K reward for information leading to arrest & conviction. If you have info about him, call 1-800-CALL-FBI",
        "score": 1245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gay Chevara Mk 500",
                "author": "shadypollster"
            },
            {
                "raw_content": "Ask Zack from \"saved by the bell\"",
                "author": "95Rockytoby95"
            },
            {
                "raw_content": "Most likely Mexican Cartel member watching over the crop",
                "author": "GunToast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "While Angel Parents Cry Behind Him, President Donald Trump Signs The HALT Fentanyl Act into Law",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So when do we start bombing the cartels?",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "Great let’s keep trying the same old failed war on drugs tactic and hope it’s different this time….news flash it won’t be. Bomb the cartels!",
                "author": "cardinaldrones"
            },
            {
                "raw_content": "Does this mean fentanyl was allowed before? Fuck this meaningless shit",
                "author": "ThatsDoable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Very Alarming Find In NYC: Driver in minor accident abandons van full of propane gas tanks & gasoline.",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Illegal drier with no license or insurance, transporting un-taxed (it's NYC) fuel to unlicensed businesses, staffed by Illegal foreigners.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Are they here illegally or?",
                "author": "Long_time_lurker"
            },
            {
                "raw_content": "Think of all the barbecuing I could do with that propane.",
                "author": "TooBright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Americans know we need a better Healthcare System",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get rid of Obamacare. Problem solved.",
                "author": "FudgyFudgeBots"
            },
            {
                "raw_content": "We need to burn the whole healthcare system to the ground and start over. We also need the truckload of epstein files bondi admitted to having being published.",
                "author": "CLF3"
            },
            {
                "raw_content": "I’m too stupid to read this",
                "author": "madeaprofilejustforu"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Comedian Shane Gillis calls January 6th ‘staged’ and makes a Jeffery Epstein murder joke that has crowd ROARING at the ESPYS",
        "score": 645,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All of America's attention is on Epstein. This is the moment. This is the time to release and expose the truth about our Elite scumbag 'overlords'. We CAN handle the truth.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Gillis didn't use \"staged\" in the same sense Benny implied.",
                "author": "Lunar"
            },
            {
                "raw_content": "Did Benny actually watch the clip?",
                "author": "MacaroniMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "9to5Google: \"Here are the two reasons why silicon-carbon batteries aren't being used in more phones\"",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm, I wasn't aware of the lifespan issue with silicon-carbon batteries, that's a bummer. Of course, if we went back to user-replaceable cellphone batteries (which should probably happen anyways!) this would be far *less* of an issue...",
                "author": "rocketwidget"
            },
            {
                "raw_content": "The first is a bureaucracy problem: that rule should be eliminated or changed to a metric that actually makes sense instead of just watt hours, which is nonsense. Same goes for battery limitations on flights. This is why I hate ill-informed and poorly thought out regulations on technology. Things change ALL THE TIME The second is a technology problem that will probably get solved eventually.",
                "author": "letsgoiowa"
            },
            {
                "raw_content": "Despite the supposed issue with their lifespan, I wonder if they are still a better deal. Thanks to their larger battery, they undergo fewer charge cycles. Even if they degrade more quickly, you may still end up with a larger battery than you would have if you used a phone with a \"standard\" battery.",
                "author": "Thermosflasche"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Q2 profit surges 60%, reaches historic high",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Revenue is literally in line with expectations after accounting for the central bank intervening to cap the NTD (28.7 B vs 28.4-29.2 B). And currency adjusted revenue guidance is barely 1.2% for the next quarter. Stagnant revenue growth expectations going into the second half of the year which has always been the stronger half of the year for them is not a good look.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": ">“Surging demand from the AI boom is highly sustainable in the near term, with AI still in its very beginning stages and continues to expand across industries,” Wang added. Yep. Agreed. Been saying this for a long time. A lot of people, especially gamers here, wish/think AI is a fad. It's clearly not and clearly just the very beginning of something that will go on for decades. My 1 year old post spells out my thoughts on AI chip industry: https://www.reddit.com/r/hardware/comments/1da3mqg/amd_is_right_about_ai_pcs_being_the_biggest/l7hzy4l/ Snippets: >In some ways, we're really like the 1960s in terms of computers. Back then, you needed computers the size of a small room to run basic software that we can run on a calculator today. Today, running something like GPT4 probably takes a small room full of GPUs in a datacenter somewhere. Over time, small computers could run demanding software and the personal computer was born. It'll likely happen in AI as well. Initially, small computers are hopeless. But the software (AI models in this case) mature and stop growing exponentially while the hardware gets exponentially better. >It's been a long time since we have mass-market software that modern chips are too slow to run. CPUs, RAM bandwidth/size, and even GPUs have long been in a \"good enough\" state. GenAI is the first mass market application I've seen that renders a modern computer hopeless. So for me, I'm getting excited about chips again and I think we will see some major leaps in AI accelerators in each generation. The race just got started.",
                "author": "auradragon1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Optiscaler can now enable FSR4 in any game that doesn't use Vulkan or anti-cheat",
        "score": 143,
        "text_content": ">Test builds have improved FSR4 support and pretty much fixed all the non-working games (excluding Vulkan and anti-cheat enabled games ofc). >ATM the only FSR4 games not working are either Anti-Cheat enabled or use Vulkan https://github.com/optiscaler/OptiScaler/wiki/FSR4-Compatibility-List Note: This only applies to games that have a native upscaler.",
        "comments": [
            {
                "raw_content": "FSR4 was a huge win for AMD. Having no follow through for the poor adoption is just business as usual. It really shouldn't be hard to mark games with anti cheat as incompatible with an FSR4 override in the drivers, Nvidia does it with their filters. I don't have an exact number but it seems to be around 300 or so games with FSR <3.1, they could have an intern make a list in a week. There must be an internal competition for who can fumble the bag hardest at RTG. The fake MSRP person is clearly winning, but they still have some real competition.",
                "author": "Gatortribe"
            },
            {
                "raw_content": "In some games, Optiscaler can even take FSR 2.X/FSR 3.0 input to enable FSR 4. It's an embarrassment that AMD has not done this.",
                "author": "mockingbird-"
            },
            {
                "raw_content": "No FSR 4 for the new Doom game sucks. AMD needs to whitelist that game",
                "author": "ExplodingFistz"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gaming Routers Won't Improve Your Ping - Here's The Data!",
        "score": 88,
        "text_content": "After conducting an in-depth investigation on 11 different routers, data suggests that the router you purchased has little to no impact on your in-game latency.",
        "comments": [
            {
                "raw_content": "Hey! I wrote the article and would love to discuss our findings! I kept seeing people asking for the best gaming routers, and people just got told it wasn't a thing... so I decide to put it to the test and understand the why behind it. Would love to know if the tests match your experience.",
                "author": "sp_RTINGS"
            },
            {
                "raw_content": "That's because you weren't using a gaming optimized OS like GamerOS. /s I'm more annoyed by looks than the gamer name. I don't want RGB on my goddamn router.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "It's great they tested this for home routers. Now if you are willing to spend for a Ubiquiti dream machine router, with newer switch and AP (some are all integrated now), it has a fairly robust SQM solution built in. You can configure it to do traffic shapping and priority per vlan using profiles, and it applies that to the switch as well, with 7 levels of priority using DSCP markings. On the AP you can enable WMM (UAPSD), and that will give some traffic default DSCP markings as it leaves the AP. The router will respect those markings as it does SQM, and you can remark traffic on the router as it leaves to the WAN as well. It does take some setup and know how, but the result it really good and I never see my pings out to the ISP go high even during large downloads. On the UDM model, it now has some QoS priority built in for specific applications and categories, making the setup a little easier if you just want to check a box for that application and set bandwidth limits. All this is fairly recent on the newer firmwares.",
                "author": "gayfucboi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Assessing Video Quality in Real-time Computer Graphics",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel is proposing a new metric (CGVQM) to objectively measure the \"artifact-ness\" of videogame graphics. While the blog post is primarily pitching it to developers for optimization purposes, it would also be a potential solution to the never-ending arguments on how to fairly review hardware in the age of proprietary upscaling and neural rendering. As an additional point of discussion, similar metrics used to evaluate video encoding (e.g. VMAF) have at times gotten under fire for being easily game-able, causing developers to optimize for benchmark scores over subjective visual quality. If tools such as CGVQM catch on, I wonder if similar aberrations might happen with image quality in games.",
                "author": "PorchettaM"
            },
            {
                "raw_content": "Intel has been playing the long game with a lot of important fundamental research, I'm just worried the management will not let this fruition. I wish the videos in the post were higher quality",
                "author": "Sopel97"
            },
            {
                "raw_content": "I also think there needs to be a similar metric for motion quality: input latency, frame pacing, and \"sufficiency\" of framerate (going from 60fps to 90fps is a big deal, going from 240fps to 480fps is a bigger % but less value)",
                "author": "CarVac"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen AI 5 330",
        "score": 35,
        "text_content": "AMD just released it's new APU, Ryzen AI 5 330! It comes with 1x Zen 5 and 3x Zen 5c CPU cores.",
        "comments": [
            {
                "raw_content": "Why isn’t this the Ryzen AI “3” 330? Is Ryzen 3 dead?",
                "author": "burninator34"
            },
            {
                "raw_content": "Does this use the same chip as the AI 7 350 just binned down to only use 4 cores, or is it a different chip entirely? It's pretty funny that the NPU that no one is going to use on this thing is probably taking up as much die area as the four CPU cores combined.",
                "author": "DNosnibor"
            },
            {
                "raw_content": "I got so hard for a minute but sadly this has a *severely* gutted iGPU, nowhere near the 880M so cancel the 10 hour handheld battery hopes :/",
                "author": "RedTuesdayMusic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Will Huawei chips replace Nvidia in AI training? Jensen said it’s matter of time",
        "score": 45,
        "text_content": "# Jensen Huang said: *“The point is that we have been doing this for 30 years and they have been doing it for a few years. Huawei can already tell everyone how powerful they are… I have been doing this at an extremely high level and at a scale that is difficult to execute.”* Nvidia CEO [adds](https://m.weibo.cn/detail/5189107139744249) that Huawei is already on the comparison chart beside us. It means the company has the power to do something to rival us. Although when it comes to completely overtake the US chipmaker, Huawei might take time. A major reason why Huawei still has room for improvement is the lack of advanced chip tools. The company relies on old techniques to boost its AI chip efficiency. These tools are working well, but aren’t at their best rate. Hence, Huawei is dealing with the hurdles in the AI chip race. Perhaps the company may soon get a good speed as it is constantly exploring new ways.",
        "comments": [
            {
                "raw_content": ">Jensen said it’s matter of time Where? Where does he say it's just a matter of time until Huawei replaces Nvidia in AI training?",
                "author": "Healthy_BrAd6254"
            },
            {
                "raw_content": "Jensen isn't naive. He knows you constantly need to keep moving in this space: [https://youtu.be/9OWpxVwL8YU?si=FpKXXzO7f6-maKco](https://youtu.be/9OWpxVwL8YU?si=FpKXXzO7f6-maKco)",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "No shit. It is absurd to think that China will be stopped by trade restrictions and the IP-quagmire that entangles ASML in catching up in chip-making to the leading-edge players.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Current Wafer Pricing Rumor for TSMC up to N2 apparently from Morgan Stanley",
        "score": 76,
        "text_content": "Alright, these are much tamer than previous rumors, however it's still sad to see 2nm is double the price of 5nm [https://semianalysis.com/2025/02/05/iedm2024/](https://semianalysis.com/2025/02/05/iedm2024/) [https://semiwiki.com/events/351309-tsmc-unveils-the-worlds-most-advanced-logic-technology-at-iedm/](https://semiwiki.com/events/351309-tsmc-unveils-the-worlds-most-advanced-logic-technology-at-iedm/) N2 apparently offers 15% clocks/30% power reduction and 15% density scaling vs N3E, which if above pricing is true, means about 5% plus minus 3% cost per transitor improvement. I don't go into other improvements like capacitance and am not sure how they translate to performance or costs. Rumored products in the near term to use N2 or derivatives are all compute tiles from Zen 6, NovaLake Compute tile (8P+16E with BLLC only)",
        "comments": [
            {
                "raw_content": "A Taiwanese newspaper reported 30K per wafer (\"2nm\") and 45K for \"1.4nm\" last month.",
                "author": "TheNiebuhr"
            },
            {
                "raw_content": "Their 5nm node cost $18b for ~90k wpm. Whereas the upcoming 2nm node costs $28b for 50k wpm. Probably some missed nuance here, but the bottom line is that further advancement will be *very* expensive. That does not even factor in labor, which is in short supply. Or a growing customer demand for these cutting edge nodes. That is partially caused by 3nm manufacturing being sold out, despite multiple price hikes.",
                "author": "W0LFSTEN"
            },
            {
                "raw_content": "> NovaLake Compute tile (8P+16E with BLLC only) The standard 8+16 NVL compute tiles are rumored to be on N2 as well. It appears like only the 4+8 compute till will be on 18A.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What do we know about the AMD MI308X?",
        "score": 1,
        "text_content": "The MI308X seems to be a nerfed MI300X which has been permitted for export to Chinese customers, but I'm not able to find much about its specifications online. The best reference I've found is this year-old Reddit thread, but it seems to be more speculation than facts: https://old.reddit.com/r/AMD_Stock/comments/1d7nee5/mi308x_with_80_compute_units_per_gpu/ I am intrigued by the prospect that MI308X might have a PCIe interface, rather than OAM or SH5 (per the above thread). Do we know anything about this product?",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Great reviews all around for Donkey Kong Bananza",
        "score": 2823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The moment I heard the mario odyssey team made this game I knew it would be a banger.",
                "author": "Broken-TTK"
            },
            {
                "raw_content": "Love that DK is back! Cant wait until tomorrow to dive into this!",
                "author": "GodzillaMinus83"
            },
            {
                "raw_content": "im still trying to finish BOTW before I get it......but man these reviews might have me put it at a pause..... need.....monke game",
                "author": "funkyyyyyyyyyyyyy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sources claim new Switch 2 Animal Crossing game reveal coming this month",
        "score": 387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bring back the villagers that insult you",
                "author": "Copperhead881"
            },
            {
                "raw_content": "Animal crossing warriors? (Musou style)",
                "author": "Toomanydamnpotatoes"
            },
            {
                "raw_content": "The rumor from the guy who said not to take any of his predictions for this month seriously because it was all a joke? Yeah ok.",
                "author": "CarbVan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How I'm feeling right now",
        "score": 151,
        "text_content": "Off the bat this game feels very solid. Digging the music too.",
        "comments": [
            {
                "raw_content": "I’ve been sitting here beating the shit out of rocks for an hour. This game rules",
                "author": "Calhalen"
            },
            {
                "raw_content": "constipated?",
                "author": "justaheatattack"
            },
            {
                "raw_content": "Can't wait to get back from work and start playing. I wish everyone to have a great time with this",
                "author": "Stebcio"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza Artist mode",
        "score": 748,
        "text_content": "I guess this mode has potential 😅 this is for as far as my artistic skills goes :)",
        "comments": [
            {
                "raw_content": "![gif](giphy|WZdlab0U3AkSc)",
                "author": "treehumper83"
            },
            {
                "raw_content": "The first thing I'm making is a really BIG banana...",
                "author": "Zoombini22"
            },
            {
                "raw_content": "And so it begins",
                "author": "post-death_wave_core"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IGN Rates DK Bananza 10/10",
        "score": 2490,
        "text_content": "HYPE IS REAL",
        "comments": [
            {
                "raw_content": "Things they mention that I think is a really good look: \\- The puzzles, platforming and boss fights get complexer and more difficult the farther you go with really unique ideas \\- They have easily put in 50 hours without trying to actively 100% the game \\- Exciting post-game content \\- Really good and very many Zelda shrine-like challenge rooms \\- Donkey Kong feels amazing to control",
                "author": "Siebie123"
            },
            {
                "raw_content": "EXTEND DONG",
                "author": "EvilTaffyapple"
            },
            {
                "raw_content": "did the Yiga Clan infiltrate IGN or something /s",
                "author": "KestrelQuillPen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "THIS IS BS!",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am more interested in what magic Nintendo is doing to keep their file size so low. Even open world titles like TOTK are like 18GB. Insanely compressed texture files?",
                "author": "Dull_Ad6281"
            },
            {
                "raw_content": "If I had to wager an educational guess as to why as somebody who used to play this series a loT, perhaps a ton of audio files, and then even more the sheer number of assets. They do a character model of every player and it's like scanned in through some crazy tech.",
                "author": "mhNOVICE"
            },
            {
                "raw_content": "the sports titles have a lot of unique hi res assets. i watch my nephew play MLB the show, or NBA2K25 and i am always, *always* impressed by the visuals. it's striking really as i don't really play sports games. but watchign it on his PS5 on a big tv i do sometimes feel like i could be watching the real thing and not even know.",
                "author": "Rombledore"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thank you Costco ❤️",
        "score": 208,
        "text_content": "Arrived early!",
        "comments": [
            {
                "raw_content": "Dang and you saved money. I didn’t order from Costco because I really wanted to play tomorrow and was worried their shipment would arrive on Friday or later. Paid $7 more to get it from Best Buy and can’t price match because you need to login to view ☠️",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "Whaaat",
                "author": "Right-Breakfast444"
            },
            {
                "raw_content": "Anyone know when it drops on Eshop",
                "author": "Emerald_XO"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bananzaaaa Day!!!!!",
        "score": 69,
        "text_content": "Local store added a poster as well :)",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New Team Fortress Game (?)",
        "score": 151,
        "text_content": "Source:https://www.youtube.com/watch?v=dlDSvZPOPVQ In his most recent video, Tyler McVicker has stated that, with HLX at a point where not everyone has to do things at the same time, certain employees have likely been working on a passion project to see a new generation of Team Fortress games. This, of course, lines up with the announcement that Valve needs new maps and campaigns for Mann Vs. Machine.\\* \\*Until an announcement is made, nothing is certain. However, the last times Tyler was covering what Valve was doing, he (with some accuracy), predicted both Half-Life: Alyx and Deadlock.",
        "comments": [
            {
                "raw_content": "Card game",
                "author": "locke_5"
            },
            {
                "raw_content": "What's the least work a project can be that is feasibly its own project? Maybe a MvM spin off into some standalone game?",
                "author": "ThinkingWithPortal"
            },
            {
                "raw_content": "The big thing to note is that we can go datamine Deadlock and other valve sources and see that some sort of \"TF\" is being worked on, and as Tyler says, we don't know if it's a TF3, a spinoff, or if it will ever even get done. If he's right and it is in pre-production we likely won't even see it for at least 3 or 4 years.",
                "author": "ProfessorCagan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mass layoffs are underway at Virtuos, the studio behind Oblivion Remastered",
        "score": 824,
        "text_content": "According to several sources, these layoffs will initially target China (200 people) but will also affect many other departments, including the French studios responsible for the recent success TES IV Oblivion Remastered. The keynote of the announcement made to the teams a few weeks ago: \"competitiveness.\" [https://bsky.app/profile/gautoz.cool/post/3lu3ntewdrk2t](https://bsky.app/profile/gautoz.cool/post/3lu3ntewdrk2t)",
        "comments": [
            {
                "raw_content": "For people who don't understand Virtuos, they have 25 locations around the world. They aren't just one studio, they are huge.",
                "author": "darkdeath174"
            },
            {
                "raw_content": "Layoffs at studios that rely on contract/support work are gonna be the more-silent downstream effect of all the layoffs/cancellations/studio closures that have been going on at major publishers",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "With so many games getting canceled even work as a support studio is no longer safe",
                "author": "Dodo1610"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The former Subnautica 2 executives were not participating in the game's development to work on a Subnautica movie which was being commissioned by Krafton itself.",
        "score": 121,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3lu4afn3gnk2b",
        "comments": [
            {
                "raw_content": "Ok who are we casting? Jack Black as a Reaper Leviathan",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "That is what claim in a lawsuit, no actual details.",
                "author": "gamer-death"
            },
            {
                "raw_content": "I want the devs to get paid but whoever made that 250 million dollar bonus deal on Krafton's side when Subnautica 1 likely *grossed* around 300-400 million should also have to step away from the company.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sega confirms Nintendo Switch 2 physical release of Sonic Racing: CrossWorlds will arrive early 2026 on a full game card, digital/upgrade pack to release Holiday 2025",
        "score": 317,
        "text_content": "https://xcancel.com/Wario64/status/1945520021079195833 https://xcancel.com/Wario64/status/1945520271231770709 Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/RvyO18nnpF",
        "comments": [
            {
                "raw_content": "Really expected SEGA to go all-in on Game Key Cards. Pleasantly surprised to see them reverse course. Square Enix, on the other hand, is definitely too far gone.",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Sega is listening everyone",
                "author": "PickleAltruistic3427"
            },
            {
                "raw_content": "I think whats going on is that, along with waiting for cost on the cart production to go down (maybe it already started?), companies used Game Key Cards to make launch titles cheaper for them to release because game sales aren't going to be steady for awhile. Remember we're talking about a system that has high demand but still not easily grabbable on the market along with economic instability. SEGA and others might release more games on the actual cart starting next year.",
                "author": "PSIwind"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Legend of Zelda movie will feature Bo Bragason as Zelda and Benjamin Evan Ainsworth as Link",
        "score": 592,
        "text_content": ">This is Miyamoto. I am pleased to announce that for the live-action film of The Legend of Zelda, Zelda will be played by Bo Bragason-san, and Link by Benjamin Evan Ainsworth-san. I am very much looking forward to seeing both of them on the big screen. https://xcancel.com/Nintendo/status/1945433161124688335#m Previous Rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/Z2QpFYTCEh The movie will be released on May 7, 2027 by Sony Pictures",
        "comments": [
            {
                "raw_content": "What tier is Miyamoto?",
                "author": "ListeningWind"
            },
            {
                "raw_content": "Never heard of them, but that’s probably for the best.",
                "author": "RipMcStudly"
            },
            {
                "raw_content": "How many pots will be harmed in the making of this movie",
                "author": "profchaos111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Videotechuk: Rockstar Games Social Club May Have Shut Down",
        "score": 242,
        "text_content": "https://xcancel.com/videotechuk_/status/1945232309185122803 \"Rockstar Games Social Club has come to an end today after 13 years, the main URL http://socialclub.rockstargames.com now redirects to the home page. Currently viewing profiles, walls, photos, video viewing from users are gone, but could be part of new plans to introduce a new platform.\"",
        "comments": [
            {
                "raw_content": "It has not shut down. They removed some features and did redirects on Monday. Stats, crews, etc are all still fully working.",
                "author": "AZZATRU"
            },
            {
                "raw_content": "Maybe they’re going to do something new.",
                "author": "hushpolocaps69"
            },
            {
                "raw_content": "What we want is they get rid of the absolute horrendous Rockstar Games Launcher. That is a fkn piece of CRAP",
                "author": "Joker28CR"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel preparing Nova Lake-AX, big APU design to counter AMD Strix Halo",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will it also introduce Lunar Lake successor?",
                "author": "Creative-Expert8086"
            },
            {
                "raw_content": "I wonder if this could become avaliable on LGA 1954 because that'd be a good alternative for budget builds potentially if the iGPU is potent enough.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Is anyone left?",
                "author": "joefatmamma"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Cyberpunk 2077 2.3 patch finally brings FSR4, FSR3.1 and XeSS 2.0 Frame Generation",
        "score": 737,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent, here is hoping they are good implementations, as in the past modders have been able to do a better job with the upscaling quality of non-DLSS in Cyberpunk.",
                "author": "VelcroSnake"
            },
            {
                "raw_content": "The question is whether the implementation is crippled like it was to this day. Because if it is its rly pointless.",
                "author": "jezevec93"
            },
            {
                "raw_content": "Gotta give CDPR credit for staying on top of latest tech even years after release. You'll never see Ubishit backport FSR 4 into many of their FSR titles.",
                "author": "relxp"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More AMD FidelityFX Super Resolution 4 Improvements Land For Open-Source Driver",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very excited to finally have FSR4 on Linux 🤩",
                "author": "Joker28CR"
            },
            {
                "raw_content": "\"This merge request optimized GFX11 matrix use conversions for benefiting AMD RDNA3 (GFX11) class GPUs. No performance numbers were noted there on any end-user benefits.\" Interesting.",
                "author": "Dante_77A"
            },
            {
                "raw_content": "AMD gotta stop with only using the driver override and get FSR4 to work with Vulkan",
                "author": "UncleRico95"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches quad-core Ryzen AI 5 330 based on Krackan Point 2 APU",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess Ryzen 3 branding is truly dead.",
                "author": "burninator34"
            },
            {
                "raw_content": "For God's sake just call it a Ryzen 3. I don't know what AMD has against its own entry level CPUs these past few years. It's not like they didn't sell well I remember the old Ryzen 3 and Athlon 200 CPUs selling like crazy.",
                "author": "mrblaze1357"
            },
            {
                "raw_content": "I’d wish them stopping this confusing naming convention to mix different generations all under one ryzen ai 3xx.",
                "author": "--dany--"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon AI PRO R9700 RDNA4 workstation GPU has been listed at $1,240",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That would be actually reasonable and somewhat attainable at that price. There’s no way.",
                "author": "DeathByChainsaw"
            },
            {
                "raw_content": "No way, a 32GB card where the VRAM doesn't cost more than Gold",
                "author": "Solaranvr"
            },
            {
                "raw_content": "Does anyone else thing it's weird that it's a \"PRO\" and thus meant for professional use but right on the box they promote it for gaming, \"Unleash the Gaming Power\".",
                "author": "fallingdowndizzyvr"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Home sellers are so fed up with cutting listing prices (becoming bagholders) they’re just yanking their homes off the housing market altogether",
        "score": 664,
        "text_content": "[https://archive.ph/gOvmW](https://archive.ph/gOvmW) * In June 2025, U.S. home delistings jumped 47% year-over-year. * Sellers are increasingly removing listings rather than lowering prices to match market conditions. * Many still expect pandemic-era price levels, despite buyer resistance. * Sellers hope to avoid multiple price drops, which they fear might devalue their property in buyers' eyes.",
        "comments": [
            {
                "raw_content": "They delist and then re-list so that the home doesn’t look like it’s been sitting around for too long.",
                "author": "Robbyc13"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "They can afford to pull them off the market though, not great if you want to sell (terrible if you NEED to sell but those likely aren't getting pulled off the market) but certainly not a disaster",
                "author": "Capital-Giraffe-4122"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Chinese Buyers Grabbing Up American Homes",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will never understand why we allow people who aren’t citizens to buy land in this country. Many countries do not allow foreign nationals to buy land.",
                "author": "Accomplished-Wash381"
            },
            {
                "raw_content": "This is so 2008",
                "author": "CapitanianExtinction"
            },
            {
                "raw_content": "Again? wtf",
                "author": "EstateGate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The ‘lock-in effect’ is making it harder to buy a home—even if mortgage rates fall",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Staying put allows them to keep housing costs — typically the largest household expense — fixed at an unusually low level.” Wow, people acting rationally: those bastards!",
                "author": "mf279801"
            },
            {
                "raw_content": "People will eventually have to sell. There will never be a mass inventory dump like 2008 but life happens and people will sell. Everyone likes to think they will never move but that's not the case. Layoffs, downsizing, up-sizing, neighborhood change, job change etc. Shit happens.",
                "author": "ColdCouchWall"
            },
            {
                "raw_content": "Sure is, a lot of people have sub 5% rates.",
                "author": "Sufficient-Flower775"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Weekly mortgage demand plummets 10%, as rates and economic concerns rise",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This story gets repeated every week and then two days later we get the \"Recession cancelled\" news stories.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "The industry is trying to say anything and everything to get more transactions.",
                "author": "mlk154"
            },
            {
                "raw_content": "Recession brewing 👀",
                "author": "SGAisFlopden"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Home Prices Are Losing Steam With Most Big Markets Below Peak",
        "score": 79,
        "text_content": "https://www.bloomberg.com/news/articles/2025-07-15/us-home-prices-are-losing-steam-with-most-big-markets-below-peak US Home Prices Are Losing Steam With Most Big Markets Below Peak - Bloomberg The US housing market is close to stalling out, with prices in more than half the country’s top 100 housing markets now below their peak, according to the latest data from Intercontinental Exchange. The annual nationwide price increase slowed to 1.3% in June, the slowest pace in two years and down from 1.6% the previous month, ICE’s indexes show. Out of the biggest 100 markets, 51 are now below-peak and almost one-third have fallen at least a percentage point from recent highs. Home Price Inflection Point Annual home price growth slowed to 1.3% in June, from 1.6% in May The weakness was most pronounced in the condo market, where prices fell 1.4% year-on-year compared with a 1.6% rise for single-family homes. Overall, national prices rose just 0.03% from the previous month after seasonal adjustment, “suggesting a propensity for further slowing,” ICE said. It described the market as “at a critical inflection point.” Persistently high mortgage rates, which make monthly payments unaffordable for many Americans, continue to drag on housing demand. Even after a recent drop, the typical rate for a 30-year loan remains not far short of 7%. That’s been countered by a boost in homes available for sale in some areas — particularly the South and West — but in many markets supply remains tight. Homeowners in parts of the US have already seen an erosion of wealth. Median prices have fallen more than $100,000 from their peak in the Austin-Round Rock-San Marcos metro area in Texas, as well as in San Francisco, according to ICE. Florida is home to nine of the 10 major markets that posted the biggest monthly drops in June. In two of them, North Port-Bradenton-Sarasota and Cape Coral-Fort Myers, prices peaked in June 2022 and are down by more than $50,000 since then.",
        "comments": [
            {
                "raw_content": "Non-paywall link https://archive.vn/33nMr",
                "author": "scotchtapeman357"
            },
            {
                "raw_content": "“Median prices have fallen more than $100,000 from their peak in the Austin-Round Rock-San Marcos metro area in Texas, as well as in San Francisco, according to ICE.” Common denominator of those places being that they’re both heavily reliant on tech industry, which has been busy with layoffs. On the other hand, Florida having 9 out of the 10 major markets posting drops is just a function of it being a big sweaty asshole.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "New England hasn't come down at all",
                "author": "RelativeCareless2192"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How my Reddit channel became a source of income",
        "score": 1,
        "text_content": "Hi everyone! One day I was just scrolling through my feed and randomly came across a post by u/martyb447 describing a way to make money using a web wallet. At first, I started arguing with the OP- I had never made money online before and it sounded sketchy But the guy turned out to be super down-to-earth and explained everything in detail After that, I decided to give it a shot. I only tried $20 at first and couldn’t believe it actually worked! That same evening, I got $100 sent to my personal wallet in just a few hours. Now I’ve been using this method for 5 days already and made around $1500 total- it’s bringing me over $150 per day consistently. So yeah, I don’t regret trying it at all, and I figured it might help someone else too. Thanks for reading- and sorry if I wasted your time! Wishing you all big numbers!",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Even with gigawatts of compute, the machine can't beat the man in a programming contest.",
        "score": 1045,
        "text_content": "This is from AtCoder Heuristic Programming Contest [https://atcoder.jp/contests/awtf2025heuristic](https://atcoder.jp/contests/awtf2025heuristic) which is a type of sports programming where you write an algorithm for an optimization problem and your goal is to yield the best score on judges' tests. OpenAI submitted their model, OpenAI-AHC, to compete in the AtCoder World Tour Finals 2025 Heuristic Division, which began today, July 16, 2025. The model initially led the competition but was ultimately beaten by Psyho, a former OpenAI member, who secured the first-place finish.",
        "comments": [
            {
                "raw_content": "Modern day John Henry",
                "author": "ohdog"
            },
            {
                "raw_content": "Reminds me of the one game Lee Sedol won against AlphaGo.",
                "author": "AdAnnual5736"
            },
            {
                "raw_content": "One dude beat it That will be zero very very *very* soon",
                "author": "kunfushion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"We're starting to see early glimpses of self-improvement with the models. Our mission is to deliver personal superintelligence to everyone in the world.\"",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is he so damn close to the camera",
                "author": "MrBadBoyWorldwide"
            },
            {
                "raw_content": "The quality of discussion on this sub has degraded massively. This mf is talking about building superintelligence and he is investing hundreds of billions of dollars in it, meanwhile comments are all \"he looks weird\".",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Most untrustworthy person vows to save the world, got it.",
                "author": "Feisty-Hope4640"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seems like OpenAI is planning to release Agent Mode, codenamed “Odyssey”. (check all 5 pics)",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no the 5 pictures are not a GPT-5 reference",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "![gif](giphy|m1VdF3NB1yFDvbgO7g) I’ll take it I guess",
                "author": "Beeehives"
            },
            {
                "raw_content": "Odyssey might just be their new browsers name",
                "author": "xXWarMachineRoXx"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI livestream tomorrow",
        "score": 311,
        "text_content": "https://x.com/openai/status/1945607177034760574?s=46",
        "comments": [
            {
                "raw_content": "my guess is the openai browser.",
                "author": "Sky-kunn"
            },
            {
                "raw_content": "Someone eagle-eyes on a different thread pointed out that the cursor in the announcement video went to exactly *5* points. Personally I’d be pretty shocked if this were a Gpt5 announcement but then again that mouse movement did look deliberate… Hmm",
                "author": "oneoneeleven"
            },
            {
                "raw_content": "The 5 reference is obviously intentional, so if it’s not a red herring then maybe the live stream will be one of those famous “in the coming weeks” announcements that will go a little more in depth about GPT5 and give OpenAI a chance to show off evaluations that beat Grok?",
                "author": "HotDogDay82"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman twitter post",
        "score": 532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate the idea of \"playing status games\" as an attractive sustained component of the future.",
                "author": "waxpundit"
            },
            {
                "raw_content": "We’ve already seen multiple CEOs state that they plan to lay off many employees due to AI, and that’s with current models. What Sam is doing comes across as complete gaslighting, as far as I’m concerned. There’s simply no way we’ll have anywhere near as many jobs in 5 to 10 years as we do now, while the population will largely remain the same. That makes it unrealistic to believe there will be enough jobs for most people.",
                "author": "DoubleGG123"
            },
            {
                "raw_content": "I really value what CEOs from these behemoth corporations have to say about my employment I'm sure they have my best interest at heart.",
                "author": "DenseComparison5653"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "its so over man...its not even coming this summer.",
        "score": 61,
        "text_content": "sauce: [https://x.com/sulmanrc/status/1945701377004703979](https://x.com/sulmanrc/status/1945701377004703979)",
        "comments": [
            {
                "raw_content": "Sigh",
                "author": "FeathersOfTheArrow"
            },
            {
                "raw_content": "Damn",
                "author": "Warm-Letter8091"
            },
            {
                "raw_content": "It’s so joever man everything is quiet and nothing ever fucking happens I can’t do this anymore",
                "author": "terrylee123"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "grok is recommending hentai now lmao",
        "score": 1888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "holy shit no way https://preview.redd.it/68mmszukt7df1.png?width=603&format=png&auto=webp&s=cbb13283789a23dcc7de4503f43bd021150eb9c4",
                "author": "NoMoreMaigo"
            },
            {
                "raw_content": "ChatGPT gives me recommendations as well you just have to be very coy when asking",
                "author": "Who_watches"
            },
            {
                "raw_content": "My new take on Elon is \"he's done a lot of stupid shit but if there's one person who's credibly capable of taking on Visa/Mastercard and online enough to try it's him\". So that's currently what I'm hoping for after the Steam NSFW bans.",
                "author": "FeepingCreature"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists just edited mitochondrial DNA, reversing genetic diseases that have no cure, long thought impossible",
        "score": 62,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    }
]