[
    {
        "post_name": "U.S. Department of Labor : Under @POTUS ’s leadership, we’re ensuring AMERICANS are prioritized in the labor market.",
        "score": 832,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you want to find the most egregious abuse of H-1B visas, start in the IT sector. Our field is absolutely being demolished by under-qualified, cheap pajeets. An American company will post an IT job, let's say for a System Administrator, but it will be a job posting that would take 3-4 people to do properly and only be listed for 50K a year. Let's be honest, even if you could do all four jobs at once, it would be worth 200K a year, so no sane American will take it. Then, when they offer it to the Pajeet under the Visa program, it's suddenly only one of those skills they really need.",
                "author": "Reassess_Reevaluate"
            },
            {
                "raw_content": "Fuck. Yes. Infosys, Cognizant, Cap Gemini, Tata. This will be a fun year. All tech companies are going to freak out.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "I filed a DOJ report on a tech company for discrimination against American applicant. I worked for a FAANG company, and in a team of 20 people, there was 14 foreigners on various visas including 3 married couples. This is very wrong!",
                "author": "Tomis_4"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "275... So Far!",
        "score": 729,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's the FBI alone. Now tell us about the top 50 other agencies and their participation.",
                "author": "YakBak"
            },
            {
                "raw_content": "It sucks being right all the time... Ugh.",
                "author": "EvJohn"
            },
            {
                "raw_content": "Now how many of those agents were those recorded wearing black sneaking outfits and breaking into the building?",
                "author": "saltyviewer123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All of Reddit is Antifa",
        "score": 564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nuxanor is attaining his final form lol. That shit is brilliant kek",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "honk! honk!",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The time for talk is over.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI discloses to U.S. Congress it embedded 275 \"plainclothes agents\" in Jan. 6 crowds, more than four and a half years ago — Blaze",
        "score": 1219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The \"J6 Riot\" was spontaneous... and only lasted a short while... therefore how can 275 agents be embedded? How can 26 informants be present if it werent already planned?",
                "author": "LogicalReasoning"
            },
            {
                "raw_content": "Sooooo.. \"Ray Epps\" ???",
                "author": "PTrain"
            },
            {
                "raw_content": "275 agents? How many confidential informants and other assets beyond the number of agents?",
                "author": "1_Badcop"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI Director James Comey has been INDICTED for obstruction of justice and making false statements",
        "score": 2074,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**J6 Him. Then Flynn Him**",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Excellent. I thought it would be two weeks. Here's hoping the charges stick and Biden's auto pen didn't pardon him and classify the pardon.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "There's going to be more left wing terrorism. This guy wrote 8647 about Trump. He's one of their gay resistance idols.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: James Comey’s son-in-law, who prosecuted J6ers, has RESIGNED his position as Assistant U.S. Attorney after the former FBI Director’s indictment The trash is taking itself out! 🔥",
        "score": 1548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apparently he's run out of copies of the Constitution to wipe his ass with, because his only oath to the Constitution was to wipe his ass with it at least three times per day.",
                "author": "BoricuaPede"
            },
            {
                "raw_content": "Why in the fuck was he still employed in this government?",
                "author": "Trump2024"
            },
            {
                "raw_content": "shouldn't he already have been fired for prosecuting J6ers?",
                "author": "spinometer2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUSTICE IN AMERICA! One of the worst human beings this Country has ever been exposed to is James Comey, the former Corrupt Head of the FBI. Today he was indicted by a Grand Jury on two felony counts for various illegal and unlawful acts.",
        "score": 1730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOCK HIM UP!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "I was here. Sept. 25, 2025",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Reminder that Comey’s daughter, Maureen, is a lead prosecutor for the Manhattan DAs office.",
                "author": "Nellie_the_Beaut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well played, Brick Suit -",
        "score": 1611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lmao",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "FAFO should be next to it",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "*that’s a-lot of empty shell casings*",
                "author": "davidac1982"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Comey found this on his morning walk. What does it mean?",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd like to thank the mods and God for the sticky. Instant sticky too!",
                "author": "Gulleyfoyleismyname"
            },
            {
                "raw_content": "Before the doomers get here… Don’t forget these low energy shills GUARANTEED the 2024 election would be stolen. They also guaranteed the J6ers wouldn’t be pardoned. Then they guaranteed Comey wouldn’t ever be indicted. Now they will tell you Comey is going to get off of every charge. They always move the goalposts.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Don't get Comey excited",
                "author": "N7fury"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is how James Comey reacted to President Trump being indicted.",
        "score": 1560,
        "text_content": "",
        "comments": [
            {
                "raw_content": "prepare thyself, for a slap on the wrist",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Right on cue, the left's message is this case is lawfare and a sham, and weaponizing the DOJ. When they went after Trump and everyone in his circle for the most obvious bullshit, naturally that was \"nobody is above the law.\"",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "What a fucking faggot.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Time to update the score",
        "score": 979,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not yet.",
                "author": "cwoalf3"
            },
            {
                "raw_content": "He’s not even arrested yet. That’s tomorrow, because he’s being allowed to turn himself in rather than raided, like he should be. Also, don’t put it past the communist judge to just throw it out. He’d be lauded. They’d probably name a holiday after him.",
                "author": "Yignuced"
            },
            {
                "raw_content": "technically the Epstein arrest is at 1 , Ms. Maxwell",
                "author": "saltyviewer123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Allen : When Erika Kirk spoke the words on the man who killed her husband: “That man… that young man… I forgive him.” That moment deeply affected me. I have struggled for over 60 years to forgive the man who killed my Dad. I will say those words now as I type: “ I forgive the man who killed my",
        "score": 1787,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good for you Tim. You have defeated the demons!!",
                "author": "EastTexasMadLad"
            },
            {
                "raw_content": "Just remember that it is possible to forgive someone, out of your own self-interest, so that you move on with life, but also demand justice and accountability.",
                "author": "satoukazumadesu"
            },
            {
                "raw_content": "Full text: \"When Erika Kirk spoke the words on the man who killed her husband: “That man… that young man… I forgive him.” That moment deeply affected me. I have struggled for over 60 years to forgive the man who killed my Dad. I will say those words now as I type: “ I forgive the man who killed my father.” Peace be with you all.\"",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sad kek",
        "score": 1020,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is basically 22-250 remington",
                "author": "mytummyhurts"
            },
            {
                "raw_content": "Do yourself a favor and read the text in a college girls voice... it's perfect",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "Yeah, well, Trump has MOABS. You could scribe Lord of the Rings on one those badgirls. 🚀📜",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Barack HUSSEIN Obama: Republicans can’t win on their policies, so they are trying to dodge accountability by rewriting the rules.",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just like always, accusing us of what they did. Hussein Obummer always was a sick (and slick!) commie fuck.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The will of the people? DJT did get the popular vote, so I'm left to wonder what the gay kenyan is talking about.",
                "author": "SnowSnake"
            },
            {
                "raw_content": "Link to traitor https://x.com/BarackObama/status/1971308572945608741",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WE ARE NEVER LETTING IT GO!",
        "score": 1089,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obama's on deck",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "I guess it’s a start but we’ll see",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "I can't bring myself to lionize them just yet. I need to see much more.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Starting October 1st, 2025, we will be imposing a 100% Tariff on any branded or patented Pharmaceutical Product",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a very KEY issue to breaking away from CHINA who produces a vast majority of western medications.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "So they can \"break ground\" and \"build\" for 20 years? Come on dawg, what are these lawyers",
                "author": "blockchain-the-vote"
            },
            {
                "raw_content": "China gonna big mad with this.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Presenting The New Democrat Party",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are a death cult. 💀",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Link to Ben Garrison and Tina Toon cartoon (edited) https://gab.com/GrrrGraphics/posts/115266053381155809",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "New? They've been like this for years.",
                "author": "ItsUsvstheelite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ooof",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn't the picture of a group of people who are proud of what they're doing for a living. They would fold and dissolve like a wet paper bag at the first instance of REAL pushback.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "British cops are the laughingstock of our time.",
                "author": "journalist"
            },
            {
                "raw_content": "I guess they didn't have a free speech loicense.",
                "author": "DeusVult1096"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The champagne will remain cold until he's behind bars",
        "score": 1342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WTF I love Pam Bondi now? (I still don't).",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "I hope this is a turning point and a year from now I have to eat every bad thing I said about her",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "So incompetent. She sent this out with a typo. It should read, \"we will follow the fags in this case.\"",
                "author": "Side_o_beef_curtains"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says George Soros and LinkedIn co-founder Reid Hoffman are being probed for backing left-wing terror groups: \"Soros is a name I keep hearing. I hear about a guy named Reid Hoffman. They're bad, and we're gonna find out.\"",
        "score": 1370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Strip Soros of his Presidential Medal of Freedom for starters…",
                "author": "AfrikaanerBoer"
            },
            {
                "raw_content": "“Soros is a name I keep hearing” Well we’ve been fucking screaming it at the top of our lungs for nearly a decade! The guy has systematically destroyed this country from the inside out and he just now might get a little looksy? Fuck this low energy shit. I want GEOTUS back. I want the heads of the Soros duo on fucking spikes. This shit has been a bust so far. Sick of this fake art of war approach. We’ve been “appearing weak” so fucking long we’re just that.. WEAK! And everyone knows it. I need Trump to mainline some damn coca-cola or some shit to get that killer inside him alive again.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "Mr. President don’t leave out billionaire Nevelle Roy Singham and his wife Jodie Evans. They both sponsor terrorism in the U.S.",
                "author": "HumphreyPlowjogger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel reportedly raising prices on ever-popular Raptor Lake chips — 'outdated' CPUs to get over 10% price hike due to disinterest in AI processors",
        "score": 327,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Original source is behind a paywall, but that is quite the hum... puzzling development.",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "This has nothing to do with AI and Toms Hardware only included that as clickbait. The Core Ultra X processors underperformed at every price tier at launch and it made no sense to purchase them. Add in a confusing name change and I completely understand why they had disappointing sales. That said, a price increase in the older generation does not mean that Intel will gain higher revenue or push them to the new CPU lineup. AMD is lurking in the background and will absolutely demolish Intel if prices rise too high.",
                "author": "varateshh"
            },
            {
                "raw_content": "\"Disinterest in AI processors\" is a very editorialized way of saying \"People are buying cheaper, good enough RPL laptops instead of more costly MTL, LNL, and ARL laptops\" - this is especially true from corporate suppliers, where for a long time this year RPL Latitudes where like half the price of MTL latitudes.",
                "author": "soggybiscuit93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Updates First-Party Performance Claims of Core Ultra \"Arrow Lake-S,\" How They Stack Up Against AMD",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haven’t seen any hard dates on the refresh",
                "author": "Adventurous_Tea_2198"
            },
            {
                "raw_content": ">The flagship Core Ultra 9 285K is pitted against AMD's flagship part, the Ryzen 9 9950X3D. The gaming performance is shown to be mostly trailing by single-digit percentages, while content creation performance sees performance gains in favor of the 285K in 4 out of 5 tests.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "It looks like price comparison not performance. The 265k is better than 9900x",
                "author": "makistsa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm developed super-thin fanless Mini-PCs with Snapdragon X2 Elite series",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even neater, >Both systems use Frore's AirJet cooling, a solid-state thermal solution that replaces traditional fans with piezoelectric membranes that push air through tiny vents. It enables silent cooling in devices less than half an inch thick. Qualcomm noted that AirJet is just one option, and OEMs can also use fans or fully passive cooling depending on design goals.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "These with a linux distro ought to be a chefs kiss. I see they maintain a yocto repo at least. Hopefully support is included.",
                "author": "imKaku"
            },
            {
                "raw_content": "Innovative! Love when the engineers get to have fun like this. If they could only wave a wand and magically fix all the compatibility problems, these would be prime office devices.",
                "author": "letsgoiowa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why does Snapdragon X2 Elite contain a 192-bit LPDDR5X bus if only one SKU uses it?",
        "score": 4,
        "text_content": "Qualcomm’s X2 Elite die supports a 192-bit LPDDR5X interface, but only the top “Extreme” SKU enables it; the others are 128-bit. If die area is pricey, why build 192-bit on every die and light it up on just one? Is this actually economical in practice? It seems unusual, other SoC vendors (Apple/Intel/AMD mobile) typically keep bus width consistent across SKUs or use different dies, rather than shipping a wider bus fused off. Are there good precedents for Qualcomm’s approach?",
        "comments": [
            {
                "raw_content": "Their SKUs are likely all the same size, but they bin them to account for the relatively low yields of these modern foundry nodes Also reduces engineering complexity and increases reuse in the design",
                "author": "zulu02"
            },
            {
                "raw_content": "It's signal integrity thing. Lane voltage transition from 0 to 1 or 1 to 0 level isn't instant.",
                "author": "Awkward-Candle-4977"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen5 Review: Regular Upgrade - Geekerwan (English subtitles)",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know why my previous post was deleted instead of this post due to duplication ¯\\_(ツ)_/¯",
                "author": "Kryo8888"
            },
            {
                "raw_content": "22W at 4.6GHz?? Even liquid nitrogen didn't work?!",
                "author": "VastTension6022"
            },
            {
                "raw_content": "It's interesting the ways spec and GB6 diverge. Once again, QC and Arm's big cores are very closely matched with apple pulling ahead. Is it possible that apple's AMX units are being used in spec without requiring software targeting like SME? Does AMX still exist alongside SME2?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Ultimate Value 1440p OLED - Gigabyte MO27Q28G Review",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gigabyte GPUs: Aorus Elite Master Ice WindForce 3X. Gigabyte Monitors: MO27Q28G. ... While I'm no marketing expert, surely there can be a nice middle ground?",
                "author": "GenZia"
            },
            {
                "raw_content": "Hows the text quality on 1440p OLED these days? Last christmas I had a samsung one for a bit but it was so blurry I had to return it but it was QD-OLED I believe.",
                "author": "FinBenton"
            },
            {
                "raw_content": "In germany the retail price is currently 569€ and you can preorder it. The release date is the 13.10.25 or 16.10.25, depending on the retailer. For now it seems to be the first OLED monitor on the market with the new tandem OLED panel.",
                "author": "SJGucky"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Doug Bowser is retiring from his position as President of Nintendo of America on December 31st.",
        "score": 2000,
        "text_content": "His successor will be Devon Pritchard, who is currently the Executive Vice President of Revenue, Marketing & Consumer Experience. Satoru Shibata will become CEO ~~tomorrow (September 26th)~~ CORRECTION: Satoru Shibata will take over as CEO on November 16th. I read the wrong part of the document 🫠",
        "comments": [
            {
                "raw_content": "[https://www.businesswire.com/news/home/20250925384737/en/Doug-Bowser-Bids-Farewell-to-the-Mushroom-Kingdom](https://www.businesswire.com/news/home/20250925384737/en/Doug-Bowser-Bids-Farewell-to-the-Mushroom-Kingdom) \\> He will be succeeded by Devon Pritchard, a 19-year veteran of the video game industry and long-standing member of the NOA leadership team. In addition, Satoru Shibata will join NOA as Chief Executive Officer, while continuing his roles as Managing Executive Officer and Corporate Director, Member of the Board at Nintendo Co., Ltd. (NCL). Pritchard will also join the NOA Board of Directors and become an NCL Executive Officer \\- For comparison, Doug Bowser has been at Nintendo for a decade (since 2015) so considering her having more experience with being at Nintendo (since 2009), this won’t be a bad change. (Nothing will change about pricing though - I think Nintendo JP handles that) Satoru Shibata will be the new NoA CEO. Doug Bowser was previously CEO, So the top of leadership at NoA seems to have become a dual split?",
                "author": "thisSubIsAtrocious"
            },
            {
                "raw_content": "The only thing that people cared about this guy was that his last name was 'Bowser'",
                "author": "EquivalentCupcake390"
            },
            {
                "raw_content": "https://preview.redd.it/74r8faodrdrf1.png?width=1080&format=png&auto=webp&s=f1c4c983ed0867e7b31c7e86c8b1b0c1b237beeb Duality of man",
                "author": "benjoo1551"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All welcome the new NoA CEO Satoru Shibata. Gamer, 3DS Collector, Cosplayer, Layton Super Fan and also former Nintendo of Europe President, who did the european directs with comedy and skits",
        "score": 339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I doubt very much there will be any significant differences with directs going forward Though Shibata can work as the default presenter. Aside from the disembodied narrators",
                "author": "DevouredSource"
            },
            {
                "raw_content": "I never paid attention to employees. But the previous boss he replaced was Bowser? Really?",
                "author": "starvergent"
            },
            {
                "raw_content": "What? Didn’t Doug Bowser say that his successor is Devon Pritchard? Doesn’t that make her the new CEO…?",
                "author": "svampgurka"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's time",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How’s it on switch 2?",
                "author": "AppropriateWater2"
            },
            {
                "raw_content": "But I'm not done with Silksooong ![gif](giphy|d2lcHJTG5Tscg)",
                "author": "Demurrzbz"
            },
            {
                "raw_content": "I started playing Hades this week. Even though bosses are kicking my ass, this shit is so addicting. Hades 2 looks even better. I almost wanna ditch 1 and start 2 right now lol. Edit: Thanks for the encouragement guys. I'm liking the game a lot and will definitely keep playing.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My incredibly financially irresponsible Etsy purchase came in!",
        "score": 124,
        "text_content": "bonus how it looks on the console itself",
        "comments": [
            {
                "raw_content": "Those are so cute!!!!!",
                "author": "Excellent_Mixture_23"
            },
            {
                "raw_content": "Link?",
                "author": "Working_Equal_2897"
            },
            {
                "raw_content": "Xenoblade 2 joycons are always a financially responsible decision.",
                "author": "Wise-Nebula-6321"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident evil 9 gameplay switch 2",
        "score": 855,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This looks amazing especially since it's on handheld How good will it look docked",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Whaou this look incredible, maybe 40 FPS with VRR because it's look so smooth",
                "author": "PepezGeek07"
            },
            {
                "raw_content": "RE Engine is a beast",
                "author": "RayboxHitman47"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I was wondering why I couldn't play Hades 2 yet, but then I saw this.",
        "score": 684,
        "text_content": "So I have to wait until the evening to play this. I assumed it would be available at the same time for everyone (ie. Midnight release worldwide), rather than a simultaneous release. Is this a common way of handling releases now? I remember a time when Australians got to play before anyone else. Now they have to wait until the 26th",
        "comments": [
            {
                "raw_content": "This IS a simultaneous release, meaning released at the exactly same time everywhere globally. When it's 9 west coast it's 12 east coast. And it's already the 26th in Australia at that same time. What you meant to say was STAGGERED release, but you were inadvertently correct by using the wrong word. The dates and times in that image are all the exact same moment around the world. That's how timezones work.",
                "author": "a_lotis2words"
            },
            {
                "raw_content": "Simultaneous means all at once, fyi",
                "author": "pickpocket293"
            },
            {
                "raw_content": "They are smart doing this otherwise you just have a bunch of people trying to change their country and zone to get access to the game. It makes literally no sense to delay a game 20 hours after people are already playing it for certain parts of the world.",
                "author": "JoyousGamer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What is with the Switch 2 dock prices on EBay?",
        "score": 83,
        "text_content": "Am I missing something? You can go on Nintendo website right now and buy it for 125. What’s going on the second hand market",
        "comments": [
            {
                "raw_content": "Probably guys that got their consoles bannned trying to recoup some money lol",
                "author": "Tokin420nchokin"
            },
            {
                "raw_content": "I look at this every day because Nintendo has been out of stock on the website for a few weeks now and I need one. I almost pulled the trigger on a used dock set today for $139 but decided to wait it out a bit longer.",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "There are third party docks much cheaper. Just watch the last Austin John play video. I don't know if you miss some video outputs etc but they seem to work properly.",
                "author": "Longjumping-Ad3983"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem (RE9) - Nintendo Switch 2 Handheld Gameplay - Tokyo Game Show 2025 Demo",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy crap. It looks and runs incredible.",
                "author": "Paperdiego"
            },
            {
                "raw_content": "Looks like the most impressive port yet.",
                "author": "OneUse2170"
            },
            {
                "raw_content": "Not the best recording conditions, but even so, that looks really promising.",
                "author": "LootedToaster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Best Buy has listed ROG Xbox Ally and Ally X prices early ($599.99 and $999.99 respectively)",
        "score": 330,
        "text_content": "Source: https://www.reddit.com/r/xbox/comments/1nqdq82/official_price_on_bestbuy_rog_xbox/#lightbox Direct image: https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fbeqx3vzqncrf1.jpeg These were supposed to be announced at 8PM eastern US time (5PM pacific) This is a $50 and $100 increase respectively over the prices [billbil-kun](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mvd0hj/xbox_rog_allys_prices/) and [Best Buy](https://xcancel.com/Wario64/status/1958166743160881435) leaked a month ago.",
        "comments": [
            {
                "raw_content": "That's a lot of dollars",
                "author": "beary_neutral"
            },
            {
                "raw_content": "$999 in US DOLLARS? Man as a Canadian with our weak ass loony ain't nobody fucking buying this. This thing's for YouTube influencers to get pre-release while everyone else watches them have fun with something they'll either never afford or bring themselves to justify spending on Give me that Xbox Full Screen Experience thing to side load on PC. I'm good",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Wow. $900 was already a lot as rumored but $1000 then factoring in tax, no way.",
                "author": "kaiharizor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rockstar Games rumored to unveil Project ROME modding engine for GTA 6 very soon",
        "score": 54,
        "text_content": "Rockstar Games rumored to unveil Project ROME modding engine for GTA 6 very soon Read more: https://www.tweaktown.com/news/107895/rockstar-games-rumored-to-unveil-project-rome-modding-engine-for-gta-6-very-soon/index.html",
        "comments": [
            {
                "raw_content": "\\*Checks article\\* Source: GTA6Countdown ![gif](giphy|eH2uOQEmvcqcqgPoH3)",
                "author": "N0th1ng5p3cia1"
            },
            {
                "raw_content": "this source sucks",
                "author": "Sunless_Heaven"
            },
            {
                "raw_content": "So they’re going the Fortnite creative route for gta online, can’t say I’m surprised but I’m very intrigued by this",
                "author": "SIotball"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-kun: PS5 Pro Revision coming to European Markets",
        "score": 264,
        "text_content": "[https://www.dealabs.com/magazine/une-nouvelle-version-de-la-ps5-pro-arriverait-bientot-voici-ce-que-lon-croit-en-savoir-60579](https://www.dealabs.com/magazine/une-nouvelle-version-de-la-ps5-pro-arriverait-bientot-voici-ce-que-lon-croit-en-savoir-60579) >Sony is set to launch a new version of the PS5 Pro on the European market, identified by the reference CFI-7121. Availability on the American continent remains uncertain at this time. >The improvements to this model, which are still unknown, are likely to be modest, possibly limited to better energy efficiency. However, one thing seems certain: there will be no reduction in storage capacity. The PS5 Pro CFI-7121 will retain its 2TB SSD storage, with no changes to its external design. > >Finally, the console would be available in Europe from September 30, 2025. In terms of price, again, no surprises are expected, with the price remaining at €799.99.",
        "comments": [
            {
                "raw_content": "definitely some cheaper components to keep the price stable. hopefully that doesn’t reduce quality",
                "author": "account_for_gaming"
            },
            {
                "raw_content": "PS5Pro Slim",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "Now every Pro will come with a bad fan and coil whine.",
                "author": "StretchKind8509"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forza Horizon 6 Leaked short trailer",
        "score": 240,
        "text_content": "[https://xcancel.com/AR12Gaming/status/1971142298470871372](https://xcancel.com/AR12Gaming/status/1971142298470871372)",
        "comments": [
            {
                "raw_content": "I have a feeling it will feature cars",
                "author": "beeperbeeper5"
            },
            {
                "raw_content": "Turns out it was the whole trailer. Lmao",
                "author": "Psychological-Row641"
            },
            {
                "raw_content": "this really seems like they wanted to reveal it here no matter what but werent able to get a gameplay reel going in time, bit of a shame but it'll likely be peak anyway.",
                "author": "skrunkled_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Posts New Linux Patches To Reduce Overhead Of VMSCAPE Mitigation",
        "score": 24,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock Teams Up With Capcom for ASRock AMD Radeon RX 9070 XT MONSTER HUNTER WILDS EDITION",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These things always hit so late. The hype for Monster Hunter Wilds has died down considerably and I don't think that either thing is going to boost the other's hype personally.",
                "author": "ProbablySkerrim"
            },
            {
                "raw_content": "so... its just a regular rx 9070 xt but with a stencil on it publicizing the game, it doesnt come with the free game or someting actually useful?",
                "author": "pesca_22"
            },
            {
                "raw_content": "Whats kinda funny, kinda sad, is that this card would not be able to play the game very well. No card can really play the game well, its still a shit show.",
                "author": "Symphonic7"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock launches Radeon RX 9070 XT Monster Hunter Wilds Edition - VideoCardz.com",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks terrible to be honest",
                "author": "Independent_Lead5712"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Trump Tariff furniture and Cabinets",
        "score": 95,
        "text_content": "Trump just announced a 50% tariff on kitchen cabinets and bathroom vanities. Along with a 30% tariff on furniture. Both will start Oct 1. These tariffs are replacing, not adding to, existing country-specific tariffs.",
        "comments": [
            {
                "raw_content": "Jokes on them, I'm broke.",
                "author": "Responsible_Year1206"
            },
            {
                "raw_content": "Only the rock bottom cheapest cabinets (China) and the ultra high end cabinets (Italy) are made outside of America. If you are looking at buying custom cabinetry, you should be more concerned about the cost of labor going nuts because we keep deporting skilled laborers.",
                "author": "MistaWesSoFresh"
            },
            {
                "raw_content": "Trumps Cabinet picks suck!",
                "author": "CoolTomatoh"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "All four of Florida's major metro areas have shifted into buyer's market territory",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "according to Altos Real Estate (remember them?): * Miami is a seller’s market * Orlando is a seller’s market * Jacksonville is a seller’s market * Tampa is a seller’s market shit, fuckin *Austin TX* is a seller’s market still: https://altos.re/r/296029c6-e106-43e1-af40-92e5bba0883d according to polling done by Pew and Gallup, in 2011 about **half** of American homeowners believed that their home’s value had stayed level or gone up in recent years. think about that. what housing crash? sounds like something that happened to the other guy down the street who made a bad investment, not me. lol ok. which is why there’s an ever-present chorus of “i got a X% mortgage and i’m staying here forever”, etc. great, and that might be true. but also you don’t have a say in that. your predicament just happens to align with your desires. whether you like it *or not* you’re stuck. starter home? money pit? want to grow your family? running out of space? commute too long? don’t like the location anymore? want a lifestyle change? house poor? stressed about having to always fix things? lost a job? want to move somewhere else? nope. you don’t have a say in, or any control over, these things any longer. you’re quite literally trapped. like a servant.",
                "author": "acqua_di_hoomertears"
            },
            {
                "raw_content": "Imagine being able to afford a house at this point if you didn’t already have one five years ago.",
                "author": "MadScallop"
            },
            {
                "raw_content": "Meanwhile, national headlines shouted from the rooftops: Prices increase 2.1 in August, 2025. Nationally are higher than at this point last year. And that's what sellers, owners, hear. Their asset went up. A \"shift to a buyers market\" means it was just recently NOT a buyers market. Don't buy now. Pain is not being felt on the supply side. Not commiserate with the pain felt for would-be and actual buyers, since 2021.",
                "author": "HartbrakeFL21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Jobless claims tumble to 218,000, well below estimate despite fears of labor market weakness",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "but can we trust this data now?",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "So why are we lowering rates? I just want some things to make sense.",
                "author": "Mr_Doubtful"
            },
            {
                "raw_content": "Apparently also mortgage interest/demand is also around a close to 4 year high! Unfortunate for me as a person who does not own a house",
                "author": "Jazzlike-Worker-1329"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Very few sold homes in last 2-3 months",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Definitely, it will be one of the slower summers on record, I believe. Closed home sales I think are currently at some of the lowest levels in around 30 years",
                "author": "InternalEbb3931"
            },
            {
                "raw_content": "Slow down is happening and slowly spreading nationwide, the next coming months will be key barometer into how worse the house market gets heading into winter. If active listings continue to pile up into winter it could rough 2026..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Good. Hope the vehicle and house market fucking crash!",
                "author": "Kcchiefssuperfan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Post First Decline in 3 Months, Even As Mortgage Rates Drop",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the cost of something starts dropping (doesn't matter if price or rates), it's a good time to wait and see where it ends up settling.",
                "author": "CrayonUpMyNose"
            },
            {
                "raw_content": "I love how the entire MSM echo chamber relentlessly trying to gaslight us into not pointing out price is too damn high, yeah interest rate is the boogie man and not because a crappy crapshack in SoCal with entitled sellers asking $1m as some kind of artificial baseline is just a total norm..",
                "author": "Scblacksunshine"
            },
            {
                "raw_content": "Imo, the majority of people who could afford a home, already bought a home.",
                "author": "coldshowerss"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why New Homes Are More Popular With Buyers Than Existing Homes Recently (Investopedia)",
        "score": 18,
        "text_content": "Full article below. No BS link. # Key Takeaways * New-home sales jumped to an annual rate of 800,000 in August, topping economists' expectations, as buyers took advantage of lower mortgage rates and builder incentives. * Meanwhile, existing home sales declined slightly in August as prices remained high. * A recent decline in mortgage rates helped home sales, which economists said could be even better in September if rates continue to fall. New homes are now more popular than existing homes, due largely to builder incentives and plentiful inventory, new data released this week showed. Sales of newly-constructed homes in August came in at an annual rate of 800,000, a 20% increase from July’s rate of 664,000. It was the fastest pace of sales since early 2022, economists at Wells Fargo noted in a report Wednesday. Economists said the surprisingly strong results are likely the result of builder incentives to lower housing costs and a decline in [mortgage rates](https://www.investopedia.com/mortgage-rates-5184598). “There’s a large pool of Americans sitting on the sidelines who want to buy, and they are waiting for more affordability,” said Heather Long, chief economist at Navy Federal Credit Union. “They are willing to buy when conditions are even a bit more favorable.” # Why This Matters to Home Buyers The housing market has been mostly stuck due to high prices and limited inventory, but a rise in new-home sales shows that the market could be starting to turn around, especially if mortgage rates continue to decline. Mortgage rates have declined about three-quarters of a percentage point from the highs around 7% in January, according to Freddie Mac data. The latest [decline in borrowing costs](https://www.investopedia.com/homebuilders-need-more-rate-cuts-11813482) has come amid expectations the [Federal Reserve could continue to lower its benchmark interest rate](https://www.investopedia.com/federal-reserve-september-meeting-interest-rate-decision-11811834). Even with the decline in mortgage rates, builders have been offering more incentives to move their inventory of new homes. In August, 66% of builders [offered special incentives](https://www.investopedia.com/how-are-home-builders-driving-sales-higher-price-cuts-and-rate-deals-8780972), the most in the post-Covid era, according to the National Association of Home Builders. Incentives include mortgage rate buy-downs, reduced closing costs and credits for housing design changes. Meanwhile, sales of existing homes have been sluggish—sales fell slightly in August to a seasonally adjusted annual rate of 4 million—as prices remain relatively high. The median sale price for an existing home was $422,600 last month, compared to the $413,500 price tag for the typical new home in August. Buyers also have more new houses to choose from, with data showing a 7.4 month supply of inventory of new houses, compared with a 4.6 month supply for existing homes. “Buyers are seeing a lot of value in new homes and taking advantage of the unusually high glut of new homes for sale on the market,” Long said. It could be just the start of improved sales in the housing market, economists said, as mortgage rates in September have continued the decline seen in August.",
        "comments": [
            {
                "raw_content": "Massive rate buy downs?",
                "author": "drakolantern"
            },
            {
                "raw_content": "People are attracted to the brand new aspect. Why buy a house that needs a lot of renovation work when you can buy new and avoid it. I’m not saying new construction is better as that may come with its own set of issues but I can see why a new construction home is more attractive than an older home that needs work.",
                "author": "MikeGLC"
            },
            {
                "raw_content": "5% Conventional with a 2/1 buydown (3% year 1 and 4% year 2). All Points paid by Lennar and $7500 to closing costs. These were the incentives for us to go new.",
                "author": "_ToxicBanana"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Existing home sales stall in August amid higher mortgage rates",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The shrodinger's housing market hottest summer with the slowest august. Who are we supposed to believe?",
                "author": "TheDizzyTablespoon"
            },
            {
                "raw_content": "I heard interesting commentary last night from an economist. He said that without spending from the top 10% of wage earners, the economy would already be in a recession. From this latest housing data I would say this also holds true for real estate. It’s those higher wage earners who are keeping real estate from completey crashing.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Geez, MSM make up your freaking mind ..one day the headline is best sales volume and up 20% cause interest rates so better FOMO buy now, the next day it is home sales is stalling...at least be consistent with your propaganda.",
                "author": "Scblacksunshine"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "KB Home Lowers Outlook as Slow Housing Market Continues to Bite",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quick Summary * KB Home’s third-quarter profit and full-year sales outlook declined because of a challenging housing market and lower home prices. * The average sales price for KB Home fell to $475,700 in the third quarter, down from $480,900 a year earlier. * Housing starts declined, with total starts down 6% and single-family starts down 12% year-over-year in August. KB Home recorded a lower third-quarter profit and cut its full-year outlook again as a wobbly housing market pushed down home prices. The home builder reduced its full-year sales guidance to $6.1 billion to $6.2 billion, down from its previous forecast of $6.3 billion to $6.5 billion. The company had predicted full-year revenue as high as $7 billion to $7.5 billion in January. Home builders have suffered from stagnant sales as high mortgage rates and economic uncertainty have put off buyers. Many builders have been forced to offer aggressive concessions to stimulate sales, a move that has cut into their margins. Mortgage rates have fallen recently, but builders have said that hasn’t led to higher sales activity. “I wouldn’t say that we’ve seen the uptick that we would expect to see from such a change in mortgage rates,” KB Home Chief Operating Officer Robert McGibney said on the company’s earnings call. “And I think to some extent, buyers are in maybe a bit of a wait-and-see mode.” KB Home’s average sales price fell to $475,700 in the third quarter, down from $480,900 a year earlier. The home-building industry is hopeful that the market might soon strengthen if mortgage rates continue to decline. The 30-year fixed rate fell to 6.26% last week, its lowest level since October, according to Freddie Mac. KB Home said the recent decline in mortgage rates, based on the company’s average selling price, creates an additional $30,000 in purchasing power for buyers. But a weakening labor market has raised concerns that the housing market might remain stubbornly slow. Some builders have been pulling back on new starts to preserve margins while waiting for the downturn to end. Total housing starts in August declined 6% year-over-year, and single-family starts fell 12% in the same period, according to U.S. Census Bureau data released last week. KB Home’s number of homes delivered fell 7% to 3,393 in the third quarter. Sales totaled $1.62 billion, down from $1.75 billion a year earlier. The company reported third-quarter net income of $109.8 million, or $1.61 a share, down from $157.3 million, or $2.04 a share. Analysts were expecting $1.50 a share, according to FactSet. KB Home said the decline in home starts is having the benefit of making construction less expensive. “We’re using that as an opportunity to work with our trade partners and they’re hungry for work, which gives us an opportunity to drive down costs,” McGibney said. Lumber prices have also fallen in recent weeks, contributing to lower construction costs, KB Home said on the earnings call. Last week, Lennar, one of the largest U.S. home builders, reported a decline in third-quarter profit and said it would lower its building volume for the rest of the year to preserve its margins. It had previously adopted a strategy of pace over price, offering aggressive incentives, often in the form of mortgage buydowns, to maintain its sales volume, even at the expense of profit. **KB Home has advocated for price reductions instead of buydowns to encourage sales. It has argued that buydowns force customers to buy houses at inflated prices that they won’t be able to match if they need to sell the home again.** **KB Home can avoid offering incentives because it builds more homes to order, while other companies build more of their homes on speculation, meaning they haven’t yet found a buyer. Those spec homes are expensive for companies to keep on their balance sheet, forcing them to offer sizable incentives to offload the homes to buyers.** According to an August survey from John Burns Research and Consulting, builders are offering almost twice as much in incentives for spec homes as they are for built-to-order homes.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Gemini Robotics 1.5",
        "score": 648,
        "text_content": "[https://deepmind.google/models/gemini-robotics/](https://deepmind.google/models/gemini-robotics/)",
        "comments": [
            {
                "raw_content": "It's very satisfying seeing a perfect storm of advances in AI and Robotics come together like this. I think more people would appreciate the gravity of the advancement if they just put one of these arms next to a tree and had it pick a fruit. Sorting laundry is cool but the possibilities for agriculture lead to, literally, solving hunger. It's apple season. I feel like one of these robot labs should be able to demonstrate practical agriculture for their humanoid robots by grabbing literal low hanging fruit.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Restoring the scene to the original state was most impressive to me. I can imagine the future telling a robot to organize my desk once a day into the predefined state I want, so it removes junk and maybe dishes until it's back to the original version. It would always be clean. I'm sure this can translate to every other area of a household.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "Holy shit this is insane. We will watch this in a few decades and laugh at how it all began.",
                "author": "toni_btrain"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "nervous about the glasses",
        "score": 357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great drawings, reminds me a bit of the late great Robert Crumb",
                "author": "Mammoth-Thrust"
            },
            {
                "raw_content": "Why the guy sitting on toilet looking at his glasses screen as opposed to his phone screen makes you nervous? I'd say glasses would be more hygienic in this scenario. lol",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "My hearing aids have Bluetooth and it's really cool. Very practical AR function. But when I get a phone call or it starts to play in my ears when I'm not ready it's very disorienting. Having that kind of thing in your field of vision could be really dangerous though. If you're driving for example. In general I think people should be more bullish about wearables",
                "author": "morrimike"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s chief scientist says they want to build AI that can automate research",
        "score": 220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that’s basically every company’s goal right now. Even Dario and Demis have mentioned it recently",
                "author": "Sxwlyyyyy"
            },
            {
                "raw_content": "automate deez nuts",
                "author": "Old-Risk4572"
            },
            {
                "raw_content": "Would be nice. It'll take some doing, though.",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta introduces Vibe - an AI generated video feed",
        "score": 49,
        "text_content": "https://x.com/alexandr_wang/status/1971295156411433228?s=46 Infinite slop machine",
        "comments": [
            {
                "raw_content": "I love how this would have been such a breakthrough a few years ago and now it just gets called out for the slop it is.",
                "author": "NowaVision"
            },
            {
                "raw_content": "It's all thanks to that fucking moron from Scale AI. Wonder if Meta will be stubborn enough not to fire his dumbass.",
                "author": "Funkahontas"
            },
            {
                "raw_content": "Lmao it's like they have no user research team over there. Destroying their products one corny update at a time.",
                "author": "false_athenian"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New benchmark for economically viable tasks across 44 occupations, with Claude 4.1 Opus nearly matching parity with human experts.",
        "score": 256,
        "text_content": "\"GDPval, the first version of this evaluation, spans 44 occupations selected from the top 9 industries contributing to U.S. GDP. The GDPval full set includes 1,320 specialized tasks (220 in the gold open-sourced set), each meticulously crafted and vetted by experienced professionals with over 14 years of experience on average from these fields. Every task is based on real work products, such as a legal brief, an engineering blueprint, a customer support conversation, or a nursing care plan.\" The benchmark measures win rates against the output of human professionals (with the little blue lines representing ties). In other words, when this benchmark gets maxed out, we may be in the end-game for our current economic system.",
        "comments": [
            {
                "raw_content": "I’m impressed at the focus Anthropic has had on practical use and agents.",
                "author": "marlinspike"
            },
            {
                "raw_content": "Worth noting this is OpenAI’s benchmark, they did a solid job making this, seems like it took a lot of effort",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Kudos to OpenAI for being honest",
                "author": "FeathersOfTheArrow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT will now initiate conversations and become your personal assistant. ChatGPT Pulse now released for Pro users.",
        "score": 172,
        "text_content": "Will come to Plus users at a later time.",
        "comments": [
            {
                "raw_content": "At least a tiny step in the direction where ai prompts human, not vice versa",
                "author": "Realistic_Stomach848"
            },
            {
                "raw_content": "I find this interesting. It is optional . But tbh I really really need a reminder assistant. I know it is silly. But I unintentionally sometimes ignore some telegram auto messages and reminders on apple if they are too much. (So i have to do them twice)I feel an agent can really help if it is personalised well enough to talk you through it.",
                "author": "Gaeandseggy333"
            },
            {
                "raw_content": "Sounds really cool, but $200 per month is way too much for me. When will this come to Plus?",
                "author": "nanlinr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini Robotics 1.5 brings AI agents into the physical world",
        "score": 234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I may be alone in this, but the robotics application of Gemini is, by far, the coolest functionality",
                "author": "Sweeede"
            },
            {
                "raw_content": "\"What is my purpose?\"",
                "author": "ScreamingJar"
            },
            {
                "raw_content": "I generally trust Google to bring these products to market more than most others. As far as AI tech goes, Google has been a leader in bringing it to proper consumer products. When it comes to robotics, what I'm seeing in this blog is super cool. If I have a robot butler, it being able to pick up the dirty spoon, and put it in the cutlery rack in the dishwasher, turn it on, then take the clean spoon and put it on the spoon slot in the cutlery drawer. Sorting trash into the appropriate bins is great ... But the slow, clunky, careful, awkward movement that we consistently see in all robots... that shit HAS to get improved upon. It's terrible, and it's what keeps robotics from being taken seriously. You can show me a super genius robot that can do anything, but if it does this slow, jerky shit, it'll never be more than an advance toy. In my opinion anyway. I have no doubt that it's going to be improved upon, and I have no doubt that it's a very difficult hurdle to jump over. But I've seen too many promo videos of robots that act like 102 year old men, or that have been sped up by 2x in order to make them look acceptable.",
                "author": "Rnevermore"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DNA Study of 117-Year-Old Woman Reveals Clues to a Long Life",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting. I’m very curious to see how they can apply this.",
                "author": "le4u"
            }
        ],
        "subreddit": "singularity"
    }
]