[
    {
        "post_name": "Trump reimplementing title 42. It’s all happening.",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is how you know all the lib's \"it's for the greater good of PuBlIc HeAlTh\" was all just bullshit. Because if it was, they'd be all about closing the border and stopping the spread of all these third world disease these invaders are bringing.",
                "author": "Litterboxer1"
            },
            {
                "raw_content": "Still waiting for a crack down on mass migration from India....",
                "author": "invalid_data"
            },
            {
                "raw_content": "That's cool. When are we abolishing Income Tax.",
                "author": "SomeGuyWithAnAccount"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon is red pilling at an amazing rate. This would have never been mainstream thought even 10 years ago.",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only 52%? Should be 90%. Our kids will hate is even more so than us hating boomers for spoiling a 95% White America",
                "author": "newuser8"
            },
            {
                "raw_content": "For many this has been entirely obvious for a long time. The mystery is how do others not see it? Do they choose to not see it?",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "The 48% of retards blame Republicans for not supporting leftist bills Yet to no surprise, Trump passes no bills and closes borders.",
                "author": "MagaJay01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ROGER STONE: On this date in 1972 president Richard Nixon made his trip to China. China was at the time a backwards agrarian society, largely without indoor plumbing or electricity in rural areas. Not until President Bill Clinton gave them most favored nation trading status and sold them are top mi",
        "score": 602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should've left them in the stone age.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "OUR**",
                "author": "Sunnybats2"
            },
            {
                "raw_content": "China *still* has little in the way of plumbing or anything like cleanliness in its rural areas.",
                "author": "splink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Our Country’s doing really well, and today, I was just thinking, that the company building the Keystone XL Pipeline that was viciously jettisoned by the incompetent Biden Administration should come back to America, and get it built — NOW!",
        "score": 1828,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am so not tired of winning He is going to save this country",
                "author": "PotatoJoe"
            },
            {
                "raw_content": "Trump lays pipe like no one else. The best oil, the best energy, the best economy—believe it!",
                "author": "NoHomoPromo"
            },
            {
                "raw_content": "Gas about to be one fiddy.",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: Why is Crenshaw homicidal regarding Tucker?",
        "score": 1532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's angry that Tucker has depth perception and better peripheral vision than he does.",
                "author": "cereal_killer"
            },
            {
                "raw_content": "[Glenn Greenwald Exposes Dan Crenshaw's Lies on Ukraine](https://rumble.com/v6n6jwx-glenn-rips-apart-dan-crenshaws-ukraine-lies-on-piers-morgan.html?e9s=src_v1_ucp) Crenshaw as his usual asshole self on Piers Morgan.",
                "author": "flashersenpai"
            },
            {
                "raw_content": "They kicked Santos out, can't they do the same for the one-eyed RINO?",
                "author": "Monsieur_Novembre"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HAHAHAHAHAHAHAHAHA. I haven't laughed this hard in awhile",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But why's the cum gone?!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Captain Jack Swallow",
                "author": "MAGATRON2020"
            },
            {
                "raw_content": "That is a real photo of him. Everything else in the pic like the boat is fake.",
                "author": "TrumpIsTheVictor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "5 foods",
        "score": 2206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Tendies 2. Tendies 3. Tendies 4. Tendies 5. Oh shit he’s behind me isn’t he",
                "author": "lefty295"
            },
            {
                "raw_content": "1. Dick 2. Dick 3. Dick 4. Dick 5. Dick -*Bill Mitchell, probably*",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "1. Cup of Liberal Tears 2. Cup of Liberal Tears 3. More Liberal Tears 4. Tendies 5. Washed down with Liberal Tears",
                "author": "FBIAREFAGGOTS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One-eyed McCain mocked as he deserves",
        "score": 999,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent. God, Crenshaw needs to fucking go.",
                "author": "seeling0"
            },
            {
                "raw_content": "Eyepatch McCain is seriously unhinged",
                "author": "PepePinochet"
            },
            {
                "raw_content": "GPrime makes absolutely fucking hilarious comics.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The judge blocking Trump’s mass deportations has family members working for open borders NGOs. How is this legal?",
        "score": 1830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "☁️☁️☁️☁️🌤☁️☁️☁️☁️☁️ 🚁 🤸🏻‍♀️ 🤸🏻‍♀️ 🦈 🌊🌊🌊🏝⛰🏝🌊🌊🌊🌊",
                "author": "Mountaineer"
            },
            {
                "raw_content": "The left made a ton of money off of illegals and their NGOs. The Judge knows.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "It isnt. Best case she can stop them in her area. I am not sure that is even correct.",
                "author": "y_do_i_need_to_hide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A perfect example of how it works.",
        "score": 1149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are a lot more dicks tangling up underneath that table",
                "author": "chickeninoven"
            },
            {
                "raw_content": "Not just democrats. Expose them all and let the chips fall where they might.",
                "author": "Returningtogod"
            },
            {
                "raw_content": "Ain't just deomcrats.",
                "author": "BarrysOFace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇺🇸 KASH AND DAN! 💪🏻",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "check out the beak on that beast",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Trump, Pam, Kash, Dan, Elon = Democrats Nightmare",
                "author": "plateowner2024"
            },
            {
                "raw_content": "I was most excited about Kash. Didn't realize it would cost me the Bongino shows :( Make us Proud Dan. Been listening since mid 2017.",
                "author": "Forgototherpassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey, DOGE: What's Dan Crenshaw's net worth and how much has it increased during his brief time in Congress?",
        "score": 1708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He was always someone people should have been keeping an eye on.",
                "author": "magnokor"
            },
            {
                "raw_content": "Threatening Tucker hopefully moved this corrupt pos higher up the list on who needs to be audited.",
                "author": "makersmarx"
            },
            {
                "raw_content": "Inquiring minds would like to know.",
                "author": "squigley"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TREACHERY: CIA Agents Opposed to Trump Pondering Taking State Secrets to Foreign Powers ::: DEATH PENALTY WILL FIX THIS!!!",
        "score": 1576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hang a bunch of them...that talk will stop quite fast",
                "author": "TheOne1"
            },
            {
                "raw_content": "Kash said that anyone that harms Americans will be “hunted down in every corner of this planet”. That wasn’t just a warning to foreign enemies, but also domestic enemies that may seek to flee to a foreign adversary.",
                "author": "QuickMaths"
            },
            {
                "raw_content": "Foreign powers.. like the CIA?",
                "author": "meric_jar_mellon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CONGRESSMAN DAN CRENSHAW: “If I ever meet Tucker Carlson, I’ll f***ing k*ll him. I’m not joking.”",
        "score": 2043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So you can stop him from telling the truth about you, Dan? This guy needs to go. The Texas Republicans need to run someone in his district who can unseat him...next election. He needs to go before he becomes too powerful.",
                "author": "Former_RM2"
            },
            {
                "raw_content": "That’s a crime.",
                "author": "couranto"
            },
            {
                "raw_content": "He's such a piece of shit and doesn't even know it. Where's Alex Stein when we need him.",
                "author": "ConGrande1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VIVEK RAMASWAMY is running for Governor of the Great State of Ohio. I know him well, competed against him, and he is something SPECIAL. He’s Young, Strong, and Smart! Vivek is also a very good person, who truly loves our Country. He will be a GREAT Governor of Ohio, will never let you down, and has",
        "score": 933,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Phony globalist shill I’ll pass (don’t live in Ohio anyways)",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "How about no.",
                "author": "NeoDragoon"
            },
            {
                "raw_content": "If you want Ohio to be the next mini India",
                "author": "RolandDelacroix"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MSNBC (Morons Spreading Nothing But Crap) cancels 3 more shows.",
        "score": 1339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They were being floated by USAID et al style of corruption and the jig is up!",
                "author": "TrumpIsMyyPresident"
            },
            {
                "raw_content": "USAID money drying up",
                "author": "f_bastiat"
            },
            {
                "raw_content": "The unemployment line is going to be lit!",
                "author": "starbound1332"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: Foolish Macron interrupts Trump to correct him about Ukraine funding",
        "score": 1412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Macron tried to verbally manhandle Trump, didn't work and Trump caught it",
                "author": "salbro"
            },
            {
                "raw_content": "To which Trump replied \"Your wife's 80 yrs old and so ugly people think she's a man we're done here\"",
                "author": "Sodak"
            },
            {
                "raw_content": "That’ll come back to bite him……badly",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mexican cartel boss with goofy nicknames like ‘James Bond,’ ‘Xmen’ extradited and charged in NYC - Arrested in and deported from Mexico",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should kill these people on sight.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Stupid beaners",
                "author": "GoUSA"
            },
            {
                "raw_content": "Superpowers: 1. Press \"2\" for English. Automatically turns every word written or spoken into spanish and forces YOU to learn HIS barbaric tongue. 2. Holy frijoles. Rains down beans from the sky making traversing the terrain very difficult. 3. I know nothing. Pretends to be ignorant of the law in order to avoid consequences. i.e. When driving drunk and hits a child. 4. ¿Dónde está el baño? Urinates on the sidewalk, dealing a -5 concentraion on foes. 5. Life Drain. Able to replenish health and stanima by leeching off the US Citizens. 6. Mexican Judo. Judon't know if he has a gun or knife.",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FBI just doesn't have time for us any longer",
        "score": 1575,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine if we lived in the UK, we would’ve gotten the death penalty already for posting the truth and shitposts we do",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I've been a bit busy over the weekend with matrimonial duties so missed most of the news cycle. Sometimes, that's a good thing. When it comes to butthole lasers, it's most certainly a good thing. I did not have that topic on my Bingo card.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "Sad Times...😀",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gotta love NYS corruption!",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "HOLD THE FUCKING CAMERA STILL",
                "author": "PMSocks"
            },
            {
                "raw_content": "Repealing the 19th would fix this country in a couple of weeks.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "dems: \"if it ain't broke, we'll fix that\"",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Articles from Tomshardware.com should be banned due to continuous conflict between r/hardware rules and questionable quality of their articles.",
        "score": 529,
        "text_content": "**Preface:** I wrote the following post 7 days ago but it got automatically removed. I contacted the mods, after days of back-and-forth they said 'they believe it was removed because of the twitter link'. I decided to repost it due to recent [AMD 9800X3D 'failures/deaths' Reddit megathread ](https://www.reddit.com/r/hardware/comments/1ix9p8c/amd_9800x3d_failuresdeaths_reddit_megathread/) post. People in this sub I believe have the same sentiment. I hope this won't get auto removed again. --- It is my observation that articles originating from Tom's Hardware are becoming more and more unreliable as time passes. Some of those articles (if not most) are based on unconfirmed rumors, originating from short tweets. They write articles out of those without adding anything substantial. They convert the source into paragraph long article by adding filler words. Those articles fail to satisfy some of the standards of r/Hardware; and they fail to comply with some of the rules of this sub. By being a known website of many years, they produce a lot of content and quickly. By the extension of it r/Hardware gets filled with content from Tom's Hardware at a similar rate. This has the potential to manipulate conversations based on unreliable articles. Therefore, as a whole, articles from Tom's Hardware should be banned. # r/Hardware's Standards It writes in bold on the sidebar on of r/hardware on Old Reddit that: > **The goal of /r/hardware is a place for quality hardware news, reviews, and intelligent discussion.** \"**Quality**\" is the adjective used here for news and reviews. Tom's Hardware in my opinion do not publish quality news. ## Some Rules Here are related rules of this subreddit. > ### Original Source Policy > Content submitted should be of original source, or at least contain partially original reporting on top of existing information. Exceptions can be made for content in foreign language or any other exceptional cases. Fully paywalled articles are not allowed. Please contact the moderators through modmail if you have questions. > ### Rumor Policy > No unsubstantiated rumors - Rumors or other claims/information not directly from official sources must have evidence to support them. Any rumor or claim that is just a statement from an unknown source containing no supporting evidence will be removed. \"Content submitted should be of original source, or at least contain partially original reporting on top of existing information.\" says one rules Therefore shared articles must at the very least (1) contain the source information and (2) additional reporting on top of that. \"Rumors or other claims/information (...) must have evidence to support them.\" says another rule. This on is self-explanatory. # An example Recently [this post](https://www.reddit.com/r/hardware/comments/1iriore/rtx_5090_supplies_to_be_stupidly_high_next_month/) linking to [this article by Hassam Nasir](https://www.tomshardware.com/pc-components/gpus/rtx-5090-supplies-to-be-stupidly-high-next-month-as-gb200-wafers-get-repurposed-asserts-leaker) is posted on this sub. It is flaired as Rumor. Title of the post is the same as the title of the article: > RTX 5090 supplies to be 'stupidly high' next month as GB200 wafers get repurposed, asserts leaker This article's title's has a definitive statement. Yet the article has nothing definitive. It alleges, supposes; and finishes with adding nothing substantial. It doesn't proves or disproves the claims of the source. By the way, the source to this 2460 character long article is this short tweet: > The supply of RTX5090 will be stupidly high soon. Scalpers will cry so hard😂 > by @Zed__Wang on Twitter. > Link: x(dot)com/Zed__Wang/status/1890608126329586017 This article is not a quality article. It doesn't contain the source information in full, it only mentions it and provides a link. It does add some text on top of that **but that is not additional reporting**. It is also an unsubstantiated rumor. This post is currently 5 hours old and is on the top of r/Hardware (in default 'Hot' view). It got 171 comments. It creates engagement, rightfully so with regard to what it says on the title. In reality, there is no substance. I can report this singular post, but there is an infestation. And as a community, we should demand higher quality standards for this sub from the moderators. We deserve it. --- I am not an active Redditor on this sub, but I frequently visit here, read people's opinions.",
        "comments": [
            {
                "raw_content": "I support a ban on their news articles, but I think their reviews should still be allowed.",
                "author": "InevitableSherbert36"
            },
            {
                "raw_content": "While we're at it, I really don't see the added value of those videocardz articles that just regurgitate some reddit post about someone's molten gpu. Just crosspost the original reddit post, because that article that got written in 5 minutes isn't adding any value.",
                "author": "Joezev98"
            },
            {
                "raw_content": "Ban Dylan Patel (semianalysis) while we're at it lmfao. 90% baseless speculation that derives clicks from this subreddit (not to mention that he literally started off by violating the self promotion rule, spamming his blog)",
                "author": "logosuwu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] The RTX 50 Disaster",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm at a loss to explain how Nvidia has screw up so badly in so many areas. - The 12VHPWR power connector causing fires. - GPUs with missing ROPs. - Stock shortages everywhere on a mature node. - Huge mark-ups. - I suppose that the disappointing performance is mostly due to Moore's Law. It's stuck on 4nm. - Driver problems and loss of Phys X fie older games. This is not a company that has never done a launch before. This is the type of problems that one would expect from a Kickstarter. Hopefully AMD, Intel, and in the long run, competition from China, will result in a breakage of this monopoly.",
                "author": "RandomCollection"
            },
            {
                "raw_content": "In a strange twist of fate, the last time Nvidia messed up this much probably was their previous 5000 series in 2003. It's a different set of problems, but really the last time it felt like they completely missed their market in the consumer space",
                "author": "Limited_Distractions"
            },
            {
                "raw_content": "MSRP = Missing Some ROPs Possibly",
                "author": "Savings_Set_8114"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia admits some early RTX 5080 cards are missing ROPs, too",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Next up: Missing 5060 rops",
                "author": "Violetmars"
            },
            {
                "raw_content": "Lmao. Aren't these tested? How do they and the board partners not realise the defect during the testing phase? How is it possible not to know about these issues?",
                "author": "glenn1812"
            },
            {
                "raw_content": "why didn't they just disable more stuff and down bin everything 1 tier lower? or save them for half tier lower ( super/ti ) and release them next cycle",
                "author": "mapletune"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CHIPS Act dies because employees are fired – NIST CHIPS people are probationary - Semiwiki",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "China just can’t stop winning, I guess.",
                "author": "Extra-Advisor7354"
            },
            {
                "raw_content": "\\> tariff semiconductors to try to get production onshored \\> kill program to onshore semiconductor production \\> 300_iq.png",
                "author": "chainbreaker1981"
            },
            {
                "raw_content": "The disbursement of funds allocated under the CHIPs Act is to be handled by the Department of Commerce, and specifically the NIST - which falls under the Department of Commerce - seemingly has some role to play in overseeing the disbursement of the funds. As a side note, if this means no future editions of the NIST Handbook of Mathematical Functions, it'll be a sad development.",
                "author": "basil_elton"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX 5070 Scores Maximum Of 2% Faster Than A 4070 Super In Blender",
        "score": 184,
        "text_content": "So, here we go again. A new benchmark has shown up on the **Blender Open Data** gpu page which shows the **RTX 5070** scoring around **2% faster than a 4070 Super** or **21% faster than the original 4070**. The **5070 scores 6163** compared to the **4070 Super scoring 6063** and the **4070 OG scoring 5112**. Of course, with the missing ROP issues that may be a bit lower on some cards. Time will tell and who knows what supply will be like. Stay safe out there my peeps. [https://opendata.blender.org/benchmarks/query/?compute\\_type=OPTIX&compute\\_type=CUDA&compute\\_type=HIP&compute\\_type=METAL&compute\\_type=ONEAPI&blender\\_version=4.3.0&group\\_by=device\\_name](https://opendata.blender.org/benchmarks/query/?compute_type=OPTIX&compute_type=CUDA&compute_type=HIP&compute_type=METAL&compute_type=ONEAPI&blender_version=4.3.0&group_by=device_name)",
        "comments": [
            {
                "raw_content": "But leather jacket man promised that 5070 will be as fast as the 4090",
                "author": "EasternBeyond"
            },
            {
                "raw_content": "If it performs the same as a 4070 super for $50 less (in theory), wouldn't it be better to just lower the price of the 4070 super? Are the 5070 cheaper to make? Ain't the newer vram more expensive?",
                "author": "conquer69"
            },
            {
                "raw_content": "They should rename this generation's cards to Stagnatron 50xx",
                "author": "RedTuesdayMusic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "All 50 States Have Now Introduced Right to Repair Legislation | The legislation hasn't yet passed everywhere, but all 50 states introducing some form of right to repair legislation is a \"tipping point” for the right to repair movement.",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it weren't for Louis Rossman, I wouldn't understand why this issue is so important. I would have no idea that farmers can be locked out of their equipment. Here's to hoping all of these pass.",
                "author": "Sea-Mix-133"
            },
            {
                "raw_content": "America has perfected the illusion of appearing like it's doing anything other than just straight robbing people of everything they have.",
                "author": "chmilz"
            },
            {
                "raw_content": "It's unsustainable to buy new computer or vehicle every time something breaks. Years ago, things were repaired like tv and radio were repaired even computers were repaired.",
                "author": "angrybirdseller"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leaked RTX 5070 benchmarks show mixed results against RTX 4070 Super, 18% slower than RTX 5070 Ti",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "18% slower than the full power 5070ti or the ones with missing ROPs",
                "author": "ebkbk"
            },
            {
                "raw_content": "The way performance is dropping with the lower tier options I don't see how Nvidia can bring a 5060 to market.",
                "author": "peruka"
            },
            {
                "raw_content": "Glad I got my 4070 Super a year ago. No need to upgrade at all.",
                "author": "ClassicRoc_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD 9800X3D 'failures/deaths' Reddit megathread indicates the vast majority may be happening on ASRock motherboards | ASRock and AMD are aware of the reports, but the cause remains unknown",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WTF is this bullshit reporting? Fucking Toms Hardware doesnt even link to the correct megathread > (https://www.reddit.com/r/ASRock/comments/1iui7lx/9800x3d_failuresdeaths_megathread/?sort=top) and then goes to claim there are more than 40 cases already even though most of the comments in that thread are just discussing the issue and not confirming a failure. I found less than 10 cases in the threads on the ASRock subreddit so far.",
                "author": "skyline385"
            },
            {
                "raw_content": "Damm, and the ASRock boards have been pretty popular because they don't lane split the GPU. EDIT: For x870E idk about other chipsets.",
                "author": "Deep90"
            },
            {
                "raw_content": "i had my 9800x3d fail on an asus mobo. I've now bought gigabyte one lol",
                "author": "CrookedToe_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "9to5Google: \"Google, Qualcomm will support 8 years of Android updates with latest chips\"",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn’t believe a fucking word Google says right now.",
                "author": "LickMyKnee"
            },
            {
                "raw_content": "You gotta be very naive to believe anything Google says .",
                "author": "PIKa-kNIGHT"
            },
            {
                "raw_content": "Fantastic! I'd really like to see flagship devices get to a full 10 years. So 8 years is good progress on that front.",
                "author": "Verite_Rendition"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Canceling my preorder",
        "score": 788,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll prove them wrong https://preview.redd.it/4kz2fsafx6le1.png?width=1536&format=png&auto=webp&s=b212c078cd2a1ab686a807fb88f04628e07e352e",
                "author": "GenderJuicy"
            },
            {
                "raw_content": "This is just a rumour. I'd wait until launch to be sure.",
                "author": "DionFW"
            },
            {
                "raw_content": "Then why do they have Italian mascots??",
                "author": "OldTacoPanda"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can we all just agree this one render concept was really overused and looks terrible",
        "score": 1828,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only part I don't mind that much is the UI which actually looks half decent. Literally everything else makes me want to remove my eyes with a spoon ![gif](giphy|yhLV2DGTLDRCw)",
                "author": "Thin_Corner6028"
            },
            {
                "raw_content": "Yup. Every generation of leaks has one.",
                "author": "PositionEven"
            },
            {
                "raw_content": "Honestly still don't understand the purpose of the sliding joycons",
                "author": "Sierra_656"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How did this guy get his switch 2?",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe he means \"fits my Nintendo Switch too well\".",
                "author": "nouvAnti2"
            },
            {
                "raw_content": "Probably he got one of the Chinese rip offs or is bluffing haha. I saw that on Ali there are some \"replicas\". I don't know if they took them down or not",
                "author": "ItsSyryus"
            },
            {
                "raw_content": "arent a lot of amazon reveiws fake?",
                "author": "Rose-Brick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"what do you mean I can't cook pizza on my switch 2?!'",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unacceptable, will not be buying!!!!!",
                "author": "Jaffs11"
            },
            {
                "raw_content": "What's the point in buying it at all then? At least the Nintendo Switch 1 came with flavoured game cards. Way to ruin a console before it's even launched!",
                "author": "briggles23"
            },
            {
                "raw_content": "This reminds me of the guy that got past sonys ninjas and sold a ps5 devkit by calling it a pizza warmer.",
                "author": "ah_shit_here_we_goo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How disapointing... I wanted to nuke the world!",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will it have a sell button so I can become the man who sold the world? ![gif](giphy|muNcDSuINVr1e)",
                "author": "Icy_Ad620"
            },
            {
                "raw_content": "See? Switch 2 IS worse than Switch 1!",
                "author": "that_one_3DS_fan"
            },
            {
                "raw_content": "The conduit",
                "author": "Emergency-Coast-5333"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Job mentioning sw2",
        "score": 64,
        "text_content": "No other substance needed",
        "comments": [
            {
                "raw_content": "Nice",
                "author": "Horse_3018"
            },
            {
                "raw_content": "Smart. This way people don’t pikachu face when they buy one and find out a new one is coming a few months away",
                "author": "WonderGoesReddit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 color option",
        "score": 37,
        "text_content": "Can we get a old school NES color option?",
        "comments": [
            {
                "raw_content": "They should do a Famicom and Super Famicom version first.",
                "author": "ratsratsgetem"
            },
            {
                "raw_content": "I'm sorry but those colors look ugly, i'd rather have a gamecube type blueish/purplish",
                "author": "AnnualSudden3805"
            },
            {
                "raw_content": "within a week of the Switch 2 launch someone will have custom NES joycons up on etsy, and every other console color scheme for that matter",
                "author": "boopladee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 releasing in June would make it the first Nintendo console since the N64 to release very close to Summer",
        "score": 95,
        "text_content": "Not counting the main Handhelds (even tho Switch 2 is a Hybrid console (JUST INDULGE ME FOR A SEC!!)) The Switch 2 releasing In June would make it the first Nintendo Console to release around June Since Nintendo 64 (In Japan)",
        "comments": [
            {
                "raw_content": "The first since N64 to release “very close to summer” ☠️ y’all will turn literally anything into a milestone",
                "author": "ElectricBoogaloo_"
            },
            {
                "raw_content": "I think a summer realise is the perfect time for the console to launch, the vibe is just so perfect during that time it's great for a new console realese",
                "author": "Dry-Direction-8838"
            },
            {
                "raw_content": "I don't understand why anyone thinks it would be a fall release at this point considering there's people who literally have retail units right now. The switch 2 will be here no layer than July. June is my bet",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wizards of the Coast has reportedly cancelled Skeleton Key's in-development AAA horror project",
        "score": 261,
        "text_content": "Source: https://i.imgur.com/giZo6S3.jpeg The studio was opened in 2022 with Christian Dailey as the VP and Head of Studio (he previously worked on Dragon Age and Anthem): https://company.wizards.com/en/news/wizards-of-the-coast-announces-new-studio-skeleton-key",
        "comments": [
            {
                "raw_content": "Apparently the game was so scary people went AAA",
                "author": "Complex-Quote-5156"
            },
            {
                "raw_content": "Imagine a horror game but set in the medieval times of witches, monsters & possessions. With only really swords, axes & bows for protection, having people in the towns / villages & surrounding area being taken by monsters, possessed & manipulated by the promise of dark magic power from cults & rituals. You are just someone caught up in it trying to survive",
                "author": "Gamer4life101"
            },
            {
                "raw_content": "What a fuckin mess",
                "author": "swagomon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel and Samsung Display cooperate to advance next-gen AI PCs into 'unchartered territory'",
        "score": 57,
        "text_content": "Thoughts?",
        "comments": [
            {
                "raw_content": "Wtf is a display tailored for AI",
                "author": "AnEagleisnotme"
            },
            {
                "raw_content": "> Intel and Samsung Display have signed a memorandum of understanding (MOU) to develop displays tailored for AI devices, such as AI PCs, reports [ZDNet Korea](https://www.koreatimes.co.kr/www/tech/2025/02/419_392818.html). With this collaboration, Intel might enhance its mobile platforms with better displays tailored for capabilities of its GPUs. Samsung, on the other hand, might secure additional presence on the market of premium laptops.",
                "author": "wademcgillis"
            },
            {
                "raw_content": "I'm not gonna buy any product with AI shoved into its name",
                "author": "caelunshun"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel launches \"Value Pack\" boxes for Core i5-14400F/14600F CPUs in South Korea",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish all gpu came with value pack, I really don't care about the package of the cpu.",
                "author": "ResponsibleTruck4717"
            },
            {
                "raw_content": "Intel, launch \"Value Pack\" with Arc GPUs",
                "author": "reps_up"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Gigabyte RX 9070 XT Gaming OC reportedly boost up to 3.24 GHz during Linux benchmark",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "i remember reading that RDNA3 was supposed to boost to over 3ghz but they dialed it back due to some unexpected issues with the design. Maybe what we're seeing now is not just RDNA3->RDNA4 improvements, but a lot of the performance we *should* have seen with the previous generation.",
                "author": "danielge78"
            },
            {
                "raw_content": "Ok but how much?",
                "author": "Adjudikated"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD preparing Fluid Motion Frames 2.1 (AFMF) - VideoCardz.com",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "not really a rumor at this point. have it since january https://i.redd.it/4gea9milx6le1.gif",
                "author": "TheBloodNinja"
            },
            {
                "raw_content": "I hope this stuff can make its way to Linux / Steam Deck eventually.",
                "author": "___Bel___"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "24 February 2025 - Daily /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "while you steeple your fingers and sit in a dark room waiting for the pop... Are people preparing for the desired pop and are ready, today, to buy? ex. stalk Zillow, know the neighborhood, what you want to pay per square foot, save down payment & sorted out credit issues.",
                "author": "Awedidthathurt"
            },
            {
                "raw_content": "“Look for people who have lots of great questions. Smart people are the ones who ask the most thoughtful questions, as opposed to thinking they have all the answers. Great questions are a much better indicator of future success than great answers.” - Ray Dalio",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "I think we all knew this was happening, but now there's proof: https://www.tampabay.com/news/florida-politics/2025/02/22/florida-insurance-profits-desantis-regulation-investors-crisis/ >While Florida [home] insurers claimed to be losing money in the wake of hurricanes Irma and Michael, their parent companies and affiliates were making billions of dollars, according to a study obtained by the Times/Herald. > >The start of the state’s insurance market meltdown came on the heels of those two storms between 2017 and 2019, as companies justified big rate increases to cover their losses. >... >Profits of insurance companies are limited by regulators to about 4.5% — hardly enticing to investors, considering the risk of hurricanes. However, insurance executives in Florida have used financial workarounds to reward investors and themselves. > >While the profits and executive compensation of the insurance company are capped, the profits of affiliate and parent companies are not. So executives create sister companies that charge the insurance company for basic services, such as claims handling, underwriting, accounting and issuing policies. (Large national insurers typically handle all of those services internally.) > >Arrangements between insurance companies and affiliates must be approved by the state, and regulations say they must be “fair and reasonable,” which isn’t defined in state law. > >Company structures can appear like a spiderweb of entities. When FedNat Insurance went insolvent in 2022, it was one of nine corporations under a parent company. > >When Southern Fidelity Insurance dissolved that year, it was one of six companies under the same umbrella, and its holdings included a hunting lodge maintained at a cost of $485,000 per year. State officials were investigating whether the company “took active measures to conceal these costs” from regulators, according to an October insolvency report. > >Most insurers in Florida have similar arrangements, which are enormously lucrative for some executives who were the highest-paid in the nation in some years. > >But this type of setup can be easily abused and requires greater regulatory scrutiny, according to the National Association of Insurance Commissioners. > >That’s because the owner of the insurance company also owns the affiliates, creating an incentive for executives to overcharge the insurance company for services. > >Such abuses have been repeatedly found by state officials as the reason why companies go insolvent. In one 2009 insolvency, auditors wrote that executives were “stripping the company of cash” as it was going out of business. The ratings agency AM Best last year found that affiliate relationships were the third-leading cause of insolvencies nationwide between 2000 and 2022, after catastrophe losses and fraud, Insurance Journal reported.",
                "author": "Judge_Wapner"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "‘I feel trapped’: how home ownership has become a nightmare for many Americans | US news",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This one sounds exaggerated or something is way off. > “I’ve come to view home ownership and healthcare as destabilizing forces in my life,” said Bernie, a 45-year-old network engineer from Minneapolis. To finance owning his and his wife’s $300,000 home and saving for the future, the couple was foregoing medical and dental treatment of any kind and cutting back on expenses everywhere, he said, despite a pre-tax household income of more than $250,000. Unless they only started making $250k the year they bought the house, you shouldn't be foregoing medical care. $300k home w/ zero down should still be under a $3k/mon payment before taxes. They gross over $20k/mon.",
                "author": "mishap1"
            },
            {
                "raw_content": "Yeah, this story is ridiculous. If you have a household income of $250k, there is no reason you can’t afford regular medical and dental care. Sounds like people living about their means.",
                "author": "Tennessee1977"
            },
            {
                "raw_content": "I can definitely relate. My mortgage insurance, property taxes, and HOA fees all increased while I was already struggling to keep up with inflation on necessities like food and other essentials. Altogether, my monthly payment went up by $1,200. I lost my tech job last March, and I don’t have health insurance because I made too much last year to qualify for state coverage, while COBRA would have cost me $900 a month—something I simply can’t afford. That’s why I’m downsizing into an apartment. The cost of living has become outrageous & I can’t wait to sell my house.",
                "author": "Unusual_Specialist"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bitcoin HELOC being launched via Figure Markets: Leveraging Home Equity to Buy Bitcoin",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What could go wrong?",
                "author": "ScooterWorm"
            },
            {
                "raw_content": "All the morons trying to secretly \"win\" back all the money they have lost on crypto, through new crypto investments, are about to lose their houses too. This is some real risky shit.",
                "author": "ThatGap368"
            },
            {
                "raw_content": "OK, that might signal the top. LOL. WOW!!!!!",
                "author": "sofa_king_weetawded"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Orlando housing market sees highest inventory since 2010",
        "score": 235,
        "text_content": "https://www.wesh.com/article/orlando-housing-market-highest-inventory/63875521 The great news is that the Orlando area has seen the highest supply of homes since 2010. \"Inventory for January 2025 was recorded at 11,697,\" according to the Orlando Regional Realtor Association. \"We are now at a seven months supply, and we haven't seen inventory like this since pre-pandemic. We're in a healthy, stable market, and so it's good news,\" Kemp said.",
        "comments": [
            {
                "raw_content": "Padme: it will result in cheaper housing right?? Anakin: 😐 Padme: right??",
                "author": "Mlabonte21"
            },
            {
                "raw_content": "> \"Great time for buyers, great time for sellers,\" said Rose Kemp. > >Kemp is the past president of the Orlando Regional Realtor Association. Always look on the bright side of life.",
                "author": "KenBalbari"
            },
            {
                "raw_content": "Checks home prices. Still about 200,000$ more than they should be.",
                "author": "This_Entrance6629"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Relief Fuels Higher Housing Prices",
        "score": 32,
        "text_content": "https://www.wsj.com/opinion/bidens-mortgage-relief-fuels-higher-housing-prices-policy-loans-risk-cb0a1974?st=uS4sfN&reflink=mobilewebshare_permalink",
        "comments": [
            {
                "raw_content": "I cannot find the legislation this opinion piece is referring to",
                "author": "sarky-litso"
            },
            {
                "raw_content": "64% of FHA borrowers exceeded the 43% DTI threshold last year? Yikes.",
                "author": "alienofwar"
            },
            {
                "raw_content": "Pre 2008 most high risk loans were Sub Prime loans. FHA loans didn’t become popular till after the mortgage crisis and sub prime banks went away. Pretty logical that these are defaulting at a higher rate than 07 actually",
                "author": "leibooc"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fannie Mae Lowers Housing Market Forecast and Projections for 2025",
        "score": 90,
        "text_content": "https://www.noradarealestate.com/blog/fannie-mae-cuts-down-housing-forecast-and-projections-for-2025/",
        "comments": [
            {
                "raw_content": "I love how the forecasts were so bullish by the end of 2024 when sales were dropping. “We will have 5% rates in 2025 and continued price growth!”..was this to get people who were getting in contracts to buy out of fear? As each month goes in 2025, they are dialing back forecasts",
                "author": "LegalDragonfruit1506"
            },
            {
                "raw_content": "So basically inflation causing rates to stay high into 2026, but they say they expect inflation to continue coming down over the next years. So what would keep rates in the middle 6’s? Is it just pricing in government borrowing and a default possibility causing rates to be high?",
                "author": "Kali-Lionbrine"
            },
            {
                "raw_content": "Fannie Mae out here joining the doomer brigade.",
                "author": "Dry-Mention1303"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Holy SH*T they cooked. Claude 3.7 coded this game one-shot, 3200 lines of code",
        "score": 1511,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not even a joke, I just tried it in cursor... It added 15+ files, flawlessly, and they look _good_. It basically feels like it doubled in breadth of content it can handle in one go, and 1.3x'd quality on the low end.",
                "author": "TFenrir"
            },
            {
                "raw_content": "Yeah claude 3.7 is actually insane in coding right now",
                "author": "THE--GRINCH"
            },
            {
                "raw_content": "What kind of token limits are we looking at, input and output? Trying the free version.",
                "author": "Deciheximal144"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Code was my “Feel the AGI” moment",
        "score": 228,
        "text_content": "I’ve thrown bugs at this thing that no other models could get even after multiple tries and Claude Code/3.7 blasted through them. Granted, some of these were $0.30-$0.50 a pop to solve…but this level of engineering intelligence is so hard to believe is real. It’s almost like programming language doesn’t exist and plain old English is now good enough to truly create amazing things. What a time to be alive. Truly.",
        "comments": [
            {
                "raw_content": "3.7 just slapped out an entire project I was working on for months (stop and start amateur project; final implementation would like be around 5000 lines of code) from scratch. It kept hitting the output limit but telling it “continue” would let it keep going and like… it finished the project (again, I made it start fresh), made a front end without me even asking, then provided an example JSON to run inside the project for debugging purposes. I’ll update later how many lines of code it just wrote as it is getting late for me but JESUS. Home boy did not stop trucking until the job was done- I agree, true “feel the AGI” moment.",
                "author": "RedditIsTrashjkl"
            },
            {
                "raw_content": "I had a similar experience today. I mentioned this in another post, but I was trying to build something relatively minor for work myself that we’ve been needing for a while and our third party vendor was failing to provide (I don’t know how to code beyond the most basic of things, so I wanted to see what I could do using AI). Claude 3.5 was failing at one of the objectives I had, as was o3-mini-high. I was going back and forth between the two trying to get it to work and it was just falling apart in the process. I got it to work with a single prompt in Claude 3.7. I’ve been building it out a bit since then, but the core functionality that I just could not get to work before today just popped out like some sort miracle. Also, this is personal taste, but I just like its personality more than o3-mini-high. I always feel like o3 wants me to do all the work and is annoyed by prompts.",
                "author": "AdAnnual5736"
            },
            {
                "raw_content": "Imo this isn't feel the AGI, it's feel the ASI. Not superintelligence, but specialised intelligence. Claude is highly specialised in coding and logic. Its not amazing at a bunch of things, but if its coding and logic based tasks, its worlds ahead of anything. Obviously a general intelligence that is that good at everything would be fantastic, but we shouldn't be sacrificing great progress for perfection, and Claude is a great example of that.",
                "author": "TheInkySquids"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic’s Claude Code Is Accelerating Software Development Like Never Before",
        "score": 604,
        "text_content": "Anthropic has identified that Coding is their biggest strength, and have now released an agentic coding system that [you can use right now.](https://docs.anthropic.com/en/docs/agents-and-tools/claude-code/overview) This is huge, guys. Not only is Sonnet 3.7 significantly better at coding, but Claude Code addresses most of the major pain points related to using LLMs while coding (understanding codebase context, quickly making changes, focusing on key snippets rather than writing entire files.. etc.). Basically, the entire coding process just got a whole lot easier, a whole lot faster, and a lot more accessible. Anthropic already says that 45 minute manual work is now being done in seconds and minutes. Now, scale those time savings to almost every software developer in the world.. This has serious implications for the development of software, and the development of AI, and today we are witnessing a serious acceleration of technological development, and I think that is awesome.",
        "comments": [
            {
                "raw_content": "yeah this is a big deal - bigger than the reddit reaction seems to imply. OpenAI will have to follow quickly - presumably Operator will get this soon but with a UI instead of just command line. not that it matters, I'm sure there are a bunch of devs frantically writing wrappers for Claude Code as we speak anyway. but this is the start of true sw dev automation.",
                "author": "space_monster"
            },
            {
                "raw_content": "I've been playing around with it at work today (We have Claude Pro licenses through work, so we can share our codebase with Anthropic) and it's actually quite good! Our codebase is massive, so I'm only working in a specific folder and not allowing it to ingest the full app, and it's still pretty helpful. It's able to find relevant files it needs to understand a particular feature without issue. The CLI is a pretty great experience as well!",
                "author": "meenie"
            },
            {
                "raw_content": "What is the difference between claude code and cline? It seems like cline would be better since it's integrated into the GUI already",
                "author": "Elctsuptb"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sonnet 3.7-thinking wins against o1 and o3 on LiveBench",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This means it’s now time for OAI to drop, buckle up.",
                "author": "Fit-Avocado-342"
            },
            {
                "raw_content": "This is really cool, but OpenAI still definitely has a secret sauce, and this only proves that point. o1 and o3 are both based on GPT-4o as the base model (which I talk about more at the end—why this is true). This is pretty much confirmed by OpenAI themselves, as well as common sense. The GPT-4o they could have made o1 and o3 on is probably the 0806 version since the newer ones are too new. So, the jump between GPT-4o and o1 is **20.34 points** on LiveBench, which is INSANE. For reference, the jump between DeepSeek-V3 (the base model R1 uses) and R1 is only **11.12 points**; the jump between Claude 3.7 Sonnet and the reasoning version is only **10.54 points**; and the difference between Gemini 2 Flash and the reasoning version is only **5.45 points**. We can clearly see that the differences in performance between base models and reasoning models vary widely between different companies. Google's implementation only gets them +5 points, whereas DeepSeek and Anthropic both get roughly +10 points, and OpenAI is getting over +20 points with just o1. Full o3, which is also based on 4o, isn't even on LiveBench yet, but it's safe to assume it would be pushing the mid-80s at least. That's like +30 points on LiveBench over GPT-4o just from OpenAI's reasoning framework applied to a shitty model like GPT-4o (I'm not an OpenAI fan either—I see this as pretty obvious truths). GPT-4.5 is coming out very soon, and they will probably make the next o-model/GPT model (since they're fused now) with GPT-4.5 as the base model. If it gets even close to the same gains as o3 does, then that would put them thoroughly ahead. Now, the only possible flaw in this logic is assuming o1 and o3 are based on GPT-4o since OpenAI *technicallllllly* never confirmed this explicitly by saying outright, \"Ya, o3 is based on GPT-4o.\" But the overwhelming evidence suggests this, including official OpenAI statements. For example, they called o1 \"GPT-4o with reasoning,\" and they did explicitly say o3 was just o1 with further RL applied and wasn't actually a different model. They also have the same tokenizers, knowledge cutoffs, and token limits. Also, it just wouldn't make any sense for them not to release the base model they made o1 with, and we know it can't have used GPT-4.5 since o1 dates back to way before September last year, and 4.5 was definitely not finished all the way back then.",
                "author": "pigeon57434"
            },
            {
                "raw_content": "Er, o3-mini. Pretend I wrote the right model name.",
                "author": "DeadGirlDreaming"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 3.7 Sonnet progress playing Pokémon",
        "score": 661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The benchmarks we deserve",
                "author": "axseem"
            },
            {
                "raw_content": "Put it on twitch (or youtube) and livestream it. Please",
                "author": "gartoks"
            },
            {
                "raw_content": "This would be so cool to see footage of",
                "author": "BlackExcellence19"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 3.7 sonnet has officially released",
        "score": 734,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/k345uw9ct4le1.jpeg?width=750&format=pjpg&auto=webp&s=9b9389f94d42ed2c89629ffab7687d8481b103cf It improved on my christmas three benchmark",
                "author": "Kathane37"
            },
            {
                "raw_content": "Same pricing and context as 3.5 https://preview.redd.it/dz2cimluu4le1.png?width=2930&format=png&auto=webp&s=385e41fba5fe6f58a42dda77aa67f9161ba79902",
                "author": "BaysQuorv"
            },
            {
                "raw_content": "Has anyone noticed Sonnet 3.7 getting dumber lately?",
                "author": "Sycosplat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 3.7 Sonnet can generate manim code. Here's a visualization of spacetime curvature. There was one error that it fixed by itself, so took two prompts.",
        "score": 217,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is pretty impressive",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "https://i.imgur.com/rwjs0Xw.png this was the prompt",
                "author": "zebleck"
            },
            {
                "raw_content": "Do you have 3.7 sonnet thinking? I want to know if it can pass my lyrics benchmark, so far only o1 and o3 can do this consistently-ish no other thinking models can do it. compose a song with 11 syllables per line, using an AABB rhyme scheme. Label the verses like this: '[Verse 1]', '[Verse 2]'. Make 3 verses, each containing 4 lines",
                "author": "GraceToSentience"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing DeepSeek-R1 optimizations for Blackwell, delivering 25x more revenue at 20x lower cost per token, compared with NVIDIA H100 just four weeks ago.",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how this compares efficiency-wise with Groq and Cerebras",
                "author": "Its_not_a_tumor"
            },
            {
                "raw_content": "This needs real benchmarks, not MMLU. For LLama there was hubbub about using FP8 but then it turned out that greatly damaged long context and reasoning capabilities, and now everyone serious uses BF16.",
                "author": "sdmat"
            },
            {
                "raw_content": "The rate at which I save threads for later is accelerating",
                "author": "o5mfiHTNsH748KVq"
            }
        ],
        "subreddit": "singularity"
    }
]