[
    {
        "post_name": "Tom Homan just LIT A FIRE under Bondi at the DOJ and says they need to STEP UP and start prosecuting these politicians who interfere!",
        "score": 900,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love Homan, but just can't even stand to hear Hannity.",
                "author": "AslanFan"
            },
            {
                "raw_content": "Bondi will respond with her own Fox News interview. Take that Homan. She will out interview you. No actual productive actions will be taken.",
                "author": "DefinitelyNotFed"
            },
            {
                "raw_content": "Please God, direct Homan's hand and prosecution towards Governor Healey and Mayor Wu of MA. My state needs an enema, badly.",
                "author": "LabTech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When It Comes to Texas Redistricting, the GOP's Silence Is Deafening",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s because they want to LOSE in the midterms so they “can’t” advance trumps populist agenda",
                "author": "GorillaTactics"
            },
            {
                "raw_content": "The GOP doesn’t want to gain seats. Not with Trump in office.",
                "author": "Yignuced"
            },
            {
                "raw_content": "republicans are likely to snatch defeat from the jaws of victory like they always do.",
                "author": "leakmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump signs executive order banning banks from de-banking Americans over their political or religious beliefs.",
        "score": 1792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. This covers his own supporters, as well as others.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Now do gun ownership. Credit cards charge ridiculous fees to gun stores due to \"high risk\" caused by their own hacktivist offspring.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Until a communist judge declares himself president",
                "author": "Lulzokbro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Secretary RFK Jr. announces HHS will now totally BAN both Medicaid and Medicare funds from going to hospitals and institutions who conduct transgender operations for minors. It's ENDING. Trans ideology will no longer be subsidized. Child mutilation will stop.",
        "score": 1899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God Bless Robert Kennedy Jnr. He is MAGAnificent and a life saver. His Dad and Uncle would be so proud of him!",
                "author": "TheAftermath"
            },
            {
                "raw_content": "I just cannot believe the depravity our society has accepted. Do they do it just for the money or will this crap happen anyway?",
                "author": "Grindelwald"
            },
            {
                "raw_content": "Gender affirming care. Sure sounds better than 'Delusion Pandering Mutilation' does it not?",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PROJECT VERITAS PART TWO: WHISTLEBLOWER: Bill Barr Held Secret Meetings to Plot Prosecutions of Trump and Block His Political Comeback (VIDEO)",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time to put Barr behind Bars. ⚖️",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I want that fat fuck crying into his bucket of gravy.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "So treason it is",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump's message to Big Balls: The Crime situation in Washington, just like our Southern Border where ZERO Illegals entered in the last three months, will be a safe place very soon. Thank you for your bravery and heart. Stay tuned!",
        "score": 1489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And thank you for your big balls",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Hope Edward does the ribbon cutting at President Trump's big, beautiful, ballroom. 🎀 ✂️",
                "author": "airborne3502"
            },
            {
                "raw_content": "I love that his name is Edward, which means “protector”",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIBERAL TRIGGER! Another Sydney Sweeney ad just dropped.",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sydney Sweeney has great scoops.",
                "author": "shadypollster"
            },
            {
                "raw_content": "I can't wait for the RAGE!",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Sir, a second Sydney Sweeney ad has hit the internet.",
                "author": "Wtf_socialismreally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🍆 Life, death, taxes, and ANOTHER dildo thrown onto the court during a WNBA game...",
        "score": 728,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The dildos will continue until skill improves.",
                "author": "BigDaddyBigTrump"
            },
            {
                "raw_content": "Doesn't really look like a dildo, but the video is pretty blurry. At any rate, it's clearly not a *green* dildo, so it doesn't count. Everybody needs to re-read the memo: We're doing *green* dildos. Gotta stick with the program!",
                "author": "Deplora"
            },
            {
                "raw_content": "How do they keep sneaking them in?! . . . Nevermind I figured it out",
                "author": "RedditStillSucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One decade ago, in Cleveland Ohio, a businessman changed American politics forever. Time truly flies.",
        "score": 844,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfect line!!",
                "author": "Mamapedia"
            },
            {
                "raw_content": "I can't believe it's been a decade. That's truly unbelievable. Our President still has that same energy. God Bless America.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"It's fun, it's kidding, we have a good time. What I say is *what I say.\"* It's called \"we do a little trolling\" 😎",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump posts the Daily Beast apology to Melania Trump",
        "score": 717,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry isn’t good enough, sue them out of existence.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "That's not even a real apology, it's like \"we're sorry you felt that way or didn't understand what we said\" not \"we're sorry for being the cocksucking faggots that you know we are\" which is more appropriate.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "This is the first instance I've read where Melania's \"Take It Down Act\" was used by Melania herself, pretty epic. The Beast article was about how Epstein introduced President Trump to Melania, which was totally false. It was taken down after around 4 hours after being contacted by Melania's lawyers.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "STOP IT!!!🤣🤣🤣 —NOT FUNNY!!!",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one is sexualizing WNBA players. lol.",
                "author": "MAGAdadUSA"
            },
            {
                "raw_content": "Hold on... wait a minute... let me get this straight... FLOPPING DICKS AND DILDOS in front of CHILDREN is celebrated but tossing one on the court at a bb game is SEXIST?? WTF? You feckless lefty cunt.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "No, the WNBA is the butt of the joke and the problem. Was waiting for that \"very special mic\" to slap her. Funny none the less.",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller on Washington, D.C.: \"It is more violent than Baghdad ... [POTUS] is going to do what's necessary to make sure our nation's capital is safe for all Americans.\"",
        "score": 1146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Won't mean a thing if the perpetrators are released quickly. That's the problem.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "I appreciate Stephen Miller every day.",
                "author": "Calumet57"
            },
            {
                "raw_content": "Start with Capitol Hill, it's home to the worst of them.",
                "author": "armyofpedes4usa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Video shows illegals in Colorado flee construction site during ICE operation One alien even hid under a grill cover for hours to avoid apprehension.",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get them all out. Fucking parasites. If they had the wherewithal they could make beautiful, prospering societies themselves and not have to leech off of ours. It's not like their countries lack the resources.",
                "author": "LiquidSun"
            },
            {
                "raw_content": "No wonder all the white men gave up working. The fucking Mexicans took all the jobs. Just how many of these illegal fuckers are in America?",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Let's be realistic. Even if ICE doesn't catch them all, they're still disrupting the work site. If the work isn't getting done, then the people hiring illegals aren't making money and the illegals aren't getting paid. Anyone hiring illegals needs jail time, but disrupting their business is still a good thing.",
                "author": "agave_lime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: WNBA Just Announced A New First Round Draft Pick...",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Missed opportunity. It’s their first round draft prick.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "It’s not easy being green.",
                "author": "XlDEN"
            },
            {
                "raw_content": "No Pepe, No!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🌴 California: Canyon Fire Spreading Fast near Santa Clarita, Simi Valley 🔥",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More Section 8 housing coming to a town near you.",
                "author": "MythArcana"
            },
            {
                "raw_content": "When California forests decide to take care of themselves.....",
                "author": "E-dantes"
            },
            {
                "raw_content": "quick, drain the reservoirs!",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grand Jury Indicts Man Who Threw Cinderblocks at Border Patrol Officer During LA Riots – Faces Up to 20 Years in Prison",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No. - Faces Firing Squad Start Getting Serious, Already.",
                "author": "DarthEP"
            },
            {
                "raw_content": "Execute this faggot.",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "FAFO",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. District Judge Kathleen Mary Williams has just halted the further construction of Alligator Alcatraz due to environmental concerns",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These activist judges just make shit up out of thin air... I have environmental concerns about people like this judge being a judge, lets impeach them!",
                "author": "Allister"
            },
            {
                "raw_content": "If anyone was curious, she is Barack Obama nominated...",
                "author": "Allister"
            },
            {
                "raw_content": "Throw her in the facility, .. she can examine her 'concerns' from close-up.",
                "author": "OGpsywar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 Reality Star Spencer Pratt Takes His Battle With Newsom, Bass over L.A. Fires to Washington D.C.: ‘Justice Is Coming’ 💸",
        "score": 1296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Say the line! Say it! > No standing.",
                "author": "TheMrStone"
            },
            {
                "raw_content": "This guy is a complete tool of a human being but if he can help bring down Newsom then so be it.",
                "author": "VoltronGreen1981"
            },
            {
                "raw_content": "go bro!",
                "author": "highlandparker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 A FEDERAL JUDGE in Texas just ruled that BlackRock, Vanguard, & State Street CAN BE SUED for forming an INVESTMENT CARTEL to CONTROL U.S. ENERGY MARKETS.",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do the Housing market.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "If you're gonna sue em, give em the Alex Jones treatment because what they did made them more money than any judgment levied against em.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Now do them being sued for BUYING UP ALL THE HOUSING!!!",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Yorkers latching on to new breast milk-flavored ice cream in Brooklyn",
        "score": 733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "new york city was a mistake",
                "author": "ecto_coolest"
            },
            {
                "raw_content": "Sick fucks. Brooklyn is the new Babylon. Babylon Milk. Urgh.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "Disgusting that someone would even market a product in that way.",
                "author": "mateus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel’s CEO, Under Attack From Trump, Is Already at Odds With His Board",
        "score": 77,
        "text_content": "Non-paywall link: [https://archive.is/20250808033847/https://www.wsj.com/tech/intel-ceo-lip-bu-tan-trump-board-9cc08631](https://archive.is/20250808033847/https://www.wsj.com/tech/intel-ceo-lip-bu-tan-trump-board-9cc08631)",
        "comments": [
            {
                "raw_content": "Not a fan of Tan but this stinks of backseat managing. If this Yeary guy has so many grand plans, then why don't he be the CEO in the first place, considering he's already the chairman.",
                "author": "267aa37673a9fa659490"
            },
            {
                "raw_content": ">The honeymoon period didn’t last long. Almost immediately, Tan and Intel board chairman Frank Yeary disagreed about whether Intel should remain in the business of making chips for itself and its clients or exit manufacturing, the people said. >... >Yeary, a former investment banker, had drawn up a plan for Intel to exit from the foundry business entirely earlier this year when acting as interim executive chair. Yeary’s proposal involved spinning out the business and having other companies such as Nvidia and Amazon take stakes in it, the people said. Yeary also explored brokering a sale of the business to Taiwan’s TSMC, the people said, but that effort went nowhere. >Tan, on the other hand, has argued that Intel’s foundry business is integral to its success and needed to ensure the U.S. doesn’t become reliant on foreign semiconductor companies such as TSMC and Samsung, the people said. (While TSMC and Samsung have committed to building more plants in the U.S., critics say their research and development efforts are still centralized elsewhere.) >More recently, Intel had lined up a handful of Wall Street investment banks to facilitate a multibillion-dollar capital raise, with the aim of using the money to invest in its fabrication plants and bolster the company’s balance sheet, the people said. >Management hoped to kick off the efforts around the company’s most recent quarterly earnings report in late July. But some board members, including Yeary, wanted to move on a slower timeline than Tan and pushed it back, possibly to 2026, the people said. >Intel had also been exploring a potential acquisition of an AI business, the people said. Proponents of the deal, including Tan, saw it as an opportunity for the company to catch up to rivals such as Nvidia and AMD, which are much further ahead in AI. But the board took its time deliberating the potential deal, and another publicly traded technology company appears poised to buy the target instead, the people said. >... >Another challenge for Tan is the fact that his predecessor, Pat Gelsinger, had been forging a relationship with Vice President JD Vance before he stepped down, a person familiar with the matter said.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Intel without the Fabs completely defeats the purpose of Intel itself. What does it do these days are materially better than it's competitors? I can't think of many. The idea of selling the fabs off and everything will be rosy and revitalize Intel again is straight out of cloud cuckoo land stuff. It's not a surprise a former investment banker completely fail to grasp it.",
                "author": "Nekrosmas"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tesla disbands Dojo supercomputer team, Bloomberg News reports",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This coming half a day after rumors of intel and samsung winning packaging orders for dojo.",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "> The team recently lost about 20 workers to newly formed DensityAI, and the remaining Dojo workers are being reassigned to other data center and compute projects within Tesla, the report said. > Reuters could not independently verify the report. Too much uncertainty to really make any judgement calls here.",
                "author": "SmileyBMM"
            },
            {
                "raw_content": "Since Bloomberg is soft-paywalled, here's the original in full [Archive.is-[Link](https://archive.is/H8Q0A#selection-1763.0-1766.0)] … > ### Tesla Disbands Dojo Supercomputer Team in Blow to AI Effort > * Tesla Inc. is disbanding its Dojo supercomputer team and its leader, Peter Bannon, will depart the company, according to people familiar with the matter. > * The team has lost workers to DensityAI, and remaining Dojo workers are being reassigned to other data center and compute projects within Tesla, the people said. > * Tesla plans to increase its reliance on external technology partners, including Nvidia Corp. and Advanced Micro Devices Inc. for compute, and Samsung Electronics Co. for chip manufacturing, the people said. > Tesla Inc. is disbanding its Dojo supercomputer team and its leader will depart the company, according to people familiar with the matter, upending the automaker’s effort to develop in-house chips for driverless technology. > Peter Bannon, who was heading up Dojo, is leaving and Chief Executive Officer Elon Musk has ordered the effort to be shut down, according to the people, who asked not to be identified discussing internal matters. The team has lost about 20 workers recently to newly formed DensityAI, and remaining Dojo workers are being reassigned to other data center and compute projects within Tesla, the people said. > Tesla plans to increase its reliance on external technology partners, including Nvidia Corp. and Advanced Micro Devices Inc. for compute, and Samsung Electronics Co. for chip manufacturing, the people said. > Tesla, Musk and Bannon didn’t immediately respond to requests for comment. > The decision marks a major shift for a program years in the making, with Dojo once positioned as central to Tesla’s multibillion-dollar plan to gain computing muscle in the artificial intelligence race. > The Dojo system is a Tesla-designed supercomputer used to train the machine-learning models behind the electric-vehicle maker’s Autopilot and Full Self-Driving programs, as well as its Optimus humanoid robot. The computer takes in data captured by vehicles and rapidly processes it to improve the company’s algorithms. Analysts have said Dojo could be a key competitive advantage, with Morgan Stanley estimating in 2023 it could add $500 billion to Tesla’s value. > DensityAI, which is poised to come out of stealth soon, is working on chips, hardware and software that will power data centers for AI that are used in robotics, by AI agents and in automotive applications, among other sectors, Bloomberg reported this week. The company was founded by Ganesh Venkataramanan — the former head of Dojo — and ex-Tesla employees Bill Chang and Ben Floering. > Tesla’s shares extended postmarket declines after Bloomberg’s report, trading down less than 1% as of 5:29 p.m. in New York. > **Talent Drain** > Tesla has faced an exodus of key talent this year as it has grappled with rising competition, falling sales and a consumer backlash to Musk’s political activity. Milan Kovac, the head of engineering for Optimus, and David Lau, vice president of software engineering, departed earlier this year, while Bloomberg reported in June that longtime Musk confidant Omead Afshar had abruptly left. > The EV maker last month reached a $16.5 billion deal with Samsung to secure AI semiconductors through 2033. The plan is for an upcoming plant in Texas to produce Tesla’s next-generation AI6 chip, diversifying Tesla’s sourcing beyond leading chipmaker Taiwan Semiconductor Manufacturing Co. > Musk hinted at a strategic pivot during Tesla’s most-recent quarterly earnings call, suggesting future iterations of the company’s in-house technology could converge with that of its partners. “Thinking about Dojo 3 and the AI6 inference chip, it seems like intuitively, we want to try to find convergence there, where it’s basically the same chip,” Musk said on the July 23 call. > Tesla’s CEO last year acknowledged that the company might not pursue Dojo in perpetuity and instead lean more on external partners. > “We’re pursuing the dual path of Nvidia and Dojo,” Musk said in January 2024. “But I would think of Dojo as a long shot. It’s a long shot worth taking because the payoff is potentially very high.” > *(Updates with postmarket share move, Musk 2024 comment starting in the eighth paragraph.)*",
                "author": "Helpdesk_Guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Trump calls on 'highly conflicted' Intel CEO to resign over China ties",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is insane outside instability caused by your domestic government for a company in the middle of a major restructure. The guys been CEO only since March. If he gets sacked 4 months into the job to not end up making an enemy of your countries president, who with backbone and appropriate job history would want this job. I imagine a successor being a relative unproven wildcard to steer the leaking ship. Ridiculous. The layoffs are one thing but this, you can't have much confidence in the present vision for the company and the previous vision already had its CEO replaced with the person hired in March",
                "author": "noonetoldmeismelled"
            },
            {
                "raw_content": "> \"This all boils down to Lip Bu's past involvement and investment in Chinese semiconductors, which is also what makes him so valuable as (Intel's) CEO\" Famous last words",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Battlefield 6 Open Beta Benchmark: 9800X3D vs. 9700X vs. 265K",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kinda wild that the graphics on low seem to be basically on par with BF1 on Ultra. Maybe Dice should add an \"Ultra Low\" setting.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Pretty happy with the game’s performance. I’m on a 9900K and 7800XT. No upscaling, textures to high and everything else to low nets me between 120-160 FPS at 1440p 240Hz.",
                "author": "lorem_ipsum_aenean"
            },
            {
                "raw_content": "Optimization seems pretty good across the board. Idk why the OP of the other large thread on front page right now didn't just wait for a bit more data but i can probably guess why from these comments: >As expected, that alleged \"rumor\" coming from some streamer who claimed 9800X3D was somehow 33% faster than 14900K seems, which has been spread by numerous media outlets, seems to be total BS. >265K after mild OC of fabric clocks and with properly tuned DDR5 M-die kits can catch even 9800X3D in gaming. It's a beast, but sadly it's overly constrained at stock.",
                "author": "Comprehensive_Ad8006"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Early BF6 Beta CPU performance test: 9950X3D just 3% faster than 285K and 10700K faster than 5800X3D",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Historically, the Frostbite Engine never really cared too much about a huge L3 cache, so I was skeptical about the whole '+30% X3D uplift' to begin with.",
                "author": "nhc150"
            },
            {
                "raw_content": "They got a 50% perf upgrade going from the 10600k to 10700k ? That's a wild uplift, more than the 33% core and cache difference.",
                "author": "Pamani_"
            },
            {
                "raw_content": "Oh nice, that would be fantastic news if the new game scales so well across multiple cores! I hope this becomes more of a trend.",
                "author": "SomeoneBritish"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Our commitment to advancing U.S. national and economic security",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel Statement, 8/7/2025 \"Intel, the Board of Directors, and Lip-Bu Tan are deeply committed to advancing U.S. national and economic security interests and are making significant investments aligned with the President's America First agenda. Intel has been manufacturing in America for 56 years. We are continuing to invest billions of dollars in domestic semiconductor R&D and manufacturing, including our new fab in Arizona that will run the most advanced manufacturing process technology in the country, and are the only company investing in leading logic process node development in the U.S. We look forward to our continued engagement with the Administration\"",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "LBT statement: https://newsroom.intel.com/corporate/my-commitment-to-you-and-our-company",
                "author": "1mVeryH4ppy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Texas Instruments Reportedly Launches Largest-Ever China Price Hike: 60K Products Up 10%–30% | TrendForce",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] DF Direct Special: Digital Foundry Leaves IGN, Now Fully Independent - So What Happens Next?",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They talk about other channels creating click bait thumbnails, and stuff like that to get views. What I find funny is that I can always recognize a DF video from the font type they use in their thumbnails alone. There is one other smaller YouTube channel that I saw stealing it, and they're getting views from it. Or at least from me, because I always mistake their thumbnail for DF content.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "DF was part of IGN? Oh, an investment from an org that was then recently acquired by IGN.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "So happy for them and I wish them the very best. One of the best content creators regarding gaming for sure.",
                "author": "PatchNoteReader"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ArsTechnica Review: Framework Desktop is a mash-up of a regular desktop PC and the Mac Studio",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: The good Solid all-round performance and good power efficiency. The Radeon 8060S is exceptionally good for an integrated GPU, delivering much better performance than you can get in something like the Ryzen 7 8700G. Large pool of RAM available to the GPU could be good for machine learning and AI workloads. Thoughtfully designed interior that's easy to put together. Uses standard-shaped motherboard, fan headers, power supply, and connectors, unlike lots of pre-built mini PCs. Front tiles are fun. The bad Power limits keep the 16-core CPU from running as fast as the socketed desktop version. A $300-to-$400 dedicated GPU will still beat the Radeon RX 8060S. Cheap-looking exterior plastic panels. The ugly Soldered RAM in a desktop system.",
                "author": "Antonis_32"
            },
            {
                "raw_content": "By the way 1% lows seem quite bad despite good averages. Maybe VRAM bandwidth or power budget (cpu+gpu) hitting a wall?",
                "author": "hannopal"
            },
            {
                "raw_content": "This is such a weird chip in general. The whole reason to put up with the soldered RAM is the fact in turn you're support to get higher capacities with multiple channels to offer more bandwidth for local inferencing. But the bandwidth on this chip is not particularly amazing and it caps out at 128 GB. For inferencing assuming you want a power efficient compact device (so stacking used GPUs isn't your thing), paying the Apple tax to get a 128 MBP or a Studio with up to 512 GB is more attractive. More bandwidth and more capacity. The 395+ could be competitive here if you could get a 196 or 256 variant which would open up running higher quant 120B models at larger contexts, but at \"just\" 128, I'd rather just go with a new or refurb MBP since the MBP also has more bandwidth. If you're trying to train, you probably want more RAM than 128 GB so even though this has a decent amount of compute units, the RAM isn't there. If you want to game, 128 GB is just plain overkill. Plus you know just get regular desktop class hardware where you can upgrade the GPU and CPU independently in the future.",
                "author": "weng_bay"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo just filed patents for a crank and wheel joycon accessory",
        "score": 1579,
        "text_content": "via Nintendo Patent Watch: https://bsky.app/profile/ninpatentswatch.bsky.social/post/3lvtbv7atlk2l",
        "comments": [
            {
                "raw_content": "fishing?",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "Switch sports fishing?",
                "author": "Simplejack615"
            },
            {
                "raw_content": "Legend of Zelda: Fishing. Pretty please?",
                "author": "frenix5"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Since the Switch 2 launch, I’ve played 16 games in 2 months.",
        "score": 747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finishing both BOTW and TOTK within 2 months is an achievement in itself",
                "author": "Complete_Bad6937"
            },
            {
                "raw_content": "unemployed final boss",
                "author": "Cavalier__"
            },
            {
                "raw_content": "I'm surprised you skipped Mario Kart.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After a month of working and saving g up money, I finally got one.",
        "score": 485,
        "text_content": "Picking Waluigi as the first racer I'm playing as in this game.",
        "comments": [
            {
                "raw_content": "Working and saving are fundamentals for good living. Enjoy your well-earned awesome.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "Get Donkey Kong Bananza! It's so good.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "Enjoy!",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are your dream third-party ports?",
        "score": 60,
        "text_content": "So with the switch 2 being more powerful, third-party ports are WAY more of a discussion!! My absolute dream ports are the Kingdom Hearts series (native ports, not cloud version), Halo MCC, and Horizon",
        "comments": [
            {
                "raw_content": "There really was no reason for KH to not be native. It’s insane they went with cloud versions",
                "author": "redviperofdorn"
            },
            {
                "raw_content": "Halo MCC, with online would be so rad to pick up a game here and there. Cmon microsoft",
                "author": "Aggressive-Ad-2860"
            },
            {
                "raw_content": "Kingdom Hearts, Hi-Fi Rush, Metaphor Refantazio",
                "author": "Hyperdragoon17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Indie World Direct was pretty cool…",
        "score": 504,
        "text_content": "Look there was no Silksong or Hades II as most people expected however I was pleasantly surprised by the quality, look and feel of some of the games showcased and actually looking forward to playing MOST of them which is something I didn’t think I would say about an indie world direct. Looks like there are some real gems in there… Well Dweller, Neverway and Glaciered are the three I liked the look of the most. What do you guys think ?",
        "comments": [
            {
                "raw_content": "Mina and Neverway stood out for me, UFO 50 is a cool get as well!",
                "author": "Illustrious_Top_630"
            },
            {
                "raw_content": "Excited for Well Dweller, Ball x Pit, Caves of Qud and UFO 50! Quite a few others in there I'll end up getting too, I'm sure.",
                "author": "crocicorn"
            },
            {
                "raw_content": "Herdlings looks interesting, I might get it depending on switch 2 performance",
                "author": "froot_loop_dingus_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The playable games at Nintendo's booth at Gamescom have just been revealed.",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The playable games are: - Pokemon Legends Z-A - Metroid Prime 4 - EA Sports FC 26 - Hollow Knight: Silksong - Hades 2 - Borderlands 4 - Elden Ring: Tarnished Edition - Final Fantasy 7 Remake Intergrade - Cyberpunk 2077: Ultimate Edition",
                "author": "julesvr5"
            },
            {
                "raw_content": "silksong playable on the Nintendo Gamescom booth??",
                "author": "gui_galao"
            },
            {
                "raw_content": "Nintendo Games - Metroid Prime 4 - Pokemon Legends: ZA - DK Bananza - Mario Kart World - Mario Party: Jamboree (Switch 2 edition) Third-party - Silksong (seriously) - FC '26 - Hades 2 - Borderlands 4 - Elden Ring: Tarnished Edition - Final Fantasy 7: Remake Intergrade - Cyberpunk 2077",
                "author": "cloudlocke_OG"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finished the free demo for Mina the Hollower. Guys. Play it. probably gonna be my indie game of the year. It's Gameboy color/advance down to the core, it's difficult, and all sprites, sound design and music is true to the era it's trying to replicate. 120fps and perfect handheld",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This game rules. Such a delight. What a challenge even to put it down",
                "author": "Antique-Kitchen9027"
            },
            {
                "raw_content": "I’ve been waiting years for this game. The top down Zeldas from the days of old are some of my favorite games. I’m not playing the demo, cuz it’ll make the wait just that much more painful.",
                "author": "Kobalt_Dragon"
            },
            {
                "raw_content": "Play it? Buddy I funded it",
                "author": "Muddy_Ninja"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden 26 - Could be better but solid overall",
        "score": 111,
        "text_content": "Been playing early access for the last couple hours and just wanted to give everyone a general idea how the game runs . It seems to be at 40 fps both docked and handheld which isn’t ideal but it honestly feels really solid to play . Graphics are solid also and about what you would expect for a handheld ,nothing to write home about but also nothing negative to say . I’ve seen early reactions to be negative because it’s not running at 60 fps but I just wanted to let people know it’s a solid port overall although it could be better , and it’s still a very fun experience especially on the go .. also played an online head to head game and it ran perfectly fine .. Overall if you like madden or want football on the switch it’s still a lot of fun and it has all the features other consoles have. 8/10 port IMO I’m sure a patch to help performance a bit will be on the way too",
        "comments": [
            {
                "raw_content": "It’s legit not bad. The only issue I’m seeing is there is a slight hiccup when the game changes camera angles/scenes.",
                "author": "TheFearOfFear"
            },
            {
                "raw_content": "So many mixed messages on its performance so far",
                "author": "comengetitrmm"
            },
            {
                "raw_content": "I’m just glad Madden is coming to Switch 2. My newest console is PS4 and I want to get my kids the new switch. As long as the new sports games come to the system, I am fine",
                "author": "ghostboo77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Xbox is canceling Contraband, announced in 2021 from Avalanche Studios (Just Cause), after four years of radio silence, sources tell Bloomberg News",
        "score": 983,
        "text_content": "BREAKING: Xbox is canceling Contraband, announced in 2021 from Avalanche Studios (Just Cause), after four years of radio silence, sources tell Bloomberg News. This news arrives weeks after a mass layoff in which Xbox canceled several other big titles. [https://bsky.app/profile/jasonschreier.bsky.social/post/3lvt7g4p7fs2k](https://bsky.app/profile/jasonschreier.bsky.social/post/3lvt7g4p7fs2k)",
        "comments": [
            {
                "raw_content": "!LEGIT! https://avalanchestudios.com/stories/contraband-update",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Least shocking news",
                "author": "MolotovMan1263"
            },
            {
                "raw_content": "I genuinely forgot this game existed. Microsoft needs to stop announcing games that more than half a decade away.",
                "author": "Joseki100"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony Moving Away From Hardware Centric Model To A Platform Business",
        "score": 715,
        "text_content": "Per Sadahiko Hayakawa, At Sony: “In the gaming business, we are moving away from a hardware centric business model more to a platform business that expands the community and increases engagement.” [https://xcancel.com/Genki\\_JPN/status/1953483758667170146#m](https://xcancel.com/Genki_JPN/status/1953483758667170146#m) Previous Rumors: [Sony job listing signals intention to expand multiplatform strategy (including Xbox and Nintendo platforms) : r/GamingLeaksAndRumours](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1m9efwf/sony_job_listing_signals_intention_to_expand/)",
        "comments": [
            {
                "raw_content": "ResetEra on suicide watch",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "Here is the full quote if anyone is interested: > **Q:** And then also your investment in Bandai Holdings. So you have been aggressively investing in IP content creation. So how are you evaluating the result of the investment so far? And is there any specific investment that caused you to upward revise your forecast? > **Sadahiko Hayakawa:** [Interpreted] Thank you very much for the question. So the investment in Bandai, and of course, we have been shifting to creation. So for example, the entertainment 3 businesses basically account for 60% of our consolidated revenue. So basically, our business portfolio is shifting more to the creation. > > And then as for the Electronics business and TV, compared to output devices, we are now shifting to creation devices that include digital camera. So as a result, we are seeing more stability in profitability and in revenue, and also the productivity of our performance is increasing. And against such backdrop, and for example, in the Music business, Music Streaming and EMI Music Publishing has been acquired, and then we increased the music catalog. > > And as I mentioned in the speech, in gaming business and moving away from a hardware-centric business to more to the community- based engagement business, and then that has been increasing. So now as we make more transition to entertainment creation, the stability and the productivity, our performance is increasing. So this upward revision might not have been a direct result of these. However, the Music Publishing and also acquisition of a music catalog and also the acquisition of Crunchyroll, these are the areas where we are seeing growth. And as a portfolio, we have been expanding our businesses and also improving our profitability.",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Makes sense. As game budgets continue to balloon, they can't make enough profit relying solely on PlayStation 5 exclusives. This is pretty much just reiterating what they're already doing. We've seen them do more multiplatform releases, we've seen them try live service/evergreen games, and we've also seen them try to move toward other media outside of games to grow IP like film and TV.",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "1 hour of Ninja Gaiden 4 gameplay posted on Bilibili",
        "score": 145,
        "text_content": "https://www.bilibili.com/video/BV1SQtkzRE5E It appears to be the B-Roll that was provided to reviewers for their impressions/previews that were posted today. ~~Low-quality~~ (EDIT: Apparently, Bilibili just locks higher quality video behind making an account), but nice to have for the lack of commentary.",
        "comments": [
            {
                "raw_content": "not low quality you just need an account on bilibili",
                "author": "slash450"
            },
            {
                "raw_content": "Can anyone mirror this? I can’t look at the footage",
                "author": "Potential_Brain_9789"
            },
            {
                "raw_content": "Damn, we actually live in a timeline where we got DMC5, Bayonetta 3, and Ninja Gaiden 4. Never thought any of those would actually see the light of day.",
                "author": "xAVATAR-AANGx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: OD (Hideo Kojima) still in development",
        "score": 389,
        "text_content": "OD, the collaboration between Xbox and Hideo Kojima, is still in development, a Microsoft spokesperson tells me. https://xcancel.com/Wario64/status/1953504107743822256#m",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "FWIW this isn't a leak nor is it coming from my sources, it was told to me by an Xbox spokesperson.",
                "author": "jasonschreier"
            },
            {
                "raw_content": "Cancelling a kojima game after all this time would be disastrous",
                "author": "Ok_Organization1507"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty Black Ops 7 Skin Bundle stuff (labeled for pre order bonuses) Leaks found in the files - Via. RealityUK",
        "score": 110,
        "text_content": "https://xcancel.com/realityuk/status/1953533224652537967#m (contains a certain return of a Zombies character) https://xcancel.com/realityuk/status/1953534726339186822#m (WAW’s main brute from the Russian campaign) Yeah, it’s obvious found in the files from CODHQ but seeing this “Certain Zombies Character has made their return”, I guess the Tranzit “remake” rumor is technically is real, unless we wait for the gameplay trailer for Zombies when the Reckening EE Ending gets found first to reveal the big climax. Oh and here’s a certain Campaign character from the WAW campaign.",
        "comments": [
            {
                "raw_content": "been a while since I played bo2 but that does not like the bus driver",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "Those are some of the worst skins I’ve ever seen ngl",
                "author": "SimpleFactor"
            },
            {
                "raw_content": "COD identity nowadays is that of a mobile game. Literally negative aura.",
                "author": "Iron_Gunna"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-Kun: Xbox Rog Ally releases October 16",
        "score": 262,
        "text_content": "[https://www.dealabs.com/magazine/rog-xbox-ally-on-connait-enfin-la-date-exacte-de-sortie-60340](https://www.dealabs.com/magazine/rog-xbox-ally-on-connait-enfin-la-date-exacte-de-sortie-60340) >According to our information, the ROG Xbox Ally X consoles will be officially launched on October 16, 2025. This date currently applies to the European market, and although it is very likely, it remains to be seen whether other regions will benefit from a simultaneous launch.",
        "comments": [
            {
                "raw_content": "Alternative title: Hollow Knight Sliksong will release before/on October 16",
                "author": "Blazingscourge"
            },
            {
                "raw_content": "Then ... silksong tomorrow?",
                "author": "mrkubin175"
            },
            {
                "raw_content": "Silksong in September, let's gooooo...",
                "author": "Sea-Attention4844"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mafia TOC: Leaked Early Review from TheAuReview Site.",
        "score": 216,
        "text_content": "[Image containing review text](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2Fmafia-toc-leaked-early-review-from-theaureview-site-the-v0-3n1tig4bujhf1.png%3Fwidth%3D1080%26crop%3Dsmart%26auto%3Dwebp%26s%3D5c8a2cec3c359a82c4ce70aecc72d5fe5c69bdf5) (The [Page ](http://www.theaureview.com/games/mafia-the-old-country-is-a-stunning-and-riveting-trip-through-sicily/)is not accessible now.)",
        "comments": [
            {
                "raw_content": "Looks like the story like always is gonna have to carry this game",
                "author": "Embarrassed-Dust718"
            },
            {
                "raw_content": "The performance is going to be a mess",
                "author": "janonx1"
            },
            {
                "raw_content": "Its pathetic that the game releases today and we still dont have reviews man",
                "author": "Gonzito3420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Trump calls on Intel CEO to resign",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Lenovo IdeaPad 5 2-in-1 16IAL10 review: Big screen convertible with Intel Arrow Lake",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "[Phoronix] Intel Phasing Out 16x MSAA Support - Being Disabled With Xe3 Graphics",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Phoronix' Michael Larabel notes that with a driver-commit was the following comment; > \"16x MSAA *isn't* supported at all on certain Xe3 variants, and on its way out on the rest. Most vendors choose not to support it, and many apps offer more modern multisampling and upscaling techniques these days. > **Only 2/4/8x are supported going forward**.\" — Kenneth Graunke, Intel driver-team",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "I guess I don't understand why they would remove only 16x MSAA support. It doesn't seem like it would require more support than 2/4/8x but what do I know",
                "author": "ThatSpecialMoons"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD quietly launches Radeon Pro W7400 with 55W TBP, 1792 RDNA3 cores and 8GB memory",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it half-height? Encoder included? If no encoder, it'll be DOA. Edit: Looks like it IS half-height with AV1 encode/decode. See the [specs page. ](https://www.amd.com/en/products/graphics/workstations/radeon-pro/w7400.html)",
                "author": "Blu3iris"
            },
            {
                "raw_content": "So not much better than an RX6400 but for 4x the cost.",
                "author": "PsyOmega"
            },
            {
                "raw_content": "Shhhh! It's a secret to everyone (who doesn't read websites)",
                "author": "LongestNamesPossible"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "X+ XRIVAL offers Ryzen AI MAX+ 395 \"Strix Halo\" PC with 96GB memory under $1500",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The cheapest Strix Halo machine but at the cost of looking absolutely atrocious",
                "author": "chipsnapper"
            },
            {
                "raw_content": "That case looks like ass.",
                "author": "Naxthor"
            },
            {
                "raw_content": "The most interesting thing about the pricing on this for me is what it proves about the pricing of all other Strix Halo mini-PCs that this sub has been trying to justify since day one - it's BS and overinflated. Makes the [AIM](https://videocardz.com/newz/aim-max-gaming-laptop-with-amd-strix-halo-allegedly-targets-sub-1000-price) laptop seem a bit more realistic too, as that's only got 32GB and presumably just a 512GB NVMe SSD.",
                "author": "Mageoftheyear"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Buyers, Take Note: Mortgage Rates Are Falling, Home-Price Growth Is Cooling and Supply Is Outpacing Demand",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Best time to buy is right now!” - real estate industry, always",
                "author": "Fresh-String6226"
            },
            {
                "raw_content": "Allow me to translate on behalf of redfin: PLEASE PLEASE PLEASE BUY!",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "\"Redfin economists predict sale prices will fall 1% by the end of the year.\" I live on the east coast...let me know when that's true over here with an extra 0 at the end (at least).",
                "author": "toolateforfate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Hit Another New Longer-Term Low",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mortgage rates have barely budged after Monday with the day-over-day change failing to exceed 0.02% on any given day. But today's budging happened to bring the average 30yr fixed rate to another 10-month low. Lenders are in the mid 6% range for top tier scenarios. Economic data is one of the common influences for the bonds that underly rate movement. Today's only somewhat significant report was the weekly jobless claims data. It would have needed to fall very far from forecasts in order to have a big impact. While it was higher than expected, the \"miss\" was too small to matter. Today's improvement has more to do with yesterday's late day gains in the bond market. Today's trading has erased those gains, but the market hasn't moved enough for most lenders to go to the trouble of changing their rates. The implication is that tomorrow morning's rates would be just a hair higher if the bond market held perfectly steady overnight.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "LOL 10 month is long term now? What term is your 30 year mortgage then?",
                "author": "adeniumlover"
            },
            {
                "raw_content": "Ah finally. Now, let’s see if buyers come back as mortgage rates gets to low 6s, maybe high 5s. The models are going to be put to the test.",
                "author": "ensui67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "[Fast Company]: Housing market reality check: Homeowners finally accept 3% mortgage rates aren’t coming back",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so, the mortgage lock-in effect is eroding, because … *of course* it is. aside from a number of basic economic concepts, something the ‘people with a 3% mortgage will never sell!’ crowd never understood was there are “nice-to-sells” and “need-to-sells”. it doesn’t matter whether the “nice-to-sells” defiantly stay put, enjoying their 3% mortgage. recall (if possible) high school economics class: asset prices are set by the marginal transaction. the “need-to-sells” destroy the wealth of the “nice-to-sells”. and there are *always* “need-to-sells” eventually. what happens next? well, “nice-to-sells” begin turning into “need-to-sells”. we’re entering that phase right now, which is going to be really entertaining to watch. slapstick scenarios like boomer empty-nesters seeing their egg shrinking before their eyes. over-extended and housepoor millenial morons at the water’s edge of being underwater and wondering if they fucked up. small-time ‘investors’ seeing their life savings getting burnt to a crisp. the fact that the wait was so long is like a prized vintage sitting in the bottle a bit longer … once you uncork it, the flavors only become deeper, more luscious. cheers!",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why Falling Interest Rates Will Combine With Falling Housing Prices to Create A Temporary Deflationary Shelter Spiral",
        "score": 56,
        "text_content": "Let's rewind the clock to 2007-08 - Fed Funds Rate held steady @ 5.5% for 13 months, started dropping in mid 2007, hit 2% by April 08, and 0 by Nov of 09. This coincided with the start of a steep drop in home prices, but why is that? When interest rates fall, housing becomes cheaper, yes? WELL, when the market is frozen, and FFR drops, and it is hard to get a mortgage with a larger disconnect between 30-yr rates and FFR, new housing takes some time to become automatically cheaper. And in the time it takes for rates to come down on the private side, there are people who must sell their homes due to financial distress or life events. This combined in 2007-2009 to create a deflationary spiral in America's housing prices, with falling prices due to economic stress COMPOUNDED by cheaper cost of housing, both of which directly relate to Case Shiller / CPI. The one-two punch here was enough to send YoY CPI below 0% by late 2008, which is when the FFR hit 0. Let's fast forward to today - and the situation is similar but different. We do not have a foreclosure crisis, however, we do have a student loan debt crisis now ready to surface, and we also have a large cohort of our demographic entering senescence / many of these people will HAVE to sell regardless of whether they want to or not as their capability for self-care rapidly degrades. July of 2025 is likely to be the first month with YoY home price declines NATIONALLY per Zillow data (June was +.2% YoY). Combine falling national home prices with the lag between interest rates and mortgages becoming more affordable, and you can see why the Fed lowering rates as this distress becomes palpable is setting the stage for housing deflation. While prices are already declining, Powell refuses to budge because our CPI data is calculated using the OBSOLETE Case Shiller index which, while accurate, is a LAGGING indicator compared to Zillow and Redfin. As housing prices continue to drop due to debt refinancing / purchase of mortgage costs being excessively high, we will also see the cost of mortgages drop, but slowly enough and with enough debt stress + job loss (revised BLS numbers) that housing prices will not stop their slowdown for some time. However, that slowdown will also coincide with the cost of debt gradually decreasing. This will ultimately result in much lower mortgage rates than today, and a correction in housing prices. But with these two factors combining, there is going to be a deflationary impact to 33% of CPI calculation (the largest part), and the train has already left the station - it will NOT STOP until the Fed returns to a 0% FFR. Long story short: there is a one-two punch now impacting the entire economy, and it is falling home prices, and the price of debt, which will soon be decreasing slowly (and then rapidly). The lower cost of housing combined with the lower cost of financing housing, at a time of economic distress / rising unemployment, is going to result in a nationwide correction of varying magnitudes. However, it will not rectify until easy money and / or MBS purchases by the Fed resume. We are well past the start point of this deflationary housing spiral, but it is likely to accelerate this summer and into the fall, UNTIL Powell budges on interest rates and opens his eyes to the fact that our CPI calculations are LAGGING and that the economy is already in the toilet. Until job losses stabilize and liquidity is accessible - both of which will occur AFTER the Fed complets its pivot to loose monetary policy - the lagging CPI index is going to dip significantly. When it hits 0% YoY, expect 0% FFR to return, as it did when that happened in 2008 and 2020.",
        "comments": [
            {
                "raw_content": "The federal funds rate doesnt affect mortgage rates. Mortgage rates go down when the Fed buys treasury bonds and when the fed/us treasury buys mortgage backed securities. Lowering the federal funds rate MIGHT help CC interest rates and maybe auto loans... but if people's lines of credit are already maxed, that wont help.",
                "author": "konawolv"
            },
            {
                "raw_content": "Not likely. Hard to have a deflationary period, broadly, when the US dollar continues to be devalued by sloppy policy and political antics. They’ll both conspire to break it eventually, but I can’t see a “when” right now.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "Your argument misrepresents how inflation is measured by incorrectly stating that CPI uses the Case-Shiller index, when in fact it relies on Owners’ Equivalent Rent, which lags and doesn’t directly reflect home prices. It also draws faulty parallels to 2008 by suggesting we are in a deflationary spiral, despite the absence of widespread foreclosures, mass deleveraging, or systemic banking stress. While mortgage rates are high, most homeowners are locked into low-rate loans, limiting forced selling and supply shocks. The current housing slowdown is a correction from extreme price growth, not a collapse driven by financial contagion. Lastly, projecting a return to 0% interest rates based on modest price softening and lagging CPI data overstates the Fed's likely policy response absent a deeper economic crisis.",
                "author": "Sufficient-Flower775"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Digital Nomads Are Transforming Medellín’s Housing",
        "score": 5,
        "text_content": "https://www.bloomberg.com/news/articles/2025-08-07/medellin-developers-target-digital-nomads-with-custom-lodging Medellín Developers Target Digital Nomads With Custom Lodging - Bloomberg To eat lunch in Medellín’s poshest neighborhoods is to be assaulted with the sound of jackhammers. Most of the buildings going up are viviendas turisticas, or “tourist homes,” an emerging style of housing that combines elements of a boutique hotel, a co-living space and a studio apartment. The short-term rental properties are targeted at the droves of self-described digital nomads who’ve arrived in Colombia from other Latin American countries, Europe and the US since the Covid-19 pandemic. These youngish visitors, most of them under age 45, stay anywhere from a few nights to several months. An estimated 90 viviendas, ranging in cost from $1 million projects with a handful of units to $100 million towers built by major developers, have been constructed or are under construction, according to Growth Lab, a research and consulting company in Medellín owned by Trazos Urbanos SAS, a local developer. The viviendas share certain key features: large private rooms with bathrooms and kitchenettes; fast internet; design-intensive common spaces; and, very often, planned activities. Starting at about $50 a night, they hit a sweet spot on price and comfort not readily found in other global cities. They also reflect a certain lofty urbanist sensibility shared by their architects, who cut their teeth during an earlier era of the city’s transformation. “We want someone who can enjoy the place—our culture, the tropics and our local ecology—in a more conscious way,” says Federico Mesa, an architect and co-director of Plan:B, a company that’s wrapping up construction on its third vivienda, Entre Muros, a 22-unit property in the El Poblado neighborhood in a restored mansion once owned by a Medellín clothing magnate. “We know this kind of tourism—and tourist—exists.” Although co-living spaces and serviced apartments are a staple of global nomad hubs such as Barcelona and Mexico City, Medellín’s viviendas tend to be purpose-built and regulated the way hotels are. They’re the latest expression of a long-term shift in identity for the city, once notorious as the murder capital of the world. Starting in the early 2000s with national government backing, Medellín mounted an ambitious effort to design and build its way out of the brutal cartel violence of the 1980s and ’90s. Young architects including Mesa competed for the chance to put their mark on iconic parks, stunning sports complexes and templelike libraries in hillside barrios once known for warring drug gangs. That urban renewal, along with improved safety, temperate weather and a weak peso, brought an increasing number of visitors every year. “One day we realized we had no beds,” Mesa says. To meet demand, local residents converted their apartments into Airbnbs, causing rents to skyrocket and aggravating long-standing problems with sex and drug tourism. By 2023 anti-foreigner flyers could be spotted on city streets. Yet with foreign tourism rising as a key revenue source in Colombia (the sector took in about $10 billion in 2024, almost three times the value of the country’s coffee exports), elected officials have sought to temper the negative effects while keeping visitors coming. Starting in 2020 the country placed strict limits on short-term rentals in residential buildings nationwide, and officials in Medellín came up with clever incentives to push new, purpose-built developments for tourists into neighborhoods less prone to gentrification. That the viviendas are professionally operated and staffed, unlike most Airbnbs, helps deter sex and drug traffic, city tourism officials say. Los Patios Cool Living, a 51-room brick tower, opened in 2023 in the leafy upscale neighborhood of Laureles. On a pleasant afternoon in June, a wind blew through the cavernous open lobby where guests tapped on computers and played pingpong. “That breeze is intentional,” says architect Juan David Botero of Planta Baja, a company that also designed a 100-room vivienda blocks away. Like other local architects of his generation, Botero considers air conditioning something to be minimized in favor of good airflow, tons of plants and cooling materials such as poured concrete. As with many of his peers, Botero designed a major public project before working in hospitality: Museo Casa de la Memoria, a museum honoring victims of Medellín’s urban strife. Some of that influence can be felt in Los Patios. Although it boasts comforts including a rooftop bar, gift shop and pool, its rooms and atria are painted in homage to the elaborate murals in the city’s tough outer barrios. A manifesto posted in the lobby proclaims the spirit of the city as “ALWAYS BUILDING NEW AND STARTING OVER.” All these properties, including the luxurious ones charging $200 per night, sell guests on the chance to feel part of an authentic community. Although most global nomads stay less than a month anywhere, the viviendas like to squeeze the word “living” into their names, as if to distinguish the experience from “staying.” Some cater to specific niches, with bright, Instagram-ready decor and podcasting booths for content creators, or juice bars for fitness types. “Wellness is where it’s at right now,” says architect Paola Álvarez. Fresh from designing one spa hotel in Laureles, her company, Bassico, is developing MedellINN, a project that was originally conceived as an old-school party hostel and is now being retooled as an oasis for health-conscious guests, particularly women seeking a longer, more immersive stay. “The hostel business is dying. No one wants to be so close together after Covid, and you need that touch of luxury now to compete,” says Joel Goleburn, a former hostel owner whose four-unit vivienda and coworking space—CHCW House, designed by Plan:B—opened in 2024. With its undulating ceiling of suspended bamboo rods, blond-wood finishings and dramatic spiral staircase, “it just feels wholesome,” Goleburn says, adding that he hasn’t had to advertise; customers find the property on Booking.com and other platforms. Ads seeking investors—whether to buy individual units or revenue shares from projects—are all over local news and social media. Small and midsize developments are attracting local backers and Americans with ties to Colombia, and bigger ones have lured Asian and European investors as well. Occupancy rates hover around 70%, owners say—on par with Medellín’s hotel sector in recent years. And unlike traditional rentals in which tenants have strong protections, property managers can kick guests out if they need to. Digital nomads may represent the ideal guest for developers and designers, but at less than 10% of the 1 million-plus foreign visitors now arriving in the city every year, they’re not the viviendas’ sole clientele. The buildings are finding favor not only with foreigners but also with locals, whether relocated employees or newly divorced men. “What appeals to nomads appeals to a lot of people,” says Andrés Giraldo, the director of Growth Lab.",
        "comments": [
            {
                "raw_content": "Just want to say thank you from the community. Providing information and actually showing the content is meaningful. We don't always, tho often, agree. But I always respect and upvote you.",
                "author": "Jumpy-Ad8831"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Weekly Initial Unemployment Claims Increase to 226,000",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the new jobs being created numbers were botched why would trust these? I feel like this has to be off. All I see on LinkedIn is posts of people who’ve been laid off.",
                "author": "Crazyboreddeveloper"
            },
            {
                "raw_content": "Who else do we have to fire around here for these numbers to improve?",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 livestream is up",
        "score": 487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ytbh2u95qmhf1.png?width=393&format=png&auto=webp&s=94d326d0c8b3b41e950f504ea6a15d57176d776c Least misleading graph",
                "author": "icehawk84"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "https://preview.redd.it/n1niw17kqmhf1.jpeg?width=913&format=pjpg&auto=webp&s=99423a1bad2ca671901f9d69b62716af725191cc This chart must have been made by GPT 5",
                "author": "bigasswhitegirl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Summary of the livestream for those that couldn’t be bothered",
        "score": 3349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally a graph about gpt5 that makes sense",
                "author": "eleonics"
            },
            {
                "raw_content": "Undoubtedly one of the presentations of all time",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "This is not an accurate representation. Having the bar height match the numbers is not how the presentation went lol",
                "author": "plunki"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI did not use their most advanced model to make this graph",
        "score": 1801,
        "text_content": "52.8>69.1",
        "comments": [
            {
                "raw_content": "Vibecoded presentation lol",
                "author": "CrowdGoesWildWoooo"
            },
            {
                "raw_content": "Someone getting paid $400K at OpenAI looked at this and went \"Yeah, ship it.\"",
                "author": "MagicZhang"
            },
            {
                "raw_content": "i came here to post this. did absolutely no-one give this the once over before they went live to hundreds of thousands of people? hilarious",
                "author": "sandgrownun"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is going to cook them soon",
        "score": 1527,
        "text_content": "Genie 3 is far more impressive than GPT5 release. I expect upcoming weeks Gemini 3 to mark their total domination.",
        "comments": [
            {
                "raw_content": "The comeback of Google is crazy, we all thought they were cooked a year or 2 ago and now they are killing it",
                "author": "Tenkinn"
            },
            {
                "raw_content": "100%. This was always inevitable but I think it's becoming harder to deny that open AI is lagging. Not only that, but Google is finding actual, world altering uses for this technology that isn't just.... Chats and image generation see alpha evolve, alpha fold, genie 3, veo3, the list goes on. It was never a fair race at the outset, Google has the data, Google has the compute, and Google has demis....",
                "author": "Humble_Dimension9439"
            },
            {
                "raw_content": "Genie3 even for all its limitations 'at the moment' is absolutely insane. Game changer.",
                "author": "MelkorTheCorruptor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This might be one of the most awkward and stilted tech presentations ever put on the internet",
        "score": 1286,
        "text_content": "* Awkward stares at a laptop whilst GPT-5 does....something....in the background. * Nonsense graphs. * An incorrect description of lift whilst they boast about PhD level intelligence This company has a total valuation of 300 BILLION USD. WHAT THE FUCK WAS THE TWINK THINKING???",
        "comments": [
            {
                "raw_content": "Yeah the cringe levels are bone chilling. WHAT THE FUCK IS THIS 😂",
                "author": "SlowRiiide"
            },
            {
                "raw_content": "They really need to ditch the livestreams and just do a pre-recorded thing. The second hand embarrassment I’m getting is insane lol. What a terrible look for OpenAI. Their models are failing in live demos, clearly the PowerPoint was created by AI and has major errors, and these engineers, as smart as they are, should NOT be on screen, they are so stiff and their “acting” seems so fake. I appreciate the live demos, I get that shows some “trust” and a pre-recorded demo isn’t as “trustworthy”",
                "author": "Flipslips"
            },
            {
                "raw_content": "Yeah this is one of the worst presentations I've seen in recent memory. The graphs and charts alone make it so bad, but you're right about the way they are just using ChatGPT up there. I would much rather see a curated and representative set of examples than see live demos. Just let us demo it live, that's the only way for us to tell the real quality. Otherwise, I feel like it would be better to do a 10 minute highlight reel than a 1 hour long presentation",
                "author": "lIlIlIIlIIIlIIIIIl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Not a huge leap forward - Gary Marcus on gpt 5",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This sub was basically acting like GPT-5 will skip straight to being ASI 😂",
                "author": "Notallowedhe"
            },
            {
                "raw_content": "I thought this was the deathstar?",
                "author": "ktaktb"
            },
            {
                "raw_content": "During Sam's presentation during the release he mentioned all the other models are being deprecated, so it's plausible this was a kind of refactoring and consolidating while adding just a few new things.",
                "author": "xtra-spicy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 scores a poor 56.7% on SimpleBench, putting it at 5th place",
        "score": 317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Disappointing…",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Better than o3 at least. OpenAI has been pretty bad on this benchmark historically.",
                "author": "Dear-Ad-9194"
            },
            {
                "raw_content": "![gif](giphy|57MN9dLjLCV2JwtWlS)",
                "author": "arknightstranslate"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I do believe this is a measured response after 2 years of hype.",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ChatGPT's lack of multimodality feels very underwhelming. They teased it a long time ago.",
                "author": "chessboardtable"
            },
            {
                "raw_content": "I think they trapped themselves with all the hype posts and podcasts about how amazing their progress is, while in reality progress was steady but relatively slow (compared to the gpt-3 gpt-4 jump for example). They were releasing updates and new models weekly just to catch up with Google and because they need funding they pretended that they had much more in the pipelines than they actually did. Meanwhile their own hype was growing so big that they almost had no choice but to deliver the next model in the GPT-series. It’s disappointing but not unexpected I guess. Let’s see how the public (consisting mostly of people that aren’t chronically online on Reddit) perceives this, maybe the twink will get away with it this time.",
                "author": "Thick_Stand2852"
            },
            {
                "raw_content": "As I said in the past couple days, the fact that OpenAI STILL will not allow for any sort of video or audio input, is absolutely wild. No mention of multimodality in the presentation as far as I could tell, no plans for it, I guess? So I guess Google just wins(or Anthropic maybe, which has been on a steep rise recently becoming the [number 1 in Enterprise](https://techcrunch.com/2025/07/31/enterprises-prefer-anthropics-ai-models-over-anyone-elses-including-openais/), and having [the best employee retainment).](https://fortune.com/2025/06/03/openai-deepmind-anthropic-loosing-engineers-ai-talent-war/)",
                "author": "Beatboxamateur"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Open Ai still takes the lead",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone get this guy on the OpenAI graph team ASAP",
                "author": "NeedsMoreMinerals"
            },
            {
                "raw_content": "It's funny because it's true!",
                "author": "Profanion"
            },
            {
                "raw_content": "The rise to 4.5 and decline to 4.1 lol",
                "author": "Shotgun1024"
            }
        ],
        "subreddit": "singularity"
    }
]