[
    {
        "post_name": "Why I support ICE.",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why i support ice: this is my country. illegals don't belong here. get them out!",
                "author": "Raetchel"
            },
            {
                "raw_content": "Can someone tell these f\\*ggots that typing \"r\\*ped\" is g\\*y and ret\\*rded?",
                "author": "RootLevelPrivilege"
            },
            {
                "raw_content": "Link https://x.com/RepMarkHarrisNC/status/2018401876962660561?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This could get spicy... Bill Clinton's AF1 Pilot wants to be present during his testimony.",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill Clinton lunged forward into the cockpit trying to grab his stick.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Robert \"Buzz\" Patterson is a 20-year USAF vet who flew combat missions in Rwanda, Somalia, Haiti, and Grenada. He often carried the nuclear football for the former president. He claimed Bill Clinton lost the launch codes needed to use it, in the first place, and left us without a nuclear response for a time. Clinton's response was to \"shrug it off.\" He claimed the Clintons have at a disdain for the military and used them for menial tasks like carrying golf clubs. Al Bore would usually ignore them completely. Patterson mentioned an incident where Bill Clinton allegedly groped a female enlisted member of the Air Force. Given what we know now, that is highly likely.",
                "author": "airborne3502"
            },
            {
                "raw_content": "He sounds like he's seen some shit.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas school brings in Muslim group to pass out hijab and pamphlets on sharia law. Contact the Principal, Wylie East High School 📧 Tiffany.Doolan@wylieisd.net ☎️ 972-429-3155",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird how they scream \"separation of church and state\" when it's Christians, but they really love doing this to kids",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Burn that book and everything they hand out right in front of their booth. Just tell them you have the right to your own demonstration.",
                "author": "DJT4MoreYears"
            },
            {
                "raw_content": "Try this with Christians or Jews and they muzzies would set themselves on fire to protest and stop it. Same needs to happen to these evil assholes.",
                "author": "MikesDong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Found in the wild of CA",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More of this. Jam the images and the names down their throats.",
                "author": "Jbliss"
            },
            {
                "raw_content": "Proudboys",
                "author": "USPatriot45"
            },
            {
                "raw_content": "And sadly many more",
                "author": "malooch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Notice how \"refugee\" and \"adoption\" agencies keep showing up in the #EpsteinFiles",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow",
                "author": "DeportFixesEverythin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Cruise Abandons London Because It Is “Too Dangerous”",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://x.com/marionawfal/status/2018497165350580599?s=61&t=9VJN6ur9zIxxfyW6lcbw_g",
                "author": "KilroyJCNJ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What is the point of having the FBI if they are in possession of videos of elites killing and torturing kids and haven't made any arrests",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because they are the armed wing of the Democrat Party and the videos are used to blackmail elites to further Democrat agendas. The FBI is the Democrat's armed wing the same way the RCMP is the armed wing of the Liberal Party of Canada. They know a guy was gathering police uniforms and guns as well as building a fake police car and did nothing. Then, the Nova Scotia mass shooting happen and the Liberal used that to initiate the May OIC.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A GoFundMe has been launched so a foreigner can attempt to move into Billie Eilish's home after she said the United States was stolen land. The man from Australia says he plans to move into her home.",
        "score": 1256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll allow it.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Hillbilly Eyelash acts like a mannequin. Just says whatever she's told to say. Not an original thought in her brain.",
                "author": "McFatty7"
            },
            {
                "raw_content": "no, i want the Muslim child rapists to be moved into her home. Let's see her cry and call the cops",
                "author": "Choppermagic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trum: ‘MELANIA’ Has Already Out-Grossed Five 2025 Oscar Nominees",
        "score": 1438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Silent Majority is speaking loud and clear, now that there is a film actually worth seeing in theaters. I did my part to support it by seeing the film, and had a great time and a lot of fun!! 😎👍👍",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "Oscars have become a joke. It’s all about checking political boxes these days. The days of artistic merit are long long over.",
                "author": "booblitchutz"
            },
            {
                "raw_content": "1.3 on IMDB. Totally legit I'm sure.",
                "author": "Forty_Five"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leader John Thune says he'll bring the SAVE America Act to the floor WITHOUT the 60-vote Zombie Filibuster, meaning senators must debate and 50 votes can be possible for passage. Anna Paulina Luna and Tim Burchett confirmed it.",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If he does that, and it passes, I'll be surprised he had it in him.",
                "author": "AmericanHawkman"
            },
            {
                "raw_content": "If it passes I will personally install one vertebra into their spines so they can be less of a spineless RINOS. I won't be surprised that John Fetterman will vote Yes on the SAVE act.",
                "author": "DT170x"
            },
            {
                "raw_content": "If he manages to somehow, and I really stress the word somehow(and not cave like a bitch)manages to hold the line to get the Save Act passed. Then I will say good job Thune, but until then we’ll see.",
                "author": "Jodokon92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And we didn't need to pay him $2800 to leave.",
        "score": 598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GenX aliens drank from the fuckin garden hose",
                "author": "awsure"
            },
            {
                "raw_content": "And he had literal flying bicycle technology. Now *that's* what I would call \"cultural enrichment.\"",
                "author": "RootLevelPrivilege"
            },
            {
                "raw_content": "BEAUTIFUL BLUE EYES",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tennessee Releases Staggering Stats on Migrant Crime",
        "score": 588,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homogeneity is a strength.",
                "author": "RootLevelPrivilege"
            },
            {
                "raw_content": "All this for burritos. Reminds me of the price America paid for cotton.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "Their kids are even worse.",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The most transparent administration in American history",
        "score": 1361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the same backfire BLM experienced after the Saint Floyd riots.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "can’t wait to watch the highlights!",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Nice, concrete evidence to charge violent leftist rioters with.",
                "author": "TrumpPatriot83"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Data Republican: From @bitchuneedsoap : meet the people behind the anti-ICE groups in North Carolina. Other people use OpenClaw to LARP on social media sites. We've been building COINTELPRO AGI the past week.",
        "score": 545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its so incredibly sad that citizens have to work to make these connections to drive the DOJ to actually do something. But thinking about it, this was the forcing function of journalism back in the forgotten past. When journalism is nothing but propaganda it promotes in action from the government.",
                "author": "invalid_data"
            },
            {
                "raw_content": "That's a lot of faggot communists!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Autism is sexy. What a time-line.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why was she even there to begin with?",
        "score": 1742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She needs to be removed because she's fucking retarded",
                "author": "Jthenk"
            },
            {
                "raw_content": "Fraud vitiates everything….",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "Because she knows nothing will happen to her, because the right is utterly toothless.",
                "author": "Iremembermypassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on Iran",
        "score": 688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🇮🇱🕍💎💰🏦💉🥯⛈️🐀🎬🎤🏦",
                "author": "CocaineShark"
            },
            {
                "raw_content": "I hope by Iran he means Minnesota.",
                "author": "red_holiday2"
            },
            {
                "raw_content": "Donald Bush. Isrl = Uni Party.",
                "author": "HankScorpio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The highest Poll Numbers I have ever received. Obviously, people like a strong and powerful Country, with the best economy, EVER!",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The economy after year one is slightly improving (gas prices down). But saying it’s the best economy “ever” when the price of everyday shit (from ground beef to electricity) remains at the sky high prices of the Biden era makes him look so out of touch.",
                "author": "couranto"
            },
            {
                "raw_content": "While I appreciate his enthusiasm, the job market sucks. I'm lookin' at you H1-B. Until that changes, I'm not calling it great... Not a blackpill, just being realistic. It's definitely looking better for lots of things though.",
                "author": "donkeyKang"
            },
            {
                "raw_content": "President is out of touch. No one arrested for the rigging. H1B still kicking. Everything still expensive. Deportation numbers lacking. Midterms are lost.",
                "author": "EstadosUnidosPrimero"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna: Chuck Schumer is not the president, and he is not the leader of the majority. He is attempting to race-bait half the country into thinking that voter ID is racist.",
        "score": 1799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey Chuck, does Israel require Voter ID?",
                "author": "NonbinaryPotatohead"
            },
            {
                "raw_content": "Noone thinks it's racist except for those who's minds you will never change anyway",
                "author": "STONKATRUCK"
            },
            {
                "raw_content": "If you think it's racist to ask for voter ID then you must think it's racist to ask for ID to buy alcohol or start up a utility service too. I don't believe anyone feels that way it's only the media that pretends they do, and whomever gets paid to parrot that message. Chuck Schumer is a puss blob on the ass of America and he needs to get popped.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is why Soros organized the School Walkouts, this is what he wants. Now the teacher will have his life threatened. Hays Consolidated School District students ATTACK a teacher during a ICE protest. They are creating Absolute animals.",
        "score": 636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They learn this from their parents, and from their social media. They think this behavior is normal, and their parents are too apathetic to care.",
                "author": "Bunnybudman"
            },
            {
                "raw_content": "I can't imagine being in a worse situation than being attacked by a group of kids like that. You really can't fight back, but some of those guys are big enough they can damage you. Genuinely just scary to watch. Shitty. Awful. This is performative behavior. They're imitating the ICE protests in Minneapolis.. Their school greenlights it and rewards the behavior. Yeah, we gotta go vote. Everything, everywhere, across the board, anything we can do to push back against this. This is genuine evil.",
                "author": "over_it"
            },
            {
                "raw_content": "Every single one of those rat fucks needs to be expelled and the teacher should sue the school, the board, and the parents of these animals.",
                "author": "HumbleAmerican91"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "POTUS on Somalians",
        "score": 1093,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is the deputy director of the FBI doing a podcast. Oh wait, nevermind. Bongino is a grifting, spineless piece of shit that is all talk I forgot.",
                "author": "m0ntsta"
            },
            {
                "raw_content": "Can we just not post Bongino grift posts going forward? This guy is a fraud, used to like him but done with him after how he handled his service.",
                "author": "MikesDong"
            },
            {
                "raw_content": "Fuck Bongino. Grifter. Anyone giving this man views or money is a mark.",
                "author": "HorrorGameDev"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OpenAI is unsatisfied with some Nvidia chips and looking for alternatives, sources say",
        "score": 184,
        "text_content": "Could this be the beginning of the end of GPUs being gobbled up by AI?",
        "comments": [
            {
                "raw_content": "Unsatisfied with the check amount",
                "author": "LuluButterFive"
            },
            {
                "raw_content": "Feel like this spin to cover Nvidia pausing the 100 billion investment",
                "author": "Slasher1738"
            },
            {
                "raw_content": "Yeah, and what is Sam Altman going to do with 40% of the world's DRAM capacity? Profit off of Sandisk's SN850X 4TB drives that are now $1199.99 MSRP?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Legendary CPU architect Gerard Williams III, who founded Nuvia, has left Qualcomm",
        "score": 191,
        "text_content": ">I want to let everyone know I am now enjoying quality time with family. My journey with Qualcomm has ended. I want to say thanks to all for the last four years together. Now the next chapter begins. And it’s starting with painting my house and doing that very long list of things I have made. Thank you to all the amazing friends and colleagues from NUVIA who made the journey possible. Stay humble. Stay strong. And always always be hungry. [\\- Gerard Williams III (Linkedin)](https://www.linkedin.com/posts/gerard-williams-iii-27895aa_i-want-to-let-everyone-know-i-am-now-enjoying-activity-7424120010719293441-QzET) A brief article about him (composed by Gemini): \"Gerard Williams III is a prominent microprocessor architect and engineer who has held high-level leadership roles at several of the world's most influential technology companies. His career is characterized by his significant contributions to ARM-based processor designs that power modern smartphones and data centers. Professional Career History \\* Intel & Texas Instruments (Early Career): After completing his education, Williams began his career at Intel. He later moved to Texas Instruments, where he developed the TMS470, a 32-bit microcontroller based on the ARM architecture. \\* ARM (1998–2010): He spent 12 years at ARM, ultimately becoming a key figure in the development of several processor architectures. He is credited with leading the design of the Cortex-A8 and Cortex-A15, which were pivotal in shifting mobile computing toward high-efficiency, high-performance processors. \\* Apple (2010–2019): Williams served as Senior Director in Platform Architecture at Apple. He was the lead architect for every custom CPU core from the A7 (the first 64-bit mobile processor) to the A12X. During his tenure, his role expanded to overseeing the layout of the entire System-on-a-Chip (SoC) for Apple’s mobile devices. He is an inventor on over 60 Apple patents related to power management and multicore technology. \\* NUVIA Inc. (2019–2021): In 2019, he co-founded NUVIA and served as its CEO and President. The startup focused on creating high-performance ARM-based processors for data centers, aiming to challenge the dominance of Intel and AMD in that sector. \\* Qualcomm (2021–2026): Following Qualcomm's acquisition of NUVIA for approximately $1.4 billion in 2021, Williams joined Qualcomm as Senior Vice President of Engineering. He has been a central figure in the development of the Oryon CPU technology used in Qualcomm’s latest flagship chips.\"",
        "comments": [
            {
                "raw_content": "Before Nuvia he was the chip lead on the legendary Apple A7.",
                "author": "Salkinator"
            },
            {
                "raw_content": "Did bro retire a billionaire?",
                "author": "Creative_Purpose6138"
            },
            {
                "raw_content": "Arg. Leave it to AI to get stuff radically wrong. \"After completing his education, Williams began his career at Intel, where he worked on the Xilinx 3000\" No. Xilinx was never a part of Intel. Williams worked at Intel \"developing performance gathering hardware for the 66MHz and 100MHz Pentium chips\". He used a Xilinx 3000 to do so.",
                "author": "Verite_Rendition"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600-Powered Galaxy S26 Lands on Geekbench with Nice Power Gains",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Power gains meaning over all performance. We don't yet know the power efficiency of the 2600 yet. >A new Geekbench listing for the Exynos 2600-powered Samsung Galaxy S26 is now available. The 10-core CPU, accompanied by 12GB of RAM and Android 16 OS, reached a single-core score of 3,315 and a multi-core score of 11,310. This chip is 39% faster and has 2x better GPU performance than its predecessor, according to Samsung. Also note: >These tests are especially notable since we are talking about the first 2nm chipset in a commercial smartphone. However, as with any pre-release data, these numbers represent a starting point rather than a final verdict. We'll start to have real world results when it officially launches on the 24th of this month.",
                "author": "ML7777777"
            },
            {
                "raw_content": "When my Z Flip7 came out, sooo many online were complaining the 2500 chip is awful, runs super hot, slow, etc. and yet I've had no complaints on the performance of Flip7, its fast, lasts long, and doesnt run hot. So Im sure 2600 will be even better regardless of the exact benchmark scores, these are good chips.",
                "author": "ReasonablePractice83"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Puget Systems Most Reliable Hardware of 2025",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn't a 2.5% failure rate for CPUs seem kind of high? I mean that is 1 in 40 units not working.",
                "author": "GenericUser1983"
            },
            {
                "raw_content": "\"On the consumer desktop side of things, results are less clear-cut. Looking at the totals for AMD’s Ryzen™ 9000 and Intel’s Core™ Ultra 200 Series, the failure rates are almost identical: 2.52% for Ryzen and 2.49% for Core Ultra. That is too close to say there is a statistically significant difference, so we can’t crown either product line 5as a whole. However, there are two standouts within these families that did record fewer failures across a wide enough sample size! The most reliable individual processor was Intel’s Core Ultra 7 265K, with only a 0.77% failure rate. As a group, AMD’s Ryzen X3D processors also had a better track record than the Ryzen 9000 family as a whole, with 1.51% of chips failing in 2025 – and the vast majority of those being caught here before systems shipped out to customers.\" Ironic, after all X3D chips are more reliable than the vanilla ones when collecting statistics instead of reddit threads and videocardz articles. I do wonder how many of these systems they sell in order to have reliable statistics for single SKUs though.",
                "author": "Kryohi"
            },
            {
                "raw_content": "> On the desktop side, though, the top SKU from last year also stood out this time as the most reliable among UDIMMs we carried: Kingston ValueRAM DDR5-5600 32GB, with only a 0.09% failure rate. Note that Puget _always_ sets their memory to the maximum \"supported\" speed and will refuse to run faster, citing reliability concerns. So because Ryzen 9000 CPUs have a max supported DDR5 speed of 5600 on paper, that's what Puget uses even though 6000 is possible with EXPO.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SoftBank Corp. Subsidiary SAIMEMORY and Intel Collaborate to Commercialize Next-generation Memory Technology | About Us | SoftBank",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Beyond Compute: How Memory Costs Are Reshaping the Smartphone SoC Landscape",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "DLSS 4.5 or RR?",
        "score": 7,
        "text_content": "I am wondering how others are leaning on this since these two technologies are now mutually exclusive? *Personally* I have opted to use models L/M because the improvements feel too good to pass up. However, it is sad to lose the ability to use RR with the latest DLSS super resolution.",
        "comments": [
            {
                "raw_content": "In heavy RT/PT titles - absolutely RR. Stability difference between RR and no RR in Cyberpunk, for example, is HUGE. For me PT is borderline unplayable in it without RR. Things like IJ hold up much better, but still not stellar.",
                "author": "GARGEAN"
            },
            {
                "raw_content": "I can’t go back to fizzy RT so I’m sticking to RR until new versions come out.",
                "author": "hobx"
            },
            {
                "raw_content": "Alex at Digital Foundry noted Preset M has specific issues with ray tracing in multiple games. Ray reconstruction almost always offers far superior denoising than the standard denoiser used by games, so I always use it when available. It results in a significant improvement in Indiana Jones and Cyberpunk path-tracing for example, which a more stable presentation/less noise.",
                "author": "jasonwc"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 has now sold 17.37 Million Units worldwide!",
        "score": 344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[**Updated Sales figures for Switch 2 Games:**](https://www.nintendo.co.jp/ir/en/finance/software/index.html) * Mario Kart World - 14.03M * Donkey Kong Bananza - 4.25M * Pokémon Legends: Z-A – Nintendo Switch 2 Edition - 3.89M * Kirby Air Riders- 1.76M",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "only 4 million behind the gamechube!",
                "author": "Total-Watercress-384"
            },
            {
                "raw_content": "Kirby Air Riders outselling Sonic Racing, and the internet people told me Sonic will overthrow mario kart world",
                "author": "shiroe-kun"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Congrats to 17.37M NS2 Sales!",
        "score": 171,
        "text_content": "Nintendo financial results – February 2026 – Switch 2 at 17.37 million units, Switch at 155.37 million, more Nintendo has now published its February 2026 financial results, which is for the three quarters of the current fiscal year – meaning through December. Per usual, the company has shared the latest sales data for Switch 2 and Switch plus more. CTTO",
        "comments": [
            {
                "raw_content": "yikes prime 4 didnt get mentioned meaning it sold under a million copies",
                "author": "Chewbacca319"
            },
            {
                "raw_content": "Dang gues MP4 didn't Crack million yet.",
                "author": "maxpowers128"
            },
            {
                "raw_content": "Looks like Switch 2 has finally outsold the industry titans Wii U and PlayStation Vita, things were looking dicey there but good for them",
                "author": "Dunkaccino2000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dispatch Devs Say Uncensored Physical Switch Release Not Possible, \"Can't Comment\" On Why Separate Regional Releases Didn't Happen",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "None of this makes any sense & the more vague non-answer statements we get from them the less sense it makes.",
                "author": "Mollywobbles77"
            },
            {
                "raw_content": "It’s like every single one of their PR move is worse than the last one. Yikes.",
                "author": "Tubim"
            },
            {
                "raw_content": "everything about this is just baffling",
                "author": "skeddy-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If it really does end up being a partner showcase this week, I hope one of these (or both would be better) ends up being revealed",
        "score": 113,
        "text_content": "still kinda shocked it’s taking this long for both of these, but hopefully soon 🙏",
        "comments": [
            {
                "raw_content": "I would kill to have rivals on switch!",
                "author": "d4vey_t"
            },
            {
                "raw_content": "it about time i'd say",
                "author": "Miniyi_Reddit"
            },
            {
                "raw_content": "OW is holding its own event this week so maybe we'll see it then instead of the Direct.",
                "author": "anirakdream"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "YouTube officially confirms that the app is about to come to Switch 2.",
        "score": 797,
        "text_content": "https://x.com/TeamYouTube/status/2018245736891101276?s=20 Now if we could just get Crunchyroll, Disney+, and Netflix ! Edit: It looks like they deleted the tweet I'm gonna guess they weren't supposed to say anything yet and it was supposed to be a formal announcement",
        "comments": [
            {
                "raw_content": "Watching “NINTENDO HAS FORGOTTEN ABOUT MARIO” on my Switch 2 will be so funny",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "this sounds just like the message back in [October 2025](https://x.com/TeamYouTube/status/1982108195817394325). I know there is the rumor that it is supposed to release this month, but \"soon\" is what YouTube has always said.",
                "author": "Not__My__Birthday"
            },
            {
                "raw_content": "Gonna be hilarious if there's an exploit in the app like the PS5 version. I'm leaning towards that being the reason it was delayed.",
                "author": "joe199799"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We flying (sell-through data)",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The hardware sales are 17.37mln. We got the data directly from Nintendo, [today](https://www.nintendo.co.jp/ir/pdf/2026/260203e.pdf). >*For the nine months ended December 31, 2025, Nintendo Switch 2 got off to a good start following its launch on June 5 and unitsales continued to grow through the holiday season. Looking at Nintendo Switch 2 software, Mario Kart World, which was releasedon the same day as the hardware launch, recorded sales of 14.03 million units, including bundle sales. Donkey Kong Bananza,released in July, sold 4.25 million units, and Kirby Air Riders, released in November, sold 1.76 million units. Pokémon Legends: Z-A– Nintendo Switch 2 Edition, released in October, also sold 3.89 million units of the packaged version. Unit sales of the downloadableversions of this title and other Nintendo Switch 2 Edition titles are counted in the sales of Nintendo Switch software. Looking at Nintendo Switch software, Pokémon Legends: Z-A recorded sales of 8.41 million units, including sales of thedownloadable version of Pokémon Legends: Z-A – Nintendo Switch 2 Edition. Super Mario Galaxy 2, released in October, sold 2.42million units, and Super Mario Galaxy, also released in October, sold 2.28 million units. Given that consumers can play both Nintendo Switch 2 exclusive software and Nintendo Switch software with Nintendo Switch 2,titles such as Mario Kart 8 Deluxe and Super Mario Party Jamboree, which were released for Nintendo Switch in previous fiscalyears, have also shown stable sales.* **As a result, Nintendo Switch 2 hardware sales reached 17.37 million units**, and Nintendo Switch 2 software sales reached 37.93million units. In addition, Nintendo Switch hardware sales totaled 3.25 million units, and Nintendo Switch software sales totaled108.93 million units",
                "author": "SparklyPelican"
            },
            {
                "raw_content": "Man, all these posts about sales and stuff, I'm genuinely curious why people are so invested in this stuff. In my head the interest over the success of this console began and ended the moment it received the label as the fastest selling console last year and how it was outpacing the Switch. Everything after that seems like an autistic fixation on financial data. Which is completely fine, I guess I just don't have that 'tism specifically",
                "author": "Huge_Imagination_635"
            },
            {
                "raw_content": "How can it have sold 15M by the end of December when I saw units in the shop and none of my friends have one? The number of people who are going to be completely embarrassed by this and the nonsensical online narratives they’ve managed to fall into is astounding. Stop reading online stuff and look at the actual data. Switch 2 is a different beast to any console we’ve ever seen.",
                "author": "ShotAcanthocephala8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Repaired my Scratched up Switch 2 for Free",
        "score": 197,
        "text_content": "A little while ago, i made a post here about whether or not i should send my scratched up switch for repair. The reason i made the post is because i wasn’t sure if they would charge me or not. After I got some feedback from people here, i decided to give it in for repair to see if they would charge me and sure enough it was completely covered under the 1 year warranty. Instead of replacing the screen, they gave me a whole new console for free. If your wondering if you should send yours for repair, you absolutely should.",
        "comments": [
            {
                "raw_content": "NOW GET A SCREEN PROTECTOR",
                "author": "bigparsnipenjoyer"
            },
            {
                "raw_content": "They replaced my old DS with a new one before. That made my year.",
                "author": "AltXUser"
            },
            {
                "raw_content": "That's awesome! Nintendo customer service is always god tier I remember stepping on my Wii u gamepad and they repaired it for free.",
                "author": "clearinfo64"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First time playing FF7 and it runs great.",
        "score": 320,
        "text_content": "I have a Switch 1 since launch day but always played it docked to my tv. This time Im using more this one in handheld mode. Already ordered Savage Ravens Neogrips and Maxcarry case. Finally I think I will finish Totk but dunno if I should create a new save file or continue the old one. I could get FF7 remake for PS5 but after watching how it runs on Switch 2 I got to get it.",
        "comments": [
            {
                "raw_content": ">I could get FF7 remake for PS5 but after watching how it runs on Switch 2 I got to get it. It's funny how this might fry the brain of some people, because they can't accept someone playing something at 30fps. Have fun, mate. You gonna have a blast.",
                "author": "kahabraham"
            },
            {
                "raw_content": "I also have the game I recommend getting a case for your switch like you got a protector from NEXT I recommend getting their traveling cave",
                "author": "Assassinknife"
            },
            {
                "raw_content": "You’re in for a treat. FF7 is an amazing game.",
                "author": "OliviaElevenDunham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Epstein Files Confirm Emails with Activision CEO Bobby Kotick and Futurist Pablos Holman Discussing Use of Call of Duty Microtransactions to 'Indoctrinate Kids'",
        "score": 3476,
        "text_content": "https://www.justice.gov/epstein/files/DataSet%2010/EFTA01762201.pdf https://www.justice.gov/epstein/files/DataSet%2010/EFTA01905557.pdf https://www.justice.gov/epstein/files/DataSet%209/EFTA00634104.pdf",
        "comments": [
            {
                "raw_content": ">discuss how to indoctrinate children >name the currency CP What did they mean by this?",
                "author": "Habibipie"
            },
            {
                "raw_content": "Bobby Kotick being in the files is the least surprising detail about them. However, > I'm all for indoctrinating kids into an economy What the actual fuck, Pablos?!",
                "author": "Aggressive_Rope_4201"
            },
            {
                "raw_content": "Jfc this dude was everywhere",
                "author": "Banned4UsingSlurs3"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Techloy posted article about 'Fallout 3 remaster' and deleted it.",
        "score": 340,
        "text_content": "Edit: Highly likely it is a reposted article regarding the Xbox Series S/X boosts https://www.reddit.com/r/GamingLeaksAndRumours/s/1AbIJXFLHO https://www.reddit.com/r/GamingLeaksAndRumours/s/HJafT4Eqio As title says Techloy posted an article titled about Fallout 3 but deleted it, Google News sent it out. Synopsis - \"This could give Game Pass subscribers an easy excuse to revisit the Capital Wasteland or experience it for the first time.\" Article from today: https://www.techloy.com/fallout-3-remaster-is-now-free-on-xbox-game-pass/",
        "comments": [
            {
                "raw_content": "Someone on r/fallout said it was a copy of another article. The \"remaster\" mentioned is the upscaled xbox version that has been out for years.",
                "author": "Alaxel_Au_Arryn"
            },
            {
                "raw_content": "CNN once posted like 20 obituaries. Sometimes news sites do write predictive articles so they can be first to publish. I don't think there's any concrete information but there has been a lot of fan speculation due to that timer.",
                "author": "Benevolay"
            },
            {
                "raw_content": "Doubt",
                "author": "perfectevasion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostofHope: IW's incompetance indirectly led to the creation of MWZ and the cancellation of Outbreak for BO6 Zombies.",
        "score": 154,
        "text_content": "[Part 1](https://xcancel.com/TheGhostOfHope/status/2018349084541702495#m) [Part 2](https://xcancel.com/TheGhostOfHope/status/2018392261755576731#m) [Part 3](https://xcancel.com/TheGhostOfHope/status/2018392420463923471#m) TL;DR: IW’s incompetence led to refusing to finish work on MWIII because of “criticism hurt our feelings” on MWII, which led to SHG going though a lot of dirty work to deal with, as explained years ago by Bloomberg’s MWIII’s Development Investigation Article. It doesn’t help either that IW just stopped working on a DMZ2 for MWIII that would’ve taken it out of beta and launched with a lot of new features forcing Treyarch to come in and do MWZ on Urzikstan instead. Also, Treyarch did had plans for BO6 Zombies to have an Outbreak 2.0, before going back to Round Based. It did not make a bunch of Round Based maps be next to each other because they wanted to. It was because they were in early dev on Liberty Falls Outbreak and then had to pivot cause you can't do something like that back to back. It also is why MWZ used a ton of DMZ assets.",
        "comments": [
            {
                "raw_content": "No wonder BO6 zombies maps feel so inconsistent in terms of quality. The chopped up open world map allegations were real 😭",
                "author": "tuan321bin"
            },
            {
                "raw_content": "What happened to IW? Look back at the behind the scenes videos for MW19. Its actually depressing. They were so passionate. Warzone imo has been the biggest hit this series has taken since lootboxes. It has absolutely stole the focus of the shareholders and higher ups. What a fucking shame how far these companies go to ruin their reputation for a quick buck. And i cant even fully blame them since there are braindead morons who blindly buy these games every year. I used to be one of them! But not anymore. Enough is enough.",
                "author": "DiaperFluid"
            },
            {
                "raw_content": "I would hardly be surprised... IW just seems like they are above everything You see Treyarch and Sledgehammer having to crunch and get games out every year, helping on other games like with MWZ or ranked. While IW is allowed to stay on cycle and do their thing And what's worse is that the rushed games are better (MP wise... Sometimes campaign) than IW games Sledgehammer made MW3 in like 16 months, Treyarch made Cold War in 18 months and BO6/BO7 in 4 years If IW can't make a masterpiece after being left to make MW4 for 4 years then they are truly the worst CoD studio",
                "author": "Ok-Confusion-202"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Clancy's The Division - Definitive Edition showing up on Xbox store",
        "score": 84,
        "text_content": "Looks like Xbox might have dropped the release little early https://www.xbox.com/en-US/games/store/tom-clancys-the-division-definitive-edition/9pgffb0wzpkh",
        "comments": [
            {
                "raw_content": "Said it came out yesterday lol. I’m really disappointed this is just the same game but all the DLC packaged with it. Missed opportunity.",
                "author": "Greatsnes"
            },
            {
                "raw_content": "Is a new collection bundle a leak if it launched at 12am EST? It's all the old content just bundled in a new package for a new price, which delists the old ones. This is very standard for Ubi",
                "author": "darkdeath174"
            },
            {
                "raw_content": "Meanwhile u can get the gold edition for like $15 on a key site for Xbox lol",
                "author": "International-Prior9"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Splatoon Raiders' Trademark has been updated to include a publication date of 17th February",
        "score": 284,
        "text_content": "[https://xcancel.com/MikeOdysseyYT/status/2018373560033489202#m](https://xcancel.com/MikeOdysseyYT/status/2018373560033489202#m) Could either mean a direct on that date (Coincides with NashWeedle's rumor of a general direct on the 3rd week of Feb) or a Nintendo Today drop",
        "comments": [
            {
                "raw_content": "17th is a Tuesday so a Nintendo Today is more likely.",
                "author": "thetiredjuan"
            },
            {
                "raw_content": "It could be a Direct... But when Splatoon Raiders was first announced, it was just dropped on a random day. If they made this a Nintendo Today drop, you could also argue that they wouldn't need a General Direct at all, provided it's given a date. If February has a Partner Direct, Splatoon Raiders reveal + date, and a Pokemon Presents with Gen 10 reveal, then I doubt they're doing more than that. But I think Splatoon could be their May release given the timing here.",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "That means nothing. For example, World Fighters has a publication date on November 2025 Url https://tsdr.uspto.gov/#caseNumber=99395141&caseSearchType=US_APPLICATION&caseType=DEFAULT&searchType=statusSearch",
                "author": "fannel_drizzt"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Capcom rebooting dino crisis with rex engine?",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn’t a grain of salt it’s a full on container",
                "author": "UltraMugen"
            },
            {
                "raw_content": "What tier is random dude at a cosplay convention",
                "author": "BomberBlur070"
            },
            {
                "raw_content": "The last time people thought they were getting Dino Crisis, they got Exo Primal. Don’t bite on this.",
                "author": "RipMcStudly"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[AttackTheBacklog Podcast] Nash Weedle reports hearing about another Nintendo Direct, likely happening 3rd week of Feb or around March",
        "score": 152,
        "text_content": "Source: https://www.youtube.com/watch?v=EZmOH4klmf4&t=10293s (2:51:33) From AttackTheBacklog recent Podcast: > So I asked around to see if there was anything else planned for after the partner showcase. > Now, what I was told was something very small, but maybe connected to what Nash is hearing. > And we're going to say what that is in a second. > I simply just heard that there is something coming after the partner showcase, but they didn't say what it was or when it could happen, so very little information. > But that did make me a bit curious in that, you know, it seems like, you know, that they were being careful. Right. > So that made me think, well, it must be something at least noteworthy. > So, but that's all I heard that there was something planned after the partner showcase and, but they didn't say when or what. > Nash on his side has heard big things. Nash has been told that yes, he's been told about the Monolith Soft project. > And he's been told about Mario 3D. > He's been told that Mario 3D is out this year and will be Nintendo's big game for the year. > As to when, and those games will be shown in the Nintendo direct general. > As to when he's been told the Nintendo direct general will be, he's got a couple of sources that are saying February. > One of them is saying the 3rd week of February. > Aside from that, he's got a bigger number of sources that are saying March. > One of those sources is saying Mario Day, but all the other sources that are pointing towards March and saying, no, it's not Mario day, but it is in March. > So he's got a few sources. > A couple of them are pointed towards February, specifically the third week and a large number are points towards March one, one saying Mario day, but the other one saying just somewhere in March, they don't know. > So between February and March, now keep in mind between here and there, Nash is saying, of course, he's going to keep investigating and looking for more information and he will constantly be updating us on what he's hearing. > But as of now, as of today, what he's hearing is that there is indeed the Monolith Soft project. > There is Mario 3D. > Mario 3D will be the big game of this year. Both will be shown in a Nintendo Direct General, and that that direct general, he's been told by some it's February, maybe the third week of February and other sources, March one saying March Mario day, but no, but March. > So that's where we are. That's, uh, you know, primarily what we've spoken about. > This is what Nash has heard.",
        "comments": [
            {
                "raw_content": "I have 3 sources saying February and 2 sources saying March and 4 sources saying between April and June. You guys heard it here first",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Didn't this was already send in this sub? Or Am I crazy?",
                "author": "Educational-Arm-7384"
            },
            {
                "raw_content": "Guys i think Nintendo will release a videogame soon. 👀",
                "author": "Tosamnu"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Core UItra 9 290K Plus \"Arrow Lake Refresh\" CPU leaks again, now 10% faster than 285K",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Price is really going to matter here. The ultra 7 270k needs to release around the current price of the 265k. If they try to charge like 430 dollars for it like the 265k was when new, it’s a major flop. Same with the 250k.",
                "author": "RedditBoisss"
            },
            {
                "raw_content": "New BIOSes are out by most vendors, with explicit support for \"future Ultra CPUs\", so Z890 isn't dead yet. Remains to be seen if other than Core clocks, they managed to increase Ring/NGU/D2D clocks, as those could greatly improve gaming perf.",
                "author": "realPoxu"
            },
            {
                "raw_content": "Intel cancelled this product recently. Their recent slides and product sampling releases no longer have it. Just 270K, 250K and 250KF is getting launch",
                "author": "Ecstatic_Secretary21"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel sets a 7467 MT/s+ memory requirement for Panther Lake Arc B-series iGPU branding, slower configs show up as “Intel Graphics” [VideoCardz]",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly, I wish Intel would give these 'Intel Graphics' model numbers. An Intel Graphics on a N series SKU is going to be far weaker than a B370/B390 masquerading as 'Intel Graphics'. That or just give these ARC iGPUs that don't meet the RAM speed a number like ARC B370e/B390e instead.",
                "author": "Vaxtez"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Overclocker shares Ryzen 7 9850X3D binning results featuring 13 CPUs",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know how reliable the SP metric is but my 9950X3D is higher ranked than the fastest one according to my mobo. I feel like the benefits of overclocking with these chips is essentially useless though, for longevity and efficiency I think I'm just going to go back to stock clocks.",
                "author": "disgruntledempanada"
            },
            {
                "raw_content": "on my 9800X3D SP 114",
                "author": "Opteron170"
            },
            {
                "raw_content": "Well my 9950x3d has an SP rating of 120",
                "author": "smokin_mitch"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ACEMAGIC Retro X3 Mini-PC featured Ryzen 7 H 255 with Radeon 780M iGPU",
        "score": 19,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The Housing Market Is Swinging Toward Buyers (WSJ)",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna need it to fall off that swing before I open my wallet.",
                "author": "Crazyboreddeveloper"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/rbt4X",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Prices still too high.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "SpaceX acquiring AI startup xAI ahead of potential IPO, 1.25 Trillion valuation",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Startup” lmao",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "In other news, SpaceX will acquire the advanced autonomous robotics / self-driving automobile manufacturer Tesla ahead of potential IPO.",
                "author": "much_thanks"
            },
            {
                "raw_content": "XXX ticker inbound",
                "author": "BurtingOff"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Pledge to Invest $100 Billion in OpenAI Was \"Never a Commitment\" Says Nvidia's Jensen Huang",
        "score": 585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one cared who I was, until I put on the mask - Bain Huang",
                "author": "Doomfistyyds"
            },
            {
                "raw_content": "No. this wasnt circular financing it was an antitrust violation. to summarize: Nvidia announced a $100B investment in OpenAI in September 2025, but with a critical catch: the money had to be spent on Nvidia GPUs. Three weeks later, OpenAI signed actual contracts with Broadcom and AMD for custom chips instead, and the Nvidia deal still hasn’t been finalized months later. This is a textbook antitrust violation (illegal tying arrangement under the Sherman and Clayton Acts) — conditioning investment on exclusive purchases to foreclose competitors. I did a detailed explanation of it here: [https://geat.substack.com/p/the-ai-bubble-is-actually-monopoly](https://geat.substack.com/p/the-ai-bubble-is-actually-monopoly)",
                "author": "Electrical-Review257"
            },
            {
                "raw_content": "Circular financing deals rarely work out, glad that Jensen is starting to pull the plug.",
                "author": "ChadwithZipp2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is unsatisfied with some Nvidia chips and looking for alternatives, sources say",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if this is why the nvidia ceo said their deal was on thin ice a few days ago? Surely both of these stories have to be related somehow",
                "author": "rafark"
            },
            {
                "raw_content": "OpenAI is exploring alternatives to Nvidia's AI inference chips due to dissatisfaction with their performance. This shift comes **amid** ongoing investment talks between the two companies, with Nvidia previously planning a $100 billion investment in OpenAI. OpenAI has **engaged** with AMD, Cerebras and Groq for potential chip solutions, as it seeks hardware that can better meet its inference needs. Nvidia maintains its dominance in AI training chips but faces competition as OpenAI prioritizes speed and efficiency in its products, particularly for coding applications. **Source:** Reuters(Exclusive)",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Sounds like a leak to try to lower price in negotiations. I’ll believe it when I see it",
                "author": "Thorteris"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA CEO Jensen Huang comments on $100B OpenAI investment talk",
        "score": 356,
        "text_content": "Jensen Huang responding to questions around reported large-scale OpenAI investments, this is his latest statement. [Source](https://x.com/i/status/2018392887529230389)",
        "comments": [
            {
                "raw_content": "i also invite nvidia to invest 100billion in my company",
                "author": "crittyab"
            },
            {
                "raw_content": "Jesus... dont want to make him angry, feels like he can freak the fyck out. He is TOO calm in his words but his fscial expressions speak another language.",
                "author": "Beginning_Purple_579"
            },
            {
                "raw_content": "[Here](https://www.globenewswire.com/news-release/2025/09/22/3154146/0/en/OpenAI-and-NVIDIA-Announce-Strategic-Partnership-to-Deploy-10-Gigawatts-of-NVIDIA-Systems.html) is the original nVidia press release. They did say \"intends to invest up to $100 billion in OpenAI progressively as each gigawatt is deployed\", which is consistent with his \"one step at a time\" language here. Clearly they are still throwing boatloads of money at OpenAI, so the Tesla/xAI booster you're sourcing for this video may be somewhat prematurely celebrating.",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I’m going to be honest",
        "score": 108,
        "text_content": "I’ve been following all of this loosely since I watched Ray Kurzweil in a documentary like in 2009. It has always fascinated me but in the back of my mind I sort of always knew none of this would ever happen. Then in early 2023 I messed with ChatGPT 3.5 and I knew something shifted. And its honestly felt like a bullet train since then. Over the past several weeks I’ve been working with ChatGPT 5.2, Sonnet 4.5, Kimi 2.5, Grok etc and it really hit me…. its here. Its all around us. It isn’t some far off date. We are in it. And I have no idea how it can get any better but I know it will — I’m frankly mind blown by how useful it all is and how good it is in its current state. And we have hundreds of billions of investment aimed at this thing that we won’t see come to fruition for another few years. I’m beyond excited.",
        "comments": [
            {
                "raw_content": "Its a product of human nature. We have this internalized belief that nothing ever changes. I followed the exact same path as you.",
                "author": "EvilSporkOfDeath"
            },
            {
                "raw_content": "i used it last night to fix my computer, and it was surreal. skynet is here.",
                "author": "templeofsyrinx1"
            },
            {
                "raw_content": "Lots of people feel the same way and I love the LLMs as well, unfortunately it seems more and more like it isn't going to be the tech that gets us there. Vast bank of knowledge through the training data but it's running out of that data, and the lights are still off. I'm not saying that as a hater, but more so because I genuinely believe that the hype has the potential to hurt the advancement in AI as it reduces incentives to invest and pursue different avenues of research. I love the idea of singularity and a post scarcity world.",
                "author": "Nedshent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MIT’s new heat-powered silicon chips achieve 99% accuracy in math calculations",
        "score": 486,
        "text_content": "MIT researchers found a way to turn waste heat into computation instead of letting it dissipate. The system does not rely on electrical signals. Instead, temperature differences act as data, with heat flowing from hot to cold regions naturally performing calculations. The chip is built from specially engineered porous silicon. Its internal geometry is algorithmically **designed** so heat follows precise paths, enabling matrix vector multiplication, a core operation in AI and machine learning with over 99% accuracy in simulations. Each structure is microscopic, about the size of a grain of dust and **tailored** for a specific calculation. Multiple units can be combined to scale performance. This approach could significantly **reduce** energy loss and cooling overhead in future chips. While not a replacement for CPUs yet, near term uses include thermal sensing, on chip heat monitoring and low power. **Source:** [MIT](https://news.mit.edu/2026/mit-engineers-design-structures-compute-with-heat-0129#:~:text=The%20structures%20performed%20computations%20with,need%20to%20be%20tiled%20together.)",
        "comments": [
            {
                "raw_content": "99% sounds like a lot till you remember the trillions of operations needed in most modern applications. Also, matrices of size 2x2 and 3x3. A good start but with some distance to go.",
                "author": "ReasonablyBadass"
            },
            {
                "raw_content": "The research published in the Physical review and [Paper](https://journals.aps.org/prapplied/abstract/10.1103/5drp-hrx1)",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Volcanic data centers now?",
                "author": "spikehamer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: Get started with Codex",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So many of their apps are windows coming never…",
                "author": "ataylorm"
            },
            {
                "raw_content": "Is this their spin of Antigravity?",
                "author": "lucellent"
            },
            {
                "raw_content": "100 ways to skin the same product",
                "author": "ChippHop"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google sequencing genome of endangered species",
        "score": 16,
        "text_content": "https://x.com/Google/status/2018400088788222275?s=20 Seems marginally useful but another one for the sciences!",
        "comments": [],
        "subreddit": "singularity"
    }
]