[
    {
        "post_name": "Why isn't every single person in America celebrating the fact that the federal government hit a historic $200 billion surplus in September?",
        "score": 618,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep the whole fuckin' thing shut down. At least 95% of the govt is useless.",
                "author": "Cyberpunkd"
            },
            {
                "raw_content": "Because this surplus has not helped lower my bills or my groceries.",
                "author": "KiaAngel"
            },
            {
                "raw_content": "Because we have a 2 trillion dollar yearly deficit and are 37 trillion in debt.",
                "author": "HappyFunBall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago Mayor Brandon Johnson is now proposing a new \"head tax\" to fix the deficit after destroying their budget. All companies employing 100+ people in Chicago will have to pay a tax of $21 per employee per month, simply for having employees.",
        "score": 510,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats will tax anything and everything. It's all they know.",
                "author": "HopingtobeFree"
            },
            {
                "raw_content": "Good. I hope they enjoy every minute of this tyrant. They voted for this, give it to them good and hard.",
                "author": "RoosterRaiser"
            },
            {
                "raw_content": "Worked out great for Seattle. Just ignore the corporate real estate vacancies.",
                "author": "Snek_Plissken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A “Blue Slip” means that if you’re a Republican President, and there happens to be just one Democrat Senator in a state where you are appointing a U.S. Attorney or District Court Judge, you will never be successful in getting a Republican",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds illegal to me. Backroom deal good ol boys quid pro quo bullshit. We will never get anywhere until Trump appoints a real attorney general. Pam Bondi sucks!",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "If the situation is reversed, and there is 1 republican senator and a democratic president, the ONLY be succesful in getting a Democrat confirmed becasue the republicans are giant pussies",
                "author": "super_pede"
            },
            {
                "raw_content": "The blue slip method in the Senate is some corrupt shit. Do you think democrats give a rats ass honoring blue slips. Tell them to eat shit.",
                "author": "Exsultate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MODERATOR: \"But the question is how you'll make [buses] free.\" MAMDANI: I'm going to raise taxes by $9 billion.",
        "score": 1026,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He wants to raise these taxes in the entire State of NY so New York City people can ride free buses. GFY loser.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "You know, at this point, I want to see this guy win. NYC deserves him and the complete collapse that comes with him",
                "author": "daveyistheman"
            },
            {
                "raw_content": "The mayor of New York City does not have the unilateral power to raise taxes. In NYC, tax policy and changes typically involve collaboration with the City Council, the state government, and sometimes the federal government, depending on the type of tax. Here's how it works: City Taxes: The mayor can propose new taxes or tax increases (like property taxes, income taxes, etc.), but these proposals have to be approved by the New York City Council. The Council has the power to enact, modify, or reject tax proposals. For example, the mayor might propose an increase in property taxes or a new surcharge on businesses, but the City Council would need to pass a bill to make it law. State Taxes: For taxes that involve state authority (like state income tax), the mayor doesn't have direct control. The governor and the New York State Legislature would have to approve any changes to state-level taxes, even if they impact NYC residents.",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨GREG GUTFELD ON SATURDAY'S LEFT-WING PROTEST: \"I love the No Kings thing. Because its very existence proves it's not necessary. If this was a King-led country, you wouldn't be allowed to have your No Kings protest.\" \"I mean, who are you protesting? Spain, Denmark, Cambodia?\"",
        "score": 1377,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lefties are always coming up with some slogan or movement that's a complete non sequitur.",
                "author": "VoteThing"
            },
            {
                "raw_content": "Someone should ask them who the last king of the USA was.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "I like the No Kings thing because it causes me to imagine President Trump being our actual king, and it makes me happy.",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump just sounded the alarm that his US Attorneys CAN’T get confirmed because Democrats convinced Sen. Chuck Grassley (R-IA) to allow them to be stopped under the “blue slip” tactic.",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what happens when Dominion rigs the primaries and picks the congresscritters during the presidential election. It's all to keep Trump hamstrung. It's sickening and disgusting.",
                "author": "BeauHD"
            },
            {
                "raw_content": "Grassley has been a gov't stooge his entire career.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "What the fucking fuck is this tradition I’ve never heard of before?",
                "author": "Eatinglue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stacey Abrams-Founded Political Group Collapses After Record $300,000 Ethics Fine",
        "score": 1149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Enough with the fines. Throw this fat cow cunt in prison.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "THAT’S YUGE",
                "author": "Skogin"
            },
            {
                "raw_content": "\"....Collapses After Record 300,000 lbs founder sat on it!\"",
                "author": "3percenterFan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NY AG Letitia James’s family troubles keep growing, her 21-year-old grand-niece, an OnlyFans model, was arrested for lying about a felony record to buy a gun, and another niece is on the run.",
        "score": 648,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trash ass culture",
                "author": "Obamas_Goatse_Party"
            },
            {
                "raw_content": "\"Dancer\"",
                "author": "Crappydatum"
            },
            {
                "raw_content": "It is a black family, what do you expect?",
                "author": "Username_here"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of Transportation strips $40M from California for refusing English proficiency",
        "score": 1642,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stripping 40 million from California is like telling them they can’t have dessert one night a year. Need to take more to have an effect",
                "author": "john9985"
            },
            {
                "raw_content": "Now...States should start to refuse to Honor CA Drivers Licenses. ...and why not...CA doesn't honor anyone's CCAs because of their 'Stringent Requirements'...",
                "author": "Moebius"
            },
            {
                "raw_content": "English is a third language for a lot of squaters in California.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAJOR BREAKING: Disgraced former National Security Adviser John Bolton has been INDICTED by a federal grand jury for mishandling classified information",
        "score": 1640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "He was charged under the Espionage Act That's heavy time if convicted.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "So is he being arrested or does he have a month to decide when he wants to show up like Comey?",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois State Police LAUNCHES a liberal terrorlst that refuses to move back..",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love to watch launches!",
                "author": "ythehorses"
            },
            {
                "raw_content": "Not thrown hard enough",
                "author": "bck-"
            },
            {
                "raw_content": "blocking a public road is not peaceful. STFU you liberal terrorists",
                "author": "hunterforprison"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Department of War builds the big beautiful wall",
        "score": 1384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now create a 20 mile DMZ into Mexico, demolish anything in that region with a weapons free RoE",
                "author": "BoomShtick"
            },
            {
                "raw_content": "For Charlie!",
                "author": "UltraMagaNeil"
            },
            {
                "raw_content": "Yep, that's a government project. You have one guy working and... 6 guys standing around doing nothing.",
                "author": "Ramasun"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Kings ~ lots of commies for being a “pro-America” protest",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should start a NO Commie march",
                "author": "snakeoil"
            },
            {
                "raw_content": "More sponsors than virtually anything over ever seen LOL",
                "author": "MagaJay02"
            },
            {
                "raw_content": "No billionaires, except ones like Pritzker",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: Appeals Court Upholds Biden Judge’s Block on Trump Troop Deployment in Chicago",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SCOTUS to dump on these faggots incoming?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Don’t care. Still going in.",
                "author": "PensivePatriot"
            },
            {
                "raw_content": "They’re planning something bloody this weekend",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Islam is a tumor to the world",
        "score": 1345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam and Judaism, destroying the world together.",
                "author": "Lk4000"
            },
            {
                "raw_content": "Yup. Islam is a cancer on humanity.",
                "author": "UpwardBound"
            },
            {
                "raw_content": "A tumor is sometimes non-malignant. Pisslam never is. Pisslam is a cancer on the world.",
                "author": "2016TrumpMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: ICE has just arrested an illegal immigrant who is an ACTIVE Illinois Police Officer. Illinois is literally ARMING ILLEGALS and having THEM enforce laws on citizens. INSANITY! This falls SQUARELY on JB Pritzker and the democrats.",
        "score": 1895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Officer No Name Given.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "I wonder if all his arrestees will appeal. Way to go, Illinois! 👍",
                "author": "IllKissYourBoobies"
            },
            {
                "raw_content": "Imagine being handcuffed by an illegal immigrant.",
                "author": "SkullE"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Casinos have cameras. Show me the footage",
        "score": 1553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The casino would issue a 1009, which he would attach to his return. File a FOIA.",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "There must be some mistake. The headline should read: Billionaire Illinois Governor JB Pritzker blew $1.4 million on flapjacks in a Las Vegas casino buffet line.\"",
                "author": "LibertyFox"
            },
            {
                "raw_content": "Money laundering.",
                "author": "TheAftermath"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bolton judge is anti MAGA Trump hater",
        "score": 827,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He looks like he has beef with the Mongorians.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Dual citizens should not be allowed to serve as an elected official at any level of government. \"In the first place, we should insist that if the immigrant who comes here in good faith becomes an American and assimilates himself to us, he shall be treated on an exact equality with everyone else, for it is an outrage to discriminate against any such man because of creed, or birthplace, or origin. But this is predicated upon the person's becoming in every facet an American, and nothing but an American...There can be no divided allegiance here. Any man who says he is an American, but something else also, isn't an American at all. We have room for but one flag, the American flag... We have room for but one language here, and that is the English language... and we have room for but one sole loyalty and that is a loyalty to the American people.\" Theodore Roosevelt",
                "author": "cjsr4c90"
            },
            {
                "raw_content": "The judge in Comey's case is not only a Biden appointed activist but a personal friend of Comey's. This is why arrests are a waste of time. None of these people will be convicted and the media will say that they've been vindicated. Trump needs to be honest and tell the country that we're captured, and that what happens next is up to the American people.",
                "author": "berserkerbarrage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The average Social Security recipient gets $1200/mo after working 50+ years. The average illegal “refugee” gets $3874/month after being in America for 50 minutes. And that should INFURIATE everyone.",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Add in H-1B and all the other job giveaways costing Americans at least $50k/year in retirement credits and shit's about to hit the fan.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "And we're borrowing like crazy to fund this",
                "author": "Crappydatum"
            },
            {
                "raw_content": "I'm not paying taxes this year. I'm done. No reason to post this, or not to post this. I'm just done.",
                "author": "Spawnlingman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa Members Face First-Ever Terrorism Charges From DOJ",
        "score": 1337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GOOD! More to come, I hope!",
                "author": "RoninIV"
            },
            {
                "raw_content": "BBWAAAAAAHHHHT????? I thought antifa didn’t exist???? I guarantee that their lawyers will try to use that trope. And it all comes down to where the judges are at on the communist spectrum.",
                "author": "CrustySockpuppet"
            },
            {
                "raw_content": "\"Antifa cell members\" might be a better description given that, like ISIS, they are a movement rather than a single organization. I'm not saying this to nitpick, but rather to help people understand what Antifa is so they can more easily cut through the bullshit \"Antifa doesn't exist\" propaganda.",
                "author": "gustodog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Microsoft aims to make most new products outside China from 2026: sources",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Archived, non-paywall link: [https://archive.is/3Q0fu](https://archive.is/3Q0fu)",
                "author": "AK-Brian"
            },
            {
                "raw_content": "Oh right I forgot Microsoft makes hardware too",
                "author": "LinusDuckTips"
            },
            {
                "raw_content": "Ok, so - if I'm understanding this right - Microsoft is concerned about US/China relations, so they're moving prodution to Thailand? Bold move, Cotton. Let's see if it pans out.",
                "author": "tehfly"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First M5 10-core variant geekbench scores appear",
        "score": 28,
        "text_content": "The first geekbench scores for the M5 10-core variant have appeared. (iPad only) Biggest I’ve seen: SC: 4190 MC: 16550 GPU: 75769 https://browser.geekbench.com/v6/cpu/14490196 https://browser.geekbench.com/v6/compute/5025116",
        "comments": [
            {
                "raw_content": "Macbook Pro variant is clocked slightly higher, 4263 sc : https://browser.geekbench.com/v6/cpu/14496729 . Considering the clocks and comparing to the iPad's score, it's possible the iPad is an outlier higher score, while the MBP is a middling score. Also, it's almost halfway up to top of the 1st page of highest sc scores on GB https://browser.geekbench.com/v6/cpu/singlecore",
                "author": "mavere"
            },
            {
                "raw_content": "that gpu score is actually crazy",
                "author": "certainlystormy"
            },
            {
                "raw_content": "M5 performance in blender with the new RT cores will be neat to see.",
                "author": "AWildDragon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "x86 opcode/CPUID/MSR allocations \"in active use by a corporate entity other than Intel/AMD\" sent to Linux Kernel and Binutils email lists",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "these all seem to be 16bit or 32bit instructions. the patents on those should be expired or near expiring in the near future, so im guessing someone out there is getting ready to make some x86 compatible chips.",
                "author": "randomkidlol"
            },
            {
                "raw_content": "There are still ALOT of 486’s in the wild. Intel made them until the end of 2007. This is probably designed to fill that hole. It’d be wild if it was something backed by Pat Gelsinger since he designed the 486. I could see it in Aerospace or embedded or something along those lines",
                "author": "JRAP555"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "M5 for MacBook Pro 200MHz higher at 4.61GHz than M5 in iPad Pro.",
        "score": 11,
        "text_content": "https://browser.geekbench.com/v6/cpu/14496729 Looks like Apple is clocking the base M5 higher in the actively cooled MacBook Pro. The iPad Pro M5 is clocked at 4.42GHz. ST: 4263 MT: 17862",
        "comments": [
            {
                "raw_content": "I will be quite curious how efficiency under load compares—I'm not necessarily optimistic, but we'll see soon in the next month. The A19 Pro P-cores certainly let itself [eat more power for not necessarily commensurate perf improvements](https://youtu.be/Y9SwluJ9qPI?t=175) and that was in a passive, lower-clocked, tiny phone (relative to these actively cooled laptops). Perf / W in floating point [is among the lowest](https://www.reddit.com/r/hardware/comments/1njl1xz/comment/nerrr9i/). If the A19 Pro P-core needs 11W at 4.26 GHz (SPECfp2017), M5 in MBP at 4.61 GHz is likely easily 15W. Sigh, a far cry [from the M1's \\~7W](https://web.archive.org/web/20201118000203/https://www.anandtech.com/show/16252/mac-mini-apple-m1-tested). Again, don't @ me about \"it's race to idle\" **until** there are joules and / or battery life measurements under load.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": ">Looks like Apple is clocking the base M5 higher in the actively cooled MacBook Pro. >The iPad Pro M5 is clocked at 4.42GHz. Well duh",
                "author": "empty_branch437"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China's GPU Competition: 96GB Huawei Atlas 300I Duo Dual-GPU Tear-Down",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too bad they didn’t benchmark the thing. Even without proper support would have made a nice comparison to see just how fast it is.",
                "author": "IIlIIIIlIIIlIIIlIIIl"
            },
            {
                "raw_content": "Tomorrow's Headline: Gamer's Nexus labeled \"unreliable entity\", now banned in China.",
                "author": "Tasty-Traffic-680"
            },
            {
                "raw_content": "Interesting... given the pace of innovation in China, Im sure we will see more powerful GPUs pretty soon. The full uber-doco on \"NVIDIA GPU Blackmarket .. \" and smuggled GPUs is a fascinating must-watch : https://www.youtube.com/watch?v=1H3xQaf7BFI Great feature length journalism from Gamers Nexus !",
                "author": "justgord"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ChosunBiz: \"TSMC price hikes push Qualcomm, MediaTek toward Samsung Foundry\"",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly QC should be doing their budget chips all on Samsung for a while now and use TSMC only for flagship PC and phone space",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "Funny how Intel isn't even mentioned in the rumor mill here lol. Mobile + tablet + laptop account for the overwhelming majority of **all** leading-edge node output. GPUs, AI, all desktop, servers, etc. all are secondary and much smaller on the *leading* edge. They are usually all n-1. If Intel wants to be taken seriously on the leading-edge or even close to it (18A, 14A, etc.), it **needs** major mobile / tablet / laptop SoC fabrication contracts.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Great! This should ensure some price pressure on TSMC and further development elsewhere.",
                "author": "letsgoiowa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's 6th-gen DRAM (1c DRAM) yields have reached 70%. HBM4 sample yields have reached 50% according to sources",
        "score": 31,
        "text_content": "Summarized a fresh Korean article: [https://www.etnews.com/20251016000257](https://www.etnews.com/20251016000257) Samsung is reportedly on the verge of mass-producing its 6th-gen DRAM (1c DRAM) — the chip that will power next-gen HBM4 memory. Sources say yields have reached around 70% and are nearing the 80% target required for full-scale production. This is a big deal because 1c DRAM uses an 11–12nm process, ahead of competitors like SK Hynix who are still using 1b DRAM for their HBM4 stacks. Samsung hopes this leap will help it regain leadership in the AI memory market, where Hynix has dominated with its HBM3 and HBM3E products. The company has been redesigning its DRAM architecture under Vice Chairman Jun Young-hyun to fix core technical weaknesses and boost competitiveness. Yield improvements for both 1c DRAM and HBM4 (now around 50% at sample stage) suggest this strategy is working. Samsung is currently installing production equipment at its Pyeongtaek P4 fab and is testing HBM4 modules with NVIDIA. If the qualification phase goes well, mass production could start as early as next month — potentially shaking up the current AI memory race.",
        "comments": [
            {
                "raw_content": "I suppose the AI hype machine will swallow it all up. At least while the hype lasts.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "How much is hbm3 cost per GB? We'll want it for laptop",
                "author": "Awkward-Candle-4977"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA DGX Spark – A Non-Sponsored Review (Strix Halo Comparison, Pros & Cons)",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you want to train, fine-tune, test, networking, learn, etc with the eventual goal of deploying on the cloud or buying large servers. This is the best option you have. Everything will smoothly transition over due to being the same architecture. The 1TB version is $3000 from OEMs But this one isn't worth it for personal use and just running local already quantized LLMs. A strix halo and M4 Pro will provide equal performance when they all hit the similar bandwidth limit. (When not accounting for FP4) However there is going to be consumer version of the GB10 chip called the N1 or N1X. That will be cheaper and more mass market orientated. Probably going to be announced around CES in January So if you want one for cheaper and more pc orientated that's the one you should keep an eye out for.",
                "author": "From-UoM"
            },
            {
                "raw_content": "Feels disappointing. Big win for AMD though",
                "author": "Slasher1738"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokémon Legends Z-A Megathread",
        "score": 60,
        "text_content": "Pokémon: Legends Z-A is officially out! Feel free to post pictures and discussion here! Who did you pick as your starter? What rank are you currently at? How does your trainer look?",
        "comments": [
            {
                "raw_content": "Music goes absurdly hard",
                "author": "Aidan96"
            },
            {
                "raw_content": "One of the most fun Pokemon games in a long time. The battles are so damn unhinged",
                "author": "ambachk"
            },
            {
                "raw_content": "I picked Tepig but then boxed him bc I’m having an all-bird team for this game lol. Pidgey and Fletchling are my main two so far. First impressions- I like it a lot and it’s pretty darn fun . Far too many cutscenes in the early game, though, and the new mechanic takes a bit of getting used to.",
                "author": "KestrelQuillPen"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Overly Attached Girlfriend",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "first night in Lumiose Urbain knocked my door at the night and asked me to go to the rooftop. Ummm, didn’t expect to be this fast 😳",
                "author": "yeyereddaddy"
            },
            {
                "raw_content": "Thats cute, THIS is borderline Yandere: https://preview.redd.it/1m3wntjzjkvf1.png?width=1080&format=png&auto=webp&s=f4301c48fff81e0136443e23db91225bf0a20765",
                "author": "SatyrAngel"
            },
            {
                "raw_content": "Nah. She just believes in you. Do your best!",
                "author": "FSThree"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends Z-A is fun and looks better than I thought on Switch 2!",
        "score": 838,
        "text_content": "I grow up playing Pokemon games on my GameBoy, so I’m an old school fan. I started the game, played the first hour and I have to say that it runs and looks better than I expected. Of course it’s far from being a technical marvel, but on Switch 2 is at least enjoyable. I like the real time combat and the general atmosphere. The lack of voice acting though is a shame, it would have been a great new addition to the series. Are you guys enjoying it?",
        "comments": [
            {
                "raw_content": "People not wanting Pokemon to have voice acting is just ludicrous, things have to change",
                "author": "Big-daddy-Carlo"
            },
            {
                "raw_content": "Is this a good game to start at for Pokemon? I've never played Pokemon other than Go which I know is nothing like the rest. Edit: I should mention, I'm not new at gaming, I just never played Pokemon before. I'm not planning on playing all of them either. I'm just wondering if I should try Z-A or maybe one of the Switch 1 titles (or something on NSO) instead",
                "author": "predator-handshake"
            },
            {
                "raw_content": "Got it today but have just played the first 2 missions. Combat is fun from what I can tell so far. Looking forward to more battles and building a squad. It could absolutely look better though and to me that is a real shame. I really want to see a fully realized pokemon game with a lot of effort put into it one of these days. As a kid growing up and watching the anime I figured the world was vast and beautiful and mysterious - I want to play through that.",
                "author": "Rechamber"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mariokart 8 Deluxe will have the longest online support in Mariokart history",
        "score": 261,
        "text_content": "Mariokart 8 Deluxe released in 2017, putting it at 8 years old at the launch of the Switch 2. Since the Switch and Switch 2 share the same online service (Nintendo Switch Online), it will remain online for the entire lifespan of the Switch 2, giving at least 16 years of support. Assuming the next console is potentially not a Switch, it will have, at the bare minimum, another 4 years of support. This means at least two DECADES of Mk8 Deluxe. MKDS - 9 years MK Wii - 10 years MK 7 - 13 years",
        "comments": [
            {
                "raw_content": "If only it would receive a Switch 2 performance upgrade...",
                "author": "pawlik23"
            },
            {
                "raw_content": "I honestly think it’s a better game than Mario Kart 9",
                "author": "__TheWaySheGoes"
            },
            {
                "raw_content": "Makes sense, Mario Kart 8 uses P2P, not servers. So its requires minimal support other than maybe matchmaking servers and the occasional “stability” update.",
                "author": "cuntpuncherexpress"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trails in the Sky First Chapter Switch 2 Edition 1.05 performance mode tested in handheld and docked modes",
        "score": 97,
        "text_content": "I remember reading some comments on my last thread about how Gungho's promised modes didn't materialize at launch. Falcom and Gungho have pushed version 1.05 internationally and here's what seems to have changed. Note I have a 1440p monitor for my docked setup. Switch 2 games seem to be resolution aware (Ys X Proud Nordics even dynamically adjusts resolution based on the GameChat window size), so it could have different chararistics when played docked to a 4K display. **Quality mode:** Looks and runs identical to pre-patch. So what appears to be 90% of 1440p in docked mode and 90% of 1080p in handheld mode, with SMAA antialiasing applied to smooth edges. Both target 60fps but fail to hit it consistently, leading to busy areas stuttering (town centers, large fields). This is by far the most disappointing part of the update, as the game was already hitting 50-60fps and VRR could have been used in handheld mode to smooth this out without any other changes. **Performance mode:** Turns off SMAA and uses FXAA instead. Graphical settings seem unchanged, so there are still screen space reflections, volumetric lighting, the same far draw distance for grass and so on - all improvements in the NS2 Edition retained. Performance mode now utilizes dynamic resolution scaling from 1440p in docked and 1080p in handheld mode to hit a 60fps target. The framerate is now rock solid, I did not notice any drops in the troublesome areas from before. The resolution floor in docked mode is still acceptable, but I think handheld mode can get quite blurry looking in busy areas. I have attached some ***quality vs performance mode comparison screenshots from handheld mode*** in a populated and less populated area for you to judge for yourself. Hope this helps anyone on the fence, and happy gaming!",
        "comments": [
            {
                "raw_content": "Thanks for the post,glad to hear performance mode is more stable, will pry go with that docked and quality for handheld mode",
                "author": "biofrost"
            },
            {
                "raw_content": "Thanks for the update. I know very little about this game but it's probably going to be my next purchase whenever I finish FFT.",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "Is there a switch 2 proper demo yet",
                "author": "totofogo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New patent filed by Nintendo. Some people say it's for DS NSO, but it might just be for GameShare.",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can see this being for DS NSO. If they're making an effort for Virtual Boy games to be played in 3D, they'll make a big effort for a system that people actually like.",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "DS and 3DS would be very good moves for Nintendo this generation. Those and Wii.",
                "author": "therourke"
            },
            {
                "raw_content": "Why it might be for DS: It shows a game played with two screens, first through GameShare (child apparatus/parent apparatus) - shows two Switches; but then it also shows a \"Single-Screen mode\", with two options: both \"pictures\" on the same screen, and the option to switch between the two pictures - and it's an example of overworld for one picture, and a map for the other picture. Now, these separately would mean nothing, but together, they feel like they try to make dual-screen games work for Switch 2 (which likely means DS NSO).",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Legends: Z-A finally arrived (Germany)",
        "score": 178,
        "text_content": "I am 32 Years old now and played thru all Pokemon Titles up to the Smaragd Edition on the Gameboy Advanced SP back in the Day. Now I am a Father Myself and I can't wait to see how Pokemon has evolved since the Gameboy... Happy Playing everyone!",
        "comments": [
            {
                "raw_content": "Why is that rating so big 😭",
                "author": "paccodemongrel"
            },
            {
                "raw_content": "You don't need to say Germany. Your USK logo is talking for you :D Enjoy the game !",
                "author": "peperlito"
            },
            {
                "raw_content": "Thank God I live in Asia where Age Rating shows behind the box so the front looks clean (except the bottom text still there for S2 edition)",
                "author": "duragonn98"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Possible screenshots of Demon souls using low power mode on PS5",
        "score": 284,
        "text_content": "menu icon: https://ibb.co/2YZrwMhd in the graphic options: https://ibb.co/hbC4nWm game images: https://ibb.co/V04744kp Source: https://www.resetera.com/threads/ps5-to-recieve-power-saving-mode-which-will-scale-back-performance-on-compatible-games-rumored-to-be-used-as-upcoming-portables-power-target.1250814/page-4",
        "comments": [
            {
                "raw_content": "my psp3 will be ready",
                "author": "ayyybro123"
            },
            {
                "raw_content": "I wonder what this supposedly new portable will be equivalent to in terms of performance.",
                "author": "powerhcm8"
            },
            {
                "raw_content": "Are we entering in the handheld wars era?",
                "author": "DanielDCMarvelFan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloomberg: Nintendo aiming to produce as many as 25 million Switch 2 units by end of March 2026",
        "score": 151,
        "text_content": "[Source](https://www.bloomberg.com/news/articles/2025-10-17/nintendo-switch-2-production-plan-25-million-units-by-march-2026?)",
        "comments": [
            {
                "raw_content": "That's a massive jump from their previous plan to produce 15 million. Especially considering it's been readily available for months already.",
                "author": "Sad_Locksmith_5997"
            },
            {
                "raw_content": "it's Takashi Mochizuki. so this has a 15% chance of being correct. i don't know how he still works at Bloomberg",
                "author": "Alhttani"
            },
            {
                "raw_content": "Man I really just don't see switch 2 being as successful as switch 1. The price and game prices and economy... Just don't see it hitting personally",
                "author": "empathetical"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RUMOR: Nintendo patent may point to Nintendo DS content coming to Switch/Switch 2",
        "score": 629,
        "text_content": "[Source](https://gonintendo.com/contents/53951-rumor-nintendo-patent-may-point-to-nintendo-ds-content-coming-to-switch-switch-2)",
        "comments": [
            {
                "raw_content": "having the DS and 3DS available on Switch/Switch 2 would be great. At that point there'd just need to be wii / wii u NSO and we'll have the full nintendo lineup on one system.",
                "author": "DKLancer"
            },
            {
                "raw_content": "Hotel Dusk please",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "It would be cool if they came to NSO, but I also would rather we just get actual ports for a lot of the DS games I'd want to play. Super Mario 64 DS and Metroid Prime Hunters with actual stick functionality. The Pokemon games ported for a single screen experience. The Zelda games ported however the heck you have to for them to be conventionally playable with a controller (they'll probably both get remade tbf)",
                "author": "TheLimeyLemmon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony visited Tencent for a potential The Last of Us collaboration",
        "score": 245,
        "text_content": "[Source](https://thegamepost.com/tencent-the-last-of-us-game-sony-horizon-rejected/) This comes from a declaration of Olivier Courtemanche, Head of Mobile at PlayStation Studios, (Sony vs. Tencent lawsuit over Light of Motiram) Sony visited Tencent in July 2024 \"to discuss a variety of partnership opportunities with Tencent and its game studios, including Aurora Studios. With respect to Aurora Studios, we went into the meeting under the impression that they wanted to do a potential collaboration for The Last of Us.\"",
        "comments": [
            {
                "raw_content": "This isn’t a rumor if it’s coming directly from court filings. Also nothing came out of the meeting apparently.",
                "author": "ZXXII"
            },
            {
                "raw_content": "Nothing came out of the meeting. Don't think Sony and Tencent will be colloborating in the near future either way. Since Sony are currently suing Tencent (rightfully so) over the copycat Horizon game.",
                "author": "-LastGrail-"
            },
            {
                "raw_content": "The Gachast of Us.",
                "author": "djluke_1993"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AncientGameplays - Interviewing AMD's Adam Kozak - Adrenalin Software, AFMF 3, FSR Redstone, Machine Learning & More!!",
        "score": 240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dude has basically been the face of AMD GPUs and software on YouTube. Good for him.",
                "author": "TheKangaroobz"
            },
            {
                "raw_content": "Well done Fabio",
                "author": "kaisersolo"
            },
            {
                "raw_content": "Wow. Someone gained influence and moved up a rung. Congrats!!",
                "author": "Crazy-Repeat-2006"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "FHA loans to H1B temporary workers were making the housing market unaffordable",
        "score": 307,
        "text_content": "",
        "comments": [
            {
                "raw_content": "airBnBs have entered the chat. H1B visa workers are not everywhere. They're centered around metropolis hubs and medium/large cities. You know what is everywhere? airBnBs. Too many people over leveraged themselves to buy 2, 3, 4 properties and rent them out per night for exorbitant cleaning fees and admin fees. Now airBnB is crashing and these people are stuck with multiple mortgages. The amount of single family homes in my area bought and removed from the housing pool by people who don't actually live there is a plague.",
                "author": "Delicious-Bat2373"
            },
            {
                "raw_content": "It contributed, I'm sure. But the bigger issue is the proliferation of mom and pop investors.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "So... FHA loan originations to H1B workers **SPIKED at 6%?** Remind me again how many \"Investors\" purchased homes in this time period? 20%? 25%? H1B workers aren't your enemy...",
                "author": "NorCalJason75"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "K-shaped economy: Why the wealthy are thriving as most Americans fall behind",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "By design. They are thriving because they are profiteering off it.",
                "author": "Intelligent-Wash-373"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Regional banks and Jefferies shares tank as concerns grow on Wall Street about sour loans",
        "score": 37,
        "text_content": "Shares of regional banks and investment bank Jefferies tumbled on Thursday as fears mounted around some bad loans lurking on Wall Street. The bankruptcies of two auto industry-related companies this year have raised concerns about loose lending practices, especially in the opaque private credit market. That’s left both the banking industry and investors concerned about whether instances of loans gone wrong indicate a burgeoning crisis. The latest signs of trouble came when Zions said Wednesday evening it faced a sizable charge because of bad loans to a couple of borrowers. Western Alliance then alleged Thursday a borrower had committed fraud. https://www.cnbc.com/2025/10/16/regional-banks-and-jefferies-shares-tank-as-concerns-grow-on-wall-street-about-sour-loans.html Usually regional banks are first to get hit and looks like they might holding a lot of toxic loans in their books and investment banks might be having similar problem. Unlike 2008 we might have slew of problems (CRE, auto loans, Residential RE loans to over lev investors, student loans, business loans..)",
        "comments": [
            {
                "raw_content": "Nothing that a rate cut won't solve....not.",
                "author": "hottertime"
            },
            {
                "raw_content": "Nothing ZIRP & money printer Brrrr won't fix",
                "author": "Brs76"
            },
            {
                "raw_content": "Nothing like a good ol' *credit crunch* to boost the economy",
                "author": "WrongThinkBadSpeak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed Governor Miran wants a half-point cut this month, while Waller backs another quarter-point move",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think you'll see a big drop in interest rates and the Fed will do a significant QE, they want people with money for the holidays so they will not feel despair, a sudden influx of money will cheer everybody, many will refinance and the \"extra\" money will activate the economy for a short period the goal is to make people forget what is coming in January. I'll dare to say it will start on dec 21 on the stock markets with small drops. And Jan 5 will be the main event.",
                "author": "Kykovsky"
            },
            {
                "raw_content": "Stagflation baby",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "And the 10y and MBS will shrug it off like they have the last 100 basis points. Inflation expectations are set and the fed has indicated they'll also likely sell off MBS from their balance sheet. Slowing QT vs new issuance will be the fight to watch in 2026.",
                "author": "Rude_Judgment7928"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seattle Tech Workers Are Fueling a Real-Estate Rush in the Cascade Mountains",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh, if I’m staying close to the city I’d rather buy on the San Juan islands.",
                "author": "regaphysics"
            },
            {
                "raw_content": "non-paywall (WSJ): https://archive.ph/r6E7U",
                "author": "SnortingElk"
            },
            {
                "raw_content": "There’s no way I’d live out there. Eventually, inland Pacific Northwest will dry out like California has. It will take one bad fire for insurance companies to drop homeowners insurance policies. As resort areas go, I have my eye on Port Ludlow….a modern one level home with an ocean view, and with resources 20 minutes out.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Journalist debunks environmental attacks on AI",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If I remember correctly, they’re a video game journalist and specializes in TikTok commentary.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "If you use AI every single day, several times a day, for an entire year, you can offset the energy/water cost by eating ONE less cheeseburger during that period.",
                "author": "jferments"
            },
            {
                "raw_content": "I prioritize my worry. AI isn't one of them.",
                "author": "ogthesamurai"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Yamaha self balancing cycle",
        "score": 873,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this so fucking cool i want one",
                "author": "krayon_kylie"
            },
            {
                "raw_content": "![gif](giphy|12CSpwCtoy1Vfy) 6 years late, but I'll take it.",
                "author": "Key-Statistician4522"
            },
            {
                "raw_content": "That‘s one weird looking piano",
                "author": "tirolerben"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Australian startup beats OpenAI, Google at legal retrieval",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is with this graph lol. Is the curve some best fit line and then the area below is shaded just because?",
                "author": "PandaElDiablo"
            },
            {
                "raw_content": "If you focus on one single task, you can beat any big company.",
                "author": "Formal_Drop526"
            },
            {
                "raw_content": "I wasn't able to include the link in the cross-post so here it is. **Hugginface announcement:** [https://huggingface.co/blog/isaacus/introducing-mleb](https://huggingface.co/blog/isaacus/introducing-mleb) **Model announcement:** [https://isaacus.com/blog/introducing-kanon-2-embedder](https://isaacus.com/blog/introducing-kanon-2-embedder) **Github repo (open source):** [https://github.com/isaacus-dev/mleb](https://github.com/isaacus-dev/mleb)",
                "author": "Neon0asis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The new “OpenAI for Science” team",
        "score": 160,
        "text_content": "OpenAI seems to want to challenge Google in the field of scientific research. Altman said that the new challenge for models was to make real discoveries; tournaments and medals are now over. I can't wait to see the fruits of this competition.",
        "comments": [
            {
                "raw_content": "Love to see a charged Altman, SORA2 proves OpenAI has the moat to defend itself form the Google Challenge",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "This would be tier four or what they described to be \"Innovators.\" When I think about OAI's capabilities for AGI: Chatbots - Reasoners - Agents - Innovators - Corporation Management It reads like different \"stats\" they are pushing for. Chatbots at least I think are nearly \"maxed\" and really only change in terms of user preference and voice modes. When all five capability stats are maxed, we'll likely have AGI. Just needs persistent online learning.",
                "author": "Stunning_Monk_6724"
            },
            {
                "raw_content": "google's gonna destroy them either way considering the team behind deepmind vs openai also google just has more funding than god vs openai thats losing crazy money with barely any revenue",
                "author": "YaBoiGPT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google DeepMind partners with fusion startup",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Abundant energy is one of if not *the* most crucial factors in improving global well-being. Demis himself talked about how abundant energy equals abundant water supply via desalinization. Makes sense that they're targeting this. Along with their biological focus for fighting disease they're making the right moves and partnerships.",
                "author": "space_lasers"
            },
            {
                "raw_content": "If it happens, AI helping to solve Fusion technology would be such a classic example of Leapfrogging (assuming it's solved by some sort of radical new engineering or material science)",
                "author": "NoCard1571"
            },
            {
                "raw_content": "deepmind is cooking; first the cancer breakthrough and now this...... agi is afoot",
                "author": "Able-Necessary-6048"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why Western executives who visit China are coming back terrified - Robotics has catapulted Beijing into a dominant position in many industries",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "China was working on the real shit while the us had its best minds trying to optimize ad sales.",
                "author": "Synensys"
            },
            {
                "raw_content": "The U.S. has positioned itself into becoming the next slum nation based on its reluctance to invest in its citizens. The opposite actually from what China is doing, the U.S. is doing everything it can to continually punish citizens and take away prospects for a future. This is not some wild conspiracy theory. We refuse to invest in education, and are removing all safe guards that have existed in the past to help people. The leaders are focused on relatively mundane aspects of our culture such as trans rights which affect less than 1% of the total population. We're going backwards in terms of energy goals. The list goes on and on and on. People might not see it now, but the U.S. will quickly become a 3rd world nation compared to China if priorities don't switch. It's unfortunate that the population elected leaders whose primary goals are short term profits over the long term care of the country. I hope you all are happy with all this winning.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "There is no way -- NONE -- that any US company will ever be able to scale to build 1 million robots per year, and particularly not with a domestic supply chain.",
                "author": "Decent-Ground-395"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro is already referenced on Gemini's source code",
        "score": 182,
        "text_content": "If you still skeptical or think the screenshot is fake, here is a direct link to a gstatic JS source: [https://www.gstatic.com/\\_/mss/boq-bard-web/\\_/js/k=boq-bard-web.BardChatUi.es\\_419.\\_\\_pRJKZubkE.2018.O/ck=boq-bard-web.BardChatUi.H8BRbANbkFg.L.B1.O/am=h3AEFscTANzdO27-\\_-clNwAgEAAAgAE/d=1/exm=ABELSd,AdpaDf,LQaXg,OpU7Tc,PzWdsc,UE0P2d,Z8wCif,\\_b,uEAQfd/excm=\\_b/ed=1/br=1/wt=2/ujg=1/rs=AL3bBk2B8oeQK7CcQBIyeO5oA2TrqWCm9A/ee=DGWCxb:CgYiQ;Pjplud:PoEs9b;QGR0gd:Mlhmy;ScI3Yc:e7Hzgb;Uvc8o:VDovNc;YIZmRd:A1yn5d;cEt90b:ws9Tlc;dowIGb:ebZ3mb;lOO0Vd:OTA3Ae;qafBPd:ovKuLd/dti=1/m=HwBxOc?wli=BardChatUi.9d\\_GjC5b9JA.loadWasmSipCoca.O%3A%3B](https://www.gstatic.com/_/mss/boq-bard-web/_/js/k=boq-bard-web.BardChatUi.es_419.__pRJKZubkE.2018.O/ck=boq-bard-web.BardChatUi.H8BRbANbkFg.L.B1.O/am=h3AEFscTANzdO27-_-clNwAgEAAAgAE/d=1/exm=ABELSd,AdpaDf,LQaXg,OpU7Tc,PzWdsc,UE0P2d,Z8wCif,_b,uEAQfd/excm=_b/ed=1/br=1/wt=2/ujg=1/rs=AL3bBk2B8oeQK7CcQBIyeO5oA2TrqWCm9A/ee=DGWCxb:CgYiQ;Pjplud:PoEs9b;QGR0gd:Mlhmy;ScI3Yc:e7Hzgb;Uvc8o:VDovNc;YIZmRd:A1yn5d;cEt90b:ws9Tlc;dowIGb:ebZ3mb;lOO0Vd:OTA3Ae;qafBPd:ovKuLd/dti=1/m=HwBxOc?wli=BardChatUi.9d_GjC5b9JA.loadWasmSipCoca.O%3A%3B), just search for \"3.0 pro\" and you will find the string.",
        "comments": [
            {
                "raw_content": "if this is credible, it's good news because I subscribed to gemini pro a few days ago lol",
                "author": "QuackerEnte"
            },
            {
                "raw_content": "wow can you share the gemini source code 🤩",
                "author": "kusogejp"
            },
            {
                "raw_content": "Seriously hope Gemini 3 is good, cause I got a AI Studio \"choose one\" thing and one of them sounded just like 2.5 Pro and the other one sucked balls, maybe it was Gemini 3-flash-lite.",
                "author": "Charuru"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Revenue stream",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sooner or later Holographic Ai Girlfriends will be a thing also Sex Bots",
                "author": "wrathofattila"
            },
            {
                "raw_content": "The revenue number for OpenAI is wildly off. It’s closer to $13b now",
                "author": "Different-Froyo9497"
            },
            {
                "raw_content": "Soon most of the OnlyFans content will be generated by OpenAI.",
                "author": "rwrife"
            }
        ],
        "subreddit": "singularity"
    }
]