[
    {
        "post_name": "THIS IS HOW THE SETUP GOES, KEEP PROVOKING SOMEONE THEY KNOW WILL GET UPSET EASILY & FILM IT TO GET FINANCIAL GAIN OR ASSERT THEIR VICTIMHOOD.",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are the police questioning her? It's not a crime to say non-threatening slurs.",
                "author": "madisonmaga"
            },
            {
                "raw_content": "What's funny is she made a ton of money I think she has 100,000 plus in an account",
                "author": "DrQxx"
            },
            {
                "raw_content": "Why even let those apes in your store? Don't you have a 'no pets' policy? Next time, just throw the hot coffee in his face.",
                "author": "skuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You mean 65 iq people had help?",
                "author": "BillyBillington"
            },
            {
                "raw_content": "Sub-70 IQ lightbulb-heads literally cannot think of things this complex. They're clearly receiving major assistance from the government. The fact that all of these places max out their donations to the democrat party is all the evidence needed.",
                "author": "Bearing51"
            },
            {
                "raw_content": "These fucking retards can't tie their own shoes, This was a Democrat Part op all the way, top to bottom. It's not just here. It's all over the country. Where do the Dems get their bottomless troughs of money? Here it is.",
                "author": "skuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Italian PM Giorgia Meloni's government is proposing chemical castration for r*pists and p*dophiles. Get it done.",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chemical, just cut",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "nothing ever happens...she's a WEF raud. all empty words, deliberately pushed by the \"conservative\" \"influencers\" like this asshole.",
                "author": "cptkloss5"
            },
            {
                "raw_content": "Why waste chemicals? They are more expensive than a reusable hatchet.",
                "author": "cwoalf3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The E.U. can not exist without the war they created and a boogyman that does not exist.",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "### I HATE THIS CUNT.",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "Zelensky is the single greatest obstacle to peace and tens of thousands of poor souls are dead because of his corruption.",
                "author": "Squentin"
            },
            {
                "raw_content": "Stay away, President Trump… it’s all fake and ghey",
                "author": "RiolindasReturn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hero without a cape",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I started noticing people like this during the summer of love. This reporting is much better!",
                "author": "SicSemperTyrannis2"
            },
            {
                "raw_content": "Nick did good work and I’m glad this is going viral, but this story was broken by others years ago.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "We need a Nick in every city. Start with the blue ones. And quit calling me Shirley.",
                "author": "1LoathsomeDove"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Salem, Oregon appoints a man convicted of murdering a teenage girl to the police oversight board. Prosecutors said Kyle Hedquist drove 19-year-old Nikki Thrasher to a wooded area, shot her in the back of the head, and left her body on a remote logging road.",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left will never, ever surprise me.",
                "author": "vegaspatriot1776"
            },
            {
                "raw_content": "Why is he not in prison?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "This would never be a problem with traditional means of law enforcement, such as elected sheriffs, temporary deputies selected from an armed population, bounty hunters, private investigation, etc. Professional policing is communism.",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What are you doing this Saturday at noon?",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"It's gonna be wild\"",
                "author": "DenturesNancy"
            },
            {
                "raw_content": "This is one of the 2 greatest weaknesses MAGA HAS.... We don't run for office... we just complain and protest a lot. And we have pennies to organize, while the Uniparty has Billions.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "The timeline where a Marx supports a learn government.",
                "author": "Lelleck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former Fox News Contributor Dennis Michael Lynch GOES NUCLEAR: Says If Somali Deportations and Indictments on Tim Walz Don’t Happen, ‘MAGA and the Rule of Law Are Total BS’",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah sounds about right … unfortunately there will none in the the entire of Trumps term … Dems prob be back in 28 that’s when you’ll see 100s of arrests .. just fix the voting system thats all that matters!!",
                "author": "OZJRant"
            },
            {
                "raw_content": "The rule of law is quickly becoming a bullshit lie. When this devolves, and it will, America will become the most dangerous place on earth.",
                "author": "TheFountainhead"
            },
            {
                "raw_content": "Agreed. It is far past time for justice.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Exclusive: Fulton County’s 315,000 Admission Goes Well Beyond Just “Unsigned Poll Tapes” – Including Illegal Tabulation, Rule Violations and Open Records Deception",
        "score": 354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Until people are executed for treason, we will keep losing every election cycle.",
                "author": "Roof_Korean"
            },
            {
                "raw_content": "Pam Bondi needs to make arrest for her New Year's resolution.",
                "author": "TrumpYe2023"
            },
            {
                "raw_content": "They got paid to throw an election.",
                "author": "Rock9Head"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Citizen Journalist Descends On Ohio, Immediately Finds 'First Signs Of Potentially Massive Somali Fraud'",
        "score": 339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What do you expect from a country of pirates",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Can you hear Obama laughing?",
                "author": "Spellmonger"
            },
            {
                "raw_content": "I went down the rabbit hole of Columbus yesterday. So many Home healthcare facilities within single buildings. I cross checked phone numbers, and the same number would be attached to other \"businesses\" Driving schools, home healthcare, immigration lawyers, tax prep, daycares and adult daycares with the same addresses and or phone numbers. I would just google a specific one of those businesses and then ask AI all the businesses within a building. Almost always you would find numerous of those businesses. And I am NOT that smart!!! How has this been allowed for so long??? Bet the old 4chan could find and catalogue this shit so easily. Just need 50 autists to bust this shit in each state.",
                "author": "YoMamma2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Department of Labor @USDOL · 15h This year, we launched Project Firewall to crack down on rampant H-1B Visa fraud and ensure American Jobs go to American Workers. We’ll keep fighting to ensure AMERICANS ALWAYS COME FIRST",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does this \"crack down\" involve sending their executives and hiring managers to jail for willfully violating immigration and labor laws?",
                "author": "Tookens"
            },
            {
                "raw_content": "START WITH THE PRESIDENT'S VIEWS ON H1BS",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "Nice buzzword, but 1 year has passed and nothing happened.",
                "author": "Txiribiton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TIM WALZ was recognized and honored by The Democratic Coalition of SATAN WORSHIPPERS and was given a plaque that sits in the Minnesota State Capitol.",
        "score": 694,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, it's probably not wrong. Satan likely does have a special place for Tim Walz.",
                "author": "A_Colostomy_Bag"
            },
            {
                "raw_content": "Democrat Coalition of Satan Worshippers seems redundant.",
                "author": "Scot"
            },
            {
                "raw_content": "It reads like someone mocking democrats for accepting such bullshit.",
                "author": "sorrytodisagree"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two Somali men mocking a White man by waving and tossing money, taunting him with remarks like ‘wish you had this.’ (one day they gonnaa mess with the wrong person; ungrateful arrogant demons)",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate Obama for importing our enemies",
                "author": "newuser8"
            },
            {
                "raw_content": "That’s the exact behavior I saw when living in the Middle East….. God gives them money, no matter how they get it and they use it to feel superior",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "They feel way, way too comfortable.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "40% of all Somalis in the U.S. arrived under Obama. These people built vast tax and financial fraud networks. While allowing them in, Obama’s IRS spent millions targeting Tea Party groups for political reasons. No wrongdoing was ever found.",
        "score": 1362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump needs to do something about this YESTERDAY, and not just tweet about it! FUCKING DO SOMETHING",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "A pack of 68 iq sub humans did not figure this out on their own. We know about it because they’re so bad at it. This scheme was put in place by communists meant to instill one party rule and loot this nation down to the floor boards. Somalis are nothing but the wrench in the parlor. Who dunnit is a completely different question. You all need to operate under the assumption that non whites in the government are working to kill you and your children and their means are biological weapons.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Fundamental transformation.",
                "author": "MemphisMontoya71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna: Our immigration system is incredibly broken, and, as you were seeing, there are many people who have come to this country and seriously abused it. The entire system needs an overhaul. I will be introducing an immigration moratorium",
        "score": 1229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the moderate position. Unusual to see Luna there. lol",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": ">Whenever the President finds that the entry of any aliens or of any class of aliens into the United States would be detrimental to the interests of the United States, he may by proclamation, and for such period as he shall deem necessary, suspend the entry of all aliens or any class of aliens as immigrants or nonimmigrants, or impose on the entry of aliens any restrictions he may deem to be appropriate. Existing law. Just enforce it",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "They all have to go BACK.",
                "author": "F_the_Admin_State"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Get extra security at schools, especially Christian schools and churches.",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The bigger lesson here is that the govt is criminally incapable of managing the money it extracts from its people in the form of taxes and fees. Until millions of us stop paying taxes (and prepare to lose our freedom) and bankrupt the kleptocratic regime, and until politicians and bureaucrats are imprisoned, nothing will change, except that this same govt regime will eventually extract even more of our money.",
                "author": "shockpurseyell"
            },
            {
                "raw_content": "That’s a really good point. We are ripe for tranny violence.",
                "author": "TheTelltaleFly"
            },
            {
                "raw_content": "I feel like they might do a pizza gate style “attack”. Where no one is hurt, but they get a loony to attack a Somali daycare to make the narrative Somalis are under attack by White men.",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Companies are hiring offshore candidates instead of H-1Bs and if they do hire graduates from U.S. colleges it will be F-1 foreign students using the OPT program. UNSPOKEN: American Graduates Need Not Apply. The roof is on fire, what now?",
        "score": 945,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why all these \"reforms\" Trump is trying to do are just rearranging the deck chairs on the Titanic. Since US citizen STEM grads aren't finding jobs, they need MAJOR reforms. 1. Cut all immigrant work visas to zero, except maybe a handful of O-1 visas, for a few years. 2. Import tariffs on US corporations that offshore software work. Most US corporations have a \"work must be done onsite\" policy, so offshoring isn't the slam dunk decision you might think if you cut off their supply of foreign worker visas. While these are badly needed reforms, I see zero chance of them passing.",
                "author": "fskfsk"
            },
            {
                "raw_content": "Tariff offshore work? Rate should be proportional to foreign vs domestic wages, so there would be no advantage to offshore workers. Eg: indians are 5x cheaper = tariff on indian offshore work is 500%",
                "author": "GoldenEarz"
            },
            {
                "raw_content": "Can confirm. Son recently graduated BS CompSci, and has actual work experience in AI and coding. Can't get a decent offer, everything is going offshore now. Most in his class can't find a job, many went to waiting tables while looking. Hell even my place is offshoring everything. Here is the article since this is just a pic. https://mindingthecampus.org/2025/12/29/american-graduates-need-not-apply/",
                "author": "FLIBS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BANNON: We’re calling for a 10 year moratorium. No immigration. Refugee, amnesty and asylum programs are completely corrupt and now it’s in your face. This isn’t just about ending H1Bs. It’s a full moratorium across the board. No immigration for a decade until this mess is fixed.",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10? More like 100.",
                "author": "DogFart_"
            },
            {
                "raw_content": "I agree with Steve Bannon on this, but we know that it will never happen.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "this would be awesome and because it is awesome it will never happen",
                "author": "FartOnLibtards"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LOL they took down the MN Daycare licensing lookup page --of course they did.",
        "score": 1513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here me out, we found a lot of closed business'es, taken the web sight down for maintenance while we call around look for bad phone #'s and take all the old listing's out",
                "author": "TimWaltz"
            },
            {
                "raw_content": "Autists save the entire internet everyday on their 99999999 TB drives. Nothing is truly gone.",
                "author": "CruzControl"
            },
            {
                "raw_content": "It's the coverup that often reveals just how widespread this corruption is.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Five months ago, James Comer referred ActBlue to the DOJ for prosecution. And we haven't heard a word about it since. And now ActBlue is on track to raise $3 billion this year. Democrats get away with everything because Republicans are WEAK.",
        "score": 179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They aren't weak, they are complicit. We have been fighting the wrong enemies.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "pathetic, weak, cowards or in on it you choose",
                "author": "Raetchel"
            },
            {
                "raw_content": "Tulsi handed them concrete proof of treason and nothing happened.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How Much RAM Do Gamers Need, 2x8 16GB vs. 2x16 32GB vs. 2x32 64GB",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So don't let your gpu run out of VRAM.",
                "author": "JamesEdward34"
            },
            {
                "raw_content": "16GB is enough for almost anything if you close other RAM hogs while gaming, 32GB is enough for everything even with some memory hogs like browsers, discord etc. running, 64GB is massive overkill for gaming alone. There you go, saved you 15 minutes. Don't need benchmarks or a video for this one lol.",
                "author": "stonerbobo"
            },
            {
                "raw_content": "If I were building a machine without the constraints of pricing, 32GB is my happy place between running a game and having multiple other windows open for my rabbit holing of information Honestly, at this point switch to board games with the way prices of RAM and other components are going.",
                "author": "respectfulpanda"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: China mandates 50% domestic equipment rule for chipmakers",
        "score": 22,
        "text_content": "SINGAPORE, Dec 30 (Reuters) - China is requiring chipmakers to use at least 50% domestically made equipment for adding new capacity, three people familiar with the matter said, as Beijing pushes to build a self-sufficient semiconductor supply chain. The policy is already yielding results, including in areas such as etching, a critical chip manufacturing step that involves removing materials from silicon wafers to carve out intricate transistor patterns, sources said. China's largest chip equipment group, Naura, is testing its etching tools on a cutting-edge 7nm (nanometre) production line of SMIC, two sources said. The early-stage milestone, which comes after Naura recently deployed etching tools on 14nm successfully, demonstrates how quickly domestic suppliers are advancing. \"Naura's etching results have been accelerated by the government requiring fabs to use at least 50% domestic equipment,\" one of the people told Reuters, adding that it was forcing the company to rapidly improve. Advanced etching tools had been predominantly supplied in China by foreign firms such as Lam Research [(LRCX.O)](https://www.reuters.com/markets/companies/LRCX.O) [, opens new tab](https://www.reuters.com/markets/companies/LRCX.O) and Tokyo Electron [(8035.T)](https://www.reuters.com/markets/companies/8035.T)[, opens new tab](https://www.reuters.com/markets/companies/8035.T), but are now being partially replaced by Naura and smaller rival Advanced Micro-Fabrication Equipment (AMEC) [(688012.SS)](https://www.reuters.com/markets/companies/688012.SS) [, opens new tab](https://www.reuters.com/markets/companies/688012.SS), sources say. Naura has also proven a key partner for Chinese memory chipmakers, supplying etching tools for advanced chips with more than 300 layers. It developed electrostatic chucks — devices that hold wafers during processing — to replace worn parts in Lam Research equipment that the company could no longer service after the 2023 restrictions, sources said. Naura filed a record 779 patents in 2025, more than double what it filed in 2020 and 2021, while AMEC filed 259, according to Anaqua's AcclaimIP database, and verified by Reuters. That's also translating into strong financial results. Naura's revenue for the first half of 2025 jumped 30% to 16 billion yuan. AMEC reported a 44% jump in first-half revenue to 5 billion yuan. Analysts estimate that China has now reached [roughly 50% self-sufficiency ](https://www.reuters.com/world/china/how-chinas-chip-equipment-manufacturing-sector-stacks-up-2025-05-13/)in photoresist-removal and cleaning equipment, a market previously dominated by Japanese firms, but now locally led by Naura. \"The domestic equipment market will be dominated by two to three major manufacturers, and Naura is definitely one of them,\" said a separate source.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to hit TSMC with major blow from Taylor 2nm chips: 50,000 wafers per month with target capacity of 100,000 wafers per month by 2027",
        "score": 343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fantastic. About time TSMC got some competition again.",
                "author": "Spright91"
            },
            {
                "raw_content": "I feel like TSMC will somehow manage to struggle on regardless",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Isn't SF2 and it's derivatives akin to TSMC N3? Still since they're 20K per wafer and TSMC is going to jack up N3 to 25K per wafer and above I wonder if Samsung will nab RTX 60 orders, just like Samsung 8nm was chosen for RTX 30?",
                "author": "Dangerman1337"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s Lisuan begins shipping 6nm 7G100 GPUs to early customers",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aren’t these powervr arch",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "More competition within the gpu markets would be fantastic! So, I hope they're successful with their initial launch.",
                "author": "DutchieTalking"
            },
            {
                "raw_content": "Hello sr_local! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US approves Samsung, SK Hynix chipmaking tool shipments to China for 2026, sources say",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia takes $5 billion stake in Intel under September agreement",
        "score": 209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still not sure what this is expected to accomplish for either firm aside from keeping Intel solvent for a few more months. At any rate the interesting thing here is Nvidia paid $23 per share whereas Intel is currently selling at $36 per share so they got a sweet discount.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "Capitalism has reached its ultimate form. Oligarchy",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Would be funny if the thing that ends up saving Intel will be the AI boom. Not quite how Intel's leadership would have imagined it when they acquired Nervana/Habana/Mobileye/Movidius and launched an AI-focused Xeon Phi.",
                "author": "ForgotToLogIn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] NVIDIA’s $20B Groq Deal Spotlights SRAM Shift—MediaTek NPU Already On Board",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "- The largest single implementation of SRAM exists on the Cerebras WSE-3 (Wafer Scale Engine), a massive AI processor that takes up an entire silicon wafer. Capacity: *44 Gigabytes* of on-chip SRAM.",
                "author": "neverpost4"
            },
            {
                "raw_content": ">As Commercial Times explains, SRAM is typically integrated within logic processes (on-chip) and supplied by foundries such as TSMC and Samsung. While it delivers superior performance and ultra-low latency, SRAM comes with trade-offs: lower integration density, higher power consumption than DRAM, and substantial die area requirements. For this reason, SRAM is often used as cache memory between processors (CPUs) and main memory, providing rapid response times for applications like L1 and L2 CPU caches. >SRAM’s advantages also extend to AI applications. According to the Economic Daily News, **Groq has designed its chips without relying on external HBM, shielding them from memory supply shortages.** By integrating SRAM directly on-chip, the architecture helps accelerate interactions between chatbots and other AI models, the report adds.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "As someone who also follows /r/MTB as well as /r/hardware, this title go a bit confusing",
                "author": "somewhat_moist"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intels \"Crystalwell\" with L4 cache was the grandaddy to AMD's X3D cache; interesting that they abonded it past Skylake. - YouTube",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, it's a lot of research and costs to put all that EDRAM on a CPU And most of the gains were in gaming. So it made sense why Intel abandoned the idea. But now it would make sense to bring back to their mobile chips that have to share bandwidth between CPU and GPU so much",
                "author": "WJMazepas"
            },
            {
                "raw_content": "Despite its drawbacks with lower CPU clocks, Broadwell/Crystal Well CPUs were ahead of their time. A well-clocked 5775C is beating out Zen 2 and early Skylake in gaming performance. It's a shame they didn't get the attention they deserved.",
                "author": "robz0996"
            },
            {
                "raw_content": "DDR4-3200 and higher was faster in both BW and latency. And the on-die logic for the EDRAM controller took up as much space as two cores. There is a reason why it was discontinued.",
                "author": "TwoTimeHollySurvivor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nexperia in no-man’s-land: how a chip company became caught between two world powers",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 officially cheaper than Steam Deck now",
        "score": 605,
        "text_content": "It's crazy to think that after all the \"drop the price\" stuff, the Switch 2 is where it is right now compared to other consoles/handhelds on the market atm. The cheapest Steam Deck is now the $549 model as of over a week ago. Who knew that the Switch 2 would become one of the cheaper modern console options out there already. Wild.",
        "comments": [
            {
                "raw_content": "Ngl the Switch 2 hardware itself is pretty fairly priced. The game pricing is what makes Switch 2 unaffordable",
                "author": "rustybutterindia"
            },
            {
                "raw_content": "Realistically anyone buying the LCD Steam Deck when the OLED came out was doing it wrong. I've had the LCD since it launched and have friends with the OLED it's very much worth the price difference.",
                "author": "WhiskeyRadio"
            },
            {
                "raw_content": "> It's crazy to think that after all the \"drop the price\" stuff, the Switch 2 is where it is right now compared to other consoles/handhelds on the market atm There's nothing crazy about a console being cheaper than a handheld PC. Nintendo, Sony and Xbox are all closed ecosystems that require a subscription for online play. They earn money from the games we purchase from the one and only storefront on their respective platforms. PC handhelds, including the Steam Deck, allow access to other storefronts and don't require a subscription for online play. Their hardware has to have bigger margins to be viable. Furthermore, their products are nowhere near as popular as the Switch 2. This affects B2B negotiations, as Sony and Nintendo can negotiate better deals on components because they purchase them in larger quantities.",
                "author": "rhalgr_ger"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "2025 has been a FANTASTIC year for Switch 2!",
        "score": 883,
        "text_content": "And here’s to many more games yet to come in the new year 😁",
        "comments": [
            {
                "raw_content": "Did you actually get ALL Switch 2 games?",
                "author": "therealkunchan"
            },
            {
                "raw_content": "Consumerism final boss",
                "author": "Reddit_user807"
            },
            {
                "raw_content": "HOLY WALLET! I think I counted 64 games, just assuming each game average 50 USD we are looking at ca. 3200 USD for this collection.",
                "author": "SeraphisQ"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "CAN WE PLEASE TALK ABOUT HOW DUMB THIS IS",
        "score": 1468,
        "text_content": "OH IM SORRY NINTENDO. GUESS ILL JUST KEEP TABS ON LESS GAMES TO BUY. SORRY, I WAS GIVING U TOO MUCH MONEY.",
        "comments": [
            {
                "raw_content": "Good guy Nintendo trying to save you some money 😌",
                "author": "szalinskikid"
            },
            {
                "raw_content": "wait what is the max then",
                "author": "roseychu"
            },
            {
                "raw_content": "Nintendo basically saying, “Quit looking and buy something! This isn’t a library!”",
                "author": "Bar_Har"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got Kirby air raiders for €38",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "6800 Yen is 38€ now?? Wasn't it around 100 Yen for 1€ a few years ago? Now I really understand why Nintendo went with the region locked console there, I didn't know Yen's value was so low. Congratz on the game though! Have fun!",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "In Japan Those are just normal Japanese game prices except you got the game for around 1000 yen cheaper",
                "author": "ItsColorNotColour"
            },
            {
                "raw_content": "Nice.",
                "author": "skelsor87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo may have updated the Switch 2 screen",
        "score": 16,
        "text_content": "In one of the latest Digital Foundry clips, they talk about an updated screen benchmark tool called TestUFO 3.0. However, they also mention that a demo station in Japan for the Nintendo Switch 2 reportedly showed the system with different screens compared to the launch day model. DF says they're investigating this and don't know if it's a hardware or software change, but future Switch 2's in the production cycle may have better screens. [https://www.youtube.com/watch?v=wA-OtQigsIk](https://www.youtube.com/watch?v=wA-OtQigsIk)",
        "comments": [
            {
                "raw_content": "On the one hand, good news, on the other, if they changed the hardware, it's a slap in the face for the milions of early adopters that already bought their prduct with the (frankly not that great) original display.",
                "author": "godswift91"
            },
            {
                "raw_content": "Oh god, here we go",
                "author": "barbietattoo"
            },
            {
                "raw_content": "Shame, launch players are stuck with the ghost screens. I doubt they have the capacity to do screen replacements for everyone who wants them.",
                "author": "Front-Library5781"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What am I missing? Why is Mario Rabbids sparks of hope $6 (90% off). It seemingly has awesome reviews. Why is it so cheap?",
        "score": 86,
        "text_content": "Can anyone share any insight as to why this is the case? Thank you. ￼",
        "comments": [
            {
                "raw_content": "It’s because it’s a Ubisoft game. All of them are cheap eventually.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Because Ubisoft. It is a great game, grab it!",
                "author": "Diligent-Coat8096"
            },
            {
                "raw_content": "The Ubi price loop paradox. No one buys their games at full price cuz they know they’ll be heavily discounted soon after release….Ubi freaks out that no one buys at launch, so they offer heavy discounts soon after…repeat with every game.",
                "author": "Rare_Hero"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: If you live in Australia, the Switch 2 + Mario Kart World bundle is currently $61 off at Target!",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That isn't a good deal. There's been discounts from EB Games eBay that lets you get it at a discount of up to 15% a few times now. I think I paid around $645AUD for mk world + switch 2 bundle back in August with a 15% off from eBay and an extra 3% off paying with discounted eBay gift cards. I'd recommend people keep an eye out for those discount deals instead.",
                "author": "Consistent-Put9762"
            },
            {
                "raw_content": "Bro you just doxxed yourself",
                "author": "Tommy_Gun10"
            },
            {
                "raw_content": "$673 if you price beat at office works. They beat the price by %5. Got the base model switch 2 for $607 that way",
                "author": "Infinite-Ebb6631"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why doesn't Kunitsu-Gami get any love?",
        "score": 25,
        "text_content": "This game looks amazing, but I never see people talk about it. Is something wrong with it?",
        "comments": [
            {
                "raw_content": "I would try it if they offered a demo like they did other platforms. I don’t know how I’ll feel about tower defense gameplay.",
                "author": "realtravisty"
            },
            {
                "raw_content": "I was interested but it seems the port is not great and the game quite blurry.",
                "author": "Ath-ropos"
            },
            {
                "raw_content": "Amazing game, I completed it earlier this year Quickly climbed into my favorite games of all time, surprisingly",
                "author": "projected_cornbread"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Leaker Tier Voting Prep",
        "score": 223,
        "text_content": "#This is not the tier list voting Bi-Yearly tier voting is on it's way. Before we get the tier list voting we want to ask the community to add/remove anyone from the list so we're up to date. There are probably a few leakers in the last year that arent on this list yet so please drop your takes on who to add/remove and why in the comments! We should have the new voting list soon. Thx Tom Henderson Jason Shrierer Jeff Grubb NateTheHate Jez Cordon Speshal Nick Tom Warren PHBrazil Shiina iFireMonkey Hypex Loolo_WRLD Walmart Canada LUnatic Ignu eXtas1s Nexthandheld DuskGolem Loliloailo Emily Rodgers Miller Ross The Tipster Ohag Alex ZSmitk BilBilKun Lance McDonald Andy Robinson Nintendo Prime Colt Eastwood Pyoro Irman Khan Universio Nentendo/Necrolipe Moore's Law Is Dead Insider-Gaming John Harker Midori/Ryanfromthebronx SyluxHunter SamusHunter2 Markomaro Kopite7kimi",
        "comments": [
            {
                "raw_content": "Walmart Canada lol. I'd assume any major retailer would have high status",
                "author": "ArcherInPosition"
            },
            {
                "raw_content": "I can't recall anyone off the top of my head, but this would be a great time to add any notable obvious clickbait \"leakers\" so we can put them in the lowest tier if anybody knows of any.",
                "author": "failingwinter"
            },
            {
                "raw_content": "Lunatic Ignus may be forgotten on peoples minds, but it's the source of some of the most attrotious fake leaks this year",
                "author": "zYKwn"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More info on MH Wilds for Switch 2 including local multiplayer support",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get someone who supports you the way Capcom supports Nintendo Like I expected their smaller scale games, I did not expect Pragmata or MH: Wilds to get Switch 2 ports, theyre clearly more all in than I expected",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "> I mean you can read this, but the NSW2 Version has LOCAL MULTIPLAYER. I read this before zooming on the image and thought OP meant like split screen multiplayer and was ready to laugh it off, the game would go into single digit fps But yeah, local network multiplayer is not only belivable, but probably something Capcom REALLY wanted, specially considering the series long history with portables",
                "author": "Jeff1N"
            },
            {
                "raw_content": "a switch 2-only dlss preset in the code, damn i think this is actually coming out",
                "author": "TiocStudios"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pending home sales jump to nearly 3-year high",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "pending sales down 5% YoY according to redfin https://www.redfin.com/news/data-center/",
                "author": "sifl1202"
            },
            {
                "raw_content": "[https://www.redfin.com/news/housing-market-update-pending-sales-fall-holiday/](https://www.redfin.com/news/housing-market-update-pending-sales-fall-holiday/) the duality of real estate reporting lol",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "“Pending home sales rose in November as mortgage rates eased, but the increase is likely not enough to prevent the 2025 housing market from hitting a new 30-year low in sales volume.” “the November boost is unlikely to push December closings high enough for 2025 to exceed last year's full-year sales total, when existing-home sales of 4.06 million were the lowest on record since 1995.” https://www.realtor.com/news/real-estate-news/pending-home-sales-data-nar-november-2025/",
                "author": "WufBro"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NAR Pending Home Sales Report Shows 3.3% Increase in November",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WASHINGTON (December 29, 2025) – Pending home sales in November jumped by 3.3% from the prior month and 2.6% year over year, according to the National Association of REALTORS Pending Home Sales Report. The report provides the real estate ecosystem, including agents and homebuyers and sellers, with data on the level of home sales under contract. Month-over-month and year-over-year pending home sales rose in the Northeast, Midwest, South, and West. November's REALTORS Confidence Index survey shows that 22% of NAR members expect an increase in buyer traffic over the next three months, up from 17% in October and down from 24% one year ago. Meanwhile, 18% expect an increase in seller traffic, up from 16% last month and down from 22% in November 2024. \"Homebuyer momentum is building. The data shows the strongest performance of the year after accounting for seasonal factors, and the best performance in nearly three years, dating back to February 2023,\" said NAR Chief Economist Lawrence Yun. \"Improving housing affordability–driven by lower mortgage rates and wage growth rising faster than home prices–is helping buyers test the market. More inventory choices compared to last year are also attracting more buyers to the market.\" November 2025 National Pending Home Sales - 3.3% increase month over month - 2.6% increase year over year November 2025 Regional Pending Home Sales Northeast - 1.8% increase month over month - 1.8% increase year over year Midwest - 1.3% increase month over month - 2.2% increase year over year South - 2.4% increase month over month - 3.3% increase year over year West - 9.2% increase month over month - 2.4% increase year over year",
                "author": "SnortingElk"
            },
            {
                "raw_content": "More data.... 1. Holiday travel from TSA this year will hit a record 44 million people. 2. Holiday spending data, so far, seems robust while up over 3% from last year. The reality... If people were so broke and so fearful of job loss, the latest spending numbers would not be as robust as they are. Consumers with money to spend, still exist.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Pre-Covid prices coming back any day now!",
                "author": "EthenAM84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ranking of Housing Affordability in Developed Countries By Price-to-Income Ratio in 2025",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone wants to move to LA or Manhattan, not Omaha lol",
                "author": "Beginning-Can-1248"
            },
            {
                "raw_content": "Great. Now do a ranking of how difficult it is to get a permenant visa to live there from the USA…",
                "author": "Seaguard5"
            },
            {
                "raw_content": "I don’t think price to income has been 3.4:1 in a very long time",
                "author": "gthroway3483"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Claude code team shipping features written 100% by opus 4.5",
        "score": 213,
        "text_content": "[https://x.com/bcherny/status/2004897269674639461](https://x.com/bcherny/status/2004897269674639461)",
        "comments": [
            {
                "raw_content": "I know this isn't recursive self-improvement, but it's pretty damn incredible. Not sure where we'll be even 2 years from now based on all of this acceleration.",
                "author": "roiseeker"
            },
            {
                "raw_content": "Opus 4.5 is a turning point where the majority of specs can be implemented without steering or intervention. His timeline is not surprising at all.",
                "author": "trmnl_cmdr"
            },
            {
                "raw_content": "Based on how to decipher “written 100% by Opus 4.5,” the implications in between have a huge gap. I have basically never written a line of code by hand this year so far, yet I still have to select exact lines of code and instruct the code agent precisely on what to do next. If I only give a grand goal without detailed guidance, the code agent can easily go miles away and never come back to the right track, which wastes a lot of tokens and renders the whole project unrecognizable. For me, I can safely say that AI has written 99% of my code, but the effectiveness it brings is truly limited. By the way, I have recently started working on a code agent project for learning purposes. Once you understand the internal mechanism of a code agent, you realize there’s no magic in it other than just pure engineering around file editing, grep, glob, and sometimes JSON repair. The path to a truly autonomous coding system that can scale to a vast scope is still a long run.",
                "author": "Worried-Warning-5246"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Paper on Continual Learning",
        "score": 79,
        "text_content": "[Tweet](https://x.com/karansdalal/status/2005704608996540887?s=20) [Paper](https://test-time-training.github.io/e2e.pdf)",
        "comments": [
            {
                "raw_content": "There have been similar papers for quite some time. It'll become interesting when one of these methods is successfully implemented at scale for one of the frontier LLMs. Once continual learning is achieved the door is opened for recursive self-improvement.",
                "author": "Glxblt76"
            },
            {
                "raw_content": "Finally, been hoping for someone to cook up something with this idea, can't wait to see their paper.",
                "author": "HearMeOut-13"
            },
            {
                "raw_content": "Well damn. 128k tokens from a 3bn parameter model. Impressive stuff",
                "author": "Mighty-anemone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "“AI Slop”",
        "score": 225,
        "text_content": "Has anyone else noticed a massive influx of people online (especially Reddit) policing others on their use of AI? A recent example I saw was someone on a game subreddit showing an idea they had for a new character. They had thought of the abilities/lore themselves but used AI to generate concept art. And of course, there were a hundred people in the comments chanting “AI Slop” until the post was taken down. Do people seriously expect others to pour dozens of hours into posts they will see once? The entire concept baffles me. EDIT: I am all for shaming those who utilize AI to pump out low-effort/meaningless content in large amounts. But I’ve seen the policing mob VERY frequently shun those with good ideas that lack the technical skills/time to shape them the traditional way.",
        "comments": [
            {
                "raw_content": "I've seen people on reddit calling expedition 33 AI slop just because they used AI em some parts",
                "author": "RiskElectronic5741"
            },
            {
                "raw_content": "People bitch and moan about the new thing, a tale as old as time.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "It's going to be like that for a few more years. We're in the messy adoption period right now. The Innovators (2.5% of the pop.) and Early Adopters (13.5%) have been using it for a while, and the Early Majority (34%) are now mostly using it at least for some tasks. The Late Majority (34% of the pop.) and Laggards (16%) still haven't come across the aisle yet. Until AI becomes so good and so integrated it becomes a way of life nobody can afford to ignore, it will face opposition.",
                "author": "Completely-Real-1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "China’s first LLM company files for IPO: Zhipu AI heads public before OpenAI and Anthropic",
        "score": 29,
        "text_content": "China just crossed a milestone in the global AI race. **Zhipu AI** (officially Knowledge Atlas Technology) has filed for an IPO in Hong Kong, becoming the **first large language model company globally to go public,** ahead of OpenAI and Anthropic. **Key facts:** Target raise around **$560M** at a **$5.6B valuation** and **Listing** date would be Jan 8,2026 & **Backed** by Alibaba, Tencent, Ant Group, Meituan, Xiaomi, HongShan, Saudi Aramco with over **$1.19B** raised to date. **$42M revenue in 2024,**expected to double in 2025. **On the tech side:** Zhipu’s coder agent costs ~1/7th of **Claude and GLM-4.7** reportedly rivals **GPT-5** on coding benchmarks. **Founded in 2019 by Tsinghua professors:** Tang Jie, creator of Wu Dao (1.75T params, 2021) & Li Juanzi, head of Tsinghua’s KEG lab, which also incubated Moonshot and DeepLang. **CEO Zhang Peng summed it up bluntly:** > “No matter how much money we raise or make, it will be a hindrance on our road to AGI.” China now has a public-market LLM benchmark. The question is whether **Western labs** follow or stay private longer. **Source: Official announcement** 🔗: https://x.com/i/status/2005934776042095052",
        "comments": [
            {
                "raw_content": "Doing an IPO is not necessarily a good move. SpaceX hasnt, because long term goals of colonizing Mars does not ressonate well with stock holders wanting short term gains on their investments. similarily if OpenAI went public, their long term goal of ASI / AGI might be compromised by stockholders priorities and short term financial KPIs. Thus it is not necessarily a benefit to do an IPO if you want to go ASI.",
                "author": "usandholt"
            },
            {
                "raw_content": "Unless you need money, what is the advantage of going public?",
                "author": "ChocomelP"
            },
            {
                "raw_content": "Trying to format an IPO like its some sort of race is dumb. Its like saying, \"person drinks chocolate milk before these other people.\" Not exactly an achievement.",
                "author": "enigmatic_erudition"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Recursive Self Improvement Internally Achieved",
        "score": 48,
        "text_content": "[Tweet](https://x.com/bcherny/status/2004897269674639461?s=20) Creator of Claude Code uses Claude Code to improve Claude Code",
        "comments": [
            {
                "raw_content": "how is this recursive self improvement?",
                "author": "Slight_Duty_7466"
            },
            {
                "raw_content": "It’s impressive but this isn’t RSI.",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "No it's still managed and directed by a human.",
                "author": "b0bl00i_temp"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "When do we stop pretending AI wont also replace CEOs if it can do any thinking job?",
        "score": 19,
        "text_content": "So it's no open secret that as AI continues to advance a lot of entry level jobs will be under immense pressure to either upskill or get automated out of existence. But while there's a fine line between someone who fills in spreadsheets all day versus the person who tells which sheets to fill out, there's less of a difference between upper management positions who act as either visionaries, supervisors, or PR frontmen. But what happens when AI advances quickly enough that it can replace the manager or director in this picture? What would justify the vice president and CEO sticking around if AI is confirmed to make better financial decisions than any human or even better creative choices? Such as the fact, if AI starts making scientific discoveries on its own, why would the CEO necessarily be in control of that? Wouldn't anyone who owns the same robot have just as much capability to lord over a machine that now does all the work for them?",
        "comments": [
            {
                "raw_content": "It would be also perfect for that tbh",
                "author": "AntiquePercentage536"
            },
            {
                "raw_content": "Who's doing that? Pretending that AI won't also preplace CEOs? Among the people who believe that AI will eventually replace human labor, I have never once heard that CEOs will be exempt from that.",
                "author": "y53rw"
            },
            {
                "raw_content": "They will but the chairman of the board with all the voting power will still be humans as they would own the company, the AI is just an employee. CEOs are employees too, and can be fired for poor performance.",
                "author": "udoy1234"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta acquires Manus",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll drop the M and let it operate as an independent company",
                "author": "GamingDisruptor"
            },
            {
                "raw_content": "Rest in peace Anus \\[\\*\\]",
                "author": "FoxB1t3"
            },
            {
                "raw_content": "I just hope they finally nerf his NG+ version, that's a cancer boss ngl",
                "author": "perfectly_stable"
            }
        ],
        "subreddit": "singularity"
    }
]