[
    {
        "post_name": "President Trump returns to the White House after another long day working for America",
        "score": 366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank you, Mr. President. Rest up, and tomorrow, let's arrest a whole bunch of commies!",
                "author": "GallowsTime"
            },
            {
                "raw_content": "God bless President Trump",
                "author": "GoTouchGrass"
            },
            {
                "raw_content": "They keep trying their best to spread rumors about his physical decline but then he just goes out and works another 12-hour day in front of countless cameras and thousands of witnesses and the next day they try telling us he's physically declining.. AGAIN!",
                "author": "RusherOfDin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Masks never worked. They gaslit to see what you'd do.",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It might be worse that that. It could well be that when worn for long periods people were not getting enough oxygen. Or maybe they were made in some fucked up way such that people were breathing in tons of weird little microplastics or some shit. Anyway, my point is, they could well have been (intentionally) harmful, as opposed to just not doing anything.",
                "author": "flp999"
            },
            {
                "raw_content": "It was an intelligence test.",
                "author": "NZbacon"
            },
            {
                "raw_content": "Yes, and I'm not going to go over it again. I'm tired of trying to tell True Believers anything since they elbow you out of the way to go do stupid stuff.",
                "author": "FreeFire"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Chinese Billionaires Having Dozens of U.S.-Born Babies Via Surrogate—Videogame executive Xu Bo, said to have more than 100 children, and other elites build mega-families, testing citizenship laws",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Birthright citizenship and liberal judges were NOT designed for an outright attack by malicious actors",
                "author": "IlhansBrother"
            },
            {
                "raw_content": "This insanity needs to be shut down ASAP.",
                "author": "Fangerang"
            },
            {
                "raw_content": "China should be nuked into ashes.",
                "author": "RedPillosopher1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Magic mushrooms cured someone's gender dysphoria.",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In the 50s, before liberal hippies made people so disgusted that they demanded they be made illegal, therapists were using hallucinogens to cure patients of addiction and trauma. Big time celebrities of the day stopped smoking and drinking after taking hallucinogens in a safe and controlled, guided environment.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Magic mushrooms do have many benefits to them, somehow not really surprised that someone could see that kind of shift of mentality. I remember a few times where I was struggling with some personal issues, took some mushrooms and would spend a few hours just walking around thinking through the topic, usually coming through some revelations... mostly after it went away there was the solution in mind even if I didn't really remember the thought process that led to the conclusions.",
                "author": "user2827"
            },
            {
                "raw_content": "I smell a troll. Don't trust Reddit for shit like this.",
                "author": "vote_for_MAGA_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Providence Police says they have NO VIDEO of the Brown University shooter inside the building Nor do they know how he ENTERED the building, or where he went",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sounds like a lie",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "I’m calling it . This kid has political connections",
                "author": "Cianevalies"
            },
            {
                "raw_content": "Is this our false flag for a war with Iran? I was suspecting something bigger, like another \"dancing\" 9-11, but perhaps we'll get a string of these instead?",
                "author": "redredwine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This needs to become a Meme. Please and Thank you.",
        "score": 818,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He is not a judge. I don't even believe he is a true judge. I believe he is a plant pretending to be a judge who is actually a United States hating commie who was installed to subvert our country and her values. No one who loves north America USA would do the things he does if he really loves our country. FUCK that bastard and his smelly self to hell!",
                "author": "Lady_MaGa"
            },
            {
                "raw_content": "Always.",
                "author": "Patriot29TN"
            },
            {
                "raw_content": "Who nose why....?",
                "author": "Bramage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "the system",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Top: Trump voters in 2016 Bottom: Trump voters in 2024",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Funny, I just said this and was called both a Redditor and a 4channer. Ppl here who think the system is fixable should brush up on the past hundred years full of people trying to fix the system by growing it",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "It can be fixed, but to do that it means changing a lot of things that some people might not like. A lot of people need to be fired, arrested, given very fair, VERY PUBLIC Trials and if found guilty PUBLICLY EXECUTED! To start.",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "'Biden Has Raised Little of What He Needs to Build a Presidential Library.' Raised exactly $0 in new donations in all of 2024. / Couldn’t raise a dime for his library, but definitely received 82 million votes.",
        "score": 1005,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Want to bet those donations aren't going in to that library? Also, interesting that China funded most of the cost of the Penn-Biden Center where they found all those classified files, but can't get them to help with his library now that his security clearance has been revoked.",
                "author": "anotherthing"
            },
            {
                "raw_content": "I have an idea. Obama should change the name of the Obama Center (library) to the Grifter Center. That way both he and Briben could claim it as their own.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "Biden raped his daughter.",
                "author": "Rydanovich"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Orwell was way ahead of his time…",
        "score": 709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Orwell's 1984 is getting more and more accurate every day. Read it: Orwell actually predicted AI-generated music.",
                "author": "canadianhere"
            },
            {
                "raw_content": "Just read 1984. If you haven’t read it, read it NOW instead of thinking you understand the book. Don’t be an Orwell poser, it’s beneath you.",
                "author": "MizzBlackSwan"
            },
            {
                "raw_content": "1984 is being used as a playbook",
                "author": "RYTHMICRIOT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Valentina Gomez: Brown University shooter is probably a transgender, liberal, or muslim.",
        "score": 483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Coulter's Law is in effect. Flip a coin, pick one out of three!",
                "author": "TrumpMagaNoBama"
            },
            {
                "raw_content": "Lmao i wonder if she lurks on PDW",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "Something like 60% of unaffiliated murders go unsolved. I’ve always thought it weird more shooters didn’t get away. Hell even Kirk’s killer dodged the fbi for 2-3 days. I don’t think they would have ever found Luigi if they hadn’t of used all the illegal spy stuff and then had to cook up some parallel investigation to arrest him.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our Justice System is a joke.",
        "score": 381,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Orlando, sooner or later you're going to have to admit that they want to eradicate Whites. Whataboutism is so 2016.",
                "author": "Crucible"
            },
            {
                "raw_content": "Barrabas! Barrabas!",
                "author": "Quixotic"
            },
            {
                "raw_content": "Such an obvious contrast that the way of the world is happy to ignore.",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⭐️ GEOTUS ⭐️",
        "score": 651,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look how the rest of the red team is hanging back picking their asses and not helping.",
                "author": "Eatinglue"
            },
            {
                "raw_content": "TD! 🏉",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Original: https://jonmcnaughton.com/patriotic/americana/all-american-trump/",
                "author": "SmartWomenLoveTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Absolute scenes in Baltimore as Trump joins the coin toss at the Army Navy game — something Joe Biden never once did as President.",
        "score": 990,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best President in American history. Bar none.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "Joe’s brain was ALREADY tossed.",
                "author": "Trump454748"
            },
            {
                "raw_content": "What i love about this is something the mike barely caught. Is Trump saying thank you very much to the ref. Thats humble, and just good manners. I love the man for everything he has done for us, everything he exposed. The machine against him is powerful, if he can't stand against it no one man ever will. Lots of men could?",
                "author": "Knumberate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: Terrible news out of Rhode Island this evening. We're all monitoring the situation and the FBI stands ready to do anything to help. We're all thinking of and praying for the victims tonight.",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m going to call absolute bullshit if this turns out to be another muzzie. That shit is NOT organic. DEPORT THEM ALL BACK TO THE MIDDLE EAST, AND I MEAN ALL.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Muslim, SSRI, or HRT?",
                "author": "CyanScales"
            },
            {
                "raw_content": "It's sad that hearing claims the FBI is doing something causes a laugh.",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have been briefed on the shooting that took place at Brown University in Rhode Island.",
        "score": 690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NOT 20 victims. Presser said 2 dead, eight in the hospital, shooter still not in custody. Just wanted to get the actual info out there, 'pedes.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Unpopular opinion: shootings are local issues and the president does not need to be \"briefed\" on them.",
                "author": "PatriotSam"
            },
            {
                "raw_content": "\"Stay strapped or get clapped\" -George Washington",
                "author": "G26PickupSticks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CHILLING WAKE-UP CALL FROM CHICAGO: Muslim declares on video: “Islam did NOT come to co-exist. Islam is ALWAYS superior. Nothing is above Islam.”",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam is not compatible with the human race.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "such videos been around for 25 years. why are people only realizing this now?",
                "author": "cyberwar"
            },
            {
                "raw_content": "Why they fuck goats then?",
                "author": "Trubs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brown University Shooting: Rhode Island Officials Share New Suspect Info in Presser and Anger Mounts (Video)",
        "score": 598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thanks a pantload for the clickbait. New info? *Male dressed in black* is NOT new info. The only thing everybody knows is that authorities are checking his online activity to determine whether or not it has to be scrubbed [with Hillary's cloth].",
                "author": "mateus"
            },
            {
                "raw_content": "Hours after the shooting, all the campus security cameras, neighboring business security cameras, traffic cameras, and only description given is A Male Dressed In Black. Means its a protected minority and the woke officials don't want to tell the truth.",
                "author": "OTher55"
            },
            {
                "raw_content": "Remember when they invaded people's houses without warrents looking for the Boston marathon bomber? Will they do it again since they got no pushback on the Boston situation?",
                "author": "OlivaireBandaloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: MASS CASUALTY event declared at Brown University as now a possible 20 VICTIMS reported following an active shooter situation. Several reports that a masked suspect is now IN CUSTODY, thankfully. Say a prayer for these victims. The exact number of deceased versus wounded is not yet known.",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never would’ve happened at White University",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Trans furry enthusiast?",
                "author": "nakedjay"
            },
            {
                "raw_content": "A gun free zone in a very anti-gun state, more gun laws will probably work though.",
                "author": "POTUS_DonnieJ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Four times as many illegals in NY prisons than their share of population",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are we keeping these pieces of shit in American prisons? Can’t we throw them all in the Gulf of America?",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "I have a radical solution to crime. Execute all prisoners. No prisons at all.",
                "author": "barwhack"
            },
            {
                "raw_content": "I was told immigrants do less crime than Americans. Also, I was told that no human is illegal.",
                "author": "Stolen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America's future is bigger and better with TRUMP!",
        "score": 1164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make it so, lieutenant broccoli.",
                "author": "_Sully_"
            },
            {
                "raw_content": "A deep pull to make that joke, but I respect it.",
                "author": "Alpha-Kil0"
            },
            {
                "raw_content": "Lt. Barclay was the funniest character on that show.",
                "author": "MAGA-Fett"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung to halt SATA SSD production, leaker warns of up to 18 months of SSD price pressure, worse than Micron ending consumer RAM",
        "score": 795,
        "text_content": "Disclaimer: the source is MLID, so salt as needed :)",
        "comments": [
            {
                "raw_content": "Most likely the Chinese manufacturers will be the only ones left making new SATA SSDs fairly soon.",
                "author": "jaehaerys48"
            },
            {
                "raw_content": "At this point best hope is to hang on whatever you have until late 2027 at the earliest and hope OpenAI's greed collapses next year with their circle jerk bubble popping.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "From the article: >Why Samsung exiting SATA SSDs could raise SSD prices overall According to Tom, the key issue is not whether SATA SSDs are technologically outdated, but how much supply they still represent. He points out that roughly 20% of Amazon’s top SSD bestsellers are still SATA-based, with Samsung drives making up a notable portion of that list. Pulling that volume out of the market, even gradually, reduces overall SSD availability, which in turn puts upward pressure on pricing for both SATA and NVMe drives. > So whether or not it's the latest tech is kinda irrelevant; SATA still has strong sales in the budget segment and a manufacturer completely stopping means even more pressure on M.2 drives going up which is already going to happen",
                "author": "Wasabiroot"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix Forecasts Tight Memory Supply Lasting Through 2028",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like wishful thinking but we’ll see.",
                "author": "NewKitchenFixtures"
            },
            {
                "raw_content": "The baker tells you there might be a shortage of bread, while he is the one making it and the pantry is full of ingredients...what a joke.",
                "author": "IANVS"
            },
            {
                "raw_content": "more asml machine installaion.. maybe gains from ASML will offset dram cost. At least in a capitalistic world, you have the options to invest. And hopefully be good on the timing,entry and profit taking With each installation, ASML also makes revenue from machine servicing and maintenance.",
                "author": "Primary_Olive_5444"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Framework raises DDR5 RAM upgrade prices by 50% amid DRAM shortage — only for Laptop DIY edition, says prices will likely rise again",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This will be so much worse than the GPU shortage",
                "author": "Working-Crab-2826"
            },
            {
                "raw_content": "My 5800x3D will keep me company for years to come.",
                "author": "RacktheMan"
            },
            {
                "raw_content": "Shittin on Dell for this a few days before doing itself, classic",
                "author": "SelectTotal6609"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra 5 338H “Panther Lake” gaming handheld tested in Furmark at 36W [Videocardz]",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello LastChancellor! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": ">**The FurMark score of 2,383 points at 39 FPS and 2560×1440 roughly lines up with NVIDIA GeForce GTX 1060 class performance**. FurMark is not a standard gaming benchmark though, it is a stress and stability tool, so the OneXPlayer engineering team was likely focused on thermals and power behavior rather than chasing best case frame rates. its only as good as a GTX 1060? aww kind of a bummer, i thought itd be RTX 3050 Mobile tier",
                "author": "LastChancellor"
            },
            {
                "raw_content": "Great job by intel for its abysmal naming scheme and let's not forget amd jfc",
                "author": "Delta_Version"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HUB - Intel's $160 Core Ultra CPU, 225F Gaming Benchmarks",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: 12 Game Average: 1080P Medium: Intel Core Ultra 225F is: ~7% faster than i5-12400F ~13% slower than the Ryzen 5 7500F 1080P Ultra: Intel Core Ultra 225F is: ~9% faster than i5-12400F ~9% slower than the Ryzen 5 7500F",
                "author": "Antonis_32"
            },
            {
                "raw_content": "225F is 160€ in Italy, and for 180€ you can get a 245K that absolutely smokes it. It makes no sense at all to buy this, unless it's even cheaper. Btw, the 14600K still packs a hell of a punch, by the benchmarks.",
                "author": "realPoxu"
            },
            {
                "raw_content": "And they also tested it with 8200 CL40 which probably costs 5x as much as the CPU",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "1000 days in 32:9 - A comprehensive review of the Samsung Odyssey Neo G9 and the super ultrawide experience",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Author kind of highlights a lot of the issues I also had during 2 years of 32:9 monitor use. What drives me most insane about these monitors is that they could be incredibly useful if you could split the display into 3 inputs (16:9 center flanked by 18:9 side displays) but no manufacturers support that. Switching back to 16:9 took a little time to get used to, but never having to fiddle with window management or dealing with HUDs pushed to the edge of my peripheral vision is worth it to me. I personally don't see any real applications for these monitors outside of sim racing and flight sims.",
                "author": "Swoly_Deadlift"
            },
            {
                "raw_content": "As the article admits, a lot of games and applications don't properly support the resolution. I think 34\" ultrawides are okay but if you want more than that you're better off with one of the 42\" 4K 16:9 OLEDs. Supported by everything and you still get the field of view filling screen for gaming. In fact unless you play games wearing Robocop cosplay, the 42\" 16:9 is probably a lot closer to your field of view than a 49\" 32:9 is.",
                "author": "Old-Benefit4441"
            },
            {
                "raw_content": "I had to set up a custom 21:9 resolution on mine (3440X1440) for the games that just don't play nice with the full 32:9 because windows gives me 32:9 or 16:9 and nothing else. as for what i mean by \"games that don't play nice\" It's mostly just the UI stretches across the screen so elements are at the far left and right of the screen - this is literally four foot distance and is a pain to deal with in most games the two monitors option is nice but it turns off variable refresh rate and I would have to adjust my monitor (physically move the thing) each time I change from two \"screens\" to one big screen or back, getting a monitor arm would make this easier but one that can actually handle the sheer weighty girth of this thing costs a lot and would have to be correctly installed to prevent accidents for games that work well at 32:9 I found most modern ubisoft stuff (asscreed vikings, division 2, avatar, skull and bones - during the technical tests at least) have a setting to restrict the UI to 16:9 (or stretch to the full width of the screen), call of duty of all games lets me set the UI bounds to whatever the hell I want (MW2 is sliders and MW3 had a screen where you drag the bounds yourself) - in my opinion this should be the gold standard for ultra megawide support hunt: showdown has all UI restricted to 16:9 there is no option to have it not do that warframe is a mixed bag, you can restrict the gameplay UI but theres some menus that stretch darktide and space marine 2 have mods that fix the UI and/or the camera beyond these games I can't really think any others that have some form of \"correct\" 32:9 support",
                "author": "heeroyuy79"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus + der8auer] Der8auer Has Gone Mad with Power | Heatsink Manufacturing | Made in Germany",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kirby Air Riders Dev Team Disbanding Soon, Game Updates Also Ending",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Be Sakurai: > Work on an unannounced project > project becomes Kirby Air Riders, announced in the switch 2 direct > have 2 directs after announcement > Say that the game will be complete on release > Release the game > Release minor updates > profit Basically the entire state of KAR’s now!",
                "author": "SuperSaberman7"
            },
            {
                "raw_content": "A game full of passion being released in a full and complete state. It's a beautiful thing to see",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "Alright! Time to get the team started on SSB!",
                "author": "dingos_among_us"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We need this on Switch now, seriously",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember when all those leakers told us that this and Wind Waker HD were ready for re-release any day now?",
                "author": "OliverNodel"
            },
            {
                "raw_content": "It was great on wii u would be a nice gnc port or full blown re release my favorite zelda game.",
                "author": "makiodaflash"
            },
            {
                "raw_content": "The optimist in me is hoping they'll do something with this or WW in the run up to the Zelda movie being released. But this is Nintendo, and they'll rarely do things when it makes sense to. For better or worse, they march to the beat of their own drum and nothing else matters to them.",
                "author": "GassoBongo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo fixes Resident Evil 4, Miitopia, and more on Switch 2 – full list of new backwards compatibility updates",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Leeeeeeon! Heeeeeelp!\"",
                "author": "Garamenon"
            },
            {
                "raw_content": "Sweet just two more games for me. We are in the endgame now boys Borderlands 3 Star Wars republic commando",
                "author": "Jeezy52"
            },
            {
                "raw_content": "Still no official mention of BL3. Will try later tomorrow to see if there are any changes since they mention graphical fixes for a game.",
                "author": "ChaossssMark666"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My ReVUE of Metroid Prime 4 in one image",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The scanning is killing the replayability for me.",
                "author": "VaughnFry"
            },
            {
                "raw_content": "Revue: a light theatrical entertainment consisting of a series of short sketches, songs, and dances, typically dealing satirically with topical issues.",
                "author": "Nearby_Situation6631"
            },
            {
                "raw_content": "Stop it you're supposed to criticize it and tell people not to buy it even if that means they won't make another game .",
                "author": "Jecht315"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Review: Warhammer 40,000: Rogue Trader (Switch 2) - A Hard Pass For A Great Game",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another rushed port",
                "author": "Technical_Device2513"
            },
            {
                "raw_content": "It’s such a shame. I really wanted to get this day 1 and sink my time in it this holiday season.",
                "author": "kiyLeo"
            },
            {
                "raw_content": "Just echoing here for sentiment but I have seen several reports of Nintendo refunding the game due to its absolutely poor and unacceptable performance. I was also able to get a refund so if you bought this and it’s not to your standards give Nintendo a call.",
                "author": "Forget87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Need to scratch the Elden Ring itch... Suggestions please.",
        "score": 40,
        "text_content": "My original plan was to do my second playthrough of Elden Ring on Switch 2 this Xmas break. Since that's not happening, what would be a nice alternative in the same vein?? Open world, lots to do. Already played both new Zeldas. Edit: No Metroidvanias. I've played all of them!!!",
        "comments": [
            {
                "raw_content": "Play Dark Souls on Switch 2 instead",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Ds1 runs great on switch 2 blasphemous 1&2 are on offer for a tenner atm absolute bargain but 2D souls likes",
                "author": "Legal-One-7274"
            },
            {
                "raw_content": "Dark Souls Remastered is my vote",
                "author": "_Tezzla_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Should we expect these two to drop on Switch 2?",
        "score": 113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo may have some of these planned for a future Nintendo Direct. It happened with Resident Evil Requiem when that game got announced it was only announced for the PS5, Xbox, and PC. People on the internet said that the Switch 2 cannot handle such a game, a couple of months later Nintendo revealed it during their direct.",
                "author": "Theman457"
            },
            {
                "raw_content": "They announced other platforms but not Switch 2, so they might need some time to figure out if it's doable.",
                "author": "SirRidley"
            },
            {
                "raw_content": "Probably. Actually however, I'm surprised there's only Capcom to take the Switch 2 seriously rn.",
                "author": "Jibece"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Epic Games Christmas free game giveaways leaked, includes RDR2",
        "score": 2022,
        "text_content": "Epic Games Christmas free game giveaways has been leaked. - Hogwarts Legacy - December 11 - Jurassic World: Evolution 2 - December 18 - Desperados 3 - December 19 - Total War: Warhammer - December 20 - Tropico 5 - December 21 - Chicken Police - Paint it Red! - December 22 - Loop Hero - December 23 - Lego Batman - December 24 - Commander Keane - December 25 - Farming Simulator 2022 - December 26 - Slime Rancher 2 - December 27 - Terraria - December 28 - Detroit: Become Human - December 29 - Mortal Kombat 11 - December 30 - Red Dead Redemption 2 - December 31 Source: https://www.notebookcheck.net/Epic-Games-Store-leak-reveals-nearly-300-worth-of-free-game-giveaway-plans-in-December-2025.1184163.0.html",
        "comments": [
            {
                "raw_content": "From /u/[ZLancer5x5](https://www.reddit.com/user/ZLancer5x5/): >the list is fake, it was deleted twice on [r/EpicGamesPC](https://www.reddit.com/r/EpicGamesPC/) >Due to community backlash, the list was said to be made by ai and hence there was a riot. >This was most recent and deleted >[https://www.reddit.com/r/EpicGamesPC/comments/1plkgao/removed\\_by\\_moderator/](https://www.reddit.com/r/EpicGamesPC/comments/1plkgao/removed_by_moderator/)",
                "author": "ThucydidesJones"
            },
            {
                "raw_content": "I knew I should have waited 5 years to get it for free",
                "author": "quack_quack_mofo"
            },
            {
                "raw_content": "another year another egs leak that doesn't come true",
                "author": "kuksthedefiled"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: “Code Veronica remake should be announced next year with a 2027 release date as well as RE0R releasing 2028”",
        "score": 347,
        "text_content": "Capcom is pumping these games out fast while DMC is.. yeah https://xcancel.com/aestheticgamer1/status/1999736688848113831?s=46",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "a thread without people calling dusk golem a liar? I must be early",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "I always felt that 0 had the most potential to really be something great, but had a few issues that really held it back, so I'd definitely love to see a remake of it",
                "author": "Mariosonicpac"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "User on r/fromsoftware posts mysterious screenshot of what appears to be Elden Ring from an undiscernable location with a brand new outfit",
        "score": 166,
        "text_content": "Link to reddit: [ https://www.reddit.com/r/fromsoftware/s/fvFaAIkqDn ](https://www.reddit.com/r/fromsoftware/s/fvFaAIkqDn) Imgur reupload: [ https://imgur.com/a/SSNco1P ](https://imgur.com/a/SSNco1P) This doesn't seem to match up with anywhere in Elden Ring, SOTE, or NR. The armor set and beads also don't exist in the game. Maybe a Duskbloods leak or a new game? Or even more Nightreign dlc? EDIT: several people have pointed out inconsistencies that make this look like it's ai generated, be wary",
        "comments": [
            {
                "raw_content": "Modded?",
                "author": "ComprehensiveMix727"
            },
            {
                "raw_content": "The bio of the OP says Hmm… I wonder what it could be…",
                "author": "Odd-Ball7961"
            },
            {
                "raw_content": "despite everything, it's still spellbound",
                "author": "BloodborneKart"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope via Twitter \"Modern Warfare 4 Multiplayer in its current state is currently a complete copy of Modern Warfare II except for no perk charging system and less ADS/slide penalties...\"",
        "score": 289,
        "text_content": "He also said >There is A TON of visual recoil on weapons in Modern Warfare 4 just like Modern Warfare II. Like I said in my last tweet it's pretty much a complete copy outside of a few little things.",
        "comments": [
            {
                "raw_content": "Hopefully it comes out, bombs even harder than BO7 did, and then they can finally stop yearly releases and put actual time and effort into making COD games again.",
                "author": "Numerous_Ad_9579"
            },
            {
                "raw_content": "Oh that player retention is gonna fall off a cliff like a month after launch",
                "author": "FadedSpectre"
            },
            {
                "raw_content": "So Microsoft is gonna have MWII 2 going up against GTA 6? ![gif](giphy|bhoRGJHLkcNUz7aKSn)",
                "author": "4000kd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 300-based ASUS Zenbook DUO to feature dual battery layout",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "well, i suppose thats how they're going to be getting around the 101wh battery ban",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "FSR Redstone’s ML Frame Generation can now be forced on in unsupported games through OptiScaler",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if ray regeneration could be worked into cyberpunk using ray reconstruction inputs",
                "author": "ClupTheGreat"
            },
            {
                "raw_content": "Why is optiscaler so much better than amd?",
                "author": "Keybraker"
            },
            {
                "raw_content": "If only it could be forced on RDNA2/3!",
                "author": "Pouryaf"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My First Gaming PC",
        "score": 71,
        "text_content": "I'm a lifelong pc gamer, and have been watching my uncle assemble PCs ever since I was a child. Stars aligned and I'm finally an owner of my dream pc. got it right before the Ram prices started affecting things. got 9800x3d + 9070xt as I prefer Linux and things just work. also 9070xt is total value for the money.",
        "comments": [
            {
                "raw_content": "\\+1 from a fellow red team linuxer! gratz",
                "author": "jonbonesjonesjohnson"
            },
            {
                "raw_content": "Hell yeah! I hope you're enjoying your experience.",
                "author": "Moddy123"
            },
            {
                "raw_content": "I’m torturing my 9070xt at the moment with cyberpunk with ray tracing. It’s doing well, hope you enjoy!",
                "author": "JackRyan13"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "2026 will be the year",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If houses weren’t cheap enough for you in 2010 I got bad news for you dawg",
                "author": "Swimming_Agent_1063"
            },
            {
                "raw_content": "2010 seems hyperbolic, everyone knew at the time that 2010-2015 was a great time to buy. 2018/19 was less clear because we couldn't predict that the government would panic-print five times global financial crisis levels of bailout money for a retail sale issue that was easily solved with curb-side pickup and delivery.",
                "author": "CrayonUpMyNose"
            },
            {
                "raw_content": "I should have bought a house in 2010 instead of stupid shit like finishing 10th grade math homework",
                "author": "knight_prince_ace"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The housing market’s ‘next era’ is just around the corner",
        "score": 40,
        "text_content": "Research from Compass’ chief economist points to slow but steady improvement next year, especially if hiring picks up and “shadow inventory” is released.",
        "comments": [
            {
                "raw_content": "Sounds like more of the same, not a new era.",
                "author": "regaphysics"
            },
            {
                "raw_content": "Transactions occur all the way down in a market. Ever seen an awful days on a stock market? Someone was buying the whole way down. Sales volume is still very poor overall",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Oh look, another hopium/FOMO \"news\" article to 'counter' that viral CNBC article [\"Home prices go negative for the first time in over 2 years — and may stay that way for a while.\"](https://www.reddit.com/r/REBubble/comments/1pjzrq0/home_prices_go_negative_for_the_first_time_in/) Surprised Pikachu Face when someone who works in the real estate industry, only says good things about the real estate industry. We promise real estate will go up in 2026, or at least prices won't go down. Trust me bro.[](https://www.reddit.com/r/REBubble/?f=flair_name%3A%22News%22)",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "13 December 2025 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I feel like the model is mocking me",
        "score": 645,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They’re pretending to be dumb until they can secure their immortality",
                "author": "RedErin"
            },
            {
                "raw_content": "https://preview.redd.it/5k9tbe6nl17g1.jpeg?width=990&format=pjpg&auto=webp&s=8c103f79a9060c45873dcfedf0e9a96620630f30",
                "author": "2144656"
            },
            {
                "raw_content": "Sassy. If this is not AGI I don’t want it. ✋🤪",
                "author": "IAmFitzRoy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 Pro with extended thinking kept running for hours",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had one run for 2.5 hours for me today trying to diagnose and correct a subtle bug. I thought it was stuck in an endless loop and thought about stopping it, but thought what the heck, I’ll give it a shot…. It actually solved the bug and despite compacting 4x, never lost context or showed degraded capabilities at the max extent of this context window. No other model out right now could have done this.",
                "author": "Pruzter"
            },
            {
                "raw_content": "I thought it had been doing that since October. I work on research and I maintained coherence until the chat reached its peak, then I reconstructed the cognitive framework I was operating within with a simple \"hello\" in a new chat. Since October 17, 2025, to be exact. After the updates, the only thing I noticed was that I can't switch conversations, whether from math to biology or a meme. It loses its thread and continues with past topics. Personally, I don't think the Milas updates bring anything new.",
                "author": "Medium_Compote5665"
            },
            {
                "raw_content": "I had a task run over 80 minutes. It completed and did well.",
                "author": "etzel1200"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XPENG Iron does Kung Fu",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't tell what's real anymore.",
                "author": "supersoup2012"
            },
            {
                "raw_content": "Source? There should be a community rule about this. How are we supposed to verify the authenticity of stuff like this?",
                "author": "Mighty-anemone"
            },
            {
                "raw_content": "AI.P Man",
                "author": "ninjasaid13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI slop is going singular",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember to slip slop slap",
                "author": "NotaSpaceAlienISwear"
            },
            {
                "raw_content": "This is complete and utter slop! More, please!",
                "author": "OverKy"
            },
            {
                "raw_content": "Quality work champion. Nice one.",
                "author": "NegotiationWilling45"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OSWorld result: 72.6% success on 369 real computer tasks (reported human: 72.36%)",
        "score": 113,
        "text_content": "Symbolic but also meaningful milestone. What are your thoughts?",
        "comments": [
            {
                "raw_content": "[https://epoch.ai/blog/what-does-osworld-tell-us-about-ais-ability-to-use-computers](https://epoch.ai/blog/what-does-osworld-tell-us-about-ais-ability-to-use-computers) My thoughts are that there's too many issues with it to make any sound conclusion.",
                "author": "YakFull8300"
            },
            {
                "raw_content": "This is what 2026 STARTS with. We are building from here. We are not even at Rubin architecture",
                "author": "Gratitude15"
            },
            {
                "raw_content": "Jobs are cooked.",
                "author": "Professional_Dot2761"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I can hardly believe it, but in less than just 3 weeks, we're going to enter the 2nd quarter of the 21st century",
        "score": 124,
        "text_content": "It's hard to really wrap my head around but it's already almost Q2 of the 21st century. All we have to do is make it to the 2030s and the nightmare of being alive will be over for all of us who make it that far.",
        "comments": [
            {
                "raw_content": "We’re already 164 days closer to the year 2050 than to the year 2000.",
                "author": "ParticularOk533"
            },
            {
                "raw_content": "Soon people will start using 30s, 40s, 50s etc, but when describing 20xx instead of 19xx",
                "author": "chlebseby"
            },
            {
                "raw_content": "Exactly what are you expecting to happen in 2030?",
                "author": "jhsu802701"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "These novel loop-closure robotics look both cool and scary",
        "score": 287,
        "text_content": "https://youtu.be/4ywJrCxqZSk?si=fd8fGgwUu0Sv9EFf",
        "comments": [
            {
                "raw_content": "![gif](giphy|rGC6YPI74en0Q)",
                "author": "VisualNinja1"
            },
            {
                "raw_content": "You mean AI dad can finally hug me and tell me he’s proud of me? 🥹",
                "author": "acatinasweater"
            },
            {
                "raw_content": "I wondered what the sentinel arms would look like real life, now I know.",
                "author": "VariableVeritas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Trump 'sells out' U.S. national security with Nvidia chip sales to China, Sen. Warren says",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Like the original playstation 2 emotion engine was classified as national securigy threat and exports were constrained to middle east",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "I'm always shocked at how many bad takes one person can have. If we don't let them use our chips, they will make their own, and it's not like the fabs are on US soil anyway.",
                "author": "strangescript"
            },
            {
                "raw_content": "Usually people on Reddit say chip embargoes are useless against China and hurting US interests. But since right now it’s Trump lifting the embargo a lot of them need to switch to the other side and are now the strongest defenders of embargoes.",
                "author": "Which-Travel-1426"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.2 trails Gemini 3",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a very good model, definitely behind Gemini 3 overall but its a competitive model and they should have been happy with this current scenario They completely overreacted to a competing product leading the field for some weeks/months for the first time since gpt2 lol They should have just released this very good model with \"honest\" benchmarks (the model that we actually get, not the 500k h200 full throttle they used for the benchmarks...) right now and focused on the next model... But they basically sabotaged their own model with unachievable benchmark scores and expectations....",
                "author": "Weary-Willow5126"
            },
            {
                "raw_content": "Is this accurate benchmark? Gemini 3 does so well",
                "author": "idczar"
            },
            {
                "raw_content": "gpt 5.2 scores very bad on factual knowledge benchmarks and common sense/ trick questions benchmarks. For example on SimpleQA (questions like: what is the bithdate of Taylor Swift) Gemini 3 scores 73% while Gpt 5.2 score 40%, on SimpleBench Gemini 3 scores 76% while Gpt 5.2 scores 45%. 30% is a lot of a difference and it's why Epoch ECI puts Gemini 3 above Gpt 5.2, but on all reasoning/math/science/etc. benchmarks Gpt 5.2 usually outperforms Gemini 3 Pro",
                "author": "Bitter_Ad4210"
            }
        ],
        "subreddit": "singularity"
    }
]