[
    {
        "post_name": "GN from our original spirit animal",
        "score": 385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "gn tard.",
                "author": "1inchgroup"
            },
            {
                "raw_content": "GN and sleep tight you tards. If no one else tells you, you are loved by us and Jesus.",
                "author": "CaptRedbeard"
            },
            {
                "raw_content": "A fren is someone you can moon on purpose",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Waves of Democrat influencers are being exposed as foreigners under X’s new location update",
        "score": 548,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lots of foreigners vote in US elections...thousands.",
                "author": "Moebius"
            },
            {
                "raw_content": "Need it on this site too.",
                "author": "permissible_missile"
            },
            {
                "raw_content": "He may still have voted for kamala",
                "author": "WhatUCan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A British woman was brutally assaulted, referred to her attacker as a faggot in a text message with her friend. Her friend reported her for homophobia and she was arrested after being attacked. This is sick.",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Friend”",
                "author": "JBlaze056"
            },
            {
                "raw_content": "i would beat the living shit out of this \"friend\"",
                "author": "FUCK_TYLER"
            },
            {
                "raw_content": "The west... decades of cultural suppression and white hate from the elites ..and now ir is basically the real-imagining of the book 1984",
                "author": "oppressiondncwef"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SCOTUS Halts Injunction Against Texas’ New Congressional Map Pending Further Review",
        "score": 394,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just wish things would move faster, in the right direction. The move so fast the wrong way, but trudging back to sanity seems like its uphill through molasses",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "SCOTUS is so important in the constant lawfare, who do we have on the bench for the next opening? Thomas would be wise to retire while Trump can replace his seat. Sotomayor will kill herself with sugar soon. Anything could happen.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Is this about Jasmine Crockofshit?",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based! Trump revokes protected status for Somalians in Minnesota after massive Medicaid fraud exposed.",
        "score": 1117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are they going back to their shithole country?",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Make Snowgadishu Minneapolis Again",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "'Bout Time! OUT OUT OUT!!",
                "author": "TrumpsAmericaForMe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marjorie Taylor Greene announces her resignation from U.S. Congress on January 5th.",
        "score": 1167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even if she’s a lunatic we need the vote. Deliberately done on her part to fuck us over.",
                "author": "Exsultate"
            },
            {
                "raw_content": "After seeing Trump and Mamdani spooning like two faggots today, I'm not sure if I disagree with this woman now.",
                "author": "AR_MAGA"
            },
            {
                "raw_content": "She's made her money. Better to quit now more gets uncovered... Now watch what type of job she gets with which NGO and you'll see how she's comprimised.",
                "author": "somecunt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I. VOTED. FOR. THIS.",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Note the dig at “Waltz” :)",
                "author": "O__Q"
            },
            {
                "raw_content": "YES. Send them all back!",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Blocked by Federal judge no doubt.",
                "author": "Light_HIV_Effect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Breaking: Justice Alito administratively pauses lower court’s decision regarding Texas redistricting",
        "score": 1136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based.",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "It seems like there has been more rapid stays and rulings out of SCOTUS than any other six month stretch in my memory. It's almost like the SCOTUS justices have had enough of being usurped by district and appellate judges.",
                "author": "Danofdestiny"
            },
            {
                "raw_content": "Get wrecked activist judge.",
                "author": "nakedjay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - It’s being reported that at least six people have been shot at the annual Christmas tree lighting in Concord, North Carolina",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m here in a charlotte trauma center waiting. Nothing called out yet. But tensions are high in the city with ICE here and the Democrat machine going full steam ahead to label the majority of Americans as hateful NAZIs. Concord is about 30 min from charlotte, majority white, majority conservative.",
                "author": "Snooptwo"
            },
            {
                "raw_content": "Tranny Terror?",
                "author": "TrumpsAmericaForMe"
            },
            {
                "raw_content": "Friends there said likely gang related. Victims were that 13% crowd.",
                "author": "SupaMegaBen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BAN A SISTER FROM MARRYING HER BROTHER",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No thanks. I'd rather fuck the goat.",
                "author": "probabletower"
            },
            {
                "raw_content": "Ban somalians and mulsims from our country.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Cool. I’ll just buy AR10’s you ignorant African",
                "author": "10knotsorless"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WAIT TILL THE TRANNY COMPLAINS...",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is so 2024.",
                "author": "probabletower"
            },
            {
                "raw_content": "Nothing better than calling a tranny “sir” right to their face and watching them chimpout",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Subhumans only deserve the pronoun IT. \"It puts lotion on the skin or it's gonna get the hose again.\"",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How dairy go to brunch! Because you dared go out to eat, indoors, at a restaurant, because I’m immune compromised, I have to lock myself inside permanently! Why does no one care about me?",
        "score": 614,
        "text_content": "",
        "comments": [
            {
                "raw_content": "'immunocompromised' AIDS.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "https://www.reddit.com/r/ZeroCovidCommunity/s/eNQhKyntzG Don’t you think these people would eventually ask themselves how everyone living in normal life, going to a concert, walking mask list in the grocery store, meeting a friend for dinner, etc. period is still alive? Weren’t we all supposed to be dead for not wearing a mask 24/7 and getting like 17 jabs?",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "STRAIGHT INTO MY VEINS!! None of these fucks cared when I was fired for being a pureblood, so fuck em right to hell. I hope they do live until 100, and I hope they suffer the entire time. No mercy for the Covid fascists.",
                "author": "Snooptwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Go after people who rent to illegals for a tsunami of self deportations",
        "score": 1344,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Landlords aren't required to do e-Verify.",
                "author": "GarlicFart1776"
            },
            {
                "raw_content": "Stopping their HUD, SNAP, health benefits, loans, phones and education would also speed things up quite a bit.",
                "author": "MythArcana"
            },
            {
                "raw_content": "It's illegal to refuse tenants due to immigration status. They are protected by the fair housing act. Repeal that and all kinds of things will get better.",
                "author": "Joshua_holdiman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I got a hankering for some RIBS!",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“How much for one rib?”",
                "author": "dodgetimes2"
            },
            {
                "raw_content": "quality sticky",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Hope you got a stab proof vest on",
                "author": "PapaPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MTG's Resignation Letter",
        "score": 591,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait am I the only one agreeing with MTG?",
                "author": "Paxvobiscum"
            },
            {
                "raw_content": "TL: DR Cliffs: Trump broke me",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "One of the last few who were truly loyal to the cause. Some flaws but loyal nonetheless. And will likely be replaced by another spineless, Israel first faggot. Roughly a week after being told we have to import foreigners because Americans are too dumb. And on the same day he's praising a muslim socialist. Wtf is happening",
                "author": "LloydChristmas89"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MORE...MORE...MORE...MORE...",
        "score": 1329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is it that my roads are so insanely crowded in Colorado?! Common ICE- please make a stronger presence here.",
                "author": "Bunnybudman"
            },
            {
                "raw_content": "Not true here in the valley in Salt Lake City. ICE definitely needs to show up here. The traffic has quadrupled since 2018, when my husband retired and we moved here. Maybe more than quadrupled. Housing prices are crazy.",
                "author": "Skyes"
            },
            {
                "raw_content": "I miss fake pandemic traffic. By the way, covid isn't real and you're a fucking dumbfuck if you think it was. You got a cold. And if you got the shot, you're a dumbfuck, if you claim you'd get fired for not getting one, you're a dumbfuck coward.",
                "author": "ERIC_CIARAMELLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@RepLuna: If the Clintons defy their subpoenas there’s only one thing to do: Jail time.",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "J6 Them",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Sure, toots. Sure.",
                "author": "Zhongda"
            },
            {
                "raw_content": "So we rape kids, What difference at this point does it make? You can’t unrape them, therefore no standing.",
                "author": "thoughtcriminal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wanting Mamdani to succeed",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's dumb. You're retarded if you think communists learn from failures. And you would just turn new york into in even bigger shit hole",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "communism has failed plenty, it has a 100% fail rate, and yet the libs aren't deterred. another failure isn't going to do anything.",
                "author": "behemoth887"
            },
            {
                "raw_content": "The only problem is all the rats fleeing the sinking ship that chewed the hole in the hull to begin with.",
                "author": "HoldMyDangle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Department of Labor: \"STRAIGHT INTO MY VEINS.\"",
        "score": 1304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waiting for the usual suspects to black pill this stat and figure out a way why this isn't good because we haven't deported 10 quadrillion illegals in the first 10 months.",
                "author": "StoneRealist"
            },
            {
                "raw_content": "Now do Congress.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Bahahaha. I swear someone on here is running each of these accounts.",
                "author": "FatigueIsReal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am, as President of the United States, hereby terminating, effective immediately, the Temporary Protected Status (TPS Program) for Somalis in Minnesota.",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Told you this was coming. Just needed some heat to rise up on this",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "RUN MOTHER FUCKERS HAHAHAHAHAHAHA!!!!!",
                "author": "Agent_86"
            },
            {
                "raw_content": "Thank you, President Trump for your attention to this matter.",
                "author": "Maxmax"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Qualcomm has quietly rewritten Arduino's terms and conditions, and its not looking good",
        "score": 513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No surprises here, sadly it was expected.",
                "author": "immortal_sniper1"
            },
            {
                "raw_content": "Just avoid official Arduino products from now on and insist on clones. Qualcomm and At&T were the biggest enemies of WiMax when they pushed through LTE. But you know what happened? WiMax went big in low income countries because it was cheaper to roll out than LTE and as of 2025 there are over a billion people being served internet connections over that technology that was steamrolled in the North American markets by the likes of Qualcomm. They're not your friends. But I do respect some of their research. They've done some crazy stuff with network switch fabrics in both electronic and photonic networks. They're a big evil company with a history of bullying and using lawyers to push people around so you have to expect that if they're coming for an open source project, it's a hostile move. Why and to what end though? Every hobbyist uses clones anyway and it's like a five dollar board running a fifty cent chip. The freakin' genric USB cable and 1A USB power supply costs almost as much as the board. What part of that are you going to corner?",
                "author": "ahfoo"
            },
            {
                "raw_content": "Ah yes Qualcomm, the company that I'm told is going to save us from the x86 duopoly and Wintel shitboxes.",
                "author": "ProfessionalPrincipa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Demand May Double LPDDR5X and Server DRAM Prices in 2026",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this on top of the already doubled price?",
                "author": "Gummyrabbit"
            },
            {
                "raw_content": "I just imagine that scene with Steve Carell announcing “there’s a bubble”",
                "author": "gg06civicsi"
            },
            {
                "raw_content": "It is ironic that nvidia is becoming one of the biggest financial gatekeepers for gamers who need a new computer",
                "author": "DrBhu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why did Intel Optane Persistent Memory/ 3D Xpoint not take off?",
        "score": 118,
        "text_content": "The title, with Ram turning out to be such a huge factor for AI, and with Those old Optane DDR sticks having 128GB -512GB capacities per DIMM. What happend? I remember that it came and then was quickly killed off due to not being price competitive, but in a world like today the tech could have improved so much?",
        "comments": [
            {
                "raw_content": "It was insane priced. That’s why it died.",
                "author": "GongTzu"
            },
            {
                "raw_content": "Like you said, it was simply too expensive. On top of that Intel also did some shenannigans where to be able to use it you'd have to buy the more expensive CPUs of a line-up, making the cost barrier even worse. So it was out of reach for many, and the few that could, saw little benefit. At the time, the world wasn't as \"memory starved\" as it is now, so it was also a matter of poor timing I suppose.",
                "author": "MaverickPT"
            },
            {
                "raw_content": "Literally had a conversation with my coworker this week about how Optane was too early. Introducing new products and getting serious traction is really hard. If released today maybe Optane would’ve seen more interest.",
                "author": "flamingtoastjpn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why does Intel use the opposite terminology for \"dispatch\" and \"issue\"?",
        "score": 41,
        "text_content": "When reading through various CPU optimization manuals, it seems that most vendors use the following terminology when defining the stages of the CPU pipeline: - Dispatch: Transferring the uops from the frontend to backend(allocating a ROB + scheduler entry along with other resources) - Issue: when the uop is sent from the scheduler to the execution unit to be executed [AMD](https://docs.amd.com/v/u/en-US/58455_1.00), [Arm](https://developer.arm.com/documentation/109757/0301/?lang=en), [Apple](https://developer.apple.com/documentation/apple-silicon/cpu-optimization-guide) (you need a developer account to access their optimization guide), and the [RISCV Boom](https://docs.boom-core.org/en/latest/) microarchitecture docs all use the above terminology. However, Intel seems to use the term \"dispatch\" to refer to when uops are sent to the execution unit, and \"issue\" for when uops are sent from the frontend to the backend. [LLVM]( https://github.com/llvm/llvm-project/blob/39d4dfbe55cbea6ca7d506b8acd8455ed0443bf9/llvm/lib/Target/X86/X86ScheduleZnver4.td#L2) also uses Intel's terminology, however, I believe this is because Intel cpus were one of the first CPUs they created a scheduler model for, although this could be wrong. Does anyone know why Intel defines these terms differently from the rest of the industry? Not hating on Intel, I'm just curious. Edit: You can see Intel's use of the terminology when looking at their [perf events](https://perfmon-events.intel.com/): - UOPS_ISSUED.ANY: Counts the number of uops issued by the front end every cycle. - UOPS_DISPATCHED.ALU: Number of ALU integer uops dispatch to execution. They also use the same definitions in their software optimization manual.",
        "comments": [
            {
                "raw_content": "The answer to any question like this is always just history. Someone at the company called it that at some point before the terms were more standardized and nobody's gonna bother being the one to push for a meaningless change in the naming people are used to.",
                "author": "Master565"
            },
            {
                "raw_content": "I wasn't there but I think way back in the day the words were used pretty interchangeably for the act of sending instructions from frotend to the execution units in superscalar CPU. I don't think anyone cared enough to standardize.",
                "author": "jaaval"
            },
            {
                "raw_content": "As other people explained, its historical, but to go a bit further than them: Before super scalar and out of order execution, these were the same thing",
                "author": "GodOfPlutonium"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is the TPU really an ASIC?",
        "score": 19,
        "text_content": "I know all of the branding says its an ASIC, but is it really an ASIC or an ASIP? It feels like it does too much for it to be an ASIC. Can someone clarify please. Also, would Amazon's Trainium be the same?",
        "comments": [
            {
                "raw_content": "The industry doesn't really care about the distinction. Pretty much any vaguely custom hard design gets called an ASIC. Just about any VLSI design will have a relatively general processor sitting on it too that if you're an important enough customer and sign enough NDAs will get access to write your own software for.",
                "author": "monocasa"
            },
            {
                "raw_content": "TPU should be an ASIC I think since it's just doing Tensor operations. any interagted circuit that is designed to do a specific thing would be considered an ASIC, in this case only doing tensor acceleration seems pretty specific to me at least. CPU/GPU are not since they can programmed to do different tasks in stead of just pushing tensor operations around.",
                "author": "Ok_Spirit9482"
            },
            {
                "raw_content": "This is somewhat of a strange question. Yes, a TPU is an ASIC. Technically so is a GPU. An ASIC is just digital/analog logic that is for a specific application. For a GPU that’s video processing, for a TPU that’s tensor operations. I’ve never heard the term ASIP in the industry, but an ASIP would be a subset of ASIC and yes, it likely falls into that category with CPUs and GPUs. Something like a network modem ASIC wouldn’t be an ASIP.",
                "author": "raptor217"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I just wanna let y'all know, if you really think Game Key Cards are the Antichrist of game media, I promise that you have not seen ANYTHING.",
        "score": 339,
        "text_content": "This is where I draw the line with crappy Switch ports, because this doesn't even pass mustard for being a port. If Square Enix decides to make actual ports of these for Switch 2 and put them on a Game Key Card, I will take what I can get.",
        "comments": [
            {
                "raw_content": "Hoping we don't deal with that again.",
                "author": "rexshen"
            },
            {
                "raw_content": "Yeah anything but that cloud version would be great",
                "author": "Gunplaguy94"
            },
            {
                "raw_content": "Yeah I hate Game Key Cards but I would take them any day over fucking CLOUD streaming a game. What a joke. Not that im going to just roll over and accept key cards.",
                "author": "pocket_arsenal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Kirby Air Riders machine market is peak",
        "score": 1076,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bepis is so funny but dang it’s expensive",
                "author": "Impressive-Draft-965"
            },
            {
                "raw_content": "Yo they have Bepis!!! I say this to colleagues and they never understand.",
                "author": "acpom"
            },
            {
                "raw_content": "I feel smug buying some of the popular machines for 3000ish before they went over 100,000 lol",
                "author": "NoNefariousness2144"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sandwiches really do taste better with two pieces of bread",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Extra crunch makes it better",
                "author": "LonestarSecurityNW"
            },
            {
                "raw_content": "Because bread taste better than game key",
                "author": "Alickseff"
            },
            {
                "raw_content": "I'm putting pistachio cream with mine",
                "author": "Revenger-86"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Pulling Bikini Chef Kawasaki Fan Designs From Kirby Air Riders, Players Say - IGN",
        "score": 381,
        "text_content": "This was too funny not to share. Link to article: [https://www.ign.com/articles/nintendo-pulling-bikini-chef-kawasaki-fan-designs-from-kirby-air-riders-players-say](https://www.ign.com/articles/nintendo-pulling-bikini-chef-kawasaki-fan-designs-from-kirby-air-riders-players-say)",
        "comments": [
            {
                "raw_content": "I'm happy drawing bikinis on stars never once entered my mind.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "reminder that you could’ve had a dick drawn on your kart on mario kart ds and nintendo didn’t say shit",
                "author": "japan_kaaran"
            },
            {
                "raw_content": "If Nintendo aren't going to allow people to have any fun with the designer what is the point of including it. There's nothing even pg about this, it could make a G rated movie.",
                "author": "doctorhino"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Well, there is a storm today, and we lost power. Good thing my Switch has some charge so I can make the time pass faster.",
        "score": 291,
        "text_content": "We are all fine, by the way, if anyone's wondering, other than having no Wi-Fi, which sucks, haha.",
        "comments": [
            {
                "raw_content": "Make sure to put on airplane mode to save a little more battery.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I have an old Sears catalog and a candle for such times",
                "author": "Royal_Quarter_7774"
            },
            {
                "raw_content": "I always say handheld supremecy especially as a Floridian.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I caved in and bought Red Dead because of the free upgrade. Are you getting something this Black Friday?",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I did the same thing, bought it on Amazon for $24.99, the update is not out yet. I think it’s coming out December 2 -4",
                "author": "PaulBass76"
            },
            {
                "raw_content": "I got red dead also and I’m just waiting for the upgrade to play it",
                "author": "Hellmetal2185"
            },
            {
                "raw_content": "Nice I’m not far in it but I’m planning on hopping back in soon. Also does getting air riders and an amiibo count (both full price lol)",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What game did you buy during Black Friday thus far?",
        "score": 66,
        "text_content": "What game did you buy during Black Friday thus far?",
        "comments": [
            {
                "raw_content": "Echoes of wisdom. Finally getting around to trying it. I like it so far haha",
                "author": "Amiiboluke"
            },
            {
                "raw_content": "Waiting until Sunday’s Nintendo BF sale to get Echoes of Wisdom, Luigi’s Mansion 3, Paper Mario: 1000 year door and Mario Odyssey. Grabbed $100 in gift cards from Costco for $90 today to help make it a bit cheaper. I’d like to get FC26 but at 60GB that’s a tough sell for me when lots of first party games are like 5-10GB. Essentially need to factor in a MicroSD Express card to buy it.",
                "author": "wjgdinger"
            },
            {
                "raw_content": "Zero so far",
                "author": "KARURUKA2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Does this game has a lot of content? The game every 1 or 2 quest:",
        "score": 56,
        "text_content": "Hyrule warriors age of imprisonment",
        "comments": [
            {
                "raw_content": "has a lot of filler, if you're trying to 100% it.",
                "author": "retrocheats"
            },
            {
                "raw_content": "For those in family, what do those icons indicate? Battles? Bosses? Bases to capture?",
                "author": "susankeane"
            },
            {
                "raw_content": "Age of calamity was the same way. Same sound effects too oddly enough 😅",
                "author": "just_someone27000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mike Straw doubles (triples?) down on Half Life 3: Still thinks it's being revealed this year",
        "score": 496,
        "text_content": "From the latest Insider Gaming podcast: [https://www.youtube.com/watch?v=ZQeluxqHMIE](https://www.youtube.com/watch?v=ZQeluxqHMIE) * Has a date on hand but isn't willing to share it because he thinks it's a Canary Trap set up by Valve to catch leakers. * Unless he gets physical concrete proof of when it's releasing, he won't give the date. * But he still believes it's being revealed this year. * Still doesn't think it'll be at the TGA. * **IF** it pops up at the TGA then it'll be to show off more as a follow-up following the real reveal before the event. * Working hard to get some semblance of consensus on the date. * Both Tyler and Gabefollower still haven't said that the 2025 reveal plan has changed.",
        "comments": [
            {
                "raw_content": "This happened with Half-life Alyx, a bunch of different dates being thrown around to sniff out leakers.",
                "author": "Akella333"
            },
            {
                "raw_content": "December 3rd it is!",
                "author": "timetogetjuiced"
            },
            {
                "raw_content": ">IF it pops up at the TGA then it'll be to show off more as a follow-up following the real reveal before the event. I feel like I'm an insider now\\*, been saying this for days. It just doesn't make sense for Valve to do a reveal at any third-party event, they want a 24-hour news cycle all to themselves rather than to do Keighley or anyone else a favor with their most anticipated announcement ever.",
                "author": "renome"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MLID: “They didn’t plan ahead at all,\" says Xbox Series prices may increase again due to severe RAM shortages, with Microsoft reportedly telling partners the impact is coming “very, very soon”",
        "score": 816,
        "text_content": "[Source](https://thegamepost.com/leaker-xbox-series-prices-increase-ram-shortages-microsoft-soon/) \"\\[Microsoft\\] didn't plan ahead at all, apparently,\" Moore's Law is Dead said in the video. \"If you still want an Xbox for some reason at their current pricing, those prices could go up soon, or supply could just entirely dry up because multiple sources of mine have apparently been warned by sales reps at Microsoft that this is going to affect the Xbox Series consoles very, very soon. Sooner rather than later.\"",
        "comments": [
            {
                "raw_content": "#Moore's Law is Dead (MLiD) is a Tier 5 - Pretty Much Clickbait as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I don't see how any console or GPU manufacturer can avoid raising prices again here soon. This is a pretty serious problem for everyone.",
                "author": "PermanentMantaray"
            },
            {
                "raw_content": "The Xbox wasn't really selling great at $500 and I assume even worse at $650 if it goes $700+ no one in there right mind is going to buy one",
                "author": "CSBreak"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: Prince of Persia: Sands of Time Remake is scheduled to release in mid-January 2026",
        "score": 405,
        "text_content": "[Source](https://insider-gaming.com/prince-of-persia-sands-of-time-remake-release-update/) *In addition to the release plan, sources believe it’s likely that the next look at the game will come at The Game Awards on December 11, 2025. That’s always where the official date could be revealed.*",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I think a lot of publishers/devs have been wanting to minimize the reveal/release timeframe for a while, but something like that for big budget games is a pretty big risk that no one wanted to be the first to take. Oblivion was basically the big signal that the strategy works, so I think we're going to see it a lot more from here on out.",
                "author": "TrickBeginning9104"
            },
            {
                "raw_content": "Not sure if this makes me confident or worried. ... Yeah, think I'm worried!",
                "author": "mighty_mag"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Geoff Keighley tweets an image that looks like the Resonance Cascade from Half-Life, with a TGA trophy on the side.",
        "score": 404,
        "text_content": "[https://xcancel.com/geoffkeighley/status/1991907624951136477](https://xcancel.com/geoffkeighley/status/1991907624951136477)",
        "comments": [
            {
                "raw_content": "!Debunked! It's for Fortnite. https://xcancel.com/geoffkeighley/status/1991922503271551134?s=20",
                "author": "Chipaton"
            },
            {
                "raw_content": "He's baiting for his awards show, he literally does this every year",
                "author": "ThinkingWithPortal"
            },
            {
                "raw_content": "That doesn't look anything like a resonance cascade. It looks like a generic sci-fi portal ringed with Game Award statues.",
                "author": "Tafdolphin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Black Flag Remake Set to Launch Before March 31",
        "score": 736,
        "text_content": "https://insider-gaming.com/exclusive-black-flag-remake-set-to-launch-before-march/",
        "comments": [
            {
                "raw_content": "Didn’t tom Henderson say that the prince of Persia remake will launch first?",
                "author": "JjoyBboy"
            },
            {
                "raw_content": "I thought I heard the Old Man say: \"Leave her, Johnny, leave her.\" Tomorrow you will get your pay, and it's time for us to leave her. Leave her, Johnny, leave her! Oh, leave her, Johnny, leave her! For the voyage is long and the winds don't blow And it's time for us to leave her.",
                "author": "FransD98"
            },
            {
                "raw_content": "Excited for this. We will most likely get out first reveal at The Game Awards on December 11.",
                "author": "HLumin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Destiny 2 Renegades launch trailer leaks early via YouTube ad ahead of developer livestream",
        "score": 185,
        "text_content": "The trailer leaked via YouTube ad. It leaked before Bungie's official event on 25th november, 2025 [Source](https://thegamepost.com/destiny-2-renegades-launch-trailer-leaks-youtube-ad/)",
        "comments": [
            {
                "raw_content": "Eh its just a Pre roll ad, would have been more interesting if the full trailer got leaked.",
                "author": "shortMEISTERthe3rd"
            },
            {
                "raw_content": "Bungie and dlc stuff getting leaked a few days before the reveal, name a more iconic duo",
                "author": "Sauronxx"
            },
            {
                "raw_content": "Tf is renegades? New expansion?",
                "author": "Logical_Bit2694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next-Gen Intel Nova Lake processors to feature both Xe3 and Xe3p GPU tiles",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably desktop gets Xe3 and Laptops like potentially NVL AX gets Xe3P.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "More naming confusion inbound :)",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "With FSR Redstone coming, AMD shortens \"FidelityFX Super Resolution\" name to just \"FSR\"",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, what a news",
                "author": "Prychacz"
            },
            {
                "raw_content": "Wow, never heard \"FSR\" before. Call the news!",
                "author": "Elliove"
            },
            {
                "raw_content": "What's next? You're gonna tell me DLSS is actually an abbreviation for something?",
                "author": "Milk_Cream_Sweet_Pig"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9800X3D drops to $449 in the US",
        "score": 305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice. I’ll pair it with my $2,000 16Gb of ram.",
                "author": "ohmke"
            },
            {
                "raw_content": "Paid $479 back in February. Figured it would be a little cheaper than $449 by now",
                "author": "Resilient_Beast69"
            },
            {
                "raw_content": "got it for $399 at Micro Center a couple weeks ago...",
                "author": "kid-chunk"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD WIN 5 becomes the first AMD Strix Halo gaming handheld to reach gamers",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope the 388 is released sooner than later. Its the full fat 40cu GPU but only 8 CPU cores Should be somewhat cheaper and would make a great steam machine or gaming laptop.",
                "author": "JTibbs"
            },
            {
                "raw_content": "People talking about price don't realize how good it scales, it games it gets 4-6x TIMES the performance of the steam deck, that's better than linear scaling, and considering that the top tier like ROG or Lenovo already cost near 1000$ so it isn't even that big of a jump for the right people",
                "author": "copac20"
            },
            {
                "raw_content": "$1400-1500",
                "author": "starburstases"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD's Linux kernel patches suggest enablement of next-gen Instinct MI400-series AI GPU accelerators",
        "score": 33,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Large business laptop with AMD Ryzen Pro impresses - Lenovo ThinkPad T16 Gen 4 review",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m interested how many hours/minutes of teams/zoom call can it do.",
                "author": "najjace"
            },
            {
                "raw_content": "Remove numpad add haptic touchpad",
                "author": "New-Tomato7424"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire Edge AI: Mini-PC comeback with AMD Ryzen AI 9 HX 370 and magnetic lid review",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Cons > Fan turns up quickly under load You wouldn't want it to die from heat...",
                "author": "ChosenOfTheMoon_GR"
            },
            {
                "raw_content": "My unit arrived today after I ordered it on Wednesday. I've been holding out for it since they anmounced it 7 months ago. I didn't have the chance to really test anything software-wise yet, but overall the quality and compact since is astonishing. I shortly tested a Acemagic in February and compared to that, the Edge AI is a dwarf and featherweight. Really happy that they also implemented PD In @ 100W, so you can go with a more compact PD 3.0 charger. Shipping 4 different electric plugs for the power brick feels a bit wasteful though. The 2242 screw support being unfinished metal also feels a bit odd, because on my unit it looks like it rusted a bit, but nothing I feel worried about so far. I used an old Win 10 image for a first functionality test. It was from a N150 mini PC test 2 months prior, and after installing the cpu drivers the fans stopped going overboard and USB-DP alt mode also started working as intended. After I get a fresh image I can do some actual testing.",
                "author": "Baumpaladin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lowe's stock pops, CEO says Americans will renovate homes instead of moving",
        "score": 260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Magical thinking",
                "author": "ziptata"
            },
            {
                "raw_content": "Oh i have equity. But I ain't touching it to renovate to go more in debt. Pay your shit off. Pay outta pocket.",
                "author": "Sacmo77"
            },
            {
                "raw_content": "With what money?",
                "author": "Purple-Investment-61"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida condo prices suffer biggest decline since housing market crash",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The comments in that thread 🎆",
                "author": "McFatty7"
            },
            {
                "raw_content": "I love this sub. 85% of posts are specifically about a couple areas in Florida that have gotten hit by hurricane after hurricane for years straight, and from there you guys extrapolate that the entire housing market is crashing. Please more florida post guys",
                "author": "wasabijack0"
            },
            {
                "raw_content": "Thats unpossible! Bitcoin and house tokens never go down.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Luxury Home Prices Jump 5.5% in October, Triple the Pace of Non-Luxury Homes home prices grew 1.8%",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In good times and bad, somebody always has money. In these times the people who have money have almost all of it.",
                "author": "aquarain"
            },
            {
                "raw_content": "The reality here....For many parts of the country these so called \"Luxury Homes\" are actually middle-class housing where 2 professional incomes can afford higher house payments. And especially when data says that 30% of household incomes are now at $150k+ and is considered middle class income in many parts of the U.S.... and especially when the buyer is a \"move up\" buyer with a boatload of equity. For many, a million dollar home is becoming a normal price point.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "K economy. That’s the deal now.",
                "author": "bdd6911"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The share of mortgages that are underwater inches up to 1.6%—still far below the 23% seen in 2009",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uptick in VA and FHA loans, the SW, and recent vintages. So, basically, it means nothing.",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing affordability crisis accelerates fastest in rural America",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Leaked Memo: Sam Altman Sees 'Rough Vibes' and Economic Headwinds at OpenAI | A leaked internal memo has revealed CEO Sam Altman warning staff of \"rough vibes\" and a potential revenue growth collapse to 5% as OpenAI races to catch Google",
        "score": 390,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Admitting they have fallen behind Google is a big step.",
                "author": "Gadshill"
            },
            {
                "raw_content": "Me when I'm in a capitalism contest and my opponent has revenue https://preview.redd.it/68a14ctqkp2g1.jpeg?width=660&format=pjpg&auto=webp&s=7ad47249e8beaf60274e0df2bd3163c2b2de1d78",
                "author": "awesomedan24"
            },
            {
                "raw_content": "This is interesting in that it hints that much of OpenAI's revenue comes not from consumer use, people paying $20/month to ask chatGPT how they should handle their controlling mother or the best mexican restaurant for their trip to Toronto, but corporations and coders who have zero loyalty and will quickly switch to the best model available.",
                "author": "jakegh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ahaha",
        "score": 672,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait Is this entire image AI generated? Look at the Nano Banana watermark",
                "author": "changing_who_i_am"
            },
            {
                "raw_content": "Billions must prompt",
                "author": "colchis44"
            },
            {
                "raw_content": "OP went for this sub’s jugular",
                "author": "No-Marsupial-6946"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok lobotomised succesfully",
        "score": 2878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is surreal. Like, too absurd to put in words",
                "author": "wellomello"
            },
            {
                "raw_content": "inb4 this just gets handwaved tomorrow as \"unexpected behavior\" or \"experimental updates to the system prompt\" because the poor intern is too scared to say \"Elon made himself the source-of-truth yet again\"",
                "author": "Neat_Welcome6203"
            },
            {
                "raw_content": "u/askgrok out of all humans alive today, who could chug the most piss in an hour?",
                "author": "Torquggis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro Is The First Model To Score Higher Than Radiology Residents On Radiology's Last Exam!",
        "score": 223,
        "text_content": "https://x.com/DrDatta_AIIMS/status/1991378471604334604 >Gemini 3.0 Pro on RadLE v1: >✅ 51% accuracy; first time a general-purpose model has beaten radiology residents >✅ Radiology residents: 45% >✅ Board-certified radiologists: ~83% >✅ Shows clean step-by-step reasoning in some tough cases (appendix localization, mimics ruled out, etc.) >This is the first time ever that a generalist model has crossed the trainee bar on RadLE v1! Still not quite at the 83% threshold for Board Certified Radiologists but this is great progress. And for context, the Godfather of AI Geoffrey Hinton had stated all radiologist doctors would have been automated by 2021. So we are still way behind schedule but this is promising. This is a benchmark where Grok 4 and Claude Opus 4.1 are still scoring at 0% on. The closest competitor is GPT5 at 30%. Gemini 2.5 had scored 29%. Google increased performance by 22%. *IF* they can maintain this same level of progress for their next model updates, Gemini would cross the Board Certified Radiologists threshold by 2027.",
        "comments": [
            {
                "raw_content": "Anthropic models score so low on so many of these benchmarks",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "> And for context, the Godfather of AI Geoffrey Hinton had stated all radiologist doctors would have been automated by 2021 I'm not sure I would call 4 years 'way behind'. Even if this happens within 10 years of his prediction that's pretty stunning foresight",
                "author": "NoCard1571"
            },
            {
                "raw_content": "Radiologists score 83% no one bats an eyelid. Ai scores 99% - its unsafe!!!",
                "author": "nekmint"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 pro places 8th in EsoBench, which tests how well models learn and explore unfamiliar programming languages.",
        "score": 137,
        "text_content": "Full disclaimer, this is [my own benchmark](https://caseys-evals.com/). I played around with Gemini 3 pro before testing it and was quite excited as it felt really clever, and I was expecting it to be a new SOTA. But, it failed to beat Opus 4.1, or even o4 mini from April this year. However, in the heatmap you can see Gemini 3 pro has a yellow square in column 5. The columns are the question number, and the row the attempt number. Each question is repeated 5 times to get an average score. The yellow in column 5 means it actually solved this problem, at least once. Question 5 is the second hardest in this benchmark, and despite failing to solve a single instance of question 2, it found a solution to this vastly more difficult problem. I'm not sure what happened there, but even though its an overall bad performance, it is an ***interesting*** performance.",
        "comments": [
            {
                "raw_content": "i believe it, i have been super impressed with it for everything besides this random small programing language i wanted to play with called gleam where it was terrible",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "Is this with your own language? I'd love to see some open models on here, at least the tops ones like GLM, Qwen Code and Kimi K2 (thinking/nonthinking)",
                "author": "nuclearbananana"
            },
            {
                "raw_content": "Notice how Gemini 3 Pro has a yellow mark on the rightmost column which no other model has. Wonder what that implies in terms of novel problem solving skills.",
                "author": "da_grt_aru"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "my new favorite image model test: rendering complex RPG progression systems",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "while it looks very cool, most of it doesn't make sense because of the text rendering",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "https://preview.redd.it/1t8lvxeqbp2g1.png?width=995&format=png&auto=webp&s=2d53e27fade74d764c5f51afa0640915cf805878 My favorite test is a roller coaster... because it was something I actually wanted for a city builder I made, but Flux could barely even generate a wavy circular track and couldn't make a reasonable boarding platform at all. Every model I've tried since then also failed pretty badly--this is the first decent boarding platform I've gotten. But the track is still random optical illusion spaghetti.",
                "author": "DeProgrammer99"
            },
            {
                "raw_content": "think about the number of little skill icons involved if you want to estimate how long it would take to make one of these yourself - there's obviously more to it than a grid of icons, but that is the easiest way to understand, probably (as a game designer I think they are ballpark-decent from that perspective as well, in the same way that 'concept art' could be interpreted) bonus: new goalpost-mover skeptic possibilities like *\"it can't even balance the game!\"*. anyway, only a few years ago an AI making any of these individual icons was mildly impressive: https://preview.redd.it/a9y61r5n8p2g1.png?width=780&format=png&auto=webp&s=be93314c8802faf6974c47c7f3b76b536c900b7f",
                "author": "challengethegods"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Artificial Analysis launches a \"Complex Research using Integrated Thinking - Physics Test\" benchmark, testing LLMs on various physics fields. Current top benchmark score is 9.1%.",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/gw795zureo2g1.jpeg?width=3890&format=pjpg&auto=webp&s=cc9d207c61952f7d765307900acee94a75ef4e2f",
                "author": "Profanion"
            },
            {
                "raw_content": "Wow Gemini 3 Pro on top again! Nearly double second place!",
                "author": "CallMePyro"
            },
            {
                "raw_content": "https://preview.redd.it/k9choj12jo2g1.png?width=1481&format=png&auto=webp&s=35147d4e69fa83bdc2a18d8f60f4e6b855149df6 Token usage! nice!",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano Banana Pro Game Remasters",
        "score": 769,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Fallout New Vegas one is clearly the best upgrade in visuals, but I am actually really impressed that it decided *not* to mess with the art style of Wii Sports, and did a simple HD upscale instead. That is exactly what I would expect and want from a remaster of that game.",
                "author": "brett-"
            },
            {
                "raw_content": "Funny that in my head the games always looked like the second image.",
                "author": "pavelkomin"
            },
            {
                "raw_content": "The distorted reflection of Homer in the side of the car in the Simpsons Hit & Run image may be the most impressive change here. The fact that it understood the car should be shiny, and added actual reflections from the surrounding scene is mind blowing.",
                "author": "brett-"
            }
        ],
        "subreddit": "singularity"
    }
]