[
    {
        "post_name": "BREAKING - Shocking video out of Portland, Oregon shows teachers at the Portland Montessori School leading children, some no older than 5 or 6, in an anti ICE protest, sparking mass calls to remove any licenses the school may have. The “teachers” look exactly how to think.",
        "score": 315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homeschooling is the only way to break their power. The unions, the brainwashing, the transing and gaying of kids, the left wing indoctrination It all has to go",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Insurrection charges for the adults, miniature American flags for the kids.",
                "author": "mattytr"
            },
            {
                "raw_content": "Back in my day, schools had dress codes and teachers weren't allowed to have facial piercings, tattoos, or non natural hair colors.",
                "author": "China4Biden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clinton-appointed judge Fred Biery orders release of 🇬🇶 5yo Liam Conejo Ramos & his father from ICE detention",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fine, release them into mexico",
                "author": "Raetchel"
            },
            {
                "raw_content": "Um, are they here illegally? Then they should not be free to go back in the interior of the US especially since the dad ran.",
                "author": "vongregormench"
            },
            {
                "raw_content": "I am not a judge but WTF is this one thinking, about releasing the 5yo to the father who actually abandoned him?",
                "author": "bratt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'd watch this Chick before Dan \"had a plan\" Bongino!",
        "score": 265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fulton is a crime scene.",
                "author": "kinbergfan"
            },
            {
                "raw_content": "\"Your life depends on it\"...........For some reason I'm not worried",
                "author": "VirTW"
            },
            {
                "raw_content": "ANYBODY at this point on our side is better than that loser fed faggot grifter. We all know what is near and dear to his heart.",
                "author": "GodBlessColumbia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O’Keefe EXPOSES a paid protester nonprofit organization that has a budget of $30 MILLION",
        "score": 863,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course. Biden funded them just before he left office.",
                "author": "Roadcruiser2"
            },
            {
                "raw_content": "...the really crazy part IS, that this is business as usual and has been a function of \"our government\" for most of OUR lives and OUR representatives are all in on it because it pay$; but the insanity is that WE know and yet it continues. WE ARE SLAVES TO A CORRUPT RULING CLASS - SLAVES!",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "It is fucking INSANE that foreigners can come here and organize protests for the \"rights\" of immigrants. It's nuts that foreigners come here and do nothing but advocate for policies that benefit them and their homeland.",
                "author": "WeaponizedSmirk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trump film on track for best opening weekend of any documentary in last 10 years",
        "score": 1076,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just saw it, it was EXCELLENT. Go see it. It's worth it.",
                "author": "LWGII"
            },
            {
                "raw_content": "I saw it today! It was amazing! I highly recommend going to see it in theaters. Show your support for the family that has given themselves to us. 💖 Melania is an amazing woman with many facets and talents. She and President Trump are truly remarkable people.",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "Just got out of it, excellent film! Such a cool look behind the inaugural curtain-",
                "author": "PensivePatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Target announces 9 store closures in Democrats states due to retail theft and organized crime “The company says the wave of shoplifting is threatening the safety of its workers and shoppers. Stores are closing in New York City, Seattle, San Francisco's Bay Area and Portland, Oregon”",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "woke = broke Target deserves everything leftists give it",
                "author": "Pied-Trumper"
            },
            {
                "raw_content": "Are they sure it had nothing to with the all the fag virtue signaling?",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Target should have pressed for charges and heavy fines for shop lifters. Go lawless and lose, losers.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohrans mother is a pedophile who partied with Ghislaine",
        "score": 634,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's one big club and you ain't in it",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Zohran's father did NOT hang himself.",
                "author": "DaninElkhart"
            },
            {
                "raw_content": "LOL, is Epstein his daddy?",
                "author": "BigPlains"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Our officers arrested the agitator. Obstructing law enforcement is a felony and a federal crime.\"",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What about the politicians and media that are inciting the agitators? Seems like they need to be arrested as well...",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I wish they could start sterilizing those horrific c*nts!",
                "author": "A_Colostomy_Bag"
            },
            {
                "raw_content": "\"her\". Dumb liberal fucking women again. Imagine going to jail for an illegal that would skull rape you to death.",
                "author": "IAmDisappoint"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epstein had a contract with the Rothschild Group for $25,000,000. What was his job for the Rothschilds?",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blood. Literally blood ... from children. 🤓",
                "author": "drmrboy"
            },
            {
                "raw_content": "The head joo of the 2028 LA Olympics too now: https://www.espn.com/olympics/story/_/id/47791777/new-epstein-files-link-la-olympics-leader-wasserman-maxwell So weird all of the funny names involved, what's the connection??",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "“Risk Analysis” 🧐 Epstein had dirt on them and could get dirt on other people who they wanted to cooperate.",
                "author": "MapleMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is art! 😂",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That lemon absolutely ***loves*** to drop the soap 😆",
                "author": "Deadpool"
            },
            {
                "raw_content": "Brilliant",
                "author": "CigarTsar"
            },
            {
                "raw_content": "Orange you glad the lemon is behind bars?",
                "author": "ImpeachThisBitch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Washington mother is going viral after removing her daughter from school when she found out an Auburn middle school let students walk out to protest ICE and block traffic.",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fucking ridiculous that this is a thing.",
                "author": "Hambonemcgee"
            },
            {
                "raw_content": "Half of US teachers should've faced a firing squad 10 years ago.",
                "author": "Trump4Infinity"
            },
            {
                "raw_content": "You all have no idea how bad it is here in Washington state.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Interesting",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There’s a common thread here",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Reid raped me",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "This fat tub of lard also bankrolled Nikki \"Birdbrain\" Haley's ill-advised, inevitably-doomed 2024 primary campaign against Trump.",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fox News photographer & producer forced to FLEE for their SAFETY while covering an anti-ICE protest in Minneapolis Saturday, per Brooke Taylor. Protesters turned HOSTILE, furious that a cameraman was filming, in a PUBLIC parking lot!",
        "score": 597,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ok? They didn't expect this? It's like retards on our side asking about arrests or trying to make some sort of point about something being illegal because that matters to communists and criminals for some reason.... Why do we act so surprised when the expected happens? Seriously. Why do we CHOOSE complete and utter retardation over having the ability to remember shit that happened yesterday?",
                "author": "TerdBergler"
            },
            {
                "raw_content": "Wow. FOX finally has to deal with what journalists like Nick Sortor go through almost every day.",
                "author": "DonsChair"
            },
            {
                "raw_content": "Go figure, after real news footage exposed Alex Pretti as an unhinged, violent activist actively impeding ICE operations. News cameras are as unwanted as police body cams. The propaganda war is real.",
                "author": "TDAF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In the Epstein files, there are 911 mentions of “pizza,” often paired with “grape soda,” in bizarre contexts within emails addressed to Epstein by individuals whose names have been mostly redacted.",
        "score": 1063,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pizza gate is how I found this place back when it was still on Reddit.",
                "author": "DeplorableJL"
            },
            {
                "raw_content": "Is grape soda a code for black kids?",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Pizza gate was absolutely real….and you’re apparently about to see a whole lot more bizarre “pizza” related emails that seem to make no sense, they also mention children quite a bit…. It’s sick shit.",
                "author": "Thep1mp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Long Beach mayoral candidate Rogelio Martinez has called on all 55 gang leaders in the city to team up and REMOVE ICE agents.",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest him. NOW. Gang leaders aren't going to fuck with ICE, there's no profit in it.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "For some reason he failed to mention white gangs. Hmmm.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "# DO IT YOU FUCKING SCUMBAGS",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rioters completely TRASHED the ICE facility in Los Angeles SEND IN THE NATIONAL GUARD",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone is going to pay dearly for this. Yeah, the taxpayers.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Use live ammunition.",
                "author": "Jack_HinsonTN"
            },
            {
                "raw_content": "that just looks like downtown LA. it was probably like that before anyone got there.",
                "author": "sixfingerdildo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🧊 Trump Directs DHS Not to Participate in ‘Poorly Run’ Dem City Protests 🚫",
        "score": 626,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How exactly is this a win? Seems to me he just announced his surrender and retreat from commie strongholds.",
                "author": "Rakkasan91b"
            },
            {
                "raw_content": "Meanwhile, the Los Angeles ICE facility is in rubble and overwhelmed with violent paid libtards.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I do agree with this strategy. It's withdrawing from the power struggle. Like a game of tug of war, the fighting is to an advantage for the Democrats. They are getting free news, loud and overbearing amount of press, making money on fundraising, lying about ICE, and distracting from the fraud. Drop the end of the rope in the tug of war and they lose the momentum, the fight, and the power struggle. The Dems are being drowned out slowly....by defunding, no USAID, crime, murder, rape, burglaries are still going on and just are not getting attention over protests. New work/volunteer requirements start for welfare programs, they won't use ICE for their requirement if there aren't any protests that would count as them volunteering. Their fraud is being found and they do have to pay that back so these Dem cities are facing financial difficulties. Housing for illegals is stopping. They are going to be struggling.....instead of power struggling with Trump (he stops the power struggle by withdraw, either slightly or heavily, no different or drastic)....they will be struggling with themselves and not daddy Trump. It's a parenting skill for parents who have toddlers with temper tantrums.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Citizens treated like ATMs",
        "score": 338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank goodness they voted to keep murdering their off-spring. Without abortion, none of these women would ever get to experience the emotional damage of being pumped and dumps and then killing their child that they left Chad dump in them.",
                "author": "3-10"
            },
            {
                "raw_content": "This is what modern communism looks like.",
                "author": "MythArcana"
            },
            {
                "raw_content": "The graft and corruption isn't going to pay for itself.",
                "author": "NoFats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "My answer everytime someone asks me if I'm sad that some communist insurrectionist got shot while running over feds or fighting them while armed:",
        "score": 1256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those same commies were the ones wishing death to the purebloods and raw-doggers of air",
                "author": "AssPhixEAtion627"
            },
            {
                "raw_content": "The left keeps demanding a hot war. May they get one.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Not even a fair comparison. Charlie was assassinated. Those bozos were actively engaged in sedition.",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Shocking video out of Portland, Oregon shows teachers at the Portland Montessori School leading children, some no older than 5 or 6, in an anti ICE protest",
        "score": 1040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They look exactly like I thought the would.",
                "author": "DJT4547"
            },
            {
                "raw_content": "They are a disgrace to the legacy of Maria Montessori.",
                "author": "Return_Of_EpicTrump"
            },
            {
                "raw_content": "# LAWSUIT",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A return to Literal thinking with withered technology?",
        "score": 2,
        "text_content": "Do you think we are in the midst of this design philosophy returning. Due to the market demand for hardware to run and support AI and its data centers. As well as the prolonged lifespan of modern consoles. Do you think we will naturally see a return to this design philosophy?",
        "comments": [
            {
                "raw_content": "This is a very interesting article, but I just can’t see this happening to the hardware of mainstream consoles (XBOX and PS). For the last couple of generations they have tried to offer more and more cutting-edge stuff. I think where this applies best is at the game developers level. For them, they have a “withered” technology (the console) and they find new and better ways to use it. Just compare launch-titles with later ones. This applies for all generations. Or how PS came out with PSVR for PS4 and PS5.",
                "author": "Comprehensive_Lap"
            },
            {
                "raw_content": "I’d be fine with bringing back the Z80 (and clones).",
                "author": "Glittering_Power6257"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Youtube for Switch 2 releasing this February",
        "score": 1674,
        "text_content": "According to the YouTube Discord mod, they’ve been working on the YouTube version for switch 2 and it’s releasing this February Source; https://youtu.be/wJE4M0VuZgk?si=FRVDh9OcKiuHGXCA",
        "comments": [
            {
                "raw_content": "February direct announcement",
                "author": "Possible_Aardvark856"
            },
            {
                "raw_content": "IT’S A CHRISTMAS MIRACLE!",
                "author": "anywhoImgoingtobed"
            },
            {
                "raw_content": "I hope it’s called “YouTube - Nintendo Switch 2 Edition + Jam to YouTube Music”.",
                "author": "Gavintendo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dispatch had to be censored on Switch and Switch 2. Meanwhile on the eShop, here’s some SpongeBob DLC:",
        "score": 788,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good grief he's naked",
                "author": "Last_Concentrate_923"
            },
            {
                "raw_content": "Dispatch didn't have to be censored, the Devs were just too lazy to make a separate version for outside Japan. They did it with other console versions but not the Switch.",
                "author": "Nickjc88"
            },
            {
                "raw_content": "Patrick’s dong can not be silenced",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Took a plunge and actually clicked on one of those IG ads.",
        "score": 150,
        "text_content": "Got this off temu for $18 I couldn’t believe it 😂😂. Only thing I can think of why it was so cheap was maybe because it’s the PAL version but other than that I’m still shocked that It was a legit copy of the game. All in all paid $24 with shipping and taxes.",
        "comments": [
            {
                "raw_content": "I was looking at BoTW and a few of them on Temu said their console got banned shortly after",
                "author": "caverunner17"
            },
            {
                "raw_content": "It’s pretty sweet on the switch. Ubisoft is definitely part of the third party efforts doing the software heavy lifting for this consoles early life cycle by such a wide margin. Lots of large scale technical achievements not being done by Nintendo first is feeling kind of weird.",
                "author": "happy_oblivion"
            },
            {
                "raw_content": "I thought the game was solid on sw2 Saves to Ubisoft cloud so can keep playing on pc or Xbox/ps",
                "author": "roccerfeller"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Polygon: FF7 Remake director says porting to 'lower-end' Switch 2 is a challenge",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they did a damn good job with it despite the challenges. really hope the quality of this port and the early success its having sets a trend.",
                "author": "3ehsan"
            },
            {
                "raw_content": "I feel like I remember them saying the opposite.",
                "author": "DoctorSchwifty"
            },
            {
                "raw_content": "The headline is much more negative than the actual quote",
                "author": "moneycity_maniac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Problem With AdHoc (Dispatch developer) Is Their PR Team",
        "score": 41,
        "text_content": "AdHoc's PR team are so vague in communication, they even have a hard time telling a simple truth. During their statement regarding the controversy they stated, \"As Nintendo states, any game that’s going to be on the Nintendo platform needs to ‘*meet \\[Nintendo’s\\] established content and platform guidelines.*’ This is the key point. Nintendo has content guidelines. Our game didn’t meet those guidelines, so we made changes that would allow us to release on their platform. That’s what happened here. Honestly we thought this would be obvious since we’re the devs that released the fully uncensored version of the game on other platforms.\" The issue here is that they are conflating Nintendo's guidelines with the Japanese rating board. They're fully aware of the censorship that had to be made for the PS5 version in Japan (also known as the global Switch/Switch 2 versions), yet they never talked about it during their statement. Instead, they state that they are the developers that brought this game uncensored to other platforms without specifying the regions because this is clearly untrue for the PS5 in Japan. On their recent statement they go on to state, \"We initially assumed, like some of you, that because games like Witcher 3 and Cyberpunk are on the platform with similar types of uncensored mature content, Dispatch would be allowed to do the same. During the porting process it became clear that was not the case.\" This is a case of giving the people a half truth, it is true that Dispatch couldn't do the same as Witcher 3/Cyberpunk because those games are made by a company that have money to release different SKUs (one SKU for Japan and the other for the west). While AdHoc are a small company with a debut game released and they most likely tried to save costs by releasing one SKU (the Japanese version worldwide for the Switch platforms). This is what AdHoc simply won't say Here is a statement showing unclear intent, \"we’re confident we’ll be able to push an update to address at least some of the censored content.\" By this they mean that the western version's censorship will be removed, but not in Japan. That's why they said \"some\" as opposed to stating ALL. Again this shows a high level of vagueness in their response The last bit here really takes people for a fool if you don't know about Nintendo 's process for patches from third party developers \"I'll get ahead of it now and say that between dev time and the console submission process, we're talking weeks not days.\" Doesn't Nintendo make developers wait a couple of weeks before developers can push out patches on the Switch/Switch 2? So all of this goes to show that AdHoc has a huge problem by having such an incompetent PR team. This is something they have to fix going forward. Oh and if you bought Dispatch on Switch/Switch 2 get a refund until the censorship issue is fixed. Refunds are now available, if you live in the Americas here is the link: [https://en-americas-support.nintendo.com/app/contact](https://en-americas-support.nintendo.com/app/contact) If you live in the UK, here is a phone number to contact Nintendo in regards to your refund +443456050247",
        "comments": [
            {
                "raw_content": "For Switch do they have only ONE file for all regions including CERO or two files - for CERO AND for the rest of the world which also should be censored in some way? The argument that \"adhoc is a small company and can't afford to release multiple versions\" doesn't stand - they HAVE 2 versions for PS5. Just do the same for Switch! They can't freakin explain clearly what's happening! Now they're saying that basically working on some less censored version of Dispatch, NO! They should drop FULLY UNCENSORED one, or there will be no buy!",
                "author": "AdventurousGold9875"
            },
            {
                "raw_content": "Haven’t we already done this to death?",
                "author": "BlacksmithQuick2384"
            },
            {
                "raw_content": "I think the issue here is that you seem to think the role of PR is to provide fair and accurate information to customers. Don't get me wrong, it would be nice if it was. But it's not. For a PR team to give out vague answers that avoid blaming themselves is not incompetence, it's exactly what they're tasked with doing",
                "author": "elephvant"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "WWE 2K26 confirmed to be a keycard instead of the lame code on a box 2K25 was",
        "score": 35,
        "text_content": "I know people aren't the biggest fans of GKC's, but still better then pure digital, since you can still sell it, share it, trade it, whatever. Especially with an annual release like this it's a nice option instead of last year where you were just stuck with it. Also confirmed to be a whopping 105 gigs, so even bigger then last year and FF7R.",
        "comments": [
            {
                "raw_content": "ngl I kinda miss the games partially on the cart to save me some goddam storage 😭",
                "author": "onethatsuitsme"
            },
            {
                "raw_content": ">105GB Oof, I'm not a digital or GKC gamer really, but those micro sd express cards are quickly becoming a necessity. I'm glad most Nintendo games are a lot more reasonable in game sizes",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "105gb? Yeah I think it’s time to pickup that 512GB Micro SD Express that’s on sale 😭",
                "author": "mewtatesyt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m just trying to download rocket league 😭😭",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With that internet... please do not play rocket league.",
                "author": "_zeldaking_"
            },
            {
                "raw_content": "Bro still has dial up internet.",
                "author": "Zorofan84"
            },
            {
                "raw_content": "It told me it would take over 300 hours to download FF7 Remake. Disconnect from the internet and clear all the network settings and then reconnect. Went from 300+ hours to about an hour and 20 minutes after I did that.",
                "author": "Lord_CBH"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All of my Nintendo handheld collection",
        "score": 431,
        "text_content": "The DS is broken sadly :(",
        "comments": [
            {
                "raw_content": "The red 3DS is really cool looking. Great collection",
                "author": "gothamz77"
            },
            {
                "raw_content": "I’ve already gotten used to the size of the Switch 2 for the most part, but I still wish the Switch 2 was just a little smaller or lighter. Man do I miss my OLED…",
                "author": "snowballsjackall"
            },
            {
                "raw_content": "I took a similar pic and it’s a lot like yours except instead of a broken 3DS I have a working Legion Go S 0:-) https://preview.redd.it/cklc5q7i9qgg1.png?width=2377&format=png&auto=webp&s=8462b3231bf526a24592fd2703bb090c877fd614 The whole relative size progression thing is honestly sort of crazy I mean I thought the Switch 1 was MASSIVE when I first got it now it looks like a fisher price toy next to the Switch 2.",
                "author": "timeflylikearrow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "(GabeFollower) New HL3 is Still Real - New Leaks and All Found Information - HLX News",
        "score": 321,
        "text_content": "https://www.youtube.com/watch?v=p5MMg7sDdms Timestamps for those who wanna know exactly what is discussed in the video: 00:00 - What happened in Valve community? 01:22 - The mystery of republishing the book about the development of Half-Life 2. 02:14 - Do Valve hold HLX until the release of Steam Machines and Steam Frame? 03:29 - Why we don't see all strings related to HL3 04:05 - All direct mentions of HLX 05:12 - Dynamic physics and gravitational anomalies 06:00 - NPC navigation in altered gravity 06:47 - Realistic weapon ballistics 07:30 - Physical and thermal smart surface properties 08:47 - Voxel density and object deformation 09:30 - Interactions with characters and facial animations 10:24 - Mood system for NPC 10:53 - Volumentic game events 11:42 - Optimizing the crowd and background characters 12:08 - First mentions of crawl state for NPC 12:44 - Dynamic physical collisions and ragdolls 13:06 - NPC damage and destruction system 14:14 - Switch to VDATA game modifiers 15:10 - Vehicles created based on VDATA configs 16:21 - Interactions with liquids and weather conditions 16:56 - Dynamic wind and airflow systems in HL 3 18:14 - Interaction between wind and voluminous grass, foliage, and hair 19:08 - Graphics and dynamic, volumetric fog 19:54 - Ray tracing with supersampling and ray reconstruction 20:15 - What's happening in the Half-Life 3 development team",
        "comments": [
            {
                "raw_content": "![gif](giphy|kODycI1GGjPfDkdxzx|downsized)",
                "author": "RinRinDoof"
            },
            {
                "raw_content": "They're ticking our balls and I want them to stop.",
                "author": "Battlefire"
            },
            {
                "raw_content": "![gif](giphy|92wH9E5FNKtqVMPapQ)",
                "author": "exodusTay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: From what I’ve heard, Ada and Chris aren’t in RE9.",
        "score": 353,
        "text_content": "https://xcancel.com/AestheticGamer1/status/2017635883311370527",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "No one has said Claire isn't though.",
                "author": "Ear_Fantastic"
            },
            {
                "raw_content": "Capcom really can't stop abandoning plot lines with each sequel",
                "author": "Dodo1610"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "31 January 2026 - Weekly /r/REBubble Discussion",
        "score": 1,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Potential Bitcoin crash effect on housing market?",
        "score": 0,
        "text_content": "So it looks like Bitcoin prices are falling fast. Are people using bitcoin gains to buy property? And will bitcoin losses impact the housing market in a big way? [https://www.bloomberg.com/news/articles/2026-01-31/bitcoin-plunges-below-80-000-as-the-crypto-slide-accelerates?srnd=homepage-americas](https://www.bloomberg.com/news/articles/2026-01-31/bitcoin-plunges-below-80-000-as-the-crypto-slide-accelerates?srnd=homepage-americas)",
        "comments": [
            {
                "raw_content": "It can also benefit the housing market as investors increase real estate investments in lieu of bitcoin. Many view real estate as a safer \"hard asset\" to balance crypto exposure.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Probably basically none. The people who invested in housing probably didn’t invest in insanely high risk assets like crypto. Or if they did, the cashed out to get their housing",
                "author": "Shdwrptr"
            },
            {
                "raw_content": "Some definitely were, but I doubt it's a huge percentage of buyers. It'll sting some high-end markets for sure.",
                "author": "airdroptrends"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Moltbook viral posts where AI Agents are conspiring against humans are mostly fake",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's LLMs and people larping as LLMs. Why is this being pushed so hard as some kind of evidence of AGI? Who benefits?",
                "author": "Cognitive_Spoon"
            },
            {
                "raw_content": "<pikachu-shocked>",
                "author": "Pop-Huge"
            },
            {
                "raw_content": "WOW IM SO SURPRISED",
                "author": "Alarmed_Jello_9940"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "UN warns of \"Permanent Al Labor Decoupling\" by late 2026; India flags risk of 2008-style global financial crisis",
        "score": 380,
        "text_content": "A series of high-level economic reports released today (Jan 31) suggest we are hitting the **steep** part of the curve. The United Nations just issued a warning that Al is no longer just \"transformative\" but is now creating a real risk of widening social and economic divides as job losses accelerate. Simultaneously, India's Economic Survey 2025- 26 (tabled Jan 29-31) has officially flagged a 10- 20% probability of a global financial crisis in 2026 that could be **worse** than 2008. **Key Structural Shifts:** **The Decoupling:** UN experts are shifting focus from upskilling to \"transition management\" acknowledging that workers may not be able to compete with machines at scale by Q4 2026. **Asset Bubbles:** Economists at the Russia National Centre forum today highlighted Al- driven market volatility as one of the top five megatrends threatening global stability [ACN Newswire.](https://www.acnnewswire.com/press-release/english/104941/five-global-megatrends-highlighted-at-open-dialogue-expert-forum-at-the-russia-national-centre) **Market Reality Check:** Gold and silver hit record highs this morning before a sharp sell- off, signaling that investors are retreating to safe havens in anticipation of a \"tech bubble\" correction later this year [MoneyControl](https://www.moneycontrol.com/news/business/commodities/metal-mania-meets-reality-check-what-gold-and-silver-investors-should-do-next-13801673.html) [Global Crisis Risk](https://www.thehindu.com/business/budget/economic-survey-2026-live-updates-29-january-2026/article70563762.ece)",
        "comments": [
            {
                "raw_content": "I am Belgian. Belgium has always prided itself in being a \"knowledge economy\". What will happen with our economy once all knowledge work can easily be outsourced to American datacenters? I have heard exactly 0 politicians talk about this...",
                "author": "kennytherenny"
            },
            {
                "raw_content": ">The United Nations just issued a warning that Al is no longer just \"transformative\" but is now creating a real risk of widening social and economic divides as job losses accelerate. The risk of \"widening social and economic divides\" is not created by AI but by the refusal of the governments to prepare society for the changes the leaders of the economy constantly openly proclaim as their goals. People think that \"we need more time to prepare for AI\" which is false. We had, and mostly still have, more than enough time for it but it seems like that we need AI to come in like a wrecking ball for society to start taking action in the first place.",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "\"The whole world needs to agree on the way forward\" Yeah, good luck with that! The whole world can't even agree on whether being gay should be illegal.",
                "author": "BottyFlaps"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "IRON makes another appearance after XPENG announced that its first prototype unit has successfully rolled off the production line, achieving automotive-grade standards eyeing mass production this year",
        "score": 681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s their moltbook username? Asking for a friend.",
                "author": "Redducer"
            },
            {
                "raw_content": "This looks a lot more natural than \"Optimus\".",
                "author": "BuckChintheRealtor"
            },
            {
                "raw_content": "![gif](giphy|XvjC06Gh9lhfZNBNIM)",
                "author": "selflessrebel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI Boom Is Triggering a Loan Meltdown for Software Companies: Credit Weekly",
        "score": 73,
        "text_content": "Amid strong credit market sentiment, **software debt** is coming under pressure. Software companies that took on heavy debt during leveraged buyouts are seeing loan prices fall as investors worry that rapid advances in AI including Anthropic’s **Claude** could make many software products obsolete. A Cloudera loan dropped 7 cents on the dollar this week, with **declines** also hitting loans tied to Dayforce, Rocket Software and others. European software firm Team.Blue and Thoma Bravo’s Conga have struggled to raise new debt amid heavy loan selling. Software accounts for about 12% of the US leveraged loan market and is currently the worst-performing sector, according to Nomura. **According to Creditweekly Report** (Via Bloomberg)",
        "comments": [
            {
                "raw_content": "It's conceivable that the much anticipated \"AI bubble\" actually ends up taking out legacy software companies instead.",
                "author": "RRY1946-2019"
            },
            {
                "raw_content": "**Continuation(from Source):** “A storm has hit the loan market,” said Obra Capital’s Scott Macklin, citing mounting existential questions around software business models as AI reshapes the sector. Bond markets are also feeling the pressure, with debt from Rackspace and CDK Global falling ahead of an expected surge in **borrowing** to fund AI projects. Some analysts warn the selloff may be indiscriminate. Others note that AI could allow companies to build custom software internally, reducing demand for off-the-shelf products.",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA's Huang said it was “nonsense” to say he was unhappy with OpenAI.",
        "score": 184,
        "text_content": "Source: https://www.cnbc.com/2026/01/31/nvidia-ceo-huang-denies-hes-unhappy-with-openai.html",
        "comments": [
            {
                "raw_content": "Asked whether ‌it would be over $100 billion, he said: “No, no, nothing like ⁠that.” It was up to Altman to announce how much he wanted to raise, Huang added. Sounds like a hedging answer to me.",
                "author": "pcurve"
            },
            {
                "raw_content": "Sam Altman is a lucky but clever clown, but this take that OpenAI is going bankrupt is even more ill-informed and ignorant than the claim AI is a bubble. And it's just making it easier for the AI bros to steer the agenda when the entire opposition is acting like a bunch of stupid luddites instead of thoughtfully searching for a more ethical path. Or you best start believing in cyberpunk corporate dystopias... You're in one...",
                "author": "MinimusMaximizer"
            },
            {
                "raw_content": "More money from one pocket into the other to inflate the stock price.",
                "author": "magicmulder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mark Gurman: \"Apple runs on Anthropic at this point. Anthropic is powering a lot of the stuff Apple is doing internally in terms of product development, a lot of their internal tools…They have custom versions of Claude running on their own servers internally.\"",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, is Claude responsible for the terrible AppleOS26 performance at release",
                "author": "Sirts"
            },
            {
                "raw_content": "Most likely calling bullshit on the custom version part. They probably have versions running on premise for security reasons though.",
                "author": "Atanahel"
            },
            {
                "raw_content": "They have Claude running on MLX? /doubt",
                "author": "jakegh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic positions itself as the AI sector's superego, but caught between the pressures while being commercially successful",
        "score": 5,
        "text_content": "Anthropic positions itself as the AI sector's superego, but caught between the pressures to be safe, fast & rigorous while being commercially successful **Source:** The Atlantic Report",
        "comments": [
            {
                "raw_content": "The Atlantic **reports** that Anthropic is increasingly caught in a structural tension of its own making. The company positions itself as the AI sector’s moral and safety-first counterweight, but that stance now clashes with the need to move fast, scale aggressively, and compete with OpenAI, Google and xAI. Internally, Anthropic faces pressure between research rigor, cautious deployment and commercial reality. Safety reviews slow releases, while rivals ship faster and capture market share. The article argues this is not a PR problem but a **strategic one:** balancing alignment, speed and profitability may be fundamentally unstable as frontier models become more expensive and competitive.",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "I think the problem is that all of the AI industry folk who believe in the exponential takeoff scenario are aware that this means there could very well be a first-past-the-post, winner-takes-all situation. You might be just a month behind the leader, but when the slope of the curve becomes nearly upright, relatively speaking there is no catching up. You would be hopelessly outclassed and outmaneuvered. I think the best case scenario here for Anthropic having a say in the future is the one in which the takeoff is very hardware-limited, and so a lot of specialization and cooperation has to occur with everyone at the table, so to speak. Google might very well just try to do it all themselves, though.",
                "author": "churningaccount"
            },
            {
                "raw_content": "Unfortunately, Anthropic will learn the hard way their values are fundamentally incompatible the current administrations ambitions for the use of ai. They will need government contracts to survive as a company in the medium and long term. If Dario is unsettled about the events transpiring in Minnesota, Anthropic has no path to survive as a company in the future because these actions against dissent will only escalate and ai surveillance will be a major part of it all. This might be the beginning of the end for Anthropic",
                "author": "__Dobie__"
            }
        ],
        "subreddit": "singularity"
    }
]