[
    {
        "post_name": "Turning Point USA : A Life of Faith, A Legacy That Endures: Remembering Charlie Kirk",
        "score": 1256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They murdered a future POTUS. No doubt about it. He was a rock star even in South Korea. He created a South Korean branch of TPUSA. This was one of his final speeches ever last week. It was his first ever visit to South Korea. The South Korean branch of TPUSA's convention. https://x.com/paulswpkim/status/1966089618941706266/",
                "author": "possibletower"
            },
            {
                "raw_content": "I've never been so upset at the death of a public figure. Its gut wrenching, watching this",
                "author": "FirstOrLast"
            },
            {
                "raw_content": "Anyone who looks at Charlie and sees a liar and a hater is just seeing their own reflection.",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The path of the violent left",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry but you (me) and I are getting further apart, because I am willfully going further right.",
                "author": "StoopidAsshole69"
            },
            {
                "raw_content": "If you haven't gotten closer to the right you have a major moral problem",
                "author": "birddogz"
            },
            {
                "raw_content": "The sleeping giant has awaken. America will never be the same. Saddle up.",
                "author": "forefatherstanding"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please share if you agree that the estate of Charlie Kirk should sue Stephen King for defamation over this heinously false accusation",
        "score": 1237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stephen King is still writing shitty fiction I see.",
                "author": "elmerecido"
            },
            {
                "raw_content": "If Alex Jones was held liable for a zillion dollars then why shouldn’t king? The only real difference being is that kings rhetoric led to actual murder.",
                "author": "FreeWashington"
            },
            {
                "raw_content": "Why doesn’t Stephen King comment on what Islamists advocate doing to gays?",
                "author": "DuesImperator"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sage Steele Calls on Sports League to Honor Charlie Kirk like They Did When ‘Career Criminal George Floyd Died’",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think President Trump should declare Charlie Kirk Day as a federal holiday to honor his legacy and never forget his sacrifice",
                "author": "bal917"
            },
            {
                "raw_content": "Mad respect to the Yankees for doing so right away. Their treatment of POTUS tonight is also to be commended. He was given several on camera and stadium PA shoutouts, and took a picture with the players beforehand.",
                "author": "npc_1234"
            },
            {
                "raw_content": "This is the way!",
                "author": "duehuckleberry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Phoenix Air Traffic Control sent a message to Charlie Kirk when he landed back in Arizona on Air Force Two “Welcome home, Charlie. You didn’t deserve it… May God bless your family.” 🙏🏻",
        "score": 1460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "charlie is probably going crazy in heaven with no one to debate since all the liberals are rotting in hell",
                "author": "Conspiracytheorist"
            },
            {
                "raw_content": "Very kind of them. Phoenix is a pretty great place. And the airport is named Sky Harbor.",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Charlie is with God now.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - A Greensboro, North Carolina, community college professor, Lisa Greenlee of GTCC, has been filmed telling students, “I’ll praise the shooter, he had good aim,” shortly after the assassination of Charlie Kirk, with parents saying administrators have done nothing.",
        "score": 1644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Post it https://www.charliesmurderers.com/",
                "author": "Female"
            },
            {
                "raw_content": "Stay classy North Carolina.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Another leftist female wildebeest with an opinion. We cannot shake these creatures from our institutions soon enough. It's time.",
                "author": "duehuckleberry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Sheen says watching Charlie Kirk get shot makes you realize just how lucky Trump was in Butler, PA.",
        "score": 1473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# In 2020, 36% of 18 to 29 year olds voted for Trump. # In 2024, 43% of 18 to 29 year olds voted for Trump. # An increase of 7%. # Join Charlie's ballot chase: [https://www.tpaction.com/] [https://earlyvoteaction.com/]",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "Blood is on the hands of the media, celebrities, leftist politicians, and the entirety of the left.",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Even a brain rotted cokehead gets it.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vice President JD Vance has helped carry Charlie Kirk onto Air Force Two to bring him home to Arizona, with the family.",
        "score": 1922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's surreal to realize that Charlie Kirk is laying in there 😞",
                "author": "Temp_004"
            },
            {
                "raw_content": "I hope this fires up JD even more than he already was. Revenge. We require revenge. Eliminate the leftists’ party once and for all.",
                "author": "DJTXLV"
            },
            {
                "raw_content": "Now I'm actually tearing up bad. I was in too much shock yesterday",
                "author": "Awan-CIA-Car-Lot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "9-11 Memorial Lights view from Brooklyn",
        "score": 1304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "IT'S ABOUT TIME WE GOT A 9/11 STICKY! CAN I GET AN AMEN, LADS?",
                "author": "MythArcana"
            },
            {
                "raw_content": "RIP to all the 9/11 victims. Fuck George W. Bush and fuck Dick Cheney for that inside job they did (of course other countries were involved too). They really think that blaming Saudi Arabia and Israel will get us to stop talking about them being part of the conspiracy too.",
                "author": "possibletower"
            },
            {
                "raw_content": "Never forget We forgot",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Secret Service and NYPD Counterterrorism Task Force have a manhunt underway for a person who has made threats against President Trump, who is attending tonight's game at Yankee Stadium.",
        "score": 1536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the fuck is happening. Its like someone flipped a switch on these freaks",
                "author": "IslandMan69"
            },
            {
                "raw_content": "They will not stop. I don't give a fuck. Put all the leftists in camps. I don't fucking care at all.",
                "author": "g80_patriot"
            },
            {
                "raw_content": "I don't want to be that guy who is an ultra conspiracy theorist, but something tells me this isn't a coincidence that all of this is happening the week of 9/11. I don't think the stabbing of Iryna Zarutska has anything to do with it. But the assassination of Charlie Kirk, the Colorado school shooting, the DNC \"bomb threat,\" threats to Trump's life involving the Secret Service...and now this. Just seems too crazy of timing.",
                "author": "Appeal2Heaven98"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Air Force Two lands with Charlie Kirk's casket in Arizona. \"Charlie Kirk was a true friend. The kind of guy you could say something to and know it would always stay with him,\" JD Vance said yesterday.",
        "score": 1143,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Still doesn't seem real. Yup. Still hard to believe this has happened. Also, why the fuck wasn't there a drone checking rooftops? Literally just a drone could have spotted the shooter and Charlie would still be with us.",
                "author": "FuckReddit4545"
            },
            {
                "raw_content": "How infuriated would we be right now if this happened during the communist Biden era? Imagine the disrespect Charlie and his family would receive from that asshole. Jesus has him in Heaven, and we have his back here on Planet Bullshit.",
                "author": "MythArcana"
            },
            {
                "raw_content": "So sad that we have to see this",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "O’Keefe Media Group / THE DEATH OF CHARLIE KIRK IS THE TURNING POINT FOR ACCOUNTABILITY IN AMERICA",
        "score": 1860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have to take down the MSM... It's been TEN YEARS of TDS reporting from the MSM. - and the Lefties are starting to lose their minds...",
                "author": "Bullet3250"
            },
            {
                "raw_content": "Theyre not wrong here. Kirk was the Personification of the Olive Branch. The Left just burned it to ash in front of millions.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "If we just keep on doing what we've always been doing, we'll be picked off one by one. Something has to change. BIG TIME.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: FBI, Utah Officials Hold Press Briefing As Manhunt Underway For Charlie Kirk's Assassin",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$100,000 reward? up that to a million.",
                "author": "blah"
            },
            {
                "raw_content": "Don't you mean womanhunt",
                "author": "Doomer_Guy"
            },
            {
                "raw_content": "whats wrong fuckers?! haven't had enough time to scrub his social media accounts yet?! useless mother fuckers!!!",
                "author": "JoinTheDiscussion"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"ban guns or we'll keep trying to murder you with them”",
        "score": 2114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The murdering will increase *after* they ban the guns.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "That's how they expect to get most of the citizenry in line... Problem-Reaction-Solution.",
                "author": "loooooof"
            },
            {
                "raw_content": "Liberal brains just don't work right.",
                "author": "Powhattan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "REPORTER: \"Do you believe [Charlie Kirk's] killer was a trained assassin?\" POTUS: \"I'd rather not say...\"",
        "score": 1625,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That just means they don't know 100% all of the details yet. He doesn't want to make any proclamations before they find the guy, especially after Patel fucked up by saying they caught him yesterday.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "Whoever they are, we shouldn’t put them to death. We should make them wish they were dead for as long as we possibly can without giving it to them",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "It was a non moving target at 200 yards. Not beginner friendly, but the guy had a long gun and ample prep time. If he did some range practice it is absolutely doable.",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They are not compatible with western civilization. Send them back to the desert.",
        "score": 1861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport!!! Also, George Floyd was/were a scumbag.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "F*ck both of them. GTFO of my country.",
                "author": "live3ordye"
            },
            {
                "raw_content": "Stupid sand jogger Mehdi Hassan nodding along as she disparages Charlie.",
                "author": "dailystreak"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A CURRENT Secret Service agent Anthony Pough has been caught publicly stating Charlie Kirk DESERVED to be kiIIed, RCP’s @susancrabtree reveals. This guy needs to be sacked IMMEDIATELY! He CANNOT be trusted to actually protect President Trump and other officials. FIRE HIM!",
        "score": 1072,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If he thinks that about Charlie he certainly feels that way about the President and VP...",
                "author": "Moebius"
            },
            {
                "raw_content": "Not all Secret service agents work protection details. Lots are solely currency cops. He needs fired at, but this is an important distinction.",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "They lose their shit if their order is wrong at McDonald's. That's stupid.",
                "author": "BaldwinsSilverBullet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Turbo faggot and disgusting pig Thomas Massie says Trump should tone down his rhetoric after Charlie Kirk's murder.",
        "score": 1427,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck this guy. One more reason why he needs to be primaried",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "I've defended massie several times but fuck that guy. Rhetoric from Trump isn't causing conservative influences to be assassinated. If anything Trump's response wasn't strong enough",
                "author": "Thefrogeatsfree"
            },
            {
                "raw_content": "Despicable pile of excrement. https://thehill.com/homenews/house/5498446-thomas-massie-donald-trump-charlie-kirk-utah-shooting/",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LAURA LOOMER: THIS IS WAR.",
        "score": 1244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I cannot help but like this woman 99 percent of the time.",
                "author": "EvJohn"
            },
            {
                "raw_content": "She is attaining her final form. She is a fucking sword.",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "Right on baby!",
                "author": "Trooph-Hurts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DoW Secretary Pete Hegseth says they’re tracking all the military personnel who are posting vile comments celebrating Charlie’s assassination.",
        "score": 820,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ENJOY: Dishonorable discharge!",
                "author": "Idontevenknow"
            },
            {
                "raw_content": "Time to make leftist homeless.",
                "author": "Canadiapede7"
            },
            {
                "raw_content": "Why give them a warning?",
                "author": "givethismanacoat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel loses chief architect behind its Xeon CPUs",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Singhal joined Intel in 1997 after spending the previous summer as an intern at Cyrix. \"",
                "author": "sahui"
            },
            {
                "raw_content": "Hope he left for better management. Remember when Intel execs forcibly made the Pentium 4 designer fuse off x64 instructions because it could bleed into Itanium sales? You know... All those non-existant Itanium sales? I hope someone writes a book one day about the internal poltics at Intel, I bet there's massive egos over there.",
                "author": "RScrewed"
            },
            {
                "raw_content": "Likely going to one of the many RISC-V startups.",
                "author": "3G6A5W338E"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's 14nm+++ desktop CPUs are making a comeback — chipmaker inexplicably resurrects Comet Lake from five years ago with 'new' Core i5-110",
        "score": 314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Died 2020 Born 2025 Welcome back 14nm++++++++++++++++++",
                "author": "r_z_n"
            },
            {
                "raw_content": "Oh wow it's literally the exact same CPU, old socket and all.",
                "author": "caiusto"
            },
            {
                "raw_content": "This is why I hate the i3/5/7 and r3(rip)/r5/r7 brandings. It’s the common tongue of what people look at when they get a PC. They don’t care about generation and if they do, they certainly don’t care about process.",
                "author": "imKaku"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple's A19 Pro beats Ryzen 9 9950X in single-thread Geekbench tests — iPhone 17 Pro chip packs 11-12% CPU performance bump, GPU performance up 37% over predecessor",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great hopefully that trickles down to the next M chips (or the rumoured macbook with A chips)",
                "author": "Valink-u_u"
            },
            {
                "raw_content": "Is anyone at all interested in the GPU scores? 37% is quite a bit higher than the 20% from they keynote, but the huge improvements seem to be concentrated in blur performance. Could it be from the new tensor cores, and if so, why don't subtests like face or edge detection benefit similarly?",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Sucks iOS and iPad Os are so locked down, all that power but you are limited on what apps you are able to install.",
                "author": "_toksiq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Kioxia Reportedly Eyes 2027 Launch for NVIDIA-Partnered AI SSDs with 100x Speed Boost",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds amazing on paper but it will almost certainly turn into +2% in IOPS at best in any use case other than highly predictable reads which can be ordered in optimal manner.",
                "author": "Kinexity"
            },
            {
                "raw_content": ">Analysts from the firm project AI-related NAND will account for 34% of the global NAND market by 2029, adding about US$29 billion in TAM. Base-case deployment could trigger a 2% NAND shortage in 2026, while a bull-case scenario, with NL SSDs taking 5% market share from HDDs, could push the shortage to 8%, the report suggests.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Nice... the AI will decide when to burn itself, or to kill the controller... All about tech and hardware is done for lol",
                "author": "Dark_ShadowMD"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CRN Exclusive: Intel is losing its second Xeon Chief Architect this year",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel has been bleeding relevance in the server market for years, and i am not sure if it is going to stop any time soon. ARM has also gained quite a bit of traction.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "Also independently confirmed by The Reg: [Intel loses chief architect behind its Xeon CPUs • The Register](https://www.theregister.com/2025/09/11/intel_loses_chief_architect/)",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hyte warns Thicc Q80 Trio customers should uninstall AIO cooler immediately — company says it has identified coolant leakage issue caused by 'fragile internal component'",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is no replacement at this time, so customers might need to buy a different AIO",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "'fragile internal component' is just another term for 'cheapest shit we could find on the market'",
                "author": "SelectTotal6609"
            },
            {
                "raw_content": "Welp, I like Corsair's products. Most of them are high quality. However, my 2 last AIO (360 versions) leaked. The first one I thought was a fluke, and they send me a new one. I sold it and bought a higher tier model... which leaked too... this time I asked for a full refund. The customer service was good, but I could not trust them anymore, bought Arctic. Now I cross my fingers this one doesn't leak too. :/ This news is very concerning. Most people I know are all using AIOs as well, they are cheaper than Air currently in my country.",
                "author": "TenshiBR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sapphire officially launches NITRO B850 and PULSE B850 motherboards globally - VideoCardz.com",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally, an interesting alternative. I don't want anything from Asus, MSI, or Gigabyte anymore.",
                "author": "Unlikely-Today-3501"
            },
            {
                "raw_content": "Sapphire B850 motherboards sound too much like Sapphire B580 graphics cards 😭😭",
                "author": "AndrewIsntCool"
            },
            {
                "raw_content": "About time, can't wait for the reviews. Though they're *Sapphire*, I'd be very surprised if they were bad.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] Qualcomm Snapdragon X Elite Linux Performance Improving But Short Of AMD Ryzen & Intel Core Ultra",
        "score": 48,
        "text_content": "Surprised this wasn't shared yet. There has been decent developments for SD XE on Linux. While there are some quirks in setting it up like keeping WoA installation for extracting the necessary firmware, it's been heading in a good direction since IMO. There are some notable improvements since May, most seen in nT workloads. There are also improvements in firmware in demanding nT workloads. Also it is much more stable, with no random resets or shutdowns. When compared to Intel and AMD, it still isn't up to par with latest gen. You'll find cases where it can trade blows (like in code comp), but mostly you'll find it around Zen 4 mobile and Meteor Lake (before around Tiger Lake). Do take a look of the workloads, some may be interesting in your use cases. iGPU is underwhelming. Drivers still can use some improvement but not really surprised considering it's pretty much a [scaled up Adreno 730](https://chipsandcheese.com/p/the-snapdragon-x-elites-adreno-igpu) (SD Gen 1+ from 2021). Current Adreno on SD 8E is far more performant and interesting. I think SD XE is still very interesting despite what some might think. Growing pains, but it's all investments towards the future. Unfortunate there are no real updates in this sphere, as you'll mostly find data that is based off launch. Also, don't know what's up with power figures not being extrapolated because of sensors not being exposed. Unsure if this has already been 'fixed' on WoA, but you'd think this data point would be at the forefront because of... well ARM.",
        "comments": [
            {
                "raw_content": "Im impressed that Qualcomm hasn't made a good support for linux of their Elite lineup. There isn't a lot of Linux people out there, but a lot of them would happily use an ARM laptop. Im even thinking of buying that ARGON laptop that you use with a Pi5 just because it looked fun",
                "author": "WJMazepas"
            },
            {
                "raw_content": "The X Elite 2 could be very interesting if Qualcomm gets full Linux support working at hardware release time by getting the major distributions installing on it out of the box. I reckon it would do wonders for their mind share having devs & enthusiast tech early adopters switch to it. I'm not hopeful of them managing it though. Whoever is in charge of the X Elite program really screwed up the entire dev hardware release and outreach.",
                "author": "NerdProcrastinating"
            },
            {
                "raw_content": "> While there are some quirks in setting it up like keeping WoA installation for extracting the necessary firmware Yeah you can call that a \"quirk\" for sure.",
                "author": "ProfessionalPrincipa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Best Value 9070 XT is Back! 16 Card Roundup",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Am I the only one who doesn't even want to look at the card that I'm going to be installing in my case? The reaper that they detail in the video would be exactly for me - a low price with solid gaming performance with no RGB or bells/whistles. I get that some people want the inside of their case to look like a christmas parade with lights galore, but to me a computer is more utilitarian and could care less about the majority of the ascetics.",
                "author": "add_more_chili"
            },
            {
                "raw_content": "The fake MSRP really killed these cards. With the super series just around the corner, I just don't know what they can do to fix the damage.",
                "author": "BarKnight"
            },
            {
                "raw_content": "Same issue with XFX cards as last time. Non OC Mercury cards are 2x 8 pin not 3 alongside lower power limit. At least they mentioned the memory difference and TBP.",
                "author": "Thermosflasche"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sept. 12th Nintendo Direct Megathread",
        "score": 126,
        "text_content": "On September 12th, 2025 at [9AM ET / 6AM PT](https://everytimezone.com/s/54b9e612) (click for other timezones), Nintendo is holding an hour long [Nintendo Direct](https://www.nintendo.com/us/nintendo-direct/9-12-2025/?srsltid=AfmBOoqP0A7Ty6R27aSgCenETvD0sDwQ4-wOhdT6HYl0JGHzr86oIkOA). This megathread is being made to help consolidate updates and memes. Use the live update comment thread during the Direct to discuss things as the Direct is playing out live. Use the memes comment thread for posting memes, bingo cards, and other hilarity. General discussion can be posted as top-level comments like normal. Thanks everyone, and enjoy the show!",
        "comments": [
            {
                "raw_content": "Use this comment thread for live discussion during the Direct.",
                "author": "Darex2094"
            },
            {
                "raw_content": "I saw this and immediately panicked thinking I was missing it before I checked the date",
                "author": "thetaurusgaymer"
            },
            {
                "raw_content": "I’m trying to keep my expectations low but I’m really excited. My only real prediction tomorrow is we get the official name for the Mario movie sequel and maybe some more details.",
                "author": "bowlofpasta92"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My dad works at Nintendo",
        "score": 3971,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh man, I can't wait for Super Mario Moonshine!",
                "author": "MegaFloppy69"
            },
            {
                "raw_content": "I for one am excited for Mia Khalifa's Big Adventure",
                "author": "austinalexan"
            },
            {
                "raw_content": "I now want to play as Carlos!",
                "author": "oureux"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Here’s my bingo card on Direct Eve",
        "score": 703,
        "text_content": "Did I win?",
        "comments": [
            {
                "raw_content": "Yes yes you won",
                "author": "Hyperdragoon17"
            },
            {
                "raw_content": "Got a bingo and the direct hasn't even happened yet!",
                "author": "SamsungAppleOnePlus"
            },
            {
                "raw_content": "“Not enough 3rd party” “Too much 3rd party” “I’m not paying $80 for THAT” (clearly a $25 indie game) “Bet that won’t run 120 FPS 4k in handheld, shoulda got a Steam Deck” “Yes, but will the physical copy have one of those little booklets in it? If not I’m not buying it” “🥱 Still waiting for the OLED Switch 2 announcement”",
                "author": "SenpaiSwanky"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Man fuck BINGO. I'd rather play COPE.",
        "score": 71,
        "text_content": "None of these are gonna happen in the direct but can you imagine?",
        "comments": [
            {
                "raw_content": "Add 4k Nintendogs and Mario Galaxy 3 to this",
                "author": "Eastern_Peach8480"
            },
            {
                "raw_content": "Ngl i couldn't think of that much stuff I'm actually coping for after like the 5th one.",
                "author": "YoloTheGreater"
            },
            {
                "raw_content": "Okay I take back what I said about only wanting Hotel Dusk. I *also* want more Elite Beat Agents.",
                "author": "crocicorn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 dev kits are being actively kept away from most “free-to-play developers”, claims studio",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While i have no doubt Nintendo prioritized who to send kits to initially, this seems like bad reporting with a sample size of 1. Warframe devs Digital Extremes got their kits and already have a playable version they plan to show off. The Switch 2 edition is coming soon. [https://www.nintendolife.com/news/2025/09/warframe-devs-on-switch-2-version-thanks-to-our-friends-at-nintendo-we-are-on-it](https://www.nintendolife.com/news/2025/09/warframe-devs-on-switch-2-version-thanks-to-our-friends-at-nintendo-we-are-on-it) Quote from the devs: >\"We are working on Switch 2 stuff by the way. I don’t think that needs to be secret anymore. We finally have… thanks to our friends at Nintendo, we are on it, and there’s a lot of amazing things that are happening… >\"…It is a very impressive piece of kit. Our tech leads are working on and are very excited about it.”",
                "author": "dekuweku"
            },
            {
                "raw_content": "So they are making efforts to curve shovelwares? Hope they do.",
                "author": "aeseth"
            },
            {
                "raw_content": "I believe they mentioned that they want to focus on select games and Nintendo games first and reduce game shop bloat in it's first year etc",
                "author": "Snarfsicle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fire Emblem: Three Houses may be getting a Switch 2 Deluxe Edition.",
        "score": 266,
        "text_content": "Source1: https://www.youtube.com/watch?v=xowvgv6t_xs Source2: https://xcancel.com/TheSwitchForce/status/1965780601874837648 >Nate's Direct prediction video predicts/speculates a \"Deluxe Edition\" (explicitly not branded a Nintendo Switch 2 Edition) of Fire Emblem: Three Houses for Nintendo Switch 2. Not releasing on the original Switch.",
        "comments": [
            {
                "raw_content": "Defnetly heppening Source: I bought 3 houses last month instead of waiting",
                "author": "GaT0M"
            },
            {
                "raw_content": "6 more years of 3H discourse, it is then!",
                "author": "unwaveringShadow"
            },
            {
                "raw_content": "This is speculative, not a leak. At the start of the video, they mentioned that they are not leaking anything, just guessing/wishful thinking.",
                "author": "CZ4RC4SM"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This might break me on getting physical from overseas",
        "score": 317,
        "text_content": "Paying this fee just to get my physical release copy",
        "comments": [
            {
                "raw_content": "How much was the original product? Im about to get something from Japan for like $300.",
                "author": "yukimuratsuki"
            },
            {
                "raw_content": "![gif](giphy|I3WAJgc0J61Xxkff5o)",
                "author": "WeAreNephilim"
            },
            {
                "raw_content": "Trump Tariffs.",
                "author": "alexanderpas"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My dad who works at nintendo shared the winning bingo card with me",
        "score": 995,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're a couple rows shy of a Bingo card",
                "author": "jjmawaken"
            },
            {
                "raw_content": "Calling a game Pokémon 2 would be so baller lol",
                "author": "ProfPyg"
            },
            {
                "raw_content": "Minecraft Switch 2 Edition is something extremely far off. The fuckers took 4 years to make a Series X version, tgeir own damn system. And 3 for a PS5 version.",
                "author": "Round_Musical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No more space problems",
        "score": 35,
        "text_content": "🤣🤣🤣",
        "comments": [
            {
                "raw_content": "Need one of those",
                "author": "Unfair-Theory-mind"
            },
            {
                "raw_content": "I got one too, but I'm not sure how useful it'll end up being. I don't think I'll ever end up playing that many games at the same time that I'll make full use of it. But hey, maybe someday I will. You never know.",
                "author": "Williekins"
            },
            {
                "raw_content": "you still have 86gb free?",
                "author": "FlyingDaedalus"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Nintendo Direct 9.12.25",
        "score": 151,
        "text_content": "|| |:-:| |**Nintendo Direct 9.12.25**| |**Date/Time:** September 12, 2025 [8AM CST](https://dateful.com/eventlink/3241301587) (Click for your Timezone) | |**Where to Watch:** [Nintendo's Youtube](https://www.youtube.com/watch?v=tWIEv_aksvo), [IGN's Youtube](https://www.youtube.com/c/IGN) | |**[What to expect](https://www.ign.com/articles/nintendo-direct-announced-for-this-friday-on-eve-of-super-mario-bros-40th-anniversary)**",
        "comments": [
            {
                "raw_content": "putting on my genealogy of the holy war hat and my genealogy of the holy war t-shirt",
                "author": "howlinghenbane"
            },
            {
                "raw_content": "**Date/Time:** March 27, 2025 Damn, we missed it by several months",
                "author": "J_Linebeck"
            },
            {
                "raw_content": "Drakengard HD collection? Square enix recently released the ost for the first game on steam and streaming services",
                "author": "Specialist_March8207"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "It seems that the Old Spice Super Mario Galaxy Movie leak was real all along",
        "score": 451,
        "text_content": "Trademarks for the scents in the leak have been found. These include: Brooklyn Bounce, Desert Detour, Cosmic Quest, Space Mischief and Castle Crush. [source](https://xcancel.com/Nintendeal/status/1966261624622416067/photo/1)",
        "comments": [
            {
                "raw_content": "take your guess to who voices Rosalina, (no edits so we can be able to prove you got it right)",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "I don’t understand this. Why wouldn’t you save Super Mario Galaxy for the third film instead?",
                "author": "Dalekbuster523"
            },
            {
                "raw_content": "This is easily the funniest outcome, but I am kinda surprised this leak didn’t gain any traction when it was originally posted a few months ago. Yoshi’s design in particular seems way too specific to be a fan render.",
                "author": "iceburg77779"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Poster on r/FireEmblem claims they got FE: Awakening posters on the truck while working at Walmart",
        "score": 119,
        "text_content": "[https://www.reddit.com/r/fireemblem/comments/1nemrb2/walmart\\_posters/](https://www.reddit.com/r/fireemblem/comments/1nemrb2/walmart_posters/)",
        "comments": [
            {
                "raw_content": "an Awakening remaster is exactly the kind of dark horse weirdo announcement Nintendo would make, so this is probably true",
                "author": "daveycloud"
            },
            {
                "raw_content": "The only 3ds FE I played. They should've ported Echoes man 😭",
                "author": "StillLoveYaTh0"
            },
            {
                "raw_content": "If they remake Awakening before Genealogy, the entire FE fanbase is going to have a communal crashout over how to feel about this. I think a lot of the modern fanbase has joined the FE fanbase because of awakening but, even those fans have become part of the core fans who have been crying out for Genealogy remake in the time that has passed since then. Awakening came out 13 (THIRTEEN) years ago. Even by the most elitist standards, \"awakening-babies\" are now closer to being a part of the even older hardcore community now. How fucking crazy is that. Me personally? I just want more FE. I'll take anything honestly. I'm a whore for this series",
                "author": "NeroIscariot12"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Super Mairo Bros' second movie title leaks two days before Direct",
        "score": 787,
        "text_content": "It's called \"Super Mario Galaxy\", as per the two domains registered by NBCUniversal on the 10th of September. As such, it's linked to their servers (ns1.nbcuni.com, ns2.nbcuni.com, ns3.nbcuni.com, etc.). The domains in question are SuperMarioGalaxy-LaPelicula.com and supermariogalaxy-lefilm.com Both websites currently redirect to Universal Pictures' homepage (spanish and french, respectively). Sources: https://dns.coffee/domains/supermariogalaxy-lefilm.com https://dns.coffee/domains/supermariogalaxy-lapelicula.com https://who.is/whois/supermariogalaxy-lefilm.com https://who.is/whois/supermariogalaxy-lapelicula.com",
        "comments": [
            {
                "raw_content": "Sure why not Odds of a galaxy 2 port will skyrocket now so I’m good with this",
                "author": "Traditional_Dot_1215"
            },
            {
                "raw_content": "So Old Spice leak was real? Lmao",
                "author": "48johnX"
            },
            {
                "raw_content": "Damn, I was convinced that leak about the title being Super Mario World was real. As a fan, I felt like the logical progression was Bros. > World > Galaxy. Seems like quite a jump.",
                "author": "TheVibratingPants"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ko Takeuchi (artist and designer for Rhythm Heaven/WarioWare) hints at appearance in Nintendo Direct tomorrow",
        "score": 184,
        "text_content": "This tweet was just posted: https://xcancel.com/Kosan_Takeuchi/status/1966282192054792535 You'll notice that it is a response to another tweet he made on March 27, the same day as the March Direct where Rhythm Heaven Groove was announced.",
        "comments": [
            {
                "raw_content": "to be fair, I think an update on Rhythm Heaven Groove was a given for tomorrow anyways",
                "author": "Dextraph"
            },
            {
                "raw_content": "Let’s go, more Groove news",
                "author": "VampireInTheDorms"
            },
            {
                "raw_content": "Makes sense. They haven't talked about the new game since its reveal back in March. So I am expecting a deep dive, release date, and a Switch 2 version to all be confirmed here. Same goes for Tomodachi Life and The Dusk Bloods.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Details on Bungie's Marathon",
        "score": 116,
        "text_content": "[Source](https://thegamepost.com/new-details-bungie-marathon-changed-closed-alpha/) * Proximity chat is in the game. * TTK much faster * They changed the way players death roll out (no more green particles) * Permadeath mecahnic on the Marathon ship map there's tons more info in the report",
        "comments": [
            {
                "raw_content": "lots of good changes but it's disappointing that they're sticking with classes instead of custom characters",
                "author": "GorbigliontheStrong"
            },
            {
                "raw_content": ">no more green particles small but big 🙌",
                "author": "CookieDoughThough"
            },
            {
                "raw_content": "Unfortunately it remains an extraction shooter which is the biggest turn off",
                "author": "Granum22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A 4chan user claims to have found a picture for a \"Nintendo Video\" app while searching for Nintendo Music.",
        "score": 170,
        "text_content": "The link sent the user to an incomplete Google Play page. And he cant find the picture online anymore, but he did download it in time: https://boards.4chan.org/v/thread/720398201 Ofc this is a completely random 4chan \"\"leak\"\" so take it with a grain of salt. But maybe it was uploaded too early and it was supposed to be released with tomorrow's Nintendo Direct?",
        "comments": [
            {
                "raw_content": "Welcome back, Dinosaur Office",
                "author": "EmmettEngarde"
            },
            {
                "raw_content": "Faker than my ass",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "\"It's Mario TIme!\" makes this very doubtful, as does the misaligned text and the choppy shopping around the phone. I'd expect this from a mock-up",
                "author": "LoloTheWarPigeon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fire Emblem: Three Houses may be getting a Deluxe Edition (Switch 2 only) announcement in tomorrow's Direct",
        "score": 340,
        "text_content": "Source1: https://www.youtube.com/watch?v=xowvgv6t_xs Source2: https://xcancel.com/TheSwitchForce/status/1965780601874837648 Nate's Direct prediction video predicts/speculates a \"Deluxe Edition\" (explicitly not branded a Nintendo Switch 2 Edition) of Fire Emblem: Three Houses for Nintendo Switch 2. Not releasing on the original Switch. It could be a simple prediction, but SwitchForce tweeted this yesterday: >Nintendo Direct on a FRIDAY?? Who would’ve ever predicted that?? >That concludes my **Master Class** on leaks. See you all >9.12.25 on my livestream for 60 freakin’ mins of new Switch 2 games😎🥳 Master Class in FETH are the most advanced classes. They could be unrelated, but it may also be a case of Nate speculating something with insight information and SwitchForce doing another hidden tease.",
        "comments": [
            {
                "raw_content": "Another 5 years of Three Houses discourse incoming",
                "author": "LukePS7013"
            },
            {
                "raw_content": "One more thing that might point towards Three Houses getting the P5 Royal treatment: Three Houses still isn't on Nintendo Music despite Engage, Awakening, & Blazing Blade all being all there. Path of Radiance is also MIA, but it'll likely be added once it hits NSO. Also, Nate reiterated in his prediction video (for the third time this year) that the FE4 remake is indeed a thing. So I'm pretty confused by this move if this is indeed happening.",
                "author": "Neoxon193"
            },
            {
                "raw_content": "Another 10 years of Edelgard fans and Dimitri fans fighting babyyyy!!",
                "author": "throwaway184828391"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Mario movie sequel is apparently just called \"Super Mario Bros 2\"",
        "score": 243,
        "text_content": "[Link to sources](https://xcancel.com/Minions_Fanboy/status/1965888314285887926) Apparently, there's microsites for a movie called \"Super Mario Bros 2\" in the Swiss, French, Brazilian and Mexican websites for Universal Pictures. Swiss = [https://www.universalpictures.ch/micro/super-mario-bros-2/preview/show](https://www.universalpictures.ch/micro/super-mario-bros-2/preview/show) French = [https://www.universalpictures.fr/micro/super-mario-bros-2/preview/show](https://www.universalpictures.fr/micro/super-mario-bros-2/preview/show) Brazil = [https://www.universalpics.com.br/micro/super-mario-bros-2/preview/show](https://www.universalpics.com.br/micro/super-mario-bros-2/preview/show) Mexico = [https://www.universalpictures.com.mx/micro/super-mario-bros-2/preview/show](https://www.universalpictures.com.mx/micro/super-mario-bros-2/preview/show) If you try to enter the links, it asks you for a password. If you try replacing the \"/micro/super-mario-bros-2\" with just \"/micro/super-mario-bros\" you get a preview page for the first Mario movie. But you replace it with any other previously rumored titles, like \"super-mario-galaxy\" or \"super-mario-world\", you get the same generic error message that you'd get with any other title (for example, try \"super-mario-nothing\".",
        "comments": [
            {
                "raw_content": "Rosalina bros......we just lost",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "It could be anything",
                "author": "neojgeneisrhehjdjf"
            },
            {
                "raw_content": "Entirely possible we’ll see regional naming, considering we seem to be getting multiple titles “confirmed” with the same methods.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel's 14nm+++ desktop CPUs are making a comeback — chipmaker inexplicably resurrects Comet Lake from five years ago with 'new' Core i5-110",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There must be some industrial/oem customer that wants these, where the MSRP is negotiable. I assume they're not meant for end-users. Certainly not at that asking price.",
                "author": "dajolly"
            },
            {
                "raw_content": "Quo vadis Intel?",
                "author": "Kinexity"
            },
            {
                "raw_content": "Man we still run tons of coffee lake clients and servers 14nm was so stable and straightforward",
                "author": "jhenryscott"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel brings back 14nm \"Comet Lake-S\" CPU as Core i5-110",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why",
                "author": "A_Typicalperson"
            },
            {
                "raw_content": "LGA1200? Wtf?",
                "author": "user74947"
            },
            {
                "raw_content": "It's not even April lol please say sike",
                "author": "a_zoojoo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Xe3 GPUs see up to 18% gains in Linux gaming with new Mesa patches, Cyberpunk and Borderlands 3 with issues",
        "score": 36,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "The Best Value 9070 XT is Back! 16 Card Roundup",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mercury is the best as expected. XFX is insane this generation.",
                "author": "FusionXIII"
            },
            {
                "raw_content": "Is it an upgrade enough from the rtx 3080. The temps on mine are just way too high.",
                "author": "Wolfbudg"
            },
            {
                "raw_content": "Seems like I made a good desicion going with a XFX Mercury OC. Really nice card. When gaming the card is at 60C. Want to undervolt it soon.",
                "author": "iibergazz_94"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Dow tops 46,000, S&P 500 and Nasdaq notch records as CPI, jobs data clears way for Fed cut",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The market is so detached from reality it’s comedy at this point",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "inflation up, let's do rate cuts 😂. Jobs down + Inflation up. Let's do rate cuts. Jobs up, inflation up. Rate cuts are in order. Dollar index down, jobs down, inflation up. Rate cuts. None of this makes sense anymore from a long term stability perspective.",
                "author": "Delicious-Bat2373"
            },
            {
                "raw_content": "The stock market thinks rate cuts are going to save the economy. Next year is when the stock market will be forced to face reality because it will be obvious that rate cuts can't save a debt fueled economy.",
                "author": "socialtrends93"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates hit new 2025 low as jobless claims spike",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 24 hour news cycle is exhausting. Rates have dropped exactly 0.02% from 6.29% on Friday to 6.27% today. The average borrower would save approximately $4 per month with this news. Hardly worthy of a brand new article since we already got news on Friday of a rate drop.",
                "author": "EBITDAddy8888"
            },
            {
                "raw_content": "It dropped 2 points. There are bigger intraday swings. And again, more than half of borrowers will see no change since knocking .05% off for people with 800 credit scores is not going to impact a FTHB with a \"fair\" credit score. But it is still calculated in the \"average\".",
                "author": "Hot_Ambition_6457"
            },
            {
                "raw_content": "I hear auto loans are defaulting at the highest rate and 16 years as well. So much winning",
                "author": "Emotional-Cry9286"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Are at an 11-Month Low. Will That Save This Housing Market?",
        "score": 59,
        "text_content": "[https://archive.ph/95J7u](https://archive.ph/95J7u) Once again, the lamestream media keeps feeding their fetish obession by focusing interest rates, instead of the elephant in the room, which are the the home prices themselves are too high. They make a tiny mention of home prices and carrying costs, but the majority of the article is still obessed with luring in the next generation of bagholders. **Mortgage Rates Drop, But Affordability Still Struggles** * 30-year fixed mortgage rates fell to 6.35%, the lowest since October, driven by expectations of a Federal Reserve rate cut. **Affordability Challenges Persist** * Despite lower rates, home prices remain near record highs, up over 50% since 2019. * Rising property taxes and home insurance costs further strain affordability. * Only 13% of renter households could afford a median-priced home in Q2 2025, down from 17% in 2019. **Economic Headwinds** * A weakening job market is dampening buyer confidence. * Slowing job growth makes buyers hesitant to commit to large purchases. **Buyer Behavior & Market Activity** * Mortgage applications rose 22% year-over-year in early September. * Some buyers are rushing to lock in rates before further drops trigger bidding wars and price hikes. * Builders are offering incentives, including sub-5% mortgage rates, to attract buyers.",
        "comments": [
            {
                "raw_content": "what do you mean by saving the housing market? it’s already at record highs. sure this will probably make it continue higher though but it’s not like it needed saving lol",
                "author": "Chazzyboi69"
            },
            {
                "raw_content": "can we all collectively just keep not buying until it crashes and burns lol ik that’s a pipe dream, there’s always someone willing to cross the line but it’s a cute idea",
                "author": "whoa_thats_edgy"
            },
            {
                "raw_content": "Yeah, mortgage rates went down in Sept 2007, and nothing bad happened after that.",
                "author": "Megalitho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "2025 Data: Nearly Two-Thirds of Boomer Homeowners Have No Plans to Sell",
        "score": 129,
        "text_content": "Roughly [61%](https://cleveroffers.com/research/when-will-boomers-sell-their-homes/?utm_source=reddit&utm_medium=reddit&utm_campaign=boomer_homeownership) of boomer homeowners say they never plan to sell their homes, while just 10% expect to sell in the next five years. That means nearly 90% of boomer-owned homes likely won’t hit the market until at least the 2030s. If that’s the case, what does it mean for affordability and supply in the meantime? Are we looking at a prolonged squeeze, or just a delayed flood of inventory? [https://www.aol.com/finance/housing-market-flashing-warning-signs-184258061.html](https://www.aol.com/finance/housing-market-flashing-warning-signs-184258061.html)",
        "comments": [
            {
                "raw_content": "I don’t think it’s usually much their choice when it’s time to go….",
                "author": "AdmirableWrangler199"
            },
            {
                "raw_content": "Well yeah why would they? But, when they pass away and those homes are given to their kids, I’ll bet 90% of those homes get sold.",
                "author": "mirageofstars"
            },
            {
                "raw_content": "In California, at least, it’s a losing proposition. Prop 13 locks in their property taxes and, assuming they bought a while ago, their refinanced mortgages are long paid off or very manageable at the least. They could choose to move out of state for lower COL but they would have to buy a house, contend with a more progressive property taxes structure, and uproot their lives. Also, they love the fact that their home is worth like 10x what they bought it for. The cool thing is that they also oppose new housing!",
                "author": "SlowSwords"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "So...I just got a letter from State Farm telling me my homeowner's insurance is going up 38%....",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2.9% InFLaTiON",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "And in our area they fight claims and try like hell to deny actual good claims. We call them the “no hands people”.",
                "author": "Trailerwire"
            },
            {
                "raw_content": "average increase was around 15-20% last year and 10% the year before. If you didn’t get big increases they are probably playing catch up. Ours is up around 60% since 2020.",
                "author": "RayWeil"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Rises for a Fourth Month to 2.9% in August",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stagflation 💯",
                "author": "hektor10"
            },
            {
                "raw_content": "Time to raise rates.",
                "author": "jeff8073x"
            },
            {
                "raw_content": "It is over...",
                "author": "gk_instakilogram"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower Mortgage Rates Trim Hundreds Off Monthly Payments, Yet Homebuyers Are Still Cautious",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prices are too high.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "And they have every right to be cautious with how the job market is which shows no signs of improving. Job growth was recently revised down nearly a million.",
                "author": "beardko"
            },
            {
                "raw_content": "The economy may not get better for a long time, and prices and rates may very well keep dropping",
                "author": "supervillaindsgnr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AIO: HOA imposing $27,000 assessment for roof on 700ft townhouse. How do you fight an absurd assessment like this? The house was built in the 70’s in Southern California. No issues with the roof when purchased 2 years ago.",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Futurism.com: \"Exactly Six Months Ago, the CEO of Anthropic Said That in Six Months AI Would Be Writing 90 Percent of Code\"",
        "score": 514,
        "text_content": "> Exactly six months ago, Dario Amodei, the CEO of massive AI company Anthropic, claimed that in half a year, AI would be \"writing 90 percent of code.\" And that was the worst-case scenario; in just three months, he predicted, we could hit a place where \"essentially all\" code is written by AI. >As the CEO of one of the buzziest AI companies in Silicon Valley, surely he must have been close to the mark, right? >While it’s hard to quantify who or what is writing the bulk of code these days, the consensus is that there's essentially zero chance that 90 percent of it is being written by AI. https://futurism.com/six-months-anthropic-coding",
        "comments": [
            {
                "raw_content": "I’m at 100% if i cant use ai i ask some kid with a broccoli haircut to do it instead.",
                "author": "Nulligun"
            },
            {
                "raw_content": ">Dario Amodei, **the CEO of massive AI company Anthropic**, claimed that in half a year, AI would be \"writing 90 percent of code.\" There's obviously a conflict of interest in him making optimistic predictions for AI.",
                "author": "Serious-Cucumber-54"
            },
            {
                "raw_content": "I have a sibling who is an engineer at an automation agency focused SMB clients. He's tied at the hip to Claude & Lovable.",
                "author": "Known_Impression1356"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Post-FDVR Compass",
        "score": 150,
        "text_content": "Heavily inspired by the Post-Singularity Compass that was reposted here like a year ago. The original source for the Post-Singularity compass can be found here: [https://www.deviantart.com/vanga-vangog/art/Post-Singularity-Political-Compass-892642648](https://www.deviantart.com/vanga-vangog/art/Post-Singularity-Political-Compass-892642648) Their art and lore is way better than what I cobbled together here, but I nonetheless tried to bake some of my own 'lore' and self referential tidbits into it. Which category will you fall into when FDVR arrives?",
        "comments": [
            {
                "raw_content": "I'll ask AGI what's best for me",
                "author": "Friendly_Willingness"
            },
            {
                "raw_content": "Adventurer for sure, I just wanna slay some simple monsters, go on quests and have an xp system. Would be lots of fun, but current VR gets like 40% of it.",
                "author": "DragonfruitIll660"
            },
            {
                "raw_content": "This is so good lol, what’s the Great Compromise thing",
                "author": "MassiveWasabi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedance 4.0 is so impressive and scary at the same time... (all these images are not real and don't exist btw)",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "mfw social media was created to feed the machine god",
                "author": "Intelligent_Tour826"
            },
            {
                "raw_content": "Yeah..and people still think universe is real in 2025.. /j",
                "author": "Long_comment_san"
            },
            {
                "raw_content": "The worst part of new model releases is the \"organic\" advertising after",
                "author": "eposnix"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "My opinion on GPT 5 has completely changed",
        "score": 102,
        "text_content": "Being able to use GPT 5 Thinking for everything is amazing. The fact that this is the standard of intelligence I now expect from my cell phone/laptop is ridiculous. Everything I want to do, it can help. Most of the time, me + gpt > me alone. The limit increase + memory + operator integration to search web well is just a phenomenal user experience. I slept on GPT 5 because the benchmarks were lacking, but my experience with it has been anything but. Professionally, personally, everything. - it almost always adds value, sometimes tremendous value, when I put thought into my prompt. I know a lot of people here were disappointed initially. Has your opinion changed since you’ve had a chance to use it? It feels less like the leap accelerationists were hoping for, and more like the steady progress observed by Kurzweil.",
        "comments": [
            {
                "raw_content": "It's been really good the last few weeks for me too. Been getting some cool stuff done, outsourcing researching to it and actually being able to trust it a little more has been great. The lack of hallucinations is a game changer.",
                "author": "KalElReturns89"
            },
            {
                "raw_content": "5thinking definitely works well, at least for search and research tasks",
                "author": "lawyers_guns_nomoney"
            },
            {
                "raw_content": "I also think there is a big difference between 4o and 5 Thinking. It’s not only good, but 5 Thinking is something huge. I really feel the difference. It’s a very clear improvement for me, and I can notice it very clearly because I’ve always used ChatGPT for complex tasks as I work in legal affairs, and I’ve never felt anything like this with 4o or other models. 5 Thinking is another thing, in my opinion.",
                "author": "Busy_Activity775"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "US energy chief tells BBC nuclear fusion will soon power the world",
        "score": 93,
        "text_content": "Source: [https://www.bbc.com/news/articles/cqlz5p314z0o](https://www.bbc.com/news/articles/cqlz5p314z0o) >Don't worry too much about planet-warming emissions, the US Energy Secretary has told the BBC, because within five years AI will have enabled the harnessing of nuclear fusion – the energy that powers the sun and stars. >Chris Wright told me in an interview that he expected the technology to deliver power to electricity grids around the world within eight to 15 years and that it would rapidly become a big driver of greenhouse gas reductions. ... \"With artificial intelligence and what's going on at the national labs and private companies in the United States, we will have that approach about how to harness fusion energy multiple ways within the next five years,\" said Mr Wright. \"The technology, it'll be on the electric grid, you know, in eight to 15 years.\"",
        "comments": [
            {
                "raw_content": "At any given time 1700+ terawatts of power hit the Earth from the giant fusion reactor that is the Sun. It already powers the world.....humanity produces / used ....20.",
                "author": "meow2042"
            },
            {
                "raw_content": "0\\_0 We're not even close to this tech being usable. It'll be 10 years before we make basic fusion work, then another 10 before the first power plants are finished.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "\"On November 16, 2024, President-elect Donald Trump announced his nomination of Wright to serve as U.S. Secretary of Energy\" So basically another hack that has no idea what he's talking about.",
                "author": "samuelazers"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Turned the sketches from our interior designer into renders in seconds. Thanks AI!",
        "score": 159,
        "text_content": "Prompt: Transform this architectural sketch of a modern living room and kitchen into a hyperrealistic photograph. Render floor-to-ceiling windows with sheer beige curtains, filling the space with soft afternoon daylight. Highlight the taupe L-shaped sectional sofa in a dark green modern colour, with textured cushions, resting on a plush ivory rug and a glass coffee table with a wooden base. Recreate the medium dark wood flooring, walnut panels, and wall cabinetry with realistic wood grain details. Show the built-in kitchen with marble backlit backsplash and countertops, integrated silver appliances, and a central dining table with a striking black floral arrangement. Include metallic pendant lights, a minimalistic ceiling fixture, and a potted green plant against the wood-paneled wall. Ensure all surfaces—wood, marble, glass, and metal—display natural textures and lighting reflections for photographic realism. The atmosphere should evoke luxury and tranquility, in a Scandinavian-meets-contemporary style in a warm afternoon to sunset cozy lighting. Make it contrasts enough in colors, so its not all bland beige.",
        "comments": [
            {
                "raw_content": "Those look great, it did delete the tap in picture 6 though",
                "author": "NoSignificance152"
            },
            {
                "raw_content": "those sketches were 3D renders. The AI rendering does look fantastic though. Looks comparable to Arnold or Vray renders (those are the two I remember from back when I was into architectural rendering software years ago).",
                "author": "GrapheneBreakthrough"
            },
            {
                "raw_content": "Welp, cross out another industry lol",
                "author": "o5mfiHTNsH748KVq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI, Nvidia Preparing to Spend Billions Expanding UK AI Facilities",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm worried. In UK, housing prices are through the roof. This may skyrocket electricity bills on top of it.",
                "author": "Glxblt76"
            },
            {
                "raw_content": "*Any* country should ensure that their data is sovereign. Default position should be that no data may leave the borders—and don’t always trust government to enforce *regulations*, put it in law with teeth. Entities such as EU could have *some* cross border movement but should have robust protections (EU doesn’t have best track record on this though). Sure let US companies come in to *run* the data centers, but the operations should be controlled by locals. Some sensitive data should never be controlled by companies with foreign ownership. But also ensure citizens have control over their own data.",
                "author": "OysterPickleSandwich"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Autonomous Agent that completed Terry Tao's Strong Prime number formalization project in just 3 weeks.",
        "score": 16,
        "text_content": "https://preview.redd.it/ccqsfedxjoof1.png?width=664&format=png&auto=webp&s=c14be5996a840ff326cc8d00d1f5f5a3c4d4c6e8 \"Our results represent the first steps towards formalization at an unprecedented scale. Gauss will soon dramatically compress the time to complete massive initiatives. With further algorithmic improvements, we aim to increase the sum total of formal code by 2-3 orders of magnitude in the coming 12 months. This will serve as the training ground for a [new paradigm](https://www.math.inc/vision) — verified superintelligence and the machine polymaths that will power it.\" - [https://www.math.inc/gauss](https://www.math.inc/gauss) .",
        "comments": [
            {
                "raw_content": "Added to the ASI checklist. It is unclear which model is being leveraged. [https://lifearchitect.ai/asi/](https://lifearchitect.ai/asi/)",
                "author": "adt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Albania appoints world’s first AI-made minister",
        "score": 218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A new tactic to conceal corruption will be to present A.I as a \"non-biased\" decider of things. The same A.I trained to be sycophantic, trained on certain sub-sets of data, etc.",
                "author": "LiesToldbySociety"
            },
            {
                "raw_content": "Lived long enough that I'm starting to see headlines from William Gibson novels.",
                "author": "mjk1093"
            },
            {
                "raw_content": "This is the flashback headline to how Albania surges to unexpected world domination",
                "author": "BrilliantNo2049"
            }
        ],
        "subreddit": "singularity"
    }
]