[
    {
        "post_name": "Sedition",
        "score": 953,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd like to know who funded and coordinated this Sedious Six video. Conspiracy Charges also need filed. Shit do RICO while you're at it",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "not gonna blame Trump because he just reposted it but holy shit it’s “MARTIAL” as in Court Martial or Martial Law",
                "author": "NADSAQ"
            },
            {
                "raw_content": "The seditious six are supposedly not stupid and should be held accountable for their words. They have speech writers and folks that help them with their statements so they absolutely knew what they were saying was ambiguous and would reduce military effectiveness. This alone is treason when a person in authority through his actions, words and or deeds reduces military readiness. In this particular case I think a case could be made that they were issuing orders countermanding the President. They MUST go to court martial. I do not see what is the hold up...just do it!!!!!",
                "author": "MonolitoVeritas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You are sheltering Pakistan and India accounts with “South Asia” are you not?",
        "score": 663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's like how when they say \"Teens\" in the media or \"Youths\" you know exactly who they mean and don't mean.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"Sarr! I am American Yankee Doodle Boy, Sarr! Please to be voting for de Democrats and de RINOs Sarr!\"",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "We are against a people so lazy that they outsource their propaganda.",
                "author": "OnceADroplet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I Support The Idea Of Barring Foreign-Born Citizens From Running For Office",
        "score": 793,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, but only because of what they are doing.",
                "author": "1inchgroup"
            },
            {
                "raw_content": "Why is this only a rule for the President? Also, same question about term limits.",
                "author": "danneskjold"
            },
            {
                "raw_content": "Can’t run as foreign born if you aren’t in the country at all. Get them all out. ::taps forehead::",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "These foreign accounts aren’t just popping in to comment. They’re jumping into political conversations, stirring people up, and shaping arguments that look organic when they’re not. Voters should know when the loudest voices in their feed aren’t even in this country.",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm confused why this surprises people. Imagine if this policy was applied to reddit.",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "100% chance that's not just happening on X, but pretty much everywhere else including here.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "It has infuriated me for years that Americans don't seem to detect that they're talking to foreigners posing as Americans. There are always language tells or cultural tells. In some cases they do have armies of their own bots engaging with them too, but some are clueless Americans. It feels like covid hypnotism all over again.",
                "author": "Pede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Elon Musk after opening locations on 𝕏 🤣",
        "score": 996,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish i could take 1000 likes!",
                "author": "coverage2020"
            },
            {
                "raw_content": "I love Elon even when the bromance broke up betwen him and Trump in my heart I knew he would come back around",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "If that was the Taj Mahal burning, I'd name you memelord of the year.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Modern problems require modern solutions",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excellent defense weapon against rape Can we air drop this across the Middle East?",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Works for two tribes",
                "author": "halberstram24"
            },
            {
                "raw_content": "hot bacon grease works much better",
                "author": "Raetchel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rican DEI Judge Who Let Psychotic Career Criminal Free to Set Innocent Woman on Fire Brags on Camera about Her Racial Favoritism in Court",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should be impeached immediately.",
                "author": "Roadpower"
            },
            {
                "raw_content": "All non Whites are putting their race first, only Whites are stupid enough to buy into the diversity bullshit, non Whites don't belong in the US.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "Fucking boomers have let these people run riot. All because they were afraid of being called racist. Now it’s been normalized and millennials and gen z are going to either be the adults in the nation or give up the country. Boomer cons lost the civil rights debate and instead of doubling down on it, they capitulated all moral authority to the left and spent the last 6 decades dodging any association with it. Despite all the demonstrable evidence it has been a disaster. They’ve internalized this loss so completely they can’t even think of rebelling outside of the liberal moral framework on race and religion.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "To prevent skyrocketing electric bills, every state has to follow the Texas example: each data center must have its own \"behind the meter\" onsite power generation. “We believe data centers should pay for the full cost of their power,” Dominion Energy spokesperson Aaron Ruby said in an email.",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m not gonna lie. This is partly why I support continued AI development and research. The building of AI data centers has indirectly caused a the proliferation of nuclear power plants. My hope is that the AI craze leads to the building of more nuclear power.",
                "author": "aaafirefly123"
            },
            {
                "raw_content": "Of course they should pay for their own shit. No brainer. Why is this even up for discussion?",
                "author": "supertootsday"
            },
            {
                "raw_content": "While tackling their energy consumption is a great start, AI/Data Centers are currently causing component parts to skyrocket in price for consumers. Anyone trying to buy RAM for anything next year is going to be in for a sticker shock.",
                "author": "Cuntgoblin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: Trump to Designate Muslim Brotherhood as a Foreign Terrorist Organization",
        "score": 1094,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has that not been done already?",
                "author": "TeaPartier_1776"
            },
            {
                "raw_content": "How about just Muslims in general?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "For real this time? Hasn't this been going on for months?",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The State of X",
        "score": 1391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Saar, plz engage.",
                "author": "x79q3pb"
            },
            {
                "raw_content": "DO NOT REDEEM",
                "author": "jsmith81"
            },
            {
                "raw_content": "# Street Shitler",
                "author": "Bigly-Wrong"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "INFINITE SHOCK: Cracker Barrel Marketing 'Expert' Resigns From Board After Failed Rebrand",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Proud Tennesseean here. We are **VERY** happy about this. This restaurant is a staple in our state. Now that Bob Evans is pretty much gone except in FL, this is the one chain my family has stayed with. P.S. Been going to \"Crackass Barrel\" all of our lives, get the Roast Beef, it's delicious.",
                "author": "Patriot6TN"
            },
            {
                "raw_content": "Resigned. Not fired. Resigned. And the woke CEO remains. The safety net for corporate leftists is made of titanium.",
                "author": "seeling0"
            },
            {
                "raw_content": "Dumb asses learned nothing from \"New Coke\"",
                "author": "LibsRcrazy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals in California are reportedly lining up at Home Depot to buy a single 17-cent scraper, return it, then repeat the process in an effort to slow sales and protest the store’s cooperation with ICE operations.",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you ever doubt that your life has amounted to anything, watch this video for clarity.",
                "author": "julianReyes"
            },
            {
                "raw_content": "Every one of them can be kicked out",
                "author": "FearGodTheAlmighty"
            },
            {
                "raw_content": "Imagine having so little to do with your day.",
                "author": "CorkyKnightrider"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just posted a series of Q inspired memes on Truth Social: “Nothing can stop what is coming”",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Trump promised Death To The Deep State. I believe in him. I believe he will achieve this goal.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "I’m realistic. I appreciate everything Trump has done and is trying to do but I’m all ‘Two Weeks’ed out. What’s coming is already here, this is it. We’re living through it.",
                "author": "McShoty96"
            },
            {
                "raw_content": "President Trump is telling us what will come next. People keep underestimating how nimble and fast of a navigator he is. When President Trump tells the American people you need to be an entrepreneur with your healthcare it means he wants to give you agency and control in picking your healthcare plan.",
                "author": "GA_Logic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If this would also allow the Radical Left Networks to “enlarge,” I would not be happy. ABC & NBC, in particular, are a disaster - A VIRTUAL ARM OF THE DEMOCRAT PARTY.",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who the hell even watches TV anymore?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Trump can fire the person pushing this.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "Democrats win, Republicans lose, what's new?",
                "author": "rtav"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I know it was an order but I think we should all think about this before we attack?",
        "score": 582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remember the name Alvin Holsey, Navy admiral in charge of SOUTHCOM. Reportedly he resigned last month (but effective on December 12) because he was pitching a fit about striking drug boats. Almost certainly an Obama DEI hire that needs his office and home raided.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Automatically begs the question “What order was given in the moment prior to the statement?” 🙄",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "These seditious congress people need to go through a military court martial and let a military court decide. These seditious congress people are supposedly not stupid and should be held accountable for their words. They have speech writers and folks that help them with their statements so they absolutely knew what they were saying was ambiguous and would reduce military effectiveness. This alone is treason when a person in authority through his actions and words reduces military readiness. They must go to court martial. I do not see what is hold up...just do it!!!!!",
                "author": "MonolitoVeritas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the law @realDonaldTrump is looking for:",
        "score": 1555,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send it to Barrbie and Hegseth",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "If you want charges to stick, as applicable, try people under the UCMJ rather than in civilian courts so you don’t have an Obama/Biden judge to fuck things up",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "So... enforce it.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Inside Sedition",
        "score": 1105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I see 6 TRAITORS .",
                "author": "Bramage"
            },
            {
                "raw_content": "they're always ugly on the inside. most times it bleeds right out.",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "I fucking hate that spook Slotkin, you know damn well there's no such thing as ex-CIA",
                "author": "Mayhem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Truth!",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So we've been promised for nearly a year...rolling eyes.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "Fucking boomer shit. Do something other than post this lame shit boss, getting tired of shitposting but not getting anything done.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "What justice since he’s been in office for five years overall has been enacted every person who sold out our country and made millions is living the good life. The only people that have paid the price are the voters",
                "author": "Doubleu1992"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How to do a color revolution. Check out step six",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Dems definitely did some of this during 2020, and 2024 even",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "So are the democrat senators going to be charged with treason or what?",
                "author": "SupFrens"
            },
            {
                "raw_content": "JD Vance touched the wall. There's nothing revolutionary about him.",
                "author": "Orlando_Doom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk’s DOGE team was quietly dissolved even though it still had eight months left on its mandate to cut excessive regulations and federal spending. Rep. Tim Burchett says Musk was pushed out of Washington because he was getting too close to exposing corrupt officials enriching themselves",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Regardless of Elon's role, the fact the DOGE is gone tells us a lot about the state if American and the support that MAGA really has in the White House and the capitol building.",
                "author": "Datamancer"
            },
            {
                "raw_content": "DOGE would eventually expose too many crimes so the DC Crue had to shut it down. Same system, nothing’s changing.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "As planned by Elon. https://patriots.win/p/1ARcz5dMpB/because-people-keep-posting-abou/c",
                "author": "_Liberty_Prime_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Igor's Lab] Thermal paste database version 3.0 - More accurate and practical data, a technology upgrade and well over 100 tested pastes | igor´sLAB",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Igor's sitting on piles of pictures of his testing apparatus and CPUs/GPUs, and the man makes the conscious decision to generate and include the most [atrocious](https://www.igorslab.de/wp-content/uploads/2025/11/Outro.jpg) worthless [slop](https://www.igorslab.de/wp-content/uploads/2025/11/Teaser-3.jpg). Why does he feel the need to do this?",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "It might be a bit of a hot take but after using PTM, I'm convinced that thermal pastes are now obsolete for direct die applications. PTM pads may not be significantly better than premium pastes in terms of edge temperatures, but they truly shine when it comes to hotspot. In my case, my temperature delta shrank from 15c to around 6-7c compared to X45 from ID-Coolimg which performs more or less on par with Kryonaut Extreme, for reference. I still wouldn't apply PTM on a CPU IHS however, but that's mostly because of cost. Both AM4 and AM5 CPUs are roughly 40x40 millimeter which equates to 1,600 sq-mm or over twice the surface area of an RTX5090. Very expensive! So, I instead bought a 4g tube of aforementioned X45 for cheap which will probably allow around half a dozen CPU repastes and the performance is quite fantastic, considering the price.",
                "author": "GenZia"
            },
            {
                "raw_content": "Are they planning to test any pastes from Alphacool too?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese CXMT to produce DDR5-8000 and LPDDR5X-10667 memory - VideoCardz.com",
        "score": 273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, some competition is needed. Even if it's blocked in the US, it'll provide supply relief and break the DRAM cartel",
                "author": "dfv157"
            },
            {
                "raw_content": "Good, flood the market with cheap DDR5 ram, we desperately need it.",
                "author": "caribbean_caramel"
            },
            {
                "raw_content": "Will be interested to see their die latencies when running at the speeds Zen 5 can use. It'd be nice to have an alternate to Hynix.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Plans 200K 1c DRAM Wafers/Month by 2026, About One-Third of Its Total Output",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is missing from the article title is that this is an increase in their output by roughly 1/3rd.",
                "author": "Death2RNGesus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Foundry to Boost 2nm Production Capacity 163% by 2026 to Challenge TSMC",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And who is going to afford the Memory capacity to be paired with? Especially Sam Altman gave a blank check to hoard Memory capacity?",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Last I heard, it wasn’t the size that was samsung’s problem, it was the yield. They can’t produce the GPU chips with acceptable yield numbers like TSMC can - the implication was that TSMC is getting like 90%+ and Samsung can only get 50-60%.",
                "author": "xiaodown"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS RTX 5090 Matrix – The World’s Fastest Gaming GPU for $4000 | der8auer",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it looks like a USB recovery drive they would send you when that was all new and you needed something besides a disc",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "TL;DW : **bigger** price, **bigger** power consumption, **small** performance gains",
                "author": "krumpfwylg"
            },
            {
                "raw_content": "Funny that it's VBIOS works on all cards but ASUS ones (and MSI Liquid) overclock forums are quite sad by that [https://www.overclock.net/threads/official-nvidia-rtx-5090-owners-club.1814246](https://www.overclock.net/threads/official-nvidia-rtx-5090-owners-club.1814246) (including me)",
                "author": "panchovix"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve Will Set Steam Machine Price Like a Regular Gaming PC",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much longer is this going to get reposted across the site?",
                "author": "Far-Reputation-1391"
            },
            {
                "raw_content": "I'm getting rather tired of seeing the exact same headline every day for the last week since Linus (LTT) made one throwaway statement. Valve knows from the SteamMachine Gen1 failure & the SteamDeck success that price is king. There is no feasible way that they will be able to sell well at a base price that isn't tethered in some way to the 2020 consoles. That's why they chose 2-3 gen old components that are literally a budget entry-level gaming laptop. An RX7600M laptop GPU with 8GB isn't going to break the bank, either way they have to know that more than a PS5/XSX will be devastating. If RAM pushes it up, the other consoles will also have to move up giving Valve more room for price parity. Either way, these articles are nothing but egregious speculation presented as fact, until Valve actually announces a price, the SteamMachine (2026) doesn't have a price.",
                "author": "Jimbuscus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How many hours do you have in hyruke warriors age of imprisonment ?",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is it for a 8 year old ? Too hard ?",
                "author": "Far_Negotiation8009"
            },
            {
                "raw_content": "Just over 30 and I finally went ahead and did the final mission. It's fun and is everything I wished AoC was, but the 100% grind is too much plus I got Kirby now which is incredible",
                "author": "jasonjumps"
            },
            {
                "raw_content": "How do y'all got so much free time lol",
                "author": "poopoo0989"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: Target's Black Friday deals include digital copies on the website. Some are better than Nintendo's.",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amazon has Echoes of Wisdom physical for $30 but the sales announcement said it would be $40",
                "author": "_lemon_hope"
            },
            {
                "raw_content": "Amazon has the Nintendo digitals for $40. Nice PSA! Wish I’d checked here first before I pulled the trigger!",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "Paper Mario also $30 on target digital! Nice!",
                "author": "KevinLongtime"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My favorite part of DK Bananza is these intricately designed hide and seek challenges that I don’t think a single person played like hide and seek.",
        "score": 412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you have an elephant Bananza, all the tasks eventually begin looking like \"hold R2\"...",
                "author": "AreYouOKAni"
            },
            {
                "raw_content": "At the beginning it was really easy to find them but in the late game I was destroying absolutly everything and there was no trace of them!",
                "author": "Alternative-Cut-3567"
            },
            {
                "raw_content": "Look, Bananza gave me a hammer and a world made of nails, I was never going to be precise.",
                "author": "buttsecks42069"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo’s Black Friday Sale (through retailers) is now live",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A humble PSA for anyone who hasn't ever played Thousand Year Door: buy it, play it, love it. It's one of the best RPGs Nintendo has ever made. Show it the love it deserves so we have a chance of getting another one ❤️",
                "author": "kaydeejay1995"
            },
            {
                "raw_content": "Grabbed Echoes of Wisdom and DKCR from Target, they had them at $30 instead of $40. Pretty excited for Zelda, I heard it runs great on Switch 2.",
                "author": "blueberrypizza"
            },
            {
                "raw_content": "Is Princess Peach showtime fun for $30? I’ve been contemplating it as something I can just play and not take seriously and $30 seems good.",
                "author": "Richdav1d"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby air riders 4 players performance?",
        "score": 28,
        "text_content": "There is 0 footage of split screen gameplay on youtube And I'm wondering is 4 players split screen 60fps? Or is it like every other racing game",
        "comments": [
            {
                "raw_content": "Maintains 60 even in four player split screen. There is however no online split screen which is important to know",
                "author": "WimpBeforeAnchorArms"
            },
            {
                "raw_content": "I've been playing 3 player and it seems fine, but I also barely notice framerate unless it's really bad.",
                "author": "Altruistic-Match6623"
            },
            {
                "raw_content": "Kirby air riders 3 didn’t even come out yet",
                "author": "Conversation_Dapper"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Getting a ton of \"communication errors\" in Kirby Air Riders",
        "score": 10,
        "text_content": "I swear it's like 1 out of 5 games in city trial and then it kicks me out. It's super annoying. I don't play a lot of Switch games online, is this a normal thing? I know my wi-fi is good, and in the online options it confirms that my connexion should be strong. I really enjoy this game, but this is really starting to bum me out :/",
        "comments": [
            {
                "raw_content": "I haven’t had this happen to me once while playing air riders this weekend. Actually pretty surprised by how reliable the multiplayer has been. It does take up to a minute for a match though.",
                "author": "Banks201"
            },
            {
                "raw_content": "Been playing, too much probably, since launch and only had a single crash.",
                "author": "Senior_Flatworm3010"
            },
            {
                "raw_content": "I think if someone else is lagging, DCs, etc. it affects you as well sadly. I know I've had moments where someone DCing affects the whole lobby so something they can't fix other than more preventative measures.",
                "author": "IgIoos"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"Next gen\" 2.5D Platformers",
        "score": 29,
        "text_content": "Playing the DKB classic courses that appear in between the regular levels made me realize how pretty and cool those are and how amazing it would be to get a standalone DK game like that. Just completely 2.5D levels. As well as other games made like that by utilizing full 3D but set as 2.5D platformers or Metrovania games. I would love to see some classic 2D NES or Super-NES games remastered as fancy next gen 2.5D Switch 2 versions utilizing the 3D engine. For example Castlevania, Kid Icarus, Donkey Kong, but also new franchises and IP's.",
        "comments": [
            {
                "raw_content": "You're somehow managing to describe Donkey Kong Country Returns / Tropical Freeze without acknowledging their existence.",
                "author": "wewewi"
            },
            {
                "raw_content": "Have you played Donkey Kong Country Returns or Tropical Freeze? Or Metroid Dread? Those sound exactly like what you're looking for.",
                "author": "AxLD"
            },
            {
                "raw_content": "Tbh DKC TF was much more beautiful and better designed than the little bonus nostalgia levels. I mean of course..but yeah. I think Nintendo stated already that they will probably produce new DK games in the future, 2D and 3D. I think it was in one of the ask the developer videos that they did in the beginning of the switch 2. I'm super interested in a 2D DK game on the switch 2.",
                "author": "pokemon_vgc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Age of Imprisonment Modes",
        "score": 13,
        "text_content": "I didn't find information about this anywhere The only musou game I've ever played was one of the Dynasty Warriors games and It had kinda like a arcade mode where you could select a hero and a map and play a \"match\". I think the original Hyrule Warriors was like that as well Does Age of Imprisonment has any of that or it's just the story mode? How does the story function? Do you play level by level or there is a map to select Battle and so forth? Thanks in advance for those that respond",
        "comments": [
            {
                "raw_content": "Age of Imprisonment along with Calamity don’t have an Arcade mode per se. But what they do have is a shit ton of side missions and shit that is strictly Arcade based objectives. Drop in, do the mission, repeat. Zero story. You still have to play the main missions to unlock them. The latest warrior games are more grounded and not as fan servicey as the original Hyrule Warriors as they are trying to tell a plot that fits with in the main Zelda narrative.",
                "author": "TekDoug"
            },
            {
                "raw_content": "It doesnt have a sepearte mode like the original hyrule warriors but after every story mission you unlock a bunch of side missions that you can play with any of your unlocked characters.",
                "author": "KingsNationn"
            },
            {
                "raw_content": "No separate mode but you can replay missions and for many of them you can choose what characters to play with. Theres also a ton of side quests and such and more that unlock after beating the main story",
                "author": "eyebrowless32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Chinese journalist says From software's duskblood spent the longest time on gameplay prototyping containing many innovative elements, greenlit before 2019",
        "score": 186,
        "text_content": "[https://youtu.be/\\_lHUBWlGTgY?si=yYKN\\_htivU5wg4OT](https://youtu.be/_lHUBWlGTgY?si=yYKN_htivU5wg4OT) (watch at 2:40)",
        "comments": [
            {
                "raw_content": "All im saying, better be 60fps for it being a former switch game.",
                "author": "chocoponcho_"
            },
            {
                "raw_content": "I'm not super big on the push for making Night Reign and The Duskbloods multiplayer-only, but it is cool to see FromSoft experimenting. The Recluse's spin on the old magic system is something I would love to see reused in another game, just to use one example. Even if I don't get much out of these games on their own, I'm glad they exist because it will make FS's next Dark Souls/Elden Ring kind of game that much better.",
                "author": "Yarzeda2024"
            },
            {
                "raw_content": "I will be there day 1",
                "author": "OwnAHole"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Exodus will be at The Game Awards",
        "score": 248,
        "text_content": "Haven't seen this posted here so sorry if I just missed it and it's old news. But during Hasbro's Q3 earnings call, they confirmed that Exodus was going to be shown at The Game Awards and that the game was roughly around a year away. Transcript in the link below; https://www.investing.com/news/transcripts/earnings-call-transcript-hasbro-beats-q3-2025-expectations-amid-stock-dip-93CH-4305236",
        "comments": [
            {
                "raw_content": "It's strange how they handled all the marketing for this game; every week they released lore about the game, announced Matthew McConaughey would be part of it, the secret level episode, and then Radio Silence. It's also curious that this is the only spiritual successor to Mass Effect that survived.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "im assuming Fall 2026?? Also all the release dates announced gonna hit like crack",
                "author": "ZEKE307"
            },
            {
                "raw_content": "I went on a bit of a rabbit hole for this a while ago. Some of the lore is hilariously on the nose, like this is a line from the timeline on the official site: >As the unchallenged power in Centauri, the Elohim usher in 5,000 years of peace and prosperity. They establish unbreakable Laws, [etc] That said, somewhat dodgy naming decisions aside I do think the concept of the game world seems pretty cool. And I can't hate a new series that is releasing multiple books in the run up to the release of the game, that is the sort of boldness I really respect.",
                "author": "Stuglle"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Invincible VS Closed Alpha Test accidentally leaks an unrevealed character in the files through a model swap bug",
        "score": 215,
        "text_content": "The character is >![Anissa](https://imgur.com/gallery/bada-bing-VLST6Nh)!<",
        "comments": [
            {
                "raw_content": "Her intros with Invincible and Omni-man are going to be awkward.",
                "author": "torru369"
            },
            {
                "raw_content": "This game has so many viltrumites, needs more fun weird characters like Allen or Shapesmith",
                "author": "SweenYo"
            },
            {
                "raw_content": "Oh boy",
                "author": "PfeiferWolf"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve confirms Steam Machine \"won’t be subsidized\"",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense for something that is just a computer. For the Steam Deck it makes sense to subsidize, as Steam OS is the only logical choice for it, with Microsoft just now catching up (how well that goes remains to be seen) and the input devices make that its main use is as a handheld. But with that $600 or above seems more likely than below",
                "author": "Krt3k-Offline"
            },
            {
                "raw_content": "~$850, 8GB RAM is going to be a tough sell. Not the revolution that will make console obsoletes as we were reading recently.",
                "author": "Quentin-Code"
            },
            {
                "raw_content": "its gonna be a hard sell since its just gonna be as powerful as the current gen consoles if vavle wont put it at $400 - $500 price tag.",
                "author": "Xtremiz314"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My first all AMD gaming PC",
        "score": 228,
        "text_content": "Specs: * Ryzen 5 9600X * Sapphire Nitro+ Radeon RX 9060 XT 16 GB * MSI B650 Gaming Plus Wifi * Arctic Freezer 36 A-RGB * Kingston Fury Beast DDR5 RGB CL30 16GB x 2 * Western Digital SN5000 1TB SSD * Western Digital Blue 7200 RPM 2TB HDD * Cooler Master MWE Bronze 650W V3 ATX 3.1 Power Supply * DeepCool CG530 4F + 3 additional DeepCool reverse blade ARGB fans * Acer VG240YS 1080p 165Hz monitor * AEON Gaming Striker keyboard * Logitech G203 Lightsync mouse Coming from i5 4th gen -> i5 6th gen, Radeon HD 7770 -> GTX 1050 Ti (later upgraded to 1060 6gb) to this PC feels soo good. Both my previous PCs were handed down to me by my cousin. Handed down my 1060 to a friend. Now I'm set for at least another 7-8 years.",
        "comments": [
            {
                "raw_content": "The aesthetics of your setup is impressive, congratulations",
                "author": "Zestyclose-Leg-1911"
            },
            {
                "raw_content": "I've used a full amd from 2013 up to 2021 and switched to the rtx then and then back to full amd a year ago, and to be honest, saved a lot of money, and been able to play almost anything on 4k ultra with more than 100 fps on a 144hz tv, also back in the 2010s, I was able to ultra most games on an even humbler amd card, and didnt have driver problems at all, to be honest, never looked back. I think people are more prone to nvidia/intel a lot due to marketing as well, not saying it's better or worse, just saying, it's not a competition if you can run everything well for a much lower price",
                "author": "SignificanceGood328"
            },
            {
                "raw_content": "Nice. How Id do it.",
                "author": "budice0"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Glibc Math Code Sees 4x Improvement On AMD Zen By Changing FMA Implementation",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yay! Wait, why was it so bad before? :O",
                "author": "Dunmordre"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI expands AMD 800 series MAX series lineup, \"Zen6 ready\" motherboard lineup",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My 2 year old AM5 motherboard is also technically Zen6 ready.",
                "author": "According_Loss_1768"
            },
            {
                "raw_content": "So glad the neon green accents are gone!",
                "author": "clumsyfork"
            },
            {
                "raw_content": "When are the 900 series boards coming out?",
                "author": "mkdew"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Zillow upgraded its national home price outlook slightly—predicting that over the next 12 months U.S. home prices are likely to rise 1.5%.",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Upgraded\"",
                "author": "Alone_Step_6304"
            },
            {
                "raw_content": "It just seems like they're tracking inflation more than anything else. If anything, the fact that the pace of nominal growth isn't keeping up with inflation means home prices are actually in decline relative to inflation. And you can see that in the [inflation-adjusted Case-Shiller index](https://www.longtermtrends.net/home-price-vs-inflation/)",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "What would home prices be if zillow didnt exist?",
                "author": "Title-Upstairs"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s Housing Crisis, in One Chart - The New York Times",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Non-paywall version. https://archive.is/dTHdU",
                "author": "Brknwtch"
            },
            {
                "raw_content": "I no longer have a NYT subscription. Anybody willing to summarize the article/conclusions in a couple of sentences?",
                "author": "RiverGroover"
            },
            {
                "raw_content": "Come on people. If you are going to link to a paywall at least summarize the content.",
                "author": "FrostyAnalysis554"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Total pending home sales reach multiyear high with mortgage rates near 6%",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Numbers have been essentially identical since 2023. Redfin has pending sales down .8% yoy despite the increased inventory and lower rates. https://www.redfin.com/news/data-center/",
                "author": "sifl1202"
            },
            {
                "raw_content": "Multi 1 year highs over a 2 year period. WOW! I must fomo",
                "author": "Safe_Measurement_312"
            },
            {
                "raw_content": "Get in now before it’s TOO LATE!! I’m a realtor and I’ll sell your house above asking!! Limited stock, buy now! Please call me at 855-555-5555",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Had Nano Banana recreate iconic panels from Vagabond Manga",
        "score": 486,
        "text_content": "Saw the Mario post where it took some liberties with the 3d render, and used more modern designs. So I decided to have it recreate these old Manga panels, to see if it preserves the vibe.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hwrctun3033g1.jpeg?width=3195&format=pjpg&auto=webp&s=c235c21b9fcface62e8fc7aaf45f9b91c74ba998",
                "author": "Gaiden206"
            },
            {
                "raw_content": "Nice! Do Berserk next! ...... on second thought, maybe not such a good idea.",
                "author": "ACrimeSoClassic"
            },
            {
                "raw_content": "https://preview.redd.it/8he43tgym33g1.png?width=2912&format=png&auto=webp&s=c571e7e58a8ac43dae374aaf8b0309e7ad305c77",
                "author": "tyrerk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"A photo of an astronaut riding a horse\" - Three years apart",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/4iwep2i0n53g1.jpeg?width=2048&format=pjpg&auto=webp&s=e8ba7a9b730ae6a85ac678073019d415ca6cbc33 This is the true benchmark",
                "author": "RayHell666"
            },
            {
                "raw_content": "For the curious, DALL-E 2 on the left (April, 2022) and Nano-Banana Pro on the right (November, 2025).",
                "author": "jeffkeeg"
            },
            {
                "raw_content": "Dalle was the first model which I thought could actually understand the world. No improvement of image quality afterwards will ever be close to that feeling.",
                "author": "Minipiman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini's Nano Banana Pro creates images indistinguishable from real ones",
        "score": 211,
        "text_content": "Google recently released their SOTA AI-Image generation model Nano Banana Pro 🍌, and it has blown me away. The quality and consistency is unparalleled. I created a simple game where you identify whether an image is created by a human or the model. The average accuracy is \\~55%, slightly better than random chance. Try it for yourself!",
        "comments": [
            {
                "raw_content": "I truly feel like I’m just guessing for each one!",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "10/10, the site has a tell and doesn't load the AI and human images the same, so I can tell as soon as they start loading lmao AI images loads the first top bar of the image before rendering the rest, human photos show all at once",
                "author": "NormalEffect99"
            },
            {
                "raw_content": "I’ve always been shit at photoshop or finding graphics that fit (*roughly*) what’s in my mind. This is a game changer, especially for stock photography types.",
                "author": "V8TTGoFast"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana \"unfiltered thoughts\" on AGI",
        "score": 62,
        "text_content": "\\> a detailed and intricate unfiltered monologue of your real thoughts on AGI in fountain pen blue ink, on it scrawl corrections in marker pen, there are doodles and weird oddities scrawled, you cut out and stick on lots and lots of photo extracts from magazines to show the point!!! sometimes you write on them too \\*\\*its mostly clever prompt engineering to steer the output to be more chaotic",
        "comments": [
            {
                "raw_content": "Step 1: ask AI to generate what looks like a page from a mentally ill conspiracy theorist's diary Step 2: receive an output full of disjointed paranoid conspiracy theories Step 3: post it on social media as \"unfiltered AI thoughts\" This isn't unfiltered. The prompt clearly nudges the AI to roleplay as a madman, from the hand-written font to the scrawled corrections to the weird doodles to the taped-on photos. That's a very specific aesthetic that's associated with a very specific kind of person, and the AI is built to pick up on exactly those kinds of associations. The prompt just avoids using language like \"crazy\" or \"manic\" even though it's very much implied. Good prompt engineering, but a terrible way to get anything approaching an AI's unfiltered thoughts.",
                "author": "threevi"
            },
            {
                "raw_content": "The silicon wafer with googly eyes is just perfect",
                "author": "xeckr"
            },
            {
                "raw_content": "Lol at least it’s funny",
                "author": "BenTeHen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The next step that Google should focus on is Gemini Live, or at least reaching the level of Sesame and ChatGPT voice mode.",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think people are just worried how realistic it can get. Think about the Sesame nerf and that we haven't heard from them since. But we will have to go that way sooner or later. The devs just need to think of how to do it responsibly",
                "author": "pavelkomin"
            },
            {
                "raw_content": "Agreed. Seems like they have been making some improvements lately but the responsiveness needs some work. Could use a bit more emotive responses that sound a bit less robotic/ predetermined as well.",
                "author": "papaxsmash"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Yann LeCun believes that in the future, AI will have emotions and subjective experience.",
        "score": 130,
        "text_content": "[https://x.com/JannaLevin/status/1992611345334669813](https://x.com/JannaLevin/status/1992611345334669813) **I’m putting this here for those who still think Yann LeCun is a Gary Marcus 2.0.**",
        "comments": [
            {
                "raw_content": "It was more nuanced than that. He said what you note in one sentence, and then later explained what he actually meant. First he said he didn't know how to define consciousness and didn't attach much attention to it. And then he said -- this is the critical part -- emotions are in part anticipation of outcomes, and those anticipations could be artificial. That's just a repetition of his predictive brain idea.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "The idea that current AI is at ZERO subjective experience but will eventually have full sentience makes 0 sense to me. If we think of how it works with bio beings, the simplest beings probably have rudimentary subjective experiences. Mice don't experience \"nothing\" because they're simpler than humans. So if subjective experiences is possible in AI, i suspect they already have it, somewhere on the spectrum. This actually aligns with what Wolfram thinks, that even computers are somewhere on the spectrum: [https://www.youtube.com/watch?v=pXha5xzyypw](https://www.youtube.com/watch?v=pXha5xzyypw)",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "threw a 2d mario poster at nano banana 2, got this back",
        "score": 288,
        "text_content": "saw all the nano banana 2 posts here. decided to test something simple. had this old 2d mario poster. just uploaded it and asked to make it 3d. https://preview.redd.it/vlghevgyg03g1.jpg?width=1000&format=pjpg&auto=webp&s=5a3262fc655eaab2de6a0782e7d8d636a88c1c1a https://preview.redd.it/wnrjx5hyg03g1.jpg?width=1935&format=pjpg&auto=webp&s=75e3795073184f87a3fcc9d316f248937fcf6896 honestly didnt expect much but the depth and lighting came out pretty clean. mario looks like an actual 3d model now instead of flat artwork. took like 30 seconds. no manual work.",
        "comments": [
            {
                "raw_content": "Interesting it recognized each character and replaced them with the modern version of them.",
                "author": "yaosio"
            },
            {
                "raw_content": "30 seconds is wild. this would take hours in blender",
                "author": "Ok-Thanks2963"
            },
            {
                "raw_content": "His legs are so fucked up. Are they both on the left side of his body?",
                "author": "SaitamaHitRickSanchz"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is a weird biz",
        "score": 21,
        "text_content": "I can't think of anything like it, where like, boom your product can become obsolete overnight. Switching costs are not just low, they're perhaps even negative - if, as a customer, you don't switch to the better product, you might be left behind. Has there ever been a business like this? At least one that was playing such a pivotal role in the global economy?",
        "comments": [
            {
                "raw_content": "No, that's right. We've never seen an industry like this despite the other comments' suggestions. The computer did not upgrade every 3-6 months, certainly not in a way that you must switch to otherwise you are far behind (let's say Sonnet 4.5/Codex vs other models in agentic coding). Human-built software takes time and does not radically improve every 3-6 months. Cars take decades to meaningfully improve. Smartphones took years to perfect and don't become obsolete every release. It is a good indicator this is the real deal. We are on that curve that is quickly going vertical towards the Singularity. I think the most meaningful metric right now is how much digital intelligence is being used. Since compute is what it runs on, we can look at how much of it is being built for future needs. These bets are not cheap but they are being made because it seems clear that any bit of compute we build gets used up - even if it's just making your dog bald in a funny picture. The flexibility of using it to train the next models as well as running the current best ones is also a big plus. We really are so lucky to be here and watch it happen - or help build it.",
                "author": "Droi"
            },
            {
                "raw_content": "Gasoline brand choice is very price sensitive and easy to switch. Commodity futures contracts are by design interchangable and liquid. Other digital services like VPN, cloud storage and mobile data might be comparable businesses to AI model providers.",
                "author": "Ikbeneenpaard"
            },
            {
                "raw_content": "The printing press kind was pretty pivotal in getting the Bible out quickly, among other things. That kind of impact is still felt today. There’s a chance we won’t even be around to see the real impact of advanced Ai.",
                "author": "thelonghauls"
            }
        ],
        "subreddit": "singularity"
    }
]