[
    {
        "post_name": "Reporter asks McConnell why he blocked the Save America Act, and if he has a comment on why Tim Burchett says staffers are running your office.. McConnell is seemingly unaware of the questions he's being asked..",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are the same commies saying Trump is not fit to serve mentally.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "I still remember the Turtle flair and Cocaine Mitch on here back in the day. This place is great because we adjust and refocus. Not perfect, but better than anywhere else. Time to Ditch Mitch.",
                "author": "DhirlingWervish"
            },
            {
                "raw_content": "There needs to be an equivalent to the 25th amendment for Congress.",
                "author": "Pederella"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LOCK HIM UP",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The blonde queen, Pamala Bondo, will do nothing!",
                "author": "Cowboy888"
            },
            {
                "raw_content": "Folks still expecting the communists to arrest communists for some reason. THE SWAMP HAS NOT BEED DRAINED, UNTIL THAT IS RESOLVED ONLY RETARDS WOULD EXPECT ARRESTS. But hey, at least we can yell RINO every time a republican does what we should expect a republican to do by pattern of behavior, right??? Nothing says \"I've got 2 brain cells to rub together\" more than thinking republicans are good by default after decades of proof to the contrary. Or yelling RINO every time a republican acts in line with what the last few decades of behavior would predict.",
                "author": "TerdBergler"
            },
            {
                "raw_content": "**DEATH PENALTY**",
                "author": "Thermopylae_MMXX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHOCK VIDEO: Kristi Noem has revealed that DHS staffers secretly installed spyware on her phone and laptop until Elon caught them.",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where are the charges for treason. I want hangings or just stfu.",
                "author": "Reave"
            },
            {
                "raw_content": "Sounds like someone should be arrested, right?....RIGHT??",
                "author": "Obamas_Goatse_Party"
            },
            {
                "raw_content": "and ALL of those people still work there and are not up on charges... weird how that works.",
                "author": "emorphia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING VIDEO: Minnesota lawmakers have drawn up impeachment articles against Tim Walz and Keith Ellison. The lawmakers cite the alleged quid pro quo between Walz and the Feeding Our Future fraudsters.",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest him, then impeach him.",
                "author": "Trump2024"
            },
            {
                "raw_content": "🥱",
                "author": "grenades_and_ham"
            },
            {
                "raw_content": "🍑🍬",
                "author": "CocaineShark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Missouri House passed a bill PERMANENTLY BANNING males from invading female school sports. Participants must join sports based on their sex. BIG WIN! This needs to happen in every state in the nation.",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How this is even a debate or issue is absolutely batshit insane",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "It's insane that this sort of thing needs to be clarified by law. Just insane.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Isn't it great that we need the government to pass COMMON FUCKING SENSE into law because we live in a pussy pandering feminist culture?",
                "author": "Dev404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Nancy Mace: I want to thank my GOP colleagues for trusting me with a generous amount of time today to question Secretary Clinton... I am not suicidal.",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't actually feel like this is a joke, at this point.",
                "author": "Gadsden"
            },
            {
                "raw_content": "She is not secretary anything. She is Mrs. Clinton only.",
                "author": "COLDWARPATRIOT55"
            },
            {
                "raw_content": "Maybe an unpopular opinion, but this tweet/X is incredibly patronizing. You can’t tell if it’s a joke or if she’s serious. Either way, posting this is only pissing in our faces. The implication is that Hillary can get away with murder. While that seems obvious, a sitting member of Congress shouldn’t be joking about it. And if this is an actual sentiment, why the hell aren’t you hounding the FBI or trying any federal judge to indict her?",
                "author": "CBing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Rep. Anna Paulina Luna just CONFIRMED that the victims CLEARED President Trump of Epstein wrongdoing, the left was EXPOSED",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill Clinton certainly isn't cleared, but the media will never talk about that.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I find it extremely bizarre that so much of the discussion surrounding the Epstein files comes down to whether or not Trump is guilty of a crime. Personally, I don't give a single fuck what political party the people who fuck kids align with. If they are guilty, then may they become human wind chimes. On top of that, there is an absolute shitload of other so-called \"elites\" involved with Epstein's operation yet it always comes down to clearing Trump's name. If he's clean then case closed and we should just move on, apparently. Nope, fuck that.",
                "author": "Cuomorbidities"
            },
            {
                "raw_content": "Who the fuck cares about “exposing” democrats?!? Fucking arrest all of them, democrats and republicans, that fucked kids. Enough already. If you’re not going to do something else as this time wasting is exactly what the democrats want.",
                "author": "j2daeww"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago TV producer Debbie Brockman who was arrested at an anti-ICE protest for obstructing ICE has been FIRED by her employer.",
        "score": 869,
        "text_content": "",
        "comments": [
            {
                "raw_content": "is that fucking bruce vilanch?",
                "author": "bearhugprolapse"
            },
            {
                "raw_content": "That gents is a HUUUGE BITCH!",
                "author": "Bob_sacamanao"
            },
            {
                "raw_content": "At least she doesn't look crazy, right?",
                "author": "pedespeed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Glad that thing is behind a veil",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But... that's not \"their\" daughter...",
                "author": "Herc130"
            },
            {
                "raw_content": "She's so ugly that if she goes down on you it counts as anal.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Anyone wonder if Jefferey was actually the leader of it could have been Maxwell?",
                "author": "pedespeed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congress is turning into a nursing home",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should be forced to retire.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Boomers or whatever the hell that generation is needs to go you've done enough destruction",
                "author": "HomelessCrusader"
            },
            {
                "raw_content": "What does it say about Kentucky though? Come on, you can't find a young law makers at the Federal or State level (or anyone) to run for Senator?",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FAFO Healthcare Edition 😎",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The medical field is completely infested with communists. Don’t go to a hospital unless you really need to.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Good.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "I guarantee you there are medical personnel who murdered Trump supporters under their care.",
                "author": "JackLemon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And no translations on government paperwork.",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "shit, i want tortillas renamed to flat bread",
                "author": "Raetchel"
            },
            {
                "raw_content": "Illegals? Fuck. We should be deporting every non Christian foreigner as possible. We need to go back to the 3% foreigner in this nation of the 50s. Get rid of the cultures that destroy and are incompatible with American Christian values.",
                "author": "invalid_data"
            },
            {
                "raw_content": "We could probably get rid of about half of the legal population while we’re at it.",
                "author": "CocaineShark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Ninth Circuit vacated an injunction on EO 14251, allowing President Trump to cancel collective bargaining agreements... covers roughly 800,000 federal employees",
        "score": 692,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YUGE! Collectively bargaining against the taxpayer is CRIMINAL.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "How is the Ninth Circus doing more for Trump than a 6-3 SCOTUS?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "No government employees should ever have a union, at any level",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ahmed",
        "score": 945,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport kebab",
                "author": "wow-shit"
            },
            {
                "raw_content": "> Abdiwali Ahmed, a Minnesota resident. You know it, I know it, everyone knows it.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Ahmed is a variation of Muhammad, making this invader crime have a 100% Muhammad coefficient.",
                "author": "Combat_Hamster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden FBI Recording Trump Campaign Calls Is A High-Tech Watergate But Worse",
        "score": 1196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sure the floodgates of justice will burst open any day now right Pam???.......",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Every day another revelation with no action. They're just leaking enough to keep you all from going to the Capitol again.",
                "author": "ImprerialWalker"
            },
            {
                "raw_content": "It's really amazing how democrats are always able to get away with crimes that are far worse than Watergate.",
                "author": "raptormissle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Weird.",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The benefits offend me, since I’m paying for them and the people receiving them call me a Nazi",
                "author": "ObackBarama"
            },
            {
                "raw_content": "you fly the flag of another nation, you should be deported to that nation, even if it's that pink and pale blue dump",
                "author": "kekapoo1"
            },
            {
                "raw_content": "funny, that.",
                "author": "elmerecido"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Things that MSM won't highlight to the world ...",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$1.40 a year? Talk about slave wages! 😉",
                "author": "peterthegreen"
            },
            {
                "raw_content": "A staff of 18.... Inches",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Big Mike and his gay handler.",
                "author": "wow-shit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arctic Frost leaders still at FBI",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, if only we had our guy at the top position of the FBI to do something.",
                "author": "Seatacjoe"
            },
            {
                "raw_content": "America's own Praetorian Guard interfering with elections and trying to select emperors",
                "author": "StruggleSession"
            },
            {
                "raw_content": "Jacobs, Kowalski, Rothrock, Barnacle and Tapp sounds like a Greenwich Village law firm.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If Hillary didn't know Epstein, why did she invite him to her event at the Harvard Club?🤔",
        "score": 1190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Way was Ghislaine at her daughter's wedding then?",
                "author": "Trumpwonbidencheated"
            },
            {
                "raw_content": "Who is Mrs. Jeffrey Epstein?",
                "author": "pookiee68"
            },
            {
                "raw_content": "You all might not believe this... she's a lying bitch.",
                "author": "nmipede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BINGO...",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of many problems.",
                "author": "jaeger"
            },
            {
                "raw_content": "Too bad he's not aware of the problem. His brain's fried.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "leader of many problems in the gop",
                "author": "Raetchel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hardware reviewer Geekerwan possibly censored by China after alleging widespread Chinese manufacturers cheating in mobile phone gaming reviews",
        "score": 291,
        "text_content": "The Chinese hardware reviewer released a video revealing that mobile phone manufacturers have cheated in gaming performance reviews of their phones by doing a few things: 1. Sending specially selected review units which contain \"Golden\" chips to reviewers. These chips are able to achieve higher gaming performance (6-8%) and lower power usage than the average retail unit, usually a watt lower (20%). 2. Certain review models from Xiaomi force VRS (Variable Rate Shading) on out-of-box to boost gaming benchmarks with no option to turn it off. 3. iPhones are one of the few models with no observable cheating. iPhone retail units in fact performed better than review units in gaming due to operating system updates. The video in question has been wiped from all Chinese media platforms, including from cloud storages and backups done by other people. Other content creators reacting to the incident had their react videos taken offline by the platforms too. It is very likely that a state level censorship is underway to protect Chinese phone manufacturers. The video on Geekerwan's youtube channel has been set to private, possibly under pressure from powers from above. He has given permission to anyone who would like to backup or share the video in question. Source explaining the situation: https://www.youtube.com/watch?v=RfPgQL5RvjU Backup of the censored video: https://www.youtube.com/watch?v=HrUNXofYAfY (backup of the video and youtube comments)",
        "comments": [
            {
                "raw_content": "He has 5 million followers on Bilibili, I even personally watched the video there a few days ago. This is a weird way of censorship, because all Chinese netizens are even more mad.",
                "author": "biotech997"
            },
            {
                "raw_content": "In case you didn’t know Geekerwan is very reputable and knowledgeable guy in any standards, curious as to what is the actual reason and what’s gonna happen from now on",
                "author": "team56th"
            },
            {
                "raw_content": "Alternatively it's because just like YouTube, Chinese companies also file malicious take down notices and bogus lawsuits. Geekerwan's own Weibo post suggests that this isn't state censorship but rather companies filing take down notices and lawsuits. If a government censor doesn't want him talking about it they would've scrubbed it from the internet and banned him from being able to post a link on Weibo. The fact that none of his accounts were even taken down and discussions weren't banned on Weibo makes it extremely unlikely to be gober ment censorship. EDIT: You can still go and search his name (极客湾) on Weibo, and see what other people are saying. Normally when it's government censors doing it, they would block people from searching the terms and remove all posts around it. Also [posts with screenshots](https://weibo.com/7691041696/5269790321279910) are still up. It's just the video being taken down right now. EDIT 2: I see rumours that manufacturers filed a complaint with the Chinese state regulator which got the video taken down. There's a screenshot floating around that claims the Cyberspace Administration of China took the video down, but it's fake and edited from an actual govt announcement. EDIT 3: Incredibly, the video seems to still be up on mihoyo forums https://www.miyoushe.com/sr/article/73501822",
                "author": "igenicoOCE"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA “unlaunches” its GeForce 595.59 driver after reports of fan and clock issues - VideoCardz.com",
        "score": 367,
        "text_content": "If only there was an uber new intelligent tech that could help test these drivers and sort out bugs before release. Maybe spearheaded by the same company who released this mess.",
        "comments": [
            {
                "raw_content": "The App experience was crazy. The download started, and while already in progress the total size changed to zero bytes, the page for the new driver was replaced with the old one, and a \"you're up to date\" message replaced the download controls. I was wondering what happened, and then the news appeared. Seems like a dodged bullet seconds before install would start.",
                "author": "PastaPandaSimon"
            },
            {
                "raw_content": "AI vibe coding doing wonders everywhere",
                "author": "ShadowsGuardian"
            },
            {
                "raw_content": "Oh, ffs. I already updated. How about they test their shit before unleashing it on paying customers?",
                "author": "antonlbdv"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RAM supply is so tight, Samsung may be charging Apple double",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That means Apple found it cheap.",
                "author": "pluckyvirus"
            },
            {
                "raw_content": "Didn't apple prepay or at least pre negotiate a rate for a certain timeline? Wouldn't that mean that Samsung has to wait till the contract is over first, or will they disregard it and face consequences",
                "author": "fuzzycuffs"
            },
            {
                "raw_content": "As mentioned on the /r/Apple sub, if Apple got a long-term contract on these then they've locked in the price for a slight premium. There's nothing worst for a device manufacturer than year-over-year fluctuating component costs. Bespoke OEMs like Frameworks who sell at low volume are especially susceptible to this. Apple is probably betting on the RAM price increasing more than the premium they'd pay Samsung so with their long-term contract, they'd end up ahead. Plus, it'll likely give Apple a priority access versus OEMs who buy on shorter or spot market contracts (including Samsung Mobile).",
                "author": "BigBangBoomerang"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia rolls back its latest driver update — Game Ready Driver 595.59 reportedly causes fan issues on RTX 3000, 4000, and 5000-series GPUs",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Resources have been diverted for some time...",
                "author": "specialk2hz"
            },
            {
                "raw_content": "https://www.tomshardware.com/tech-industry/artificial-intelligence/nvidia-now-produces-three-times-as-much-code-as-before-ai-specialized-version-of-cursor-is-being-used-by-over-30-000-nvidia-engineers-internally Nvidia starts pumping out 3x as much code using AI and people are surprised things are breaking? Nothing says stability like AI writing drivers.... It's just like MS having a massive patch screwup a second month in a row now that they've fired their expensive lifetime employees for cheap, ignorant devs using AI to code things they don't understand.",
                "author": "theQuandary"
            },
            {
                "raw_content": "never forget that tom's hardware told consumers to \"just buy it\" in regard to nvidia.",
                "author": "angry_RL_player"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA confirms GeForce RTX 50 shortages due to the global memory crisis, impacting supply through fiscal 2027",
        "score": 432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn you know it will only get worse when Nvidia themselves actually confirm it",
                "author": "Admirable_Bid2917"
            },
            {
                "raw_content": "Clutches my 3090 more tightly.",
                "author": "dstew74"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fujitsu's 144-core Monaka CPU to use Broadcom's 3D chip tech",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Korean news: The Galaxy S series will soon be equipped with silicon carbon batteries, officially confirmed.",
        "score": 156,
        "text_content": "**Vice President Moon Seong-hun of the smartphone research and development team** **Separate** mention Samsung admits that the MX may be lagging behind in battery innovation. **Currently** undergoing **A smartphone equipped with a silicon-carbon anode battery is being prepared and is expected to be released soon.** **​** **​** PS Separately from this, if we talk about the recent NDA contents of related companies, **it seems that both Basic Plus and Ultra have increased by 000 and the timing of application is being discussed.**",
        "comments": [
            {
                "raw_content": "considering s26 was revealed yesterday, this \"soon\" means literally in a year",
                "author": "godfrey1"
            },
            {
                "raw_content": "> it seems that both Basic Plus and Ultra have **increased by 000** and the timing of application is being discussed. I have no idea what this means. Is this some sort of typo or auto-translation error?",
                "author": "LegoGuy23"
            },
            {
                "raw_content": "If true this is SiC news",
                "author": "Rais93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Foundry Services Head Leaves For Qualcomm Supply Chain Post",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Failing upwards, isn't he? Edit: seems like he already was at a level reporting to C-levels, so failing sideways at best. https://www.intc.com/news-events/press-releases/detail/1695/kevin-obuckley-to-lead-foundry-services-at-intel",
                "author": "Homerlncognito"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Strix Halo & 128 GB RAM in a 13-inch convertible - Asus ProArt PX13 GoPro Edition Review",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Asus' premium laptop offerings are so disjointed. The Zephyrus G14 is prime candidate for Strix Halo. Didn't get it. The TUF A14 does get it, but is LCD only. You also need to pay for the 12-core version even if you don't need it because they're \"evaluating\" the 388. Then we have this thing. Fully unlocked Max+ 395, 13-inch, OLED, 2-in-1. Nearly perfect... but it is ugly and cheap looking and has a 60Hz display.",
                "author": "Hour_Firefighter_707"
            },
            {
                "raw_content": "Hello T1beriu! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Can we just take a second to appreciate Capcom?",
        "score": 2649,
        "text_content": "\\*2 launch titles for the Switch 2 \\*2 ports dropped in 1 day, 3 total games in 1 week \\*3 titles launching on Switch 2 on the same day as other consoles/PC \\*3 demos \\*All (so far) of at least average to stellar optimization (graphics and performance) \\*7 total games in less than 1 year for the Switch 2 I'm not saying they are perfect, but they have been the best supporter for the Switch 2 in its first year IMO.",
        "comments": [
            {
                "raw_content": "The spirit of the GameCube lives on",
                "author": "Wipedout89"
            },
            {
                "raw_content": "Capcom have been brilliant for a long time on Nintendo platforms. The fact they got a game like resident evil revelations looking as good as it does on a 3DS is mind blowing to me and it’s better looking than anything Nintendo released on that system.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Capcom has given the switch 2 the reputation that next gen games can run on it. What worries me is the port of Monster Hunter Wilds, that will be the real test",
                "author": "GrouchyMembership876"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo switch 2 ad on the Google app supposedly confirms Elden Ring is still coming",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fromsoft themselves confirmed very recently that Elden Ring and Duskbloods are happening this year",
                "author": "crocicorn"
            },
            {
                "raw_content": "Why would you assume that it wasn't still coming?",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Of course it's still coming.",
                "author": "Switch815"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "He’s trying his hardest",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/vos3054pwwlg1.jpeg?width=4624&format=pjpg&auto=webp&s=f5e7b54765d10f8c27546e9d582593f9a2c58f31 do you think they'd be friends?",
                "author": "Pink-Fluffy-Dragon"
            },
            {
                "raw_content": "![gif](giphy|fj9bSthF8Gt6ZGt1Mp)",
                "author": "cloned01"
            },
            {
                "raw_content": "I was literally humming this song as I opened reddit, this is first post I see lol",
                "author": "Smidgerening"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Every time a Nintendo Switch 2 physical release is announced",
        "score": 1253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I respect your meme game.",
                "author": "notlooking743"
            },
            {
                "raw_content": "As long as it is not a code in the box I am happy. I am completely ok with gkc because if I finish the game or get tired of it I can just sell it.",
                "author": "Beneficial-Issue8005"
            },
            {
                "raw_content": "Listen, I hate GKC as much as the next guy, but I REFUSE to buy code in a box",
                "author": "Solo_Jackfruit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yo Best Buy what gives",
        "score": 103,
        "text_content": "Ordered the generations pack 2 months ago and ordered the controller today controller is preparing and the generations pack is just chilling",
        "comments": [
            {
                "raw_content": "Yup this is why I stopped pre ordering for delivery from Best buy. The last two games I did, arrived 5 days after release. Kind of a drag.",
                "author": "Cozy-Panda777"
            },
            {
                "raw_content": "Last thing I preordered was from target (Mario tennis fever), and it actually arrived a day before its release date 😅.",
                "author": "c_rorick"
            },
            {
                "raw_content": "Same for me. Hopefully they deliver Saturday if not tomorrow.",
                "author": "Zealousideal-One9318"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hear me out on this one",
        "score": 168,
        "text_content": "unparalleled levels of immersion",
        "comments": [
            {
                "raw_content": "truly terrifying, except it'd be hard to see the blood.",
                "author": "Soyboy412"
            },
            {
                "raw_content": "Problem: the cardboard one doesn't have the red filter.",
                "author": "BouncyBlueYoshi"
            },
            {
                "raw_content": "I know this is a meme, but RE8 on PSVR2 is one of my favorite experiences. It works so well in VR.",
                "author": "Chase64Cubed"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Foundry's Resident Evil Requiem Switch 2 Analysis, running very well on Switch 2!!",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really hoping people show up for this game. Will be good to see Capcom rewarded for day and date porting of this quality.",
                "author": "kar_mitt"
            },
            {
                "raw_content": "2:16 - “By and large it does look very similar to PS5” 17:38 - “When I look at this running on Switch 2 in handheld mode, I’m thinking like, okay, this is like this is beyond what we would normally see like on last generation consoles running on a little handheld. That’s what it feels like, right? I think it’s really really impressive.”",
                "author": "Scooby_Si"
            },
            {
                "raw_content": "Designing the Switch 2 around DLSS has once again proven to be Nintendo’s best decision this generation. This feels like pure magic.",
                "author": "AbdullaFTW"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are we playing?",
        "score": 62,
        "text_content": "I’ve got a riches of games I’m enjoying right now. Someone recommended playing FF Crisis Core before Remake.I am not a very good fighter and using all the combinations is challenging… but the dialogue is funny!",
        "comments": [
            {
                "raw_content": "FF7 Remake",
                "author": "Stik601"
            },
            {
                "raw_content": "I'm mid resident evil marathon. Just finished, resi HD, 2 & 3 remakes on pc, now onto classic 4 on the switch, then revelations 1 & 2. Should be sampling the new generation pack by next weekend! (If anyone is wondering, I played through 5 & 6 with a friend when they first released. I have no intention of ever playing those games again lol)",
                "author": "shesFizz"
            },
            {
                "raw_content": "I just finished windwaker on NSO a few minutes ago",
                "author": "zatchrey"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Requiem Switch 2 Analysis vs PS5/Series S: DLSS Is A Game-Changer",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RIP to the dude who's been (weirdly) spamming the Resident Evil and Digital Foundry subreddits claiming that Requiem dips regularly below 30fps... before DF even released their video lol.",
                "author": "GomaN1717"
            },
            {
                "raw_content": "As someone who owns all 3 consoles , I’m genuinely impressed what the switch can do . Glad Nintendo users can experience these games at a comparable enough level to the other consoles",
                "author": "dopeman445"
            },
            {
                "raw_content": "Really glad it runs well. Going with PS5 just because its a game I like to play on my TV with the lights off but its awesome that it runs so well for those who want a handheld experience or just prefer playing it on switch 2.",
                "author": "Traditional-Most-787"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Exclusive: Nintendo plans around $1.9 billion share sale by Kyoto bank and others, sources say",
        "score": 190,
        "text_content": "https://www.reuters.com/sustainability/sustainable-finance-reporting/nintendo-plans-around-19-billion-share-sale-by-kyoto-bank-others-sources-say-2026-02-27/",
        "comments": [
            {
                "raw_content": "What does this mean exactly?",
                "author": "WolftheLionheart"
            },
            {
                "raw_content": "Aight, from what I can best surmise for those asking what this even means (fair warning, I'm 3 whiskey neats in as I type this): Japanese companies, unsurprisingly, have historically been well-insulated by domestic banks and insurers, typically seen as an attempt to shield C-Suite management from shareholders. This, quite obviously, leads to more conservative outlooks and practices since it's, yaknow... literal banks and insurers holding stock lol. There's been increasing pressure for Japanese companies to move away from this practice for the sake of 1.) regaining more institutional control and 2.) optimizing investment paths for overseas shareholders, just as Toyota has done recently. Nintendo is effectively doing a buyback, and could *potentially* signal making shares more appealing for ex-US holdings. It can also be seen as a hedge against their stock dropping back to 2024 levels partly due to how crushed the yen has been in the past few years. TL;DR - If you're an overseas investor in Nintendo, not a bad sign. If you're not an investor, this means a shitload of fuck.",
                "author": "GomaN1717"
            },
            {
                "raw_content": "Nintendo’s ever so slowly has been buying back more of their shares, getting more and more control back, wonder how far they go with this.",
                "author": "Ratchet2332"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: \"Sony is shifting their PC strategy, absolutely.\"",
        "score": 1221,
        "text_content": "Source: [https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151857286](https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151857286)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Not that there was any reason to doubt Jason, but literally everyone has heard it at this point it seems like. Crazy that Jez Corden, of all people, was the [first one to report on this months ago](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oxlipx/jez_corden_says_he_heard_from_a_very_good_source/).",
                "author": "honeybadgerism"
            },
            {
                "raw_content": "I called this as soon as the rumors started for the next Xbox having steam.",
                "author": "LollipopChainsawZz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier regarding Sony pulling away from singleplayer PC ports: \"It's not speculation, but sometimes topics come up on the show before I'm quite ready to publish a story about them. More to come soon.\"",
        "score": 1437,
        "text_content": "Source: [https://www.resetera.com/threads/jason-schreier-the-sense-i%E2%80%99m-getting-is-that-sony-is-backing-away-from-putting-their-exclusive-console-traditional-single-player-stuff-on-pc.1447141/post-151851202](https://www.resetera.com/threads/jason-schreier-the-sense-i%E2%80%99m-getting-is-that-sony-is-backing-away-from-putting-their-exclusive-console-traditional-single-player-stuff-on-pc.1447141/post-151851202) >Jason Schreier: I mean, it's not speculation, but sometimes topics come up on the show before I'm quite ready to publish a story about them. More to come soon I'm sure. Thanks for listening to Triple Click! This week's episode was a lot of fun. Original rumor: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rfd9y2/jason_schreier_and_john_linneman_both_speculated/",
        "comments": [
            {
                "raw_content": "The one time I try to be in front of a post that sounded like speculation, sorry to the people that posted it initially and I removed",
                "author": "ImAnthlon"
            },
            {
                "raw_content": "Is this thread going to actually stay up??",
                "author": "SKyJ007"
            },
            {
                "raw_content": "Can we keep his entire speech in the podcast now? I was looking for it, but it kept being removed",
                "author": "thiagomda"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier (Bloomberg): The Story Behind the Failure of ‘Highguard’",
        "score": 720,
        "text_content": "[https://www.bloomberg.com/news/newsletters/2026-02-26/the-story-behind-the-failure-of-highguard?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc3MjEyNjY2MSwiZXhwIjoxNzcyNzMxNDYxLCJhcnRpY2xlSWQiOiJUQjJURlpLR0lGVDEwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.ty0kXKqfEl28WgD25I4hsgwQZcpJq\\_K3n3AVsJXMoWc](https://www.bloomberg.com/news/newsletters/2026-02-26/the-story-behind-the-failure-of-highguard?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc3MjEyNjY2MSwiZXhwIjoxNzcyNzMxNDYxLCJhcnRpY2xlSWQiOiJUQjJURlpLR0lGVDEwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.ty0kXKqfEl28WgD25I4hsgwQZcpJq_K3n3AVsJXMoWc) >NEW: Inside the failure of Highguard, which flopped so badly that developer Wildlight laid off most of its staff just two weeks after release. >Here's the story behind why people loved working at Wildlight, why Tencent pulled funding, and how it all fell apart: [https://bsky.app/profile/jasonschreier.bsky.social/post/3mfrppsqxn224](https://bsky.app/profile/jasonschreier.bsky.social/post/3mfrppsqxn224)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Another cautionary tale of leadership being dumb and industry folks not reading the room to add to the pile.",
                "author": "NotSoSmart_Sideswipe"
            },
            {
                "raw_content": "The story of this game is a case study for what not to do with your videogame development because nothing says slam dunk like trying to replicate a hail mary from 7 years ago for no reason other than \"what if we did that again though.\"",
                "author": "IrrefutableBukkake"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate on the new Sonic game: “I do expect an announcement this year.”",
        "score": 280,
        "text_content": "He also says he’s unsure about the release date https://xcancel.com/natethehate2/status/2026833081521357060?s=4",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Life is like an annualized sonic game you never know what you'll get",
                "author": "profchaos111"
            },
            {
                "raw_content": "A friend works at Sega and she told me she expected a lot of announcements this summer, to the point that Sega might even try to have an event, she also said a Fortnite collab would happen around September. Obviously she didn't say which games but I am guessing Persona 6 and Sonic as well as Streets of Rage judging by the timelines and timing",
                "author": "ManateeofSteel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SneakersOS suggest Sony Shifts Back to Single-Player Focus",
        "score": 571,
        "text_content": "In response to a user in Neogaf: \"We're talking about games in the future. I understand if folks are disappointed with the output on this front, but there are loads of changes happening now that we'll see increasingly over the next 3-4 years that are more in line with what folks preferred from them. That isn't to say live-service titles are done and dusted btw.\" https://www.neogaf.com/threads/jason-schreier-the-sense-i’m-getting-is-that-sony-is-backing-away-from-putting-their-exclusive-console-traditional-single-player-stuff-on-pc.1693989/page-7#post-271311298",
        "comments": [
            {
                "raw_content": "Should have always been the plan. 3-4 single player games a year (maybe 1 of them could be the experimental type games like they've tried with Sons of Sparta and Lego Horizon), and at most an extra live service game on top of the yearly MLB games every 2 years or so",
                "author": "Sambadude12"
            },
            {
                "raw_content": "Oh my god lmfao, it's so pathetic when something gets reported then all the other vultures come out after and go \"yeah i heard that too\"",
                "author": "DwnvotesMeansImRight"
            },
            {
                "raw_content": "Took them like 5 studios shutdown to finally go back lol",
                "author": "Algae-Prize"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier and John Linneman both speculated in their podcasts this week that Sony could be pulling away from PC ports for their singleplayer games, with Schreier even suggesting that Wolverine would never release on the platform",
        "score": 907,
        "text_content": "Jason Schreier source(timestamp 43:33): [https://podcasts.apple.com/us/podcast/why-phil-spencer-retired-and-whats-next-for-xbox/id1507834679?i=1000751690666](https://podcasts.apple.com/us/podcast/why-phil-spencer-retired-and-whats-next-for-xbox/id1507834679?i=1000751690666) >Kirk Hamilton: You can see some of the same things coming for Sony. As they, you know, move to multi-platform, as they begin to sort of degrade what it means to have a PlayStation. Because they're responding to that same force that we're talking about, that same maybe inevitable pressure of, you know, consoles are just kind of going away and it's becoming a multi-platform world. What do you do with that when having Uncharted be PlayStation exclusive used to be so important? So you can see some of those pressures kind of being applied to Sony. But yeah, it does seem as though they kind of made a few less bad decisions or just kind of bungle things up quite a bit less. They kind of kept things simpler, I guess, over the course of the 2010s than Microsoft. >Jason Schreier: I mean, I think for them, their strategy is like, live service games are coming at PC, but I think, the sense of getting is that they're backing away from putting their exclusive consoles stuff, like traditional single player stuff, on PC. >Kirk Hamilton: Really? You think they can close that door? As if they could start to say, okay, never mind, Ghost of Tsushima 3 is only going to be on PlayStation. >Jason Schreier: I do. >Maddy Myers: Wow. >Jason Schreier: I do. Yeah. >Maddy Myers: Hmm. Called shot. >Jason Schreier: And I mean, even if they don't, I mean, we're seeing, like Wolverine is coming in September, they just announced it's coming September 15th. That's not going to be on PC, that's going to be on PlayStation 5 only. >Kirk Hamilton: You think that'll never come to PC? >Jason Schreier: I wouldn't be surprised if it never came to PC. But even if it does, like, again, it's just like, you have a very strong idea of what that is and you need a PlayStation to play it, at least for the, like, indefinite future. And so there is a strong brand behind it. John Linneman source: [www.youtube.com/watch?v=gnZsurPI5EY&t=1413s](http://www.youtube.com/watch?v=gnZsurPI5EY&t=1413s) >Richard Leadbetter: What do you think, John? Do you think there is actually I mean, if they're going to fully embrace PC, they've got to fully embrace PC, and that means a lot of things that I don't think they want to do. For example, day and date releases. >John Linneman: Yep. I actually I have an inkling that they're pulling away from PC. Watch the space. But I can't help based on some of the decisions and the way things have been going lately, I get the feeling that under the current leadership, that PC has become less important. One might argue that the Jim Ryan era, the one positive thing to come out of it is this shift to PC, but I'm not confident that they have like a huge vision for PC going forward. Not to say that we won't still see some PC games happening, but I think it's not going to become more PC focused. I think if anything, it's going to become less. We'll see. I mean, maybe that's not the case at all, but and this is the reason I don't think that they are they would ever consider like saying like a PC launcher, like going bigger on PC at the expense of console. I think console is where they want to be. It is important to note that both are speculating, but I would say it is noteworthy that both did it in the same week. Maybe there are some decisions being made behind the scenes at PlayStation that lead to that simultaneous speculation. Especially Scheier's comments are interesting, given he has more insight into the industry than most.",
        "comments": [
            {
                "raw_content": "#Your post has been removed Please read the [r/GamingLeaksAndRumours rules and guidelines](https://reddit.com/r/GamingLeaksAndRumours/about/rules/) before posting. Continued ignorance of them may result in a ban. **Rule 3. Keep posts on topic with leaks & rumours.** *News/Troll/Joke posts are not allowed. Your post must be related to video game leaks, rumours, or a piece of news only if it is related to a leak or rumour posted previously on the subreddit.*",
                "author": "GamingLeaksAndRumours-ModTeam"
            },
            {
                "raw_content": "I wonder if this is partially due to xbox next console",
                "author": "Severe-Committee6240"
            },
            {
                "raw_content": "Ever since the weirdness surrounding the Spider Man 2 PC release and the abandonment of the PS overlay it seemed that this was a real possibility tbh. The first wave of PC ports Sony did ended up doing numbers but since then they've been far more hit or miss (both in numbers and quality). Obviously second party stuff like your death strandings and stellar blades aren't going to stop anytime soon but I really wouldn't be surprised if their first party stuff stopped making its way over. Demon's Souls still hasn't even been ported and it was one of the first PS5 releases. GT7 seems like it'll never happen either and both of those were in the Nvidia leak too.",
                "author": "Plus_sleep214"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem is using PSSR2",
        "score": 383,
        "text_content": "[https://www.youtube.com/watch?v=I77\\_RuylLtk](https://www.youtube.com/watch?v=I77_RuylLtk) Around the 6:45 mark: \"Yet if you look at the image here, it's crystal clear. The perceived resolution seems significantly higher, suggesting that its being reconstructed to 4k. The results are arguably the best we've ever seen in any RE engine game to date and certainly better than we usually see on these consoles, it's really impressive stuff\" This upscaler is only used on the PS5 Pro and they don't go into any more details in the whole video (on a DF analysis? suspicious). They also mention a surprise soon at the end of the video, im pretty sure they have an embargo and it's the first PSSR2 game. I wonder if we'll get a Cerny video with a bunch of updates dropping in the next couple hours.",
        "comments": [
            {
                "raw_content": "On the PC side DLSS in Requiem is also giving better results than Wilds or DD2. It's possible Capcom simply made some under the hood changes to improve how RE Engine deals with temporal data and upscaling.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "Or PSSR just simply works well with this game. Not everything is a Silent Hill 2 implementation of the feature. Alan Wake 2 and Final Fantasy 7 Rebirth look significantly better than base systems. Something as big of a deal as a PSSR2 update would get a blog post or announcement, not quietly implemented into a 3rd party game at that.",
                "author": "tokyobassist"
            },
            {
                "raw_content": "Really wish I had the money to justify buying a pro because I’ve only ever heard amazing things about the console",
                "author": "ballviewer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 26.2.2 Release Notes",
        "score": 279,
        "text_content": "# Highlights * **New Game Support** * Resident Evil Requiem * Marathon * **Fixed Issues:** * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while using Windows desktop applications with Instant Replay and Record Desktop enabled on Radeon™ RX 7000 series products. # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370. AMD is actively working on a resolution with the developer to be released as soon as possible. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. * AMD FSR Upscaling and AMD FSR Frame Generation may show as inactive in AMD Software: Adrenalin Edition when playing Yakuza Kiwami 3 & Dark Ties, Call of Duty®: Black Ops 7, and Resident Evil Requiem when enabled on Radeon™ RX 9000 series graphics products.",
        "comments": [
            {
                "raw_content": "Windows has been so messed up I genuinely can't tell what's a GPU driver issue and what's just Windows. I've had so much flickering and browsers going dark the past week. If I had to guess it's probably just Windows.",
                "author": "NarutoDragon732"
            },
            {
                "raw_content": "Guess that confirms we have to wait for the first March release for FSR 4.1.0 on RDNA 4 cards",
                "author": "Dat_Boi_John"
            },
            {
                "raw_content": "Why do I feel like the cyberpunk issue will never be resolved?",
                "author": "Lord_CBH"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR 4.1 DLL reportedly leaks, and RDNA 3 users are already testing it",
        "score": 292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "It seems as if it has fixed the shimmering bug on fsr 4 quality mode. But need to checkout more games. I also noticed increased in sharpness. I wouldn't say anything groundbreaking, more subtle than anything. But I would like to know if anyone else noticed the shimmer bug has been fixed on quality mode. I only checked out Wukong in that regards.",
                "author": "Maroonboy1"
            },
            {
                "raw_content": "Seriously release the INT8 files. The cat is long out the bag that RDNA2 and 3 GPUs can run FSR4, and adding the official support alongside FSR 4.1 is the best upcoming moment they have to do it.",
                "author": "Hayden247"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "5% Mortgage Rates Are Here. Will They Last?",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "5.87% is not 5%!",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "5.87% according to zillow, that includes buying points. Did a real estate agent with a hardon write this shit?",
                "author": "nobadhotdog"
            },
            {
                "raw_content": "Home prices still seem inflated to me. All it would take for them to adjust is for me to buy.",
                "author": "BigWormsFather"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Almost half of homeowners feel trapped by high mortgage rates, study reveals",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh no! I own a house with a low interest rate and relatively low mortgage and can’t refinance or buy another house without committing far more money! I tragically won the game of retirement in America and I’m TRAPPED",
                "author": "IllMango552"
            },
            {
                "raw_content": "People got lucky buying a home at the right time before they doubled in value and now they feel “trapped” with a 400k house and a $900/mo mortgage…. Give me a break. Take the win and enjoy your house that you desperately needed to purchase, or rent it out. So sorry you can’t retire on your free equity without selling your house. You aren’t trapped. The people who will never be able to afford a home are trapped.",
                "author": "TjbMke"
            },
            {
                "raw_content": "lol what a world we’ve created where people feel “trapped” because they ow a home.",
                "author": "No_Cut4338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bipartisan bill aims to block big investors from buying single-family homes",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In my neighborhood it's not big corporations it's mom and pop millionaires who buy up all the housing.",
                "author": "mountainlifa"
            },
            {
                "raw_content": "good, probably wont pass though",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "There’s a bill making the rounds in GA to fight this as well. I was super excited about it until I realized that it bans big investors for 30 days🙃",
                "author": "FiguringItOutAsWeGo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Typical First-Time Homebuyer Is 35 Years Old",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Instead of Redfin's cherry picked data, here's NAR's data on FTB showing the median age being 40: [https://www.nar.realtor/newsroom/first-time-home-buyer-share-falls-to-historic-low-of-21-median-age-rises-to-40](https://www.nar.realtor/newsroom/first-time-home-buyer-share-falls-to-historic-low-of-21-median-age-rises-to-40)",
                "author": "Sad_Resolve_4888"
            },
            {
                "raw_content": "Whatever survey's number you use for the average FTHB age - 35, 36, 40, whatever, I think they are all telling the same story. Home prices have outstripped wages to the point where you need to be near the top of the wage ladder to afford even the bottom of the ladder unit. ((40's about peak wage-earning years). Same deal with all the under-30 buyers needing parental help. A median income doesn't even come close to buying a median home.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "It doesn’t matter what the first-time homebuyer's age is, whether it’s 35, 40, 45, 50, etc., the home prices are too high. Hence, the panic among home sellers and those in the real estate industry, that if too many people don’t believe buying a home is worth it, then something else will replace the so-called “American Dream” of owning a box with a triangle roof, while being a mortgage-slave for 30+ years, plus carrying costs. But it’s okay, because we have 50-year mortgages, 401(k) down payments, and so on, to save the day.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyers beware",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuying Affordability Improves As Mortgage Rates Fall to Lowest Level in Over 3 Years",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“There’s competition for fixed-up houses in desirable neighborhoods.” Bbbbbbingo!",
                "author": "zorg-18082"
            },
            {
                "raw_content": "I need 5.5% or below please then I’ll finance 🙏🤞",
                "author": "stock-prince-WK"
            },
            {
                "raw_content": "Roflol. Right, rates drop 1% and suddenly that 500k house that used to be 200k 5 years ago is now suddenly affordable.",
                "author": "OmahaWarrior"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US 10-Year Yield Falls to 3-Month Low",
        "score": 35,
        "text_content": "Exactly what the doctor ordered if you are shopping for a mortgage.",
        "comments": [
            {
                "raw_content": "While the fed is still letting MBS roll off their balance sheet. They have begun the repurchase of treasuries which is suppressing the 10 year rate. https://streetstats.finance/liquidity/fed-balance-sheet",
                "author": "hobbinater2"
            },
            {
                "raw_content": "Do you ever tire of this crap? The 10 year has been range bound from 4-4.3% for a long time now.",
                "author": "LatiBerg"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyers beware",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google releases Nano banana 2 model",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**From Source:** [2nd Blog](https://blog.google/innovation-and-ai/technology/developers-tools/build-with-nano-banana-2/) & [Gemini API](https://ai.google.dev/gemini-api/docs/image-generation) https://preview.redd.it/x1dfm6i15vlg1.jpeg?width=1080&format=pjpg&auto=webp&s=8b1e57df26ab89ad84b7e5131b46f3f2f8895e36",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Wow I'm trying it with things that it did very poorly before (remodeling my house lol) and it's soooooo good. Making me want to plop down money on a remodel right now",
                "author": "bentendo93"
            },
            {
                "raw_content": "Closer and closer to images becoming solved",
                "author": "THE--GRINCH"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic rejects Pentagon's \"final offer\" in AI safeguards fight",
        "score": 2241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://www.anthropic.com/news/statement-department-of-war](https://www.anthropic.com/news/statement-department-of-war)",
                "author": "AuYsI"
            },
            {
                "raw_content": "Good for them, seriously. The bar is on the floor, but it’s cool to see a company willing to stand up for their principles for once.",
                "author": "toggaf69"
            },
            {
                "raw_content": "Kind of crazy that their only stipulations were to not do: - mass domestic surveillance - fully autonomous weapons And Hegseth and his DoW looked at that and said 'nope, can't agree'.",
                "author": "Deto"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It’s starting",
        "score": 695,
        "text_content": "Almoat half the staff gone, in an instant…",
        "comments": [
            {
                "raw_content": "Layoffs suck but 5months pay and visibility with your coworkers is awesome. Most companies kick you out and pretend you don’t exist.",
                "author": "samuel_smith327"
            },
            {
                "raw_content": "Translation: \"Stripe is eating our breakfast, 2nd breakfast, lunch, and dinner.\"",
                "author": "TeamBunty"
            },
            {
                "raw_content": "Coincidentally their shares were down 20% before this announcement.",
                "author": "PropertyOk9904"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk, Sam Altman in 2050",
        "score": 3802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/uzr8lsq8mulg1.jpeg?width=1375&format=pjpg&auto=webp&s=0d58c1a970a3fa03d256d191f092d717749b048a",
                "author": "DigSignificant1419"
            },
            {
                "raw_content": "No fucking way Elon gives up on the hair plugs",
                "author": "Traditional_Cress329"
            },
            {
                "raw_content": "Best Ai vid I’ve seen actually first one I saw that was entertaining at all good work",
                "author": "Chonkthebonk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "guys...",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not to nitpick, but the hour hand should be much more centered between the 7 and 8. Still impressive.",
                "author": "CouscousKazoo"
            },
            {
                "raw_content": "the hour hand is in the wrong spot but not too bad i guess",
                "author": "Big-Site2914"
            },
            {
                "raw_content": "Meanwhile... [https://imgur.com/a/q5cj8kt](https://imgur.com/a/q5cj8kt)",
                "author": "caughtinthought"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic Rejects Pentagon offer [Statement from Dario Amodei on our discussions with the Department of War]",
        "score": 360,
        "text_content": "https://www.anthropic.com/news/statement-department-of-war",
        "comments": [
            {
                "raw_content": "Good for Dario and co.",
                "author": "Ok_Elderberry_6727"
            },
            {
                "raw_content": "Based",
                "author": "InfernoBA"
            },
            {
                "raw_content": "Hope they win the AI race. They are not perfect, but at least they have some principles. Aside from that Claude is my favorite atm for coding and chat, although the usage limits are not the best.",
                "author": "Due_Ask_8032"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Undersecretary of War Emil Michael: “It’s a shame that Dario Amodei is a liar and has a God-complex.”",
        "score": 45,
        "text_content": "Holy crap! This is a tweet from the ‘Undersecretary of War’, Emil Michael, from his official DOD account. What the hell… I almost can’t believe this is real.",
        "comments": [
            {
                "raw_content": "Misgivings on being against Chinese AI and open source aside, my respect for Dario will shoot through the roof if stands his ground on this",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "What amuses me is the DOW's argument is basically \"Trust us to follow the law\". And then they act like unbelievable children you wouldn't trust with scissors. It's so funny the same people who refuse to release the remaining Epstein files and have sent masked men all over the US to round up immigrants, are incensed no-one trusts them to do the right thing. What a world.",
                "author": "finnjon"
            },
            {
                "raw_content": "One thing I've over the years is that these people always project. He describes Trump, but names Amodei.",
                "author": "trisul-108"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's happening",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://i.redd.it/w1chfoqfvxlg1.gif",
                "author": "BassMaster516"
            },
            {
                "raw_content": "No way their definition of \"Adult mode\" was just some horny mode right? I hope it at least eases up on the nannying where you can't talk about anything without getting lectured.",
                "author": "NyaCat1333"
            },
            {
                "raw_content": "I have felt that the porn industry has been awaiting a massive AI service for a while now, like it’s the elephant in the room and a goldmine but ofc industry leaders won’t be talking about it so openly. There are just too many problems to address with AI and porn but it’s inevitable",
                "author": "Sea_Relative_5719"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "France has just deployed an MCP server hosting all government data.",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats pretty cool. Wide access to offical gov data is pretty useful",
                "author": "Popular_Tomorrow_204"
            },
            {
                "raw_content": "wdym government data",
                "author": "AdventurousShop2948"
            },
            {
                "raw_content": "We should ask China to make one about the USA since they have all the data and USA would never be that transparent about what's supposed to be public transparent information",
                "author": "Due-Split9719"
            }
        ],
        "subreddit": "singularity"
    }
]