[
    {
        "post_name": "JUST IN: Homeowners in fire-ravaged Pacific Palisades say they’re now getting “noncompliance” notices in the mail over brush clearance inspections — even as their burned lots sit empty, waiting to rebuild.",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Setting the stage to seize the properties.",
                "author": "Jaqen"
            },
            {
                "raw_content": "They'll put a lien on the property and steal it.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "I hope the Don runs for Gov of California.",
                "author": "jedfag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kash Patel Responds to Criticism of His Celebration With Team USA Men’s Hockey: ‘Yes, I Love America’",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is the FBI director at the Olympics in the first place?",
                "author": "dontsteponsnek"
            },
            {
                "raw_content": "Kash is welcome to have the ragiest of the parties, just not on my dime please and thank you.",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "So he has time to attend a game, but not to arrest criminals. He says he loves the country but not enough to save it from lawlessness and ruin.",
                "author": "hillaryforprison"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iran 'a week away' from bomb-grade material, Witkoff warns as Trump weighs options",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait I thought that deep penetration bunker buster operation stopped all that?",
                "author": "chickeninoven"
            },
            {
                "raw_content": "They were a week away in 1991",
                "author": "awsure"
            },
            {
                "raw_content": "They've been saying this for 30 years and it's never been true. Now while I don't care if they get blown up I'm also not going to lie about this fact.",
                "author": "snakeoil"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Team USA Hockey Star Quinn Hughes Thanks Troops After Winning Gold",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're welcome. Sorry a lot of people didn't share in your incredible moment because of the bad behavior of your fellow Olympians.",
                "author": "airborne3502"
            },
            {
                "raw_content": "So cool. Mom is Jewish.",
                "author": "LaptopDied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HuffPost: ‘Waving the American flag is a turnoff’ - Jimmy’s Seafood: Go frick yourself",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is really the only rational response we should have for the left on any issue. They are either too fucking retarded to understand or too evil to care about anything else we could say.",
                "author": "Filo76"
            },
            {
                "raw_content": "Proper response",
                "author": "Yignuced"
            },
            {
                "raw_content": "But waiving the Mexican flag and the Faggit flag isn't? Go fuck yourself is right.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PANIC ON THE LEFT: Two Republicans Surge to the Top in California Governor’s Race — Democrats Fear Jungle Primary Vote-Splitting Could Hand GOP a Stunning Victory",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the totals come in, Democrats 51%, Republicans 49%.",
                "author": "Trump454748"
            },
            {
                "raw_content": "Don’t do that. Don’t give me hope.",
                "author": "NoClueForAName2"
            },
            {
                "raw_content": "Dumb. Not gonna happen",
                "author": "Schroeder09"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow, retarded article of the day 🏅",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You are not alone, and you are 'tarded.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "My daughter is 16, beautiful and totally knows and thinks this is Gay as fuck! Thank you God!",
                "author": "john9985"
            },
            {
                "raw_content": "You aren't alone, you belong to half the globo-homo, shitskin, tiny hat wearing, non-english degenerate marxist that don't belong here yet call yourself \"Americans\".",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leavitt on Third Attempt to Assassinate President Trump : DEMOCRATS TO BLAME FOR THE HATE",
        "score": 935,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop blaming. Start ARRESTING!!!",
                "author": "Lurkermon"
            },
            {
                "raw_content": "This is the 3rd assassination attempt *that we know of.*",
                "author": "McFatty7"
            },
            {
                "raw_content": "Mockingbirds will call for the right to \"turn down the temperature\"",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚔️ ALERT: Mexican Narco Drug Cartels have 𝘿𝙀𝘾𝙇𝘼𝙍𝙀𝘿 𝙒𝘼𝙍 on the Mexican and US governments after their Drug Overlord is killed in joint operation. All Americans in Mexico have been ordered to shelter in place!!",
        "score": 1260,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so they have chosen FO. you have chosen...poorly",
                "author": "blueeyephoto"
            },
            {
                "raw_content": "Now it's time to use those beautiful Reaper drones, permission not required.",
                "author": "knnbccb"
            },
            {
                "raw_content": "They have put a hit on Claudio shitbaum already. Mexico is at a heightened risk of a coup. These cartels are as powerful as the Mexican land armies if not more. If Mexico uses their airforce it would be a different story What a good time to have a secure border",
                "author": "FBJ_WoodChipper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The U.S. deported a gay asylum-seeker to a third country where homosexuality is illegal",
        "score": 1049,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't act gay and you'll be fine",
                "author": "hughjasske69"
            },
            {
                "raw_content": "He'll enjoy the diversity there. There's no evil White people.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They all claim to be gay for asylum. They lie.",
                "author": "NYforTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Heterosexuality extends it's two billion year long winning streak against faggotry yet further",
        "score": 1572,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"When I was a child, I spake as a child, I understood as a child, I thought as a child: but when I became a man, I put away childish things\" -- 1 Corinthians 13:11",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Raccoon girl is based? Nice.",
                "author": "HairOfTheDoge"
            },
            {
                "raw_content": "Based",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canadian bobsled. 1 time use per athlete.",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is wonderfully dark.",
                "author": "NeoDragoon"
            },
            {
                "raw_content": "Imagine one of the last things you see is a cringey Carl Sagan quote. This is so fucking strange.",
                "author": "SimaYi"
            },
            {
                "raw_content": "Whites only?",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The last biggest fillabuster the Dems ran was in 64 I think, it was trying to stop the civil rights bill.",
        "score": 1185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rosa Parks was a psyop",
                "author": "CaptainQirk"
            },
            {
                "raw_content": "Implying the civil rights act wasn’t an absolute disaster for this country.",
                "author": "Viewer01"
            },
            {
                "raw_content": "The civil rights act was one of the worst things to ever happen to this country. Well, aside from not castrating the slaves, and not either sending them all back or killing them after they were set free",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KEK",
        "score": 1142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is fucking KEK. Man if this is your meme - you da man!",
                "author": "frenacrossthepond"
            },
            {
                "raw_content": "Well played. Well played indeed.",
                "author": "MeatShield72"
            },
            {
                "raw_content": "There is so much wrong with this meme. And so much right. Very mixed emotions about it.",
                "author": "wbarmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thomas Pritzker, Kathy Ruemmler, Sultan Ahmed bin Sulayem, Brad Karp, Mona Juul, Peter Mandelson, Miroslav Lajcak, Jack Lang, and David A Ross... - All The Key Figures Who Have Resigned Over The Epstein Files - So Far",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Resigned? Why not arrested?",
                "author": "Trumpymctrumpface"
            },
            {
                "raw_content": "Cool, cool...when does the woodchipping begin?",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "RESIGNING IS NOT GOOD ENOUGH. NOT BY A FUCKING LONG SHOT.",
                "author": "Reassess_Reevaluate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If Lebron had his teeth knocked out, he'd take the rest of the season off.",
        "score": 519,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a funny feeling he's still going to get Laid.",
                "author": "Trumpdeasses"
            },
            {
                "raw_content": "Lebron is a faggot",
                "author": "202_"
            },
            {
                "raw_content": "for Hockey players missing teeth is a badge of honor.",
                "author": "TheGreenDragon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We completely broke them",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just for awareness. The flag is half mast because of the tran shooter last week.",
                "author": "PMSocks"
            },
            {
                "raw_content": "Is the flag half mast to mourn the children murdered by that tranny, or is it to mourn Canada losing to the US at hockey in the Olympics?",
                "author": "AgnosticTemplar"
            },
            {
                "raw_content": "Fuck off, Canada 🖕",
                "author": "Trumpwonbidencheated"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "51% of LEGAL immigrant households are utilizing the welfare system in America. This is no better than when illegal immigrants do it. America does not need to host tens of millions of legal immigrants on public assistance. Mass immigration = bankruptcy",
        "score": 357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t understand this. When my wife immigrated we had to sign a affidavit stating that she would not use public assistance for her while she was on immigrant status. Now, as a citizen, she still doesn’t take public assistance because it is immoral to do so if you don’t have a true need. We helped finance all the fraud, yet don’t benefit at all. Enough to radicalize someone against the entire immigration system.",
                "author": "GhostOfTheRepublic"
            },
            {
                "raw_content": "Start by getting rid of the illegals. Then audit the legal immigrants on welfare and trim that part down. Follow by giving the rest 6 months to get off or get out. The argument is, of course, that they came here for the purpose to get on welfare not available in their own countries. ~ 22 Feb 2026",
                "author": "FreeFire"
            },
            {
                "raw_content": "When my grandparents came post WWI they had to be sponsored and the sponsor had to sign a promise that they would not become wards of the state…. No welfare back then. You learned english and got a job or starved",
                "author": "Nomad899"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mexican cartels are now ATTACKING civilian buildings in Mexico after a Mexico/US mission kiIIed a cartel leader in the country.",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dirty fuckers. I bet they didn't even have a membership there!",
                "author": "Lower"
            },
            {
                "raw_content": "Such little respect for their country and countrymen…. It’s no wonder they do the raping and pillaging they do in ours.",
                "author": "DeplorableNeandertal"
            },
            {
                "raw_content": "Should’ve taken Sheinbaum when we took Maduro.",
                "author": "CocaineShark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mollie: \"Being a left-wing extremist sounds utterly exhausting, miserable, and empty. #USA\"",
        "score": 645,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a bunch of ass-holes.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "No one hates the United States more than the people who refuse to leave it.",
                "author": "L74ge9wr"
            },
            {
                "raw_content": "Link - https://twitter.com/MZHemingway/status/2025693742867308940",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dell's new prebuilt PC has special custom power connector for Nvidia GPU — even large OEMs apparently fear the 16-pin power connector meltdowns",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because Dell can't blame buyer for \"bad assembly\" if it burns down something.",
                "author": "maarcius"
            },
            {
                "raw_content": "That's still 12V-2x6, but with an improved retention mechanism.",
                "author": "The-ComradeCommissar"
            },
            {
                "raw_content": "This is the largest vote-of-no-confidence in this connector yet. It is abundantly clear that this connector is not fit for purpose.",
                "author": "Winter_2017"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CXMT halves DDR4 prices as YMTC gains ground in NAND, raising concerns over Korea’s legacy exposure",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To the surprise of.....almost no one",
                "author": "igenicoOCE"
            },
            {
                "raw_content": ">Raising Concerns Surely one cant be that tone deaf.",
                "author": "Sevastous-of-Caria"
            },
            {
                "raw_content": "Cool, now let's do this for DDR5!!",
                "author": "its_not_real1947"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ComputerBase] AMD Radeon HD 6950 1Gb retest after 15 years (vs. GeForce GTX 560 Ti) (German)",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "title is wrong, the results are from 15 years ago lol",
                "author": "Conscious-Sound1386"
            },
            {
                "raw_content": "Disgusting article, they don't even list the games tested or if they tested games at all... They just say (translated): \"In the benchmarks\" so I'm assuming they just did synthetic tests?",
                "author": "AreYouAWiiizard"
            },
            {
                "raw_content": "I was so happy when I got the GTX 560 Ti back in the day,coming from a AMD 4850 (which didn't have enough juice for 1080p gaming) But unfortunately it got outclassed very quickly in newer games and I regretted not getting the GTX 580 instead.",
                "author": "Sictirmaxim"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[HWCooling] Thermalright TL-B14 in a wide comparison of 140 mm fans",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Repost of a review in August 2025?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[der8auer] This Outstanding Cooling Technology Might Have No Future",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spoke to the guys from Lynk+ at Gamescom and CES and they made rapid progress betweens the shows. This is definitely for a specific crowd but the best version of full AIO loops yet.",
                "author": "winterbegins"
            },
            {
                "raw_content": "G12 kraken + cheapo 140mm aio was the meta for the 1080Ti, mine ran completely silent for years",
                "author": "Ok_Fish285"
            },
            {
                "raw_content": "I can’t fathom why anyone would buy this, at this point just do a custom loop, it’ll likely be cheaper and better.",
                "author": "dd3fb353b512fe99f954"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lenovo expects to make pricing changes to certain commercial client device products in early March due to the ongoing global memory chip shortage",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess sales is gonna go down but profit margin isnt gonna increase due to rising ram cost. These AI companies starting to hit OEM, businesses not just individual consumer.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "I'm confused at this point if we really need an article like this for every single seller on the planet. There's a new one every day or two and there's not really any useful information in any of them that I've seen. \"Market forces affect people who sell in market, news at 11.\" I guess it's not like I think the news articles shouldn't be here, but it just feels silly to have one article per manufacturer drip-fed over a several-month span. Nobody is escaping the shortage unscathed.",
                "author": "Jiopaba"
            },
            {
                "raw_content": "What the hell are pricing \"changes\"? They're going to hike everything up like crazy.",
                "author": "feldmazb"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Which vaporware tech breaks your heart the most",
        "score": 21,
        "text_content": "Personally, mine is those phase change cooler designs we've seen over the years, like CapTherm's MP-1120 or Der8auer’s Phase-Shift Cooler. If a descedent of either had been an option for my current build... it would have been at least *considered*. They're so *pretty* and they perform well too.",
        "comments": [
            {
                "raw_content": "Sandia's spinning metal heatsink. They made it seem like the sink could be so much smaller by reducing the air barrier on the fins but at least one company produced one and it wasn't great. Outside of PCs, Aptera's vehicle. I enjoy efficiency and that takes it to the max.",
                "author": "Jumpy_Cauliflower410"
            },
            {
                "raw_content": "I think some on this thread are confused by the word vaporware. It's things that are announced but never released. If you produce it and it flops, that's not vaporware.",
                "author": "Tasty_Impress3016"
            },
            {
                "raw_content": "Google's Project Ara. Reduce e-waste and build your own upgradable phone out of Lego-like parts. It makes me so upset every time I think about the future we could have had.",
                "author": "CirkuitBreaker"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Did The Legend of Zelda seriously not get anything for its 40th anniversary?",
        "score": 1669,
        "text_content": "How does it make sense to reach the 40th anniversary of one of your biggest franchises that has gotten way more popular in recent years and not have even a small celebration? Not even a Twitter post saying happy anniversary! I don't know, maybe we as Nintendo fans are just spoiled lol",
        "comments": [
            {
                "raw_content": "Nintendo never celebrates the Zelda anniversary in the same day as the actual anniversary. They will do something later this year.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Nintendo has never been that big on celebrating the anniversaries on the day of. Yes, it's a little strange that even social media was quiet about it, but they still have the rest of the year. I'm expecting something come summer.",
                "author": "No-Conference831"
            },
            {
                "raw_content": "Yeah it's the year not the date that matters. They don't say anything all year then have a sad.",
                "author": "dagutens"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Persona 5 on switch 2 desperately needs an update",
        "score": 145,
        "text_content": "I thought I could ignore the low res but this so so bad 😭😭atlus please give us an upgrade",
        "comments": [
            {
                "raw_content": "Monkey's paw situation with Atlus, honestly. You'll get a barely upgraded S2 Persona 5, but it won't be an upgrade, it'll be a standalone version you'll have to pay RRP for all over again.",
                "author": "crocicorn"
            },
            {
                "raw_content": "Oh, Atlas will. And they'll charge another $70 for it too. Persona 5 Royal Edition Switch 2 Edition",
                "author": "Valiant-For-Truth"
            },
            {
                "raw_content": "Sega would never miss the chance to charge $70 for this",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are we going to see other names than just \"switch 2 edition\" going forward?",
        "score": 64,
        "text_content": "Feels like Ys Proud Nordics being not named \"switch 2 edition\". Im all on this naming scheme. Just having \"switch 2 edition\" is so bland.",
        "comments": [
            {
                "raw_content": "\"Switch 2 Edition\" is a special title that Nintendo requires developers to put in the titles of their games under specific circumstances. More specifically it HAS to be a Switch 1 title that uses the upgrade pack system to enhance itself for Switch 2. So a native Switch 2 release/game with no upgrade path is not eligible for the name.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "\"Nintendo Switch 2 Edition\" is an actual proper term that refers specifically to Switch 1 games + upgrade packs, but a lot of people aren't really it using correctly, so it can get confusing as to what a game actually is.",
                "author": "2005KaijuFan"
            },
            {
                "raw_content": "I think if the game is being upgraded from an original version than Switch 2 Edition is a great indicator. Your example is great but also look at Final Fantasy VII Remake and Rebirth",
                "author": "TraditionMany3678"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I 3d printed a prototype frame for the virtual buy cardboard for an unused meta 3 headband",
        "score": 17,
        "text_content": "its not perfect fitting and the print wasnt perfect either, but did hold pretty well hands free on the head. i need to stick more velcro tape around the face area for the pads, but the switch 2 is kinda front heavy so u wont be able to play long vr sessions 😅",
        "comments": [
            {
                "raw_content": "The headstrap is key, nice you don't have to be in a fixed position to play",
                "author": "WinterStarlightZone"
            },
            {
                "raw_content": "Haha that’s sick. Remember BTOW and captain toad have VR modes, they look a bit better on the switch 2 screen",
                "author": "RickyWinterborn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Mario Tennis Fever and MKW effect",
        "score": 113,
        "text_content": "It’s kinda interesting. When MKW came out I was initially super disappointed. I thought the driving felt way worse than MK8 and the course design was nothing to write home about. But then once I sank my teeth into it, I realized how much better everything was and it made MK8 feel stale and lifeless. Same thing happened to me with Mario tennis. Maybe all the bad reviews contributed as well, but when I booted it up the first few times I thought the feel of the gameplay was much less satisfying and the mechanics way less compelling than Aces. But as I’ve played more the fun has really sky rocketed and I know think it blows Aces away. Seems like this may be a trend with the games of this generation. But I just found it kinda interesting.",
        "comments": [
            {
                "raw_content": "I don't think its a trend per se, and more that players (and that includes reviewers) are being too quick to judge new games nowadays, and that might be fueled by the higher prices, which causes some irrational bias on many people, and leads them to judge the book by its cover / just the first few chapters.",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "I also felt disappointed in the Mario Kart World when I got it. The controls, and specifically drifting, required a large shift in my automatic motor controls, which made it feel wrong. However, I continued to play despite my initial irritation. Now I’m around 100 hours in, and I have to say that I really love MKWorld. It’s not perfect, but I don’t think MK8 was either. World vastly improves Mario Kart’s maneuverability and skill ceiling, and I think that’s awesome. It feels nearly limitless in the game. Mario Tennis Fever is good too. Much better than Aces, in my opinion. But at the end of the day, it still feels like a forgettable title. Essentially every Mario sports title has felt forgettable since Mario Super Sluggers (which I still play even to this day).",
                "author": "i_can_hear_the_world"
            },
            {
                "raw_content": "The online culture around videogames is exhausting. I'm not saying Mario Tennis is perfect-it certainly isn't, but it's loads of fun and I'm glad I got it.",
                "author": "Swimming_Progress665"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "They Fixed It - Skyrim Anniversary Edition - Switch 2's New Patch 1.2 Is a Huge Improvement - YouTube",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rare Bethesda W fixing a lot of the issues",
                "author": "goro-n"
            },
            {
                "raw_content": "but I thought the Switch 2 \"couldn't run this at 60 FPS\" lol",
                "author": "foxwhisper85"
            },
            {
                "raw_content": "Turning down the settings instead of fixing their broken ass crap is still pretty much a no from me",
                "author": "shutyourbutt69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Monthly sales estimates from VGChartz for January 2026. Approximately 41% of Switch 2 sales were from the Japanese market!",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Poor Xbox",
                "author": "MasterShakePL"
            },
            {
                "raw_content": "would be surprised if we see another xbox generation",
                "author": "Overall_Swordfish883"
            },
            {
                "raw_content": "VGC charts are speculation, not real numbers.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "TheGhostofHope: Modern Warefare 4 was supposed to be a launch title for the next Xbox, standalone zombie's game perhaps in development, Microsoft wants Activision to be more agile and less reliant on annual releases.",
        "score": 516,
        "text_content": "EXCLUSIVE: Sources indicate to me that the delay on the next Xbox has \"hurt\" a lot of CODs marketing plans as they wanted Modern Warfare 4 to be a launch title and draw a lot of hype to compete with peoples attention alongside GTA VI. Because of this delay, the idea of two Call Of Duty games launching with the next Xbox has been floated. A traditional Call of Duty multiplayer and a standalone Zombies title presumably developed by Treyarch. Likely similar to that of Infinite Warfare and Modern Warfare Remastered where both released together. Microsoft want Activision to be more agile and less attached to annualized releases in the future. The consensus is that a more quick and coherent product/development pipeline would have allowed them to cash in on the extraction shooter hype sooner with a DMZ update for example. [Hope (@TheGhostOfHope): \"EXCLUSIVE: Sources indicate to me that the delay on the next Xbox has \"hurt\" a lot of CODs marketing plans as they wanted Modern Warfare 4 to be a launch title and draw a lot of hype to compete with peoples attention alongside GTA VI. Because of this delay, the idea of two Call Of Duty games launching with the next Xbox has been floated. A traditional Call of Duty multiplayer and a standalone Zombies title presumably developed by Treyarch. Likely similar to that of Infinite Warfare and Modern Warfare Remastered where both released together. Microsoft want Activision to be more agile and less attached to annualized releases in the future. The consensus is that a more quick and coherent product/development pipeline would have allowed them to cash in on the extraction shooter hype sooner with a DMZ update for example.\" | XCancel](https://xcancel.com/i/status/2025670143184101532)",
        "comments": [
            {
                "raw_content": "I wonder how much the next Xbox is gonna cost if the PC rumours are true, probably at least $1000",
                "author": "Slay_23"
            },
            {
                "raw_content": "The next 3-6 months of Xbox will be fascinating.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "I’ll believe it when I see it. I remember when Microsoft were fighting the court case with FTC the idea was floated around that Microsoft would make a change to the annual COD release…",
                "author": "Stoned_Gandalf420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Greg Miller: Phil Spencer’s retirement was not planned",
        "score": 2042,
        "text_content": "“I’ve been passed something that again reiterates to me, i’m not going to read it, this was not planned” [Phil Spencer Retiring, Sarah Bond Out - Kinda Funny Games Daily Special Edition](https://www.youtube.com/live/BUWkigmw3ns?si=HJ5KQ21Y3viD7IGd&t=2632)",
        "comments": [
            {
                "raw_content": "Microsoft: \"Hey Phil, congratulations on your retirement next week!\" Phil Spencer: \"Excuse me?\"",
                "author": "Wassermusik"
            },
            {
                "raw_content": "You also can probably infer that Sarah Bond left because she was passed over for the job as well.",
                "author": "pgherg1"
            },
            {
                "raw_content": "Obviously, a Retirement plan is meant to be months in advance, this is obviously Xbox forcing him out by saying he's retired.",
                "author": "LorDeus71"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Akira Yamaoka is not scoring SH Townfall, but is already working on SH1 Remake",
        "score": 110,
        "text_content": "Someone in r/silenthill [recently met](https://www.reddit.com/r/silenthill/comments/1rbu78r/akira_show_san_diego/) with Akira Yamaoka and asked him about his involvement in the upcoming Silent Hill games. [He said](https://www.reddit.com/r/silenthill/comments/1rbu9ne/akira_not_working_on_townfallis_working_on_1/) that he's not working on Townfall, but as we expected he is returning for the Silent Hill Remake.",
        "comments": [
            {
                "raw_content": "I assumed someone from Screen Burn would be scoring Townfall anyway. Glad to see Yamaoka is on the remake tho.",
                "author": "FewWatermelonlesson0"
            },
            {
                "raw_content": "Is Silent Hill 1 as good as 2? I’ve only played the 2 remake.",
                "author": "FromChicago808"
            },
            {
                "raw_content": "is bloober also developing sh1 remake? thought they were doing layers of fear 3",
                "author": "5trials"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "LinkedIn of Castlevania: Belmont's Curse writer has some additional details on the game's development and potential narrative",
        "score": 153,
        "text_content": "[Shout out to the guy on the Castlevania subreddit for finding this](https://www.reddit.com/r/castlevania/comments/1rac9ke/the_narrative_of_castlevania_belmonts_curse/). Marie Rouzié recently [updated her LinkedIn ](https://www.linkedin.com/in/marie-rouzi%C3%A9-a29540a4/)to display that she was hired as the **Senior Narrative Writer/Designer** at Evil Empire for *Belmont's Curse* and despite the information being a bit more menial, it does reveal some additional details on both the development timeline of the game, as well as potential implications for the story itself, though the latter is still worded much more broadly: * Marie Rouzié was previously a narrative designer at Asobo Studio who worked on *A Plague Tale: Requiem* in 2021, as well as a narrative/quest designer for *Anno 117: Pax Romana* and *Assassin's Creed Shadows* more recently at Ubisoft. * Rouzié was hired by Evil Empire in **January 2022**, which importantly, means this game has at the very least been in development for 3-4 years and even predates Evil Empire and Konami's collaboration on the *Return to Castlevania* expansion for *Dead Cells*. It also very much lines up with that [October 2021 *Video Games Chronicle* report ](https://www.videogameschronicle.com/news/konami-is-set-to-revive-metal-gear-castlevania-and-silent-hill/)regarding Konami restructuring in preparation for their return to big-budget console/PC game development, which included *Castlevania* * If the listing is still representative of the final product in any way there will be a core cast of at least **25** characters including the unnamed protagonist from the trailer (and Trevor Belmont) * Her responsibilities entailed creating narrative systems with interactability and response to player choice, with reference to **dialogue systems** in particular; potential for dialogue trees? I think that's a first for *Castlevania* if that happens and would definitely be another example of \"Igavania\" style games deriving a lot of RPG mechanics/progression. This game will definitely have multiple endings so perhaps character interactions will influence outcomes of the story * Explicit reference to both being tasked with designing the main quest and **sub-quests** \\- So sub-quests tied to NPCs you encounter on the map are definitely back from both *Portrait of Ruin* and *Order of Ecclesia*",
        "comments": [
            {
                "raw_content": "See I knew from minute one of that Castlevania expansion for Dead Cells being announced that it was Konami basically testing the waters to see if a partner studio could help pick the series back up especially with how many indie developers and games have been so obviously influenced by the Igarashi-era games. The fact that they were already working on this before all of that even happened is not only amazing to know, but this is literally how Nintendo approached MercurySteam for Dread as well by contracting them for Samus Returns first",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "This has all the potential of being a real blockbuster. Very excited for this. Need to play a bit of catch-up in the mean time!",
                "author": "kodan_arma"
            },
            {
                "raw_content": "So not a miserable pile of secrets...any longer! Edit was for spelling",
                "author": "Much_Adhesiveness_88"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dragon Ball Xenoverse 3 accidentally leaked through a Youtube playlist name from Bandai Namco",
        "score": 450,
        "text_content": "People have discovered that a playlist from Bandai Namco Southeast Asia has the title Dragon Ball Xenoverse 3. It hasn't been changed yet so you can still see it for yourself: [https://youtube.com/playlist?list=PLO-07chH29Lr5k-4udJMz\\_Uw-U0H2MvVN&si=PC74\\_iP6iBbDynAw](https://youtube.com/playlist?list=PLO-07chH29Lr5k-4udJMz_Uw-U0H2MvVN&si=PC74_iP6iBbDynAw) **Update**: it has been taken down",
        "comments": [
            {
                "raw_content": "But if it is Xenoverse 3, why the whole weird project name reveal 🤔",
                "author": "Primerion-ken"
            },
            {
                "raw_content": "Guess John 1000 true identity is John Xenoverse the 3rd",
                "author": "NewTim64"
            },
            {
                "raw_content": "I always tougth it was xenoverse 3.",
                "author": "loonelywf"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tencent shuts down TiMi Montreal studio (was working on open-world game), founded in 2021",
        "score": 170,
        "text_content": "Rumours for this have been swirling but not posted to here. Tencent/TiMi representatives has yet to confirm or respond but former staff have posted about the closure. Labelled as rumour due to lack of statement from TiMi/Tencent https://www.gamefile.news/p/tencent-timi-montreal-closed \\> And now I’ve spotted that, on Friday, a programmer at TiMi Montreal posted on LinkedIn that the studio had officially closed. Workers had been aware this was coming “for some time,” they wrote, but added that “I am genuinely heartbroken that the public will never get to experience what this team was capable of producing.” https://kotaku.com/timi-montreal-tencent-closed-kaiju-netease-2000672641 \\> A studio in Montreal seemed to outsiders like the perfect way to scoop up talent from open-world adventure factory Ubisoft. That included Assassin’s Creed Valhalla creative director Ashraf Ismail, who joined TiMi in 2022 after being fired from Ubisoft following allegations around some of his personal romantic relationships. \\> But TiMi Montreal never announced a game it was making, or disclosed any co-development support it was providing on any recently shipped projects. TiMi’s L.A.-based studio Team Kaiju, which attracted former leads from Halo and Battlefield, ended up shutting down back in 2023. The retreat follows concerns about pricey development costs in the U.S. and competitors like NetEase cutting investment in a bunch of recent studio startups over the past couple of years.",
        "comments": [
            {
                "raw_content": "Not saying that Ubisoft is doing great, but all these studios that poached employees from Ubi Montreal are closing left and right. I expect many key employees to return to Ubi.",
                "author": "PunishedDan"
            },
            {
                "raw_content": "The industry is in a rough place and that's affecting everybody.",
                "author": "al_194"
            },
            {
                "raw_content": "Guess Chinese companies are learning what Japan did in that western studios are massively more expensive to maintain and the games essentially need to be generational hits to be worth keeping around",
                "author": "Johnhancock1777"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel’s ‘Unified Core’ Ambitions With Next-Gen CPUs Remain Intact as a New Job Posting Signals Further Progress on the Concept",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe its because I have had a few drinks... But is this not literally what they did with everything pre 12th gen? I have owned Intel cpu's since the Pentium 3! Hell they even have big core architectures on recent nodes with Xeon chips as well as even consumer level chips with things like the 14901KE!!!",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "I'm hoping this gets them to be competitive with ARM stuff but at they very least this could put them on par with AMD in terms of core IP. I think more recently however another large point of pain has been the mesh/uncore in desktop and especially server. So Intel has other problems to fix as there as well in order to be competitive. Hoping the timeline for this is before the end of the decade. Hoping that Coral Rapids in 2028 would use it, which coincides with when LBT claims that Intel can compete again in DC.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock lists NUC Ultra 300 BOX mini PCs with Core Ultra 5 325 and Core Ultra X7 358H",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "This affordable laptop has 32 GB RAM for cheap: Lenovo ThinkPad L16 Gen 2 AMD review",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ThinkPad are awesome and always \"on sale\" 😂",
                "author": "binarypie"
            },
            {
                "raw_content": "Unfortunately, affordable just means “hasn’t been raised yet”",
                "author": "M4rshmall0wMan"
            },
            {
                "raw_content": "Hawk Point rebrand. Not saying it’s a bad laptop but AMD’s current naming is… a mess.",
                "author": "burninator34"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock RX 9070 XT Taichi and PowerColor RX 9070 XT Reaper show highest service rates in retailer data",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have the Hellhound, and some noise started coming from the fans a few months ago. I played with a more aggressive fan curve then for a while and now it’s gone. If it’s something that I can rma I will when it comes back. It was quite audible",
                "author": "uneducatedramen"
            },
            {
                "raw_content": "I'm guessing the reaper is because of the fan bearing issue: [https://www.reddit.com/r/radeon/comments/1j62880/powercolor\\_reaper\\_9070\\_bad\\_fan\\_bearings/](https://www.reddit.com/r/radeon/comments/1j62880/powercolor_reaper_9070_bad_fan_bearings/)",
                "author": "TempletonPeck81"
            },
            {
                "raw_content": "Any chance it’s because these were at or below MSRP for a long time and simply sold more units? Edit - Nvm I was thinking of the Challenger model, which interestingly is not exceptional when looking at the chart in the article.",
                "author": "clownshow59"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "China-Only AMD RX 9070 GRE Yeston Waifu: Thermals, Gaming, Noise, & Benchmarks",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waifu adds +5% performance right out of the gate",
                "author": "Symphonic7"
            },
            {
                "raw_content": "I dunno why amd didn't release 9070 gre globally. It's perfect to fill that huge gap between 9060xt and vanilla 9070.",
                "author": "AciVici"
            },
            {
                "raw_content": "I still have no idea what I'm buying when it comes to Radeon. Their naming is 100% confusing. Nvidia makes sense, but then they silently downgrade their cards, but keep the same name (this started way back with the GTX 1060). Ugh. I'm sick of hardware these days. WAY overpriced for the performance you get & expect.",
                "author": "vBDKv"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New Home Sales Close 2025 with Modest Gains",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only shit being built now is stuff already in the pipeline. A builder would have to love losing money to start any new residential or commercial projects now.",
                "author": "Whole-Reserve-4773"
            },
            {
                "raw_content": "New home sales ended 2025 on a mixed but resilient note, signaling steady underlying demand despite ongoing affordability and supply constraints. The latest data released today (and delayed because of the government shutdown in fall of 2025) indicate that while month-to-month activity shows a small decline, sales remain stronger than a year ago, signaling that buyer interest in newly built homes has improved. The December NAHB/Wells Fargo Housing Market Index showed that 67 percent of builders used sales incentives, the highest percentage post-COVID. Builders offered an average home price reduction of 5 percent during December. Sales of newly built single-family homes declined 1.7 percent month-over-month in December to a seasonally adjusted annual rate of 745,000 units, according to the U.S. Department of Housing and Urban Development and the U.S. Census Bureau. This represented a 3.8 percent year-over-year increase. An estimated 679,000 homes were sold in 2025, down 1.1 percent from the 2024 rate of 686,000. A new home sale is recorded when a contract is signed or a deposit is accepted, regardless of the stage of construction. The seasonally adjusted annual rate reflects the pace of sales that would occur over a 12-month period if current conditions persisted. New single-family home inventory totaled 472,000 units in December, 2.7 percent lower than the prior month, and 3.5 percent lower than a year earlier. At the current sales pace, the months’ supply of new homes stood at 7.6 months, down from 8.2 months one year ago, though still above the six-month level that is generally considered balanced. Combined new and existing home inventory has edged lower in recent months, with total months’ supply declining to 4.0, reflecting slower construction activity. Meanwhile, inventory conditions in the existing home market have retreated after making gradual improvement in prior months. Moderating prices across both markets have helped support buyer demand amid ongoing affordability concerns. By the end of 2025, there were 128,000 completed, ready-to-occupy homes available for sale on a non-seasonally adjusted basis, up 8.5 percent from a year earlier. Completed homes accounted for a little more than a quarter of the total inventory, while homes under construction made up 51 percent. The remaining 22 percent of homes sold in December had not yet started construction at the time the sales contract was signed. Home prices showed further signs of easing in 2025. The median new home sale price declined 1.3 percent to $415,000 from $420,300 in 2024. Affordability improved at the lower end of the market, with 20 percent of new homes priced below $300,000. Thirty-four percent of homes were priced above $500,000, while the remaining 46 percent fell within the $300,000 to $500,000 range. Regionally, year-to-year new home sales were up 1.7 percent in the Midwest and 0.4 percent in the South but declined 4.9 percent in the West and 7.7 percent in the Northeast. https://eyeonhousing.org/2026/02/new-home-sales-close-2025-with-modest-gains/ https://www.census.gov/construction/nrs/current/index.html",
                "author": "SnortingElk"
            },
            {
                "raw_content": "It's because new homes cost less than used homes. Even if they are crappy builds.",
                "author": "Pyromelter"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Y'all how much of your income goes to housing right now ?",
        "score": 0,
        "text_content": "Update of mine for the past 2 months its is 61.43% and it says ‘risky’ 😅 Housing is already 35%, bills are high, but debt is okay. They say keep it under 30%, but with prices now… is that even possible? What about you guys?”",
        "comments": [
            {
                "raw_content": "Karma farming bot... https://www.reddit.com/r/Finanzen/comments/1p74b3k/how_much_of_your_income_goes_to_rent_or_mortgage/",
                "author": "Elincor"
            },
            {
                "raw_content": "What app is this?",
                "author": "OkKaleidoscope24"
            },
            {
                "raw_content": "Bought my house 4 months ago and I would say I’m at about 60%. Not ideal but with no spouse or kids I can be frugal in other areas",
                "author": "Carpe_the_Carp"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just with a single prompt and this result is insane for first attempt in Seedance 2.0",
        "score": 2407,
        "text_content": "9:16竖屏手机拍摄视角，真实路人直播录制画面，轻微手持抖动，自动曝光变化，对焦拉动，真实环境收音，远处城市天际线清晰可见。 一座靠近城市中心的机场跑道，背景是高楼林立的现代都市。一架大型双发宽体客运喷气式飞机正在低空进近准备降落，起落架已放下，引擎轰鸣声震撼。 就在即将触地瞬间，飞机机身开始出现机械结构重组—— 机翼折叠分解，机身板块滑动展开，复杂金属零件精准拼接，液压结构伸展旋转，齿轮与装甲片高速重构。 高度复杂工业级机械变形动画，真实金属材质，重量感十足，机械细节极其精密。 飞机完全变形成一台巨型金属机器人，落地瞬间震裂跑道，碎石飞溅，冲击波扩散。 机器人随后冲向城市，高速奔跑，脚步踩碎柏油路面，路灯倒塌，汽车被震翻，建筑玻璃破碎，烟尘弥漫。 超写实电影级画面，真实物理破坏系统，动态光影，粒子特效，震撼爆炸效果。 整体风格保持“手机实拍直播质感”，但拥有好莱坞级别视觉效果与IMAX级细节 I explained ChatGPT what I wanted and requested for prompt in Chinese and used the above Chinese prompt in Seedance 2.0",
        "comments": [
            {
                "raw_content": "The infancy of generative AI is over",
                "author": "Southern-Break5505"
            },
            {
                "raw_content": "My only complaint is that the panels went from white/blue to grey. Transformers always have pieces of their disguises visible when in humanoid form.",
                "author": "Interesting-Run5977"
            },
            {
                "raw_content": "Genuine question? Would Seedance be able to create this video if Transformers’ footage didn’t exist?",
                "author": "mojo-dojo_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "JUNE 2028. The S&P is down 38% from its highs. Unemployment just printed 10.2%. Private credit is unraveling. Prime mortgages are cracking. AI didn’t disappoint. It exceeded every expectation. What happened?​​​​​​​​​​​​​​​​",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Summary: This memo imagines a scenario in which rapid adoption of advanced AI greatly increases productivity while displacing large numbers of white collar workers. As companies replace labor with AI and reinvest profits into more automation, consumer demand weakens because fewer people have income to spend. This creates what the author calls ghost GDP, where output rises on paper but does not translate into healthy economic circulation. Over time, the imbalance spreads into credit markets, housing, and technology sectors, contributing to financial instability and recession. This piece is meant as a warning about structural economic risks from widespread AI integration rather than a precise prediction of the future.",
                "author": "jvnpromisedland"
            },
            {
                "raw_content": "RemindMe! 30 June 2028",
                "author": "wjfox2009"
            },
            {
                "raw_content": "not sure if they cover it, but a huge amount of the mortgages / real estate loans by value are in cities whos home values are high because they have high paying jobs. it will take very little for that to become a crisis. someone who took out. 30y loan on a sf house for 2m and gets knocked from 500k to 100k job is the equvilent of like 5 avg defaults, but worse because the job that allowed that 2m value is gone so the home owner is wiped out, and the bank has to eat a huge loss.",
                "author": "Healthy_Razzmatazz38"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Single vaccine could protect against all coughs, colds and flus, researchers say",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The annihilation of colds, flus and pneumonia would be saving 13.5 percent of the population and 85 percent of all OAP deaths. Nuts.",
                "author": "poesmadness"
            },
            {
                "raw_content": "would be wild if this actually works",
                "author": "asklee-klawde"
            },
            {
                "raw_content": "😳 Ill never cough again 😣 thought I had more time",
                "author": "kevinmise"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The ARC-AGI2 Illusion Of Progress: If Changing the Font Breaks the Model, It Doesn't Understand",
        "score": 215,
        "text_content": "Over the past few weeks, with the release of Claude Opus 4.6, Gemini 3.1 Pro, and Gemini 3 Pro Deepthink, all scoring a record-breaking 68%, 77%, and 84% on ARC-AGI2, I became extremely excited and started to believe these new models could kick off recursive self-improvement any minute. Indeed, the big labs themselves showcased their ARC-AGI2 scores as the main benchmark to display how much their models have improved. They must be extremely thankful to Francois Chollet. Because, without ARC-AGI2, their models would look almost identical to their previous models. >Excited to launch Gemini 3.1 Pro! Major improvements across the board including in core reasoning and problem solving. For example scoring 77.1% on the ARC-AGI-2 benchmark - more than 2x the performance of 3 Pro. https://x.com/demishassabis/status/2024519780976177645?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet One key data point kept bugging me. Claude Opus 4.5 scored 37% on ARC-AGI2, not even half the score of Gemini 3 Pro Deepthink, yet it has a higher score on SWE-Bench than *ALL* of the new models that broke records on ARC-AGI2. What explains such a discrepancy? Unfortunately, benchmark hacking. ARC-AGI2 is supposed to measure abstract reasoning ability and fluid intelligence. But unfortunately, a researcher found this: >We found that if we change the encoding from numbers to other kinds of symbols, the accuracy goes down. (Results to be published soon.) We also identified other kinds of possible shortcuts. https://x.com/MelMitchell1/status/2022738363548340526 >I worry that the focus on accuracy on ARC (evidenced by the ARC-AGI leaderboards and by the showcasing of ARC accuracy in Fronteir lab model annoucements) does not give the whole story. Accuracy alone (\"performance\") can overestimate general ability (\"competence\")... https://x.com/MelMitchell1/status/2022736793116999737 A simple analogy to understand how devastating this is: imagine you give a math exam to a student, and the format of the questions is red ink on white paper. The student gets a stellar score. But the moment you change it to black ink on white paper, the student freezes and doesn't know what's going on. Wouldn't that cause you to realize the student doesn't actually understand the material, and is instead cheating in some way you cannot figure out? It seems these big labs have trained their AIs so extensively on the specific format of these benchmarks that even slight changes to the format of the questions hamper performance. With all that said, I still think we will get AGI by 2030. We just need the radical new innovations that researchers like Yann LeCun, Demis Hassabis, and Ben Goertzel repeatedly mention.",
        "comments": [
            {
                "raw_content": "Regarding the math example, no I don't think it's quite like that. It's more like, suppose you ask a student to solve this quadratic by completing the square for x^2 + 6x + 4 = 0. And then you ask the student to solve the quadratic ax^2 + bx + c = 0 by completing the square It's literally the same problem but I (and most students learning it for the first time) would agree that the second one (which is deriving the quadratic formula) is significantly harder. I would agree though, that if a student can do the first but not the second, that they haven't \"truly understood\" the math. Here's the thing with ARC AGI 1 and 2 though... the test that you get as a human is not the same test that the LLM gets. You get a visual pattern. LLMs get a bunch of text encodings. Fundamentally they are the same problem. But if you did the ARC AGI test and we replaced the visual patterns with text encodings... **you will also score significantly lower**. Does that mean that you don't understand the puzzle?",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "of course the encoding matters. if humans had to take the arc test but formatted in json, the pass rate will plummet to zero. that doesn't mean our pattern matching intelligence is an illusion",
                "author": "ihexx"
            },
            {
                "raw_content": "The ink colour comparison makes it seem much worse than it is. It'd be a bit more like if the student has to now complete all the answers by writing everything upside-down and backwards.",
                "author": "NoCard1571"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The cost of sequencing human genome has fallen from $100M to under $100 in approximately 25 years",
        "score": 1158,
        "text_content": "Element Biosciences reportedly hit the $100 genome milestone (Feb 2026). **For context:** Human Genome Project (2000) cost ~ $100M and ~$1,000 genome achieved around 2014, it's now under $100 in ~25 years That’s a 1,000,000x cost reduction, far outpacing Moore’s Law. If this trend continues, personalized genomics becomes mass-market scale. Article + thread below. [Article](https://www.sandiegouniontribune.com/2026/02/19/scrappy-san-diego-startup-goes-toe-to-toe-with-gene-sequencing-giant-illumina/) [Thread](https://x.com/i/status/2024944415606022255) and [Progress Chart](https://x.com/i/status/2025265560901292279)",
        "comments": [
            {
                "raw_content": "I saw some mutterings that this $100 per ~~whole~~ coding regions of the human genome sequence machine doesn’t give a good coverage. But I haven’t investigated that claim. Not quite sure how people would already know by now, apart from manufacturer or technology reputation. It could also be that most of the cost is outside this $100 step, so it is not a fair comparison.",
                "author": "HenkPoley"
            },
            {
                "raw_content": "what the hell is moore's law doing here? and wtf happened in 2024?",
                "author": "Sekhmet-CustosAurora"
            },
            {
                "raw_content": "This is the worst mutilation of moore's law I have seen so far. The author should be punished.",
                "author": "Main-Lifeguard-6739"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree video with a bullet-time in it",
        "score": 12,
        "text_content": "[https://www.youtube.com/watch?v=eQpyvR-B7hc](https://www.youtube.com/watch?v=eQpyvR-B7hc)",
        "comments": [
            {
                "raw_content": "If it's true, meaning it's not some heavily edited footage that's been shot a thousand times, then we're screwed. In 5 years, no one will have a job.",
                "author": "Dagosta74"
            },
            {
                "raw_content": "After all those MMA fighters consistently humiliating Kung Fu masters, the Chinese have found a way to make Kung Fu cool again. Who is laughing now?",
                "author": "REOreddit"
            },
            {
                "raw_content": "Guys, I don't have a stage at home, and I'm not a warlord in the need of an army. I just need one durable but cheap fella, who doesn't suck 2 Megawatts per day through my electricity meter, to bring my trash out and scrub my toilet, who is not spying on me, and never will run into Aunt Martha's 18th century porcelain heritage showcase. So how much of too much am I asking?",
                "author": "kissthesky303"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic could surpass OpenAI in annualized revenue by mid-2026 (EpochAI)",
        "score": 305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "by around 2030 their revenue will be larger than the global gdp, crazy",
                "author": "EnvironmentalLong577"
            },
            {
                "raw_content": "You are literally extending the graph in straight line without thinking of how it works in real life. Anthropic today has an edge in developer circle. It’s more of a business LLM as more people use it for work related task than casual stuff like chatgpt users Do not assume that they can continue to dominate that space. When openAI first launched, everyone thought they would be the biggest AI company and now they have some serious competition I highly doubt anthropic can keep up with the momentum. This market is wide open for new players to come and take market share from leaders",
                "author": "BitterAd6419"
            },
            {
                "raw_content": "another useless graph.",
                "author": "Glad-Taro3411"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Finally crossed 75% on HLE & LiveCodeBench Pro with Gemini 3.1 Pro scaffolding",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much this cost compared with Deep Think",
                "author": "Glittering_Candy408"
            },
            {
                "raw_content": "I feel like Gemini has really bad internal scaffolding. I think Claude does much more on that front.",
                "author": "brett_baty_is_him"
            },
            {
                "raw_content": "Repo Link: [https://github.com/ryoiki-tokuiten/Iterative-Contextual-Refinements](https://github.com/ryoiki-tokuiten/Iterative-Contextual-Refinements) This is the system i built last year for solving IMO Problems with Gemini 2.5 Pro, I thought I'd generalize this and test on some other benchmarks and so here are the results. The cost for running is approximately 15-20x the times for running the same test on the baseline model. The prompts are available in the repo, The test configuration i used was: 5 Strategies + 6 Hypotheses + No red teaming + Post quality filter enabled + Iterative Corrections (Depth = 3) with solution pool. U",
                "author": "Ryoiki-Tokuiten"
            }
        ],
        "subreddit": "singularity"
    }
]