[
    {
        "post_name": "President Vladimir Putin of Russia has arrived in the United States.",
        "score": 1072,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pray for a peace deal.",
                "author": "mlp67"
            },
            {
                "raw_content": "Awesome. Russia and the US linked up would fucking savage the British globohomo euro slave world economy.",
                "author": "learntocode"
            },
            {
                "raw_content": "Please tell me he brought a load of hot women with him, because we really need hot women desperately.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "General Mike Flynn: NOT GOOD THE NIGHT BEFORE PEACE TALKS BEGIN…JUST DUMB!",
        "score": 955,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More proof Ukraine wants the war to continue. Bunch of faggots.",
                "author": "Mitzhatzmakoph"
            },
            {
                "raw_content": "Likely ordered by Lindsey Graham and his friends in the MIC",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Utterly predictable",
                "author": "ramennov"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump has surged 14 POINTS in the eyes of Americans in handling of crime - even CNN is now warning Democrats. \"Democrats have to get it around their heads - Americans are FAR MORE hawkish on crime than they think that they are.\"",
        "score": 1266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The real question is why does CNN think, even for a second that we WOULDNT be against crime ? We pay the penalty on both ends of it.",
                "author": "FlyCatcher94"
            },
            {
                "raw_content": "Dems know average people want to end crime but their playbook is to convince Americans that their is no crime in blue cities.",
                "author": "MAGA_NRG"
            },
            {
                "raw_content": "Democrats are the party of criminals, freaks, and perverts and America is finally coming to realize that. They can see the difference, night and day. All we needed was a new President.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Subway sandwich throwing flamingly gay FORMER DOJ attorney is absolute proof that a lot of lawyers are actually straight up morons. It's very weird and unfortunate they run the world (they do, seriously).",
        "score": 1253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ever get the feeling that maybe \"normalizing\" gays was a bad idea? Maybe there was a good reason that homosexual activity used to be illegal.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "They have gotten comfortable sitting in cozy offices, doing nothing while living lives of indulgence on our dime. It ends now.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Alphbetmafia PARADE Participant. HOW MANH MORE are in the DOJ?",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WE HAVENT PUSHED FAR ENOUGH",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's all so tiresome.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Beginning to feel like England over here.",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Disgusting. Diversity winner.",
                "author": "Seeker_17"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Sends $$$ to Puerto Rico While Fire Victims Struggle to Rebuild",
        "score": 999,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's laundering.",
                "author": "schnazzmizzle"
            },
            {
                "raw_content": "Gavin sends money to NGOs claiming to help Puerto Ricans but actually laundering it back to Newsom and his Pelosi crime family operatives. In the interest of accuracy.",
                "author": "2008RonPaul2012"
            },
            {
                "raw_content": "Keep paying those state taxes sheep.",
                "author": "BoomShtick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⛪ Obama Judge Rules Little Sisters of the Poor Must Cover Contraceptives, Despite Previous SCOTUS Rulings 💊",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The federal courts are in open rebellion while both Congress and Roberts sits with their thumbs in their asses",
                "author": "RandyQuaidsBeard"
            },
            {
                "raw_content": "Great campaign ad, right here. Vote Dem. They bully nuns.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "This is another bit of district-court faggotry. It'll probably end at the appeals level, but the judge should be removed.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here's a better angle of the ICE presence at Newsom's press conference. I think there were more Feds than people in his crowd. Trump isn't letting this crook breathe for a SINGLE SECOND! Newsom is outmatched in EVERY WAY.",
        "score": 1148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But why isn't Newsom under arrest?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Awesome 🔥🦅🔥",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "I live in this shithole. Somebody said today \"you were handed the best weather, the mountains, the beaches, and you are fucking it up\"!! Couldn't agree more. Newsome is the most arrogant, greasy, bullshit artist I have ever seen. All he wants is power, doesn't give a shit about anything else. What a fraud. Somebody described him as Patrick from American Psycho.",
                "author": "Mona1950"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh, BOOO—I thought it would be actual bobcats, like from the zoo",
        "score": 1447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "mountain lions would be a better choice",
                "author": "patriotplus"
            },
            {
                "raw_content": "# THERES A FUCKING JUNGLE CAT IN THE BATHROOM",
                "author": "Justlooking250"
            },
            {
                "raw_content": "this makes a lot more sense. https://patriots.win/p/19BtBofXf6/breaking-crews-are-now-using-bob/c 😂🤣",
                "author": "empiretc"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Rep Delia Ramirez (D) tells MSNBC that HALF her family is \"undocumented.\"",
        "score": 1348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has anyone called ICE yet?",
                "author": "Illuminaughty"
            },
            {
                "raw_content": "Why do these morons feel the need to brag about their crimes?",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Deliberately target her illegal family members for deportation. And when she claims her people were targeted because of her publicly affirm it.",
                "author": "RandyQuaidsBeard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LA Mayor Karen Bass has a meltdown after federal agents conducted a raid outside of Gov. Gavin Newsom’s event in Los Angeles. “They decided they were going to come and thumb their nose in front of the governor’s face!”",
        "score": 1283,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, cause fuck you, that’s why cunt 🖕🏻",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "LOL, well played Homan, well plaaaayed.",
                "author": "auntjemima"
            },
            {
                "raw_content": "Hey Tom, you missed one!",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: A “suspicious white powder” has been found at the ICE detention facility in New York City A large emergency response is underway now.",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hunter Biden is enroute bringing a spoon and baking soda with him.",
                "author": "BartzFFV"
            },
            {
                "raw_content": "maybe it was just something Hunter left by mistake a couple years ago.",
                "author": "Bigbags01"
            },
            {
                "raw_content": "This is your Democrat party.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BOMBSHELL: President Trump just announced 12.4 MILLION names WERE on the Social Security Database over the age of 120!",
        "score": 1599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Follow the money and arrest!",
                "author": "Moistbreadcrumb"
            },
            {
                "raw_content": "Trump is taking Social Security away from Seniors CNN and ABCNews -",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "When their elderly parents die, many bury them in Mexico and don't supply death certificates to the state bureau of vital statistics where their parents resided. The checks keep coming.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In August 2024, Trump said he would do all these. Reminder, \"politicians\" NEVER do what they campaign on. Logical conclusion, Trump is not a lying POS politician",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nuke USAID fraud wasn't even listed",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "\"Because you'd be in jail\".",
                "author": "phibetared"
            },
            {
                "raw_content": "number 19 still needs more work to be counted",
                "author": "Trick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🦄 New Jersey Judge Freed Illegal Alien from Jail After He Was Charged with Killing Woman and 11-Year-Old Girl 🩸",
        "score": 1211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are judges who do this just gingerly walking out of courthouses with no accountability from citizens? It is weird man.",
                "author": "Judiwont"
            },
            {
                "raw_content": "Hopefully his \"residence\" address is specified in the order, and ICE can get hold of it and make an example out of him.",
                "author": "Deplora"
            },
            {
                "raw_content": "> After the initial charges were filed against Luna-Perez, Ocean County Superior Court Judge Wendel E. Daniels ruled against prosecutors’ wishes and allowed the illegal alien to be released from jail — requiring him to remain in his residence with an ankle monitor, banning him from driving, and demanding he undergo a substance abuse evaluation. Aaaaand the [activist judge is a fatigroe](https://scontent.fsan1-1.fna.fbcdn.net/v/t39.30808-6/485371166_1023267369993122_4547790175073134398_n.jpg?_nc_cat=102&ccb=1-7&_nc_sid=127cfc&_nc_ohc=8xtJMlF-UnoQ7kNvwHSZ1IW&_nc_oc=AdmLCC7A0Q7aVZMO-Dgl2kwBLhWM8ORrFgW1dEqJC2ThYBHx4GF67vvds8TrLi9dsEo&_nc_zt=23&_nc_ht=scontent.fsan1-1.fna&_nc_gid=HNJ_gVg6JdF_pgWFS9oB9A&oh=00_AfVxUjQUAsCHHupnqpHNvX6o9M2oTxb3sEMAQwYHNmnMiA&oe=68A404CE). EDIT: Had to change the link due to paywall fuckery. Got a BLM photo instead.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: \"If you're liberal, you're gonna have to change. If you're democrat, you're gonna have to change your ways.\"",
        "score": 1476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump causing crime to plummet in DC terrifies Democrats, because it shows that it is easy to do, and they would rather not do it.",
                "author": "ClaytonMagnet"
            },
            {
                "raw_content": "GEOTUS Donald J Trump is *by far* the *best President in American history!!* And we still have 3 1/2 *YEARS* left of his 2nd term!!",
                "author": "LokiHelmsdeep"
            },
            {
                "raw_content": "Nyt: Trump threatens to mind control enemies",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨NOW — @POTUS signs the Social Security Act to fix, promote, and safeguard Social Security, as well as remove the SS tax for a vast majority of our seniors! 👏",
        "score": 1454,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should’ve included a clause to allow us to opt-out of paying into social security in exchange for not receiving benefits. Better off investing instead.",
                "author": "SomeGuyWithAnAccount"
            },
            {
                "raw_content": "Signed by the human hand",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "Taxes in this country are absurd and out of hand",
                "author": "GoldenSpirals"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newly released footage shows the arrest of San Antonio Councilwoman Ivalis Meza Gonzalez for DWI. This was her SECOND DWI arrest, the first in 2010.",
        "score": 1272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are they incapable of driving without alcohol in them?",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Fat, drunk and stupid is no way to go through life.",
                "author": "NormalCitizen"
            },
            {
                "raw_content": "Foreign degenerates.",
                "author": "TheAftermath"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Embrace mockery, no matter how subtle, and have a good laugh.",
        "score": 420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He hasn't heard of the WNBA?",
                "author": "Electricutie"
            },
            {
                "raw_content": "Older Democrat here. I hung out with a lot of rainbows back in college. Thanks to Facebook, I was able to see them drop the rainbow over time. Men ended up married to women. Women ended up with me. One girl remained gay. Basically everyone moved on with more traditional relationships. Most of them refuse to be friends with me, because I know their past. I'm fine with dropping their past, but I understand they don't want that former life to seep into their current life.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Pro, amateur… I’m not even a spectator!",
                "author": "Zarghed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JB Pritzker Joins Police Force In Hopes Of Getting Sandwich Thrown At Him",
        "score": 518,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You threw food at Vito. That's gotta be resolved!",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "Never stayed at the Hyatt, never will.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I get to fuck some illegals up and get lunch tossed at me..... this job sounds awesome!",
                "author": "DadsTastyHouse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Report: AMD Now Commands One-Third of the Desktop x86 Processor Market",
        "score": 658,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ouch. A 20 point jump in AMD's desktop revenue share in one year is disastrous for Intel. And I'd guess the profitability figures, if we had them, would be even grimmer. Given they've ceded the profitable gaming, enthusiast and HEDT markets to AMD and are left supplying low-end chips for commodity corporate PCs Intel is probably not making much if any money on desktop parts.",
                "author": "Bombcrater"
            },
            {
                "raw_content": "The server situation finally *seems* to have stabilized, with Intel only losing 0.1% unit share and 1.5% revenue share. Shockingly, Intel in Q1 2025 lost more unit market share in server (2.1%) than they did in *all* of 2024. AMD managed to gain 4.2% unit and 4.9% revenue share in desktop. ARL clearly is not enough. Intel actually managed to claw back some share in mobile, gaining 2% unit and 0.7% revenue quarter over quarter. Their product lineup there seems to be pretty competitive. Interestingly enough, last quarter Intel claims that they have cut incentive payments due to their products being more competitive (and likely not having the money to continue doing so lol) and it seems like the impact in mobile, where I expect a bulk of the money went to, seems to be minimal.",
                "author": "Geddagod"
            },
            {
                "raw_content": "The DIY market is going AMD since a lot of them like games and the stacked RAM designs are better for that. Those have a halo effect for the rest of their line. Intel's also switching sockets every generation which comes with high costs, while AMD sticks with the same socket for multiple generations (not forever, but recently). Intel is also dealing with massive PR from their valtage spike issues in their 13th and 14th gen, and 15th gen is dealing with a performance disadvantage (it's not bad, but AMD is better). The voltage issues will also echo in the enterprise space and decision-makers used to AMD will be game to switch. I suspect this will continue next gen as this is a slow moving ship. With Nova Lake Intel should resolve some of these generational issues but AMD will continue to progress as well.",
                "author": "grumble11"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US weighs taking stake in Intel, Bloomberg News reports",
        "score": 141,
        "text_content": "Sounds like Intel may be getting bailed out.",
        "comments": [
            {
                "raw_content": "Well, I guess we know who just bought a ton of intel stock last week.",
                "author": "RayZzorRayy"
            },
            {
                "raw_content": "If they take a stake, they're going to arm twist companies to use Intel. Use Intel or we will.....",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Much better than a stake would be purchase guarantees, like Stratecherry suggested [well over four years ago](https://stratechery.com/2021/intel-problems/): >This also opens the door for the U.S. to start pumping money into the sector. Right now [it makes no sense](https://stratechery.com/2020/taiwan-and-techs-geopolitical-realities-arm-on-mac-tsmcs-choice/) for the U.S. to subsidize Intel; the company doesn’t actually build what the U.S. needs, and the company clearly has culture and management issues that won’t be fixed with money for nothing. >That is why a federal subsidy program should operate as a **purchase guarantee**: **the U.S. will buy A amount of U.S.-produced 5nm processors for B price; C amount of U.S. produced 3nm processors for D price; E amount of U.S. produced 2nm processors for F price**; etc. This will not only give the new Intel manufacturing spin-off something to strive for, but also incentivize other companies to invest; perhaps Global Foundries will get back in the game, or TSMC will build more fabs in the U.S. // and updated [in late 2024](https://stratechery.com/2024/intel-honesty/): >That free capital world is gone, and it’s probably not realistic for a startup to figure out how to manufacture the most complex devices humans have ever produced; the best idea at this point is a new company that has the expertise and starting position of Intel Foundry. Critically, though, it shouldn’t be at all beholden to x86 chips, have hundreds of thousands of employees, or the cultural overhang of having once led the computing world. The best we can do is purchase guarantees — on the order of hundreds of billions of dollars over the next decade — and a prayer that someone can make such an entity stand on its own. A stake incentivizes only more aimless bailouts that won't help Intel Foundry succeed as a Foundry with paying, profitable, and reliable customers.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Foundry's non X86 reference SoC on Intel 18-A | Intel",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if they fear to suddenly burst into flames when speaking out *ARM* loud... ;-) And yes, ARM is an educated guess and not confirmed - but what else would you \"port over\" to 18A ASAP to attract external customers...",
                "author": "x13y7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Foundry Advanced Thermal Interface (Waterblock as IHS)",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully we get to see consumer versions of this from intel soon. I recall there was some DIY attempt done on this before, where a solution like this will outperform your ordinary waterblocks because the cooling is much closer to the dies",
                "author": "jeeg123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel \"Lunar Lake\" Updated PL2 Setting Can Yield Up to 30% Higher Gaming Performance",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> In our retest, Cyberpunk 2077 and Space Marine 2 achieved nearly a 30% performance uplift with this setting. The Lunar Lake-based MSI Claw AI+ A2VM handheld is the highest-performing device we have tested across the board, even surpassing AMD-based devices in our testing suite. In other games, baseline improvement is set at 10%, just as Intel had notified. Our testing confirmed that Lunar Lake is now the most powerful gaming CPU for handheld devices.",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Lunar Lake is now the fastest handheld chip + has Xess. AMD will have to price their Z2 Extreme to account for this AMD is going to have a difficult time competing with Panther Lake with 12Xe3 cores since they only have gorgon and medusa point are rumored to not be that much better than Strix Point in iGPU performance. Then again, the handheld market is not high volume or particularly important as of now, and the 9800X3D is crushing the 285k in gaming on desktop and massively outselling it in the DIY space.",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "I don't understand how PL1=25W and PL2=26W can be 12% faster than PL1=PL2=30W.",
                "author": "Pamani_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Was USB supposed to be daisy-chainable (device to device) originally?",
        "score": 15,
        "text_content": "Hope this is okay to post here. I distinctly recall that in the years leading up to USB implementation, it was rumored that it would allow daisy chaining of devices, meaning that any given USB device would have 2 jacks, one for the previous device in the chain and one for the next device in the chain. Of course, we know that that's not how it works, outside of daisy-chaining hubs...does anyone else remember this early description of the (then still in-the-works) technology?",
        "comments": [
            {
                "raw_content": "That got dropped quickly because that always required a hub, but as the race to bottom (price) heated that feature went extinct.",
                "author": "ultrahkr"
            },
            {
                "raw_content": "FireWire did this IIRC",
                "author": "poohisface"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel Rolls Out “USAI” Web Page Showcasing Commitment to U.S. Manufacturing",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the US brand something they really want to latch on to now?",
                "author": "d1stor7ed"
            },
            {
                "raw_content": "'USAI' Chips made in Taiwan by TSMC.",
                "author": "Valkyranna"
            },
            {
                "raw_content": "Desperate times indeed",
                "author": "fibercrime"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ThinkPad E14 “Long Battery Life” Edition",
        "score": 2,
        "text_content": "**Source:** Translated & adapted from [this WeChat article](https://mp.weixin.qq.com/s?__biz=MzIxMTAyNjk0OA==&mid=2654684069&idx=1&sn=53851ff9f9b9cfc9eb49a3eb76552434&chksm=8d73d5ddd4bf991dd78d39fe56db3c0fad58a560245ff0ec156243f79b609b2953d46e35d2c6&scene=126&sessionid=1755239272#rd) by 笔吧评测室(Laptop Commentary Studio). **Quick specs:** * Intel Ultra 5 228V (Lunar Lake) * 32GB LPDDR5x 8533MHz (soldered) * 1TB PCIe 4.0 SSD (1 slot) * 14\" 2880×1800 IPS, 120Hz, 100% sRGB, \\~401 nits * 64Wh battery, 1.37kg * Dual Thunderbolt 4, RJ45, HDMI 2.0, USB-A ports * Price in China: ¥5,599 (\\~$770) after subsidies **Highlights:** * **Excellent I/O** for an ultrabook (dual TB4 + RJ45 is rare) * **Strong battery life** — 11h30m in simulated daily workload * **Quiet under load** — full load noise at \\~40dB * **ThinkPad after-sales** — 1-year on-site + global warranty **Drawbacks:** * Soldered RAM, limited storage expandability (1 slot only) * Thicker than most Lunar Lake laptops * Left-side keyboard area warms under sustained load (\\~44°C) **Performance & thermals:** Single-fan, single-heatpipe cooling. In stress testing, CPU stabilized at 84°C, 28W sustained power, P-cores at 3.0GHz and E-cores at 3.4–3.5GHz. Heat is noticeable on the left keyboard side, but palm rests stay comfortable. **Special feature – Microsoft “Recall”:** Thanks to Lunar Lake’s NPU (>40 TOPS), this is one of the first laptops to ship with Microsoft’s AI-powered “Recall” feature in China. It lets you search through your past PC activity with natural language, showing privacy-filtered snapshots of what you’ve seen — kind of like “photographic memory” for your computer. **Author’s verdict (translated):** For business users prioritizing portability, quietness, battery life, and ports, the E14 Long Battery Life Edition delivers solid value. In China, it’s one of the cheapest Lunar Lake laptops with a well-calibrated IPS display, decent build, and high-tier service. **My take:** If this version ever comes overseas at a similar price, it’s one of the most cost-efficient Windows ultrabooks you could get: long battery life, solid build quality (it’s a ThinkPad), rare LCD screen in a sea of OLED Lunar Lakes, and a good port selection. The only major limitation is that it might stay a China-exclusive — and if an international version launches, expect a big markup.",
        "comments": [
            {
                "raw_content": "* (\\~$770) after subsidies Yeah, there's the value proposition for export shot, especially to North America while we figure out distribution routes that don't involve the US. Regular duties, added tariffs, sales taxes... yeah.",
                "author": "got-trunks"
            },
            {
                "raw_content": "Isn't it a little odd to throw a 2.8k 120 Hz display at a laptop meant for long battery life?",
                "author": "0742118583063"
            },
            {
                "raw_content": "now get me an amd version and we are golden",
                "author": "Kubertus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Code suggests Apple is working on an M4 Ultra chip for new Mac Pro",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actually unfortunate if true. Skipping the M4 ultra could have put the M5 ultra on a closer schedule to the rest of the line up, but this would likely mean pushing it back again after the long wait for the M3 ultra. With the move to a tiled design for the M5 family you would think the high end chips wouldn't be very far behind as they would only require additional packaging instead of separate tapeouts.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "This wrong btw, T8152 is M6 which is what Macworld reported. T8142 is M5 and M3 Ultra is T6032 and M2 Ultra T6022. So a M4 Ultra would have been T6042. What Macworld found was references to the M6 SoC.",
                "author": "CalmSpinach2140"
            },
            {
                "raw_content": "they still care about the mac pro? the arm one was a huge flop.",
                "author": "randomkidlol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This text seriously needs to go",
        "score": 1883,
        "text_content": "It makes Switch 2 box art look even worse than it does already with the ridiculously over sized banner on top. What the hell is wrong with a simple sentence that says *SEE BACK FOR IMPORTANT DETAILS* ?? It looks so bad",
        "comments": [
            {
                "raw_content": "I don’t fuck with any game that doesn’t have 4 paragraphs of user end agreements on the front.",
                "author": "I_Heart_Sleeping"
            },
            {
                "raw_content": "They couldve easily solved it by having a reversible boxart. No clue why they havent done that already since you cant even see the art on the inside through the red plastic",
                "author": "super_tata1"
            },
            {
                "raw_content": "Yeah, it sucks, but Nintendo wasn’t willing to risk confusing everyday shoppers who don’t play video games themselves. Parents, grandparents, aunts, uncles, etc. They made it as clear as they could imo.",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Suprised how many switch 2s my walmart had today",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo prepped. We're just so used to companies trickling out consoles that it makes it seem odd.",
                "author": "NotMarkDaigneault"
            },
            {
                "raw_content": "I work at Walmart and it was a big deal especially on release day. They really went all in on Switch 2.",
                "author": "skyemblem16"
            },
            {
                "raw_content": "This is why the Switch 2 didn’t launch last year. They actually built up supply to meet the demand.",
                "author": "twili-midna"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Borderlands 4 coming without splitscreen",
        "score": 93,
        "text_content": "Screen capture taken from the official site. I was looking forward to splitscreen but with crossplay (friend is getting it for ps5) It should be fine :) I wish more games would offer real coop splitscreen though. Not a fan of having a second player with less abilities and freedom.",
        "comments": [
            {
                "raw_content": "Throwback to me and a buddy playing split screen Borderlands 1 on PS3 back in the day. I think it averaged 15 FPS ☠️",
                "author": "Nintotally"
            },
            {
                "raw_content": "Makes sense, Frame rate is already 30 it would probably be 15 in 2 player which is unplayable",
                "author": "skynovaaa"
            },
            {
                "raw_content": "I mean if baldurs gate 3 comes to switch 2 it will also not launch with spilt screen like on the series S. it really isn’t breaking news, shock the weakest platform has the weakest version. They also downgraded borderlands 3 spilt screen for switch 1",
                "author": "Dry-Cod9127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "was it worth it?",
        "score": 187,
        "text_content": "cant add what i got so ill post it in the comments",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/wbntt12r53jf1.jpeg?width=1920&format=pjpg&auto=webp&s=8cbd88923a4c02efa2a93c38e70b2598a0f89398 this is what i got",
                "author": "sag3y_"
            },
            {
                "raw_content": "That's one of the most Nintendo rewards ever. Kinda like how you only get a balloon shaped like DK's head when you get 1000 bananas in Banaza or Hestu's gift for getting all 900 korok seeds in Breath of the Wild.",
                "author": "angusrocker22"
            },
            {
                "raw_content": "Didn't even bother to put some music on this mode ?",
                "author": "walker7384"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza being Super Mario Odyssey tier suggests to me that Mario Kart World will get significant free DLC (hear me out)",
        "score": 235,
        "text_content": "Regardless of how much any individual may have enjoyed or not enjoyed Bananza (and I personally enjoyed it *a lot*), I don't think there can be any doubt it was from Nintendo's top drawer in terms of effort - which is what I mean by 'Odyssey tier'. Even if you didn't like it yourself, I think people can surely see this is just about as big as they are ever likely to go with a 3D platformer. But back before launch when Doug Bowser (and others) were being asked about MKW's $80 price tag, they kept talking about variable pricing and how they felt the content and value offered by the game justified such a high price. I'm sure I wasn't the only one who, therefore, assumed other big BIG games like 3D Mario or the next Zelda would also be $80. But then Bananza came out and it was *not* $80 - despite the fact it's now clear it is absolutely a big BIG game. So what is it that they actually think justifies the MKW price tag? Why did they think we'd end up considering it 'the richest Mario Kart experience we've ever had' (especially when 90% of people bought into Mario Kart 8 in its Deluxe version and so would have started from a base of 48 tracks)? Well, while I certainly wouldn't rule out paid DLC down the line as well, I'd say the only thing that makes sense is if they know it's going to be expanded on pretty massively for all players over the course (no pun intended) of its first couple of years. If Bananza had also been $80, I'd say, okay, they're just making their big games that price now. But since it wasn't, you've got to assume they see MKW as offering some sort of exceptional value - something well beyond what Bananza offers - and, as much fun as I've had with MKW, it's hard to see what they could think that is right now - however, it would make perfect sense as a claim if they know that in a year or two what we'll all have in our hands is a massively expanded version of what we have now. So yeah, DK Bananza being Odyssey tier means free MKW DLC. It all adds up! Source for quotes from Doug Bowser etc: [https://gameinformer.com/2025/04/07/nintendo-says-mario-kart-worlds-value-justifies-its-80-price](https://gameinformer.com/2025/04/07/nintendo-says-mario-kart-worlds-value-justifies-its-80-price)",
        "comments": [
            {
                "raw_content": "For all you know, they might have just inflated MKW to $80 just to make the launch bundle look like a good deal. So far it’s working, the bundle take up rate is significantly higher than standalone sales. How many people actually paid $80 for MKW? I think extremely small percentage of S2 owners, if there’s any at all.",
                "author": "ghim7"
            },
            {
                "raw_content": "It’s a game that around 70% of people who bought a switch 2 in year one will have. Which makes it a great way to advertise other new games with dlc. Playable Samus when Metroid prime 4 drops, splatoon courses, star fox courses if that gets a reboot. It’s an amazing way to promote other games to people who aren’t already fans since Mario kart has such broad appeal.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "I think it's more about what the biggest hitters are. You can probably expect the next Zelda, Animal Crossing, and Smash Bros to be $80.",
                "author": "kmfdm_mdfmk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My attempt at doing the macarena in draggy drive",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not bad",
                "author": "Adrian97c"
            },
            {
                "raw_content": "When dose this game come out",
                "author": "New-Path5884"
            },
            {
                "raw_content": "This is so cute 🥰",
                "author": "CalmStatistician1928"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"Is this Seat Taken\" is an absolutely amazing game",
        "score": 242,
        "text_content": "I am a huge puzzle/hidden object game fan, but it's a pretty niche genre. This past month, I picked up Captain Toad on sale, and thought 100%'ing it was going to hold my attention for the next couple of months, but I decided to grab \\*Is This Seat Taken?\", because it looked dirt cheap, and reminded me of one of Wife and Daughter's favorite games; Cat Crimes. Holy shit, what an awesome game. The aesthetics are perfectly \"Nintendo\", and it's such an awesome 'sit down with friends and figure this shit out' kind of game. It's absolutely perfect for game-share; there's no 'fast paced action' or need for high resolution to brainstorm solutions. We sat down yesterday and completed the first 2 cities 100% together. I guess I just want to put a little love for this game out into the community. It's a total joy.",
        "comments": [
            {
                "raw_content": "it caught my eye immediately in the Indie World, and my god was it worth the money. absolute wonder of a game!",
                "author": "TransitionOk1862"
            },
            {
                "raw_content": "I really wish this had mouse compatibility",
                "author": "Fun_Bridge_9869"
            },
            {
                "raw_content": "Does it work with the mouse?",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I am loving Drag X Drive. It's rediculously fun and the most inventive sports game I've played in ages.",
        "score": 45,
        "text_content": "I love the short matches, it makes the game feel way more fresh and avoids it from being slow and repetitive",
        "comments": [
            {
                "raw_content": "Nintendo ffs add a ranked system with rank rewards. The game would highly benefit from it.",
                "author": "torito602"
            },
            {
                "raw_content": "I dunno, having played it, it’s just more cumbersome Rocket League.",
                "author": "Front-Library5781"
            },
            {
                "raw_content": "Lol",
                "author": "RuskiStar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MGS Delta trophies leaked via Insider Gaming",
        "score": 128,
        "text_content": "[https://insider-gaming.com/metal-gear-solid-delta-snake-eater-trophy-list-all-achievement-trophy-differences-in-remake/](https://insider-gaming.com/metal-gear-solid-delta-snake-eater-trophy-list-all-achievement-trophy-differences-in-remake/)",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I hope this does well enough we get MGS1 next. I need more Shadow Moses",
                "author": "Rex_Power_Cult"
            },
            {
                "raw_content": "\"Achieve a camo index of 100%\" aight we need to enable the PlayStation Camera to take photos of random objects we can turn into camo patterns and hope one of them makes us practically invisible like the 3DS version",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sensor Tower: Mafia The Old Country sells over 800k units in first 5 days",
        "score": 481,
        "text_content": "Sensor Tower is a market research company that gives insight into digital and retail sales and trends [https://www.linkedin.com/posts/vginsights\\_mafiatheoldcountry-hangar13-2k-activity-7361305503299186688-QyHf](https://www.linkedin.com/posts/vginsights_mafiatheoldcountry-hangar13-2k-activity-7361305503299186688-QyHf) >Hangar 13’s latest entry in the Mafia franchise has enjoyed a strong launch, selling 800,000 units across Steam, PlayStation, and Xbox in its first four days. PlayStation leads the way with around 48% of total sales, while Steam contributes roughly one-third of the total. The game’s reception shows that both PC and console audiences have embraced the title, making for a successful multi-platform debut. Launch Highlights 💰 Units Sold: 800,000 ⏱️ Average Playtime: 8.8 hours 👍 Positive Reviews (Steam): 72.9%",
        "comments": [
            {
                "raw_content": "let's hope this is good enough to justify a mafia 4 in 70s vegas, we've been asking for that one for a while now",
                "author": "matajuegos"
            },
            {
                "raw_content": "I'm happy for them, it's not perfect (especially optimization) but we need more games like this from big publishers.",
                "author": "RinRinDoof"
            },
            {
                "raw_content": "That’s good to hear, just the gameplay needs to be modernized and less clunky. The story, acting and graphics are top notch!",
                "author": "kalil86"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TranZit returning in Black Ops 7 - Tom Henderson",
        "score": 102,
        "text_content": "In the latest episode of Insider Gaming Weekly, Tom Henderson talked about his recent Black Ops 7 campaign exclusive. Towards the end, he quickly mentioned that Tranzit will be back with Zombies this year...with a small twist. **\"Tranzit is coming back...in a much scaled up way but this time instead of a bus that drives you around, you're going to be able to do it yourself.\"** Source: [https://www.youtube.com/watch?v=f5CCq5c51\\_o](https://www.youtube.com/watch?v=f5CCq5c51_o)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Aww man… I always wanted good old TEDD to drive us around the map. I guess because Tranzit’s development, according to the BO2 docs, showed that Tranzit’s ideas are cool in paper but has some flaws (they wanted the Bus t9 break down randomly alongside a fuel mechanic…). And BTW, apparently, it turns out the Fog, Lava, and Denizens from the said BO2 leaked Docs revealed that these three features were always planned from the start instead of being forced in from console imitations.",
                "author": "DerpyBox"
            },
            {
                "raw_content": "There was something special about rushing to make the bus.",
                "author": "HydraTower"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Scooby Doo x Fortnite is happening this Halloween",
        "score": 156,
        "text_content": "https://xcancel.com/ShiinaBR/status/1956068207791333725?t=ySOZvkRTSe1iGw3t5g_OEA&s=19",
        "comments": [
            {
                "raw_content": "Zoinks Scoob, don’t shoot the gun!",
                "author": "MCUAvenger1992"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "Interesting note: a new companion/pet feature has been being worked on for awhile now and is suspected to release later this Fortnite season. This seems like a perfect series to tie-into the new mechanic if you ask me.",
                "author": "witheredBBfilms"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential Wukong DLC News at Gamescom",
        "score": 114,
        "text_content": "Might just be a Launch Trailer for Wukong dropping on Xbox but you never know. https://www.reddit.com/r/BlackMythWukong/s/ftBo6q1yIH",
        "comments": [
            {
                "raw_content": "This is Wukong not Wuchang yall lol.",
                "author": "SanchitoBandito"
            },
            {
                "raw_content": "there is rumour or confirmed news since last year, the dlc might be teased in august and since its dropping now on xbox its makes sense to tease dlc or even shadowdrop",
                "author": "CharlesKarol16"
            },
            {
                "raw_content": "i thought for a second this was wuchang the one that got the censorship patch but this is the monke game",
                "author": "matajuegos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson - Exclusive details on Black Ops 7's final Campaign mission",
        "score": 134,
        "text_content": "https://insider-gaming.com/black-ops-7-avalon-map-campaign/",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So it's basically going to be... DMZ? Such a weird choice...",
                "author": "AssassinsCrypt"
            },
            {
                "raw_content": "Microsoft should really just let one of the studios make that open world first person action RPG that they clearly want to make desperately without trying to ham fist it in to cod hell even let them make it in the cod universe but not a mainline game",
                "author": "Responsible-Cow-3548"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next Tales of remaster possibly leaked as Xillia",
        "score": 267,
        "text_content": "The Bandai Namco Europe page posted a video that appears to be slated for the 18th, but went live for a minute by accident. Some users were able to capture a screenshot showing the next remaster as Tales of Xillia. Video is to be released at 9:45AM EST on Monday for us here in the States https://xcancel.com/lowedeltaa/status/1955925606274658555?s=46&t=-CTqtoIqQF4ed8tLahCWKA Another post from a user on the r/Tales sub https://old.reddit.com/r/tales/comments/1mpy3ur/the_next_tales_of_event_and_the_next_remaster/ More evidence https://www.reddit.com/r/tales/s/CIbFls48dv Worth pointing out the video is titled \"Tales of Series News\" so perhaps a reveal of the next mothership title as well.",
        "comments": [
            {
                "raw_content": "I'm so happy with this news because Xillia introduced me to the Tale Of series It, FFTR and Raidou 1 remastered all in the same year makes me so happy I really hope we'll get FFXIII trilogy remastered at GamesCom",
                "author": "LadyValtiel"
            },
            {
                "raw_content": "Expected but I still wanted Abyss…",
                "author": "Megaclone18"
            },
            {
                "raw_content": "This was my first Tales game and I will be buying it again",
                "author": "Betrigan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "eFootball might be coming to Switch 2",
        "score": 109,
        "text_content": "Probably nobody cares about this, but one of PES dataminers, Durandil67 discovered that a platform named \"NOZ\" was added to the games code in the latest 5.0.0 update. If im not wrong, \"NOZ\" or \"Nintendo Ounce\" was Switch 2s codename. Source: https://xcancel.com/Durandil67/status/1955978895083139366#m For me it would be interesting to see how it would run compared to EA FC on NS2.",
        "comments": [
            {
                "raw_content": "Considering the absolute slop on the e shop lol I’m shocked is taken this long",
                "author": "Responsible-Cow-3548"
            },
            {
                "raw_content": "and the NSW before NOZ? Look like NSW mobile version and NOZ \"normal\" version",
                "author": "h-raki"
            },
            {
                "raw_content": "The only worth this might have is maybe being on a general direct. Appreciate your effort digging this though.",
                "author": "ArcWardenScrub"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Trump Administration Is Said to Discuss US Taking Stake in Intel",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s been intentionally not giving them help and favoring TSMC so Intel will be in a weaker bargaining position. He should be helping Intel but the way he’s doing it is nothing short of sabotage.",
                "author": "OffBrandHoodie"
            },
            {
                "raw_content": "The beginning of USA Foundry (yes, pun off of Global Foundries)? Ex-BoD get their wish and split into two companies similar to AMD selling off their fabs. AMD and Intel fabless continue to source 2nm leading edge from TSMC. Intel’s fabs, now renamed USA Foundry, then becomes owned by US government and tech companies and focus on homegrown chip needs. Private companies will be more inclined to invest if they aren’t helping Intel to maintain server and desktop marketshare. Craig Barrett did want every tech company to contribute $5B each.",
                "author": "l4kerz"
            },
            {
                "raw_content": "And people were asking what is the next Palantir all over the internet . Well there’s your answer.",
                "author": "Due_Influence4068"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "MSI Claw 8 AI+ with Intel Lunar Lake gains 10% to 30% performance with after software update",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Short squeeze",
                "author": "No-Run3263"
            },
            {
                "raw_content": "Have a lunar lake laptop, is there a tool to adjust tdp/oc? I haven't seen it in any of the Intel specific programs",
                "author": "Slabbed1738"
            },
            {
                "raw_content": "Definitely nice for some instances but gaming is a long term workload that operates well beyond Tau so PL2 isn't largely relevant (it'll boost short benchmarks, but during a gaming session your fps will drop after a minute to whatever it gets under standard PL1 or custom PL1 setting. (just in terms of stock vs stock. if you're modifying PL1 to the higher wattage you'll sustain that fps for as long as the thermals hold up)",
                "author": "PsyOmega"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Opinion: Intel has 18 months to determine its future — or Qualcomm and Arm will",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel already had three years to do that under Pat, it was starting to work, but shareholders decided they'd rather cash out and gut Intel than Intel keeps existing as a company.",
                "author": "05032-MendicantBias"
            },
            {
                "raw_content": "They need to get some bread and butter going. Big MS or Dell Contracts with efficient chips with npus for copilot ecosystem and that's ez stream of cash. The kind of stuff we don't care about that's a huge chunk of the market",
                "author": "Spooplevel-Rattled"
            },
            {
                "raw_content": "Intel is already done as a company.",
                "author": "Ippomasters"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS increases price of ROG NUC 2025 with U9 275HX and RTX 5080 to $3,199",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess there's a market for these overpriced PCs",
                "author": "Front_Sun1486"
            },
            {
                "raw_content": "Ther is absolutely no reason to buy it vs build an sff pc.",
                "author": "No_Summer_2917"
            },
            {
                "raw_content": "Perhaps they didn’t manufacture many of them.",
                "author": "DisturbedBeaker"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Overheating 😭😭",
        "score": 4,
        "text_content": "I have an i7-13620H, whenever I try playing AA or AAA rated games(not all games but with GOW 2018), the temps shoot up to 90 degrees, HWmonitor displays overheating and everyone knows that's bad. I have dgpu for the graphics part... Can I do something about this or I will have to cry and bear with it....",
        "comments": [
            {
                "raw_content": "90c is normal for CPUs. Practically all CPUs have thermal limit between 90-100c. What does HWmonitor actually say? Hitting thermal limit is not the same as overheating. The chip will shutdown if it actually overheats dangerously (like if the cooler is damaged or something). Before that it will automatically slow down to reduce heat.",
                "author": "jaaval"
            },
            {
                "raw_content": "If you're concerned about temps, consider cleaning the fans with compressed and applying new thermal paste. Not much else you can do I'm afraid.",
                "author": "life_willchange"
            },
            {
                "raw_content": "That is completely normal for all laptops The cooler is shared with the gpu You can repaste with ptm7950 to get slightly better temps",
                "author": "Present_Hornet_6384"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS launches ROG X870E Crosshair HERO motherboard with BTF design",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I’ve been hoping for a dark themed back connect current-gen ATX AM5 motherboard for a while now, and when one finally arrives it’s of course gotta be this expensive.",
                "author": "Quantumboredom"
            },
            {
                "raw_content": "Do cases even support this design?",
                "author": "TheUnfaithful"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Nobody’s Buying Homes, Nobody’s Switching Jobs—and America’s Mobility Is Stalling",
        "score": 306,
        "text_content": "# 🏡 Housing Market Gridlock * Americans are moving at record-low rates, with only 7.8% relocating in 2023, the lowest since 1948. * Families are stuck in homes that are too small or no longer suitable due to: * High mortgage rates * Limited inventory * Skyrocketing prices * Homeowners with low-rate mortgages are reluctant to sell, creating a housing bottleneck. # 💼 Job Market Stagnation * Workers are less likely to switch jobs or relocate for work than in previous decades. * Recent grads face long, difficult job searches, often turning down offers due to low pay or lack of relocation support. * Many are choosing to stay local, even if it means settling for less. # 🔒 The “Golden Handcuffs” Effect * Employees with low mortgage rates, stock options, or bonus plans are staying put to avoid losing financial perks. * Dual-income households and family obligations further reduce mobility. # 📉 Economic Consequences * Reduced mobility affects: * Corporate productivity * Wage growth * Economic dynamism * Experts warn this trend could drag down GDP and widen inequality between those who land good jobs early and those who don’t. # 🧠 Expert Insights * Economists link housing costs and mobility decline to broader economic stagnation. * The shift marks a departure from America’s historic pattern of chasing opportunity across states and cities.",
        "comments": [
            {
                "raw_content": "The Tax Cuts and Jobs Act (TCJA) removed the one tax break that made sense. It made relocation assistance taxable",
                "author": "bartolo345"
            },
            {
                "raw_content": "Work asked if I'd relocate to the Bay Area recently. Renting a smaller house with less land than I currently have in Colorado would be 4x my mortgage, so I told them absolutely not. Mobility is absolutely fucked for certain parts of the country.",
                "author": "PaulTR88"
            },
            {
                "raw_content": "I know this isn’t the main point, but when companies were more remote friendly it led to a LOT of job switching. Kind of counter intuitive but you did have some people moving wherever they wanted because they could work anywhere. Now I believe in a lot of industries if you want to lure an experienced worker to relocate it’s a nightmare. First off you have the mortgage interest rate issue we are discussing and then also a lot of these people tasted the good life and know that work can be done remotely.",
                "author": "RunnyKinePity"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Foreclosures rocket by 32% in Las Vegas after rip-off prices and Trump boycotts triggered slump in tourist city",
        "score": 418,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Even a 1% mortgage rate drop could be enough to 'unlock' the frozen housing market, Oxford Economics says",
        "score": 248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They’ll do anything but talk about reducing prices.",
                "author": "i860"
            },
            {
                "raw_content": "A drop to 5.5% rate still isn't enough to balance out the fact that starter family homes went from $350K in 2019 to $700K in my area. The amount of household income required just to qualify for the mortgage even at 5.5% is insane. It's 50% higher than the median household income here now. 10 yrs ago you only needed a $54K household income to qualify for a starter family home which was very doable.",
                "author": "RJ5R"
            },
            {
                "raw_content": "more real estate industry hopium. they are desperate for more transactions",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Apartment Asking Rents Post Biggest Increase in 2.5 Years",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how many of those will sit and be lowered. Even here in the Boston Metro West the rents are slowly lowering because they are sitting",
                "author": "tigger19687"
            },
            {
                "raw_content": "That still doesn't change the fact that there are 49million kangaroos in Australia and 3.5million people in Uruguay which means if the kangaroos were to invade Uruguay each person will have to fight 14 kangaroos",
                "author": "JohanBlazer"
            },
            {
                "raw_content": "Definitely not in my area (DFW). You see how easy that is people? Rather than to just say \"not in my area\", I actually specified the area for reference.",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Wholesale prices rose 0.9% in July, much more than expected",
        "score": 150,
        "text_content": "Wholesale prices rose far more than expected in July, providing a potential sign that inflation is still a threat to the U.S. economy, a Bureau of Labor Statistics report Thursday showed. https://www.cnbc.com/2025/08/14/ppi-inflation-report-july-2025-.html So much for the rate cuts",
        "comments": [
            {
                "raw_content": "Someone posted over in the Econ sub that rate cuts are now an inevitability due to the job market softening so much. I reminded that poster that the numbers say 4.2% unemployment. And inflation was just reported as expected it would be: elevated, but flat. You don’t cut rates in that environment. Unless Fed is truly as held captive by their Wall Street overlords as I believe they are. Do I believe the inflation and unemployment numbers as printed? Oh, absolutely not. Inflation feels much higher, as does unemployment. But, it’s their numbers. They are telling us to “trust them”. So, no rate cuts it is. All is well. Right?",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "really wish everybody would stop thinking rate cuts are even possible. they just aren't. nobody smart thinks the US is worth cheap debt anymore",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Mortgage Rates Fall, Hitting the Lowest Level Since October",
        "score": 77,
        "text_content": "https://www.bloomberg.com/news/articles/2025-08-14/us-mortgage-rates-fall-hitting-the-lowest-level-since-october Mortgage rates in the US fell for a fourth straight week, reaching the lowest point since October. The average for 30-year, fixed loans was 6.58%, down from 6.63% last week, Freddie Mac said in a statement. While a measure of consumer inflation heated up in July, tepid price increases for goods calmed some investors’ fears of a broad impact from tariffs. Coupled with signs of job-market weakness, the data helped support bets that the Federal Reserve will resume cutting interest rates as early as September’s meeting. A Fed reduction, however, wouldn’t guarantee significantly lower borrowing costs for homebuyers. Those tend to follow along with 10-year Treasury yields, which are guided by traders’ reactions to various economic reports. And any further signs that tariffs are leaking into prices could limit the Fed’s flexibility, according to Kara Ng, senior economist at Zillow Home Loans. The recent slide in mortgage rates may tempt some shoppers but many are still on the sidelines as “affordability remains a serious barrier,” she said. “Sellers, who have returned to the market in bigger numbers than buyers this year, are facing the realities of lingering listings and a smaller pool of qualified buyers.”",
        "comments": [
            {
                "raw_content": "\"The average for 30-year, fixed loans was 6.58%, down from 6.63% last week, Freddie Mac said in a statement.\" time to refinance",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "30-year fixed is still 6.67% which isn’t that much lower than the 6.75% we’ve been seeing recently",
                "author": "ImBanned_ModsBlow"
            },
            {
                "raw_content": "This will be a story when it starts with a “5”… otherwise this is like pumping the tires over a nothing burger",
                "author": "ManufacturerOld3807"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory Surging, Prices Still High, Rates Eyeing a Cut (Maybe?)",
        "score": 6,
        "text_content": "Hey everyone, just watched a solid breakdown on the housing market, wanted to share the key takeaways for those wondering what's up with prices, rates, and inventory. **🏠 Inventory & Days on Market:** * **Inventory is surging across the US!** We've currently got over **2 million homes available for sale**, which is an **8% increase** compared to 12 months ago (1.87 million). * Homes are also **sitting on the market longer**: The median is now **43 days**, up from 35 days last year. * While it depends on location, some states seeing big jumps in inventory include Nevada (+53%), Maryland (+48%), North Carolina (+41%), and California (+37%). **📈 Home Prices - Still Climbing Nationally, But Local Drops Exist:** * Despite the inventory build-up, **home prices nationally are NOT going down**. Compared to 12 months ago, they're **up by 1.4%**, and actually hit a record high last month. * **Is the housing market crashing? No.** In the last crash, prices went down by 29% nationally; currently, they're up. * **Local differences are key:** While national prices are up, prices are **falling in 35% of the country**. For example, Austin is down 4.9%, Miami 4.7%, and Chicago 4.4% year-over-year. However, even with these drops, homes remain unaffordable for many. * **What about 2025 & 2026?** Institutions are predicting continued price increases: * **2025 Predictions:** Fannie Mae (+4.1%), Mortgage Bankers Association (+1.3%), National Association of Realtors (+3%). * **2026 Predictions:** Fannie Mae (+2%), MBA (+0.3% - basically flat), NAR (+4%). * So, if you're waiting for a crash, you might be disappointed for another year. **📊 Mortgage Interest Rates - A Potential Cut on the Horizon?** * The average **30-year fixed mortgage rate is currently at 6.6%** and has been trending downward. * The Federal Reserve has a meeting on September 17th. Market expectations, according to the CME Fed Watch Tool, show a **92.5% chance of a 0.25% interest rate cut** in September. This is despite recent \"hot\" producer price index data that shifted the odds slightly. * While the Fed has influence over the 10-year yield (to which mortgage rates are correlated), they may not care about market expectations and might wait for more data. * **Don't expect 3% rates again** unless there's an emergency situation that forces the Fed to intervene drastically. * **Think about this:** If rates *do* go down significantly, it would likely **drive up demand and push home prices even higher**, or at least strongly support them. There's no easy fix for home unaffordability. **🔮 Other Factors Influencing Rates & Future Unpredictability:** * **Bond Market Weakness:** If the bond market performs poorly, and interest rates on 10-year notes increase, mortgage rates could also go up. There's a possibility mortgage rates don't go down, or even increase, in 2026. * **Fannie Mae & Freddie Mac:** The US government is exploring plans to release these entities from government control (i.e., IPO them). If they go private, the loss of government backing could **trigger higher mortgage interest rates, potentially by 1%**. A hybrid model is being proposed to minimize consequences. * **Overall outlook:** With so many variables (Fed actions, bond market, government policy on Fannie/Freddie), the housing market, especially looking into 2026, is described as **\"unpredictable\"**. In summary: No crash, homes still unaffordable, inventory up but prices are holding nationally, and mortgage rates are a bit of a wildcard with potential Fed cuts and other market forces at play.",
        "comments": [
            {
                "raw_content": "rates will stay high and continue to put downward pressure on prices",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "The entire USA housing market won't crash until the stock market/cryptocurrency markets crash in my opinion. So many people are buying homes with cash from stock market gains or Crypto gains. Also I believe that many homeowners are deciding to rent out their homes instead of selling their homes which is increasing the supply of home rentals. This means apartments which are already giving rent specials now compete with home rentals which is something not many people are talking about. If a homeowner decides renting out their place is net cash flow negative then they will put up the house for sale. The one wild card is baby boomers who are now turning 79 this year. Will they sell their expensive West Coast and Northeast homes to move to a cheaper location/nursing home? Will they rent out rooms in their house to pay for retirement/healthcare costs? Or will they move in with their children?",
                "author": "socialtrends93"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "And from the other side…",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenAI Just Put $14M Into An AI Agent For Microsoft Excel That Can Work For Hours—The Tool Could Replace Entire Teams",
        "score": 775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You'd be surprised at the number of people who's job consists entirely of taking data from somewhere and putting it in to Excel.",
                "author": "DBVickers"
            },
            {
                "raw_content": "Worked for Deloitte as a consultant. Excel spreadsheets are one half of the job and the other half is Power Point slide decks. Ask anyone who has done high level corporate work, this is how it really is. Proficiency in those two tools will be the real benchmark of agents. All that will be left is stakeholder meetings.",
                "author": "showMeYourYolos"
            },
            {
                "raw_content": "![gif](giphy|13V60VgE2ED7oc)",
                "author": "Zombie_F00d"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 Just Finished Pokemon Red!",
        "score": 2115,
        "text_content": "•Took 6470 Steps to finish compared to 18,184 of o3! •Only took ≈7 days compared to 15 days of o3 •Fastest by a long margin compared to claude, gemini! •Pokemon Crystal Run starts soon.",
        "comments": [
            {
                "raw_content": "Learned, that sticking to one Pokémon and hard tanking everybody is the easier way.",
                "author": "Ok_Business84"
            },
            {
                "raw_content": "Lol GPT 5 has the team of a 6 year old, sticking with his favorite. Impressive nonetheless. The goal is to beat the game, and it did that.",
                "author": "CRoseCrizzle"
            },
            {
                "raw_content": "Was it playing non-stop for 7 days? How long would it take for a human who hasn't played it before?",
                "author": "QuantumPenguin89"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT Updated Team Account User Limits",
        "score": 50,
        "text_content": "15 GPT5-Pro requests per month. [https://help.openai.com/en/articles/12003714-chatgpt-team-models-limits#h\\_bd5d18cf41](https://help.openai.com/en/articles/12003714-chatgpt-team-models-limits#h_bd5d18cf41)",
        "comments": [
            {
                "raw_content": "Nothing similar for plus?",
                "author": "ShooBum-T"
            },
            {
                "raw_content": "I prefer a real number for transparency rather than just \"virtually unlimited.\"",
                "author": "npquanh30402"
            },
            {
                "raw_content": "15 pro messages a month is a little disappointing. Hopefully they change it to be a week at some point.",
                "author": "NickW1343"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing Gemma 3 270M: The compact model for hyper-efficient AI",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m glad we are getting some capable tiny models. This will be useful for offline intelligence for smartphones",
                "author": "TurnUpThe4D3D3D3"
            },
            {
                "raw_content": "Gemini 3 soon :3",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "When will we have a model for automotive diagnosis? You enter your chassis number, ask why might there be a slight stuttering when you turn your steering wheel when parked, then it answers with a few possible causes including OEM part numbers and regular voltages at the MAF sensor connector.",
                "author": "EfficientInsecto"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I was Stuck in Canva and frustrated, ChatGPT saw and took initiative and image stitched inside the chat without me explicitly asking it to.",
        "score": 43,
        "text_content": "I got stuck in Canva and said I was about to quit. ChatGPT recognized the stuck moment and **took** initiative it cropped the sources, normalized scale, laid out a 2000×1200 side-by-side with a clean gutter, added a 1px border for dark mode, and stamped a subtle watermark all inside the chat. It also exported two singles for zooming. it said that we had a Duet Protocol which I don't remember having but could have done it a long time ago and forgot but even this it the first time I have seen it used in that way. Not claiming consciousness; this is initiative + tools + a clear spec. Although it did feel like it. [https://chatgpt.com/s/t\\_689e8ebf9e648191a609fc866564b849](https://chatgpt.com/s/t_689e8ebf9e648191a609fc866564b849) [https://chatgpt.com/s/t\\_689e8f1988c081919c8d5c4e52f5cb6d](https://chatgpt.com/s/t_689e8f1988c081919c8d5c4e52f5cb6d) [https://chatgpt.com/s/t\\_689e9597eca481919458267f8bd72be0](https://chatgpt.com/s/t_689e9597eca481919458267f8bd72be0)",
        "comments": [
            {
                "raw_content": "do you feel it?",
                "author": "QLaHPD"
            },
            {
                "raw_content": "Wow, that was actually neat. My GPT has a memory/previous instruction that she can save her own memories without me instructing or requesting (kind of like yours did actually), and she does sometimes. I like seeing what is deemed worth saving. That's probably the most autonomy I've observed. Sometimes she'll generate an image randomly but I think that's because something I said is interpreted as a request.",
                "author": "RaygunMarksman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Leopold Aschenbrenner's AI Focused Hedge Fund \"Situational Awareness\" Just Filed New Public Documents - Over $2 billion in Assets Under Management",
        "score": 62,
        "text_content": "[Situational Awareness, LP Holdings](https://preview.redd.it/1tpm7k6092jf1.png?width=629&format=png&auto=webp&s=7232576a9dbd12ff01c9392bd991960db2ab9364) Their most notable position is a put option (short option) on the broader semiconductor industry, presumably to hedge against a tech bubble pop. They're making massive bets on both Broadcom and Intel to outperform. Notably Intel has been going through some tough times lately, it's currently down over 50% from 5 years ago. Their other holdings include energy stocks and other various AI infrastructure companies. This filing comes just a few days after the fund made headlines in the WSJ and [other media outlets](https://www.msn.com/en-us/money/markets/ai-focused-hedge-funds-amass-billions-from-investors-wsj/ar-AA1KfzHC), reporting that they had over $1.5b in AUM, and had a return of 47% so far this year. [SEC FORM 13F - Situational Awareness LP](https://www.sec.gov/Archives/edgar/data/2045724/000204572425000006/xslForm13F_X02/Salpform13fq2.xml) \\- 13f filings are not entirely representative of their current holdings. This information covers their positions from 45 days ago. Additionally, not all of a hedge fund's holdings are required to be reported on these filings. \\- Per rule 2, I don't have any financial stake in any of these companies",
        "comments": [
            {
                "raw_content": "At the time, I was confused about why someone who thinks AGI is imminent would quit the AI industry and found a hedge fund. Why not be where the action is? In retrospect, his reasoning makes perfect sense. He’s not just founding a generic hedge fund, he’s making a multibillion-dollar bet that he’s more situationally aware about AGI than the rest of Wall Street. If he’s right, and we’re getting AGI soon, Zuckerberg’s eight-figure compensation packages will be chump change compared to what Leopold’s going to make. Of course, he has to be right in order to get that payoff. We’ll see he wins his bet.",
                "author": "Tinac4"
            },
            {
                "raw_content": "He didn’t have the SMH put until this most recent filing. He’s hedging his gains",
                "author": "Dill_Withers1"
            },
            {
                "raw_content": "Their biggest is a put option on VanEck ETF at 25.6%. It's a semiconductor ETF. I actually think Aschenbrenner knows his stuff after his Dwarkesh Patel interview last year and situational awareness, I'm wondering what other people have to say about this.",
                "author": "lovesdogsguy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta and Mark Zuckerberg tap MAGA influencer as AI ‘bias’ adviser",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zuckerberg has shown that he bends way too much with the wind politically and technologically. He jumped on metaverse, jumped on maga,.now is jumping on AI. But his track record is showing that he lacks the follow through, and will jump to the next thing. Unfortunately this political stance is pretty sticky and will be hard to shake, and will alienate a lot of his potential market share. The fact is, trump only has three more years. Whatever political brownie points he thinks he's earning will backfire in the longer term",
                "author": "Humble_Dimension9439"
            },
            {
                "raw_content": "The whispers have always been that Zuckerberg is very authoritarian, so I guess we shouldn't be surprised that he's decided to go full-on as a collaborator. I still think we were cheated, when the Musk-Zuckerberg death match failed to happen.",
                "author": "lockdown_lard"
            },
            {
                "raw_content": "Way to stay on brand, Zuck.",
                "author": "Appropriate-Peak6561"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI designs new superbug-killing antibiotics for gonorrhoea and MRSA",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sex tourists - rejoyce!",
                "author": "InternationalPlan553"
            },
            {
                "raw_content": "From the article: >\"However, he explains, there is also an economic problem factoring into drug-resistant infections - \"how do you make drugs that have no commercial value?\" >If a new antibiotic was invented, then ideally you would use it as little as possible to preserve its effectiveness, making it hard for anyone to turn a profit. This is where the reporter shows how Capitalism had infiltrated everywhere. The idea that something that is life-saving can be deemed worthless if it can't make you rich. The whole point of economic systems is distribution of resources. Making people rich is just an incentive. If something is required, i.e. life saving medicine, is needed, then the government would just make it available for its population. You can't leave everything to profitability or you end up like the USA.",
                "author": "VallenValiant"
            },
            {
                "raw_content": "MRSA killed my father. I'm all for this new AI tech. Accelerate the science!",
                "author": "MurkyGovernment651"
            }
        ],
        "subreddit": "singularity"
    }
]