[
    {
        "post_name": "TPUSA Straw Poll: 90% of AmericaFest Attendees Want to Halt All Immigration to U.S.",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really? Only 90%? I find that hard to believe. They must of had some foreigners there.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Who let in 10% Indians?",
                "author": "Emperorvoid"
            },
            {
                "raw_content": "Every major tech company is telling us we are on the verge of an AI revolution that is going to wipe out 60% of jobs in the US within a decade. The Indian foreigners who run all those companies are also telling us we need to import millions more of their countrymen or we won’t have anyone to do the jobs they are going to make obsolete.",
                "author": "9999999999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Failing New York Times, and their lies and purposeful misrepresentations, is a serious threat to the National Security of our Nation.",
        "score": 302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a big fish. This will get interesting.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Dam.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "This is what we want to tackle now? Who gives a fuck what some shitty dying rag publishes, you aren't going to silence it or win this fight. We know the Jewish owned media are against anything America First, now ignore it and do what you were elected to do.",
                "author": "Electrocutioner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⛩️ Japan Ready to Restart World’s Largest Nuclear Reactor 15 Years After Fukushima Disaster ☢️",
        "score": 280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of radiation exposure in Japan over the years, yet somehow, they persist 🤔",
                "author": "WhiteBoySummer"
            },
            {
                "raw_content": "Good. Nuclear power is the only viable future at the moment.",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "Did they sweep it for Godzilla eggs?",
                "author": "_Liberty_Prime_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nearly 100 Minnesota Mayors Send Panicked Letter to Lawmakers Complaining About Fraud Scandal and the Leadership of Tim Walz",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet he is still sleeping comfortably in his own bed at night, and not in a jail cell…",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "Rats are jumping off the sinking ship.",
                "author": "duckduck"
            },
            {
                "raw_content": "TWITTER LINK!",
                "author": "facesmelt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Coca-Cola literally told their employees to be “less white”",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "institutional racism is real... self fulfilling prophecy. They told us it was real and then they made it real and the administration should sanction them for discrimination.",
                "author": "Great_Gazoo"
            },
            {
                "raw_content": "\"That never happened, and anyway...it was a long time ago.\" \\- faggots",
                "author": "2008RonPaul2012"
            },
            {
                "raw_content": "I'm going to be white even harder now.",
                "author": "TyrannyBuster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just the News: John Brennan confirms he’s a target of Florida grand jury investigation, begs judge to intervene to help him. Like you and Obama were going to “help” all the American citizens on your pre-authorized to kill Disposition Matrix?",
        "score": 857,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We really need an arrest even a mid-level bagman like this guy",
                "author": "BoatingAccident"
            },
            {
                "raw_content": "Disposition Matrix: https://en.wikipedia.org/wiki/Disposition_Matrix. Kind of a big deal. If you think this isn’t still active…well, you haven’t thought things through.",
                "author": "flp999"
            },
            {
                "raw_content": "FAFO",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More Bullshit",
        "score": 1191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No company that gets federal contracts should be allowed to outsource jobs.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "You can bet your ass those H1Bs have two things in common: 1) None of them are white 2) None of them are “skilled labor”",
                "author": "RogueLeaderX"
            },
            {
                "raw_content": "It's time for Trump's repurposed IRS agents to storm a big office in Memphrica and get some answers!",
                "author": "BlackPiIIedMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HE KNEW.. THEY ALL KNEW.. THEY WERE ALL IN ON IT..",
        "score": 1727,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The moment that his name changed to Judas.",
                "author": "16BeatsAOne"
            },
            {
                "raw_content": "The most famous coward in American history.",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "And look at who's in the left of the pic....that fucktard Thune.",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brother Of Trans Woman Who Murdered Parents Blames ‘Reckless’ Prescription Of Sex Change Hormones",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People are still referring to tranny men as women, even in these news articles. Their participation in the delusion isn’t helping anyone.",
                "author": "XlDEN"
            },
            {
                "raw_content": "# BAN PRESCRIBING ESTROGEN TO MALES … of all ages",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Not a woman. Never was. Never will be.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on oil seized from Venezuela: “Maybe we'll sell it. Maybe we'll keep it. Maybe we'll use it in the strategic reserves. We're keeping it. We're keeping the ships also.”",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "May I suggest for Christmas instead of stimulus checks we get dividends of # LIQUID GOLD",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "God bless this man. What a fantastic president",
                "author": "Tiger5468"
            },
            {
                "raw_content": "We the Captain now. I SAID WE CAPTAIN TODAY.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS Triples Reward For Illegal Aliens Who Self-Deport Over Christmas — Will Now Receive $3,000, Free Flight Home and Wiping of Immigration Record",
        "score": 726,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can I self deport and claim 3k",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "I hope we’re just going back on our word and not sending the cash anyway",
                "author": "MAGAPlenty"
            },
            {
                "raw_content": "They aren't leaving peacefully. The self deport method is a failure so they tripled the free offer money. Time is up for Mr. Nice guys. They need to be forced out of our country.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The University of Oklahoma announced that it has ruled in FAVOR of the student who was discriminated against for quoting the Bible in an assignment to justify traditional gender roles. The transgender instructor will also \"no longer have instructional duties at the University.\"",
        "score": 1027,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So is ZhWyieeR fired...or is it still employed?",
                "author": "DepartmentOfOffence"
            },
            {
                "raw_content": "Why anyone would hire these freaks is beyond me. They are a liability 100% of the time.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "The university repeats the phrase “graduate teaching assistant” so many times in the letter just to avoid having to choose a gendered pronoun to use for him (by contrast, it uses “she” to refer to the undergraduate student right away).",
                "author": "DeplorableCentipede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump admin has just ARRESTED OVER 100 illegal truck drivers in California, and SEIZED their commercial drivers’ licenses Gavin Newsom tried to block this effort, and FAILED",
        "score": 717,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to start seizing the trucks and trailers, then liquidate them at auction or better yet just destroy them and everything in it!",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "Seize and crush the trucks, fine the owners or even jail time",
                "author": "MooseStangSally"
            },
            {
                "raw_content": "Jail the ones who hired them",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "School bus driver fired for posting sign banning Spanish said she was not being racist — but trying to stop bullying",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another old lady. After the Target one.",
                "author": "LaptopDied"
            },
            {
                "raw_content": ">After losing her job with the Juniata County School District, Crawford said she’s now on Medicare, Medicaid and receives SNAP benefits. I don't understand this part! Around me as an experienced bus driver you could literally have another job before sunset!",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "When was Spanish a race?",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Judge Boasberg orders Trump admin to allow Venezeulans deported to El Salvador to return to the US\"",
        "score": 849,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about gfy",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Why hasn't Congress removed Bonesberg?",
                "author": "perma-maga"
            },
            {
                "raw_content": "Go fucking kill yourself \"judge\". I heard someone said something about jews having us killed, raped and replaced. Well this one is kosher.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump admin has just sent a STRIKE TEAM into Minnesota to investigate new allegations of major unemployment fraud under Tim Walz This needs to end up with Walz being JAILED.",
        "score": 1385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Until he’s physically in handcuffs and being processed in a jail, it’s all just theatre",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Walz won’t go to jail. They will show criminal wrong doing, theft, fraud, and use it for the midterms, but no one will be held accountable. I know this because I’ve seen this story before. I wish so bad I was wrong, but I’m sadly not, and anyone of you who have spent the last decade in this movement with me, the T_D OGs, know this too. Sad.",
                "author": "Snooptwo"
            },
            {
                "raw_content": "Need to do this in every state, even red ones",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "General Mike Flynn with a Christmas message:",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s not forget crossing a frozen river to slaughter Hessian mercs on Christmas",
                "author": "okboomer59"
            },
            {
                "raw_content": "Or, you know, we remember birth of our Lord and Savior Jesus Christ",
                "author": "TheMAGAnificent"
            },
            {
                "raw_content": "Pioneers bringing Civilization to a hostile wilderness is vastly different than people fleeing from shithole countries coming here for free stuff on a Continent now settled with cities. Even those parasites are not the worst. The Islamic invaders come here to conquer!",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sweden: Iraqi Migrant Convicted of Raping 100-year-old Woman Won’t Be Deported",
        "score": 489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In 1975, Sweden had a population of 8.2m and 421 reported rapes. Fast forward to 2021, the population is 10.4m and the number of reported rapes was 9,668.",
                "author": "TheLawofOne-"
            },
            {
                "raw_content": ">Judge Mohamed Ali, who was appointed in June 2025, refused to issue the deportation order. Do the morons really think the Muslims are going to deport other Muslims?",
                "author": "thepalagoon"
            },
            {
                "raw_content": "So that the locals can kill him, right??????",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⛩️ Japan to Increase Requirements for Foreigners to Obtain Citizenship 🎎",
        "score": 891,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The requirement should be they're Japanese.",
                "author": "FORMERCHILDSTAR"
            },
            {
                "raw_content": "Being proficiency in English should be in ours",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "Smart. I fully support Japan to nationalize and remove all invaders.",
                "author": "SupFrens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐯 JD Vance Towers over Potential 2028 GOP Primary Field in Turning Point Straw Poll 📊",
        "score": 826,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Theres still 3 years to go. I remember when we all liked Pence for 4 years and then he cucked the fuck out the last minute",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "The smartest candidate by a long shot. He's going to steamroll every debate.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "What has Vance done to deserve the Presidency? If we can't satisfactorily answer that question, we're in trouble.",
                "author": "ramennov"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus] NVIDIA: WTF? | Combined, single-video report on the company's recent moves to enable subscription-based gaming as AI datacenter demand far outstrips that of consumer market",
        "score": 388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have to oppose subscription based gaming with everything we have. It's going to spell certain doom for the industry.",
                "author": "bogglingsnog"
            },
            {
                "raw_content": "People get so weird about review outlets being \"negative\" when the bulk of the news they have to go on is basically existentially threatening to their continued function",
                "author": "Limited_Distractions"
            },
            {
                "raw_content": "It's not fait accompli that this is a one-way ratchet. Siri started in the cloud, then it moved to local hardware. Things can change. And I'm skeptical about this because the strategy that China is pursuing on LLMs is different than the West's. They're pursuing efficiency both in terms of power and money. The West isn't. It all comes back to that Google paper \"We Have No Moat, And Neither Does OpenAI\". They're trying to make bigness the moat even if most of it empty promises. But the US doesn't have the productive capacity or capital to do that forever (datacenters never actually getting built, GPUs sitting unused in warehouses). And if Chinese models stay a few months behind they're always going to be a threat. They just have to outlast us because there's no way the US is going to build 250 gigawatts of datacenters in the next eight years.",
                "author": "abbzug"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why Do Gaming Laptop Manufacturers Hate AMD GPUs?",
        "score": 84,
        "text_content": "I've noticed that when searching for a gaming laptop, literally not a single one uses an AMD Radeon GPU. What is the reason for this? I know AMD are considered subpar by many (which I disagree with) but surely at least some models could include a Radeon gpu...",
        "comments": [
            {
                "raw_content": "Has AMD made any RDNA 4 GPUs for laptop?",
                "author": "Makere-b"
            },
            {
                "raw_content": "AMD has to actually ship product (and support it) for OEM to use them. There are other considerations, yes, but multiple manufacturers have publicly stated that AMD just doesn’t have enough available for them to warrant making more than a few models. Nvidia on the other hand has more than enough capacity to guarantee deals so they can easily just stick with them for an entire product stack and simplify procurement. (For dGPU products. Future of Nvidia’s business direction withstanding at the moment.)",
                "author": "Sleepyjo2"
            },
            {
                "raw_content": "I imagine AMD don't commit the volume necessary to supply the OEMs Look at the supply issues on the 9070/XT for most of the year. And the DIY market is small",
                "author": "TalkWithYourWallet"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Windows 11 hack: Higher SSD speeds with new NVMe driver",
        "score": 317,
        "text_content": "any experience with this?",
        "comments": [
            {
                "raw_content": "I did some runs on crystal disk mark and this is what I got: [https://i.imgur.com/lTb6o0j.png](https://i.imgur.com/lTb6o0j.png) Edit 2: For people without a vpn: https://ibb.co/LwpXNX5 Going to restore from my backup now as I don't want my install to get messed up Edit: did more benchmarks but with the real world preset for CDM [https://ibb.co/C52DTC0w](https://ibb.co/C52DTC0w)",
                "author": "jonathanwashere1"
            },
            {
                "raw_content": "Looking forward for a full official implementation. No, I won't beta test anything anymore.",
                "author": "tahini001"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Micron, SanDisk Reportedly Turn to PSMC to Fast-Track Memory Output Amid Tight Supply",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Proton 10.0-4 RC Public Testing Has Begun With Loads Of New Fixes And Playable Games",
        "score": 46,
        "text_content": "The next Proton 10 Release Candidate is here to publicly test, and it is bringing over tons of fixes from the Experimental branch, giving the compatibility layer that allows us to play Windows games on Linux even more compatibility! Proton 10.0-4 RC brings in multiple new playable games, including Fellowship, Metal Slug: Reawakening, Distant Worlds 2, and Drop Dead: The Cabin. We also have a multitude of fixes for Far Cry 5, ARC Raiders, Cladun X3, Tempest Rising, Assassin's Creed Shadows, Secrets of Grindea, The Finals, Tekken 8, and much more. And of course, Proton's components have also been updated.",
        "comments": [
            {
                "raw_content": "Incredible hardware news. Thanks for the share.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cyberpunk 2077 back to full price",
        "score": 575,
        "text_content": "Seems like the error been fixed. Literally brought it 5 hours ago between Nier. Happy I pull the plug, wont be another sale this big for a long while",
        "comments": [
            {
                "raw_content": "Not even back on sale lol",
                "author": "sonianevermindX"
            },
            {
                "raw_content": "Holy cow, it WAS an error lol. ![gif](giphy|LDBuYzAwu8L4I)",
                "author": "A_Legit_Salvage"
            },
            {
                "raw_content": "I also just got it about 20 min ago lucky me..",
                "author": "kaancem"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So now that cyberpunk price is back to normal did you manage to snatch a copy?",
        "score": 158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yeah. I hope they don’t issue refunds for everyone who got it for that price.",
                "author": "infredible-hulk"
            },
            {
                "raw_content": "Yup, I waffled for a few hours, but knowing Nintendo - if the price was gonna change, it would change at midnight EST/9 PST. So, I took a gamble & bought it at 7:45 PST. A friend of mine bought it 5 min before the price changed lol.",
                "author": "Rare_Hero"
            },
            {
                "raw_content": "Thank you random CDR employee for sacrificing your job so I can play this game o7",
                "author": "MajoraNX"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk 2077's website confirms the -75% discount is a price error, intended discount was -42%",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seemed way too good to be intentional. If you're in the US and are even slightly interested in Cyberpunk, take advantage of this while you can!",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "Just RAN to purchase since it was still showing 17.49",
                "author": "forkfoundinkitch3n"
            },
            {
                "raw_content": "BRO thank you so much for making the post, I went ahead and took advantage while I still had the chance!",
                "author": "SonimaxTheKing"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk 2077 in number 1 on the Canadian eShop",
        "score": 160,
        "text_content": "Please ignore the terrible photo quality it won't let me take a screenshot.",
        "comments": [
            {
                "raw_content": "If the « error » hasn’t been corrected by now, it won’t be corrected right? EDIT: went back to 100$ in canada… maybe I shouldn’t have waited that long. Or maybe I didn’t need it anyway. :) They changed it at midnight EST it looks like.",
                "author": "Aggressive-Offer-497"
            },
            {
                "raw_content": "I mean, they fucked up the discount, and that was too good to pass up for someone who didn’t want the game unless it went on stupid sale.",
                "author": "twili-midna"
            },
            {
                "raw_content": "It’s back to full price 69.99 what a deal",
                "author": "Independent-Dust1844"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cyberpunk 2077 $17.49 US eShop - 75% off",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's insane, not close to that price in the uk",
                "author": "MrDonohue07"
            },
            {
                "raw_content": "This is an insane deal. I don't even know if phantom liberty by itself has been this cheap on other platforms.",
                "author": "MurryEB"
            },
            {
                "raw_content": "Just a heads up, it looks like this is cross save compatible with the PC version. So if you're like me and waa hovering near the phantom liberty expansion, I'll be able to pick it right up on the switch 2.",
                "author": "Gethixit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Bloober Team says Project M details coming \"very soon,\" call it a \"vision that could only exist on Nintendo hardware\"",
        "score": 231,
        "text_content": "\"You have no idea how hard it is for me not to reveal what Project M truly is—but for now, it’s still too early to talk about it. We’re confident that we’ll be able to share the first details very soon.\" \"What I can say is this: fans of Resident Evil, Silent Hill, Limbo, and Eternal Darkness will immediately feel at home. That said, Project M introduces a bold twist—one that no horror game has ever explored before. This is a vision that could only exist on Nintendo hardware.\"",
        "comments": [
            {
                "raw_content": "Saw project m get mentioned and got excited",
                "author": "MajoraNX"
            },
            {
                "raw_content": "Other other M.",
                "author": "NeutralDensity1"
            },
            {
                "raw_content": "1993 Mario Movie/Luigi Mansion sequel as where you play as John Leguizamo as Luigi.",
                "author": "OfficialNPC"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Persona 3 Reload Patch Adds 60 FPS mode",
        "score": 687,
        "text_content": "It only works in docked mode though. It also seems like the frame pacing issues are fixed. Finally this is a half decent port.",
        "comments": [
            {
                "raw_content": "Oh man great timing",
                "author": "Square-Ad6263"
            },
            {
                "raw_content": "As someone who has never played a Persona game, is this an OK place to start? Thanks!",
                "author": "ProdigyCorporation"
            },
            {
                "raw_content": "Persona 5 royal next 🥰",
                "author": "Diamondimonium"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch Online Has Reportedly Improved Input Lag In GameCube Classics Via Recent Update",
        "score": 37,
        "text_content": "Has anyone else noticed a reduction in input lag since the last update?",
        "comments": [
            {
                "raw_content": "Honestly the only the games where the input lag was annoying to me were wind waker and Mario strikers where it became difficult to time the qte. Wind waker also has the problem of the overly sensitive camera.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "I haven’t tried the new update, but thank god. I played Wind Waker, but it was almost unplayable because of the input lag. I was waiting to try the other games until they fixed it, so I’ll have to check out the other games sometime now that they ‘fixed it.’",
                "author": "DifficultyOk5719"
            },
            {
                "raw_content": "Wow. Nice !!",
                "author": "roccerfeller"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Grove Street Games (developer of Grand Theft Auto: The Trilogy – The Definitive Edition) appears to be working on an unannounced game for PS5, PC, and Xbox.",
        "score": 356,
        "text_content": "https://bsky.app/profile/timur222.bsky.social/post/3mal66akqa22e",
        "comments": [
            {
                "raw_content": "I highly doubt it's a Rockstar project considering the overwhelming amount of negative feedback after the Trilogy DE, not to mention the CEO's comments about Rockstar after last year's patch",
                "author": "DoomJerk"
            },
            {
                "raw_content": "Oh well if they made the Definitive GTA trilogy im sure whatever this is will have a fantastic launch",
                "author": "Quinny_Binny"
            },
            {
                "raw_content": "I have read some people saying it's GTA IV but it's not. They ended up in a bad relationship with Rockstar. Rockstar apparently delayed some of the patches they were working on until the mobile release of the game and they also changed devs so yeah I doubt it's something that has anything to do with Rockstar.",
                "author": "JRedCXI"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GTA 6 Online Could Evolve Into an MMORPG as Many of Its Planned Features Belong to the Genre, Developer Has Heard",
        "score": 878,
        "text_content": "Hey all, I checked with a mod on Discord before posting this. You can find the rumor based on an **on-record interview** with an industry veteran [here](https://wccftech.com/gta-6-could-evolve-into-an-mmorpg-as-many-of-its-planned-features-belong-to-the-genre-developer-has-heard/).",
        "comments": [
            {
                "raw_content": "Since they recruited the FiveM team i'm pretty certain GTA 6 is built to be a forever game, and for that they're gonna tap into the roleplay/mission creator/user generated content route way more than for GTA V",
                "author": "Rainy_Wavey"
            },
            {
                "raw_content": "So unironically, the bank is a raid and your gang is your guild. Yeah I can see it LMAO.",
                "author": "thebohster"
            },
            {
                "raw_content": "\"less ff14 and more club penguin\"",
                "author": "Chasing-Wagons"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden: “The first COD Switch version is nearly done and launching in a few months”",
        "score": 270,
        "text_content": "[source](https://xcancel.com/JezCorden/status/2003171421879460027)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Black Ops 7 or just Warzone? 🤔",
                "author": "LollipopChainsawZz"
            },
            {
                "raw_content": "COD Zombies on the switch would be so good",
                "author": "Possible_Ground_9686"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: “Romero Games cancelled a decade-long developed game which was ‘Hellslayer’, an FPS centered around a priest fighting demons, once u die u immediately restart the area.”",
        "score": 327,
        "text_content": "https://insider-gaming.com/details-on-romero-games-xbox-title/ They also say the new project is a “completely redesigned” title that takes elements from the original cancelled game, so not fully made from scratch.",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "once u die in the game u die in real life",
                "author": "RIPGeech"
            },
            {
                "raw_content": "Does it have a Katana?",
                "author": "Cubelock"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon HD screenshots from the latest playtest and impressions from Chinese players",
        "score": 300,
        "text_content": "- Screenshots are from the December playtest which ended 2 weeks ago, info and images comes from Bilibili comments on the new ViDoc - Most of the closed test players are glazing the art style (to be expected) and even the gameplay quite a bit from what I can gather which is surprising, suggesting that PvP enjoyers will switch to this game cause of the \"unmatched gunplay\". - All agree that Arc and Marathon are built for different audiences so less player cannibalism, comparing Arc to Fortnite and Marathon to Apex - Biggest issue is the enemy AI design, no variety (all humanoid robots) and sometimes it can be hard to distinguish between players and AI. They are also quite tanky and the loot they drop is underwhelming - Another one is the anti-cheat, they're using Battle Eye and not a kernel-level solution yet which may be frustrating when you can lose your gear. Chinese regional pricing was another concern as that's not been announced yet. - PC performance is supposedly solid and has improved quite a bit from the previous test, which might change if they decide to push the graphics more before launch. No raytracing effects and no frame generation yet. Images: https://ibb.co/album/HX5Nmr",
        "comments": [
            {
                "raw_content": "I fucking hate imgur And the link is dead too",
                "author": "GroundbreakingBag164"
            },
            {
                "raw_content": "It would be preferable for Marathon to be good",
                "author": "Anstark0"
            },
            {
                "raw_content": "These aren't screenshots from the tests; they're screenshots the developers shared on the game's Discord server the day they revealed the new video. And if anyone played the last tests, they know that we didn't just have humanoid enemies, and even among the humanoids there are at least 6 classes, varying in their abilities, damage dealt, and health, as well as things like unique weaknesses. And honestly, observing the internal discussions on the official Discord server from those who had access to the test, these opinions diverge quite a bit from the general consensus I observed; it doesn't seem to be a real \"leak\".",
                "author": "StudioIllustrious208"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xeon 6 Granite Rapids listed by retailer: Xeon 698X with 336MB cache at $8,300",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "granite was already sent straight to hyperscalers/SIs a long time ago (I think it's been over a year). this is not a launch, this is intel finally getting enough volume or sales to sell them publicly as WS parts.",
                "author": "topdangle"
            },
            {
                "raw_content": "With Zen6 launching very soon, this will be obsolete in no time, if not at launch already.",
                "author": "doommaster"
            },
            {
                "raw_content": "too slow & too late?",
                "author": "Zeraora807"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Linux 6.19's significant ~30% performance boost for old AMD Radeon GPUs",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GCN 1.0/1.1 - HD7000 and R7/R9 200",
                "author": "Blood_CZ"
            },
            {
                "raw_content": "Wow, really old huh...",
                "author": "autodidacticasaurus"
            },
            {
                "raw_content": "Alternative title: Linux's degraded performance on old AMD Radeon GPUs for years.",
                "author": "HuntKey2603"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Exclusive: Lenovo prepares Legion gaming refresh with new Ryzen AI 400 series, Ryzen AI 9 465, Ryzen 7 250 and AI 9 HX 470",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They don’t have a high end slim model anymore? Stuck at 5060 when zephyrus goes up to 5080/5090?",
                "author": "996forever"
            },
            {
                "raw_content": "Wake me up for zen6 mobile",
                "author": "christurnbull"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Home Sellers Retreat, With Supply Posting Biggest Decline Since 2023",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This looks just like normal pre-COVID seasonality. It declines around holidays (Nov-Jan), stalls out before spring (February) and listings pick back up in March and hit full swing by Easter (March/April). We're going to see way higher listings in 2026, lots of things sitting on the market for months. So many boomers who missed their 2021/2022 cash cow retire to Florida window, and still holding on to the 'bidding war' dream. Demographics of home sellers is working against them, it's sell now or sell into a potentially very stagnant late 2020s/early 2030s market with way too many estate sales. Source: [https://fred.stlouisfed.org/series/ACTLISCOUUS](https://fred.stlouisfed.org/series/ACTLISCOUUS)",
                "author": "Which-Sun-3746"
            },
            {
                "raw_content": "Sellers think it is still the year 2022 and want those kinds of prices for their home.",
                "author": "seajayacas"
            },
            {
                "raw_content": "The lack of homes for sale is one of the reasons why homes in my area keeps going up.",
                "author": "Purple-Investment-61"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Listings Post Sharpest Drop in 2 Years, Tightening Housing Supply",
        "score": 27,
        "text_content": "It is worth noting that the median home-sale price is up 2%, with prices rising despite slow demand partly because of tightening inventory",
        "comments": [
            {
                "raw_content": "Seeing an increase in homes listed for rent in my city compared to prior years. Along with more apartments offering 2 months free while keeping the asking rent the same. Seems to be distorting the housing market data.",
                "author": "WufBro"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "REBubble was officially created 5 years ago yesterday, on Dec 21st, 2020. Happy anniversary!",
        "score": 34,
        "text_content": "REBubble was officially created on December 21st, 2020. Wow, time flies. Lots of interesting posts over those 5 years. Interesting to look back on and reflect. https://www.reddit.com/r/REBubble/comments/uzo1g7/psa_we_have_not_been_calling_it_a_bubble_for_years/ https://www.reddit.com/r/REBubble/top/?sort=top&t=all",
        "comments": [
            {
                "raw_content": "The echo chamber continues",
                "author": "payme_dayrate"
            },
            {
                "raw_content": "Interesting how \"UtahNow\" was just about the only voice of reason there. Downvoted.",
                "author": "TheophrastBombast"
            },
            {
                "raw_content": "Good thing we were all warned about the bubble and took action like perma-renting",
                "author": "JLandis84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A real estate investor and agent explains why 2 days before Christmas is her 'favorite day of the year' to submit home offers — and other 'pockets' when you can score a good deal",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I followed this logic (with a builder) I got 120k off the peak listed price for my town home. Started the process after Thanksgiving. Closed in 3 weeks.",
                "author": "pantsopticon88"
            },
            {
                "raw_content": "I prefer early December, for the same reasons... plus everyone working on the loan/process want a Christmas bonus/income before the end of the year.",
                "author": "mistressbitcoin"
            },
            {
                "raw_content": "I don't think anything really sums up the market better than an article speaking on exploitation around the holiday season.",
                "author": "Anderson822"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The South’s Biggest Economic Draw Is Slowly Coming Back",
        "score": 0,
        "text_content": "https://www.bloomberg.com/opinion/articles/2025-12-22/affordable-housing-in-the-south-is-slowly-coming-back Here in Atlanta, as in much of the American South, the economic vibes have been bad this year. Not recessionary perhaps, it’s felt more like we lost momentum and got stuck, something I haven’t experienced since I moved here from San Francisco in 2010. I’m not optimistic for the first half of next year, but one silver lining in the South’s economic struggles is the grind back toward housing affordability, which should put the region on the path back to a more balanced expansion. The economic model of many southern states relies on attracting people and jobs from pricey coastal regions and the Midwest. Relatively cheap housing draws the young, and the demand for residential and non-residential construction to service relocating families creates a virtuous cycle that’s served the South well. This engine has been sputtering ever since the Federal Reserve ratcheted up interest rates in 2022, with conditions feeling particularly bleak right now. From Maryland to Florida and Texas, companies have been hiring at a rate similar to the first few years following the 2008 financial crisis. The most recent Beige Book report, which provides qualitative information about the economy from the Fed’s 12 regional districts, noted flat employment and growing stress among low-to-moderate-income consumers in the Atlanta district, which encompasses most of the Southeast, and weak economic activity and employment declines in the Dallas district, which covers all of Texas. Consider Atlanta, where the general lack of interstate migration and housing turnover in recent years has led to less demand for both single-family homes and apartments. This has hit not just workers in the construction industry but also employees in allied fields from real estate and mortgage agents to those in the home improvement business. It has hurt Home Depot Inc., which is headquartered in metro Atlanta and is a large employer in the region. The spillover effects from the goods economy — also grappling with President Donald Trump’s tariffs — has hurt the business of another key employer headquartered in the region, United Parcel Service Inc., which cut 34,000 jobs this year. The surge in Black unemployment over the past several months is also weighing on the metro, whose population is one-third Black or African-American, according to the Metro Atlanta Chamber. What Atlanta and other metros in states including Florida and Texas need is migration and residential construction to pick up again. But for that to happen, housing affordability needs to improve. Fortunately, it has been. According to the S&P Cotality Case-Shiller Indices, in the 12 months ending in September, home prices were down 4.1% in Tampa, 2% in Phoenix, 1.3% in Dallas, and 0.2% in Atlanta. Over that same period, average hourly earnings in those metros have grown by 4% or more. With resale housing inventory above 2019 levels in all those cities, and rising, affordability should improve at a solid pace in 2026. Housing transactions are already showing early signs of life, with mortgage purchase applications now in a clear uptrend. Single- and multi-family building starts will stay sluggish for some time, though the data-center boom has provided some respite, preventing a more pronounced downturn in construction employment. Most importantly, relative affordability gaps are again growing between southern and northern metros, pointing to a pickup in interstate migration that should start to stabilize the southern economies in the latter part of next year. It will also help chip away at the north’s affordability challenges. Northern metros such as Hartford, Connecticut, and Chicago struggle to offer residents cheaper housing due to low supply. These places need to build more and remove regulatory obstacles to construction, but we should also be realistic in acknowledging that Hartford and Chicago will never build houses like the sprawling metros of the South, which have more undeveloped land as well as a robust residential construction ecosystem. On some level, fixing affordability in the North involves getting interstate migration back to its historical trend. The chicken-and-egg dynamic of affordability drawing migration, which will pick up with greater affordability, means there’s more economic pain to come in the South. The best we can hope for in 2026 is optimism on the horizon, even if we’re probably in for another year of stagnation.",
        "comments": [
            {
                "raw_content": "The hard part of Atlanta is the ridiculous drive times to get to offices and clients, even if one doesn’t need to necessarily be physically in front of customers or with co-workers. A stubbornness pervades that “in-person” is a necessity, when we’ve shown that it simply is not, in many fields and jobs. Frankly, with where new housing has been built for a LONG time now, that is effectively “remote” employment. It just is. It’s not close to city center or the larger airports in the region. It’s a mental block for employers. They refuse to accept technology for what it can do, lean on it when convenient, and don’t want to pay for travel.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Atlanta is *full.* you cannot say you’re building new housing in “Atlanta” if it takes 1.5 hrs to drive to the city center. Thats not Atlanta, and there is no where else to live in Atlanta. The other cities in GA are growing now.",
                "author": "Equivalent_Freedom16"
            },
            {
                "raw_content": "Article Headline: \"The South’s Biggest Economic Draw Is Slowly Coming Back\" Also Article: \"4.1% in Tampa, 2% in Phoenix, 1.3% in Dallas, and 0.2% in Atlanta\" Awww shit! So the unaffordable condo in the middle of Atlanta for 390k is now ONLY $389,922?! - OMG guys, guys, guys, we're so gonna roll up to Atlanta!! I mean, come on, with those $78 dollars, we could buy ourselves a nice dinner or something! Ooooh, or maybe even a bike! (I mean, you know, from Walmart, a small one, lets not get crazy here people...)",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Miami’s Real Estate Playbook: How Smart Buyers Are Winning in One of America’s Toughest Markets",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Appraisal gaps in this market? lol",
                "author": "WrongThinkBadSpeak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fla.'s Housing Market: More Closed and Pending Sales in November",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Comedy timing is among the hardest things to perform. Sora nails it in this Krampit the Frog clip",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's over.",
                "author": "orangotai"
            },
            {
                "raw_content": "This is only the beginning. Sora 2 is trained purely on videos and their associated captions (many of which are themselves AI generated). In the future there will be LLM text-trained components integrated into generative AI to help guide the logic of the generation directly in latent space and through reasoning over the outputs. Nano Banana Pro is already doing this to a degree and that's why there's been such a drastic improvement in its ability to create logically consistent and plausible outputs, which Demis Hassabis refers to as \"synergy\". I haven't tried GPT Image 1.5 yet but I imagine it's the same deal. Where things will really take off is when multimodal LLM's begin to incorporate video generation and playback within the same unified architecture as the text reading/writing, rather than the current compute-saving modular designs where different components are stitched together and outsource various tasks to one another. Just imagine how much psychological and physical knowledge an LLM could acquire about the world from watching millions of hours of video in addition to reading virtually all of the text ever published to the general public and reasoning over all of it within a unified space. When reasoning over text, they'll be able to visualize how it all \"looks\" when played out as a visual scenario, and vice-versa when reasoning over video while incorporating vast bodies of knowledge acquired from text. Recent advances seem to strongly suggest that scaling model sizes, data and compute will continue leading to overall intelligence gains, but that even greater progress is being achieved by improvements in the ways the models are trained, yielding high levels of intelligence even in smaller models that can run on consumer-grade hardware. So when those millions of hours of YouTube videos start getting incorporated into world simulations and reinforcement learning tasks, look the frick out.",
                "author": "FriendlyJewThrowaway"
            },
            {
                "raw_content": "this guy has been hiding under my bed and in my closet for years (no one believes me! 😞)",
                "author": "Digital_Soul_Naga"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is 2026 the year where everything starts to change and the average person notices?",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "define \"everything starts to change\" If you mean when the average person notices that AI has advanced *a lot*, I think 2025 was that year. Even excluding ChatGPT's free and paid users, billions have been exposed to AI overviews and many other platforms with high exposure. Voice mode (including real-time video share) is sci-fi compared to what we had just a couple years ago. Realistic images and video have become commonplace, to the point where many no longer trust real media if the content is too out-there.",
                "author": "micaroma"
            },
            {
                "raw_content": "In 2027 my dog will use ChatGPT",
                "author": "therapeutic_bonus"
            },
            {
                "raw_content": "Notice what exactly? In many ways, 2025 *was* a breakthrough year for AI, and also for the AI backlash. It's already a rapidly diffusing technology that's in pretty much every new product, and the top 2 iOS apps are ChatGPT and Gemini. The word \"singularity\" made its way into an [SNL skit.](https://www.youtube.com/watch?v=cY7o35ovQEY) I'm not sure agent task horizon length is a key watershed moment to watch, nor is it by itself the most informative -- it doesn't help me if my agent can run for 12 hours if it still messes up CSS because it can't reliably iterate on visual details. I'd say another gen-pop threshold will be crossed when common models are *significantly* less jagged than they are today: few-to-no hallucinations, better integration of different modes of thinking (e.g., spatial intelligence), few to no bizarre failure modes like \"seahorse emoji\", \"chains of thought\" that resemble reasoning more closely than the \"Wait, that's not it\" current models are doing. Because this is a continuous process, I don't think there's any one variable that will tell us when that's the case, but model releases themselves are often more of a step change. So maybe a Gemini 5 or GPT-7 or DeepSeek 6 will be so unambiguously awesome that it'll generate a different kind of buzz.",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Redditor demos AI-assisted conversion of playing with an action figure and turning it into motion video: \"Time-to-Move + Wan 2.2 Test\"",
        "score": 416,
        "text_content": "We all know how crazy difficult stop motion video is.",
        "comments": [
            {
                "raw_content": "They need to remake the movie Small Soldiers.",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "can somebody please buy this dude some gunpla",
                "author": "IReportLuddites"
            },
            {
                "raw_content": "The antis are still going to say \"just learn stop motion.\"",
                "author": "McEvilson"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MiniMax M2.1 Officially Launched: SOTA Agentic Coding at 10% the Price of Claude Sonnet 4.5",
        "score": 54,
        "text_content": "**MiniMax M2.1 officially launched today** and it is a massive disruptor for the **SOTA coding leaderboard.** Built specifically for agentic workflows and complex engineering, it is already showing frontier-level results. **The Performance Stats:** It scored a massive **72.5% on SWE-bench Multilingual** and **74.0% on SWE-bench Verified**, effectively beating both **Claude Sonnet 4.5** and **Gemini 3 Pro** in core technical benchmarks. **Language Mastery:** Unlike models that only prioritize Python, M2.1 is optimized for **Rust, Java, Go, C++, and JavaScript**. It handles multi-file engineering and compile-run-fix loops with high reliability. **Native AppDev Focus:** Major upgrades were included for **native Android and iOS development**. It also features improved web aesthetics and more realistic scientific simulations for technical workflows. **The Price Revolution:** This is the most important part for developers. Early testers report Claude level performance at **10% of the cost**. Input tokens are priced at just **$0.30 per million**, making heavy agentic loops affordable for everyone. **Open Source Timeline:** The full open-source release is scheduled for **December 25th**. We can expect weights and local deployment options to hit the community in just two days. **Official Source Links:** **Main Announcement:** https://www.minimax.io/news/minimax-m21 **Technical Docs:** https://platform.minimax.io/docs/guides/text-generation **Agent Portal:** https://agent.minimax.io/",
        "comments": [
            {
                "raw_content": "**Co-founder Claims** https://preview.redd.it/98bws4ls6w8g1.png?width=1080&format=png&auto=webp&s=18a3ed72e7eb126d39c79c4b5c8ec755f06db942 **10B active parameter model btw, crazy !!**",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "what the fuck is that fucking graph jesus fucking christ I'm going to kill myself",
                "author": "KaroYadgar"
            },
            {
                "raw_content": "W",
                "author": "Psychological_Bell48"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This prediction was true, but not about Gemini",
        "score": 414,
        "text_content": "Over the past few days I've been using Claude Code + Opus 4.5 to vibe code a turn-based tactics engine in Unity. I have not touched a single line of code. The only bit of the Unity UI I have touched is adding a single GameObject to the Scene and attaching scripts written entirely by Opus to it. The logic decisions (taste?) of the model is still off sometimes, but it has straight up succeeded at every task I've set it so far. From pathfinding to proc gen map building to some basic enemy AI. Last night I had two instances of Code running on two different git worktrees, implementing two large features in 10 minutes in parallel that would've taken me multiple hours. Now I know how to build this engine myself. It would've taken me a lot longer, but I know where the model has made a bad decision. But it still feels like a massive step up over previous models where Opus/CC will persevere in a loop with lots of tool calls and good use of context to meet the end goal that has been set. Watching it work is almost like watching another developer work in pure text form.",
        "comments": [
            {
                "raw_content": "Didn't YouTube just release a thing where you can vibe code a game using Gemini that you can then publish to YouTube?",
                "author": "ExoTauri"
            },
            {
                "raw_content": "I don’t know why people are suggesting Logan’s prediction didn’t come true for Gemini. You can absolutely vibe code basic video games with Gemini.",
                "author": "PandaElDiablo"
            },
            {
                "raw_content": "You still have to know what you're doing and handhold the AI, but it's incredible that we're at this point already. Soon the AI will handhold the user even as they're asking it to build their vision of a game.",
                "author": "Bright-Search2835"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deepmind CEO Dennis fires back at Yann Lecun: \"He is just plain incorrect. Generality is not an illusion.\"",
        "score": 780,
        "text_content": "**Demis said:** Yann is just plain incorrect here, he’s **confusing** general intelligence with universal intelligence. **Brains** are the most exquisite and complex phenomena we know of in the universe (so far), and they are in fact extremely general. Obviously one can’t circumvent the no free lunch theorem so in a practical and finite system there always has to be some **degree of specialisation** around the target distribution that is being learnt. But the point about **generality** is that in theory, in the Turing Machine sense, the architecture of such a general system is **capable** of learning anything computable given enough time and memory (and data) and the human brain (and AI foundation models) are approximate Turing Machines. **Finally,** with regards to Yann's comments about chess players, it’s amazing that humans could have invented chess in the first place (and all the other aspects of modern civilization from science to 747s!) let alone get as brilliant at it as someone like Magnus. He **may not** be strictly optimal (after all he has finite memory and limited time to make a decision) but it’s incredible what he and we can do with our brains given they were evolved for hunter gathering. **Replied to this:** Yann LeCun **says** there is no such thing as general intelligence. Human intelligence is super-specialized for the physical world, and our feeling of generality is an illusion We only seem general because we can't imagine the problems we're blind to and **\"the concept is complete BS\"** **Sources:** 1) **Video of Yann Lecunn:** https://x.com/i/status/2000959102940291456 2) **Demis new Post:** https://x.com/i/status/2003097405026193809",
        "comments": [
            {
                "raw_content": "When smart people like these two, disagree and debate with each other, usually we get something very good as a result of that",
                "author": "mooman555"
            },
            {
                "raw_content": "**Full tweet** https://preview.redd.it/xtevt94mhr8g1.png?width=1080&format=png&auto=webp&s=e8828eea55177923f75ddda156904853e6d7e92c",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "As long as we get towards AGI and ASI ![gif](giphy|qKV8U3Gl3bWVi)",
                "author": "Working_Sundae"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The rise of AI denialism - \"By any objective measure, AI continues to improve at a stunning pace [...] No, AI scaling has not hit the wall. In fact, I can’t think of another technology that has advanced this quickly,\"",
        "score": 175,
        "text_content": "\"So why has the public latched onto the narrative that AI is stalling, that the output is slop, and that the AI boom is just another tech bubble that lacks justifiable use-cases? I believe it’s because society is collectively entering the first stage of grief — denial — over the very scary possibility that we humans may soon lose cognitive supremacy to artificial systems.\" From the article \"The rise of AI denialism\" by Louis Rosenberg on Big Think. Link in comments because for some reason Reddit won't let me post the link directly.",
        "comments": [
            {
                "raw_content": "I think it's just hard to see progress now for average people the models have been good for a while and the only great agents are for software development.",
                "author": "Ambitious_Subject108"
            },
            {
                "raw_content": "Denial strikes me as a loaded word here considering that we’re talking about what’s possible, not what’s probable and/or has come to pass. What we're talking about here (losing cognitive supremacy) is an open question in part because the target is moving - most of the time we're arguing about what that would even constitute and/or how to measure it. It's one of those things that may only be obvious in hindsight.",
                "author": "Disastrous_Room_927"
            },
            {
                "raw_content": "People are terrified of the implications and just in denial. This is industrial revolution again. No profession or industry will survive this without a fundamental change. Existing education and experience will become significantly less valuable. Old careers will disappear and new ones emerge, beyond anything that we can imagine now. Change is the most frightening thing in the world and people will continue to fight it long after they have already lost.",
                "author": "Free_Break8482"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's official—China deploys humanoid robots at border crossings and commits to round-the-clock surveillance and logistics",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it's \"official\" is there a better source than this random Spanish regional newspaper?",
                "author": "mr-english"
            },
            {
                "raw_content": "Looks like Chinese population collapse won’t matter",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Everyone wants the AI powered utopia with no crime or hunger but doesn’t want to pay for it. This is how the bill is paid… a surveillance state. How else can you prevent all crime and death? You must be watching people all the time.",
                "author": "i-love-small-tits-47"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Flash can reliably count fingers (AI Studio – High reasoning)",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/hbq5b0karq8g1.png?width=774&format=png&auto=webp&s=25522f28d28fa1a3d3f3d47f935bba84803d100f",
                "author": "pavelkomin"
            },
            {
                "raw_content": "https://preview.redd.it/5wu8k2buoq8g1.png?width=801&format=png&auto=webp&s=b4eba417c70208373b4041d5c3b09902139196c9",
                "author": "pavelkomin"
            },
            {
                "raw_content": "https://preview.redd.it/kf6ysnwbpq8g1.png?width=490&format=png&auto=webp&s=b4b10eab3ebb18a34be8d41e479a07730528770b",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    }
]