[
    {
        "post_name": "BREAKING: THE US MILITARY IS NOW STRIKING IRAN, PER MULTIPLE REPORTS The strikes are occurring WAY beyond Tehran “This is NOT solely an Israeli action. And it is NOT a small strike.”",
        "score": 195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "all this and yet not ONE SINGLE ARREST",
                "author": "Thermopylae_MMXX"
            },
            {
                "raw_content": "I thought this problem was solved with the \"12 day war\"? I'm so tired of being a vassal state for a bunch of Baal lovers.",
                "author": "JaoBaiDon"
            },
            {
                "raw_content": "Oh lordy, not another middle eastern jewish war.",
                "author": "VonArman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US ATTACKS IRAN - DESTROYS CAPITAL AND ALL OF THEIR LEADERS",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we got international warmongering so bankers can get richer and eat/rape more babies, before we got one single arrest conviction in US",
                "author": "Thermopylae_MMXX"
            },
            {
                "raw_content": "They killed Charlie Kirk for this. He was the voice of reason standing on Trump's shoulder. On the other shoulder is Netanyahu.",
                "author": "fluffykitten"
            },
            {
                "raw_content": "I’m so tired of our “greatest ally”.",
                "author": "MakeCaliforniaRED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP'S VIDEO STATEMENT",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Getting pretty tired of fighting wars for Israel.",
                "author": "UnapprovedNarrative"
            },
            {
                "raw_content": "\"Combat operations\"",
                "author": "Dangerous"
            },
            {
                "raw_content": "I asked him if it's a bad time to ask if we can arrest any epstein clients.",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another victim of a violent criminal",
        "score": 1038,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Our country has really lost its way. It appears that the illogical thing for white women to do -- avoid taking public transport. Revoving door courts are permitting these multi-felons in our society over and over. Buses and trains are deathtraps. That makes no sense whatsoever. Honestly, we need about 200,000 Daniel Penny types nationwide.",
                "author": "16BeatsAOne"
            },
            {
                "raw_content": "Get the third world out of the first world. NOW",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "White person randomly attacks a black is always a hate crime 100% of the time. But when they do it, it's just a statistic.",
                "author": "XxxRDTPRNxxX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr. to Joe Rogan: \"I've been SURPRISED by how much President Trump has supported me on this stuff — because I'm going after big pharma, big insurance, big food.\"",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "``` ``` Dear JOE, ``` ``` If you have that much INFLUENCE, please PERSUADE our GEOTUS to release ALL files related to EPSTEIN, including but not limited to the R*PE footage. ``` ``` BILL CLINTON is in the videos, and the PUBLIC has the RIGHT to know. ``` ```",
                "author": "BaIIots0nRubysUSB"
            },
            {
                "raw_content": "I meet too many kids today that receive every vaccine and survive primarily on sugar cereal, frozen veggies, and dino nuggets",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "If we had a better congress we could get a lot more progress on these fronts.",
                "author": "Roadpower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California parole board released a child molester serving a life sentence. The serial child molester used candy and toys to lure children seven years old and younger. The police were able to rearrest him luckily.",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put him in gen pop. Let the other inmates take care of him.",
                "author": "China4Biden"
            },
            {
                "raw_content": "imagine this guy serving time for molesting children and by luck, he gets released back into society, and his first act of being free is molesting children again. Some of these demons cant be saved, but Califirnia will sacrifice children in the name of progress.",
                "author": "thisguy883"
            },
            {
                "raw_content": "He’s being charged with new crimes by a different DA this week, he may not get out after all: https://www.abc10.com/article/news/local/placer-county-district-attorney-david-allen-funston-charges/103-8de8d275-439d-499d-9c2a-7e6f64aeba86",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mr Trump Goes to Whataburger",
        "score": 825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whataburger. Grew up eating them. I could eat one for every meal.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "anybody that don't just love that guy has a mental illness.",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "CNN: Trump caught buying votes at a locap Whataburger.",
                "author": "Womb___Raider"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MOST WATCHED STATE OF THE UNION SINCE 2003",
        "score": 485,
        "text_content": "",
        "comments": [
            {
                "raw_content": "``` ``` # FUCK YEAH # RESPECT THE FUCKING POTUS ``` ``` Sir, it is fucking TIME for CIVIL WAR. YOU need to lead US down the righteous path of what happens next. ``` ``` # CAN I GET AN AMEN? ``` ``` # OOOOOHHHRRRAAAHHHH! ``` ```",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "*And this is why the MSM do NOT want them televised or otherwise aired live*. It was KILLING them that Trump was exposing the Democrats. Seriously, Trump didn't miss a beat as both Omar and Tlaib tried to talk over him--he just kept going and didn't lose his train of thought. Picture Joe Biden in the same situation. The MSM want to do what they do best, and apply that to the SOTU addresses: decide what we should see and edit them. Instead, they would've cut to Joy Reid's Democrat ape and giraffe clown show so we'd see what they were bitching about *because they knew damn well no one would be tuning in to hear what's her name's Democrat response*.",
                "author": "mateus"
            },
            {
                "raw_content": "Remember, according to CNN, only 90 percent of State of the Union watchers absolutely LOVED the speech, but that is only the largest viewing audience ever recorded for. SOTU.",
                "author": "me-no-likely3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey Minnesota, so where's my money, man?",
        "score": 400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In Somalia, for building new huts.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "I'm easy to pay back. Just send me a crate of 3 round burst m4's and a pallet of ammo for each one.",
                "author": "CLF3"
            },
            {
                "raw_content": "how much does Ukraine owe us?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O'Keefe got undercover footage of a Senior Department of Justice Investigator confirming THERE IS FOOTAGE of Bill Clinton and Jeffrey Epstein having sex with underage victims on his plane “Rapes occurred while Bill Clinton was on the plane’”",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just need more proof",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Poor james risking his life going in enemy territory to uncover all these corruption but I still haven't seen a meaningful arrest.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "So are they going to admit Epstein was CIA to try to get people to not mention mossad?",
                "author": "NazisWereSocialist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Bee...",
        "score": 374,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We tried locking Hillary up... she ended up killing Epstein.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "One of my kids said they read it in norm mcdonald's voice. kek",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Link - https://babylonbee.com/news/hillary-clinton-says-she-only-recalls-meeting-epstein-that-one-time-when-she-murdered-him",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI record contained in the Epstein Files reveals that the FBI's NYC office was \"hacked\" in 2023, the night of the Superbowl, erasing some 100TB of data from evidence due to the intrusion",
        "score": 1133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "See! See! That's when they scrubbed all the dRumph proof! ---The View Watchers, definitely",
                "author": "Pederella"
            },
            {
                "raw_content": "That’s only part of what was discovered at the FBI. A new file classification was discovered allowing high level officials to hide case files.",
                "author": "BornAgainTexan"
            },
            {
                "raw_content": "Convenient",
                "author": "Tim_Berframer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is a Rehearing or Readjudication of this case possible???",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Ready to cross the Rubicon yet? Globohomo is going to keep whipping your ass until you put them down.",
                "author": "CommieCrats"
            },
            {
                "raw_content": "When being asked for windfall repayments, use the most powerful word in the universe: No.",
                "author": "Slugbert"
            },
            {
                "raw_content": "Do what the fuck you said you were going to do. If you do not ignore judges then you wasted 12 years of your life and awakened a woke beast that we will have to deal with for the next hundred years.",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says he’s considering nominating Ted Cruz to the Supreme Court.\"I'm thinking about putting him in the SCOTUS.He's the only guy I'd know who'd get 100% of the Democrat vote,100% of the Republican vote, they want to get him out of there, he's such a pain in the ass, but he's so good & talented.\"",
        "score": 769,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dude wtf is up with Trump. Non stop horrible decisions over and over. I swear he is intentionally throwing the midterms. This is Bush level fuck ups.",
                "author": "ThatsDoable"
            },
            {
                "raw_content": "I’d rather he nominate Ken Paxton.",
                "author": "MrTexan"
            },
            {
                "raw_content": "Ted Cruz is a faggot.",
                "author": "Simple_Doot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EPSTEIN HEARINGS PT. 1 & 2",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link to Ben Garrison cartoon https://grrrgraphics.com/hillary-takes-the-stand/",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "I’m shocked he drew her with both shoes on",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "I’m curious about their Zorro ranch connections.",
                "author": "desertflower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump has officially endorsed Dan Huffines, the new owner of Jeffrey Epstein’s Zorro Ranch, for Comptroller in Texas. [Trump TS post in comments]",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "``` ``` So, ``` ``` He must have made the BIG BUCKS SURPLUSING the equipment from the basement at Zorro, Scientific EXPERIMENTS were going on there with EPSTEIN's eugenic breeding PROGRAM. ``` ```",
                "author": "BaIIots0nRubysUSB"
            },
            {
                "raw_content": "Just voted for Huffines today. Shame Texas didn't elect him and boot out spineless Gov. Abbott. I voted for Doc, but I get that's merely a protest vote.",
                "author": "bill_in_texas"
            },
            {
                "raw_content": "Early voted for him today.",
                "author": "Kek_The_World"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lord, I see what you've done for other people, and I want that for me",
        "score": 1271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I applaud them for doing the right thing for their people, every nation should act this way.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "OK fine. But try your hardest to get the models with the lightest skin in the middle.",
                "author": "RocketSprocket"
            },
            {
                "raw_content": "Two can play that game.",
                "author": "HeyBlinkin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For the Cap",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cuban chicks DO have awesome asses. And they're totally cool babes since their families fled communism.",
                "author": "YellowStoneDeepState"
            },
            {
                "raw_content": "Guy needs a threesome",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "u/CaptainQuip 's idea",
                "author": "blockchain-the-vote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump shows off his new boat to the press:",
        "score": 963,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the name of that massive thing? The Chris Christi?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Should have tapped on it and said “can fit a lot of illegals in one of these”. That would have sent them into a death spiral!",
                "author": "Beaverstatemilitia"
            },
            {
                "raw_content": "How can anybody hate this guy? He's just so much fun.",
                "author": "grandfather_nurgle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clinton only took 27 flights on Epstein’s plane. Everyone knows it takes at least 28 before you really get to know a guy",
        "score": 1602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol... The plane being named 'The Lolita Express' totally went over little Bill's head.",
                "author": "loooooof"
            },
            {
                "raw_content": "Oh yeah,Clinton is such a well known defender and protector of abused women and children! Just ask Juanita!🙄",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "BILL",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PS5 Pro owners will soon get an improved PSSR AI upscaler, while PC gamers with RDNA 2 and 3 GPUs are still praying for AMD to add official support for FSR 4",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No new PS until 2028, and possibly 2029 without some significant change to the market for hardware. AI upscaling is meant to hold things over until the hardware market becomes more amenable. Imagine a console having a 9 year lifespan now. Essentially one per decade.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "The PS5 Pro has custom blocks that allows ML upscaling at reasonable frame times https://youtu.be/lXMwXJsMfIQ?si=dJ8tpmhpwJpOuUWs&t=1170",
                "author": "From-UoM"
            },
            {
                "raw_content": "Seems like another needless drama baiting article. Ps5pro's gpu has customizations made to power ml upscaling better than rdna3 and rdna2 can, so it makes sense that the ps5pro can handle fsr4 better **Ps5pro: 300tops int8 matrix** **7900xtx: 120tops int8 matrix** **9070xt: ~400tflops fp8 matrix dense** **9060: 170tflops fp8 matrix dense** 7900xtx is the only rdna3 sku that comes close to the lowest rdna4 dgpu in matrix tops/tflops and even then it's off by 50tops. It ain't a surprise that rdna2 and 3 are gonna struggle with fsr4 Gaming and tech journalism has run out of tech news due to the slow down of hardware launches from the rampocalypse that sensational articles like these are all they do now.",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Digital Foundry] It's Official: New PSSR Confirmed For Resident Evil Requiem + FSR 4/DLSS 4.5 Comparisons",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**TLDW:** PSSR 2 is a massive improvement over the previous version. When it comes to image quality, PSSR 2 and FSR 4 seems to trade blows against each other and i found that very interesting as i thought before PSSR 2 is going to be a lesser version of FSR 4 FP8 on PC RDNA 4 due to it being ran on INT 8 version of it, which is equivalent to the leaked unofficial version of FSR 4 that runs on RDNA 2 - 3. But here with PSSR2 that doesn't seem to be the case, both are nearly as good or sometimes even better depending on certain scenarios. As for direct comparison with DLSS 4.5 Preset L though yeah obviously Nvidia DLSS is still ahead and looks noticeably sharper, has more details and is more stable making it the still best Upscaler on the market right now. That said though, PSSR2 is still impressive usable upscaler. I just wish that the base PS5 got access to it which is stuck with FSR 1 rather than it being limited to PS5 Pro only. This makes the PS5 Pro version genuinely look a lot better than the base PS5 version. But the hardware limitation that Base PS5 which doesn't even have INT8 AI accelerator pretty much locks them out from having access to PSSR 2 / FSR 4.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "Impressive to be around FS4 level, wonder if there's any performance penalty at all over old PSSR. For RE9 specifically, it seems to be a massive oversight to not let people run PSSR2 outside of ray tracing, that's a significant image quality jump from FSR1 while being able to run 120hz, which most TVs are starting to support. Tangent, but apparently the somewhat worse (amount of footage/detail/speed) of PC-side videos on DF recently, can be kind of attributed to Alex dealing with some back issues.",
                "author": "-WingsForLife-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Global memory chip shortage impacting consumer electronics production",
        "score": 123,
        "text_content": "The ongoing DRAM and NAND shortage is constraining consumer electronics production. Rising demand and limited fab capacity have tightened supply, leading to longer lead times and pricing pressure. Full market normalization may still take several quarters.",
        "comments": [
            {
                "raw_content": "Hopefully no more AI refrigerators or AI toasters",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "How consumers are going to consume AI slop without devices?",
                "author": "-Outrageous-Vanilla-"
            },
            {
                "raw_content": "Sadly, this will lead to even shittier IoT devices, EMMCs, SoCs and everything else that comprise a shitty IOT device. But the bright side is that hardware security will be making an American resurgence in the wake of this product degradation 👍",
                "author": "OnlineParacosm"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "H2 Flow Riser Card: Engineering Safety & Design Explained",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that is one chatgpt ass written blog post.",
                "author": "EmilMR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New budget LG OLED is cheaper, brighter, but more reflective. 120hz, variable refresh rate, HDR10+",
        "score": 121,
        "text_content": "This new low tier panel will replace the display for many models of displays and looks close to top tier but lacks a layering that prevents light reflections. Note: link has a lot of ads",
        "comments": [
            {
                "raw_content": "No prices yet, but I'm interested. It's competing against MiniLED most likely at expected price points, but way more zones and not a smeary VA panel, will be smaller, however. It's ridiculous how large MiniLEDs are for the price. For light controlled/night watching only smaller rooms, these might be great.",
                "author": "-WingsForLife-"
            },
            {
                "raw_content": ">New budget LG OLED is cheaper, brighter, but more reflective. 120hz, variable refresh rate, HDR10+ You mean \"new LG OLED panel\", right? Because the OLED in the article is an OLED TV from Panasonic. >The Z86C (known in Europe as the Z85C) is the only new OLED from Panasonic this year, because the company is keeping the Panasonic Z95B flagship TV and Z90B mid-range OLED from last year — the new one will slot in right below them. That's depressing for Panasonic (as if they didn't have too many problems on their TV division already).",
                "author": "mittelwerk"
            },
            {
                "raw_content": "Well collor me interested. A 42C4 in my dark gaming den with backlighting only is already heavenly. More brighter sounds more better. *Edit* NM, nothing under 55",
                "author": "COporkchop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Broadcom commenced shipments of an apparent industry first in the form of 2nm custom compute system on chip (SoC)",
        "score": 27,
        "text_content": "> The recipient of its first 2nm custom hardware is Fujitsu as part of the Japanese giant’s Fujitsu-Monaka project. Set for release in 2027, Fujitsu’s next generation of custom high-performance computing (HPC) hardware comprises Arm-based designs and is set to power FugakuNEXT, the next-generation of its flagship supercomputer and formerly fastest system in the world.",
        "comments": [
            {
                "raw_content": "Strange that they haven't mentioned where it was fabbed. Since its '2nm' I'd assume its by Samsung but the article names Intel and TSMC multiple times, even stating that they are both working towards 2nm, but zero mentions of Samsung.",
                "author": "ML7777777"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "11 mm in 1.25 nanoseconds (2022)",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Smartphone Shipments in 2026 to See Sharpest Decline on Record as Memory Crisis Deepens",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everything is a crisis nowadays.",
                "author": "BigBangBoomerang"
            },
            {
                "raw_content": "Can you believe it? A single private company with unlimited money glitch buying something they couldnt use yet, affecting billions of industries. I think everyone who is affected by this, should boycott that company and use the alternative.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "it is not 1 ring to rule all, but 1 company can destroy all. This happens if you put all your trust into 1 company or do not have backup plans. China is smart: they produce anything themselves.",
                "author": "games-and-chocolate"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Are we finally getting a Pokémon game that looks and runs good?",
        "score": 1685,
        "text_content": "Ngl, I wanted to get into Pokémon for a while but didn't because the new games just didn't seem great and the old ones where just told old for my taste. I have been waiting for a Pokémon game to hit the sweet spot, and this might be it. For the past few years, the Pokémon entries were just games only a Pokémon fan could love. Is this the turning point where Pokémon matches up with the times?",
        "comments": [
            {
                "raw_content": "As long as this game is a SW2 exclusive, then yes, it will. Hopefully.",
                "author": "simple-heretic"
            },
            {
                "raw_content": "Probably it already looks pretty good and its not coming out till next year plenty of time to make the game even better",
                "author": "CSBreak"
            },
            {
                "raw_content": "I think we may be getting one that runs and looks decent with good looking water.",
                "author": "SwashNBuckle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Comparisons between Pokemon Scarlet/Violet and Winds/Waves (courtesy of GVG)",
        "score": 2156,
        "text_content": "Taken from this video: [https://www.youtube.com/watch?v=HTgxNkGKSu4](https://www.youtube.com/watch?v=HTgxNkGKSu4)",
        "comments": [
            {
                "raw_content": "I think I'll wait until WiWa are out before I start comparing them.",
                "author": "Williekins"
            },
            {
                "raw_content": "I noticed the grass and vegetation looks way better, still not the best but really an improvement. The water and underwater footage sold me though",
                "author": "edengamer253"
            },
            {
                "raw_content": "And this is a year before release, thank god they’re letting it cook some more",
                "author": "chaotikz7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GKCs have never looked so premier (Resident Evil Generation Pack for NS2)",
        "score": 294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/x2lweh77t5mg1.png?width=310&format=png&auto=webp&s=cd68515d48f4e99a5d499a1eb87de71aed271c93 I would have laughed if they did this.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "The front cover is looking like LOTR extended edition dvds",
                "author": "tlotrfan3791"
            },
            {
                "raw_content": "Would be god tier if they weren't GKC",
                "author": "sirstiv"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Gen 10 announced",
        "score": 3394,
        "text_content": "(For Switch 2 exclusively) For more information, visit [Pokémon Winds and Pokémon Waves: Official News](https://www.pokemon.com/us/pokemon-news/see-the-new-trailer-for-pokemon-winds-and-pokemon-waves-coming-to-nintendo-switch-2)",
        "comments": [
            {
                "raw_content": "2027 is crazy The suits letting the devs actually cook and not rush stuff out after years of stumbling along Also I get to take my Palossand and Jellicent into the new region in 2028 lmao",
                "author": "CrescentShade"
            },
            {
                "raw_content": "Glad they’ve left switch behind this time. Was holding it back for sure",
                "author": "weirdbearduk"
            },
            {
                "raw_content": "I GASPED when I saw it underwater. We are SO back!",
                "author": "dreamingwithcindy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "20 years together",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The game looks better than I expected on the switch 2, doesn't seem stretched or blurry.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "https://preview.redd.it/u8ditem5w3mg1.jpeg?width=4000&format=pjpg&auto=webp&s=11c986fe33b90174b2abb20280582039aede267f I never beat the original as a kid but maybe I'll go all the way this time",
                "author": "Nas160"
            },
            {
                "raw_content": "I know there’s no switch 2 version but does the game run in 1080p handheld?",
                "author": "friesb4guys300"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Wind/Waves In-Game Trailer vs Rumor/Datamined Screenshot Comparison",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It should be mentioned that the first bottom pic is a concept art, not gameplay",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "I am just glad that they aren't going to release a switch version since it would take resources away from just trying to make it as good as possible on the switch 2.",
                "author": "smeeagain93"
            },
            {
                "raw_content": "The Switch generation of Pokémon games made me feel like I’ve outgrown the series and I’m hoping this one proves me wrong.",
                "author": "Rocknb69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil 9 Requiem (its not even close)",
        "score": 443,
        "text_content": "I have started playing RE:9, about 45 minutes in, and had to stop just to look around and appreciate the beauty that is Resident Evil 9 on Switch 2. I thought Cyberpunk 2077 had the best graphics so far, RE: 9 takes the crown, and it’s not even close. I had to stop myself several times to make sure I wasn’t playing on my Series X. This was/is my most anticipated release of the year and it is not disappointing - can’t wait to jump into RE 8 next!",
        "comments": [
            {
                "raw_content": "I’m battling back and forth to get the Switch 2 or PS5 Pro. Mainly because I mainly play on my Switch 2 for convenience.",
                "author": "TripleS82"
            },
            {
                "raw_content": "Not sure RE is my kinda genre but if they can get those games looking so good then it inspires confidence in what else might be possible.",
                "author": "Late_Pomegranate2984"
            },
            {
                "raw_content": "To be fair, Cyberpunk is a huge open world. But yeah, RE Engine absolutely cooks.",
                "author": "dcheung87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Its so funny to me they added a windmill in the trailer just because the ones in Scarlet/Violet were so bad",
        "score": 433,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also maybe because, Pokémon winds.",
                "author": "hobbitfeet22"
            },
            {
                "raw_content": "The trailer for Pokémon Legends Arceus was blatantly edited to say “Remember Breath of the Wild? That’s kinda what we’re going for.” The trailer for Wind and Waves was blatantly edited to say “Remember Scarlet and Violet? That’s not at all what we’re going for.”",
                "author": "Soft_Researcher702"
            },
            {
                "raw_content": "They probably added it to emphasis \"wind\" more than a callback to the previous games issue.",
                "author": "Venator850"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "They forgot about something",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They probably think staggering them out will encourage people to play them both. It's still strange that they're doing the second game first though.",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "Meanwhile pokemon mystery dungeon I'm surprised we got a remake in the switch 1 ![gif](giphy|DqU4wVBxXOhNu)",
                "author": "PlantQuick"
            },
            {
                "raw_content": "maybe they’re waiting for ruby and sapphire 🫠🫠🫠",
                "author": "myghostflower"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Per Jason Schreier (Bloomberg) \"NEW: Last year, Bluepoint Games pitched a Bloodborne remake. Sony didn't turn it down... but FromSoftware did.\"",
        "score": 3995,
        "text_content": ">https://bsky.app/profile/jasonschreier.bsky.social/post/3mfuj367ur22a Link to his bluesky with the bloomberg link",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "It's true because it's a rumor deconfirming bloodborne",
                "author": "proficient2ndplacer"
            },
            {
                "raw_content": "So the rumors are true, nobody can touch Bloodborne without From Software's permission",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jeff Grubb says \"It's exactly what happened\" referring to recent reporting that FromSoftware rejected a Bloodborne remake. Expects it not to happen \" until the relationship cools down\" between Playstation and FromSoftware.",
        "score": 437,
        "text_content": "[https://xcancel.com/JeffGrubb/status/2027595228689899650?s=20](https://xcancel.com/JeffGrubb/status/2027595228689899650?s=20) He also says in the tread that he's heard the rumour that FromSoftware didn't like what Bluepoint and PlayStation did with Demon's Souls but seems not know if it's true as he \"would only be guessing\"",
        "comments": [
            {
                "raw_content": "#Jeff Grubb is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Kinda seems like it's been something of an open secret in the industry that the holdup was always From not wanting anything to be done to Bloodborne without their involvement rather than Sony just not wanting to Like, [this isn't even the first time Grubb's said as much](https://www.youtube.com/live/k9OggMjX3Q0?si=w9YB561q1jZ63aJw&t=1442). I guess it's more that now Schreier's on record confirming it, people are ready to finally believe it",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "\"Until the relationship cools down\" ??? What could they possibly be butting head over if anything? Shu's theory (I guess confirmed now) and Jason's article makes me think Miyazaki and co. want to do anything with Bloodborne themselves and Sony respects that and doesn't want to piss off a partner they respect and want on their good side",
                "author": "notewise"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Jason Schreier (Bloomberg) these were the titles Bluepoint Games pitched that were rejected by Sony",
        "score": 678,
        "text_content": "- An updated version of their Shadow Of The Colossus Remake - A Ghost of Tsushima spinoff https://www.bloomberg.com/news/newsletters/2026-02-27/sony-s-bluepoint-pitched-bloodborne-remake-before-closure?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc3MjIyMjY3OSwiZXhwIjoxNzcyODI3NDc5LCJhcnRpY2xlSWQiOiJUQjRWUTJLR0NURlowMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.s6maZIveh-F152mZBWUNjPFeE0Lm7AFRegwaizQvVlA&leadSource=uverify%20wall",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Infamous, and Killzone sitting right there guys. Why redo Shadow of the Colossus? Imagine the reaction Sony would get from remaking Shadow of the Colossus again dog. They would never beat the remake allegations.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "I really like Bluepoints remakes but if their best pitches since getting acquired were an Atreus live service game, another Ghost, and a remake of a remake, then they didn't do themselves any favors. You'd have thought a bunch of ex Retro devs would have more original ideas than that",
                "author": "NandoFlynn"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Maximillian Dood's earlier tweet about Bloodborne appears to be speculation based mostly on old public interviews with Miyazaki rather than any firsthand insider info about the situation",
        "score": 149,
        "text_content": "Previous post: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rgnx5g/maximillian\\_dood\\_just\\_to\\_add\\_to\\_this\\_whole/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rgnx5g/maximillian_dood_just_to_add_to_this_whole/) In reference to this earlier tweet Max made today: >Just to add to this whole Bloodborne drama, Miyazaki did not hate the Demon's Souls remake, nor was it likely the breaking point on doing a remaster. Will talk about it more tonight Many understandably interpreted this as Max having insider info about the situation due to how he phrased it, however he went on stream tonight and only referenced the previous public interviews with/ related to Miyazaki that have been going around today on social media (The Shuhei interview, and the two Miyazaki interviews about Demon's Souls Remake), as well as one personal interaction he had with people working on Soul Caliber unrelated to anything about Miyazaki's personal opinions on Demon's Souls Remake, so he doesn't seem to have any actual insider info related to Miyazaki's opinions. Max before pulling up the old interviews: >Before we get into it, and I pulled up a couple of old articles that go back like 4-5 years -theres one that I need to try to find- um..**Nobody has direct communication with Miyazaki**, whos like an executive lead at FromSoft, right? And who has been there for a very long time. **Nobody has direct communication with this dude, with his thoughts, his wants, his desires and his needs. We just dont. Unless, he gets into interviews and starts talking about shit. AND HE HAS! He legit has!** And then he proceeds to go into the old interviews that we've all seen today In terms of the Soul Caliber part (it seems this is what was being referenced earlier when people were saying that he was saying he has insider knowledge), It's kind of hard to hear who he describes he was talking to (it sounds like people working on a Soul Caliber game who were looking for input) but basically he talks about how he was expressing his hype about the possiblity of Bloodborne crossing over with Soul Caliber at one point in time and was told thats never going to happen because they \"wouldn't dare ask them(Fromsoft) for that\". So basically Max is citing this interaction as knowledge that informs his speculation on how the industry interacts with FromSoft/Miyazaki in general, but he doesn't appear to have any firsthand knowldege related to the Demon's Souls Remake situation. He was just thinking back to that situation to add to how he is speculating about how the industry handles things with FromSoft Max talking about Miyazaki in reference to old interviews: >\"He has acknowledged he has wanted Bloodborne to show up on modern hardware in some way, so the weird thing is like why is everything off the books now? Why is everything now suddenly different? **I don't know!** I don't know if his feelings have suddenly changed, other than him just being busy. \" \\- >\"So, what changed I wonder? **This is all speculative my dude, this is all completely speculative**\" And then he goes on to speculate why he believes the situation changed. So to sum it up, he appears to be just as in the dark as everyone else and is just speculating, rather than having any sort of actual insider knowledge on Miyazaki or even hearing anything from insiders about Miyazaki's thoughts on Bloodborne/Demon's Souls Remake. It's just his personal opinion he formed from reading the past interviews You can watch where he starts talking about it here about 3 mins in (Can't time stamp because of it being a livestream): [https://www.youtube.com/live/9kkYbkJd7hA?si=hbo94J0n8z0OtRNx](https://www.youtube.com/live/9kkYbkJd7hA?si=hbo94J0n8z0OtRNx)",
        "comments": [
            {
                "raw_content": "I like Max but he does tend to speak with authority that he often does not have",
                "author": "Jcslider52"
            },
            {
                "raw_content": "Called this a nothing burger in the previous thread and got downvoted for it lol [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rgnx5g/comment/o7t7p6k/?context=3](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rgnx5g/comment/o7t7p6k/?context=3)",
                "author": "carlosvigilante"
            },
            {
                "raw_content": "lol shocking, Max speaking as if he knows something when he truly doesn’t. He does this constantly with fighting games",
                "author": "Poetryisalive"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shpeshal Nick: Cory Barlog's next game is set in the GOW universe",
        "score": 141,
        "text_content": "[https://xcancel.com/Shpeshal\\_Nick/status/2027610630166089895](https://xcancel.com/Shpeshal_Nick/status/2027610630166089895)",
        "comments": [
            {
                "raw_content": "I dont think people should expect loki or kratos. This was well in development before Ragnarok and not having either of those 2 in it makes the \"feels like a new IP but isn't\" thing make sense",
                "author": "Odd-Assignment-1350"
            },
            {
                "raw_content": "Gears of War!? I certainly didn’t expect that",
                "author": "computerCoptor"
            },
            {
                "raw_content": "Finally, the Thor drinking sim I've always dreamed of",
                "author": "MistahJ17"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Watch Dog Legion might get \"director's cut\" version. New content, Night mode, new motion capture.",
        "score": 92,
        "text_content": "According to newest Insider Gaming podcast, Ubisoft might be working on a new version of Watch Dogs: Legion. This version should be something like a \"director's cut\". Tom also doesn't understand why it's in the work, but according to him - they are adding new content, some sort of - Night Mode, and new motion capture is being recorded right now. That might be - what Shinobi was saying - that Watch Dog is not \"quite\" done. Source: [https://www.youtube.com/watch?v=2E2PaBZzb\\_w](https://www.youtube.com/watch?v=2E2PaBZzb_w)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "> Tom also doesn't understand *why* it's in the works lol",
                "author": "MaxPaladin93"
            },
            {
                "raw_content": "Why. If any game in the franchise were surely you'd do the one people generally like in 2",
                "author": "SpaceGooV"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson shares new details on Assassin’s Creed Hexe",
        "score": 91,
        "text_content": "- They are completely redoing the combat with a lot of acrobatic moves ‘they hired a contortionist for the mocap’ - Ezio was planned to come in halfway through the game to teach the main character the ways of the Assassin (not sure if that is still the case) - This is seemingly the game many at Ubisoft Montreal want to work on - Now seemingly planned for holiday 2027 Source: https://youtube.com/watch?v=2E2PaBZzb_w&source_ve_path=MTc4NDI0",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Late 2027 does make sense. Black Flag remake this year, and more Shadows Updates will keep AC fans busy into next year. And Ubisoft has a few other things to release between now and then including Far Cry 7.",
                "author": "BetaBlacksmithBoy"
            },
            {
                "raw_content": "I mean realistically ezio is an old man so what’s he doing in Germany at this point. I’m pretty sure he would be at his home with Sofia. Unless this takes place before revelations",
                "author": "Jrod12155555"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate elaborates on Sony’s ‘shift’ from PC, claiming that they will be releasing fewer single player games on PC, but ports already in development may still be released.",
        "score": 676,
        "text_content": "https://xcancel.com/natethehate2/status/2027438633997734231?s=46",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "What ports are in development for PC currently? Yotei?",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I don't know what ports he mean. There is very few Sony PS5 games not ported. Ghost of Yotei? Demon Souls? Nothing comes to mind beside these really. Other games haven't even released yet. Almost impossible to see Astro Bot, and I don't think Gran Turismo can compete with Forza on PC and this one never had a PC port anyway.",
                "author": "TheCattBaladi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sapphire launches RX 9060 XT Black Diamond and Alloy Pulse S",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "8gb doesn't have legs at all. It's probably best to skip unless you need to build something right now for games that wouldn't use past 8gb vram. eSports titles? Games in the PS3, PS4 era?",
                "author": "gatsu01"
            },
            {
                "raw_content": "Only 8gb why waste the money",
                "author": "Soleks2000"
            },
            {
                "raw_content": "Meanwhile the Pure cards have been MIA almost since the RDNA4 launch.",
                "author": "chipsnapper"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More Homeowners Have a Rate Above 6% Than a Rate Below 3% For the First Time in 5 Years",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* 21% of U.S. mortgaged homeowners have a rate of 6% or higher, the highest share in a decade. 20% have a rate under 3%, the lowest share in 5 years. * The shift in mortgage-rate distribution reflects the fact that rates have been above 6% for nearly 4 years. * Redfin economists say this could be an opportune time to refinance: Rates are now below 6% for the first time in three and a half years. * For home sellers, the lock-in effect is fading. But some homeowners still feel locked in: 16% of homeowners are staying put rather than moving because they don’t want to give up their low rate, per a Redfin survey. For the first time in five years, more U.S. homeowners have a mortgage rate above 6% than a rate below 3%. More than one in five (21.2%) mortgaged U.S. homeowners had a 6%-plus rate in the third quarter, up from 17.1% a year earlier and the highest share since 2015. A slightly lower share (20%) of mortgaged homeowners have a rate under 3%, the smallest share since the end of 2021. That’s the second quarter in a row 6%-plus rates overtook sub-3% rates: In Q2 2025, 20.3% of homeowners had a 6%-plus rate, versus 20.2% who had rates under 3%. This marks a reversal from the pandemic and its immediate aftermath; the last time more homeowners had high rates than ultra-low rates was the third quarter of 2020, when rates were plummeting during the pandemic. This is according to a Redfin analysis of data from the Federal Housing Finance Agency’s National Mortgage Database through the third quarter of 2025, the most recent period for which data is available. To look at the data another way, 78.8% of homeowners have a rate under 6%, the lowest share since 2015. The Shift Reflects How Long Rates Have Been Elevated The share of homeowners with a 6%-plus rate is rising because until this week, when they dropped to 5.98%, mortgage rates had been sitting above 6% since September 2022. The longer rates stay high, the more people have high rates. On the other end of the spectrum, the share of homeowners with 3% or lower rates surged at the start of the pandemic, when mortgage rates plummeted to record lows. That prompted many homebuyers to move, taking on a new, low mortgage rate, and prompted many homeowners to refinance into a low rate. But now that four years have passed since sub-3% mortgage rates were available, they’re less common. People who are buying homes are taking on higher rates. For Homeowners With a 6%-Plus Rate, Refinancing May Save Money The weekly average mortgage rate is 5.98%, down from 6.76% a year ago and down from a two-decade high of 7.79% in October 2023. Refinancing isn’t as popular as it was in 2020 and 2021, when homeowners could get a record-low rate. But for some homeowners–the 21% of them who currently have rates above 6%–refinancing at today’s rates may make financial sense. “For homeowners with a rate north of 6%, this is a moment to run the numbers,” said Chen Zhao, Redfin’s head of economics research. “With average rates hovering at or just below 6%, some borrowers may be able to lower their monthly payment or their long-term interest costs by refinancing. It’s not the once-in-a-generation opportunity we saw in 2020, but it could provide meaningful savings.” A lot of homeowners are getting the memo: Refinance applications are up 150% year over year. Redfin economists expect more and more Americans to refinance as the year goes on, especially if rates stay around 6% or drop lower. The best time to refinance a home loan depends both on personal circumstances and mortgage market conditions; here’s advice from Rocket Mortgage on determining the best time to refinance. The Lock-In Effect Is Fading The spread in mortgage rates shifting toward the higher end of the spectrum is also meaningful for homeowners thinking of selling. For the last several years, many Americans have felt locked in by their low mortgage rates, unwilling or unable to give up their 3% rate to move and take on a higher one. But now that rates have been above 6% for much longer than they were under 3%, many people have grown accustomed to high rates and decided to move on, which is reflected in the rise in new listings over the last year. And with rates at their lowest level in nearly four years–albeit still double pandemic-era lows–the math has improved enough for some homeowners to make a move. Redfin agents in some parts of the country say some homeowners have given up on waiting for mortgage rates to come down significantly; many people who have been considering moving decided to go for it with rates closer to 6% than 7%. But some homeowners are still feeling locked in. Roughly one in six (16%) U.S. homeowners say they’re staying put in their current home rather than moving because they don’t want to give up their low mortgage rate. That’s from a November 2025 Redfin survey fielded by Ipsos; the question asked respondents who said they don’t plan on selling their homes soon why they intend to stay put. Of the 12 options, “I don’t want to give up my low mortgage rate” was the fifth-most commonly cited, after “I just like my home and have no reason to move”, “My home is almost or completely paid off”, “Home prices are now too high,” and “My children or other family members are still living in my home.” Here’s the full breakdown of where today’s homeowners fall on the mortgage-rate spectrum: * 6% or above: 21.1% of mortgaged U.S. homeowners have a rate below 6%, down from a record low of 7.3 in the second quarter of 2022 * 5%-5.99%: 10.2%, the highest share since the third quarter of 2020 (except Q2 2025, when it was 10.3%) * 4%-4.99%: 17.1%, the lowest share on record (before the pandemic, this was the most common mortgage-rate bucket) * 3%-3.99%: 31.5%, the lowest share since Q2 2016 * Below 3%: 20%, the lowest share since Q1 2021",
                "author": "SnortingElk"
            },
            {
                "raw_content": "And now time for the 6% portion to start dropping 😂",
                "author": "regaphysics"
            },
            {
                "raw_content": "I'm still shocked anyone ever had an interest rate below 3%. I never thought I'd see that in my lifetime.",
                "author": "guachi01"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10 year yield has hit 4%",
        "score": 163,
        "text_content": "We should see a further decline in the 30 year fixed mortgage rate.",
        "comments": [
            {
                "raw_content": "Can someone smarter than me tell me if this likely points to lower mortgage rates in the future or is this already priced into current mortgage rates?",
                "author": "vertizm"
            },
            {
                "raw_content": "This isn't good news. The 10 year is dropping because fears of a stock bubble and stagflation (high inflation report today) have caused investors to flee to safety (U.S. treasuries). The benefit from slightly lower mortgage rates will be outweighed by people not wanting to overpay for houses if they're worried about their jobs.",
                "author": "LatiBerg"
            },
            {
                "raw_content": "Interestingly, the yield curve is now in the same position (0.60) as it was in March 2001 and November 2007, the starting months of the Tech Wreck Recession and Great Recession. If history repeats, that probably means another recession is imminent. That will probably bring down home prices, though good luck buying a house if you don't have a job.",
                "author": "almighty_gourd"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seattle-area homes see smallest price cuts in U.S.",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surprising with all the Tech layoffs, but maybe they're getting good severance packages.",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "that must be why they're not selling https://fred.stlouisfed.org/series/ACTLISCOU42660 https://www.redfin.com/city/16163/WA/Seattle/housing-market i wonder how high inventory will go this year",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Today, Friday, February 27: We’re in the Fives",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "because economy is crashing",
                "author": "Beginning_Abrocoma86"
            },
            {
                "raw_content": "No way getting 5.6 with no points",
                "author": "NutmegManwithbigsack"
            },
            {
                "raw_content": "Yeah 5.99 on a 800k loan with points!",
                "author": "NutmegManwithbigsack"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "For the first time since 2022, the average U.S. mortgage rates is below 6%",
        "score": 22,
        "text_content": "The average long-term U.S. mortgage rate slipped this week below 6% for the first time since late 2022, good news for home shoppers as the spring home-buying season gets rolling. The benchmark 30-year fixed rate mortgage rate fell to 5.98% from 6.01% last week, mortgage buyer Freddie Mac said Thursday. One year ago, the rate averaged 6.76%. The average rate has been hovering close to 6% this year. This latest dip, its third decline in a row, brings it to its lowest level since Sept. 8, 2022, when it was 5.89%. Mortgage rates are influenced by several factors, from the Federal Reserve’s interest rate policy decisions to bond market investors’ expectations for the economy and inflation. They generally follow the trajectory of the 10-year Treasury yield, which lenders use as a guide to pricing home loans. Read more: [https://fortune.com/2026/02/26/what-is-mortgage-rate-below-6-percent-first-time-since-2022/](https://fortune.com/2026/02/26/what-is-mortgage-rate-below-6-percent-first-time-since-2022/)",
        "comments": [
            {
                "raw_content": "This should read as average for *new* mortgages. The average rate for all new and existing is probably somewhere around 4-5",
                "author": "jiggajawn"
            },
            {
                "raw_content": "As price and inflation remains the main things barring folks from homeownership this basically just means more people may push to refi.",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Affordability Fears Shake the Housing Market as Home Depot Sees Spending Slowdown",
        "score": 17,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "PSA: If you’re tired of $OPEN settlement spam, I actually looked into it so you don’t have to.",
        "score": 2,
        "text_content": "I’ve seen a few posts about the Opendoor settlement lately and usually, I just scroll past thinking it’s either a scam or for the \"lawyers only.\" But after seeing it for a while, I actually dug into the case filing. Turns out, there is a literal $39,000,000 pot of money sitting there for anyone who held between Dec 2020 and Nov 2022. If you bought the hype back then, you’re basically owed a \"refund\" on the management's bad math. I know the \"official\" deadline was on December, which is why people are getting annoyed, but there is a late claim window still open. I didn't feel like digging through my old 1099s from three years ago, so I used a [tool](https://11th.com/cases/opendoor-investor-settlement) to just link my broker and let it audit the whole thing. Look, they take a 20% cut for the automation, but honestly, I’d rather have 80% of a check I didn't know existed than 100% of a pile of paperwork I’ll never actually file. For me, It’s not free money, it’s our money that management shouldn't get to keep just because the process is annoying.",
        "comments": [
            {
                "raw_content": "I’m tired of spam from u/ThemeBig6731",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump goes on Truth Social rant about Anthropic, orders federal agencies to cease usage of products",
        "score": 3949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy how not wanting to enable mass surveillance on American citizens is considered radical left under this regime",
                "author": "Formal-Assistance02"
            },
            {
                "raw_content": "Ah yes, famous 'radical woke' policy positions like *checks notes* opposing mass domestic surveillance",
                "author": "acutelychronicpanic"
            },
            {
                "raw_content": "It's radical left to not want to take part in mass domestic surveillance? Wasn't the Republican playbook small government, don't tread on me, etc? Isn't this the exact opposite of that? I'm not American. I'm just watching... with popcorn... but the cognitive dissonance is wild.",
                "author": "cfehunter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Good Riddance.",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the good PR Claude is getting from this might make it worth it for them. 🤞💪",
                "author": "Alone-Competition-77"
            },
            {
                "raw_content": "Sam altman is a snake",
                "author": "CartographerAble9446"
            },
            {
                "raw_content": "Deleted data, cancelled subscription, removed app… done",
                "author": "throwaway0134hdj"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Outside Anthropic’s office in SF",
        "score": 2568,
        "text_content": "Source: [Roy E. Bahat on X](https://x.com/roybahat/status/2027455052655534440)",
        "comments": [
            {
                "raw_content": "I know the bar is low but I appreciate what they're doing.",
                "author": "Horror_Dig_9752"
            },
            {
                "raw_content": "Damn, crazy to see the public actually give a company support for once. Probably feels good to be an Anthropic employee at the moment.",
                "author": "oadephon"
            },
            {
                "raw_content": "Loose billions and government contracts Or keep Claude’s Soul? I’m willing to bet” Pet” Hegseth never read Claudes Constitution (and thinks it’s just an IBM 7090",
                "author": "OiAiHarmony"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boycott OpenAI?",
        "score": 636,
        "text_content": "At the risk of this post being instantly deleted by the moderators of this subreddit, should there be a discussion about boycotting OpenAI? Regardless of political views, ensuring a safe transition from our lives at present to a potential technological singularity should be something that we are all concerned about. As a non-US citizen I find it unbelievably concerning that the following timeline has occured: Anthropic rejects Department of War deal due to concerns regarding mass surveillance and autonomous weapon systems uses OpenAI support anthropic Trump tweets that Anthropic use be ceased immediately. Labels them a ‘woke’ company and implies designation as a supply chains risk OpenAI takes department of war deal The above reads eerily similar to the tactics of an authoritarian government and regardless of views should be highly concerning. The government elected by the people should not give companies the choice of supporting them or facing punishment. Boycotting OpenAI appears to be the only reasonable choice to me.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/l8kksvngv5mg1.jpeg?width=676&format=pjpg&auto=webp&s=eb065a7807c744d1ecb6ea018cafa5122a63ea8c",
                "author": "Moronicon"
            },
            {
                "raw_content": "I’ve been an open AI user *nonstop* everyday since GPT3 I cancelled my plan 5 minutes within seeing this, I can only hope my data is trully deleted.",
                "author": "vinigrae"
            },
            {
                "raw_content": "lets do so, after the political move from Anthropic and OpenAI, Claude deserves more paying subscribers migrating from GPT!",
                "author": "murkomarko"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Time to cancel ChatGPT Plus after three Years. Anthropic got nuked for having ethics, and Sam Altman instantly swooped in for the Pentagon bag.",
        "score": 282,
        "text_content": "The body wasn't even cold before OpenAI signed a deal to deploy on classified Department of War networks. And the absolute audacity to spin selling out to the military industrial complex as \"serving all of humanity\" is generational PR garbage. \"The world is a complicated place\" is just Silicon Valley CEO speak for \"the check cleared.\" Stop giving this company your $20 a month. You're just subsidizing their pivot to defense contracting. Cancel ChatGPT Plus. Switch to Claude. Support the only AI company that actually had the spine to say \"no\" to the government. Vote with your wallet.",
        "comments": [
            {
                "raw_content": "Yeah I can’t support this shit. I’ll miss ChatGPT but they’ve pushed me to the limit of what I can put up with.",
                "author": "a_boo"
            },
            {
                "raw_content": "Cancelled pedohitlerslavecatcherGPT today Subbing Claude tomorrow",
                "author": "Vusiwe"
            },
            {
                "raw_content": "https://preview.redd.it/0hflfg3bv6mg1.png?width=1024&format=png&auto=webp&s=f09323eede7c035fcd47833db89fce6b21ef85c5",
                "author": "inaem"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DoW says: trust me bro we won't use it for weapons or surveillance",
        "score": 465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is.. is this satire? I honestly can’t tell anymore. Did we really just go through the last 24 hour odyssey with Anthropic to OpenAI selling out in an evening flat lol?",
                "author": "WhoKnewTech"
            },
            {
                "raw_content": "You know I'm starting to think the name department of war is a red flag",
                "author": "Nukemouse"
            },
            {
                "raw_content": "it makes literally zero sense that openai got the DOW to agree to this when they refused to do it for anthropic unless u imagine that this entire thing was just a little sneaky plan between sam & the trump administration to break anthropic's contract & give it to openai",
                "author": "petermobeter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Katy Perry, with 85 million followers, subscribes to Anthropic",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just cancelled my 3+ year old ChatGPT subscription Will continue my Claude/gemini",
                "author": "Individual_Ice_6825"
            },
            {
                "raw_content": "Well done! I have just cancelled my 200€ per month subscription with oai",
                "author": "Leather-Objective-87"
            },
            {
                "raw_content": "\"You guys see what I'm doing? I'm riding the latest wave of \\*How to appear to be a good person on the internet\\*, look how good I look now!!!\" I don't trust celebrities one bit.",
                "author": "Gnub_Neyung"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Pentagon designates anthropic as a supply chain risk",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's the goal here? Why does the US government need Anthropic to back down? Can't the US just use a different model/provider? You know, standard procurement process. Bit of a rhetorical question.",
                "author": "4PowerRangers"
            },
            {
                "raw_content": "this is what actual authoritarianism looks like. the government is trying to force a private ai company to participate in warfare against its own safety guidelines. when anthropic says no because they actually have ethical boundaries, the administration weaponizes federal agencies to try and destroy their business. the party of \"free markets\" is throwing a dictator level tantrum because a tech company actually has a spine and won't let its product be used to kill people. weaponizing national security designations just to punish dissent is peak fascism. massive respect to anthropic for standing their ground and not folding to these absolute weirdos.",
                "author": "Rare-Site"
            },
            {
                "raw_content": "As a Greek, I’d like to add a small but perhaps meaningful detail: the word 'Anthropos' (human) literally means 'the one who looks upward' (άνω θρώσκω). ​It feels right to see a company named Anthropic defending human ideals this way. It reminds me of what Protagoras said: 'Man is the measure of all things.' At the end of the day, it is horrific enough when a human kills another human. It is infinitely worse when a human is killed by a machine without any supervision or conscience. They are truly honoring their name with this decision.",
                "author": "OnlineJohn84"
            }
        ],
        "subreddit": "singularity"
    }
]