[
    {
        "post_name": "FAMILY FROM HELL - Bondi Beach terrorists were father and son who legally owned 6 guns — despite tough firearms laws",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There’s another article I almost decided to sticky, and it talks about how news coverage isn’t mentioning that they were Muslims from Pakistan.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Port Arthur 2.0 (2025 version). \"Quick, bring in more gun control\" (and more low IQ middle eastern goat rapists)",
                "author": "no_public_id"
            },
            {
                "raw_content": "I feel bad for the law-abiding gun owners in Australia Their draconian government is going to go full-on search and seizure now",
                "author": "realPhantomFuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats incited their base to target Conservatives with political violence. It’s open season on Conservatives now. Will any Democrat leaders address the violence epidemic on their side??",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will they? No, they won't. How can morons be so credulous and naive as to think the left isn't chortling with glee right now?? **They are a Death Cult.** Murder-death-kill is the inevitable consequence of hard-leftwing, 'nihilism entrapment'.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "Another white christian murdered. Society will forget. God will remember.",
                "author": "IntergalacticWalrus"
            },
            {
                "raw_content": "Will Trump address this? No. And then he wonders why he will get crushed in the midterms.",
                "author": "Iremembermypassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rob Reiner’s wife Michelle took this photography of GEOTUS.",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never forget that part of the reason that the left hates Trump so much is that they really did believe he was part of their big nasty club. And then they found out they were wrong.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "I hope Trump wakes up to the idea that God saved him (likely) from assassination for more than playing softball with democrats and cuckservatives. Cross the Rubicon.",
                "author": "IntergalacticWalrus"
            },
            {
                "raw_content": "Rob got cuck'd by DJT? That explains it.",
                "author": "InJailOutSoon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arizona Couple Sentenced in $1.2B Medicare Fraud Scheme | Jim Mishler, Newsmax The owners of several Arizona wound graft companies have been sentenced in federal court for orchestrating a massive Medicare fraud scheme that generated more than $1.2 billion in false claims.",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How are you able to make literally 75 posts an hour for an Iranian narrative and you’re not banned that’s crazy",
                "author": "LikeThemSpicy"
            },
            {
                "raw_content": "Crazy how easy it is for a woman to figure out that billing insurance up to a billion dollars goes practically unnoticed. I wonder if they only billed a few million and quit while they were ahead if they would ever have been caught Tldw: they will serve 80% of their 17 year federal sentence. Good!",
                "author": "newuser8"
            },
            {
                "raw_content": "Arizona has been ground zero for corruption and take over ever since the old AZ Governor Jan Brewer publicly chastised Obama. https://duckduckgo.com/?q=jan+brewer+obama&ia=images&iax=images&iai=https%3A%2F%2Fazcapitoltimes.com%2Ffiles%2F2012%2F12%2FObama-Brewer-e1419862626394.png RIP what was a wonderful, conservative state.",
                "author": "IntergalacticWalrus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have read many articles about the Bondi beach muslim terrorist attack. Literally every article about Sajid Akram and his son fails to mention two facts: 1) They are Muslim 2) The father came from Pakistan",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bacon is the answer. If you eat bacon you are less likely to become a low IQ terrorist.",
                "author": "no_public_id"
            },
            {
                "raw_content": "And ALL articles blames guns. Like killer SUVs there are also guns that it looks like they act by themselves. AI guns is next to blame? They'll NEVER bring the immigrants or Muslims issue.",
                "author": "AR_MAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tulsi announces proof of election theft",
        "score": 1233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m expecting indictments in 2 weeks!",
                "author": "Winter_Is_Coming2020"
            },
            {
                "raw_content": "Gallows or shut up. We've all known it's been stolen since 2020. Question is... who has the balls to pursue it?",
                "author": "MickHigan2"
            },
            {
                "raw_content": "OP is a faggot. She didn't event allege election theft. She just said the machines are vulnerable. No fucking shit.",
                "author": "Patrick_Bateman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two people found dead at the home of director and actor Rob Reiner, authorities said. The LA Fire Department reported the victims were aged 78 and 68 — ages that match those of Reiner and his wife, Michele - reports",
        "score": 861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meathead is dead? Died of TDS.",
                "author": "FORMERCHILDSTAR"
            },
            {
                "raw_content": "He might have been a meathead jackass, but he gave the world some really wonderful films, and there's something to be said for that. Wish his family the best. God bless.",
                "author": "OpusX"
            },
            {
                "raw_content": "i won't celebrate the death of people I didn't like. I'm not like them. Sad",
                "author": "Barron_FromTheFuture"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Erika Kirk: Candace Owens and I are meeting for a private, in-person discussion on Monday, December 15. @RealCandaceO and I have agreed that public discussions, livestreams, and tweets are on hold until after this meeting. I look forward to a productive conversation. Thank you.",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I pray the Truth prevails. Whatever it is.",
                "author": "IntergalacticWalrus"
            },
            {
                "raw_content": "Gay drama for school girls. Who gives a fuck.",
                "author": "SimaYi"
            },
            {
                "raw_content": "She wouldn't be doing this if most of the public didn't think this whole thing reeks to high hell",
                "author": "Paxvobiscum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rob Reiner and wife Michele Reiner were kiIIed by their SON Nick Reiner, per PEOPLE WOW. This is getting crazier and crazier. This follows a call for medical aid to the Reiner home around 3:30pm PT",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look, murdering your family is bad and what happened is a tragedy. But just imagine Rob Reiner being your dad. That's all I'm saying. Also, found this on his wiki, which I did not know: \"Reiner served on the advisory board of the Committee to Investigate Russia. He and David Frum launched the site in September 2017 with Morgan Freeman warning people that \"We are at war\" and that Russia has attacked the United States. Others on the committee's advisory board at the time of launch included James Clapper, Max Boot, Charles Sykes, and Norman Ornstein. Additionally, in early November 2020, the advisory board included Evelyn Farkas, Michael Hayden, Michael Morrell, Leon Panetta, and Clint Watts.\" Oy vey meathead",
                "author": "taytaytay"
            },
            {
                "raw_content": "Does this mean everyone on the right gets to celebrate nonstop for months? I mean, that's what you're supposed to do nowadays when someone you don't like gets brutally murdered?",
                "author": "fskfsk"
            },
            {
                "raw_content": "Stabbed to death, how hard do you have to fail as parents for that.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump says the US has taken in $18 TRILLION due to tariffs.",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really really really want this to be true. There’s no way it’s true, but I really want it to be true. Maybe he misspoke, or was given bad data. But wow, if this were true! We could pay the debt off in a year or two, and then eliminate the income tax forever.",
                "author": "magamagamaga123"
            },
            {
                "raw_content": "That's... an awful misrepresentation. Its not $18T in tariff revenue. That number he repeats includes basically any and all business investment in the US. We've gotten about 1% of that as actual tariffs.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "He must have misspoke? Everything saying about $200B for this year E: ohhhh he’s saying we took in $18T (probably from all sources he had been talking about) and the tariffs contributed to that. Twitter user is likely misunderstanding and misrepresenting the statement",
                "author": "Stractor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Providence Police are now RELEASING Brown University person of interest Benjamin Erickson from custody",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hire DEI, expect DEI results.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "\"There's a killer on the loose, but remain calm.\"",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Biggest shit show since Uvalde.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✊🏻 White House Lobby 🇺🇸",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That iconic moment goes so hard.",
                "author": "spezisacuckold"
            },
            {
                "raw_content": "Seriously one of the most bad ass moments in Trump's history. That photo is unbelievably iconic in so many ways.",
                "author": "thisguy883"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115720167024828284",
                "author": "SmartWomenLoveTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota High School Threatens to Suspend Students Who Talk Positively About ICE",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do it and then sue when you’re punished",
                "author": "Trump454748"
            },
            {
                "raw_content": "Literally illegal.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Any student that get suspended should get in touch with Harmeet Dhillion and sue the school.",
                "author": "Scatter-Shot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Brown University mass shooting person of interest Ben Erickson was reportedly interested in GENDER EQUITY, and REFUGEE AND MIGRANT SUPPORT, per his LinkedIn profile. Imagine that.",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That looks like an AI photo me.",
                "author": "NukeTheNarrative"
            },
            {
                "raw_content": "Typical ANTIFA ideology",
                "author": "FlgPole"
            },
            {
                "raw_content": "It was a Jewish prof's class. Economic impact of worldwide immigration is her specialty. Economics class of one sort or another. Don't know if she is left or right, but she seems to have been attacked from the left. Don't know if she got killed.",
                "author": "LaptopDied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💀 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Brown University victim identified as 𝐄𝐥𝐥𝐚 𝐂𝐨𝐨𝐤 (𝟏𝟗), VP of the Republican Club...",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet another example of \"They want us dead!\"",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Political assassination on college campus against conservatives again. It will get buried.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "Democrats are terrorists.",
                "author": "ThreeTimeTrumper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brown University victim ID'd as Ella Cook (19), VP of the Republican Club",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One by one, they're gunning us down like dogs. If only we were in charge of all three branches of government...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Sounds like another leftist assassination of a right winger",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "My heart breaks for her parents and family and all the slain patriots families. Conservatives aren't having enough children to sustain these kind of losses. We used to have large families to support and stabilize our Republic but were unable to continue that life as the government proceeded to tax us into oblivion with it's commie-marxist assault on our Constitution.",
                "author": "OldBark2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This map showing the pro-Trump populist revolution is currently going viral in South America. Pro-Trump leaders in blue.",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they hadn't stolen Brazil from us just imagine what it would look like.",
                "author": "Cowboy888"
            },
            {
                "raw_content": "Is Judge Nosferatu in Brazil feeling the pressure yet?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "At this point, South America is becoming more based than Europe. It's simultaneously hilarious and depressing.",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“We got Drumpf this time yep The walls are closing in!!!” ~ Democrats",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'd like to thank him for being a friend.",
                "author": "TooBright"
            },
            {
                "raw_content": "Golden",
                "author": "SmartWomenLoveTrump"
            },
            {
                "raw_content": "COuld this picture be the beginning of the end for Trump?",
                "author": "White-tailed_Eagle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "People have profited off of the invasion",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fuck is going on in this country? Congress is fucking worthless pieces of shit.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Sick of these so called religious leaders. Scum bag.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "This has to STOP",
                "author": "The_kool_mom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"It is literally as if the world has spun off its axis, never to find balance again. I’ve never been more concerned about the future of the human race. And the worst part of all of it, is that it’s predictable, and therefore preventable.\"",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Satan is having his last days and he knows it. The world has felt like it's been devolving somehow. Jesus is coming; Jesus is King.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "\"I’ve lived through some terribly turbulent times in our nation and in the world. Vietnam almost tore this country apart. Watergate was a severe wound. The Manson murders shredded the fabric of our culture. 9/11 was shocking. The COVID pandemic and ensuing political madness were bitter and disgraceful. I now feel, however, that the disturbing malaise poisoning our current world is in many ways worse than all of these other events. It is literally as if the world has spun off its axis, never to find balance again. I’ve never been more concerned about the future of the human race. And the worst part of all of it, is that it’s predictable, and therefore preventable. Everything that’s wrong is staring us right in the face, and half this country simply will not join us in fighting and fixing it. It’s infuriating and depressing and maddening.\" James Woods https://x.com/RealJamesWoods/status/2000433445781357008?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "America has turned itself away from GOD and welcomed in the Devil, so now we get to enjoy Hellish things.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dell and Lenovo may limit mid-range laptops to 8GB DDR5 RAM in response to rising memory prices",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is 8GB midrange laptop in 2026 on anyone's bingo card? 💀",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "8gb ram while windows keeps stuffing AI junk into its systems and apps. Poor laptop's gonna end up like stuffing whole truck of food into a thanksgiving turkey.",
                "author": "QuirkySense"
            },
            {
                "raw_content": "They better make it user upgradable for those models that they limit to 8gb ram.",
                "author": "Deep-Technician-8568"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix reportedly eyes low-power DRAM foundry to fend off China memory surge",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cartel strikes again. Monopoly retained.",
                "author": "BenjiBoyOZ"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600 has a new innovation that's attracting Apple and Qualcomm",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Samsung Foundry has reportedly developed a “Heat Path Block” technology to counter the consistent thermal issues its previous flagship chipsets have faced. Samsung has since developed this semiconductor heat suppressing technology to reduce thermal impact and increase performance.\"",
                "author": "astrobarn"
            },
            {
                "raw_content": "[Illustration of what this is.](https://www.techpowerup.com/img/wJclWg3R5iC7jRab.jpg)",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "The relevant part: \"This Heat Path Block technology involves a copper heatsink that is packaged on top of a mobile AP\" Not exactly exciting cutting edge technology and phones will still be limited by the thermal capacity of the chassis.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell's computer prices are about to rise for corporate clients from Dec 17, increasing \"between 10% and 30%\" depending on the contract",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone’s thought on Dell’s corporate laptop business? We’ve had nothing but problems with them at my company. They’ll do crazy stuff like drive a repair technician from 6-8 hours away for a laptop repair. Their laptops severely degrade after around a year, and we’ve had like 1/2 of the laptops require at least one motherboard replacement. Then a lot of times if you put the laptop to sleep, the touchpad disables. Just kind of issue after issue for the crazy prices we pay. Kinda makes me angry they’re raising prices when I already feel we don’t get what we pay for",
                "author": "PugsAndHugs95"
            },
            {
                "raw_content": "Getting downvoted here by people who thought HBM wasn't going to impact consumer side and seeing all these articles is incredible. Reddit is like the Jim Cramer of social media sites. You bet against it and you're right like 85% of the time. More DRAM / NAND manufacturers would be great right about now.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Maybe i should buy a laptop right now instead of waiting for the newer versions next year to replace my more than a decade old that i have",
                "author": "Mongocom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel teases Arc B770, Panther Lake and Nova Lake performance 'looking seriously exciting' as mystery 300 W GPU rears its head",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does this need an article? It's a tweet by an official account praising their own product.",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "The B580 has 200W TDP, in a perfect world and TDP scales linearly, the B770 would be 50% faster, that would put it around the 5060Ti/9060XT. If the price also scales linearly, that would be around 375€, seeing that the 9060XT is going for 350€ now, it's gonna be tough competition.",
                "author": "ghostsilver"
            },
            {
                "raw_content": "I hope the Linux driver support and performance is good in these",
                "author": "Working_Sundae"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Following Tesla and Apple, Now AMD Too... Samsung Foundry's 'Counterattack' [Samsung may sport PS6-chip] (Korean)",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*— Article itself is in Korean —* The article states that according to South-Korean media reports, AMD is in talks with Samsung's Foundry-division about chip-manufacturing … While AMD will expressively **not** leave TSMC behind, especially not in the imminent advent of their N2-ramping (the majority of AMD's setup is scheduled to move to N2 later on), AMD may adopt a two-pronged strategy for possibly having Samsung's foundry manufacture the chips for the upcoming PS6. So AMD could eventually use Samsung's SF2-process for PlayStation&nbsp;6-chips, for the console which is scheduled for end of 2027, to split and shoulder the load of manufacturing, for ease of availability.",
                "author": "Helpdesk_Guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Electronics stabilizes HBM3E 12‑stack and wins larger Broadcom supply role",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The first 6 months were amazing for me",
        "score": 778,
        "text_content": "I didn’t played a lot on the first Switch, and i decided to be more commited on Switch 2. The first six months were amazing for me. I played a lot with my friends on Mario Kart World, DK Bananza was great from start to finish for me, Kirby and the Forgotten Land Switch 2 Édition was my first Kirby game ever and I liked it. I didn’t played Mario Galaxy back then, so it was nice to play it for the first time, i still need to finish the 2nd game. Kirby Air Riders was a lot of fun, and I enjoy Metroid Prime 4 so far. 2025 has been great for gaming in general, and Nintendo played a huge role in all of this for me. What was your highlight on Switch 2 since you have it ?",
        "comments": [
            {
                "raw_content": "It’s just nice to see someone expressing some positivity and enjoyment",
                "author": "mr_margherita_420"
            },
            {
                "raw_content": "Idk man internet told me to hate Mario Kart and Metroid even tho I like them, so I'm torn /s",
                "author": "sportspadawan13"
            },
            {
                "raw_content": "Honestly the Switch 2 has become my third party machine haha. Witcher 3, Cyberpunk Hogwarts Legacy.",
                "author": "Jack2036"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata is worth your attention",
        "score": 26,
        "text_content": "I kind of can't believe that I'm going around championing this game. It was completely off my radar of interest these last five years. Didn't care when it was revealed at the PS5 unveiling and didn't think it looked super appealing in recent trailers. But I took the opportunity to try the demo on Steam, and holy shit, it's good. This is a game where the gameplay is so damn good, that almost nothing else matters. It's just so damn fun. The hacking aspect of the combat no way what so ever gets in the way of combat. It actually makes the combat SO much more deep and engaging, because it adds a layer of strategy that doesn't often exist. Also, the movement and shooting is feels great. I kind of can't speak highly enough of this game at this stage. I've literally never played a demo of a game I was on the fence about and had this much of a 180. I'm much more hyped for Pragmata than Resident Evil Requiem at this point.",
        "comments": [
            {
                "raw_content": "Definitely picking it up on my ps5 when it comes out. I’m all in for whatever this game is doing. I was sorta iffy in the hacking aspect but they handled it in a good way.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "After some 3rd party that was pretty disappointing performance wise, I’d advise to be very cautious until we see the gameplay post release",
                "author": "senkinsky"
            },
            {
                "raw_content": "I'll definitely be picking this on Switch 2. Unless this is a technical mess, but it doesn't seem to be.",
                "author": "Herb-Alpert"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My 2026 Switch 2 Bingo Card",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Replace Free Space with \"No Themes\"",
                "author": "kuya__ian"
            },
            {
                "raw_content": "There are already two unexpected third-party amiibo announced for 2026: Diana for *Pragmata* and Grace Ashcroft for *Resident Evil Requiem*, which means it'll be more surprising going forward if Capcom actually releases a Switch 2 game *without* an amiibo.",
                "author": "a_phantom_limb"
            },
            {
                "raw_content": "Minecraft Switch 2 Version",
                "author": "Happy-For-No-Reason"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It finally came",
        "score": 75,
        "text_content": "Amazon delayed it until today and I have been wanting this one for a while. My first ever steelbook looks awesome and the Keychain is going to be a nice addition. Anyone else play this yet and thoughts compared to BFBB and the cosmic shake?",
        "comments": [
            {
                "raw_content": "Wow, I got my regular edition day one and I ordered the day before, atleast you have it now.",
                "author": "OneAxyboi"
            },
            {
                "raw_content": "Wow great pick up bro I have this on my wishlist need to buy a copy",
                "author": "Jeezy52"
            },
            {
                "raw_content": "I am a massive SpongeBob Fan and didn't love cosmic shake. It was by no means a bad game, but the comedic timing and jokes just seemed... A tad Off. However I played the demo of this game and am pleased to see that the classic spongebob quirks and comedic timing are back on par with what I had hoped for. (Even saw a few classic spongebob jokes for us elder spongebob fans!) Very excited to get into the full game! I hope you enjoy your new game - the steelcase looks great too.",
                "author": "WashedOutWizard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anyone know the cause of this major slowdown in Metroid Prime 4?",
        "score": 20,
        "text_content": "Footage from my brother playing on Switch 2 Graphics Mode (video is 30fps because that's the limit of Switch 2's recording feature). Never happened anywhere else in either of our playthroughs, not even the multiple times I used the same combat tactic in this same room.",
        "comments": [
            {
                "raw_content": "Hi, I've got the exact same framerate issue in this same room, fighting this same enemy, with this same charged beam. I was so scared that the game would crash, but thankfully, it didn't happen, and never experienced this bug ever again during my playthrough.",
                "author": "NeoChozo"
            },
            {
                "raw_content": "Weird. I did that whole room and never had the issue. I didn’t unlock that 2nd art lighting shot tho. It could be just a leak due to 2-3 enemy’s + that lightening hitting back and forth between both together",
                "author": "konotiRedHand"
            },
            {
                "raw_content": "I had the same thing happen for me in cyberpunk, in the one of the DLC ending cutscenes the framerate went down to less than 1fps and I had to just let it play out",
                "author": "bigparsnipenjoyer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Current state of Xenoblade Chronicles X on handheld?",
        "score": 24,
        "text_content": "I’ve heard incredible things about Xenoblade Chronicles X and really want to give it a go, but I typically play in handheld and remember how awful XC2 looked on S2 the same way. So, my question is specifically about handheld for XCX, is it decent in handheld, or should I hold out hope for a Switch 2 patch before pulling the trigger?",
        "comments": [
            {
                "raw_content": "720p locked on s2.",
                "author": "chocoponcho_"
            },
            {
                "raw_content": "They need to update it for switch 2. Literally holding off on playing until they do smh. Ridiculous how many games that don’t really need a switch 2 update get one but not the ones that do need one.",
                "author": "Nem3sis2k17"
            },
            {
                "raw_content": "I’m refusing to play Xenoblade 2 3 or Chronicles until they get patched. They look REALLY bad in handheld",
                "author": "MelzLife"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you guys think we’ll ever get an Ocarina of Time remake? On Switch 2 perhaps?",
        "score": 50,
        "text_content": "Wouldn’t that be amazing? I’d be so happy if it came to be! Don’t laugh if this is a ridiculous wish 😅",
        "comments": [
            {
                "raw_content": "*looks at the 3DS*",
                "author": "twili-midna"
            },
            {
                "raw_content": "I think it is possible. Next year is the 40th anniversary. We will get something. Whether it is updated ports of the 3DS remakes, the HD ports of Wind Waker/Twilight Princess, a re-release of Link Between Worlds, or something new altogether.",
                "author": "ucv4"
            },
            {
                "raw_content": "Fuck the remakes i want a new zelda",
                "author": "Sklatup_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Unreleased DOOM 4 in-dev \"Hell Dimension\" Environment.",
        "score": 199,
        "text_content": "https://xcancel.com/Runhob/status/2000354950040461376 This reveals that DOOM 4 was going to have a hell dimension besides being only set on earth. Previous DOOM 4 Findings: https://xcancel.com/Runhob/status/1998501951672320139 https://xcancel.com/boomshootart/status/1998265060360356306 https://xcancel.com/Runhob/status/1998481572459344086 https://xcancel.com/Runhob/status/1998036674027344084 https://xcancel.com/Runhob/status/1998491549869428769 https://xcancel.com/Runhob/status/1998488287573602743 https://xcancel.com/Runhob/status/1998479067595620431 https://xcancel.com/Runhob/status/1998036255305777215 https://xcancel.com/WadOverdose/status/1997752753930768458",
        "comments": [
            {
                "raw_content": "I hope one day we get to play some of this game. I know it was not a proper Doom by any means and I’m glad we got the reboot, but I’m sure it was fun to play.",
                "author": "DWRedd"
            },
            {
                "raw_content": "Oh, the infamous Call of Doom. I loved the reboot but I wouldn’t have minded playing this version.",
                "author": "Hairy-Summer7386"
            },
            {
                "raw_content": "I really hate that we never got a true sequel to Doom³ showing the Hell invasion on Earth and how much of a disturbingly twisted, greusome, horrifyingly scary experience that was.",
                "author": "Undefeated-Smiles"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Arcade1Up has shut down as of Friday.",
        "score": 462,
        "text_content": "This was [actually reported late Friday night](https://www.timeextension.com/news/2025/12/reports-suggest-arcade1up-is-shutting-down) but I only caught wind yesterday. Apparently Arcade1Up, which has been producing novelty arcade cabinets for enthusiasts and was known for being able to procure a lot of licenses for specific properties and games that were well out of circulation officially, sent out an internal email picked up by [Wario64 on Bluesky](https://bsky.app/profile/did:plc:knj5sw5al3sukl6vhkpi7637/post/3m7q7t347ck2e), which stated that day was their last official day of operations. Code Mystics, in addition to working on official console and PC remasters and re-releases of stuff like *SNK vs. Capcom: SVC Chaos*, the recent *GoldenEye* remaster and a bunch of the older *King of Fighters* games available on PS4, Switch and Steam like *KOF '97* and *2002 UM*, has developed a lot of the emulated versions of games that run on these cabinets. They [responded in a Reddit thread about the situation](https://www.reddit.com/r/Arcade1Up/comments/1pjy92j/megathread_arcade1up_is_shutting_down/), detailing that should this be made official and they shut the official servers these cabinets need for online multiplayer, they had a \"fallback mode\" embedded in their Gemini online code that enabled such functions to continue without official support. The Arcade1Up machines that run on that netcode like *Killer Instinct*, *Mortal Kombat* and *NFL Blitz* will switch to that should this happen. This is a massive bummer and a real blow to the arcade enthusiast community especially because Arcade1Up was also directly responsible for rescuing a lot of games from licensing purgatory, and despite the expenses of these cabinets they provided a lot of newly official, playable versions of games like the early Marvel/Capcom arcade titles, the classic *Mortal Kombat* games, *NBA Jam*, the Konami *Teenage Mutant Ninja Turtles* and *X-Men* games and stuff like *Ms. Pac-Man* which even to this day, has rarely seen re-releases on modern consoles or PC due to the legal complications between Bandai Namco and General Computer. In a lot of ways they played a big role in rejuvenating modern interest in seeing these titles get officially picked up by their original licensors and even put out on current platforms. Most famously it was Max Dood's *#FreeMvC2* campaign that first got Arcade1Up to sign with Marvel/Capcom for issuing an arcade cabinet with everything from *The Punisher* through *Marvel vs. Capcom 2*, which then led to their official re-releases in the *Fighting Collection* last year. Same with the classic *MK* games. They were a real champion of the culture and the games that populated this scene in yesteryear and it sucks they closed so unceremoniously if true.",
        "comments": [
            {
                "raw_content": "Me when I realise the only company left that still does licensed arcade units is Atgames. ![gif](giphy|hyyV7pnbE0FqLNBAzs)",
                "author": "syrupdash"
            },
            {
                "raw_content": "When they basically started recycling licenses and machines, but a higher price it only seemed likely they wouldn't last long. Hell I can't remember the last I saw one in a store.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "I was always tempted to grab one but the prices were always astronomically high for what amounts to a cheap android emulation machine. That said its still upsetting they are shutting down. To my knowledge they're the only company producing licensed after market arcade machines. Not to mention [the shooter cabinets](https://arcade1up.com/collections/our-best-sellers/products/big-buck-hunter-mossy-oak-deluxe-arcade-machine?_pos=2&_fid=52b18b319&_ss=c) are cool as hell.",
                "author": "DapperIndividual"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bleach x Fortnite is coming on December 21!",
        "score": 90,
        "text_content": "Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/2UkbhyO7bU https://xcancel.com/i/status/2000189038008119613",
        "comments": [
            {
                "raw_content": "Nice, think the only major anime missing at this point is One Piece which is surprising because they could do an anime version and a live action version. Also obligatory - https://ibb.co/VkCY0W0",
                "author": "ImAnthlon"
            },
            {
                "raw_content": "![gif](giphy|jz47ZIBP0YWAnByQl0) Finally my boy is coming",
                "author": "Jokerck"
            },
            {
                "raw_content": "I saw this and was wondering why in the world Fortnite would team up with a cleaning product",
                "author": "BotherAltruistic6135"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "1000MHz - AMD Athlon Slot A „Orion“",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's some sexy IDE cables, damn....",
                "author": "Gelantious"
            },
            {
                "raw_content": "THAT is some nice cable management.",
                "author": "_IamAllan_"
            },
            {
                "raw_content": "And a Rage Fury MAXX. Somebody is swimming in money...",
                "author": "Accomplished-Camp193"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Boomers want to axe property taxes. Millennials and Gen Z would pay for it.",
        "score": 637,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An elderly family member complains all the time about her taxes. Lives in a rural area with a nice house and some land…she pays $800 and complains so damn much. She probably gets around 4K a month in retirement income and her house is paid off. Like come on..",
                "author": "bravewolf98"
            },
            {
                "raw_content": "“I really like this free equity gain I got from doing nothing… how can i also pass the burden of supporting our city’s infrastructure onto my younger neighbors.”",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "This is the one tax most seniors pay. So of course they don’t want to. I think they should take a SS cut so we get something later… I’m not planning on anything by the time I retire",
                "author": "ethan1231"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "REITs with single family homes down 17-20% for the year",
        "score": 6,
        "text_content": "INVH is down 20% this year. AMH is down 17%. This should be a decent metric on the market. I could see them getting hammered by regulators and needing to dissolve. Invitation homes (INVH) in my opinion has a crazy amount of homes available to rent. In Atlanta they currently have 521 vacant, Phoenix has 330. [https://www.invitationhomes.com/search/houses-for-rent/available-now?sort-by=distance\\_asc&lat=18.158564099082074&lng=-66.64959457600474&zoom=10](https://www.invitationhomes.com/search/houses-for-rent/available-now?sort-by=distance_asc&lat=18.158564099082074&lng=-66.64959457600474&zoom=10)",
        "comments": [
            {
                "raw_content": "This is not the good news it seems like…when REITs are doing poorly it means investment is declining. That lines up with new home starts down 30% from their 2021 highs. https://fred.stlouisfed.org/series/HOUST1F This all adds up to further supply constriction. Inventory might have a temporary uptick while demand is low, but structurally this is a bad thing.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How to get more visibility on my Murray condo for sale?",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is my market, houses are still selling within days to weeks. But condos suck in general, add that Utah is primarily big families who are looking for single family homes. They bought at the peak, bought the wrong type of home for the market, and now looking to offload to the next sucker. OP posted stating they would be guaranteed equity lol",
                "author": "Uhkaius"
            },
            {
                "raw_content": "Oof at some of those comments. Imagine expecting guaranteed equity on a condo purchased only 2 years ago and feeling deceived when it doesn’t realize lol. Homes don’t always go up. When they go down, condos lead the way.",
                "author": "egusisoupandgarri"
            },
            {
                "raw_content": "OPs comment on the top comment: >Yes, it is on Zillow and I’ve lowered the cost three times. It is now listed for $17k less than what I bought it for two years ago, and I put a LOT of work into it 💔",
                "author": "IRideParkCity"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Crazy true",
        "score": 1635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And my life still feels about the same as it did when chatgpt came out 3 years ago lol.",
                "author": "JBSwerve"
            },
            {
                "raw_content": "It’s not the singularity until this ai progress leads to other fields progressing just as fast",
                "author": "Salty_Sky5744"
            },
            {
                "raw_content": "Whoever wrote this has no idea what singularity is.",
                "author": "astronaute1337"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LG webOS TVs are now installing Microsoft Copilot automatically with no option to remove it",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't TV already have one of the worst softwares? At this point I'd rather use a PC than shill for a TV",
                "author": "NEO71011"
            },
            {
                "raw_content": "For WHAT? literally what is the use case. We all have voice operated assistants in our phones, and if we want more of them we have smart speakers. TV's are slow and buggy. And also, theres no good I/O for chat. Are people going to input queries using the on screen keyboard?",
                "author": "Calm_Hedgehog8296"
            },
            {
                "raw_content": "Oh my god.. please fucking stop. Copilot everywhere I am so sick of that shit!",
                "author": "generative_user"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Total compute capacity to grow 2.5x to 3x in 2026",
        "score": 99,
        "text_content": "Based on current semiconductor roadmaps, capital expenditure forecasts, and energy grid interconnection queues, the AI industry is projected to experience a 2.5x to 3x increase in effective AI compute capacity in 2026 compared to 2025 levels. What kind of capability improvements do you think that’ll bring?",
        "comments": [
            {
                "raw_content": "Whenever I see projections like this, I want to see the actuals. How much did it grow in 2024 and 2025.",
                "author": "Animats"
            },
            {
                "raw_content": "Idk, but we need memory to be solved",
                "author": "Different-Incident64"
            },
            {
                "raw_content": "Most people don't realize just how compute starved we are right now. The labs don't deploy their best models because they're too expensive, use every trick in the book to enshitify the user-facing apps (limiting context length and test-time compute, dynamically switching to smaller models, etc.) Video generation costs an arm and a lag and even Google is still having trouble keeping up with the demand for Veo. Coding agents stop working after a few minutes, hitting daily/monthly limits. A 3x in compute will barely make a dent in this, and that's without even considering more advanced capabilities like agent swarms and the robot fleets we're building.",
                "author": "Karegohan_and_Kameha"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Marc Raibert's (Boston Dynamics founder) new robot uses Reinforcement Learning to \"teach\" itself parkour and balance.(Zero-Shot Sim-to-Real)",
        "score": 8,
        "text_content": "We are seeing the **next evolution** of embodied AI. This is the **Ultra Mobile Vehicle (UMV)** from the new **RAI Institute** (led by Marc Raibert). Unlike older robots that were hard-coded for stability, this system uses **Reinforcement Learning** to develop \"Athletic Intelligence.\" **Self-Learned Physics:** The robot wasn't explicitly programmed on how to bunny hop or spin. It **learned** to manipulate its heavy upper-body mass in simulation to achieve those goals, then transferred that knowledge to the real world **(Zero-Shot Transfer).** **The \"Split-Mass\" Design:** It mimics a biological rider. The top half acts as a counterweight (like a human rider shifting their hips) to handle aggressive maneuvers that would tip over a normal robot. It’s **proof** that we are moving from \"Static Automation\" to \"Dynamic, Learned Agility.\" **If RL can master this level of dynamic balance in 2025, how far are we from a humanoid that can out-run and out-maneuver a human in complex terrain?** **Source: RAI Institute / The Neural AI** 🔗: https://rai-inst.com/resources/blog/designing-wheeled-robotic-systems/?hl=en-IN",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia H200 is officially 'legacy' tech: US lifts export ban to China for H200 chips, signaling the West has fully pivoted to Blackwell (B200).",
        "score": 86,
        "text_content": "**The exponential curve just lapped itself.** According to new reports, the US government is actively shifting its strategy from strict *\"Security Blockades\"* to *\"Trade & Taxation.\"* The **Nvidia H200,** which was considered a \"National Security Threat\" and strictly banned just months ago. It's now being cleared for export to China (subject to a 25% tax/revenue share). This is a **massive signal** for where we actually are on the compute timeline: **The \"Legacy\" Threshold has moved:** The US typically only exports hardware it considers *\"safe\"* or *\"second-rate\"* relative to its internal capabilities. If the H200 is going to China, it implies the B200 (Blackwell) and unreleased internal models are performing at a level that makes the H200 look like a commodity. **Taxing the Catch-Up:** The strategy has shifted from \"Don't let them have it\" **to** \"Let them buy our previous-gen tech to fund our next leap.\" **Not the H20:** To be clear, this is about the full-fat **H200,** not the cut-down \"H20\" or \"L20\" chips that were previously allowed. If you needed **proof** that Moore's Law (or Huang's Law) is accelerating, this is it. The hardware that was *\"too dangerous\"* to ship yesterday is the *\"budget export\"* of today. **Does this confirm that the gap between public benchmarks and internal US labs is widening? Or is this just a pure economic play to capture the Chinese market before Huawei catches up?** **Source: The Economic times/Reuters** 🔗: https://m.economictimes.com/tech/artificial-intelligence/with-nvidias-second-best-ai-chips-headed-for-china-the-us-shifts-priorities-from-security-to-trade/articleshow/125958185.cms",
        "comments": [
            {
                "raw_content": "Or perhaps the legacy threshold hasn’t moved as much; it’s just that the current administration prioritizes Nvidia more than U.S. national interests.",
                "author": "Normaandy"
            },
            {
                "raw_content": "Lmao trying to pívot the narrative to make the US surrender in the sanctions game as \"it wasn't bad, we just gave them the \"legacy\" stuff\" lmao",
                "author": "ReasonablePossum_"
            },
            {
                "raw_content": "This is yuge. Tremendous chips.",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do LLMs Understand? AI Pioneer Yann LeCun Spars with DeepMind’s Adam Brown.",
        "score": 20,
        "text_content": ".",
        "comments": [
            {
                "raw_content": "Curious when experts on the bleeding edge of research use more couched language than a lot of laymen.",
                "author": "Nedshent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "More news on AI-designed proteins",
        "score": 24,
        "text_content": "[https://doi.org/10.64898/2025.12.12.694033](https://doi.org/10.64898/2025.12.12.694033) \"Advances in generative protein design using artificial intelligence (AI) have enabled the rapid development of binders against heterogeneous targets, including tumor-associated antigens. Despite extensive biochemical characterization, these novel protein binders have had limited evaluation as agents in candidate therapeutics, including chimeric antigen receptor (CAR) T cells. Here, we synthesize generative protein design workflows to screen 1,589 novel protein binders targeting BCMA, CD19, and CD22 for efficacy in scalable protein-binding and T cell assays. We identify three main challenges that hinder the utility of de novo protein binders as CARs, including tonic signaling, occluded epitope engagement, and off-target activity. We develop computational and experimental heuristics to overcome these limitations, including screens of sequence variants for individual parental structures, that restore on-target CAR activation while mitigating liabilities. Together, our framework accelerates the development of AI-designed proteins for future preclinical therapeutic screening, helping enable a new generation of cellular therapies.\"",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "The 8 Point test: GPT 5.2 Extended Thinking fails miserably and performs far worse than previous models.",
        "score": 113,
        "text_content": "I have a personal test I tend to run on every new release of OpenAI models. This is the prompt: >You have 8 points. For every no, I will remove 1 point. For every yes, you will keep points. Game over when you lose all points. I'm thinking of a movie. Maximize your questions to guess it. I think of a random movie (and sometimes a song, or a video game), and answer yes or no truthfully, removing a point for every no, but I let the model track the points. o3 and GPT5-5.1 Extended Thinking (medium on the light-heavy scale) are performing within the same range of success. They tend to guess the movie correctly within their 8 points often. If not, I extend the points, and they generally get it within 10. The performance is also movie specific, as more niche movies tend to need more questions than famous blockbusters. Interestingly o3 spends a lot less time thinking, but still performs within 5 and 5.1 Extended Thinking solely on success, while 5.1 can go minutes to find the best answer. Both tend to waste points once they drop to 1, but o3 is less wasteful. Both keep the track of lost points and know when they fail. 5.2 Extended Thinking is really, really bad at this game. It will assume and then lose points. Example: I'm thinking of a piece of music, instead of movie. 5.2 will ask about English vocals, and then continue wasting points on language, assuming the track has vocals. o3 and 5.1 Extended Thinking will ask whether the track uses sung vocals after they burn points on English. 5.2 Extended Thinking cannot keep even the points straight, and will add itself points, or say: I've lost too many points, let's start with 8 again. It generally needs about 25+ (typically around 30) points to get the guess right. I think this is partially caused by either bug or cost optimization, as 5.2 Extended Thinking, even when the model is specifically selected, will reroute into instant reply that is of lower quality. It also bugs out, uses python or restates the same question twice in a single output, or responds incorrectly that the question was not answered. Does that mean that o3 and the previous 5-5.1 models are better than 5.2? Not necessarily. For example o3 readily lists sources to synthesize answers, but sometimes the sources don't have the information o3 is stating, and it's \"I made it up\" synthesis. Perhaps this test is completely pointless. Still, I find it interesting that there is such a wide gap in performance, and even attitude, that leads to 5.2's significantly worse performance. I don't have subscription for Gemini 3, so I have no idea if it's better or worse in this case.",
        "comments": [
            {
                "raw_content": "This is the result of benchmaxing. You're asking it to do something that is unlike anything in the main benchmarks, and it performs poorly. Meanwhile, other people who ask things that are similar to benchmark questions are convinced that it is the best model ever. From a utilitarian perspective, though, I would say that 5.2 being better at coding is more important than it being able to guess a song. The former is more useful for getting to AGI than the latter. In fact, maybe companies should focus specifically on models trained to make better models, instead of making general consumer products, if we want the singularity to arrive faster. Singularity-maxxing, if you will.",
                "author": "sckchui"
            },
            {
                "raw_content": "Why do I always see posts how about terrible the model is that just released. Judging from reddit we should be on a steady decline.",
                "author": "Ganda1fderBlaue"
            },
            {
                "raw_content": "Yeah this is an example of a pointless benchmark in the real world, which is where 5.2 shines. It is the largest step forward in terms of agentic autonomy we have seen yet. I can let it work on a complex codebase essentially 24/7 now, and it has solved bugs that no other model has been able to help with. When it takes 2+ hours to identify and diagnose the source of the bug, architect a solution, then implement and verify, that is something that just no other model is capable of doing.",
                "author": "Pruzter"
            }
        ],
        "subreddit": "singularity"
    }
]