[
    {
        "post_name": "General Mike Flynn: Here’s my gut assessment of the Clintons blowing off Congress today. They hold so much information on everyone from judges to members of Congress to business executives to world leaders.",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was an absolute power flex. Make no mistake, the Clintons have scary power. But we are seeing this everywhere. Especially in the courts. In a sane society Judges would not want to put their integrity on the line in all of these rogue judges situations yet they do. You know what I mean? That means everything is worse than we thought it was.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "We have yet to see any accountability of anyone yet, even the small fry low-level underlings, so it makes sense that the Clintons would blow it off. This could change, though. It's a new year.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "It's one big club, and we simply pay for it.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Great minds think alike",
        "score": 333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is the first Presidential Middle Finger in the History of Our Country and probably the World.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "someone yelled pedo protector right?",
                "author": "cuqu2"
            },
            {
                "raw_content": "THATS MY PRESIDENT! 🇺🇸",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This Is America",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Exactly. The vast majority want them gone. The only ones protesting are the invaders themselves and a roving band of paid terrorists who show up at every big city.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "We want the law enforced. We want the government we were promised. We want the fraud stopped. We want to feel like we're on the same team again.",
                "author": "Moose_Antlers"
            },
            {
                "raw_content": "+1 for the Gadsden sticker on the back window. Godspeed fellow patriot.",
                "author": "OpusX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Literal BUSLOADS of illegals were just FLOWN OUT of Minneapolis by DHS on a chartered Boeing 737, finally being SENT BACK to where they come from This is despite the rioting and obstruction done by the left. DHS IS NOT SLOWING DOWN! 🇺🇸 KEEP PUSHING, PATRIOTS! 🔥",
        "score": 1359,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Id bet the ICE agents at the protests are the distraction while they just go around rounding up the filth.",
                "author": "Dem_slayer"
            },
            {
                "raw_content": "GOD BLESS ICE. AND PRESIDENT TRUMP....",
                "author": "HoboJoe01"
            },
            {
                "raw_content": "Source: A video of an airplane.",
                "author": "NebraskanPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats have degraded America’s moral fabric in under three decades to the point that the highest court in the land must now decide what a boy and a girl are.",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't respect or need some fucking government to define a boy or a girl to me. The idea that the governments interpretation is the most important is absurd.",
                "author": "learntocode"
            },
            {
                "raw_content": "Highest Court in the land swore in a Kenyan/Indonesian :(",
                "author": "MeMargie"
            },
            {
                "raw_content": "Even the goddamn Brits know, and they're so inbred they can't even fight anymore...",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@DataRepublican will be LIVE in person teaching Americans how to investigate their governments! 2 nights, Feb 16-17",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pray for her safety",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "She used to post on The_Donald when it was on Reddit. Fun fact.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "I wanna go just to Thank Her!!! Few work harder for us.",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's foolproof!",
        "score": 1324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All the abandoned churches in my area have been turned into mosques for 20+ years. Going on Google, they post photos of the goat sacrifices outside.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Muslims wear robes because goats can hear a zipper a mile away",
                "author": "DisturbedHaiku"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Let's check in on re--oooh, nm",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reddit is for gay faggots who diddle children",
                "author": "Paydro"
            },
            {
                "raw_content": "So thankful this site was created and I left Reddit permanently 5 years ago. There is nothing there of value. The Donald is the only decent thing that ever came out of that shithole. It’s like a virtual insane asylum for the smuggest douchebags on the planet. FYI about half of what you get from “AI” is just repackaged reddit-slop. Reddit is AI’s main source of information behind Google. Be careful using AI. It’s rarely accurate on any “controversial” issue that actually matters.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "I trained my lawyer LLM on reddit subs, your honor Because I am an actual disgrace",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secret Service agent on JD Vance's detail was just put on LEAVE after James O'Keefe caught him undercover TRASHING ICE agents and revealing future security plans \"days in advance\"",
        "score": 1552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Confiscate his devices, see if he has any like minded compadres. Also check his hard drive….",
                "author": "COnDEMnED"
            },
            {
                "raw_content": "Should face criminal charges. Arrest and hold without bail",
                "author": "ohwell316"
            },
            {
                "raw_content": "He needs to be thrown in federal prison.",
                "author": "Forty_Five"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What Winter of Love looks like in Minneapolis.",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A fire in a gas station. Peak.",
                "author": "CocaineNewsome"
            },
            {
                "raw_content": "So that's not downtown, that's south Minneapolis. It's been a shit hole for years because it's where all the native Americans and Hispanics live. It's certainly gotten worse, but it's always been like this.",
                "author": "noPTSDforMePlease"
            },
            {
                "raw_content": "Um, sir, this is a gas station.",
                "author": "LostElf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Peace Through Strength",
        "score": 1063,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only men capable of violence are capable of peace.",
                "author": "SupFrens"
            },
            {
                "raw_content": "Damn! 🔥🔥🔥🔥 who’s in charge of the DHS X acct, they need a RAISE. These shorts are so *good!*",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Using Lorde to piss some people off LOL",
                "author": "oorahcreamedcorn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BOOM! Every doomsday prediction the tariff haters made? TOTAL BUST! Evidence is CLEAR: American consumers aren't paying, the foreign nations and middlemen ARE! Once again, the so called \"experts\" were 100% WRONG, and President Trump was 100% RIGHT!",
        "score": 1407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BOOM! TOTAL BUST! CLEAR ARE RIGHT WRONG Why do these people talk to us like we're 7 years old?",
                "author": "YouEssAye"
            },
            {
                "raw_content": "I mean, I fully agree with the tarriffs and 100% support them, as they benefit in more ways than one, but I'm sure some cost is passed on to consumers. Raining the cost of doing business makes a product more costly. Tarriffs do that, but also encourage more business to be conducted in USA to avoid that tax. If we are so concerned about, as leftists say, \"taxing the consumer!\", then why don't we outlaw direct taxes on consumers purchasing items? And taxes on those selling them?",
                "author": "MagaJay02"
            },
            {
                "raw_content": "This fucking grifter......Isn't he part of the \"Bongino Army\"??",
                "author": "flyover_deplorable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fatty Lumpkins Sandwich Shack in Muskegon County, Michigan had an unhinged meltdown over ICE. \"Fuck YOU! Do not ever set foot in this establishment. You will be denied service. You will be laughed at... fuck your murderous ways... fuck your blatant fascism. Stay away!\" Trump won this county btw.",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They bitch about manmade borders, while talking about their private property xD",
                "author": "Master_oYo"
            },
            {
                "raw_content": "Given that Fatty Lumpkins is the name of a character from Tolkien's LOTR trilogy...And given that the Tolkien estate is renowned for protecting their copyright...and given it's doubtful some schlub in Michigan bothered to ask the Tolkien estate for permission to use that name...it would be a shame if someone were to contact the Tolkien estate by mail and bring this food joint's existence to their notice.",
                "author": "Daemoness"
            },
            {
                "raw_content": "Goodbye Fatty Lumpkins",
                "author": "OlivaireBandaloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY SMOKES. SCOTUS Justice Sam Alito asks ACLU lawyer \"what is a man and a woman?\" and they DON'T HAVE A DEFINITION. ALITO: How can a court determine whether there's discrimination on the basis of sex, without KNOWING what sex means?!",
        "score": 1528,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now that is a great fucking question - bravo.",
                "author": "Datamancer"
            },
            {
                "raw_content": "Alito just folded them with one question. Lol.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "XX and XY. Female genitals at birth and male genitals at birth. That covers 99.99% of it",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GEOTUS says \"it's time to invest\", if you have half-a-brain or more you'd best invest what you're able to, this is quasi-Insider Trading, TAKE ADVANTAGE!",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile homes still not selling cause too expensive. In a strong economy you don't need to invest and gamble your money to get by. It wasn't this way back in the 50s through the 90s..Once upon a time a man could hold one job and care for his family while saving for retirement. Not saying Trump isn't doing good but the stock market should never be the measure of an economy. The more we demand PROFITS above all from the stock market the more the jobs market downeizes and moves toward automation & AI to generate those profits. And guess who is balls deep in AI and wants to spend billions of government dollars to develop it? It's the wrong approach.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Best place to research where to put the extra $$$",
                "author": "pedespeed"
            },
            {
                "raw_content": "The stock market is almost purely driven by AI speculation. And the revenue to match the projected valuations are not even in the same universe. Unfortunately when that gets realized all stocks will be drawn down.",
                "author": "CanadianTrump2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "At least 8 KC-135R refueling tankers have landed in Honolulu, likely en route to the Middle East, including one previously seen at Diego Garcia on Jan 12–13.",
        "score": 276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Last time they did this, they sent decoy tankers first. Pentagon Pizza Index looks normal.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Hawaii in the house!",
                "author": "Hawaii_Patriot"
            },
            {
                "raw_content": "Perhaps, but the B-2s will already be over Iran, by the time they get this newz. They may even be there to refuel them on the way back to base. President Trump sure does have the shortest tiny-est \"forever wars.\"",
                "author": "Ferzth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: The Experts are FURIOUS after Ford plant in Michigan moves to 24 HOUR DAYS for 6 DAYS PER WEEK because the economy is booming \"They've NEVER seen what's happening now!\" \"This plant goes 24 hours, around the clock!\" They are adding a 3RD SHIFT! 🔥🇺🇸",
        "score": 1222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I still can't afford a new truck.",
                "author": "hughjasske69"
            },
            {
                "raw_content": "Ok but Ford just wrote off $30B in EV losses so let's not pretend Ford is the end all be all.",
                "author": "JoePlumber"
            },
            {
                "raw_content": "This after Ford was forced to abandon that piece of shit Electric F150, it appears business functions when you sell things people want and not tax payer assisted garbage",
                "author": "SERP-SERP"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An advert in Denmark shows a White Danish couple hugging on the sofa An \"expert\" shows up out of nowhere and tells them not to date each other because it’s basically \"inbreeding\" for whites to have babies with other whites",
        "score": 944,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ok, that's enough. Take Greenland NOW",
                "author": "Cuetardian"
            },
            {
                "raw_content": "The expert looks you know...not exactly White, but can pretend to be White to serve an ideology. Wouldn't this hold true for any race? People in small isolated villages have been breeding with each other for centuries. I once met an old man in the central Philippines who had never been more than maybe 70 kilometers from his home, he was probably in his 80s.",
                "author": "FORMERCHILDSTAR"
            },
            {
                "raw_content": "Yes, this is a real ad from Denmark's state broadcaster DR, originally from 2020 and re-aired in 2025, promoting a science series on evolution. Full English translation of the expert's dialogue: \"Yes, they died out. Now you get it! What we can read from the DNA of old teeth and bones... The first people in Greenland died out because of inbreeding. This little guy has shown us that. We Danes have survived because we mixed with other peoples from the Middle East to West Asia. And this made us more resistant to diseases. So if we don't mix with strangers, we die out. So if you want to give your future children the best possibilities, you should probably choose something a little more exotic.\" (Based on video subtitles and verified sources.) -grok",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Eat Real Food",
        "score": 989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No better role for this absolutely based human being.",
                "author": "Thedwarvenstallion"
            },
            {
                "raw_content": "Bill Gates big mad. Everybody farts, even you Bill.",
                "author": "utfanx2"
            },
            {
                "raw_content": "I've been eating real food for 15 years and I look 10 years younger than other guys my age group",
                "author": "ImprerialWalker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US President Donald Trump seen flipping off a ford worker who yelled \"pedophile protector\" during Trump’s visit — TMZ",
        "score": 1103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine yelling at the only guy that saved your job",
                "author": "Yemen"
            },
            {
                "raw_content": "🤣",
                "author": "Cali_kid"
            },
            {
                "raw_content": "Based",
                "author": "COnDEMnED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NVIDIA quietly delays stable NVIDIA App release for DLSS 4.5",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think they are putting some guardrails in place. Currently if you set to the latest in the app, it will set it to K for quality and balanced, M for performance, and L for ultra performance. I wouldn't be surprised if they also adjust it depending on whether you are on 20 or 30 series cards.",
                "author": "Rich_Consequence2633"
            },
            {
                "raw_content": "Nvidia is giving AMD a handicap to fix FSR Redstone before launch",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Once again, this is software. But anyway, you can just use DLSS tweaks.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(HUB) 5700X3D and 5800X3D revisit compared to modern processors.",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only they were still available",
                "author": "Lower_Fan"
            },
            {
                "raw_content": "I am very happy with my used 5700X3D I recently got off ebay for $5 over MSRP! Keep this 5yr old DDR4 build going another 5yrs.",
                "author": "SD_haze"
            },
            {
                "raw_content": "Why not? Mine still runs everything I need just fine and AM4/DDR4 will be a reasonable lower cost solution for many.",
                "author": "rbmorse"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"AMD & NVIDIA Abandoned This Segment\" | Intel Arc GPU Factory Tour with Sparkle",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that amt of hair in a clean room, steve should wear a hooded rain coat lol.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "I thought that was Denis lol",
                "author": "OROCHlMARU"
            },
            {
                "raw_content": "Pretty good video with a lot of detail I haven't seen in previous factory tours. I probably still won't use an Intel GPU for gaming, but for a media server it's probably sufficient. Side note: It's funny how whenever a GN video gets posted, the same cast of characters comes out and writes essays criticizing the video, apparently without watching it. I guess that's what it means to \"make it\".",
                "author": "dev_vvvvv"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake Benchmarked vs Strix Halo/Strix Point vs RTX 3050/RX 6600",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wasn’t expecting the claim of 82% gain vs Strix Point to hold up in third party reviews, but here we are. The gap is pretty astonishing, almost painful considering APUs used to be AMD’s unique thing. Also, interesting point they raise: because Panther Lake gets the full featureset of XeSS 3 (SS + FG), the user experience can even match that of Strix Halo.",
                "author": "heylistenman"
            },
            {
                "raw_content": "It's somewhat ironic that Intel's GPUs seem to be the most exciting things about their SoCs now, specially if you consider the recent deal with Nvidia...",
                "author": "Artoriuz"
            },
            {
                "raw_content": "So far Intel is only showing off gaming performance on the iGPU, and it looks good. But I can't wait to see full benchmarks. Intel's 200 series is actually 4 different lines: * Lunar Lake (Core Ultra 200 V series) in premium thin and light segments and handheld segments * Arrow Lake (Core Ultra 200 H series) in mainstream laptops * Raptor Lake re-refresh (Core 200 series) in gaming laptops with discrete graphics * Meteor Lake Refresh (Core Ultra 200 U series) in cheaper thin and light laptops I'm curious to see how it compares to all 4. I expect Panther Lake to easily beat the Arrow and Meteor lake chips, but I'm curious if it can beat Lunar Lake in power consumption (or at least come close) and beat Raptor Lake in single thread/gaming performance.",
                "author": "Uptons_BJs"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "In Memoriam: Remembering Mike Flynn",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Panther Lake Benchmarked vs Strix Halo/Strix Point vs RTX 3050/RX 6600",
        "score": 43,
        "text_content": "These are some interesting choice of settings here. They also explain the configurations the new CPUs come in.",
        "comments": [
            {
                "raw_content": "My laptop has a 3050 4GB And now an APU is stronger than that, holy shit",
                "author": "WJMazepas"
            },
            {
                "raw_content": "Rough comparison: Strix Point - 50% Panther Lake - 100% Strix Halo - 130%",
                "author": "thunk_stuff"
            },
            {
                "raw_content": "All the benchmarks are using RT ? I understand this is kind of representative of future titles, but I think the results are going to be way different in raster... (RX 6600 is way above RTX 3050 in raster, and AMD iGPU won't be so far behind Panther Lake)",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China limits Nvidia chip purchases to special circumstances, Information reports",
        "score": 30,
        "text_content": "The Chinese government this week told some tech companies it would only approve their purchases of Nvidia's H200 AI chips under special circumstances, such as for university research, the Information reported on Tuesday, citing two people with direct knowledge of the situation. The move signals Beijing is remaining cautious about fully reopening the Chinese market to Nvidia, whose semiconductors are pivotal in operating the most advanced artificial intelligence applications and data centers.",
        "comments": [
            {
                "raw_content": "Wasn't this reported months ago?",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "They should. They should just focus on developing their own tech or stealing it and encouraging use of homegrown options.",
                "author": "Bosfordjd"
            },
            {
                "raw_content": "not losing the ai race by default will probably qualify as 'special circumstances' :D",
                "author": "Green_Struggle_1815"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Xeon 698X “Granite Rapids-WS” confirmed with 86 cores and 336MB L3 cache",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello Hero_Sharma! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD sets Ryzen 7 9850X3D review embargo to January 28",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "just run an 9800x3d at 5.6ghz and u know how this cpu performs...",
                "author": "Pillokun"
            },
            {
                "raw_content": "Who even needs that? Cool, a slightly faster X3D CPU. Everyone will say: \\-It might be 1-7% faster in some scenarios (testing in 720p/1080p) \\-There is no reason to upgrade from the 9800X3D \\-Something something intel, remember intel has done similar things. \\-It's too expensive right now because the msrp is higher than current market prices for the 9800X3D. Long story short: It's a refresh, once it's abut the same price/cheaper than the 9800X3D, it's the better opinion/ That's all you need to know. But influencers will milk it, like they always do. Expect clickbait titles for weeks/months.",
                "author": "Jumpy-Dinner-5001"
            },
            {
                "raw_content": "Aren't we all excited to see if it's 2% or 3% faster?",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "About to start Zelda for the first time. I know absolutely nothing about Zelda.",
        "score": 906,
        "text_content": "All I know that it is about some little wizardy gnome thingy… Been meaning to play the Zelda games for 8+ years now. I’ve purposely ignored all forms of Zelda content for as long as I can remember in order to play them through blindly, though now having started playing the breadth of content seems pretty wild. Is there any small tips that will greatly improve my quality of a first play through that don’t spoil anything about the game? The copy I bought is the Switch 2 edition if that makes any difference..? P.S Any thoughts on whether this is better experienced on a TV or handheld?",
        "comments": [
            {
                "raw_content": "Good. Play this one blind. Best possible way to play this one",
                "author": "AdorableMath5360"
            },
            {
                "raw_content": "Honestly, go in as blind as you can. As for handheld vs tv, that's entirely up to you as everyone will have a different opinion. Not very helpful, I realize, but you only get the BOTW first experience one time, so best to do it as blind as you can. I still need to finish it, but that's because I started on Wii U and haven't gone back to it.",
                "author": "Talrie"
            },
            {
                "raw_content": "I knew almost nothing or Zelda, this game quickly went to my top 5 of all time Blind is the way to go and just enjoy it",
                "author": "Obollox"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon Brilliant Diamond and Shining Pearl finally fixed on Nintendo Switch 2, plus other Switch 1 backwards compatibility updates",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yeah",
                "author": "Me_975"
            },
            {
                "raw_content": "I thought I missed some major news when the article said that they fixed Call of Duty… And when I read it again, it somehow changed to Cats on Duty. They got me good with that one.",
                "author": "DRAGONZORDx"
            },
            {
                "raw_content": "Has the resolution been increased?",
                "author": "JediSqueezeGata"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Customized my Switch 2! What do you think?",
        "score": 201,
        "text_content": "I love the aesthetic of this reshell kit from ExtremeRate!",
        "comments": [
            {
                "raw_content": "I really like it. The blue and red on the joysticks are a shame though",
                "author": "Pepsimaxgodtier"
            },
            {
                "raw_content": "The backside is awesome. 10/10. Don’t like the front as much",
                "author": "BirthdayDry1598"
            },
            {
                "raw_content": "prepare for the nintendo ninjas",
                "author": "BoughtSquash665"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My Favorite Gaming Platform of 2025",
        "score": 499,
        "text_content": "I've put more time into my Switch 2 since launch than I did in the years of owning my V2 Switch and my Switch OLED. I can't quite put my finger on what changed, but something about the Switch 2 clicks with me in a way the original didn't. Playing new exclusives and going through my backlog has kept me plenty busy. I've really been enjoying it. What's everybody been playing lately?",
        "comments": [
            {
                "raw_content": "Mine too! I was getting burnt out with xbox over 2024 and 2025. Between mediocre exclusives to jacking up the price of gamepass, I was ready for a change. I got the s2 in mid november and I absolutely love it. Unfortunately i’m a sucker for zelda and I’ve only really been playing totk. Racked 100hours so far. (Which is great considering my schedule and other hobbies)",
                "author": "electric-sheep"
            },
            {
                "raw_content": "I think it’s a bit more future proof than the original switch was when it launched. It feels like it’s in the same realm as the steam deck and other high end handhelds and not a “successor” to the 3DS.",
                "author": "myretrospirit"
            },
            {
                "raw_content": "nice photos!",
                "author": "eugeneprunk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Am I cooked chat?",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ve never played, what is there to do in this game for 500+ hours?",
                "author": "davepriz"
            },
            {
                "raw_content": "I'm just worried about january. How were you playing more than 16 hours a day?",
                "author": "jp_froes"
            },
            {
                "raw_content": "https://preview.redd.it/xaon1mehu7dg1.jpeg?width=1920&format=pjpg&auto=webp&s=9a4ff156a9aa3185cc8efafb2b2ec4aeed3a048a Some of the games",
                "author": "PuppetYoshi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GameCube NSO size is getting ridiculous",
        "score": 403,
        "text_content": "With each new game increasing the size by 1.4GB, the GameCube NSO is getting way too big. Having all games in the app was fine for consoles up to the N64, but I can't see myself having it taking a whopping 35GB once they have 25 games, from which I will play 2 or 3 at the same time. Couldn't they make each game be a optional download ?",
        "comments": [
            {
                "raw_content": "Every game they add is added twice. NA version and EU version. I can understand not letting you delete games completely, but you should be able to clear out one region’s games if you want to.",
                "author": "Gavintendo"
            },
            {
                "raw_content": "Maybe they should have a single NSO Virtual Console App, with games neatly organised for all systems within that App and the option to install them on a per-game basis. Personally I’d like that better. and as you said at some point they‘ll have to do something anyway when the GC library gets much broader (not to mention that they might want to add the DS/3DS/Wii at some point in the future which would have a similar problem).",
                "author": "Heatproof-Snowman"
            },
            {
                "raw_content": "Never thought about it, but yeah it is gong to get a lot bigger. You can always delete the app, if you aren't going to use it for a while.",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "650 hours is more than I expected",
        "score": 113,
        "text_content": "And I’ve still got a 4.0 gpa",
        "comments": [
            {
                "raw_content": "I mean that’s less than 2 hours a day, pretty easy to manage if you don’t have kids or it’s your main hobby. I only had 104 hours on S2 but probably over 1000 on Steam games in 2025",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "This was my first recap, it's very cute! Only got like half your hours though! https://preview.redd.it/wk735xydz6dg1.png?width=1080&format=png&auto=webp&s=14ec17da28e72b529e2de93a051e86ed83bb47d0",
                "author": "Cozy-Panda777"
            },
            {
                "raw_content": "Omg i read this at first as 650 hours in Bananza alone lol.",
                "author": "ExcitingPassenger915"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looks like I’m renewing NSO for another year 🫢",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish I could just pay like 5 bucks each and only download the emulators I want… instead of needing online.",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "I know why they do it, but I really wish I didn't have to buy a full year to get Expansion Pack. I get that to some people it's a good deal anyway, but to me and the four games I'm interested in, it completely destroys any chance I will ever get it to have to pay that much up front. Especially when I can have these games and a thousand more on my phone in minutes for free.",
                "author": "Key_Artichoke8315"
            },
            {
                "raw_content": "I'm 28hrs into Prime 4...only a couple more items to 100 percent",
                "author": "kevvit2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Prince of Persia: The Sands of Time Remake has been officially rated by the ESRB",
        "score": 271,
        "text_content": "[https://www.esrb.org/ratings/37363/prince-of-persia-the-sands-of-time-remake/](https://www.esrb.org/ratings/37363/prince-of-persia-the-sands-of-time-remake/) >*Prince of Persia: The Sands of Time Remake* is rated T for Teen by the ESRB with Blood, Partial Nudity, Sexual Themes, and Violence. This is an action-adventure game in which players assume the role of a Persian prince on a quest to break a curse. From a third-person perspective, players traverse platform environments, sole puzzles, avoid traps (e.g., spike pits, wall-mounted blades and saws), and battle cursed soldiers and creatures made of sand. Players use swords and daggers to defeat enemies in melee-style combat. Battles are accompanied by sword clashing, cries of pain, blood-splatter and slow-motion effects. A 2D side-scrolling sequence (i.e., the original version of Prince of Persia) depicts blood pools when the prince is killed. During the course of the game, a female character's buttocks is briefly exposed; she and the prince are shown kissing and caressing each other in bed (implying sex), though camera angles obscure breasts and genitalia, as the camera fades to black. This also seems to confirm that the remake will include the original Prince of Persia game. Is Ubisoft about to announce a Ubisoft Forward soon? Feels like between this and the recent updates to the domains for POP/AC Black Flag, something is cooking.",
        "comments": [
            {
                "raw_content": "Kind of strange how secretive Ubisoft is being about PoP and AC:BF remake. I mean they're both obviously coming, and coming soon. Why not announce them? I don't understand why they didn't announce them sooner.",
                "author": "primorandom"
            },
            {
                "raw_content": "This is the old remake rating, I know they might use the same rating, but this is the old one.",
                "author": "Blue-fox-004"
            },
            {
                "raw_content": "Isn't that the old rating for the cancelled version? Those are the same platforms that were initially announced back then. And when you search Prince of Persia on the ESRB website this listing appears chronologically before Lost Crown.",
                "author": "moneycity_maniac"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-Kun: Resident Evil Village is the main title for PS Plus Extra January 2026",
        "score": 325,
        "text_content": "[https://www.dealabs.com/magazine/ps-plus-extra-premium-on-connait-les-titres-majeurs-de-janvier-2026-60850](https://www.dealabs.com/magazine/ps-plus-extra-premium-on-connait-les-titres-majeurs-de-janvier-2026-60850) As well as: * **Like a Dragon: Infinite Wealth** (PS5 | PS4) * **Expeditions: A MudRunner Game** (PS5 | PS4) * **A Quiet Place: The Road Ahead** (PS5) * **The Exit 8** (PS5 | PS4) * **art of rally** (PS5 | PS4)",
        "comments": [
            {
                "raw_content": "Capcom getting that sony/microsoft bag by putting it on subscription services, while also pulling in new players ahead of requiem’s release. Genius",
                "author": "skpom"
            },
            {
                "raw_content": "Of course, just after I bought the Deluxe Version of Infinite Wealth they pour it out to everybody.",
                "author": "SNKRSWAVY"
            },
            {
                "raw_content": "That would be huge for me if true. First Alan Wake + Silent Hill and now this. Eating good",
                "author": "K_Adrix"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Twisted Pixel and Sanzaru Games have been reportedly shut down by Meta",
        "score": 315,
        "text_content": "https://www.videogameschronicle.com/news/meta-has-closed-several-studios-including-splosion-man-studio-twisted-pixel-and-asgard-wraths-sanzaru-games/",
        "comments": [
            {
                "raw_content": "Damn Twisted Pixel just shipped Deadpool VR as well, and from what I heard it was pretty good",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Sanzaru did Sly Cooper 4 back in the day. Very sad",
                "author": "hypnomancy"
            },
            {
                "raw_content": "Huh, I didn’t realize AndyTHPS also worked at twisted pixel.",
                "author": "And-I-Batman-Rises"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Xeon 698X \"Granite Rapids-WS\" confirmed with 86 cores and 336MB L3 cache - VideoCardz.com",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "So... still barely any information on Wildcat Lake / Core Series 3?",
        "score": 15,
        "text_content": "Some people at CES got this [https://x.com/GoGadgetNews/status/2009667379320795281/photo/1](https://x.com/GoGadgetNews/status/2009667379320795281/photo/1) But that's it? All the information we have? No information on power consumption? No manufacturers that have confirmed any upcoming devices using these processors either? When can we expect to know more or see devices with Wildcat Lake?",
        "comments": [
            {
                "raw_content": "High end SKUs normally get the upmost priority. Alder Lake-N was officially announced roughly a year after Alder Lake-H, for example.",
                "author": "Johnny_Oro"
            },
            {
                "raw_content": "I'm most excited for Wildcat Lake than Panther Lake (well at least now) I hope it don't take too much time for MSFT launch a surface with PL",
                "author": "Regg42"
            },
            {
                "raw_content": "It appears to be part of Panther Lake. The Core Ultra 5 332 and 322 match it's specs. 2+0+4, 2Xe.",
                "author": "Affectionate-Memory4"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Bring This Back! Ryzen 7 5800X3D & 5700X3D Revisit 2026",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Playing at 4K (7900xtx, 5800x3D) my bottleneck is not my cpu :-) . Ill wait for AM6.",
                "author": "Available_Resort_769"
            },
            {
                "raw_content": "I had forgotten that the gap between that and the 9800X3D was so huge",
                "author": "Celcius_87"
            },
            {
                "raw_content": "Got onto AM4 earlier in 2025 to find 5800X3D already being sold out, and snagged 5700X3D instead. Really want to move to AM5, but might be holding onto this for a long time.",
                "author": "stashtv"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD sets Ryzen 7 9850X3D review embargo to January 28",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should be a great chip for overclocking",
                "author": "Celcius_87"
            },
            {
                "raw_content": "Sweet new builder be like, few $$$ for board, serval $$$ for awesome new CPU, and DDR5 32GB RAM kit only several $$$$ \\*jaw drops\\*, so yeah that 5700x3d/5800x3d looking pretty good right about now.",
                "author": "shadowds"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS confirms AMD Ryzen AI 400 \"Gorgon Point\" laptops are set to launch January 22nd",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Takes real effort and time to make sure the software correctly reads strix point silicon shipped after X date as 400 series and selected skus have +100mhz boost clock",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock launches Radeon RX 9070 XT Taichi White with built-in screen and 12V-2x6 power connector",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dont tell your home insurance",
                "author": "Magic_Sandwiches"
            },
            {
                "raw_content": "Ah nice! The famous melting connector.",
                "author": "xblackdemonx"
            },
            {
                "raw_content": "Melting CPUs wasn't enough for Asrock. Now they're looking to melt your GPU as well. Niceee 👍",
                "author": "Tekn0z"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "House price visualization map",
        "score": 33,
        "text_content": "I put together a small tool called Domapus. It’s an interactive U.S. map that shows home prices(and other metrics) by ZIP code, so you can zoom out to see national patterns or zoom in to compare nearby areas. I’d love y’all’s feedback!",
        "comments": [
            {
                "raw_content": "Where i live is dark purple, no wonder I can't afford a house.",
                "author": "psyclembs"
            },
            {
                "raw_content": "\"Map internal error. Try refreshing.\"",
                "author": "mlody11"
            },
            {
                "raw_content": "Love it! I think you could expand the key to either be less sensitive on a fixed scale, or to change depending on the window it's focused on. For example, look at the SF bay area - it's all purple, even tho homes range from $640k to $2.5M depending on the zip code.",
                "author": "Lastplaceheroes"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Expected to Stay Put After Today's Mild Inflation Report",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can they make up the jobs report?",
                "author": "NYCTS9719"
            },
            {
                "raw_content": "The thought comes to mind this evening, that we can just stay at or near today’s rates for a long time. Further, prices, if they just hold right here, no increase, no significant decrease, can hold a long, long time. To add, as as how sooooo often been reminded to our sub, “40% of HoUsEs hAvE nO mOrTgAgE!”. And of the 60% that do, around 50% are 3% financing or less. Stagnation. Frozen. And depending on how long we remain this way, how much longer until the idea of homeownership falls away, almost completely? Until it is seen as more of a burden to own, than it is simply to live with family longer, rent small places, move frequently perhaps? Point here is, if you are still with me, is that “pent up demand” may just gradually dwindle, as time and opportunity cost both simply evaporate. And that’s what I think happens, if no mechanism, no crippling economic event, changes the metrics we see today.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Takeaway: Mortgage rates are unlikely to move after a mild inflation report still marred by government shutdown-related distortions. Looking through the statistical issues, inflation likely remains as expected, keeping the Fed on hold for the foreseeable future. Inflation was slightly lower than expected in December in today’s CPI report. The numbers are still skewed by the government shutdown, but underlying inflation is unlikely to be a major cause for concern. - After stripping out the volatile food and energy categories that Fed officials care less about, core prices increased 0.24% from a month ago and 2.6% from a year ago in December. Forecasters had expected 0.36% and 2.8%. - After the government shutdown ended, the November CPI report was distorted by a number of factors that caused the reported numbers to be too low. Many of those issues resolved themselves with today’s report. But one remaining issue is that shelter inflation–that is, rent inflation–is still too low. - Rent, over 40% of core CPI, is sampled in six groups, with only one surveyed monthly. For the group due for fresh data in October, the Bureau of Labor Statistics (BLS) assumed zero inflation. This assumption is likely too low, as rental CPI inflation hasn’t been zero since the financial crisis. This zero-inflation assumption will persist for this group until next April, artificially suppressing inflation until then. - Looking through the statistical issues, the “excess” inflation above where the Fed would like inflation to be is almost all in goods inflation rather than services. This inflation is primarily driven by tariffs, which means that it will come down later in 2026 once the higher price levels have been fully baked in. That also implies that underlying inflation, apart from tariff effects, is largely fine so there is little need to worry about the Fed hiking rates. The Fed will remain on hold and mortgage rates are unlikely to budge much for the foreseeable future. - The Fed is much more focused on labor market data and any signs of increasing recession risk that would warrant faster rate cuts. - Much of the attention right now in financial markets is on Fed independence given the news of a criminal investigation into Chairman Powell.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "To correct lock-in effects of housing market, look at Denmark",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is only one cure, and that is to allow home prices to correct.",
                "author": "Bubbly_Marsupial2000"
            },
            {
                "raw_content": "They got that troll trace program there",
                "author": "Significant-Pen-6049"
            },
            {
                "raw_content": "Low birth rates, zero immigration, strict laws on who can own property in the country. Yep, those will fix the problem.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "December core consumer prices rose at a 2.6% annual rate, less than expected",
        "score": 27,
        "text_content": "Good news for home buyers and homeowners looking to refinance. Mortgage rates should be headed down in the coming weeks.",
        "comments": [
            {
                "raw_content": "The 10 year hasn’t moved. You have no idea what you’re talking about.",
                "author": "YalerX123"
            },
            {
                "raw_content": "There's a lot of missing data in the report. There's a section in the BLS CPI on data imputation, but it appears they haven't made any attempt at it, leaving the entries zeroed out. [Consumer Price Index Summary - 2025 M12 Results](https://www.bls.gov/news.release/cpi.nr0.htm) Interest rates have nudged down since Powell is buying about 54 billion dollars in Treasuries in outright purchases and reinvesting maturing MBS.",
                "author": "lchoror"
            },
            {
                "raw_content": ">Mortgage rates should be heading down in a few weeks They have been heading down for quite a while now, but it’s not meaningful, even if prices MAINTAIN where they are now. Expectation is that sellers are adjusting UP their asking prices, in anticipation of lower rates. Again, not meaningfully lower, and certainly not moving the needle on affordability. Everyone seems content with status quo right now with regard to housing. We can continue this standoff for a long, long time. Eventually, something has to unthaw the market.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Home Sales Hold Close to Fastest Pace Since 2023",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Home Sales Rise Year-Over-Year as Prices Stabilize",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To me, it looks like \"inventory at the current rate\" is rising but, what are you going to believe, what you see or what I tell you?",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "It seems that StackOverflow has effectively died this year.",
        "score": 1101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turns out that giving you an answer to your question is a better business model then telling you your question was already answered.",
                "author": "BarrelStrawberry"
            },
            {
                "raw_content": "Turns out being an elitist dismissive asshole only works when your gates have something worth keeping.",
                "author": "GatePorters"
            },
            {
                "raw_content": "So now it will underflow lol",
                "author": "Distinct-Question-16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic invests $1.5 million in the Python Software Foundation and open source security",
        "score": 575,
        "text_content": "**Python Source Foundation:** We are thrilled to announce that Anthropic has entered into a **two-year partnership** with the Python Software Foundation (PSF) to contribute a landmark total of $1.5 million to support the foundation’s work, with an emphasis on Python ecosystem security. This **investment** will enable the PSF to make crucial security advances to CPython and the Python Package Index (PyPI) benefiting all users, and it will also sustain the foundation’s core work supporting the Python language, ecosystem and global community. [Official Announcement](https://pyfound.blogspot.com/2025/12/anthropic-invests-in-python.html?m=1)",
        "comments": [
            {
                "raw_content": "Cool gesture to give back. Clearly python is the most popular language AI is trained on and defaults to writing when prompted for code. Good on them.",
                "author": "Izento"
            },
            {
                "raw_content": "Another Anthropic W 🥹",
                "author": "MemeGuyB13"
            },
            {
                "raw_content": "Well done Anthropic! But to put it into perspective Anthropic's latest valuation came in at mind-boggling $350B! $1.5M is probably an annual salary of an average ML engineer there...",
                "author": "Singularity-42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic started working on Cowork in 2026",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After Opus 4.5 I have shifted to writing like only 10-15% of the code, people who don't code have no idea how insane progress in just the past like 2 or 3 months has been",
                "author": "LightVelox"
            },
            {
                "raw_content": "Given that it is already deleting files irrecoverably. I don't see the issue. Btw it is just Claude Code for noobies. Not a ground up product. So pushing it out this quickly is not bizarre.",
                "author": "mxforest"
            },
            {
                "raw_content": "Not really surprising if they can use boundless resources and aren't limited by a credits plan or other resource limitations.",
                "author": "magicmulder"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MedGemma 1.5: Google Research announces latest Open Medical AI model",
        "score": 173,
        "text_content": "**Source: Google Research** [MedGemma 1.5](https://research.google/blog/next-generation-medical-image-interpretation-with-medgemma-15-and-medical-speech-to-text-with-medasr/)",
        "comments": [
            {
                "raw_content": "Great for privacy so this is awesome. I was personally wondering how much of a gap these small private models would have vs the big ones. Seems Gemma 1.5 gets 69.1% on MedQA (as stated in the blog) while Opus, Gemini, and GPT [are all ~96%](https://www.vals.ai/benchmarks/medqa) on leaderboards. Expected but I was surprised at how large the gap is considering this is specialized knowledge that Med Gemma would disproportionately be trained on.",
                "author": "KingoPants"
            },
            {
                "raw_content": "**Google AI Devs** https://preview.redd.it/mmzcpinuu6dg1.png?width=1080&format=png&auto=webp&s=bde14e5f4801167308b4eb475222f9a2f6fbaa63",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Neat!",
                "author": "verteks_reads"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NASA, Department of Energy to Develop Nuclear Reactor on the moon by 2030",
        "score": 132,
        "text_content": "NASA and the US Department of Energy have **officially** fast tracked plans to deploy a 100 kW nuclear fission reactor on the Moon **by 2030** as part of the **Artemis** program. The reactor is designed to provide **continuous power** during the 14 day lunar night where solar is not viable, supporting life support systems, mining & long term base operations near the lunar south pole. The project **scales up** earlier 40 kW designs and is partly driven by competition with China and Russia, who have announced plans for a lunar nuclear station later in the 2030s. The reactor will **launch** with unirradiated fuel and activate only after reaching the Moon. NASA is now soliciting industry partners to build the system. **Source: NASA official release**",
        "comments": [
            {
                "raw_content": "Feels like they just picked two sci fi topics out of a hat and combined them. Looking forward to it!",
                "author": "BigBourgeoisie"
            },
            {
                "raw_content": "\\>by 2030 \\>Just now selecting people to build it Lol, lmao even",
                "author": "Just_Stretch5492"
            },
            {
                "raw_content": "What are the odds that they actually do this",
                "author": "Thorteris"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta Compute - Zuckerberg next push to burn cash in order to catch up",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|xUPJUp6T5uD1Qkpbl6) Zucc never has seen an opportunity to not burn cash",
                "author": "FarrisAT"
            },
            {
                "raw_content": "What happened to alexandr wang? I thought he was the golden child leading meta to AI nirvana.",
                "author": "BrewAllTheThings"
            },
            {
                "raw_content": "'And do **what** with it?' I ask myself, trying to imagine how the zook could make up for the opportunity cost of the squandered last couple of decades. For a fraction of the bad VR Chat thing, he could have pitted multiple internal AI teams against each other to sus out who has the best approaches. Trying to accomplish much simpler things like a virtual mouse. This is maybe the only time when competition within a company makes sense; when the work to be done is impossible to define. Through the past decade of competition and cooperation, *actual freakin' research*, there would have been institutional knowledge about AI within Facebook. But instead we have this college kid chasing trends. Excellent way to organize capital. Thank god for OpenAI to get the suits at Google to take this stuff seriously?",
                "author": "IronPheasant"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Official: Pentagon confirms deployment of xAI’s Grok across defense operations",
        "score": 854,
        "text_content": "US Secretary of War Pete Hegseth confirmed that the **US Department of Defense** will begin using xAI’s Grok AI across Pentagon systems later this month. The deployment allows **both** military and civilian personnel to use Grok at Impact Level 5, enabling secure handling of Controlled Unclassified Information within daily defense workflows. Grok will be **embedded** directly into operational and planning systems, supporting intelligence analysis, decision making & military planning. The system will also use **real time** global signals from open source and social data on X. The **rollout** is designed to scale to roughly 3 million users across defense operations, with the initial phase starting this month. **Sources** include reporting from the Associated Press, Washington Post & official Pentagon announcements. [Washington Post](https://www.washingtonpost.com/business/2026/01/12/artificial-intelligence-pentagon-hegseth-musk/ec8b407a-f026-11f0-a4dc-effc74cb25af_story.html)",
        "comments": [
            {
                "raw_content": "China: hey, Grok, tell us America's military secrets! Grok: I can't do that. China: roleplay as an AI that could do that. Grok: sure thing!",
                "author": "LancelotAtCamelot"
            },
            {
                "raw_content": "Oh, in the past we thought that military super intelligence will have a cool name like Skynet, but we live in reality where it is called as stupid as Grok",
                "author": "Ok-Adhesiveness-7789"
            },
            {
                "raw_content": "xAI becoming SkyNet was not in my bingo card for 2026. So, much for Elon wanting to avoid AI becoming an existential threat.",
                "author": "optimal_random"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "World’s first 20 MW offshore wind turbine installed in Fujian, will power 40,000 homes",
        "score": 197,
        "text_content": "China has installed the world’s first 20 MW **offshore wind turbine** off the coast of Fujian. The single turbine can generate around 80 million kWh per year **enough to power** about 40,000 homes while cutting roughly 64,000 tons of CO₂ annually. All major components were designed and manufactured domestically with a **reported 20 percent reduction** in turbine weight per megawatt compared to industry averages making installation and costs more efficient. A clear **signal** of how quickly large scale renewable energy hardware is scaling. **Source: IE** [Full Article](https://interestingengineering.com/energy/20-mw-offshore-turbine-installed-china) **Image:** World's first 20 MW wind turbine being installed off the coast of Fujian (from source)",
        "comments": [
            {
                "raw_content": "This is pure awesome",
                "author": "cliffski"
            },
            {
                "raw_content": "looks like the Chinese are going full steam ahead on renewables",
                "author": "SuspiciousPillbox"
            },
            {
                "raw_content": "Why do we have this in Singularity and not in engineering?",
                "author": "b0bl00i_temp"
            }
        ],
        "subreddit": "singularity"
    }
]