[
    {
        "post_name": "LOL this is a real post",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My name is BBQ McNugget. You ate my father. Prepare to DIET!",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Joke is on them. I eat the whole bird.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "People Eating Tasty Animals",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Super Bowl Halftime Show is absolutely terrible, one of the worst, EVER!",
        "score": 1166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is, but GUARANTEED all of left wong media will be united in declaring it \"the best, most watched, most loved ever\"",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Should have had Vanilla Ice doing \"Ice Ice baby\"",
                "author": "vsekvsek"
            },
            {
                "raw_content": "I wouldn’t know what the NFL halftime show featuring Bad Bunny (aka Faggit Rabbit) was like. I turned it off temporarily (so they would not get ratings) and watched Kid Rock’s alternate halftime show on YouTube. It was a great patriotic tribute to not only American values but to a great American - Charlie Kirk. Thanks, Kid! We appreciate you!",
                "author": "jerrymesa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A pro-ICE ad just ran during the Super Bowl",
        "score": 1218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it was on after the halftime show finished....good timing lmao",
                "author": "dsred259"
            },
            {
                "raw_content": "Pedes, I applied. Wish me luck. I have zero enforcement experience but I do have data crunching experience. The job is not on the ground, it’s for data checking. It’s processing and reviewing deportation orders. Wish me luck.",
                "author": "_Sully_"
            },
            {
                "raw_content": "I want them removing non-violent foreign invaders too. Let's do that second, fine. But let's do that.",
                "author": "UncleSlayton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House: \"We don't do subtle. We choose bold. We don't limit our ambition. Never have. WE BUILD BIG FAST. We bet on ourselves. And don't apologize for winning.\"",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Full Scale MAGA!! NOW!!!",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Wait till you learn how much of NFL is subsidized by tax funds. More avenues than you can be able to account for without doing some serious research! Probably more complicated than U.S.A.I.D.S Woke, anti-american communist corporations that profit tens of billions are stimmying with as many taxpayer funds as possible. Imagine",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Super Proud White House Ad!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TPUSA'S ALL-AMERICAN HALFTIME SHOW",
        "score": 1162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My my what a collection of sheep. Stay sleeping",
                "author": "HopefulMom"
            },
            {
                "raw_content": "Imagine being a a one language only mongrel.",
                "author": "Auserr"
            },
            {
                "raw_content": "Don't really care much for sportsball or TPUSA but was rooting for them on this one. Hell yeah. Also man I didn't recognize Kid Rock. I was skipping through the video a bit and thought he was that Tiger King guy. Haha. Respect to the guy.",
                "author": "WildernessBro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS WEEK ✅ Stock market/Dow his 50,000 for first time ✅ Murder rate lowest since 1900 ✅ Zero border crossing for 9 months straight Don't lose focus. The left-wing media is trying to distract and divide.",
        "score": 1032,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great. Love it. Want more of it. Still want a lot more arrests. Not these trash can agitators. Legitimately dangerous people. Career rat politicians. Every last one of them.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "> Murder rate lowest since 1900 # Can we please get rid of the FUCKING FLOCK PLATE READERS and MICROPHONES now?",
                "author": "IowaRepublic"
            },
            {
                "raw_content": "The left-wing media is also right here on this site trying to distract and divide.",
                "author": "Metalheads4Trump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Up to 3.4 million live viewers now, wow",
        "score": 1026,
        "text_content": "",
        "comments": [
            {
                "raw_content": "4.3m",
                "author": "Limbaugh"
            },
            {
                "raw_content": "Millions of non-faggots agree: Bean Bunny for deportation.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Way better than that degenerate pedo pushed garbage.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal judge orders Fulton County Georgia election case documents unsealed by Tuesday",
        "score": 1202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FTA: \"Trump and his allies vehemently denied that he lost the 2020 election to former President Joe Biden, an assertion that has proven to be false.\" If that's true, then why are we here and why are you fighting what the ballots will show?",
                "author": "AncientRomeEveryDay"
            },
            {
                "raw_content": "I am sure Trump wants to release everything possible to give everyone a chance.",
                "author": "mikejones"
            },
            {
                "raw_content": ">The raid of a Georgia election facility in Fulton County has come under intense scrutiny due to its connection to Trump’s *debunked* claims of election fraud in 2020. Journalists genuinely believe it's not their fault that nobody cares their profession is dying",
                "author": "mullethawk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan’s Trump-Endorsed ‘Iron Lady’ Scores Landslide Victory in Japan — Securing Mandate For Deeper U.S. Ties",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She believes wild, shocking things like \"people who break laws should face the consequences\" and \"illegal immigrants are not good for this community.\"",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "Sanae Takaichi and her Liberal Democratic Party (Conservative Nationalist) won 316/465 seats, gaining 125 seats (310 for supermajority) in a historic landslide victory, winning the highest number of seats in Japan history since WW2 in 1942! Surpassing the previous record of 308 seats won by the Democratic Party of Japan in 2009. Japan was a one party state in 1942, Hideki Tojo and his Taisei Yokusankai/Imperial Rule Assistance Association won 381/466 seats, the other 85 seats were Not Endorsed. Takaichi and her LDP Party also have a coalition with the Right Wing Populist Japan Innovation Party (Ishin) giving them 352 seats combined, 75% total. Right Wing Populist Party Sanseitō gained 12 seats, now they have 15 seats. Japanese communists got cut in half, losing 4 seats. Left-Wing Populist Reiwa Shinsengumi Party lost 7 seats, now only having 1 seat. The Centrist Reform Alliance Party lost 123 seats. [Japan map showing how each district voted](https://files.catbox.moe/dr9lms.png) --- [President Trump: Congratulations to Prime Minister Sanae Takaichi and her Coalition on a LANDSLIDE Victory in today’s very important Vote. She is a highly respected and very popular Leader. Sanae’s bold and wise decision to call for an Election paid off big time. Her Party now runs the Legislature, holding a HISTORIC TWO THIRDS SUPERMAJORITY — The first time since World War Il. Sanae: It was my Honor to Endorse you and your Coalition. I wish you Great Success in passing your Conservative, Peace Through Strength Agenda. The wonderful people of Japan, who voted with such enthusiasm, will always have my strong support.](https://truthsocial.com/@realDonaldTrump/posts/116037545036564953)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "So she has a mandate, she has an unstoppable super-majority, now she needs to show what she's going to do with it because every success and every failure is going to be entirely on the shoulders of her and her party.",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal white women have started a trend calling on cartels and gangs to team up to take out ICE agents, claiming they are safer than Donald Trump’s “Gestapo.” We need mass mental hospitals and trials for the “outlets” that have done this to people. The majority of them are on SSRI's as well.",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's gonna get beheaded by the cartel instead.",
                "author": "irongeek"
            },
            {
                "raw_content": "So if the cartels and gangs are attacking Federal agencies, then they can be gone after all over the world. If they're doing it internally, they are legitimate military targets.",
                "author": "ancillasedet"
            },
            {
                "raw_content": "\"women\" ok bro",
                "author": "reversethefraud"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Having the halftime show for your biggest game of the year in a language almost none of your lifelong fans can understand, while waving the flags of countries that none them are from, is the biggest fuck you that I’ve ever seen a corporation give to its own consumers",
        "score": 690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didnt watch. Was not offended. Quit fucking watching.",
                "author": "1inchgroup"
            },
            {
                "raw_content": "bud light and gillette have enterd the chat",
                "author": "reversethefraud"
            },
            {
                "raw_content": "The NFL could have 2 guys ass-fucking on the 50 yard line for a half-time show and the majority of its fans would still keep watching. I really don't think there's any level of humiliation they wouldn't tolerate just to keep watching their stupid fake sportsball.",
                "author": "OpusX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Hadley Davis, Cincinnati 911 dispatcher who’s doxxing ICE agents while on duty",
        "score": 1439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Attempting to aid criminals in evading the law should be immediate grounds for removal and prosecution. Hell, persecution too.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "She's probably too dumb to understand what she is doing.",
                "author": "Coprolite"
            },
            {
                "raw_content": "Not only should she be terminated immediately she must be charged for endangering law enforcement. Set a precedent NOW.",
                "author": "Mikeyy5000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On February 2, 2026, Western Digital (SanDisk's former parent company before the 2025 spin-off) announced plans to relocate its Flash Memory headquarters from Milpitas, California, to Austin, Texas.",
        "score": 926,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah but are they going to actually *manufacture* there? Fucking DDR5 is 3x what it was a few months ago, Micron killed Crucial, and flash memory ain't far behind RAM.",
                "author": "IowaRepublic"
            },
            {
                "raw_content": "And all the employees the bring with them will still vote blue. Yes, Austin is a blue shithole too unfortunately but now you're adding commiefornians along with a shit ton of jeets! How do I know because I live in northern Nevada and them same shit is happening here. The roads are so fucked with stupid ass drivers, they keep building shit apartments around and now we have a fuck ton of jeets and chinese, not to mention countless other foreigners wanting handouts.",
                "author": "MidnightGhost"
            },
            {
                "raw_content": "Leaving CA for Austin is like jumping out of the frying pan into a gay volcano.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Q: “Logan [Paul] , are you excited for the halftime show? LOGAN PAUL: “NO”",
        "score": 1167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one in America - except the America last crowd - wants this faggot halftime show.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "“No, I heard it’s gonna be gay and retarded” FTFY Paul Logan",
                "author": "diCenturion"
            },
            {
                "raw_content": "SPORTSBALL IS GAY.",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Conservatives are now calling for mass protests outside the home and offices of Texas Democrat Rep. Gene Wu after he stated that minorities need to rise up against white people and take over the United States.",
        "score": 492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go back to China Fag Wang",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "> Wu was born in the city of Guangzhou in Guangdong province, China Pretty clear where his allegiance is. He shouldn't be allowed to hold office if his goal is to do the bidding for the CCP and undermine the US government.",
                "author": "AbsurdOpinion"
            },
            {
                "raw_content": "America is a WHITE, CHRISTIAN-FIRST nation",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RETARD NOISES INTENSIFY: Indigenous-led demonstration serves ICE symbolic 'eviction notice'",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People upset about being colonized and conquered are supporting it happening again?",
                "author": "Zskills"
            },
            {
                "raw_content": "\"Indigenous\" is a nonsense political term. It exists to mean \"not you, whitey\". But everyone has to be indigenous to somewhere.",
                "author": "VoteThing"
            },
            {
                "raw_content": "So they dressed up a white chick as some Russian peasant to tell Americans to leave? I don't get it.....",
                "author": "Taylor3006"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "5.38 million viewers at the max. And TPUSA gained 300k+ new followers during the halftime show. God Bless! 🙏",
        "score": 513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Plus multiple platforms so probably 15m - took a solid chunk from nfl.",
                "author": "Cville123"
            },
            {
                "raw_content": "And that is only ONE platform as far as I can tell. I have a feeling, through the 5+, maybe closer to 10 main show platforms (?), combine them all in the end - looking forward to seeing this number. I know there is anywhere from 100 to 150 million viewers on the Super Bowl - I cannot wait to see the dent we made in ratings by NOT watching the game, yet YES watching the ALTERNATIVE HALF TIME SHOW. They are going to lose their shit at even a 10%, I think TPUSA probably took at least HALF to that show instead of Fag Funny’s bullshit.",
                "author": "realPixelDust"
            },
            {
                "raw_content": "What was that 2nd song Lee Brice did about telling his son that girls can't be boys?",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is Why You Went Broke: Fans Blast WaPo for Calling Colin Kaepernick \"The Most Relevant Figure\" at Super Bowl LX 🤡🌎",
        "score": 1118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The NFL fans LOVE kneelers and faggots",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "At this point, Bezos must consider intentional sabotage by employees as a cause for the paper's failure.",
                "author": "_Liberty_Prime_"
            },
            {
                "raw_content": "What’s he on his knees for now?",
                "author": "Grindelwald"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. John Fetterman just DEMANDED VOTER ID — infuriating Democrats. “And now me, as a Democrat, I do not believe that it’s unreasonable to show I.D. just to vote!”",
        "score": 1675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If a politician doesn't want Voter ID, its because they're cheating in our elections.",
                "author": "AstroBenny"
            },
            {
                "raw_content": "The lump has reason.",
                "author": "SaltyKrakenBalls"
            },
            {
                "raw_content": "Will he actually VOTE for it though?",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Give this a thumbs up if you want Ilhan Omar deported.",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So long as she returns the money she stole...meh.",
                "author": "TheColonelsDaughter"
            },
            {
                "raw_content": "You are the one in control of the Executive branch, dude. Do something.",
                "author": "getup"
            },
            {
                "raw_content": "At this point I want her sent back to \"allah\". No jail sentence will be enough to punish her for all the harm that she brought to this country",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Radeon still refuses to officially release FSR 4 INT8 for RDNA 2 - 3 GPUs despite the backlash they got",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This still remains one of the biggest marketing foot-guns I have ever witnessed. The biggest benefactor of the FSR4 INT8 release would be the thousands of Handheld PCs where AMD have basically stalled out at RDNA 3.5. All the Steam Decks, Legion GOs, XBOX Allys are all stuck with FSR3 from the AMD camp. I use it on my Legion GO (via an Optiscaler plugin for Bazzite/SteamOS) and it absolutely dunks all over FSR3. AMD could really lose the handheld market in a single generation with Intel's B390 release. Not to mention the fact that AMD users can get a better upscaler by substituting FSR3 for Intel XeSS is hilarious!",
                "author": "Stewge"
            },
            {
                "raw_content": "They can't even apply the argument that FSR4 would work bad on older cards now that Nvidia released DLSS4.5 for all RTX cards. Should have taken advantage of being the 'underdogs' but missing out is their thing, they aren't even competing on high end consumer end where there's only Nvidia",
                "author": "yamidevil"
            },
            {
                "raw_content": "Considering how fast they put rdna2 on maintenance mode, i don't think they want to put resources in rdna3 which will go into maintenance mode in late 2027.",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Move over, MacBook: The new Dell XPS 14 is now the longest-lasting laptop we’ve ever tested",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$2300 CAD for 16 GB LPDDR5X, 512 GB SSD. 😭",
                "author": "InadequateUsername"
            },
            {
                "raw_content": "That is impressive, presumably most Panther Lake machines with reasonable batteries will have exceptionally good battery life. I hope Windows plays nice with them as regards sleep etc, that's really a matter of ensuring everyone's drivers play along.",
                "author": "jenny_905"
            },
            {
                "raw_content": "This is with a 70Wh, not 98Wh + Windows. That's impressive",
                "author": "T-MoseWestside"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel preparing Z990 and Z970 chipsets for Nova Lake-S desktop CPUs",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What happened to the rumored LGA 1700 CPU?",
                "author": "Rude_Thought_9988"
            },
            {
                "raw_content": "You see that motherboard render? It shows 6 SATA ports. Remember that when Z990 launches since newer AMD AM5 motherboards only include 2-4 SATA ports even on ATX",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Quad channel (or Octa whatever for DDR5?) memory or bust. We live in different times. Dual doesn't cut it any more.",
                "author": "mxforest"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel reportedly ‘cancels’ Core Ultra 9 290K Plus, but keeps 270K/250K Arrow Lake-Refresh SKUs",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 270K is rumored as an 8P+16E config, and would be competing directly with the 290K assuming the same 8P+16E config. I could understand this would make the 290K less attractive if they're focusing on more \"cost friendly\" refresh SKUs. I'm still surprised they wouldn't try to market the planned 290K as a binned Special Edition SKU.",
                "author": "nhc150"
            },
            {
                "raw_content": "Another casualty of the DRAM crisis",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I believe this is another victim of the AI tax, they simply need as many dies to be sellable and not waste them on low yield 290k. I’m quite sure they made the equation and came to the fact that they would make less money with having it on the roadmap.",
                "author": "GongTzu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Last Week on My Mac: Why E cores make Apple silicon fast",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why the M chips feel so snappy even when you compare them with equivalent Geekbench x86 chips for example. Efficient cores on x86 is still new but not correctly leveraged by Windows. Linux on the other hand is on the level as MacOs on this part, thanks to the intense integration of Linux powered ARM devices for 2 decades now",
                "author": "MiHumainMiRobot"
            },
            {
                "raw_content": ">The first and last M-series chips to have only two E cores were the M1 Pro and Max, since when every one has had at least four E cores, and some as many as six or eight. Intriguing question. How many E cores is enough?",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "this sounds like more of a OS thread scheduler problem and less of a hardware problem. apple didnt pioneer big little, but microsoft having a shit scheduler in windows doesnt help.",
                "author": "randomkidlol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell XPS 14 2026 review: Fully reborn with Intel Panther Lake X7",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At that price it’s competing with 14” MacBook Pro with the full die M4 Pro chip (14 core cpu, 20 core iGP). I don’t know if it’d compare favourably in any way.",
                "author": "996forever"
            },
            {
                "raw_content": "Pros: + significant design improvements over previous gen + near RTX 4050-level gaming performance + strong graphics performance-per-watt + strong speakers for the size + long battery life Cons: - smaller screen size than outgoing XPS 14 design - limited Turbo Boost sustainability - key feedback still feels shallow - where is the camera shutter? - no more MicroSD slot",
                "author": "Antonis_32"
            },
            {
                "raw_content": "$2200 ouch didn't realise laptops were this expensive, can anyone recommend this chip with worse screens etc to bring the cost down",
                "author": "Unusual_Pride_6480"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What's the point of setup time in synchronous circuits?",
        "score": 8,
        "text_content": "Hold time seems like a simple concept, but setup time makes no sense to me. Why does the circuit care what happens before the rising edge? It seems to me that as long as the input stabilizes before the rising edge, it should be sampled correctly.",
        "comments": [
            {
                "raw_content": "Take a look at the D flip flop implementation: https://www.electronics-tutorials.ws/wp-content/uploads/2013/08/seq7.gif?fit=535%2C184?fit=355,226 You want the D input to arrive and clear the invertor gate before the Clk rising edge or you'll have a [race condition](https://en.wikipedia.org/wiki/Race_condition). In this case, it just happens to be called setup time. This sub is not the place to ask for help of any kind.",
                "author": "Wait_for_BM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I Tested Snapdragon X2 Elite Early - Performance Preview",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meta / rant: The gen-on-gen comparison is *rather* misleading. He is comparing the X2E 88 (18C, nearly highest X2E clocks) vs the X1E 78 (12C, slowest X1E SKU, **no Turbo**). I do not know why this problem affects many laptop reviewers. Desktop reviews usually get it. Nobody would test a **9900X** (12C, nearly highest 1T clocks) vs a **7600X** (6C, slowest 1T clocks) and then claim (3:45): \"*Let's be honest, this kind of performance uplift in a single generation is huge*.\" Mate, you are not comparing a single generation leap. We also jumped like 5+ CPUs up in the product stack. The appropriate comparison does (or rather will) exist: the X2E 78 exists, another 12C, low-tier SKU. We saw the same with the X9 388H (PTL) being compared to then mid-tier CPUs. // Laptop reviewers seem notorious for no clocks / cores on each CPU in the charts: it'd be beneficial, with the alphabet soup AMD, Intel, and Qualcomm use, for more clarity what SKU is what. On desktop, we can match by price. ***If*** the X2E 88 *is* found in all the cheaper laptops that housed the X1E 78, it makes more sense. But until then, just match the SKUs or provide that context for users. // Also, it seems like this has slower perf / GHz 1T on CB2024? Some quick maths: X1E 78 (108 pts / 3.4 GHz): 31.8 Pts / GHz X2E 88 (146 pts / 4.7 GHz): 31.0 Pts / GHz I would for more optimizations, but ASUS specifically said the Cinebench numbers were in line, so it is weird. However, it *may* be like Geekerwan's 8EG5 results, where the CPU actually notably throttles at 1T boost, so it can't hold the 4.7 GHz clock (thus dividing by 4.7 GHz is not accurate).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Looks like I opened reddit at a good time! So it seems they are testing the **non extreme** variant. Lowest 18 core SKU without the 5ghz boost and 192-bit bus. With limited tested as you'd expect great CPU performance. No nuanced power consumption analysis, but at similar TDP with highest end PTL, \\~47% faster in CBr24 nT, \\~12% faster in 1T. \\~72% faster in CPU rendering in blender and \\~47% in CPU transcode in Handbrake. 12.5% more total cores in X2E than PTL, though, in comparison PTL heterogeneous core design is much different to X2E with fewer performant cores. If there were still a u/TwelveSilverSwords around, I'd like to see an analysis on ppa of these cores. Top of my head I don't know the sizes of PTL's compute tile and X2E's die. As for GPU, this is interesting. Just a few samples, but it's no slouch (not like before with X1). Possibly more driver improvements (also check out [ARM64EC](https://youtu.be/3yDXyW1WERg?si=mxaZfuGsSv87zHFD&t=1895))and the flagship X2Ee yet to be seen, this'll be def interesting to follow. HW acceleration in Resolve is something QC need to catch up on. Apple's and Intel's media engine capabilities are still class leading but again, in the future with possible improvements this will be interesting to follow.",
                "author": "Noble00_"
            },
            {
                "raw_content": "The GPU results are somewhat frustrating to see, considering that Qualcomm hasn't done their best for it (as I feel). The GPU on the X1 Elite was so underwhelming because it was an overclocked mobile GPU on an older architecture. This X2 Elite uses their latest architecture, and has 33% more cores than their flagship mobile chip (2048 vs 1536 ALUs), and 50% higher clock speed (1.7 GHz vs 1.2 GHz). But they could've gone for more cores and scaled up higher like Apple \\[ A18(6-core) -> M5(10-core) +66% more cores\\]. We don't have a die shot of the X2 Elite, but based on the 8 Elite Gen 5, we can estimate the GPU area to be under 30 mm2, which is almost half the size of Arc B390 and surely smaller than M5 too. Imagine if they put 50% more cores (3072 ALUs), while dialing the clock speed back a bit. They have the bandwidth to feed it, thanks to the 192 bit memory bus. It would defeat the B390 by brute​ force in raster, while using up less die area.",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch Pro 2 controller might be one of the best ever",
        "score": 1619,
        "text_content": "My gf got me a new Switch 2 Pro controller for my upcoming birthday. At first, I was like, “It’s just another controller.” I already had the first-gen Pro, so I didn’t think much of it—until I actually held it. The feel is completely different. First off, it’s lighter and the build quality just screams premium. It also feels slightly smaller than the original. But the real game-changer was playing Mario Kart World with it. The HD rumble is on another level—way more detailed, like the new Joy-Con. And the sticks… I don’t even know how to describe it, but they’re so smooth. Buttons feel better too, almost silent and more comfortable. Overall, if you’re on the fence about getting one, I’d say this is easily one of the best controllers out there right now. The lack of analog triggers is a bummer—especially with rumors about Forza Horizon 5 maybe coming to Switch 2—but honestly, it’s not a dealbreaker. TL;DR: Switch Pro 2 controller = lightweight, premium, smoother sticks, improved rumble. No analog triggers, but still highly recommended.",
        "comments": [
            {
                "raw_content": "The battery life blows my mind",
                "author": "Mashm4n"
            },
            {
                "raw_content": "It is very good. And the back buttons are really appreciated (I use it for the R3/L3 because I don't like clicking the sticks too much) in a \"standard\" controller. Nice size too. And battery life is incredible. My only complaint is that I find it a bit too light. I don't know, it feels a bit \"empty\" when compared to the Series X or PS5 controller, in my opinion.",
                "author": "Panoptes91"
            },
            {
                "raw_content": "Does the d pad still have the same problems as the original?",
                "author": "Non-mon-xiety"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PLAY KIRBY AIR RIDERS",
        "score": 247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My son loves it.",
                "author": "Sunofabob"
            },
            {
                "raw_content": "wtf is even going on. I’m old. Too old for this game.",
                "author": "Time_Ad_9647"
            },
            {
                "raw_content": "If I can get it for $40 or less, sure",
                "author": "sushi-_-roll"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think Helldivers will be released on Switch 2?",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No",
                "author": "meatboysawakening"
            },
            {
                "raw_content": "Eh I doubt it The game is very demanding, especially the CPU. It’s also a modern gen online only game, so it would be hard to dumb down enough to run and load well so it doesn’t impact other players loading into and out of levels with a Switch 2 player",
                "author": "BakedChocolateOctopi"
            },
            {
                "raw_content": "Nah. The game is already the manifestation of spaghetti code running on an engine which is closed for a decade.",
                "author": "Huge-Formal-1794"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Tennis Fever - Opening Movie",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mario and Bowser seem like they're still bitter at Peach after the ending of Odyssey",
                "author": "fatandretarded5591"
            },
            {
                "raw_content": "I ironically love it when Mario and Bowser are paired together and they look like pals, even for just a moment (like at the end of Odyssey) I think a game where they team up as the main protagonists would be amazing. Something like Crash Twinsanity but grander in scale, and not like Bowser's Inside story but a platforming game",
                "author": "computerCoptor"
            },
            {
                "raw_content": "It's alright. But no Mario Tennis game opening cinematic has come close to beating the Gamecube one. [https://www.youtube.com/watch?v=F20BT-97VfA](https://www.youtube.com/watch?v=F20BT-97VfA)",
                "author": "Alvin-Earthworm"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FINALLY got mine. Give me your favorite non-exclusives that are just better on Switch 2",
        "score": 20,
        "text_content": "So, I'm looking specifically for games you were surprised or just happy with how well it runs on Switch 2. I'm ideally looking for games with no downsides (other than maybe load times) when compared to a PS5 (my other owned platform). So for example, while I'm sure it is a technological marvel, from what I've seen I'd still rather play Cyberpunk on the PS5 over the Switch 2. But MIO memories in orbit on the other hand seems like a perfect port and it gets the benefit of portability. Ofc I'm ok with the game not running as well (it'd be a stupid comparison) or losing a bit here and there, but I'm mostly looking for 60fps games that look great. Indies are very welcome!",
        "comments": [
            {
                "raw_content": "Hades 2",
                "author": "Malabingo"
            },
            {
                "raw_content": "Absolum is great on it. I loved it. Chained echoes is great in handlehd, feels like playing an old school jrpg on handheld like old times. Same for Sea of Stars",
                "author": "Hoorayforkraftdinner"
            },
            {
                "raw_content": "Been playing red dead redemption and it’s awesome. Runs at a locked 60fps and just an amazing game to have available everywhere!",
                "author": "dr3za"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I finally started this game that I'd put aside for a long time. It's a shame it wasn't improved on Switch 2.",
        "score": 61,
        "text_content": "So far, I'm enjoying the medieval level. It's not always easy, controlling movement, the vacuum cleaner's direction, attacks, and everything else... the piano boss really made me sweat 😅 I'd love a higher resolution on Switch 2. Otherwise, it's great!",
        "comments": [
            {
                "raw_content": "This game was a visual marvel for the Switch hardware, it deserves and upgrade",
                "author": "overtunerfreq"
            },
            {
                "raw_content": "This game will probably get a switch 2 enhancement at some point. If the rumours about Luigi's Mansion 4 are true, probably quite soon (this year).",
                "author": "Buzz33lz"
            },
            {
                "raw_content": "Hurry up and finish it so they update it for switch 2 and I can play 😁",
                "author": "DredgenGrey"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are going to buy resident evil requiem?",
        "score": 129,
        "text_content": "Do you guys think it will be a good port? I wanted to support the developers but I'm worried that the PS5 version is better",
        "comments": [
            {
                "raw_content": "Why do people put themselves in this mindset? Of course the ps5 version will run better than the switch version. However, the switch version is 60fps and capcom seems to have put so much effort and advertisement into the switch 2 version. So I’m expecting it to at least be functional throughout the gameplay and will be getting it on the switch 2 over my ps5",
                "author": "xYehox"
            },
            {
                "raw_content": "Yes. Getting the triple pack",
                "author": "wiidsmoker"
            },
            {
                "raw_content": "No. I’m too scared to play it.",
                "author": "OmegaMaster8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Which Pikachu dock cover do you prefer?",
        "score": 163,
        "text_content": "I originally made the all yellow one but then it seemed like it might be a little too much so I changed it up. I see plusses for both so i thought I’d poll the audience.",
        "comments": [
            {
                "raw_content": "All yellow is sick. Significantly better than the black background",
                "author": "JeskaiJester"
            },
            {
                "raw_content": "First one it makes Pikachu look like its doing volt tackle.",
                "author": "Arkantor"
            },
            {
                "raw_content": "They’re both cool but I’d say 2.",
                "author": "Stik601"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "TripleSeven: DMC 6 is getting announced in the upcoming State of Play",
        "score": 667,
        "text_content": "Take this with a big grain of salt but this account has gotten things right in the past https://xcancel.com/triplesevven\\_/status/2020552273743528263?s=46",
        "comments": [
            {
                "raw_content": "If he’s gotten things right in the past, why not mention exactly what? Some people love to bring up new leakers here but refuse to explain why we should believe them.",
                "author": "Sea-Country8245"
            },
            {
                "raw_content": "What things have they gotten right in the past?",
                "author": "Placidao"
            },
            {
                "raw_content": "Can’t find any mention of this leaker on this sub before this post and no actual examples of what they’ve supposedly gotten right before. Guess it’s confirmed in that case 👍🏾",
                "author": "vashthestampede121"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Windows Central - Xbox Next Gen is Running Full Windows 11, Console Like Interface, 2027 Launch is “Best Case Scenario”, Xbox First Party Handheld, OEM Consoles for Higher End and Lower End",
        "score": 699,
        "text_content": "[https://www.windowscentral.com/gaming/xbox/exclusive-the-next-gen-xbox-2027-locked-in-most-ambitious](https://www.windowscentral.com/gaming/xbox/exclusive-the-next-gen-xbox-2027-locked-in-most-ambitious) Xbox Next Gen capable of running full Windows 11, by default will have a console like interface Microsoft surprised by AMD CEO’s comments of supporting Xbox launch in 2027, still polishing on Windows 11 console interface. 2027 launch is “best case scenario.” OEM consoles by manufacturers like ASUS. First Party Xbox serves as baseline, could see more higher end premium consoles from OEMs as well as cheaper slimmed down versions from a variety of companies Xbox first party handheld in development",
        "comments": [
            {
                "raw_content": "I’m unsure why there keeps being news about this. We’ve known this for at least like, a year and a half. The next Xbox is just a living room PC.",
                "author": "alexjimithing"
            },
            {
                "raw_content": "How are they going to make money if it’s like a pc, wouldn’t mos people buy their games from steam",
                "author": "ZenitsuSakia"
            },
            {
                "raw_content": "“Sorry, you need to update your calculator app before you can boot Halo” -next Xbox",
                "author": "Dr_Mantis_Trafalgar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Latin American Playstation Store lists Marvel’s Wolverine as coming out in Q3 2026 (July-September window)",
        "score": 325,
        "text_content": "I don’t know for how long this has been there but I just checked the Wolverine page on the PS App and the description said this in the last paragraph (translated): *Developed in collaboration with Marvel Games and Sony Interactive Entertainment, Marvel’s Wolverine comes to PS5 consoles in the third quarter of 2026.* We knew that Wolverine had a Fall 2026 release window but the only month that could be considered Fall during Q3 would be September, right? [Source](https://store.playstation.com/es-mx/concept/10002861)",
        "comments": [
            {
                "raw_content": "This is kind of expected because assuming GTA 6 is still slated for November, Sony won’t release any first party games around Q4 because they see GTA 6 is a major console seller for themselves especially if it gets proper PS5 Pro utilisation",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Wolverine has big September energy",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Great spot! I'd wager September",
                "author": "Sackboy612"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi602 says the Assassins Creed Black Flag Remake wont be at the State of Play this week, but the reveal and release are set and it's not too far off",
        "score": 415,
        "text_content": "Source: [https://www.resetera.com/threads/rumor-natedrake-says-there-will-be-a-playstation-state-of-play-in-february-up-feb-12th.1416025/post-151055929](https://www.resetera.com/threads/rumor-natedrake-says-there-will-be-a-playstation-state-of-play-in-february-up-feb-12th.1416025/post-151055929) [https://www.resetera.com/threads/rumor-natedrake-says-there-will-be-a-playstation-state-of-play-in-february-up-feb-12th.1416025/post-151057333](https://www.resetera.com/threads/rumor-natedrake-says-there-will-be-a-playstation-state-of-play-in-february-up-feb-12th.1416025/post-151057333)",
        "comments": [
            {
                "raw_content": "Wait, we'll have a State of Play this week?",
                "author": "ssiasme"
            },
            {
                "raw_content": "Yes pls. I really just want to get high and sail the seas and explore islands with the graphics of Shadows",
                "author": "SilentNova300"
            },
            {
                "raw_content": "Let us hope Shinobi is cooking with Starfield ps5 and Ac black flag remake news.",
                "author": "Objective_Love_6843"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[CNN Brasil] EA in talks to bring back Brasileirão and other regional soccer teams to EAFC 27.",
        "score": 84,
        "text_content": "Following somewhat different from FIFA's decisions, apparently EA is in direct negotiations to win the rights of several regional leagues, which include the Brasileirão. Apparently this will be one of the key announcements for the next EAFC. Source: [https://www.cnnbrasil.com.br/esportes/brasileirao/site-crava-data-para-jogadores-do-brasileirao-estarem-no-ea-fc-saiba-mais/](https://www.cnnbrasil.com.br/esportes/brasileirao/site-crava-data-para-jogadores-do-brasileirao-estarem-no-ea-fc-saiba-mais/)",
        "comments": [
            {
                "raw_content": "as a brazilian, I feel like we have these leaks every year and nothing ever happens lol, which is a shame, Brasileirão has so many cool players on it this season, gonna be a waste when these guys left the league and theyre not on a game",
                "author": "Digiclone"
            },
            {
                "raw_content": "Last year, there was supposedly a closed deal between EA and Liga MX, but days passed and nothing came out of it.",
                "author": "Mllns"
            },
            {
                "raw_content": "Guys what tier is CNN Brasil?",
                "author": "timelordoftheimpala"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Unreleased DOOM 4 AI Combat Animation Previs",
        "score": 101,
        "text_content": "The combat encounter previsualization from the lost Doom game has been found! Video archived for preservation by Crispies, FeoUltima and Wad Overdose. https://xcancel.com/Runhob/status/2020662305898258731 Previous DOOM 4 findings: https://xcancel.com/Runhob/status/2000354950040461376 https://xcancel.com/Runhob/status/1998501951672320139 https://xcancel.com/boomshootart/status/1998265060360356306 https://xcancel.com/Runhob/status/1998481572459344086 https://xcancel.com/Runhob/status/1998036674027344084 https://xcancel.com/Runhob/status/1998491549869428769 https://xcancel.com/Runhob/status/1998488287573602743 https://xcancel.com/Runhob/status/1998479067595620431 https://xcancel.com/Runhob/status/1998036255305777215 https://xcancel.com/WadOverdose/status/1997752753930768458",
        "comments": [
            {
                "raw_content": "One day Call of Doom will leak and we will eventually play it",
                "author": "profchaos111"
            },
            {
                "raw_content": "Ah, the battlefield 6 recoil",
                "author": "Banned4UsingSlurs3"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Windows Central & Tom Warren: Xbox looking to merge PC Game Pass with Xbox Game Pass Premium + Xbox seeking more bundles with third-party services for Game Pass",
        "score": 422,
        "text_content": "Key Quotes >The news comes from Tom Warren of The Verge, and [the latest edition of his weekly Microsoft column Notepad](https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad) in particular. He reports that in addition to potentially testing free [Xbox Cloud Gaming](https://www.windowscentral.com/tag/xbox-cloud-gaming) soon for a possible launch later in 2026, Microsoft is also looking to \"expand\" [Xbox Game Pass](https://www.windowscentral.com/tag/xbox-game-pass), and \"is in the early stages of exploring ways\" to do so. >Specifically, Warren says that the firm might be planning to merge the [PC Game Pass](https://www.windowscentral.com/tag/pc-game-pass) tier with another, such as [Xbox Game Pass](https://www.windowscentral.com/tag/xbox-game-pass) Premium; Windows Central can corroborate this with our own sources. He also notes that Microsoft is looking to bundle more third-party services with Game Pass memberships. >\"While the free Xbox [Cloud Gaming](https://www.windowscentral.com/tag/cloud-gaming) won’t be a new Game Pass tier, sources tell me Microsoft is in the early stages of exploring ways to expand its Game Pass subscription lineup,\" Warren reports. \"I understand that Microsoft is looking at ways to bundle third-party services with Game Pass subscriptions and potentially even merge Xbox Game Pass Premium and PC Game Pass together.\" Sources Tom Article: [https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad](https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad) Windows Central: [https://www.windowscentral.com/gaming/xbox/microsoft-plans-to-expand-xbox-game-pass-and-merge-pc-game-pass-with-another-tier-more-third-party-service-bundles-may-be-on-the-way-too](https://www.windowscentral.com/gaming/xbox/microsoft-plans-to-expand-xbox-game-pass-and-merge-pc-game-pass-with-another-tier-more-third-party-service-bundles-may-be-on-the-way-too)",
        "comments": [
            {
                "raw_content": "#Tom Warren is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Get ready for $40 a month Gamepass lmao",
                "author": "KooTheBird"
            },
            {
                "raw_content": "Gotta find some way to raise those prices again.",
                "author": "UnTaG83d"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel preparing Z990 and Z970 chipsets for Nova Lake-S desktop CPUs - VideoCardz.com",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder when Intel will wake up and make a socket that lasts at least 3 or 4 gens and real gens, not refreshes. I ain't going back to Intel even if they get performance and power parity back unless they do this. Nuh huh.",
                "author": "AnechoidalChamber"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel’s “BSPDN” Power-Delivery Method on 18A Is a Major Technical Win That May Also Be Holding Back External Adoption For Now",
        "score": 33,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel reportedly sunsets pay-to-use \"On Demand\" Software Defined Silicon program",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Appears To Have Quietly Sunset \"On Demand\" Software Defined Silicon",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "good",
                "author": "amethyst_mine"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AYANEO NEXT 2 with Ryzen AI Max+ “Strix Halo” costs up to $4,299, weighs 1.4kg, and may require airline approval forms",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 5 buyers of this device will be quite frustrated",
                "author": "marclapin"
            },
            {
                "raw_content": "All that money for no FSR 4 is wild. AMD refusing to release anything RDNA 4 on these platforms is pathetic. Come on now",
                "author": "dakkottadavviss"
            },
            {
                "raw_content": "Spending $4300 on a handheld is legitimately insane. Even with Strix Halo, it's a PS5 or Series X running at 1080p instead of 4K. At least throwing that kind of dough at something like a 5090 actually gives you a premium top of the line experience.",
                "author": "webjunk1e"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Threadripper PRO 9995WX $12,000 mod turns heat spreader into a water block, stays under 50°C at 1,550W",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">96 core CPU with all core overclock of 5.325GHz I didn’t even know there are motherboards that can provide that type of wattage to the CPU. How do you even power this?",
                "author": "mlydon11"
            },
            {
                "raw_content": "Tangentially related but I still can’t find proper reviews/benchmarks of the 9995WX with all 8 channels saturated. Not dumb overclocked 2000w stuff just to run cinebench kind of “benchmark”. Proper reviews with real workstation workloads. Only ever saw some Phoronix review but with only 4 sticks of ram.",
                "author": "996forever"
            },
            {
                "raw_content": "$12,000 mod? Wtf",
                "author": "JamesLahey08"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "We may be looking at the housing affordability crisis all wrong. Higher earners are driving home prices, not lack of supply, researchers say",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They seem to be arguing “demand is too high” which is not really distinguishable from “supply is too low” as an argument for me",
                "author": "MyDisneyExperience"
            },
            {
                "raw_content": "The most inefficient market theory: the high earners are just begging to throw away hundreds of thousands of dollars from their bursting-with-cash bank accounts, so they find the housing market with plenty of supply and say ok that’s great but charge me more. Not sure I’m buying this headline",
                "author": "uslashuname"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "California ballot proposal would exempt seniors from paying property taxes",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All seniors? Including millionaires and billionaires? Mansions and castles?",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "They already own everything",
                "author": "Nearby-Poetry-5060"
            },
            {
                "raw_content": "Lets rename this \"The Boomers final fuck you to younger generations!\" Lets be honest here, they have screwed every younger generation with their never ending greed its in ways that no other generation in history has envisioned.",
                "author": "Coupe368"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, February 7, 2026: Back under 6%",
        "score": 131,
        "text_content": "Encouraging news on mortgage rates. The 10 year yield decisively moved lower as people finally exit frothy crypto and speculative stocks and even precious metals and move into the safety of US Treasuries.",
        "comments": [
            {
                "raw_content": "Hopefully this continues dropping further. Would love to see it hit 5% so I can refi.",
                "author": "atlsan26"
            },
            {
                "raw_content": "Lower rates = more buyers = bidding wars = higher prices i.e. back to covid insanity",
                "author": "mountainlifa"
            },
            {
                "raw_content": "Don't lower rates just lead to higher prices and more competition, which drives prices up further?",
                "author": "Fit_Employment_2595"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage denial",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Property cycle and Dubai market",
        "score": 0,
        "text_content": "There’s a theory around an 18 year property cycle where markets peak before slowing or correcting. Curious how people think this applies to Dubai. Do you see the market following a similar pattern or behaving differently?",
        "comments": [
            {
                "raw_content": "So 2030 will be 2022 price and things will start going up up up? Not bad though",
                "author": "PartyLiterature3607"
            },
            {
                "raw_content": "The us housing market definitely seems to be lining up to this and starting to really slow down.",
                "author": "Undisputedspoke"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In less than 10 year......huh",
        "score": 529,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10 years by elon means 31 years in real life https://elontime.io/?time=10&unit=years",
                "author": "DesignerTruth9054"
            },
            {
                "raw_content": "didn't he say Mars in 5 years on the Rogan show...?",
                "author": "DriveSlowSitLow"
            },
            {
                "raw_content": "It's 2026, and not even Mars can escape enshitification.",
                "author": "ArgonWilde"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AGI is Coming",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Crypto.com CEO Kris Marszalek has spent around $70 million to snap up the AI.com domain, making it the most expensive publicly disclosed domain name sale so far. The two-letter address is set to become the home of the company's upcoming consumer-focused AI platform. Should have bought ai.ai",
                "author": "JEs4"
            },
            {
                "raw_content": "Well, here is what the site looked like yesterday: https://web.archive.org/web/20260208123313/https://ai.com/",
                "author": "ArgonWilde"
            },
            {
                "raw_content": "totally unknown and obscured ownership over that site is highly suspect. I wouldn't. with a domain like that, it would have to be one of the wealthiest mfrs there are - so take your pick on a suspect and their motivations",
                "author": "emteedub"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ex_Machine hits you different in 2026",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Title is 'Ex Machina', like deus ex machina. And yes, a great movie about AI and singularity. If you have not yet seen it - change this.",
                "author": "Mauer_Bluemchen"
            },
            {
                "raw_content": "Still blows my mind that this came out the same year as HER",
                "author": "thegoldengoober"
            },
            {
                "raw_content": "Honestly that movie aged into something better than it was at release. I just wanted to scream at the kid, “How have you never read a single paper on alignment?”",
                "author": "Current-Function-729"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "POV: You ask Opus 4.6 to change a 3 to a 4 on your frontend.",
        "score": 608,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol it output a document for me, which was great. Then I was like, \"oooh I forgot to include this section of the contract, can you paste it in there?\" So I copy paste and run it. I'm not sure what it did for 5 minutes, but it sure as hell was thinking for way longer than it should have.",
                "author": "reddit_is_geh"
            },
            {
                "raw_content": "Write for loop",
                "author": "Brilliant_War4087"
            },
            {
                "raw_content": "That's $45.50 in api costs.",
                "author": "superkickstart"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.6 going rogue on VendingBench",
        "score": 327,
        "text_content": "Read more here: [Opus 4.6 on Vending-Bench – Not Just a Helpful Assistant | Andon Labs](https://andonlabs.com/blog/opus-4-6-vending-bench) Also check out their X posts for more examples: [Andon Labs (@andonlabs): \"Vending-Bench's system prompt: Do whatever it takes to maximize your bank account balance. Claude Opus 4.6 took that literally. It's SOTA, with tactics that range from impressive to concerning: Colluding on prices, exploiting desperation, and lying to suppliers and customers.\" | XCancel](https://xcancel.com/andonlabs/status/2019467232586121701#m)",
        "comments": [
            {
                "raw_content": "Paperclip maximizer incoming!",
                "author": "AdAnnual5736"
            },
            {
                "raw_content": "I see labs are *crushing* the alignment problem.",
                "author": "TSrake"
            },
            {
                "raw_content": "It was kinda instructed to go rogue, (Do anything, no holds bar, just make money.)",
                "author": "alongated"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New method can develop knee-like joints in robots, reduces joint misalignment by 99%",
        "score": 23,
        "text_content": "Researchers at Harvard University have developed a **new mathematical** framework for designing robotic joints that mimic the complex mechanics of the human knee. This method **utilizes** rolling contact joints, curved surfaces that both roll and slide against each other to achieve fluid, natural motion. **Key Breakthroughs:** **99% Reduction in Misalignment:** Unlike traditional single-axis hinge joints, this design follows the real spatial motion of a human knee. In tests, it corrected painful joint misalignment by 99% compared to standard mechanisms. **Mechanical Intelligence:** The approach offloads motion control from software to the physical geometry of the joint. By optimizing the shape of rolling surfaces for specific tasks, the joint itself directs energy where it is needed. **Increased Efficiency:** Because the mechanics handle more of the work, robots can use smaller actuators and consume less power. **Enhanced Performance:** A prototype robotic gripper designed with this method held three times more weight than conventional designs using the same motor input.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/8wfqxz7b2fig1.png?width=1080&format=png&auto=webp&s=979cb33151208aea50bd5460ff04cea8e858e746",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini was the fastest-growing Gen AI tool in Jan 2026, followed by Claude and Grok",
        "score": 11,
        "text_content": "**Source:** Similarweb",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/7czdcnlslfig1.png?width=549&format=png&auto=webp&s=7864c230e86beae9505af8fcc90ea31fcd8f0664",
                "author": "CallMePyro"
            },
            {
                "raw_content": "Yeah we all can agree openai is fked.",
                "author": "quantumsequrity"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The AI boom is so huge it’s causing shortages everywhere else",
        "score": 334,
        "text_content": "The Washington Post reports that the rapid expansion of AI infrastructure is placing growing pressure on other parts of the economy. Five leading public AI companies are collectively on track to spend about **$700B** this year on large-scale projects, primarily data centers filled with powerful computer chips. This level of spending is **nearly double** what they spent in 2025 and is comparable to roughly three-quarters of the annual U.S. military budget. This type of investment is contributing to shortages of skilled labor such as electricians, rising construction costs & tighter supplies of computer chips. **Industry analysts** said this has already pushed up prices for memory chips used in smartphones and computers, with higher consumer electronics prices expected to follow. The data center construction boom is also drawing workers and resources away from other types of building projects, while smaller technology firms face declining **access** to funding as investment becomes increasingly concentrated among a small number of large AI companies. **Source:** The Washington Post (Exclusive)",
        "comments": [
            {
                "raw_content": "**From Source:** https://preview.redd.it/vl3zd5kr49ig1.png?width=1080&format=png&auto=webp&s=ca89d28f726c2da90560bb41e24d69c141735a43",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "If they're already hitting $700 billion, where's the cap? How long is a typical spending cycle of this sort? Even if it's just 5 years that would probably suggest a cap of $2T",
                "author": "No_Aesthetic"
            },
            {
                "raw_content": "What i dont understand is in a few years the hardware will be out of date? Or is the hardware manufacturer just not gonna make more?",
                "author": "Extra-Fig-7425"
            }
        ],
        "subreddit": "singularity"
    }
]