[
    {
        "post_name": "Texas House Democrats have officially FLED THE STATE! @KenPaxtonTX, let the manhunt begin. They can run, but they can’t HIDE!",
        "score": 315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Faggot.",
                "author": "MrTexan"
            },
            {
                "raw_content": "So if any employees at a private company do this, they get fired on the spot and possibly even charged. Government officials should not get a pass, but since they apparently can’t get fired, the state needs to freeze their assets and put liens on their properties and assets.",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "If we see even one arrest, I will be shocked to my core",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chuck Schumer received thousands in campaign donations from Jeffery Epstein.",
        "score": 331,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link https://x.com/IanJaeger29/status/1952099870291984871 Sauce https://theamericantribune.com/resurfaced-report-reveals-chuck-schumer-received-signifanct-donations-from-jeffrey-epstein/",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Schumer claims he donated the money, or an equal value, to violence against women groups. Who knows if that's true or not.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Well, he's married to a dude, so...",
                "author": "Melchizedek18"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: I want to get the drug prices down by 1,000%, 1,200%. You know what I mean by that.. We'll have drug prices coming down by 500, 600, 800, even 1,200%.",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not if a district court judge has anything to say about it",
                "author": "awsure"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Why does everyone in this country need so many fucking drugs?",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oh now they have a problem do they with redistricting?",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have you seen the illinois congressional map? Everything is basically snaked out to make sure it can be a democrat seat. Probably the most insane districting in the country",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Illinois is a complete Dem fucktard land of pure evil.",
                "author": "goodguy"
            },
            {
                "raw_content": "### BILL CLINTON IS A RAPIST!!!",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "EXCLUSIVE: After 8 Years of Hiding Documents – Deep State DOJ Asks to Move Seth Rich Case to “The Dirtiest Federal Courthouse in America” – DC",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sometimes I feel like the Trump administration doesn't find out about retardedly corrupt shit until it's pinned here at PDW",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "President Trump, please get a grasp of your departments; America depends on you.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Rich is the JD Tippitt of the RussiaGate Conspiracy.",
                "author": "LeeHarvey"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: DOZENS of Texas Democrat lawmakers will now FLEE THE STATE to avoid allowing Republicans in the legislature to pass the map, which adds 5 GOP House seats, per POLITICO. They want to break quorum. AG KEN PAXTON has stated plainly: if they do this, they may be arrested. FAFO TIME.",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like I've seen this before. Edit: Yep, [in 2021 Texas Democrats fled the State to avoid passing legislation to revamp voting laws.](https://www.texastribune.org/2021/07/12/texas-democrats-voting-bill-quorum/) Too bad for them. No more Census skewing for Democrats.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Arrest their asses. Bring them back into the congress. Quorum achieved.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "All these threats of arrests and zero arrests made or will be made. Tiresome",
                "author": "For_All_Mankind"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America First",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Including outsourced staff to India, etc.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "For every foreign employee, you get taxed 100%.",
                "author": "systemic_threat"
            },
            {
                "raw_content": "Can't wait to for a judge to admit the idea is racist because we don't hire whites from outside the US.",
                "author": "GoUSA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steven Miller informs Maria Bartiromo that the Statute of Limitations HAS NOT been reached on the Trump-Russia conspirators 💥 Prosecute!",
        "score": 803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He also said he trusts that the DOJ will prosecute these bad actors. Sigh.....",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Doesn't seem to be any indication they're going to let the bad guys skate especially when Tulsi Gabbard passed information on to the DOJ for possible criminal prosecutions. Don't know what the outcome's going to be, when all is said and done, but indictments are likely. Miller's making it clear the bad actors aren't safe.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Oh yeah Sham Blondie will get right on that!",
                "author": "Ricky_CIA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FDA Commissioner Makary says they are getting away from the thiefdom culture of the FDA (and says NIH paid for virus that killed 20 million people)",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice to hear the truth from someone in government",
                "author": "MJ_43"
            },
            {
                "raw_content": "The frankenvirus probably didn’t kill anyone on its own, but NIH easily killed 20M under that guise.",
                "author": "Skogin"
            },
            {
                "raw_content": "So can all the countries of the world now sue the US government?",
                "author": "Weeha"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I want arrest not DOJ people making promises on FOX NEWS!!",
        "score": 1340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BOTH SIDES keep playing these games like their performative art on legacy media is fooling anyone except brainwashed woman and old farts.",
                "author": "YouAreIgnorant"
            },
            {
                "raw_content": "Not just arrests, but the correct charges as well. Some of those are up for a death sentence. Treason on some of those, and crimes against humanity.",
                "author": "Fresnor"
            },
            {
                "raw_content": "By August 1st 2021 Biden had arrested over 550 people possibly as many as 600 for the crime of free speech. Odd that we can’t charge a fucking soul for treason.",
                "author": "HawkDriverMN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👻",
        "score": 1077,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Whitey Bulger has entered the chat* 💀",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "I am looking forward to learning why this child sex trafficker got transferred to a more comfortable prison.",
                "author": "JBlaze056"
            },
            {
                "raw_content": "She's about to go into the same witness protection that Epstein is in.",
                "author": "HumanSomewhere"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Economy is BOOMING 🇺🇸💪",
        "score": 654,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't feel shit. Rent is too damn high. Cant afford a home. Groceries are still expensive. I still see shrinkflation. Can't eat out at restaurants without complaining about prices and tips. Tolls and tickets for metros/buses/trains are through the roof. Etc...",
                "author": "alcowiggles"
            },
            {
                "raw_content": "Uh I don’t think so. I don’t feel like my financial situation is “booming”",
                "author": "Train_w_no_brakes"
            },
            {
                "raw_content": "I'm tired of my money being taxed multiple times. We used to shoot people for 1%.",
                "author": "MAGA_VANGUARD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "England, WTF??!!!!",
        "score": 631,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don’t suck too hard she might blow up",
                "author": "Leucophylla12"
            },
            {
                "raw_content": "You'll fucking scare the poor baby! What the hell is going on around here? I feel like I am being messed with every single day. Each new day brings another fresh hell.",
                "author": "mlp67"
            },
            {
                "raw_content": "They likely deleted it because of the Muslims complaining >I’m against this post but not for the same reasons as all the EDL folk in the comments >I’m against it because >1) It’s a disrespectful photo to post. Breastfeeding isn’t something to plaster on social media, whether in a niqab or a bikini. >2) why would a woman agree to having a photo taken like this? Let alone posted on social media? “But we don’t know her identity”, doesn’t matter, it’s not the way our women should be portrayed on social media especially with the hate they’re already facing from anti-Muslim thugs >3) where is the husband? Did he allow this? >4) why do these organisations INSIST on using Muslims, specifically our women, to tick their stupid diversity quotas. leave our women out of your virtue signalling https://x.com/xavierjp__/status/1951389764168589700",
                "author": "DingleberryMutt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tarrif revenue under Trump 💰",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's beautiful. Eventually, this should promote American manufacturers and jobs, and reduce our federal taxes. Should.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Excited to see August's #'s",
                "author": "Scumbag-reddit"
            },
            {
                "raw_content": "Wen income tax cuts",
                "author": "MikeyisNinja"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "With Republicans like this, who needs Democrats",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was assured that we had the votes to get all 160+ confirmed this weekend. Oh well guess not.",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "They all think of themselves as royalty and they act like it. We let them get away with way too much.",
                "author": "Dev404"
            },
            {
                "raw_content": "Thune so gay",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois Governor Pritzker brokers deal with Texas democrats to block Texas' congressional redistricting — NBC",
        "score": 393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send in US Marshalls, governor attempts to impede them he can be charged with obstructing a federal agent... :D",
                "author": "thebeercules"
            },
            {
                "raw_content": "I don't even know how a governor from a different state can do this, but I don't put anything past Lardass Pritzker.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "https://www.nbcnews.com/politics/elections/texas-democrats-head-illinois-deny-republicans-quorum-redistricting-rcna222743 (ChatGPT summarized) > The Texas House requires 100 of 150 members (two‑thirds) present to conduct business. With 62 Democrats, the absence of 51 members prevents the vote from proceeding. > Absent lawmakers face fines of $500 per day, cannot use campaign funds to pay them, and may be subject to legal threats—but cannot currently be jailed if they remain out of state. > Illinois Governor J.B. Pritzker, a vocal Trump critic and potential 2028 candidate, coordinated with Texas Democrats in advance and is offering support as they remain out of state.",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Art of the deal 🇺🇸🦅",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pay down the debt and smash down the entitlement state.",
                "author": "Roadpower"
            },
            {
                "raw_content": "Congress is rubbing their hands together to spend it.",
                "author": "airborne3502"
            },
            {
                "raw_content": "This train No breaks",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden people ready to release stories of how stupid Kamala is if she talks about how stupid Biden is",
        "score": 680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love a good 'tard tussle",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "nobody cares MAGA III",
                "author": "YodaBannon"
            },
            {
                "raw_content": "She's so dumb they felt the need to tell her this.",
                "author": "trumptasticly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "154,000 Federal Workers Are Being Paid To Stay Home Under Deferred Resignation Plan",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this news? This was very publicly broadcasted in the early days of Trump 2.0. Remember the fork in the road? Besides, they're going to be unemployed and have no income in less than two months.",
                "author": "McFatty7"
            },
            {
                "raw_content": "This is fine. It was always part of the deal to give them time to transition to a new career. We taxpayers will save a fortune in the long run.",
                "author": "FinishTheBorderWall"
            },
            {
                "raw_content": "What? Under BIDEN'S deferred resignation program? First I heard of it was Trump's plan to downsize.",
                "author": "magabzdy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump Economy",
        "score": 848,
        "text_content": "",
        "comments": [
            {
                "raw_content": "my paystub would like a word",
                "author": "depLORIb1e"
            },
            {
                "raw_content": "The job market still feels kinda meh. The Fed needs to cut rates, and Trump needs to deport the H1bs",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "You guys are getting bigger paychecks and paying lower taxes already?",
                "author": "Hikedelics"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ryzen 7 9800X3D left Core i9-14900K in the dust in Battlefield 6 early streamer tests — both systems included an RTX 5080, but the 3D V-Cache system was roughly 30% faster",
        "score": 481,
        "text_content": "Battlefield 6 reportedly has impressive performance on both PC and console. The studio is targetting 60 FPS on PS5 and Xbox Series X|S by default while PC gets to enjoy an uncapped frame rate. New reports even suggest 300+ FPS at 1440p, on a 9800X3D paired with an RTX 5080, without upscaling.",
        "comments": [
            {
                "raw_content": "I can't wait to see how my 5800x3d will perform",
                "author": "axaro1"
            },
            {
                "raw_content": "Is not the 285 or whatever it's called the current generation?",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "The article says it's unknown if they were using DLSS or not.",
                "author": "asdf12311"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DeepCool Assassin VC Elite Review: The best cooler you can’t buy in the USA",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Predictably, given the price tag and the last model, a dominating design. I suspect VC 'cold plates' will be a feature that proliferates not so far off - for example, given CR's VC low profile cooler I suspect at least one successor to the Gladius will sport one.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "Hello Jeep-Eep! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Title # DeepCool Assassin VC Elite Review: The best cooler you can’t buy in the USA >Cons: Not available for purchase in the US- LOL",
                "author": "pwreit2022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Electronics boosts foundry utilization with increased production orders",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it's wild that 4nm is considered legacy!",
                "author": "fuji_T"
            },
            {
                "raw_content": "> According to the industry on the 1st, the operating rate of the production lines P2 and P3 at Samsung's Pyeongtaek campus, which was below 50% last year, has reportedly reached its highest level recently. These production lines are responsible for **legacy processes including 4nm (nanometer, one billionth of a meter), 5nm, and 7nm.** The legacy production line at Samsung Electronics' Giheung campus is also said to be **rapidly recovering** as the mass production volume for the 8nm process increases. > Recently, it has been classified from the **4nm process as a legacy process**. Hard to believe that 4nm is legacy I wonder who or what is buying alot of 8nm capacity? Obviously could be anything with money and the need (vs 28mm or even 10nm)",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "*[Intel enters the chat...](https://gifdb.com/images/high/present-mr-bean-i-m-here-4sc51fmfc8siftg0.gif)*",
                "author": "BigBananaBerries"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "my batshit crazy theory on what happened with the rtx 5000 series.",
        "score": 0,
        "text_content": "The GDDR7 3 GB modules got delayed/supply wasn't as good as expected. That's why there were leaked 24 GB 5080 boxes; that's why the lower-end cards only have a 128-bit bus; they were supposed to get 12 GB (probably not the 5050 but the 5060 definitely). This way, they would be able to have a 32 GB 5090, a 24 GB 5080, a 16 GB 5070 Ti, an 18 GB 5070, a 16 GB 5060 Ti, a 12 GB 5060, and then an 8 GB 5050. And then, something happened delaying the 3 GB GDDR7 modules, which is why the only Blackwell products that have them are the crazy RTX Pro 6000 and the laptop 5090. (or there is enough supply and NVIDIA just decided to put it all in AI GPUs) Just my theory, though. I don't have other evidence besides the fact that 3 GB GDDR7 was hyped up, and yet it hasn't found its way into that many products",
        "comments": [
            {
                "raw_content": "What happened was \"can we shortchange people so bad one more generation, or will we push their anger TOO far to the point we risk that they stop buying our products or just stick to the GPU they already have?\". They saw what's around, compiled online sentiments like \"Nvidia can milk us all the way and we'll buy their GPUs anyways\", and decided to save that buck for now, and made the originally considered higher-VRAM cards \"Supers\" to hold up their sleeve in case people got too upset.",
                "author": "PastaPandaSimon"
            },
            {
                "raw_content": "It is 95% artificial market segmentation from Nvidia. Giving consumers cheap VRAM cuts into their server and workstation profit margins. For example, they could increase bus width on the 5050, 5060, and 5060 Ti to accommodate 1 extra GDDR7 chip and make them 10GB each. There is also enough PCB room to keep a 128 bit bus but run two chips per channel.",
                "author": "DZCreeper"
            },
            {
                "raw_content": "Since we are just wild guessing: nvidia has been developing some AI based algorithm that significantly reduces vram usage so they didnt increase vram for 50 series. But the development of the said algorithm took longer than planned and it missed deadline, or didn't work out as well as expected.",
                "author": "1mVeryH4ppy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New American Nintendo prices are here :(",
        "score": 734,
        "text_content": "Switch 2 consoles, games, and GameCube NSO Controller seem to be unaffected (supposedly joy con 2s are getting a price hike from a target listing) But yeah this sucks, try and get these now before other retailers update their prices",
        "comments": [
            {
                "raw_content": "There is no way anyone pays for an oled switch than the extra $50 to 100 for switch 2. Might as well discontinued it. But apple makes money on ladder pricing between models.",
                "author": "EitherRecognition242"
            },
            {
                "raw_content": "And worst of all the alarm clock is getting a price hike :(",
                "author": "awsmrabbit21"
            },
            {
                "raw_content": "Any of the remaining guilt I had for buying the $200 clearance OLED bundle from Costco has dissipated.",
                "author": "RandomJamSesh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wow. Adventures of Elliot became my most anticipated game of 2026 within 2 hours. Here’s why…",
        "score": 157,
        "text_content": "The game looks gorgeous. Music is great. Really tight controls. Great game mechanics with the two types of fairy interaction (really unique), the combos, surprising enemies giving more damage, using fairy to appear behind, enemy variety, the Magicites (or whatever they’re called to allow you to create a buff to your liking), the guarding and parrying. All fun and varied. You can change the speed of the dialogue in the settings which often annoys me with RPGs. When I died on the boss, it allows you to spend money to come back to life so good variable difficulty mechanic for players. Good “platforming” and puzzles. It seems they’ve really thought of everything. I’ve always wanted to get into an action RPG but find them hard to and the old Zelda games don’t have nostalgia for me, so I often find their “old school” ways a little tedious. This being a modern game seems to have none of that and I’m super pumped for it. Definitely give it a go if you’re on the fence. I was enjoying it once I started fighting the enemies. What would people’s critical feedback be for it so far? My only big one is I wish I could have access to the bomb and arrow at the same time but maybe there’s a reason. Also I seems you have to press two buttons to get out of the map. Can’t wait for this one!",
        "comments": [
            {
                "raw_content": "I put about 45 minutes into the demo this morning and really, really enjoyed it. It felt like an improved Secret of Mana with a dash of Links Awakening. I’m sad I probably only have an hour left on the demo as now I really want the whole game. Instantly buying it when it comes out",
                "author": "Available-Low-2428"
            },
            {
                "raw_content": "Agreed, maybe not my MOST anticipated of 2026, but this game surprised me with how damn good it felt. Gave me hella nostalgia for secret of mana and old school Zelda. Playing the demo made me change my stance from “eh” to “day 1 pickup”",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "100% agreed. Demo was amazing",
                "author": "Hotelier101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Bananza is definitely game of the Year for me",
        "score": 439,
        "text_content": "Absolutely Game of the Year content for me after more than 65 hours. I didn’t expect so much fun and such a great game. Truly amazing. Every Switch2 owners should experience this",
        "comments": [
            {
                "raw_content": "There’s a thousand fucking bananas in this game? I’ve only found like 160 so far. Nice to know I have so much farther to go.",
                "author": "TheBobbyDudeGuy"
            },
            {
                "raw_content": "Masterpiece of a game.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "How’d you get the exact time played in final image?",
                "author": "wookiewin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For anyone wondering about using a matte/anti-glare screen protector, I wouldn’t recommend it.",
        "score": 105,
        "text_content": "Ending up being far too fuzzy/foggy looking. Also really seems to affect the brightness and colors too much at least on this screen. I’ve use a matte screen protector on something like the Steam Deck OLED and maybe because of the vibrancy of the OLED, it was just a better experience. But using it on my Switch 2, I just wouldn’t recommend it. Going back to my JSAUX clear screen protector, looks a million times better.",
        "comments": [
            {
                "raw_content": "It's meant for when you're in sunlight or outside. It's not going to look the best regardless, but I rather be able to see the screen in those scenerios than cranking up the brightness.",
                "author": "Middle-Tap6088"
            },
            {
                "raw_content": "Personally for me it’s the opposite. I love the matte look on my Switch 2.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "Maybe it's just the one you bought? I also bought a use an anti glare screen protector but mine isn't nearly as matte looking and it doesn't mute the colours at all",
                "author": "Chewbacca319"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shinobi needs a native Switch 2 edition",
        "score": 74,
        "text_content": "Just played the demo, wow, so fun. But boy does it look poor on Switch 2 both handheld and docked. I’m gutted. It does run at 60 fps, unlike Ninja Gaiden, but the resolution of the characters is pretty poor, it’s such a shame. The art style is a massive appeal to me and it’s getting crucified on S2. It probably holds up better on a Switch OG or Lite, but I can’t deal with how it looks on S2. I wish I could look past it as everything else is brilliant, but I can’t. I loaded up Streets of Rage 4 on my S2 and it looks great, so I don’t know why this looks so rough. Praying Lizard Cube have a S2 update pending…",
        "comments": [
            {
                "raw_content": "Lots of games need Switch 2 editions tbh",
                "author": "Abakus_Grim"
            },
            {
                "raw_content": "Yeah, unfortunately. I was just playing the demo and I was like, “Wow, I bet this game looks great on other platforms.”",
                "author": "Royal_Stress5984"
            },
            {
                "raw_content": "I really really liked this demo, gameplay is super fun, but as soon as I undocked and tried some handheld play it was a complete bummer. I even download it again on my OLED to see if it gets better but I want to play it on my new switch 2 you know... Since there is a little time for release my only hope is that it gets a SW2 version or at least a resolution fix.",
                "author": "yripdo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Powerbanks",
        "score": 13,
        "text_content": "Apologies if this has been discussed before but I've not seen anything - what would people recommend in a power bank that can power and charge a Switch 2 at the same time? I'd want it to at least hold its percentage, if not charge it properly whilst playing. I've seen an Anker one that looks decent with a 30w output but I'm not sure if that's enough?",
        "comments": [
            {
                "raw_content": "I use an Anker Prime 27650. Seems to last forever.",
                "author": "fartensteinthethird"
            },
            {
                "raw_content": "30W is more than enough. I measured it, and the Switch 2 charges at 10 to 12 W when you’re not playing. If you’re playing in handheld mode while charging, the charging increases to 20 W.",
                "author": "jcik68"
            },
            {
                "raw_content": "30W is more than capable",
                "author": "BackIn_Five"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "IGN leaks in video description that Dr Strange is a new character in Marvel Tokon",
        "score": 129,
        "text_content": "IGN video description \"Don't miss the PS5 Closed Beta Announcement Trailer for Marvel Tokon: Fighting Souls, an upcoming action fighting game developed by ARC System Works. Players can take a dip into the wider Marvel Universe to duke it out in intense fighting battles with Marvel's biggest heroes including Spider-Man, Iron Man, Doctor Strange, Storm, Dr. Doom, and more, in an upcoming closed beta for the game. The closed beta will be fitted with 6 playable characters, online matches, spectator mode, training tutorial, and more. Marvel Tokon: Fighting Souls is coming soon to PlayStation 5 (PS5) and PC with a closed beta running from September 5 through September 7 exclusively on PlayStation 5 (PS5).\" Source: https://youtu.be/QdLUgYZi2Ck?si=h14itfDtIfTr1dlU UPDATE: IGN has removed Dr. Strange from the description now.",
        "comments": [
            {
                "raw_content": "This really feels like it's just a goof from IGN. The trailer specifically calls out all of the characters that will be playable and the Evo announcements are over.",
                "author": "OrangeLightning7895"
            },
            {
                "raw_content": "Definitely a goof on IGN's part The actual trailer details that the same six characters from the EVO show floor build are in the beta and nobody else. Still hiding Spidey and Robbie for some reason lol But Strange seems like a lock for the game anyway. I'd be shocked if he doesn't make it in",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Honestly the description seems AI written if you look at it, having a description of the reveal trailer while also talking about the beta description",
                "author": "TypicalOceans"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KeplerL2: Xbox X|S hardware has sold less than 30 million units + explanantion on why. Also current PS5 & Xbox Profitability",
        "score": 400,
        "text_content": "Grain of salt for all this, of course, and the claims below. Kepler has (based on previous rumours) inside information at AMD, and when checking for any info, I saw this posted. For context, this is from a thread estimating 37 million might have been sold and why it is less than 30 million. Kepler discusses PS5 and Xbox profitiability as well. >\"They aren't even at 30M\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270676156](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270676156) >\"You don't need 3rd party trackers, you can use AMD's number and Sony's number to figure out Xbox sales.\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677158](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677158) >\"Steam Deck is part of SCBU and counted as a console.\" Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677367](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677367) >Van Gogh and all of its variants were developed by SCBU (Semi-Custom Business Unit) and fall under the same reporting as the consoles. Z1/Z2 are repurposed laptop chips (Rembrandt/Phoenix/Strix) and fall under Client segment. Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270680523](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270680523) >Also important to note that AMD's number is higher than what Sony/Xbox would count as unit sales, since it includes chips sold but still in-flight (i.e being assembled somewhere). >So Q3 <100 million consoles units with \\~66 million PS5 and \\~4 million Steam Deck would put Xbox at a maximum of 29 million. >Q4 >100 million consoles units with \\~75 million PS5 and \\~4 million Steam Deck means Xbox sold a minimum of 21 million units. >So Xbox sales for this gen range from a minimum of 21 million + Q1/Q2 2025 unit sales to a maximum of 29 million + Q4 2024 + Q1/Q2 2025. Source: [https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677345](https://www.neogaf.com/threads/xbox-series-x-s-estimated-to-have-sold-37-million-units.1686826/post-270677345) **If profit is made on Xbox and PS5** >\"PS5 had a brief period of being even/profitable but then component prices went up (N7 wafers, GDDR6 and a few others) and went right back to losing money.\" >\"AFAIK regular PS5 is still sold at a minor loss, only the PS5 Pro is profitable.\" >\"They did a die shrink for the Series X and raised prices, should be profitable now.\"",
        "comments": [
            {
                "raw_content": "Serious question: how on Earth are Microsoft even going to sell a next gen Xbox? Or do they just really not care about that anymore?",
                "author": "NinBendo1"
            },
            {
                "raw_content": "I’m absolutely certain this’ll be the last generation where consoles are sold at a loss. With prices everywhere ballooning in multiple components (hardware, game making, advertising etc.) it just isn’t sustainable to sell consoles at a loss when the console space isn’t growing. I think the PS5 Pro was a reality check for what to expect in the future price-wise for PS and potential Xbox hardware. I’d be shocked if either of those hardware pieces were under $700",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Sad when you consider that the Serie X is an excellent console and that the One, which really sucked, sold 60 million units.",
                "author": "LionAlhazred"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Street Fighter 6 C. Viper Teaser leaked ahead of EVO reveal",
        "score": 147,
        "text_content": "https://youtu.be/_1va_LZuVsw?si=nH9KRGAv6GbRyeNJ Directly from the PlayStation YouTube channel. May have been a mistake on their end. EDIT: Video is privated, that pretty much claims it’s legit.",
        "comments": [
            {
                "raw_content": "Is it just me or does this keep happening with Street Fighter 6 specifically? Cos I swear I've seen this exact situation happen at every EVO since SF6's release.",
                "author": "Widower800"
            },
            {
                "raw_content": "PlayStation Studios was also teasing something Marvel Tokon related on twitter for Evo I think",
                "author": "brolt0001"
            },
            {
                "raw_content": "What tier is PlayStation? Also didn't this exact thing happen last year with Terry too?",
                "author": "OrangeLightning7895"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "An advert for Kirby and the Forgotten Land: Star-Crossed Worlds DLC seemingly shows new mouthful mode abilities",
        "score": 67,
        "text_content": "https://xcancel.com/swag_k1rby/status/1952088418017829155?s=46 Appears to be a gear, and 2 other new abilities **EDIT:** Sorry, for some reason the tweet isn’t showing up on xcancel. Here’s a post on Imgur instead: https://imgur.com/a/HyozYFc",
        "comments": [
            {
                "raw_content": "I imagine we’ll get previews or a big trailer for this soon. I’m interested in seeing more. At $20 to upgrade I would hope for more than a 1-2 hour DLC. Do we even know if the rest of the game is upgraded?",
                "author": "Cubs017"
            },
            {
                "raw_content": "“Tweet not found” ![gif](giphy|yx400dIdkwWdsCgWYp)",
                "author": "Accomplished-Pie8823"
            },
            {
                "raw_content": "![gif](giphy|NOalcASHiOGvC) real",
                "author": "Arcade_Theatre"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Games that Sony are bringing to Xbox are unannounced (not Helldivers 2 or Marathon), still has no specifics as to which games",
        "score": 481,
        "text_content": "From today: https://imgur.com/a/k3gkzfy https://xcancel.com/NateTheHate2/status/1951696377827778959#m",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I've been wrong countless times when I say \"Nah, there's no way Sony/Microsoft would port X franchise, that's too important\" so god knows what they would do.",
                "author": "ToothlessFTW"
            },
            {
                "raw_content": "CONCORD… 2! ![gif](giphy|wf510uTbXPUHQ1JxM2)",
                "author": "EarthwormJoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Core 5 120 CPUs for LGA-1700 socket listed starting from $216",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the stupidest decision I've ever seen by Intel. Why not flog these off as i5 12405 units? They did that with the i3 10105.",
                "author": "alvarkresh"
            },
            {
                "raw_content": "Might as well get the 14400 for $150 then.",
                "author": "funny_lyfe"
            },
            {
                "raw_content": "Who is this product for?",
                "author": "Rollingplasma4"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Not even a 0% mortgage rate would make buying a house affordable in these 6 U.S. cities",
        "score": 361,
        "text_content": "[https://archive.ph/XI0yv](https://archive.ph/XI0yv) According to Zillow, these six cities remain unaffordable due to extreme home prices: 1. **New York** 2. **Los Angeles** 3. **Miami** 4. **San Francisco** 5. **San Diego** 6. **San Jose** * In these areas, the **price tag itself** is the main barrier—not the monthly mortgage payment.",
        "comments": [
            {
                "raw_content": "Not gonna lie, I am 46 years old and moved to New York in 2002. Ex-Miami, I would say this has been consistently the story for these cities my entire adult working life. If it hasnt changed in at least 23 years, I have a feeling it never will unless housing prices are, um, not relevant to the average person’s American life. Talking major major upheaval, like fall of the Roman Empire. Some things just are built to last, and I would say inflated house values in these cities are 6 of them.",
                "author": "nypr13"
            },
            {
                "raw_content": "People who complain about interest rates willfully ignore that home prices jumped at least 30% in three years.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "I don’t think people realize that a drop of even a percent in mortgage rates will just cause prices to rise again. There’s a reason prices have not dropped significantly as we’ve raised rates. We only slowed the drastic upward shift. Returning to the rates that caused that price increase isn’t going to make things more affordable, it will make it worse and will only screw us even more. It’s a supply issue people. You don’t fix a supply issue by fueling more demand.",
                "author": "Playingwithmyrod"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homes are going back on the market in droves",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe the \"Waive the inspection\" trend is out of style now. 🤔",
                "author": "rentvent"
            },
            {
                "raw_content": "Here in Central New Jersey, I'm actually noticing an uptick in homes hitting the market. My guess is the property taxes, cost-of-living, and obviously job losses that are finally breaking people. Are they listing for shenanigan prices? Of course, but for the home seller trying not to become a bagholder, it doesn't hurt to at least try.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Return to the norm. Will look very clear in retrospect when housing was more unaffordable than ever. Job losses and economic pressure will force many hands. That check on market pricing will drive movement to the norm",
                "author": "Imaginary-External-1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 5 cities where home prices are dropping fast as the housing freeze causes inventory to pile up",
        "score": 38,
        "text_content": "[https://archive.ph/5tb3c](https://archive.ph/5tb3c) According to Redfin data from the four weeks leading up to July 27, 2025: |City|Median Sale Price (June 2025)|YoY % Drop| |:-|:-|:-| |**Oakland, CA**|$850,000|\\-6.8%| |**West Palm Beach, FL**|$425,000|\\-4.9%| |**Jacksonville, FL**|$300,990|\\-3.1%| |**Austin, TX**|$556,340|\\-2.9%| |**Houston, TX**|$369,000|\\-2.8%| # 🗣️ Expert Insight * Redfin agent James Gulden noted that sellers must accept: 1. Homes will take longer to sell. 2. Buyers now have more negotiating power.",
        "comments": [
            {
                "raw_content": "As Silicon Valley is replaced by AI, there will be a long rolling downturn in home prices across the bay area",
                "author": "GuerrillaSapien"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "World’s first AI real estate agent has already made $100M in sales",
        "score": 107,
        "text_content": "https://www.housingwire.com/articles/worlds-first-ai-real-estate-agent-has-already-made-100m-in-sales/",
        "comments": [
            {
                "raw_content": "Does an AI agent also demand 5% commission?",
                "author": "AlSwearenagain"
            },
            {
                "raw_content": "\"When customers engage with the AI agent, they provide basic details such as location preferences, budget, and the number of bedrooms. From there, the AI can filter listings and conduct virtual tours, offering detailed descriptions of available properties.\" So its just Zillow but worse? How does this make any money? Also its $100 million in Brazil money, that ends up being only $18,043,500 USD.",
                "author": "OBLIVIATER"
            },
            {
                "raw_content": "While it’s heartbreaking that AI may take jobs, it cannot consume RE agents soon enough. Absolute grift of a profession.",
                "author": "allinadaze"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Instantly Drop to 4 Month Lows After Jobs Report",
        "score": 295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "30 yr fixed rates have now nearly fallen to match year-to-date lows. Lowest was the tariff shocks of April when they briefly dropped to 6.60% -- today at 6.63% and the 15 yr is 5.95% https://www.mortgagenewsdaily.com/mortgage-rates",
                "author": "SnortingElk"
            },
            {
                "raw_content": "So I know the OP here is always touting that the real estate market will never lower (despite houses sitting and prices dropping in some markets.). Just a few weeks ago, you were posting about the \"strong\" job numbers that got massively revised and caused mortgage rates to tank. Do you not see the cognitive dissonance? Many people were telling you the economy is in a bad spot and the job numbers were trash. This is just proof that the market is shaky, not that real estate will continue to appreciate imo. The data is bad and probably going to get worse as the courts allow federal job and funding cuts to take effect and the tariff pain actually starts to work its way through the system. Link to the original post: https://www.reddit.com/r/REBubble/s/AIAt4rY0Pk",
                "author": "Personal_Analyst3947"
            },
            {
                "raw_content": "One would expect that THIS massive drop in rates would NOT bring buyers off the sidelines, considering the conditions under which the rate drop occurred: job insecurity. Watch. Coming week, when reported a month or two from now, will show tremendous refi and mortgage app activity. Just unreal FOMO.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "‘House Rich, Cash Poor’ Was Just a Saying—Until We Bought an Apartment",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/za2jd",
                "author": "SnortingElk"
            },
            {
                "raw_content": "in case it wasnt obvious from the title this is NYC… where the majority of apartment ownership, you’re buying a share of ownership in a co-op; this isn’t like a ‘condo’ anywhere else where you actually own a piece of real estate. also, NYC is different from almost anywhere else in the country in that buying vs renting an apartment (or call it a ‘condo’ anywhere else) has a very low price-to-rent ratio still. nearly *everywhere* else in America right now, buying a condo is far more expensive than equivalent rent, *plus* there’s a huge risk factor. NYC’s RE market is interesting but different from anywhere else in America. > I’ve also reminded myself many times that the money we used for the down payment isn’t “gone.” We’ve just invested it in a different way. Unlike dropping money on a designer ensemble or new car, an apartment is an appreciating asset—at least usually. The one-bedroom unit we are purchasing has gone up 20% in value in the five years since it was last on the market. this is actually probably going to ultimately be somewhat true. NYC apartments aren’t that ‘bubbly’. unlike say, the condos in the city. apartments didn’t crash that hard in 08 and they’re not going to this time. the price-to-rent ratio is low already. but the problem i have with this article, is people (morons) will read this, not examine it thoughtfully, and take away the wrong ideas. it’s not normal, a rite of passage, or a good idea to buy a condo in Denver, for example, with a PTR ratio of like, 25%. you are going to lose all your downpayment money and be underwater for a decade+. you are going to be financially (and physically) trapped. the stress is going to be immense. you’ll have signed-on to throw away years of your life, and it was painfully clearly avoidable. (rent vs buy calculations … well, they *were* common knowledge for the one thing to evaluate before making a home purchase.) you only get a few decades of life, if you’re lucky. overburdening 5-10yrs of one’s short existence because of FOMO and not doing maybe an hour of research is really sad, but an idiot is born every minute.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "12 states are back above pre-pandemic housing inventory levels",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At the end of July 2025, 12 states were above pre-pandemic 2019 active inventory levels: * Arizona * Colorado * Florida * Idaho * Hawaii * Nebraska * Oklahoma * Oregon * Tennessee * Texas * Utah * Washington",
                "author": "SnortingElk"
            },
            {
                "raw_content": "For fun I decided to take some of those +25% inventory states and check the 5-year prices They basically are all, on average, sitting at Q1 2023 prices, with prices only starting to decline **THIS YEAR**. So I'm not expecting a bubble pop, but I am hoping for a pricing correction (as someone who can afford at today's prices but refuses to participate)",
                "author": "sturdy-guacamole"
            },
            {
                "raw_content": "Man what the fuck is wrong with the Northeast. In 50 years it will only be elderly people living here.",
                "author": "Few-Lawyer3707"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sama teases GPT 5",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "K but pantheon is actually a really great show tho.",
                "author": "adj_noun_digit"
            },
            {
                "raw_content": "https://preview.redd.it/v3beplunkugf1.png?width=225&format=png&auto=webp&s=70f5fe91f077b6bdb18531a00a354516af513d68",
                "author": "MohMayaTyagi"
            },
            {
                "raw_content": "WATCH PANTHEON",
                "author": "Jamjam4826"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "No fate but what we make",
        "score": 280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It says in wikipedia terminator is send from. 2029 so maybe just maybe we will have some good comercial robots by then",
                "author": "Paprik125"
            },
            {
                "raw_content": "\"What's wrong with Wolfie? I can hear him barking. Is he okay?\" \"All right John, let's delve into dog behaviour. Here the skinny on why...\" \"Your foster parents are dead.\"",
                "author": "Trophallaxis"
            },
            {
                "raw_content": "Ha! Tesla bots are a far cry from sentient terminators. They are glorified warehouse workers at best. Just sayin’…. However, cool meme nonetheless and much closer than many sci-fi predictions.",
                "author": "technanonymous"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sama believes the Fast Fashion era is coming for Software as a Service",
        "score": 251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this guys drops random sentences and if one is going to be right, he will be quoted in books in the future for being visionary",
                "author": "tarkinn"
            },
            {
                "raw_content": "Fast Fashion has been catastrophic. So, it checks out.",
                "author": "mothman83"
            },
            {
                "raw_content": "What the fuck does this even mean? Edit - I got so many different replies from everybody, it turns out that nobody knows what it means. Because everyone is saying it means something different.",
                "author": "InterstellarReddit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Palantir CEO Alex Karp goes on unhinged rant!",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take away this man's cocaine",
                "author": "InternationalPlan553"
            },
            {
                "raw_content": "That is an Evil man who has convinced himself he is an altruistic genius",
                "author": "SlowDownHotSauce"
            },
            {
                "raw_content": "These people are fucking twisted",
                "author": "gridoverlay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "8/3/25💡Singularity in progress, as #USA spends more on infrastructure for AIs than human workers(500k tech jobs cut in last 90 days)🙏🇺🇸🙏",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "all these companies have a way higher roi on capital than real estate, as we enter this spending cycle things are going to get real uncomfortable for people competing for capital with ai. who wants to fund an office space when you can fund a data center have the least price sensative buyers offering you long term contracts how are random factories producing products at like a 10% margin going to compete with ai labs for power.",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "This is just the beginning! However I don't see the 500k tech jobs mentioned in your title.",
                "author": "RomeInvictusmax"
            },
            {
                "raw_content": "I really like the idea of this graph, but the data itself looks like pure bullshit. I remember very clearly that Google *alone* was supposed to spend more than $40B in 2025 on data centers.",
                "author": "ohHesRightAgain"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CEOs Are Publicly Boasting About Reducing Their Workforces With AI",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The quote isn't from a CEO. It's from a consultant who advertises he can help companies do this. He probably can't. He's advertising for himself by saying the most bombastic thing possible to get 200 threads on Reddit.",
                "author": "Grandpas_Spells"
            },
            {
                "raw_content": "Can get we get AI CEOs?",
                "author": "IgnisIason"
            },
            {
                "raw_content": "On the flip side, small startups with ai-first teams have the largest competitive advantage in the history of small business. A team of 10 can produce the same as a team of 100+.",
                "author": "SleepingCod"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Maybe Full Dive VR is the real UBI",
        "score": 52,
        "text_content": "I started thinking about something that might not be as far-fetched as it sounds: if AGI or even ASI arrives and automates most human tasks, and no UBI or some radical form of redistribution is implemented, then what real options will most people have left? The most likely one: simulating a fulfilling life, but virtually. If there’s no work, no traditional sense of purpose, and no material guarantees, but there are hyperrealistic virtual environments, neural interfaces, and emotionally gratifying artificial companions, then living inside a pleasant simulation could seem like a logical, even desirable, solution. We might end up in immersive worlds where you can explore, achieve things, fall in love without physical limitations, and reward systems that fill the existential void left by the loss of social roles. But even if we live mentally elsewhere, our physical bodies still need food, water, energy, and basic healthcare. If there is no UBI, where does that come from? One possibility is that we might rely on technologies that produce functional, low-cost food: microalgae, lab-grown meat, fortified powders, or Soylent-like pastes. The goal wouldn't be culinary pleasure, but simply keeping bodies alive with the bare minimum while the mind inhabits another reality. Another possibility is almost fully disconnecting from the physical body. In that case, we might live in automated pods that feed us intravenously, regulate basic functions, and keep us alive while our consciousness remains fully immersed in a simulation. Something like The Matrix or Ready Player One, but maybe chosen, not imposed.",
        "comments": [
            {
                "raw_content": "This is one of the more \"out there\" ideas I've read, but the crazy part is that this seems like a plausible future state to me. Interesting final statement...like The Matrix but by choice. Sad if the real world becomes such a hopeless mess that we opt to live in an alternate virtual one...but again, this seems like an actual possibility to me.",
                "author": "HighOrHavingAStroke"
            },
            {
                "raw_content": "Why do people often equate ubi with \"no sense of purpose\", quite the opposite. What your explaining here is basically dark dystopian cyberpunk. I think the world should avoid dystopian futures haha. FDVR doesnt have to be dystopian but being forced into it because life is horrid is. Automation should bring the end of scarcity thats the whole idea, so hopefully this will mean better lives and more freedom for all. Also if our future does look anything like this under automation, ie: the businesses all chose to automate their factorys, then sack everyone and then shut down the automated product lines as no one bought anything (yes its quite absurd they would choose this route but if they did...) then I would wake you from your VR, as we would have plenty of work to do destroying the elites.",
                "author": "brokenmatt"
            },
            {
                "raw_content": "I’ve felt for a while that full dive virtual reality will be the last true invention of humanity Once fully realistic simulations are possible, why do anything? Why colonise Mars when you can instantly live inside a fully colonised galaxy, complete with a variety of different alien species, incredible planet sized cities, etc? Why travel to a different country when you can instantly live a fully idealised life in that country, complete with all your dreams and expectations? Imagine how much time you spend on YouTube, or video games, but like 1000x worse. I really think full dive virtual reality will be the last true invention of humanity",
                "author": "HeirOfTheSurvivor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT's Study mode is really good",
        "score": 254,
        "text_content": "Hey fellow singulars I've been testing the \"Study\" mode of chat gpt since it came out I've never been a fan of school, but this tool makes learning pretty fun and entertaining It's really good, and challenges you on the topic of your choice, I recommend starting with a \"broad\" topic, mine was machine learning, because I'm working on an RL project, and I want to make sure I understand the key concepts It is able to guess your knowledge on the topic after some questions / answers, and adapts to your skill to challenge you on stuff you may not fully understand, narrowing the discussion to the juicy stuff For the best results, I recommend telling the model: * To not give you the answer unless you specifically ask for it * To correct you whenever you say something wrong Do not hesitate to ask it to elaborate if you don't understand the question Put yourself in a student's mindset, be curious, explain your chain of thought so that it understands your approach for a better experience I'm making this post in this subreddit because I feel like this is important, and it is a step forward toward AI based education, and I can imagine it being coupled to other RL applications to create a feedback loop to train better models The only downside is that it's a paid feature and you will reach the free limit pretty quick",
        "comments": [
            {
                "raw_content": "Thats awsome! I already have lots of fun learning with it, a dedicated mode for it sounds interesting.",
                "author": "CitronMamon"
            },
            {
                "raw_content": "I wasn't super impressed by it when I tried it. Granted it was just once. BUT I wasn't terribly impressed by OpenAI's Deep Research when that started but it iteratively and quickly became better to where now I think Gemini and OpenAI DR are roughly on par with each other (in OpenAI's case that's only with the latest model that I seem to run out of DR's on every month). As it exists now, though, it's basically just a different conversational template where it asks a bunch of questions in chat. There's no lecture component, no supporting visuals, no course structure, etc. Those things are within the capabilities of current AI though, the service just doesn't do it (yet). If they continue iterating on it, though, I can see it being a useful mode to use the chatbot in.",
                "author": "ImpossibleEdge4961"
            },
            {
                "raw_content": "Or you say you are using Anki and itll help you generate all the shit you need to use professional (free) study software.",
                "author": "FeralPsychopath"
            }
        ],
        "subreddit": "singularity"
    }
]