[
    {
        "post_name": "The most ineffective cops in America: Downtown San Francisco",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And if a white person did that they'd be arrested, booked and processed faster than someone could go out to dinner.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Why would we ever want to deport model immigrants like this?",
                "author": "SirBuzzKillingtonVI"
            },
            {
                "raw_content": "# Where's Harry Callahan when you need him?",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The WNBA wastes $150 million a year on advertising",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had someone tell me that the WNBA was a long term investment. I asked if 29 years was enough of a failure period to abandon the project. Maybe we need to wait to see if it succeeds after 40 years?",
                "author": "Snek_Plissken"
            },
            {
                "raw_content": "did I miss a dildo scandal?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The nba spends $150 million advertising for the wnba.",
                "author": "lefty295"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Somali American accused of a brutal murder of a Chinese woman in a Seattle-area Costco parking lot in January 2024 has finally been brought back to the U.S. after fleeing to his family's native East Africa. (His family claimed to be refugees, but like many Somalis after getting citizenship, e.g.,",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For a fucking purse! Since life means so little to that demon the death penalty should be the mandatory sentence. I know it's not available in Washington but it should be.",
                "author": "A_Colostomy_Bag"
            },
            {
                "raw_content": "Somalis will never be Americans.",
                "author": "Meddlesom"
            },
            {
                "raw_content": "67 years old Asian grandma… murdered in a parking lot by African terrorist … that’s f’d up",
                "author": "DeltaSierra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Department of Justice just launched a NATIONWIDE investigation into the voter rolls, including California and Minnesota.",
        "score": 1010,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A fellow named Shiloh Marx has a team of people laboriously checking the voter rolls of EVERY COUNTY in America, to find duplicates, non-citizens, ineligible voters, and fraudulent voters. He then sends each County's Registrar of Voters a list of all those names/persons who must be removed from the voter rolls. He gives each county a set time & if they don't take care of it, he files a criminal complaint, with a copy sent to the DOJ. He recently got California to remove 3.1 million ineligible voters. This guy is a national treasure. He reports that New York refuses to cooperate.",
                "author": "pray4peace4"
            },
            {
                "raw_content": "Oregon",
                "author": "BillyMahoney"
            },
            {
                "raw_content": "Could they launch a nationwide arrestigation?",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It only took 3 lawsuits, 2 trips to the Court of Appeals and 1,847 days, but I got my AR15 back! We defended our home, were persecuted by the left, smeared by the press, and threatened with death, but we never backed down",
        "score": 1216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are you still a Demoncrat?",
                "author": "barwhack"
            },
            {
                "raw_content": "So they recognized your 2nd amendment after taking your gun for 6 years???? Sure doesn't seem like a win...Isn't this Louisiana?? EDIT: Thank you, St Louis. Makes a little more sense but still....",
                "author": "mmmpillsaregood"
            },
            {
                "raw_content": "All that house and they had a Bryco/Jennings pot metal pistol.",
                "author": "RStroud"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk has donated $15 million to President Trump's MAGA Inc PAC and two Congressional Republican Super PACs in June",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, Trump and Elon are more effective together.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "So much for his third party. He already capitulated? 🤣🤣🤣 You will have to do more than bribe yourself back to be loved by MAGA again, Elon. Bend the knee and apologize to Trump for chimping out.",
                "author": "possibletower"
            },
            {
                "raw_content": "Proof it was all kayfabe.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The U.S. government has officially opened an investigation into former Special Counsel Jack Smith for possible violations of the HATCH ACT",
        "score": 1339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Hatch Act is a U.S. federal law passed in 1939 that restricts certain political activities of federal employees, as well as some state and local government employees who work in connection with federally funded programs. Its primary goal is to ensure that federal programs are administered in a nonpartisan manner, prevent federal employees from engaging in partisan political activities while on duty, and protect them from being coerced into political activities. - Grok",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Who *is* \"Jack Smith?\" Dude looks like he was grown in a lab. 🧪",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "he wasnt properly appointed...",
                "author": "SHILL_DETECTOR"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Supreme Court is set to consider ENDING race based districting! This would CRIPPLE the already broken Democrat Party!",
        "score": 1707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't even know that was a thing, WT actual F.",
                "author": "thechitowncubs"
            },
            {
                "raw_content": "WHY IN THE FUCK WAS IT ALLOWED IN THE FIRST PLACE? White people need to BALKANIZE.",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "It's affirmative action for Congress and should never have been allowed to begin with",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US Steel IS BACK!",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't tell you how happy this makes me. I grew up in a steel family (my father manufactured oil, gas, septic tanks etc etc.) and he must've told me a million times how important that company & the industry in general was important to our dominance as a country. MAGA",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "It's crazy to think that you're building a fleet of super carriers but you were importing steel for it... ! Glad Trump's policies are helping bring that production back to America!",
                "author": "thebeercules"
            },
            {
                "raw_content": "Now bring back Bethlehem steel and all the other ones that crumbled since the 1970-80s. US steel played a big part in closing them all down consolidating them out and then selling to Japan.",
                "author": "Ozfer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Kennedy: Thanks to the leadership of @DrOzCMS, we’ve just repealed a dangerous Biden-era provision in the CMS inpatient payment rule that pressured hospitals to mandate COVID-19 shots for doctors and nurses.",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a start...",
                "author": "Mortal_Wombat"
            },
            {
                "raw_content": "Now get rid of all mrna shots and ban them from ever being given to anyone again.",
                "author": "projectarcturus"
            },
            {
                "raw_content": "https://x.com/SecKennedy/status/1951372406968164599",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE DESTRUCTION OF THE DEMOCRAT PARTY",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's not count our chickens before they hatch. I'm not dooming, I expect as least some of these to be done in the coming months. I just don't think we should be popping the champaign for these until *after* they're done.",
                "author": "Minn2000"
            },
            {
                "raw_content": "Bye bye, Dems. You wont be missed.",
                "author": "airmaildolphin"
            },
            {
                "raw_content": "The Civil War didn't destroy the Democratic Party. They always say that the losing party will be in the political wilderness for decades, yet it never happens. The Democratic Party is a threat that grows and thrives, its one goal to feast upon our sorrow. With each third world savage that bolsters its ranks, our power dwindles.",
                "author": "Philhelm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftist Nonprofit Head Spills Beans About Secret \"Notification System\" To Help Illegals Evade ICE Arrest. Admitted that Vera's operations are bankrolled by \"foundations, like the Gates Foundation, or Jeff Bezos...\"",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do we have to declare all illegal aliens as terrorists to make these seditious pieces of shit STOP fucking with America? At least we could lock up these fat cats who keep bankrolling the destruction.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Gates owns the Four Seasons, they could be taken over and used as deportation facilities.",
                "author": "TrumpAndGodWin"
            },
            {
                "raw_content": "Drone strike Bill Gates",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: There is a 9-day HUNGER STRIKE still going strong at the Florida Alligator Alcatraz illegal alien facility, per NBC.",
        "score": 806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know who's not on a hunger strike? THE GATORS.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "I ate a cold ham sandwich for lunch because I can't afford fast food - Oh the Humanity!!",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Yay! Lower food costs for the taxpayers!",
                "author": "splink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Amy Klobuchar is asked why Democrat polling numbers are so low ---- Her answer? --- It’s Trump’s fault. 🤣",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's not entirely wrong.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "I mean, she's not wrong. Why would you vote Democrat when Trump's platform is so much better?",
                "author": "MAGA9428"
            },
            {
                "raw_content": "https://x.com/WesternLensman/status/1951479648094920867",
                "author": "SweetBeef"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DOJ has introduced CLASSIFIED evidence against wannabe Trump assassln Ryan Routh Judge Cannon ruled the evidence could cause “exceptionally grave damages to the national security of the U.S.,” so she SEALED it Was this guy a Ukrainian asset or something??!",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Worse…an American asset",
                "author": "Captntrouble"
            },
            {
                "raw_content": "Can Trump declassify it?",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "at this point we NEED EXCEPTIONAL DAMAGES to occur, otherwise, all these swamp creatures stay in the shadows, same logic as epstein list... im so fkin sick and tired of being \"protected\" from horribles truths... fuck it, give it to me raw, i wanna be traumatized by the evidence, destroy me, you have my permission...",
                "author": "9Horsepower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DOJ Official Who Approved $2 Million Payout to Trump-Hating FBI Officials Peter Strzok and Lisa Page Unmasked",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Left-wing activist and former Deputy Assistant Attorney General Brian Netter signed off on the payout to Strzok and Page after the two participated in the Trump-Russia hoax. > Brian Netter is now working with crooked Clinton lawyer Marc Elias as the legal director at Democracy Forward. --- # ARREST BRIAN NETTER!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Interesting you put a lock them up tag considering we will not see a single high profile arrest in this presidency.",
                "author": "Pener_Parker"
            },
            {
                "raw_content": "They broke the law, then received millions from the tax payers. Yet nobody will go to jail.",
                "author": "conservativefrank"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House Republican Launches Crackdown on ‘Sanctuary City’ Mayors: ‘ERIC ADAMS Act’",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is brilliant using Eric Adams to represent \"Eric Adams Act\", crackdown on illegals. Remember he went to Biden's White House to complain about all the illegals in his city and they told Adams to GYF, and then they had him investigated by the FBI for something. Next thing you know, hes taking illegals galore, by the bus loads. This is hysterical.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "DEI fucktard. He'd fuck up a lemonade stand.",
                "author": "RobinNet"
            },
            {
                "raw_content": "What can he do?",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Too Late” Powell should resign, just like Adriana Kugler, a Biden Appointee, resigned. She knew he was doing the wrong thing on Interest Rates. He should resign, also!",
        "score": 979,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Convene Congress and force them to pass an Act of Congress that would shut down the Federal Reserve. Forever. How would you force them? There's a certain 'list' you could show them. In private.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "END THE FED.",
                "author": "tooanalytical"
            },
            {
                "raw_content": "Ok this is just pathetic now. I mean seriously...how long does he need to bellyache about Powell who is probably the only reason inflation hasn't begun to rocket to the moon as the rich plunder what little assets folks in the US still have? I swear Trump must be getting his advice from a lot of fat cats.",
                "author": "Klaus73"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Harmeet Dhillon just ended a decree binding the federal government to DEI in hiring practices",
        "score": 1160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now fire the DEI hires because they're just going to ignore it or rebrand it into something else. A black government employee is almost always going to hire a black over a white. If they get called out on it they can just say something like the black applicant interviewed better.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Harmeet ended DEI in hiring process?",
                "author": "Politoed"
            },
            {
                "raw_content": "weird timing but better late than never I guess...",
                "author": "TreeOfLibertyisfp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "About 154,000 Workers Accepted Trump Administration Buyouts",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, now maybe they will contribute to the economy, instead of being a drain on it.",
                "author": "LegendFang"
            },
            {
                "raw_content": "Unfortunately a lot of it is retirees. And there's still a ton of shit bags working because there's still a lot of woke SES's still lingering around that hate Trump. I really wish there was a hot line for this.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Where did the 300k unemployed black women come from? If they skipped the buyout and still got canned, that probably explains the salt about it. Lol",
                "author": "HoganP"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel has just 18 months to 'land a hero customer on 14A' or its cutting-edge fabs are toast, says chip industry analyst",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If there is no limit on the price floor I'm sure that's not a problem. AMD would have no problem building the ps6 on this node at the right price.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "It seems pretty grim when Tesla thought that Samsung Foundry was a better bet than Intel. If you are losing out to Samsung Foundry the outlook is quite dour.",
                "author": "djm07231"
            },
            {
                "raw_content": "18 months seems like the latest possible date, as placing orders for equipment and starting construction needs to take place in 2026 if they want to start HVP in 2028. They might not need WSA's signed in the next 6-12 months. But they need to be sure they are going to get them sometime in the next 6-12 months. that is my guess.",
                "author": "HippoLover85"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Hardware & Software Survey (July 2025)",
        "score": 60,
        "text_content": "Steam has just released their Hardware & Software Survey for July 2025. According to the data, the RTX 5070 is currently the most popular GPU from the new Blackwell based RTX 50 series, showing the strongest adoption among all 50 series cards. which is impressive considering how recently they launched. Meanwhile, AMD’s RDNA 4 based GPUs like the RX 9070 XT and RX 9060 XT are still missing from the charts, which could be due to limited availability or not being available at MSRP. https://store.steampowered.com/hwsurvey/videocard/",
        "comments": [
            {
                "raw_content": "On a side note, AMD crossing 40% on cpu is boding very well for them.",
                "author": "996forever"
            },
            {
                "raw_content": "It's crazy how there are more 5090s on the survey than AMD RX 7600XTs. I mean i can't say anything since i bought one too but thats an absurd number for a 2000$ GPU",
                "author": "amazingspiderlesbian"
            },
            {
                "raw_content": "RDNA4 still missing this far after launch",
                "author": "BarKnight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel quietly rolls out 'new' Core 5 CPUs that look suspiciously like 12th Gen chips — Core 5 120 and Core 5 120F enter the budget gaming market with i5-12400 specs and 100 MHz boost",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It makes sense as a lot of system assemblers are still using the 12400f due to price, but with the DDR4 price hike in may and June, it’s a system that is hard to sell, and the fact that SI’s can use one main board for their production of Intel PCs makes it cheaper for them to stock.",
                "author": "GongTzu"
            },
            {
                "raw_content": "Could have just rebranded it as an core 3 and core 5 could be the 6p+4e ones",
                "author": "amdcoc"
            },
            {
                "raw_content": "Confirmed H0 (Alder Lake 6P 0E) die, it IS actually on Intel Ark - not on the english one. English for some reason has no Ordering & Compliance tab. English: 120: https://www.intel.com/content/www/us/en/products/sku/245112/intel-core-5-processor-120-18m-cache-up-to-4-50-ghz/specifications.html 120F: https://www.intel.com/content/www/us/en/products/sku/245111/intel-core-5-processor-120f-18m-cache-up-to-4-50-ghz/specifications.html LATAM: 120 Stepping H0 sSpec SA35V: https://www.intel.la/content/www/xl/es/products/sku/245112/intel-core-5-processor-120-18m-cache-up-to-4-50-ghz/ordering.html 120F Stepping H0 sSpec SA35W: https://www.intel.la/content/www/xl/es/products/sku/245111/intel-core-5-processor-120f-18m-cache-up-to-4-50-ghz/ordering.html",
                "author": "zir_blazer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Chip-Packaging Pioneering Expert Takes Job at Samsung",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Given the expertise mentioned here, probably tied to Intel canceling its glass substrate work. Presumably laid off almost everyone in RnD for that, and anyone remaining would probably quit.",
                "author": "Exist50"
            },
            {
                "raw_content": "Link to non-paywalled article: [https://archive.is/jjte9](https://archive.is/jjte9)",
                "author": "snowfordessert"
            },
            {
                "raw_content": "Hey snowfordessert, unfortunately your submission has been reported because the link address indicates that the content may be locked behind a pay wall. Please consider resubmitting from a different source that everyone can view. If the content is not behind a paywall, please [message the moderators](https://www.reddit.com/message/compose?to=%2Fr%2Fhardware) and they will be by shortly to take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel: Ohio plant ‘likely’ canceled if company can’t get new manufacturing customers",
        "score": 199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bold strategy to ask for customers before proving you can deliver. And at this point they should print chips with apology letters on them.",
                "author": "UnlikelyOpposite7478"
            },
            {
                "raw_content": "Incredible to think Intel doesn't think it can fill its own pipeline. Spinning off your foundry is one thing, but doing it after you've failed for close to a decade to fab the things you're trying to make for your own company and then acting surprised when other people don't want to use your foundry is a whole other level of delusion. And then they're gonna turn around and say their fab isn't viable if they can't get somebody else to commit to a foundry that can't even serve Intel's internal needs? What did they think was going to happen? Who was in that board room making these choices all along?",
                "author": "daikiki"
            },
            {
                "raw_content": "am convinced that they literally do not have the brain power to come back. they look like what glofo were going through trying to make 7nm work. they have been trying to leap frog their own failed projects since 10nm, and they cant make it work lol. Intel 3, literally their only somewhat successful node in over a decade (although the yield almost definitely sucks, they wouldnt manufacture their own gpus on it). is inferior to TSMC's worst N3 version by a light year, hell worse than Samsung's lol.",
                "author": "Quatro_Leches"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Three Intel senior executives to retire amid manufacturing shake up",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kaizad was the head of the 10nm program. How he managed to stick around for a decade after the worst process in Intel history is all you need to know about how disciplined Intel was about pruning its ranks before",
                "author": "gburdell"
            },
            {
                "raw_content": "The article notes that … > Three senior executives in Intel's manufacturing operations are set to retire, Intel told Reuters on Thursday, as new CEO Lip-Bu Tan implements sweeping change to resuscitate the struggling U.S. chipmaker. > Intel told staff on Tuesday that corporate vice presidents in the technology development group, *Kaizad Mistry* and *Ryan Russell*, would retire, as would *Gary Patton*, corporate vice president at its Design Technology Platform organization and a former IBM executive. > **Intel also discussed changes to the technology development group, which is responsible for creating manufacturing processes, said two people briefed on the matter.** The chipmaker plans to reduce its manufacturing capacity planning team and cut a portion of its engineering team, the people said. > Manufacturing operations are led by former Micron Technology executive *Naga Chandrasekaran*, who was hired about a year ago by then-CEO Pat Gelsinger – Chandrasekaran's responsibility expanded in March as he took over technology development and manufacturing. He has since reorganized staff under him, including layoffs as part of global cutbacks.",
                "author": "Helpdesk_Guy"
            },
            {
                "raw_content": "Of course these shitheads are allowed to retire with full benefits, but fuck all those other people they laid off and will never bring back.",
                "author": "glizzytwister"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung confirms Exynos 2600 as first 2nm flagship smartphone chip",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if this isn't one of those weird marketing \"2nm\"s, having some competition in the space is great given how Intel may be folding its fabs.",
                "author": "_Lucille_"
            },
            {
                "raw_content": "This is just going to be their 3nm GAAFET node but since it can produce something that is a little bigger than a smartwatch chip, they're going to call it a 2nm class product.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "If the S26 Ultra doesn't have the option for the Snapdragon 8 Elite Gen 2 in North America and it isn't at least closely competitive with it, I'm getting the 25 Ultra. That being said, it would be batshit insane if Samsung released a supposedly more advanced node that performs worse than the competitor. I really hope Qualcomm and Samsung can start competing more directly because that'll be great for the rest of us. At this point it's a little too early to tell what's what, but I bet we'll know what to expect by years end.",
                "author": "Nvidiuh"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Kids these days complaining about the latest Nintendo Direct weren't around during E3 2008.",
        "score": 686,
        "text_content": "What a time to be alive",
        "comments": [
            {
                "raw_content": "What a legendary E3. Super awful as a fan at the time but now I look back fondly on all of the hilariously awkward press conferences over the years…",
                "author": "Koopwn"
            },
            {
                "raw_content": "Ravi Drums was God's gift to humanity. In the sense that God is disgusted with us, and wants us to stop.",
                "author": "LunarWingCloud"
            },
            {
                "raw_content": "I'm still as confused today as I was back then as to why the hell this was what Nintendo went with",
                "author": "RandomNobody86"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In case you forgot",
        "score": 299,
        "text_content": "OHHH. BANANA. As you were.",
        "comments": [
            {
                "raw_content": "![gif](giphy|1fHlf4mgS2JPy)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "\"look DK! It's a \" OH BANANA That's pretty much all that people in my house hear for hours on end while I'm playing",
                "author": "SelectInstruction262"
            },
            {
                "raw_content": "![gif](giphy|9wLKh6ms5t9qE)",
                "author": "A_Legit_Salvage"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why are Gamers such hypocrites when it comes to Nintendo",
        "score": 246,
        "text_content": "Ever since it was announced that the Switch 1 is getting price hikes, it’s like some people REFUSE to believe it has to do with tariffs (even tho it’s been heavily covered how tariffs would affect the gaming industry) because it’s Nintendo. They didn’t question it when Xbox raised there prices because of it tho like why is it that some people just YERN to hate Nintendo cause people have been spreading misinformation about the Switch 2 since the Direct in April and now are refusing to believe that they are also being affected by market conditions just like everyone else.",
        "comments": [
            {
                "raw_content": "Where have you been? Venture outside Reddit. People were indeed going off on Xbox for the hikes. Now, they blamed Nintendo for that, for some reason. Saying Nintendo “opened the floodgates” or some such idiocy. But they did complain nonetheless. lol. People have weird ragers for Nintendo. I feel it was born out of the GameCube era, and has reached campy levels of insane.",
                "author": "WetterBetty"
            },
            {
                "raw_content": "This is the internet, people will say stuff to get a rise out of others.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "People are generally pretty stupid.",
                "author": "UnitHuge5400"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Accessories See Another Price Increase on Aug. 3rd",
        "score": 713,
        "text_content": "They don’t specify which accessories will be affected but if u haven’t already now is probably a good time to get. Are we winning yet?",
        "comments": [
            {
                "raw_content": "This is why I decided to get a switch 2 at launch. I imagine it's going to go up at some point.",
                "author": "mickeyphree1"
            },
            {
                "raw_content": "Switch OLED went from 349 to 399. Switch 1 went from 299 to 339. Target has updated the prices on their website",
                "author": "Professional-Cry8310"
            },
            {
                "raw_content": "Oh this pro controller I’ve had since 2018 gonna last me till 2030",
                "author": "honeymoonblackstar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Y'all are making Game Key Cards a way bigger deal than what they actually should be. (Bad opinion)",
        "score": 244,
        "text_content": "Don't get me wrong, I also don't like the fact that the full games are not on the card. That sucks. It takes up storage on my system and I basically get a paperweight of a cartridge. I also hate the stupid banner on the cases, because I like me a nice looking physical case. But people are pretending this is some scummy thing that ***only*** Nintendo is doing, and even refusing to buy the games, not even digitally, if they use a keycard for their physical release. This is happening when many, if not most PS5 and Xbox physical games need to get downloaded and installed into the console in order to play them. which is basically the same thing. Many PS5 and Xbox games are not fully included on the discs, just like game keycards. Only difference is that PS5 and Xbox dont have a quirky name for it and a stupid banner on the cases. Hell, i'm sure that this whole shitstorm would not have started if Nintendo didn't give it a quirky name, and just added a small \"Download required\" line into the boxes. There's also the issue of the downloads possibly being taken down in the future.. But think about it. The download servers for the Wii Shop, and the 3DS and Wii U eShop are still up even after all this time. If you bought digital games back then, you can still redownload them. Heck, even update servers are still up, i'm still able to software update my Wii U and 3DS games. Even after all the online play services were taken down. If Nintendo wanted to shut down the download servers for the Wii, Wii U, and 3DS, they would have done so already. So *Nintendo not letting you download a game you own* ***is a valid concern***\\*, but not a\\* ***proven*** *an issue here.* Nintendo has not pulled an Ubisoft and said that \"we don't own our digital games.\" so far, they've been pretty good with them. Sure, the downloads can be taken down, and it's a very valid concern, but i think that would be in at the very least 20 years. The Wii's servers have been going on for 19 years already after all. I'm just saying, if you are gonna refuse to buy games and boycott Nintendo over a download being required for your game, then also do the same for Xbox, Playstation, and Steam. Again, I still don't like game key cards, I would prefer if my whole game was on the cartridge, **You SHOULD give Nintendo flack for a bad practice, that's important and valid. Don't let companies get away with BS practices.** I'm still choosing to not support game key cards, and will go out of my way to just buy the games digitally. But don't make something like this the end of gaming or the end of preservation. ***And specially don't make this the only reason you don't buy a game you actually wanna play.*** Edit: This is not saying \"Everybody is doing it, so its not so bad\". This is saying \"If you are making a fuss about Nintendo doing it, also equally fuss about it with the other platforms. But don't make it the end of the world\" Thank you for listening to my ted talk, hope I don't get cooked.",
        "comments": [
            {
                "raw_content": "I really don't care if others are doing it it sucks no matter what",
                "author": "benjoo1551"
            },
            {
                "raw_content": "“This is happening when many, if not most PS5 and Xbox physical games need to get downloaded and installed into the console in order to play them. which is basically the same thing” How are people so invested in this topic yet still say the same false thing? Installing the game to the SSD IS NOT the same as Game Key Cards. Persona 3 Reload on the PS5 has the full base 1.0 version of the game on the disc which means that once you put it in the PS5 it installs the full game on the SSD and this can be done WITHOUT internet. Persona 3 Reload on the Switch 2 does not have full game, it REQUIRES Internet to fully download the game.",
                "author": "JoJokaWasTaken"
            },
            {
                "raw_content": "It's a constantly repeated myth that most PS5 games aren't playable from disc. In fact it's about 85% of PS5 games are fully playable from the disc",
                "author": "Wipedout89"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SpongeBob SquarePants: Titans of the Tide Announcement Trailer",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't have David Hasselhoff singing a version of Wellerman on my August bingo card.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Holy shit! What?! That looks phenomenal and that’s such a great trailer, having the Hoff be a prominent part of it. The pre-order bonus is a little…odd…but I’ll definitely be getting this special edition. I absolutely love these types of SpongeBob games.",
                "author": "NintendoNoNo"
            },
            {
                "raw_content": "SpongeBob in assless chaps is the greatest preorder bonus in history",
                "author": "CrispyVibes"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After doing my research, these are the ONLY actual PHYSICAL Third Party games on the Nintendo Switch 2 so far. (Third Party games that are actually on a cartridge and not a Game-Key Card)",
        "score": 341,
        "text_content": "Actual Physical 3rd Party Nintendo Switch 2 Games: -Cyberpunk 2077 -Daemon X Machina: Titanic Scion (Key-Card in Japan/Asia) -Fantasy Life i: The Girl Who Steals Time (Japan/Asia Only) -Majogami: The Witch of Luludide (Japan/Asia Only) -Mortal Kombat LEGACY COLLECTION -Rune Factory: Guardians of Azuma -Sonic Racing CrossWorlds -Story of Seasons: Grand Bazaar -Tamagotchi Plaza (Japan/Asia Only) If I missed any, PLEASE let me know and I'll add it to the list!!",
        "comments": [
            {
                "raw_content": "Why is this downvoted? It's very informative.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Didn't know Daemon X Machina was fully in the cartridge. I'm now buying it to support this practice.",
                "author": "Cocobani"
            },
            {
                "raw_content": "Really excited about the new Daemon X Machina. Hoping it’s better than the first",
                "author": "PaleFondant2488"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier/Bloomberg: 2K Games was also developing a remake of the first BioShock game, but that was shelved earlier this year",
        "score": 502,
        "text_content": ">2K Games was also developing a remake of the first *BioShock* game, but that was shelved earlier this year, according to people familiar with the plans. [https://www.bloomberg.com/news/articles/2025-08-01/next-bioshock-game-changes-leaders-after-development-turmoil?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDMxNCwiZXhwIjoxNzU0Njc5MTE0LCJhcnRpY2xlSWQiOiJUMEJXRTJHUTFZV1cwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.Zt4Beo52NA1y9AxmXB4Bd38T64ITJqEG1fTMqnDAfZU](https://www.bloomberg.com/news/articles/2025-08-01/next-bioshock-game-changes-leaders-after-development-turmoil?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDMxNCwiZXhwIjoxNzU0Njc5MTE0LCJhcnRpY2xlSWQiOiJUMEJXRTJHUTFZV1cwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.Zt4Beo52NA1y9AxmXB4Bd38T64ITJqEG1fTMqnDAfZU)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Is that the BioShock RTX thing in the nVidia leak?",
                "author": "BBLKing"
            },
            {
                "raw_content": "Such a shame. Bioshock with modern visuals would be absolutely incredible, rapture is practically made for ray traced visuals. Imagine a revamped modern gameplay feel and the environment interacting with water physics, it could feel very fresh for a remake. Maybe one day...",
                "author": "ApartHouse6580"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Next ‘BioShock’ Game Changes Leaders After Development Turmoil",
        "score": 461,
        "text_content": "[https://www.bloomberg.com/news/articles/2025-08-01/next-bioshock-game-changes-leaders-after-development-turmoil?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDMxNCwiZXhwIjoxNzU0Njc5MTE0LCJhcnRpY2xlSWQiOiJUMEJXRTJHUTFZV1cwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.Zt4Beo52NA1y9AxmXB4Bd38T64ITJqEG1fTMqnDAfZU](https://www.bloomberg.com/news/articles/2025-08-01/next-bioshock-game-changes-leaders-after-development-turmoil?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NDA3NDMxNCwiZXhwIjoxNzU0Njc5MTE0LCJhcnRpY2xlSWQiOiJUMEJXRTJHUTFZV1cwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.Zt4Beo52NA1y9AxmXB4Bd38T64ITJqEG1fTMqnDAfZU)",
        "comments": [
            {
                "raw_content": "BioShock and development hell, name a more iconic duo.",
                "author": "communistwookiee"
            },
            {
                "raw_content": "I feel like “fire the creative director from a creative position” puts this three years away at best.",
                "author": "MetroidsSuffering"
            },
            {
                "raw_content": "I feel like we never get good news when it comes to the next Bioshock game. It’s a shame cause we desperately need more immersive sims in this industry . I wanna say the last AAA one we got was Prey and that was in 2017.",
                "author": "I_Heart_Sleeping"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Chris Dring knows of 3 games that were missing from the Nintendo Direct Partner Showcase",
        "score": 148,
        "text_content": "https://xcancel.com/Chris_Dring/status/1950923907713700102#m https://xcancel.com/Chris_Dring/status/1950932522495353236#m >Dring: There were at least 3 games I was told were ‘100%’ in that Nintendo Partner Direct that clearly weren’t. Just goes to show how these things change. >Twitter user: Probably need to change them sources bruv >Dring: I mean. It was directly the companies themselves. So if companies were 100% confident their games were going to be shown in this Direct... what happened? Nintendo continues to be weird",
        "comments": [
            {
                "raw_content": "Devs know that they're gonna be in a direct but apparently they aren't always told which one or when. Keep things vague so that when leaks happen there's less info to get out",
                "author": "GalaksenDev"
            },
            {
                "raw_content": "Nintendo probably holding back bigger games to a september direct that also could be wishful thinking",
                "author": "profchaos111"
            },
            {
                "raw_content": "Come to think of it, Project Watari didn't show up in that Direct. It was initially targetting a November release, but then, \"Dear me... I was\" was supposed to come out in March.",
                "author": "SocranX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Wario64 - Target accidentally posted Switch 1 console price increases early, now removed from site",
        "score": 606,
        "text_content": "https://bsky.app/profile/wario64.bsky.social/post/3lvdvrv55rd2x If the prices on the screenshot turn out to be correct: Switch - $300 to $340 Switch OLED - $350 to $400 Switch Lite - $200 to $230",
        "comments": [
            {
                "raw_content": "$400 for a switch oled is crazy, at that point get a switch 2",
                "author": "ShowtimevonParty"
            },
            {
                "raw_content": "Also using Target as a reference : Joy-con 2s will get bumped up from $95 to $100. Pro controller 2 will not change price.",
                "author": "hatramroany"
            },
            {
                "raw_content": "Almost a 15 percent price increase, just below new tariff rate….better buy your switch 2 now",
                "author": "Automatic-Unit-8307"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PlayStation \"Orion\" (PS6 Home Console) and PlayStation \"Canis\" (PS6 Handheld) early Specs Leak from Moore’s Law Is Dead.",
        "score": 1120,
        "text_content": "**PlayStation \"Orion\" (PS6 Home Console)**:- \\-Chiplet Design, with some mention of possibly utilizing \"Navi 5\" Desktop chiplets. \\-Backwards Compatibility to PS5 and PS4 Generations. (no mention of PS3) \\-Heavy Emphasis on Cost Constraints, and keeping power lower than PS5. \\-Manufacturing Planned for Mid-2027, with a likely Fall 2027 or Early-2028 Release Date. \\-160W TBP \\-8 x Zen 6 (or later) Cores \\-40-48 RDNA 5 Compute Units @ 3GHz+ \\-160-bit or 192-bit bus w/ GDDR7@32GT/s+- \\-Rasterisation Performance estimated to be \\~3x PS5 (Ray Tracing Uplift Expected to be Higher) \\*Because Canis is verified to be on 3nm, and Magnus is on 3nm - It is believed this is 3nm as well. \\*It's clear that PS6 \"Orion\" started as a chiplet design that looked kinda like an RDNA 3 layout, but it's also clear that AMD was trying to convince Sony to share dies with desktop...so it's very possible that the final design could use AT3 or AT (like XBOX Magnus), and therefore it could end up getting more than 48 Compute Units...but likely the same or less than XBOX. . **PlayStation \"Canis\" (PS6 Handheld)**:- \\-Monolithic 3nm Die (He was able to verify THIS in modern documents) \\-Backwards Compatibility to PS5 and PS4 Generations. (no mention of PS3) \\-Canis includes a MicroSD Slot, M.2 SSD Slot, Haptic Vibration, Dual Mics, and a Touchscreen. \\-Specifically, a diagram states that the USB-C port has video out capabilities. \\-Manufacturing Planned for Mid-2027, with a likely Fall 2027 or Early-2028 Release Date. \\-15W TBP \\-4 x Zen 6c Cores \\-12-20 RDNA 5 Compute Units @ 1.6-2GHz \\-128-bit bus w/ LPDDR5X-7500+ \\-Rasterization Performance estimated to be \\~0.5x PS5 (RT Expected to be higher than this) \\*Canis should beat XBOX Ally X in performance, but it doesn't come off as a \"powerhouse\".",
        "comments": [
            {
                "raw_content": "I only read \"Playstation Home\" and I had an heart attack",
                "author": "DarkDaniel_01"
            },
            {
                "raw_content": "With these specs the PS5 can be supported forever",
                "author": "AdFit6788"
            },
            {
                "raw_content": "PS6? So i blink with my eyes and the PS5 released 5 years ago? Jesus man",
                "author": "PablosCocaineHippo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1ST: Starfield PS5 Release Planned for 2026 Alongside Expansion 2",
        "score": 385,
        "text_content": "Key Quotes \"According to our sources, MP1st was told that Starfield won’t be released in 2025, partly due to the RPG’s weak sales of the first expansion, Shattered Space. Instead, Microsoft is leaning toward releasing the Starfield PS5 version in Spring 2026. For those not in the US, spring starts the middle of March and runs until mid-June.\" \"From what we were told, Starfield’s release on PS5 is planned to coincide with the game’s second expansion and other quality-of-life updates. We are also not expecting any announcement about the PS5 version of the game at this August’s gamescom, so don’t expect it to be shadowdropped like Bethesda’s The Elder Scrolls 4: Oblivion Remastered release a few months ago, which is something we reported on accurately (for anyone keeping score).\" Source: https://mp1st.com/news/starfield-ps5-release-planned-for-2026",
        "comments": [
            {
                "raw_content": "Why has this taken so long? I feel like it may be hurting potential PS5 sales. I do plan on getting Starfield for PS5 just for the convenience but this is just taking way too long.",
                "author": "ManjiSouls"
            },
            {
                "raw_content": "Those qol update and expansion better be cyberpunk 2.0 levels of improves if they are delayed that long. I actually really like this game, but if they are delaying releasing that stuff and it’s only minor improvements and just more starfield story, people will be unhappy.",
                "author": "darkdeath174"
            },
            {
                "raw_content": "So it’ll be a year and a half in between expansions and simply content in general. Bethesda was killing it the first few months, adding content and QoL updates every few weeks and have completely dropped the ball since.",
                "author": "Raging__Raccoon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kepler_L2: Sony has settled on 16 CUs for Canis (PS6 handheld), Microsoft currently has no handheld SoC in development",
        "score": 214,
        "text_content": "https://www.neogaf.com/threads/mlid-ps6-early-specs-leak-amd-rdna-5-lower-price-than-ps5-pro.1686842/#post-270678215 > VolticArchangel said: > Taking into account these are 2023 AMD proposals to Sony, did you hear about finalized CU count for Orion, or at least as of now, before tape out? > > No, but I know they settled on 16 CUs for Canis. > > VolticArchangel said: > Also, wouldn't the same context (support for handheld) apply for Magnus as well, and it's handheld variant? Xbox is still doing their proprietary handheld right? > > There's no handheld SoC in development for Microsoft.",
        "comments": [
            {
                "raw_content": "I mean, we know Microsoft put their 1st party handheld on indefinite hold. No one is going to be doing SoC work on something mostly binned for now, as if they return it it, it will be new specs.",
                "author": "darkdeath174"
            },
            {
                "raw_content": "I think he means no bespoke handheld SoC in development, Microsoft will probably continue relying on partners like ASUS and use essentially off-the-shelf AMD parts for their future handhelds",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Me dumb Me want to understand Me need someone to explain",
                "author": "Amori17"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mortal Kombat Legacy Kollection launches September 30, 2025; physical editions for most consoles AND PC coming from Limited Run Games; Switch 2 version ships completely on Game Card",
        "score": 158,
        "text_content": "[Following a leak from the Xbox app last week](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mb3tx5/xbox_app_has_leaked_the_mk_legacy_kollection_for/), Digital Eclipse, Atari and Warner Bros. Games have [announced](https://www.ign.com/articles/mortal-kombat-legacy-kollection-physical-editions-confirmed-including-nintendo-switch-2-with-a-game-card-containing-the-full-game-data) at EVO that *Mortal Kombat Legacy Kollection* will officially launch on **September 30, 2025** for PlayStation 4, PlayStation 5, Nintendo Switch and Switch 2, Xbox One, Xbox Series X|S and PC. The release date was revealed through a new trailer that also confirmed the inclusion of ***Mortal Kombat Trilogy*** in the game lineup. This was the final update to *MK3* that notably introduced Brutality finishers to the series, added back the *MKII* versions of Raiden and Baraka, unlocked the boss characters like Goro, Kintaro and Shao Kahn from the beginning, and added Chameleon as a secret character, as well as the majority of stages from *MKII, MK3* and *UMK3.* If the other games in the collection are any indication, you'll also get to play every console port of *MK Trilogy*, including the PlayStation and Saturn versions which got classic Jax, Kano, Kung Lao and Raiden, and the Nintendo 64 port which replaced the male Chameleon, whose gimmick was being able to transform into all the male ninjas, with the genderswapped Khameleon, who does the same thing but with the female ninjas (Kitana, Mileena and Jade) Also officially confirmed following last night's listing is that [a physical release of Legacy Kollection](https://bleedingcool.com/games/mortal-kombat-legacy-kollection-reveals-physical-edition-options/) will be distributed by Atari and Limited Run Games for **PlayStation 5, Nintendo Switch, Nintendo Switch 2, Xbox Series X and even PC**. Moreover, the Nintendo Switch 2 version will ship **completely on the Game Card**. In addition to[ a standalone physical copy](https://atari.com/products/mortal-kombat-legacy-kollection-standard-edition?pr_prod_strat=pinned&pr_rec_id=ed4b6bc1e&pr_rec_pid=9181581246629&pr_ref_pid=9181582524581&pr_seq=uniform) (Consoles only; $49.99 USD on other platforms, $59.99 on Switch 2), there will be a Day One Edition with an exclusive slipcover for all preordered copies. A [Deluxe Edition](https://atari.com/products/mortal-kombat-legacy-kollection-deluxe-edition?srsltid=AfmBOorkRHHD2PIjHXuQkpbJQUSsr9d4grt0ubHs7cuK9fNKK_KQGIud) (PS5/Switch/Switch 2 only; $69.99 USD on other platforms, $79.99 on Switch 2) will bundle the physical copy with a Steelbook case, mini marquees, a magnet, collectible poster, lenticular cards, arcade flyers, and arcade cabinet cards. The [Kollector's Edition](https://atari.com/products/mortal-kombat%E2%84%A2-legacy-kollection-kollector-s-edition?pr_prod_strat=pinned&pr_rec_id=2ec60a849&pr_rec_pid=9181582524581&pr_ref_pid=9181582065829&pr_seq=uniform) ($149.99 USD for all platforms) was designed in-house by LRG and comes with a giant Goro statue that doubles as a controller holder, a commemorative arcade token, a hardcover book with various series art and lore bits, and a pin set, all kollected inside a numbered box set. The standard, Day One and Deluxe Editions are planned to ship on **December 12, 2025** UPDATE: *Mortal Kombat Trilogy* in the *Kollection* appears to be the **PlayStation** version but heavily adjusted to clean up a lot of technical bugs like Shang Tsung not showing up in the Choose Your Destiny towers and the loading delays for Tsung's character morphs.",
        "comments": [
            {
                "raw_content": ">Limited Run Well those physical copies aren't arriving for 6-12 months then",
                "author": "smolgote"
            },
            {
                "raw_content": ">LRG not again ffs",
                "author": "-PVL93-"
            },
            {
                "raw_content": "...that Switch 2 tax, rip.",
                "author": "MXC_Vic_Romano"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Exclusive: Three Intel senior executives to retire amid manufacturing shake up",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's crazy to me is that it took this long for Intel to ~~fire~~ retire their \"VP of Technology Strategy\". Intel hasn't had a coherent technology strategy for at least 5 process nodes. This guy should have been out *years* ago",
                "author": "GatesAllAround"
            },
            {
                "raw_content": "Told to retire ...",
                "author": "Im_Darryl_Revok"
            },
            {
                "raw_content": "Let’s not shed any tears here. Corporate execs at that level all have golden parachutes. They will still be on payroll for 6 months or a year and not have to work. Also their stock options will vest early and they’ll get paid that too. Some of those folks were there for the 10nm debacle - how in the world they survived this long is beyond me.",
                "author": "jca_ftw"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel XeSS2 now supported by AMD and NVIDIA GPUs",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very cool. Cheers Intel! As a 6900XT owner, I use Xess whenever it's available. The DP4A version got very solid once V1.3 hit. Hopefully more devs implement it.",
                "author": "Neumienu"
            },
            {
                "raw_content": "I like how Intel still support DP4A model. My meteor lake chip gonna love this XeSS2 with FG and LL. Meanwhile Amd give middle finger to their consumer who don't have radeon 9000 series, FSR4 doesn't works at all on their previous GPU including the flagship rx 7000 series.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "Did the DP4A version also improve from 1.3 to 2.0?",
                "author": "Roee_Mashiah2"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel launches Core 5 120 and 120F, rebadged Core i5-12400 SKUs",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "goddamnit intel can you stop trying to refresh lga1700 already",
                "author": "pyr0kid"
            },
            {
                "raw_content": "6 cores, hyperthreading and no E cores, people should be happy",
                "author": "rossfororder"
            },
            {
                "raw_content": "**AM4 has entered the chat**",
                "author": "Weird_JDM_Guy"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Vulkan 1.4.324 Adds Experimental AMD Extension To Help With Ray-Tracing",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this extension only supported by future architectures? Kinda weird.",
                "author": "Dante_77A"
            },
            {
                "raw_content": "FTA > Dense Geometry Format (DGF) is a block-based geometry compression technology developed by AMD, which **will be directly supported by future GPU architectures**. It aims to solve these problems by doing for geometry data what formats like DXT, ETC and ASTC have done for texture data. > Some example results are shown below (**frame times were measured on an AMD Radeon RX7900 XT**):",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "U.S. added just 73,000 jobs in July and numbers for prior months were revised much lower",
        "score": 287,
        "text_content": "Big swing and a miss",
        "comments": [
            {
                "raw_content": "Jesus, those May and June revisions down were massive. I recall everyone scratching their heads when the news came out for each month of all the “job gains”.",
                "author": "Prestigious-Ice-2742"
            },
            {
                "raw_content": "Forget July, that 90% downward revision is 100% data corruption at this point...you only hide data when you know bad it truly is. This ship is going down.",
                "author": "Extension_Degree3533"
            },
            {
                "raw_content": "To all the idiots talking about rate cuts, do you want 3.5%+ inflation again? Unemployment is still historically low as well. Let this bi*ch ride out. No more kicking the can.",
                "author": "Honor_Ingenuity"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing inventory continues climb in July for Seattle area",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Translation: “Home seller bagholders trying to offload their overpriced shitshack onto the next sucker before the monthly carrying costs wipe out their equity gains”",
                "author": "McFatty7"
            },
            {
                "raw_content": "Wait so 2022 wasn't the new normal? pikachushocked.jpeg",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Tech industry is also taking a beating. I dare that jerker sub to post this.",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else struggling to sell?",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In my market any house that isn’t 100 years old or in need of massive repair or massively priced above the rest of the market is selling in a week or less. Condos are sitting longer in high hoa’s Low and no hoa townhomes I’ve kept an eye on in in good school zones are selling in less than 48 hours.",
                "author": "Mdlage"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Cooling Job Market Opens Door to September Cut Despite Inflation Jitters",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nope. Inflationary pressure will keep it steady",
                "author": "bannedaccountnumber4"
            },
            {
                "raw_content": "non-paywall: https://archive.ph/anQRV",
                "author": "SnortingElk"
            },
            {
                "raw_content": "How many times does it need to be repeated that the fed funds rate has no bearing on the mortgage rates lol. Bunch of desperate hoomers trying to will a cut into existence so they can finally stop dating their very aggressive rate is hilarious. Simultaneously still denying the bubble, and yet desperate for some respite from their peak fomo delirium purchase.",
                "author": "whisperwrongwords"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "First-Time Buyers Flock to Older Homes as Starter Homes Age Out",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one is flocking to the market lol",
                "author": "Dry-Requirement-6695"
            },
            {
                "raw_content": "One more thing: they usually don’t have HOAs if they’re (SFH) built before the 1990s. People don’t want to be told what color they can and can’t paint their house, get approval for planting flowers, etc.",
                "author": "mawkx"
            },
            {
                "raw_content": "I always assumed older homes _are_ more expensive cause they are probably built with better materials and are on bigger lots compared to the paper mache that is modern homes. Even things like using old growth lumber vs new growth adds to the strength of those old homes.",
                "author": "BackToTheCottage"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How do people make money on STR in 2025?",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People buying buy and hold real estate haven't been making money for a while. The ones that say they do are either a) not factoring in things like capex or b) lying.",
                "author": "indyprivatelending"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New York inventory continues multiple year plateau near bottom inventory along with much of the northeast",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "We're getting close, fellas",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/h0281voi4jgf1.png?width=198&format=png&auto=webp&s=89c265527b392977336101db2f2726a5ea5cc4b7",
                "author": "Unethical_Gopher_236"
            },
            {
                "raw_content": "Imagine receiving a blowjob from a remote indian man",
                "author": "lordlestar"
            },
            {
                "raw_content": "https://preview.redd.it/qncmdi08tigf1.png?width=1920&format=png&auto=webp&s=da9256791155a625cfc317bc8bbb22b79df828cc",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropoic has Revoked OpenAI & Staff’s access to the Claude API for T&S violations. OpenAI Researchers respond:",
        "score": 431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm guessing it wasn't \"just a little testing here and there\" and more like large scale probing and prodding.",
                "author": "Spunge14"
            },
            {
                "raw_content": "openai employees were being naughty boys, and just like every other time they got their hand caught in the cookie jar they're acting like a scrappy start up. they control ~1T in enterprise value and are just hiding it in multiple companies.",
                "author": "Healthy_Razzmatazz38"
            },
            {
                "raw_content": "haha, any of them pretending to be honest or doing this for the greater democratic good is halarious.",
                "author": "halkenburgoito"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I don't even know what to title is",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The chances of being molested by a robot is very low but never zero",
                "author": "Vappasaurus"
            },
            {
                "raw_content": "https://preview.redd.it/kc4y8dvf2jgf1.png?width=244&format=png&auto=webp&s=e026591e008104dc27bcb87f333b614a1dc2c485",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Diddy bot.",
                "author": "foxy20031014"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrew Tulloch - The man who turned down 1.5 billion dollars",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mira Murati’s product better be fucking good then",
                "author": "Beeehives"
            },
            {
                "raw_content": "Either him working at Meta when he did was that bad or Mira got this man on lockdown.",
                "author": "141_1337"
            },
            {
                "raw_content": "When you're at a certain level of wealth and have morals I guess.",
                "author": "GravidDusch"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apple believes Ai is as big or bigger than the internet, smartphones, cloud computing and apps",
        "score": 118,
        "text_content": "The executive gathered staff at Apple’s on-campus auditorium Friday in Cupertino, California, telling them that the AI revolution is “as big or bigger” as the internet, smartphones, cloud computing and apps. “Apple must do this. Apple will do this. This is sort of ours to grab,” Cook told employees, according to people aware of the meeting. [https://finance.yahoo.com/news/apple-ceo-tells-staff-ai-205354502.html](https://finance.yahoo.com/news/apple-ceo-tells-staff-ai-205354502.html)",
        "comments": [
            {
                "raw_content": "They’re right. Too bad they’re awful at it",
                "author": "Marv18GOAT"
            },
            {
                "raw_content": "No shit, sherlock",
                "author": "sdnr8"
            },
            {
                "raw_content": "Wow great plan Apple, seems like this plan is like 1-2 years behind every major tech company by now lol",
                "author": "InterviewAdmirable85"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Conversation with artificial woman in augmented reality. Before long, this won't just be a joke video...",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She looks a bit Lara croft from PS1",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "He took the “boobs” slider and dragged it all the way to the right",
                "author": "roger3rd"
            },
            {
                "raw_content": "Argument reality 👍",
                "author": "smartbart80"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "One of the takeaways from The Information's article \"Inside OpenAI’s Rocky Path to GPT-5\": \"GPT-5 will show real improvements over its predecessors, but they won't be comparable to leaps in performance between earlier GPT-branded models\"",
        "score": 293,
        "text_content": "[Summary of the article from another person](https://x.com/kimmonismus/status/1951345548864143517). [Alternative link](https://xcancel.com/kimmonismus/status/1951345548864143517). A tidbit from the article not mentioned above: The base model for both o1 and o3 is GPT-4o.",
        "comments": [
            {
                "raw_content": "The jump from GPT-4 to o3 is roughly as big as the jump from GPT-3 to GPT-4, we just lost the baseline because of all the models in between. Throw a few cents at the API to try GPT-4 again and remember what it felt like.",
                "author": "Sky-kunn"
            },
            {
                "raw_content": "o3 Agent is already more or less what I expected GPT-5 to be back in 2023.",
                "author": "WillingTumbleweed942"
            },
            {
                "raw_content": "Sam said this weeks ago, that people shouldn't expect a great leap going into GPT5 but rather that GPT5 would be categorically better, but not massively so, and the user experience of everything integrated into one model would be *much* better and make a huge difference. Also a reminder that, whatever general model they have internally, is as good as a dedicated thinking maths model was only months ago.",
                "author": "Gubzs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "'What am I falling in love with?' Human-AI relationships are no longer just science fiction",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love getting my news from very large axolotls",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Some people already use [c.ai](http://c.ai) excessively...",
                "author": "ujjwalmu3"
            },
            {
                "raw_content": "Personally in a weird position regarding this. Those who are outright against close relationships with AI see me as an ally. I'm not. Yes, I'm concerned about how it can be abused (e.g. Grok Companions slowly influencing users toward political extremism, corporate data collection of highly intimate information, atrophy of communication skills, etc.), I don't brush this off like some, but I view such concerns as [challenges to overcome, rather than obstacles to be avoided](http://www.chakoteya.net/NextGen/270.htm). Also I'm absurdly picky, hence why I don't find current AI satisfying for this. [This is my goal](https://youtu.be/TDxOUD7AgJk), minus the whole defying us thing.",
                "author": "koeless-dev"
            }
        ],
        "subreddit": "singularity"
    }
]