[
    {
        "post_name": "President Trump beats Gavin Newsom in 9th Circuit en banc case. Trump can federalize California National Guard to support federal immigration efforts.",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take that, hair gel!",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Damn, Gavin's gonna throw a temper tantrum over this. Just let him throw a temper tantrum, honestly. Fuck him. Let him get pissy and mad. It's time he finally got struck back.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Link https://x.com/mrddmia/status/1981184831267754499",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Look at all of the Muslim candidates who are currently running for office in Georgia! Our entire country is being Islamified.",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam needs to be banned and outlawed entirely. The muslims in Dearborn MI are literally having \"Death to America\" chants now. That's a national security threat that needs to be taken very seriously. The country will be in serious trouble if this doesn't get addressed. This needs to be alerted to Trump for him to tackle this shit ASAP. I consider muslims to be the worst of the illegal aliens, worse than the central/south americans, the sub-saharan africans and even the indians. ICE needs to go ballistic on Dearborn and other areas threatened by muslims. And like I said, *ban Islam!* Declare it a dangerous anti-American death cult and ban it.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "We got commies, Islamists, jeets, and tiny hats working together to destroy the West. America is the big prize.",
                "author": "Stolen"
            },
            {
                "raw_content": "Get them all in one place and call in a drone strike",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Portland Police officer says it's unfair for him and other officers to be labeled things like Antifa",
        "score": 230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pension Protection.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "If you want to stop being labeled as a fagtifa, then stop protecting them from federal law, and start assisting in their arrest, and assist ICE with deportations.",
                "author": "BigMikesSwingingCock"
            },
            {
                "raw_content": "Yeah, can they not like, deny an order? They get discharged if they do that I’m guessing? So they’re basically mercenaries with no morals? That’s what he’s trying to justify? “Hey man, don’t talk crap. We’re just trying to put money above humanity. Instead of protecting you, we’re going to take your money and then oppress you further.” #treason",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣🤣",
        "score": 1397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They cry out in pain as they strike you.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "Leftism is, put simply, an inversion of reality.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "To hook n0sed commies, lying is first, second, and third nature.",
                "author": "MAG_n_KAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "STOP recognizing California CDL's",
        "score": 817,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am a long haul driver, and my route is through WA, OR, and CA. They are super strict in California towards drivers like me. I have only ever been pulled over at weigh stations in CA, and my truck has an inspection sticker they update about twice a year. Strict rules for the Episcopalians, no rules for the illegal aliens. All of the West Coast is communist in their treatment of legal vs illegal. They punish the law abiders, and reward the law breakers.",
                "author": "TexasRepublic"
            },
            {
                "raw_content": "# Colombian # Driver's # License",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "Cut-off ALL federal highway funding immediately from all states issuing CDLs to illegals.",
                "author": "Truth_Will_Prevail_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Do you want to get stoned?",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Deport # This # Heathen",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "Every republican in NY is going to have to vote for Cuomo to stop him.",
                "author": "Overtaxed"
            },
            {
                "raw_content": "According to just about every poll, Mamdani has a double digit lead going into the election.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas State Rep Joland Jones (D) just said she wants to wipe out Republicans: “If you hit me in my face, I'm not going to punch you back in your face, I'm going to go across your neck... we need to wipe out every Republican.\"",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get back in the gutter.",
                "author": "rugburnd"
            },
            {
                "raw_content": "\"I'm going to go across your neck.\" WTF? Was she thinking of how a brutha took out poor Iryna on the subway halal-style?",
                "author": "SenorTrumper"
            },
            {
                "raw_content": "The neck is a very specific target in pisslam. The only time I’ve ever heard it mentioned in White culture is “You’re gonna fall and break your neck.” or something similar. Never as a point of slaughter…",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DejaVu all over again! Today, [Oct 22] at the direction of President Trump, the Department of War carried out yet another lethal kinetic strike on a vessel operated by a Designated Terrorist Organization (DTO). [video]",
        "score": 785,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You thought cocaine bear was bad….wait for when heroin tuna and meth whale go on a rampage",
                "author": "Nomad899"
            },
            {
                "raw_content": "I have to ask... How many of these will need to be shot until they can't find anyone to drive one? 20? 100? 500? I'd think the word would spread fast that you will be blown up eventually.",
                "author": "barefootozark"
            },
            {
                "raw_content": "This is what has Democrats mad. Their corrupt cities thrive on the drug smuggling. Similar to why they are mad the border crossings have been stopped, curbing human smuggling.",
                "author": "ridge3z"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And you will lose, because POTUS has the authority to do so, whether you like it or not.",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow Gavin really loves his street shitting state funded drug addicts and violent meth head criminals. Really wants to keep ‘em",
                "author": "PleaseHonk"
            },
            {
                "raw_content": "Blue Governors and Mayors really don't want their residents to know what it's like to live with drastically reduced crime. Otherwise, it'll raise questions as to what their police forces have been doing this whole time, if a Red President can bring down crime that quickly. Or another theory is if that crime goes down too much, maybe they're afraid that DOJ grants might be cut, because then there's no need for anti-crime funding if there's no crime.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I was in San Francisco recently (for work, not my choice of destination). It was the saddest thing I've ever seen. It was filthy. There were homeless people sleeping on the streets in broad daylight. It stank. That city has unique geography and architecture, incredible history, and it's a cesspool. And Oakland, right across the bay, is even worse. Democrats have destroyed what should be one of the most beautiful places in America.",
                "author": "MinnieWhittaker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump EPA is committed to total transparency. I tasked my team at EPA to compile everything we know about contrails and geoengineering",
        "score": 746,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Abolish the IRS and EPA!",
                "author": "BeauHD"
            },
            {
                "raw_content": "I would like to know why the trails in the sky have stopped here in the Southwest ever since the government shutdown [August 27th vs Three days ago](https://imgur.com/a/NRUbH5J)",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115420878291596525",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Timeline: Democrats and ICE",
        "score": 574,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They use ICE to smuggle people in as efficiently as possible",
                "author": "Zskills"
            },
            {
                "raw_content": "They liked ICE when they could use it for their agenda. Now they hate it when Trump uses it to damage their agenda. They consistently contradict their stances and just go where the wind blows for them. This is the case in a lot of situations. They'd want to remove the filibuster when they're the majority, but desperately want it to keep existing when they're the minority. They want the electoral college removed when they win the popular vote, but want it to stay when they lose the popular vote. And they ignore state's rights when they control the federal government, but love state's rights when they don't control the federal government. They just go with whatever gives them the most power.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "21-24 they used ICE to help these people invade. These are not the same!",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nancy Pelosi May Soon Announce Her Retirement",
        "score": 980,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if she drinks this much working, holy hell what down time would look like.",
                "author": "T471"
            },
            {
                "raw_content": "Wonder who’s forcing her. She’s only 85. She’s got like 20 more years left to serve. Barely old. /s lol",
                "author": "CanadianLad"
            },
            {
                "raw_content": "Not a moment too soon (it's years too late).",
                "author": "MinnieWhittaker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Next 'No Kings' Protest To End By 4 P.M. So Everyone Can Get Home In Time For 'Matlock'",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have to stop the mass brainwashing going on in these retirement homes. They will have CNN playing non-stop, or MSNBC or ABC, and then all they hear non-stop is lies and propaganda. It has to be ended.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Maaaaatloooooock!",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Imagine being that old and still a leftist. Nothing more pathetic.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Crowder Goes Over Nationalities of Immigrants to see which pay taxes & which are a burden on taxpayers",
        "score": 1277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turns out \"racism\" is just where pattern recognition meets basic logic.",
                "author": "PM-Melania-feet-pics"
            },
            {
                "raw_content": "Gee, I'm seeing a pattern here. Those who are actually productive and want to assimilate vs those who want to purposely leech, subvert, and destroy other countries.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "In Germany 5.4 million people get welfare: 2.6 million are foreigners 1.9 million are immigrants with German passports 0.9 million are Germans https://files.catbox.moe/vndyrj.jpg",
                "author": "RINO_fatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump Administration is ending immigration judges being allowed to release illegals back into America permanently. ‘Immigration judges can no longer grant bond for immigrants who entered the US without authorization’",
        "score": 1812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "Forty_Five"
            },
            {
                "raw_content": "More incentive to self-deport. Now let's detach the anchor from the babies and, as Tom Homan said, \"Families can be deported together\".",
                "author": "mydogma8yourkarma"
            },
            {
                "raw_content": "Illegals shouldn’t have any rights at all.",
                "author": "deletedandreacted"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For all of those people voting in New Jersey and Virginia for Governor, Attorney General, or any other position, please remember this:",
        "score": 1103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need to turn NJ red!!",
                "author": "PitfallHarry"
            },
            {
                "raw_content": "Gonna be voting for Jack in NJ. We cannot let that nutbag Mikie win.",
                "author": "MikeAlphaBravo"
            },
            {
                "raw_content": "Vote for Winsome Earle-Sears or Virginia will slide like the rest of the Democrats states. Also Me and My brother is voting straight \"R\" in Virginia.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👑 ‘No Kings’ protests made great strides in defeating MAGA once and for all, says Bernie Sanders...",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "D E L U S I O N A L",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "We were defeated by geriatric retards and delusional landwhales. How will we ever recover :-(",
                "author": "Pepe_longcockings"
            },
            {
                "raw_content": "we have been king free for about 250 years already. Leftards coming in and taking credit for other peoples work like a good communist always does",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago principal claims teacher who made sick Charlie Kirk gesture is the victim",
        "score": 1285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can't hate these people enough.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "She's the victim of high cholesterol, I guess.",
                "author": "26magarat"
            },
            {
                "raw_content": "Adam Carolla made a great point: if a 2nd grader chews his grilled cheese into the shape of a gun, everyone in the school goes nuts, the kid is suspended, the police are called, etc... But this stinking wildebeast can celebrate the death of an innocent man by making a gun out of her fingers, then shouting BANG while pointing at her neck... all while teaching elementary school kids, and that's totally fucking fine.",
                "author": "Shakakka99"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: “Treasury Sanctions Major Russian Oil Companies, Calls on Moscow to Immediately Agree to Ceasefire”.",
        "score": 896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I fully expect this to work /s Why would Russia agree to a ceasefire when they are winning, and all it means is the next neocon gets into office and Ukraine/Russian war 3.0 breaks out, except now Ukraine has had time to reinforce again? Ukraine is literally collapsing. The battle of Kherson just started like 2 days ago. This is the largest remaining city of the Donbas region. You expect Russia to stop now when Ukraine is literally unable to hold the lines? China and India are still buying Russian oil... Europe is still buying Russian oil. These sanctions are going to do nothing.",
                "author": "GeneticsGuy"
            },
            {
                "raw_content": "I wish our country would stay out of this.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "JUST GIVE THEM FUCKING UKRAINE! It’s not ours. Turn around, walk away, let them sort it out.",
                "author": "flp999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jack Smith Insists It Was ‘Entirely Proper’ for Him to Spy on Republican Senators",
        "score": 1246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Firing squad.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "It is also entirely proper for Smith to go to prison for impersonating a Special Counsel, considering he was never properly appointed to that office. And any attempt to garner privileged information he gained while not having the authority to do such should be considered for additional charges.",
                "author": "DrowNamedDrizzt"
            },
            {
                "raw_content": "Traitor fatigue",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's almost 2026, and Fujitsu is doing its best to save optical disks - the A77-K3 is a 16-inch 13th-gen Core i5 laptop with a DVD drive",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's nice to have options. I don't really need an optical drive in my laptop, but it is nice they have an offering for the people who still want or need one.",
                "author": "toddestan"
            },
            {
                "raw_content": "Read the news about DVD/BD drive sales soaring in Japan as people prefer to install Win11 from disks. Crazy stuff in 2025.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "Japanese people also use USB flash drives and the internet to install Windows 11.",
                "author": "kjbbbreddd"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Analysis of the Apple M5 SoC: Apple silicon extends its lead over AMD, Intel and Qualcomm",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CB2024 performance is good and precisely consistent: 200 points 1T, 1172 points nT. The gaming benchmarks are missing the M4 for some reason.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "As expected (to most folks), the M5 eats more power than M4. Under Cinebench 2024 load, 1T power draw is up 34% and nT power draw is up 15% vs M4 in the 14\" MBP. **1T power**: M4 = \\~5.2W, M5 = \\~7.0 to \\~7.7W (M5 uses +34% to +48% more power in CB 1T) **nT power**: M4 = \\~24W, M5 = \\~27.5W (M5 uses +15% more power in CB nT) Perf / W is mostly stable because performance also went up. But no one should believe it's \"free\" performance—and why should it be? Clocks went up significantly, only a minor node improvement, and limited IPC gains. If you want faster perf with those limitations → just rip the clocks & eat more power. // Of course, compared to Intel & AMD, Apple remains multiple *generations* ahead in perf + perf / W on 1T and perf-per-core and perf / W on nT. M5 is a smaller design (4P+6E), so it can't compete with the 12-core, 14-core, etc. CPUs, especially at its 27.5W average load. Qualcomm does quite well (expected from their Apple → NUVIA pedigree). As some were confused: Cinebench is ***one*** test. Power draw cannot be compared between different tests: Cinebench, Geekbench, SPEC, Handbrake, etc. are all **different** loads. Each power measurement is only valid for ***that*** test. And certainly, nobody should compare CPU power draw with GPU or full system load (which NBC also tests). // Cinebench 2024 peaks are also quite a bit higher: nT now spikes to 53W (M5) vs 42W (M4) and 1T now spikes to 19W (M5) vs 14W (M4).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Broadcom unveils WiFi 8 chips for access points and clients",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Wi-Fi 8 / IEEE 802.11bn standardization work group is expected to finish late 2028. Make of that as you will.",
                "author": "renrutal"
            },
            {
                "raw_content": "And here I am still trying to get products that support Wifi7",
                "author": "add_more_chili"
            },
            {
                "raw_content": "Wow, this is quite fast in the release cycle right? On 2025-10-06 Draft 1.0 of 802.11bn was published with 61% support. It took 802.11be one and a half year to get to draft 5.0 with 95% support. These are early.",
                "author": "Balance-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google porting all internal workloads to Arm, with help from GenAI",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because most people only read the headline: > Google has revealed it’s ported around 30,000 of its production packages to the Arm architecture and plans to convert them all so it can run workloads on **both its own Axion silicon and x86 processors.**",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Datacenter gets a lot more love (and money), of course, from Google on silicon versus consumer Pixel. Google Axion is 72x Arm Neoverse V2 cores on TSMC N3. It’s about 10% faster than Amazon’s Graviton4 (also Neoverse V2), per some benchmarks from Phoronix: https://www.phoronix.com/review/google-axion-graviton4/4 Arm hasn’t updated Neoverse V in some time. Neoverse V1 - announced Sept 2020 Neoverse V2 - announced Sept 2022 Neoverse V3 - announced Feb 2024 V3 has seen very limited uptake, just a few small dies.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Igor's Lab] Warning: Cooler Master encourages customers in official power supply support to self-destruct their 12V 2×6 connector",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is indeed one hinky cable.",
                "author": "AK-Brian"
            },
            {
                "raw_content": "The older I get, the more I resort to boomer buying habits: Only buy from specialist companies that have a long history of producing these product. Do I think every Seasonic or Corsair power supply is necessarily better than what Asus, Cooler Master & Co. buy from suppliers (which may even be Seasonic) to slap their logo onto it? No, but I know they have a reputation to lose and wouldn't pull crap like that with their flagship products.",
                "author": "constantlymat"
            },
            {
                "raw_content": "It was designed to be assembled. Only afterwards did someone realize that partially disassembling would \"solve\" the inherent design flaw.",
                "author": "callmedaddyshark"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NextSilicon Takes Aim At CPUs And GPUs With “Maverick-2” Dataflow Engine",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*insert silicon ip startup* will drain your VC wallet, check your local listing",
                "author": "Quatro_Leches"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Tesla AI5 Production Split Between Samsung, TSMC; Musk Cites Samsung’s “Advanced Equipment”",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How big of a deal is this for TSMC? Presumably they have customers lined up already.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Evaluating the Infinity Cache in AMD Strix Halo",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd love to know more about the cost differences between larger infinity caches and more external memory bandwidth. Given that the latter affect a lot more components than just the SoC, it's probably a rather complex scenario to model and optimize.",
                "author": "DuranteA"
            },
            {
                "raw_content": "That comment really is interesting thou, how much external bandwidth is required for a TBDR design over AMD's hybrid but mostly immediate mode. He probably doesn't have the adreno notebook anymore to compare though. Especially the resolution scaling side of it.",
                "author": "InformalAd202"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China's YMTC aims for fully local chip production, but can it deliver?",
        "score": 1,
        "text_content": "US export restrictions have hindered shipments from major suppliers such as ASML and Applied Materials. YMTC's Phase II fab, initially designed for a 100,000-wafer monthly output, reportedly reduced production to around 40,000-50,000 wafers as a result. In response, YMTC has deepened its partnerships with domestic suppliers and launched its first pilot line that's fully equipped with Chinese-made tools. DIGITIMES previously reported that this localised line could mark a milestone in China's effort to \"de-Americanise\" its memory manufacturing. Industry sources say YMTC is collaborating with a range of local vendors covering lithography, etching, deposition, and cleaning processes. With Phase III targeting a monthly capacity of nearly 100,000 wafers and production slated for 2026, YMTC's overall capacity could reach 300,000 wafers per month. Analysts expect the expansion to strengthen the company's technological standing and market influence in the NAND flash segment.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Disappointed in the lack of Mario Kart World content since launch",
        "score": 817,
        "text_content": "It feels as though we're overdue, at the bare minimum, some new battle modes, new costumes, an some more quality of life updates. For their flagship launch title I've been disappointed in the support so far, I really thought this was going to be a game that Nintendo made sure had great support from the start.",
        "comments": [
            {
                "raw_content": "Mind you, Mario Kart 8 took about 8 months to get its first DLC. It's only been 4 months. We'll get it in due time.",
                "author": "spicyburntmeatball"
            },
            {
                "raw_content": "Mario Kart World is going to be *the* de facto Mario Kart for next decade - they're not going to blow their DLC load within the first 6 months.",
                "author": "GomaN1717"
            },
            {
                "raw_content": "I remember a ton of people talking about how it’s just a matter of time before they add teen Pauline and other DK Bananza characters to the roster when that game came out. And i always thought that would be very non Nintendo thing to do.",
                "author": "Time_Grape_3952"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 was the best-selling video game hardware in both units and dollars across September and the 2025 year-to-date, video game hardware increased by 24%, Nintendo Switch 2 sales were able to offset the double-digit year-on-year percentage declines seen across PlayStation 5, Xbox Series",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Switch 1 still outselling Xbox 3 to 1",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "I’m so happy with the switch 2 for gaming right now. It’s portable, has great games and a huge switch 1 library. I’m not even touching my ps5 right now and probably won’t for awhile.",
                "author": "OK_Commodor64"
            },
            {
                "raw_content": "Makes sense. The switch 2 is amazing. Only thing it needs is some more updated games... Looking at you Dark Souls Remastered and Arkham Asylum.",
                "author": "montybo2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Plant vs Zombies Is a Complete Mess on Switch 2",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bruh this is a 16 year old simple tower defence game. How did they fuck it up so bad?",
                "author": "Nudist-On-Strike"
            },
            {
                "raw_content": "I preordered it cause I had a $20 gift card and already feel ripped off 🤦🏻‍♂️",
                "author": "LZR0"
            },
            {
                "raw_content": ">\"No one (at the developing team) even tested (the mouse controls)\" Why does this remind me of a company/social media app using AI to approve a feature that ends up not working as intended?",
                "author": "Jedzelex"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo announces free Pikmin 4 update",
        "score": 360,
        "text_content": "[https://www.youtube.com/watch?v=TBtBDFzu9ZA&t=25s](https://www.youtube.com/watch?v=TBtBDFzu9ZA&t=25s)",
        "comments": [
            {
                "raw_content": "Surprised theres no mention of a switch 2 upgrade, not even a res bump. Seems really odd not to given the lack of switch 1 updates to games lately. I guess a free update is a free update but this will hardly get me to go replay the game",
                "author": "cornhorlio"
            },
            {
                "raw_content": "Insane that it’s exclusively a Switch 1 update. No performance or resolution improvement for Switch 2 is just… baffling. New free content is cool. But why not just go the extra little step???",
                "author": "NinBendo1"
            },
            {
                "raw_content": "No switch 2 upgrade 😭😭😭",
                "author": "temporary_location_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can you get a Canari tank top in Legends: Z-A?",
        "score": 41,
        "text_content": "I need this DYN4MO shirt.",
        "comments": [
            {
                "raw_content": "Unfortunately I haven't seen anyone able to get it, it's a big missed opportunity imo. That and a rust syndicate outfit, or just outfits themed around Cafe workers or Nurses. Seems like an easy costume to put onto the player",
                "author": "Ennardsinnards"
            },
            {
                "raw_content": "The clothing is completely lacking and prominently female? Don't get me started on the hair styles.",
                "author": "Puddjles"
            },
            {
                "raw_content": "You will have to steal it from her creepy 45 year old man biggest fan.",
                "author": "sleepinchipmonk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Marvel’s Cosmic Invasion. Out December 1st",
        "score": 60,
        "text_content": "https://youtu.be/itVLfmX3Ts8?si=-kx1hARPKshBeNJo From the makers of the amazing Shredders revenge! Day one purchase for me personally!",
        "comments": [
            {
                "raw_content": "This getting a physical? ![gif](giphy|l4JyX3V0yydvPHNBe)",
                "author": "Martokk78"
            },
            {
                "raw_content": "Looks good. Only 6 weeks away!",
                "author": "MonsieurClouseau"
            },
            {
                "raw_content": "Glad they added the Switch 2 logo to the card at the end; after Absolum’s lack of Switch 2 support, I was worried. The eShop listing is for Switch 2, so looking like a native version that shouldn’t be blurry.",
                "author": "ASATClassico"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "disappointed by the fact that they’re not upgrading the frame rate on S2.. or maybe they are?",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really disappointed that Nintendo stopped providing free updates for their popular Switch exclusive titles after the initial batch. I know it's not necessary, but it would be a really nice gesture and also an incentive to new Switch 2 owners to buy these older games.",
                "author": "Fluid-Employee-7118"
            },
            {
                "raw_content": "Seems weird for a NS2 edition to come later, this is the kind of stuff that you'd expect to be included in it. I will just hope there's visual updates they didn't mention, just like they did with Mario Galaxy.",
                "author": "The-student-"
            },
            {
                "raw_content": "I think we can safely assume the Switch 2 upgrades will come later and cost money of course.",
                "author": "GamingRobioto"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Two Unlisted Nintendo Switch 2 Ads Found Feature New Metroid Prime 4 Gameplay, Including A New Boss",
        "score": 220,
        "text_content": "https://www.youtube.com/watch?v=2MZEWTy9xpk https://www.youtube.com/watch?v=0yz3tTS0xPU would like to thank famiboards user BackwardsCompat for posting The Videos On famiboards https://famiboards.com/threads/metroid-prime-4-beyond-pre-release-discussion-%E2%80%94-the-process-will-be-trusted-dec-4-2025.64/post-2033790 EDIT: also YouTube Short Versions Of The ads https://www.youtube.com/shorts/7KQRw2RJ94w https://www.youtube.com/shorts/vWhzYu-E6h0",
        "comments": [
            {
                "raw_content": "Gosh, it's really hitting me that we're getting Metroid Prime 4 in about six weeks. So pumped for it.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "Wow its almost like they wanted to wait until Pokémon came out before advertising their next games and not some nefarious plot to hide Metroid from people",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "Wait but I thought that switch 2 doesn't do 120fps docked, only handheld",
                "author": "silpeth"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Famitsu/Ryokutya2089: Tales series updates:",
        "score": 258,
        "text_content": "-New Tales game in development but will be a while before it's announced -Remaster project has two titles in development (next remaster title announcing soon) -Xillia 2 remaster still in development -over 70% of Tales sales are overseas [Source](https://xcancel.com/Wario64/status/1980988691599200696?t=umefRwSYuDP-jF5jJgkh5g&s=19)",
        "comments": [
            {
                "raw_content": "> -Remaster project has two titles in development (next remaster title announcing soon) So one is Xillia 2 and the other one is Abyss I guess? Tho there's also the Symphonia sequel that is still from the Wii/PS3 era (tho hardly anyone wants that one).",
                "author": "bad_spot"
            },
            {
                "raw_content": "For those curious about Ryokuta2089's credibility, he's pretty much is flawless. Been following his news for years related to anime and his news is always 100% spot on so this is pretty much a confirmation of those projects.",
                "author": "Turbostrider27"
            },
            {
                "raw_content": "Give me Tales of Destiny Directors Cut Remaster",
                "author": "Chocobodude"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hands-on media day with Hyrule Warriors: Age of Imprisonment, potential news coming soon",
        "score": 212,
        "text_content": "saw this post from a game journalist https://xcancel.com/itmooten/status/1980957459939307575?t=50t-PuYUpsvZcp00UGWu6w&s=19 \"Today I went to the @NintendoNL office for a hands-on with Kirby Air Riders and Hyrule Warriors: Age of Imprisonment. I couldn't resist taking a few snapshots. It's quite a bit of video game history\" there was a hands-on media day for Age of Imprisonment and Kirby Air Riders so maybe we actually will get a trailer or news for AoI tomorrow even with the Kirby direct going on. or at least we'll get stuff soon",
        "comments": [
            {
                "raw_content": "Hopefully we get a demo a couple weeks before launch like last games had",
                "author": "SpookyBread1"
            },
            {
                "raw_content": "“Or news for Aol tomorrow” I suddenly thought it was 1993",
                "author": "Far-Awareness5818"
            },
            {
                "raw_content": "Omg this post was made for me. It’s my most anticipated game of the year. I know that probably seems lame but I’ve literally been playing Hyrule Warriors every day to prepare!",
                "author": "niles_deerqueer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Refinance demand is 81% higher than it was a year ago, thanks to falling mortgage rates",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just IRRRL refinanced from 6.75 to 6, bought the house in 11/2023. The person at title company said that there has hardly been any people refinancing at their office. The break even point with closing costs for doing an IRRRL is maximum 3 years - I don't see the rates getting better anytime soon in my crystal ball so I didn't bother waiting.",
                "author": "VersChorsVers"
            },
            {
                "raw_content": "Just re locked my rate from 7.25% to 6.1% here in NY closed on the house in March of this year",
                "author": "chriztuffa"
            },
            {
                "raw_content": "Who has such a high rate that refinancing at these still high rates is desirable",
                "author": "GreenGardenTarot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Austin, TX Is America’s Strongest Buyer’s Market, With Over Twice as Many Home Sellers as Buyers",
        "score": 136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And it is going to get stronger.",
                "author": "ColorMonochrome"
            },
            {
                "raw_content": "Trust me, it's this way for a reason, and it's going to get stronger for buyers. Austin became a quick pump-and-dump job market. All the Californians that followed Joe Rogan are eating shit right now. Low cost of living equals low pay.",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "Too bad I don’t live in Austin!",
                "author": "NewHope13"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "RIP Zoomtowns",
        "score": 128,
        "text_content": "**Housing Market Shift: Zoomtowns Decline** * Pandemic Boomtowns Falter: Cities like Austin, Tampa, Phoenix, and Atlanta—once hot destinations during the work-from-home migration—are now seeing falling home prices and rising inventory. * Desperate Sellers: The Sun Belt and Mountain West have the highest levels of seller urgency, with frequent price cuts and longer time on market. **Midwest & Northeast Rise** * Stable Demand: Cities like Buffalo, Cleveland, Milwaukee, and Detroit are experiencing tight inventory and rising prices. * Migration Slowdown: These regions are losing fewer residents than before, while the South is gaining fewer newcomers. **Migration & Labor Trends** * Stuck-in-Place Economy: High mortgage rates and job uncertainty are keeping people from moving, disrupting traditional migration patterns. * Builders Overbuilt in the South: A surge in construction during the pandemic has led to oversupply in Sun Belt metros. **Motivated Sellers Index** * High Scores in the South: Counties in Texas, Florida, and Arizona show the most seller desperation. * Low Scores in the North: Sellers in the Midwest and Northeast retain bargaining power. **Outlook** * No Quick Rebound: Without a rise in job mobility or migration, the current housing market divide is likely to persist. * Buyers’ Market in the South: More inventory and price cuts favor buyers. * Sellers’ Market in the North: Limited supply and steady demand keep prices climbing.",
        "comments": [
            {
                "raw_content": "Detroit having low inventory and rising prices??!!",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "Wasnt there a study that said Atlanta is overpriced by 50%?",
                "author": "fwiga"
            },
            {
                "raw_content": "Woo PHX! I'm actually seeing rents go lower for the first time, and the move in specials are poppin! I've seen as low as $799/month for a 2br!",
                "author": "PermanentRoundFile"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sellers Are Getting Ghosted: 15% of Homebuying Contracts Were Canceled in September",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's what happens when buyers come to their senses and realize your \"dream home\" isn't worth the fantasy price tag.",
                "author": "Crash3urn"
            },
            {
                "raw_content": "This article appears to be self-serving on the part of Redfin and its agents. If they did a better job of properly pricing the homes for sale and ensuring the buyers were truly qualified, there would be far less fallout. The story tries to paint the market with facts that don't point any fingers their way.",
                "author": "RiskComprehensive744"
            },
            {
                "raw_content": "Good",
                "author": "TheHoundsRevenge"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Low Mortgage Rates Are Keeping Homeowners in ‘Golden Handcuffs’",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How awful for them!",
                "author": "slifm"
            },
            {
                "raw_content": "How is this still a story. It’s been three years. Hasn’t changed.",
                "author": "Bagmasterflash"
            },
            {
                "raw_content": "1st world problems",
                "author": "vtown212"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing inventory continues March towards 2019 levels.",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does anyone get tired of the gaslighting by those who run the west through the media, the modern monetary theorists and keynesians, that any sort of price decline is bad, and high inventory is bad, and that we should be celebrating perpetual higher prices and so-called \"growth?\" I get they need to prop up their pyramid scheme unfunded liabilities with more money printing and immigrants, but it seems like the system is designed to benefit financial speculators and the top 10% at this point, or perhaps it always has, except for that small period of time after world war 2 in the US when home price to income ratios were at their best in the evolutionary history of our species.",
                "author": "PutridFlatulence"
            },
            {
                "raw_content": "I predict that listings will explode in the spring. I had pointed out in another thread that inventory is climbing at a time of year when it is typically dwindling. I keep seeing new listings daily in my neck of the woods and it’s almost November.",
                "author": "SupermarketIll5017"
            },
            {
                "raw_content": "Wow, single family home inventory still remain below 2019 levels by around 15% and around 40% below 2015 levels? eek.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower mortgage rates extend housing momentum into fall",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zillow article? Fake news.",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "Buyers and sellers remained unseasonably active, bouncing back after an August lull * The number of buyers markets more than doubled, rising from six to 15 over the past year. * New listings from sellers rose 3% annually, emerging from a 3% annual decline in August. * Buyers have 14% more options to choose from compared to a year ago. SEATTLE, Oct. 20, 2025 -- A September dip in mortgage rates paired with a stock market bump gave a boost to what is traditionally the start of the slow season in real estate. The latest market report1 from Zillow shows activity from sellers and buyers is unseasonably resilient after a lackluster August. \"September's market showed surprising stamina,\" said Kara Ng, senior economist at Zillow. \"Typically, both buyers and sellers step back this time of year, but lower mortgage rates and stock market highs provided a second wind heading into fall. This time of year can be a sweet spot for buyers. There's often less competition than in the spring and more time to make sure the home's a perfect fit. Sellers who stay in the market into the holidays may be more open to negotiating.\" Unexpected showing of sellers in September More homeowners decided to list their properties in September after a particularly slow August. New listings, which were down 3% year over year in August, rebounded to show 3% annual growth in September. Typically, new listings drop off sharply heading into fall — they've fallen an average of 9% in September over the past seven years — making this year's mere 2% drop exceptional. Buyers also remained active in September. Pending sales fell 5.4% from August to September, a smaller drop than is typical for this time of year and less than half the usual monthly decline in September. Total inventory fell 1% from August to September, but is up 14% from last year. Buyer's markets more than double as competition eases A year ago, six of the nation's 50 largest metros were buyer's markets; this September, buyers have the edge in 15 metros. Zillow's market heat index shows the strongest buyer's markets are Miami, New Orleans, Austin, Jacksonville and Indianapolis. That's due, in large part, to a surge of new construction in most of those areas in recent years. The hottest markets for sellers are in the Northeast and Bay Area: Buffalo, Hartford, San Jose, San Francisco and New York — places where builders face some of the most stringent land use restrictions. Fall outlook for buyers & sellers Fall can be a sweet spot for buyers, with lower competition than in the spring and more homes for sale than later in the year. Sellers who don't sell by the holidays may be more open to negotiating concessions on price, closing costs and mortgage rate buydowns. Sellers, meanwhile, should present their listings in the best possible light to help them stand out to buyers. Home sellers in a buyers or neutral market should be prepared for buyers asking for concessions on closing costs and rate buydowns.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google is really pushing the frontier",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got roasted on this subreddit three months ago for saying that OpenAI's browser would be a chromium wrapper.",
                "author": "CallMePyro"
            },
            {
                "raw_content": "Google is really pushing the frontier",
                "author": "UtopistDreamer"
            },
            {
                "raw_content": "This is like the 100th time they have achieved quantum supremacy 🙄",
                "author": "LineDry6607"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google breakthrough in using Quantum computing for drug discovery and material science",
        "score": 1199,
        "text_content": "https://blog.google/technology/research/quantum-echoes-willow-verifiable-quantum-advantage/",
        "comments": [
            {
                "raw_content": "[https://quantumai.google/roadmap](https://quantumai.google/roadmap) Milestone 1 in 2019, Milestone 2 in 2023, still working on 3. When can we expect Milestone 6 to be reached? Any knowledgeable people about this? I have no idea if the harder part is behind or ahead.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "Everything is going just as I planned",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "Does it have an MCP server 🤣",
                "author": "ai-christianson"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Humanoid goalkeeper (Fully autonomous & real-time)",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Robot sports are going to be so fun.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Motherfuckers will show the robots do anything but actually doing work. I'm not about to outsource playing ball to a robot, I want it to clean my shoes after I'm back from playing ball.",
                "author": "Ormusn2o"
            },
            {
                "raw_content": "does that mean I no longer have to be the weird kid playing by myself at recess anymore?",
                "author": "TinySmolCat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 Pro scores 61.6% on SimpleBench",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolutely shocking that Gemini 2.5 Pro is still #1. The amount of compute GPT-5 Pro is using is insane yet it's still unable to overtake Gemini 2.5 Pro.",
                "author": "Neurogence"
            },
            {
                "raw_content": "Human Baseline is the best AI!",
                "author": "Sure_Watercress_6053"
            },
            {
                "raw_content": "Is there a Pro (high)?",
                "author": "williamtkelley"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Méta introduces Continuous Learning via Sparse Memory Finetuning: A new method that uses Sparse Attention to Finetune only knowledge specific Parameters pertaining to the input, leading to much less memory loss than standard Finetuning, with all it's knowledge storing capability",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ignore title mistakes, autocorrect lol https://arxiv.org/abs/2510.15103 \"Modern language models are powerful, but typically static after deployment. A major obstacle to building models that continually learn over time is catastrophic forgetting, where updating on new data erases previously acquired capabilities. Motivated by the intuition that mitigating forgetting is challenging because trainable parameters are shared across all tasks, we investigate whether sparse parameter updates can enable learning without catastrophic forgetting. We introduce sparse memory finetuning, leveraging memory layer models (Berges et al., 2024), which are sparsely updated by design. By updating only the memory slots that are highly activated by a new piece of knowledge relative to usage on pretraining data, we reduce interference between new knowledge and the model's existing capabilities. We evaluate learning and forgetting compared to full finetuning and parameter-efficient finetuning with LoRA on two question answering tasks. We find that sparse memory finetuning learns new knowledge while exhibiting substantially less forgetting: while NaturalQuestions F1 drops by 89% after full finetuning on new facts and 71% with LoRA, sparse memory finetuning yields only an 11% drop with the same level of new knowledge acquisition. Our results suggest sparsity in memory layers offers a promising path toward continual learning in large language models.\"",
                "author": "New_Equinox"
            },
            {
                "raw_content": "Seems like a big deal. Im no ML scientist but I do think that subdividing models into specialized cores that can be updated independently is a necessary step to reach AGI. It allows for better organization and I think generalization as each component offers elements that are re-combined through the interactions across the cores. It also limits irrelevant knowledge from tainting the process. Lots of interesting potential dynamics at work here from a cognitive structure standpoint. Having a model that personalizes itself to you with memory that is deeply woven into the parameters and neural structures/layers could overcome the need to feed a model context over and over, and from having old context corrupting new information. Layering some Bayesian surprise mechanism into this and some of the cool evolutionary algorithm ideas could produce something really special and adaptive. Imagine a model ecosystem where each scientist has a unique model that captures some elements of their own cognitive process and intuition. These models could then collaborate virtually to bounce ideas back and forth with other scientists across specialities. The peer-review of an ecosystem of divergent models would be more powerful than some single fine tuned \"grader\" fork of GPT 5 or Gemini 2.5.",
                "author": "avilacjf"
            },
            {
                "raw_content": "more and more FAIRwell apparently",
                "author": "galambalazs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "thinking about Honda ASIMO rn 🥀",
        "score": 430,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What are you doing now, Japan!? Develope some damn robots like we expected you too. Japan is up there in industrial robot manufacturing, but none of the modern humanoid robotics companies are Japanese.",
                "author": "BadMuthaSchmucka"
            },
            {
                "raw_content": "It's sort of like with the Segway - too early for its times",
                "author": "antagim"
            },
            {
                "raw_content": "https://preview.redd.it/xuk46vjgnowf1.png?width=418&format=png&auto=webp&s=31cd060d5627d59ade59070a2f71bfed47635f3e",
                "author": "f_o_t_a"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "(Meta) The Free Transformer: An improvement to Transformers, adding a Latent Random Variable to the decoder, allowing the model to decide in a hidden state how it guides its output before it predicts the next token. ¦¦ +3% Compute overhead, +30% GSM8K, +35% MBPP and +40% HumanEval+ on a 1.5B Model.",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://arxiv.org/html/2510.17558v1 \"Abstract We propose an extension of the decoder Transformer that conditions its generative process on random latent variables which are learned without supervision thanks to a variational procedure. Experimental evaluations show that allowing such a conditioning translates into substantial improvements on downstream tasks.\" \" Conclusion The Free Transformer is a direct extension of a standard decoder Transformer, with the abstract structure of a conditional VAE. It is implemented with a single additional non-causal Transformer block and requires a few percent of computational and memory usage overhead. Its structure makes it able to learn latent random variables unsupervised, and to condition its generative process on them. In some ways, this approach aims at achieving in latent space with an autoencoder what reasoning models do with chains-of-thought in token space and an RL procedure (DeepSeek-AI et al., 2025). A combination of the two is, of course, promising. The performance boost without tuning the optimization hyperparameters across multiple benchmarks and two sizes of models, is a strong signal that the overall approach actually improves the inductive bias of the vanilla Transformer. Many properties and design choices should be explored. The performance curves during training are often unstable, possibly due to the coupling of the optimization of the encoder and the decoder, and using different optimization methods could be fruitful. The random embedding itself could take many forms, and the one used in our implementation is arbitrary. Finally, the behavior in larger scales, both in parameter count and dataset size, remains to be investigated\"",
                "author": "New_Equinox"
            },
            {
                "raw_content": "Wait, isn't FAIR the department at Meta which is facing layoffs as of today? Is this timing just a coincidence, or am I missing something?",
                "author": "WileCoyote29"
            },
            {
                "raw_content": "\"achieving in latent space with an autoencoder what reasoning models do with chains-of-thought in token space\" ... Unsurprising that the loosing team would turn to latent space reasoning. https://preview.redd.it/vye229gcoqwf1.png?width=736&format=png&auto=webp&s=37ff990a9c131ccf43d0bf3ac5492b85656587d0",
                "author": "Kitchen-Research-422"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AheadForm unveils their new male humanoid robot face Origin M1",
        "score": 445,
        "text_content": "https://x.com/XRoboHub/status/1980886176845517175",
        "comments": [
            {
                "raw_content": "Does it have to look like the literal ai that broke out in that movie",
                "author": "WhiteHeatBlackLight"
            },
            {
                "raw_content": "Oh r/relationshipadvice gonna go crazy at this",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "I did not have robot twinks on my 2025 bingo card",
                "author": "gizmosticles"
            }
        ],
        "subreddit": "singularity"
    }
]