[
    {
        "post_name": "NOW - Trump issues Oval Office address over Charlie Kirk's assassination: \"This is a dark moment for America.\" - Disclosetv",
        "score": 2316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every American watch this NOW. This is a defining moment for America.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "&#65038; # R.I.P. the GREAT CHARLIE KIRK. &#65038;",
                "author": "BallotsOnRubysUSB"
            },
            {
                "raw_content": "doesn't even seem real hearing it",
                "author": "twentytwentyfourr"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GOOD RIDDANCE: Vile piece of human scum, \"political analyst\" Matthew Dowd, has reportedly been fired by MSNBC for his despicable, unforgivable comments moments after the cold blooded assassination of Charlie Kirk.",
        "score": 1549,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're at the stage where firing isn't enough. It's time to clean the gene pool.",
                "author": "TheChillingEffect"
            },
            {
                "raw_content": "Not good enough.",
                "author": "LiterallyKaiser"
            },
            {
                "raw_content": "What about the whore? Did they fire her dumb ass too?",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RIP Charlie.",
        "score": 1428,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On a day like today, Charlie would be the first person I'd search for to see what he'd have to say as his words were often comforting. I'm at a loss now. Charlie was a genuinely GOOD person, who only wanted what was best for this country.",
                "author": "bck-"
            },
            {
                "raw_content": "Two Presidents they never let us have, because if they did, they would've rightly been destroyed: President Patton and President Kirk. Rest in Peace, President Kirk. You will be avenged.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "We all hoped to live in interesting times. This was a switch on the track of destiny. Millions of young men saw a potential role model. A loving husband and father, who through calm but firm debate tried to change the world. Instead, he shot down for his truth. The only lesson they’re going to take from this is that is that there’s no need to debate if violence prevails.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somebody took this baby’s father away from her today because they disagreed with his politics",
        "score": 1278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow as a father with a girl about that age. This one hit me hard",
                "author": "LordCommanderTrump"
            },
            {
                "raw_content": "“Isn’t that the best?! 😀” Charlie was a family man who was murdered simply because he wanted a safe nation for his family to grow up in… We’re all Charlie",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "I can't even stomach it",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Presler is collecting names of the GHOULS celebrating Charlie's murder. Help him make them FAMOUS",
        "score": 2619,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have the best name-collecting gays, don't we folks?",
                "author": "MAGAMAN25"
            },
            {
                "raw_content": "Expose the demons for what they are",
                "author": "HeyBlinkin"
            },
            {
                "raw_content": "“Reddit Lies” is doing the same thing. I uploaded about 16 screenshots.",
                "author": "Krwck1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trump: Charlie’s children will be raised with stories instead of memories, photographs instead of laughter, and silence where their father’s voice should have echoed. Charlie Kirk’s life should serve as a symbolic reminder that compassionate awareness elevates family, love, and country.",
        "score": 1734,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Beautiful and utterly heartbreaking. Our First Lady Poet, writing about our future President, who now rests in Jesus's arms.",
                "author": "TheAftermath"
            },
            {
                "raw_content": "I feel sick for his wife and children. He and his wife should have grown old together, playing with their grandchildren. His children will no longer have a father to protect and raise them. I can't imagine what they're going through. What a nightmare.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "the first paragraph brought me to tears (again)",
                "author": "DeplorableEsq"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Byron Donalds sends a message to all Americans nationwide after the assassination of Charlie Kirk: \"We can't retreat from the crazy left. We can't. If you do, you will turn this country over to them. That's not a provocative statement. That's a statement of fact.\"",
        "score": 1938,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The time of retreat is done. The time of debate is done. Prepare accordingly.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Charlie tried to talk to the left, and they murdered him for it. There is no rhetorical solution here.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "I'm fucking done. I want retribution.",
                "author": "nakedjay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Harris County Assistant District Attorney Kaylee Veltri has been caught mocking the tragic passing of Charlie Kirk, sparking calls for immediate accountability against the Texas prosecutor.",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The democrat party is a terrorist group!",
                "author": "Criss_P_Bacon"
            },
            {
                "raw_content": "Of course, a gordita.",
                "author": "User_XYZ"
            },
            {
                "raw_content": "Attorney here. District attorney is the job you get in Texas when you’re not good enough to work at a big law firm. She went to Thurgood Marshall school of law, one of the worst law schools in America, so she’s objectively stupider than most other practicing lawyers.",
                "author": "BillMitchellsFinger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New York Yankees Hold A Moment Of Silence For Charlie Kirk Before The Game",
        "score": 2054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These last few days are breaking America. I just hope in a good way.",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Well done Yanks. My late grandfather would be proud of his childhood team",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Sportsball has a long way to go to make up for being complicit with all this bullshit But it’s a start",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WARNING ALL PEDES - PATTERN: Watch out for your 'healthcare provider'. Yet another one - \"Shelly Harmon, a nurse at Mercy Hospital (@FollowMercy ) in Oklahoma, made a post celebrating Charlie Kirk's death and wants to start a GoFundMe for the shooter.\"",
        "score": 1552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Should be fired immediately ... report her to the Hospital CEO.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "https://www.charliesmurderers.com/ Website documenting these kind of people",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "I now understand Weimar Germany.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HIS NAME WAS CHARLIE KIRK 🫡",
        "score": 2467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss him owning the libs already bros :'(",
                "author": "Tyscribz"
            },
            {
                "raw_content": "God, I'm breaking down in tears every time I see one of these posts. RIP patriot. I'm hoping this event wakes people the fuck up.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "# DEUS VULT!",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk Inspired a generation",
        "score": 1335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Charlie Kirk Inspired a generation",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "He was effective and they feared him. He was future Presidential material. He was getting to the youth which has historically always been their domain and they couldn't have that. We aren't the hateful Nazis, THEY ARE.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Me and my husband have been crying all day now",
                "author": "MagaMom69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An unbelievable moment on the House floor. Rep. Lauren Boebert requests a moment of prayer for Charlie Kirk. Democrats can be heard shouting \"no!\"",
        "score": 1980,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prayer for a good man makes these demons seethe.",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "This is a fight against demons. Make no mistake this is a spiritual battle for the soul of America.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "They need to be wiped from the face of the earth, every man woman and child. They are evil incarnate. The entire ideology is satanic.",
                "author": "HurtzLocker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pamela Bondi : Charlie was an American hero whose love for God, country, and family guided every step of his life. He was a faithful servant who poured himself into the fight for justice and freedom.",
        "score": 1504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still not arresting any democrats though. Right, Pam?",
                "author": "IslandMan69"
            },
            {
                "raw_content": "Kash made sure to arrest the killer, what’s your plan Pam?",
                "author": "Crlsniper"
            },
            {
                "raw_content": "I'm tired of all the fucking yapping. I want firing squads. I want The Democrats to pay",
                "author": "O_Rev2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tranny posted an insinuation that something would happen to Charlie Kirk.",
        "score": 1809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They made an arrest, so we will find out soon.",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Bitch locked his account. https://x.com/ferntony/status/1965890128821534973 I bet he regrets talking out of his wide ass.",
                "author": "LadyFannyofOmaha"
            },
            {
                "raw_content": "I hope Omar gets vaporized overnight.",
                "author": "AwShitHereWeGoAgain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: The Great, and even Legendary, Charlie Kirk, is dead. No one understood or had the Heart of the Youth in the United States of America better than Charlie. He was loved and admired by ALL, especially me, and now, he is no longer with us.",
        "score": 2222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dear Trump, declare the Democrat Party a terrorist organization.",
                "author": "DontTreadOnLego"
            },
            {
                "raw_content": "Charlie Kirk was the moderate voice of the right. The left isn't prepared for the extreme voice.",
                "author": "Internet_hugs"
            },
            {
                "raw_content": "So what can we do about this? Something has to be done.",
                "author": "Fight_Fight_Fight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kash says shooter has been arrested",
        "score": 1680,
        "text_content": "",
        "comments": [
            {
                "raw_content": "got to be a troon.... just has to be.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "I want a fucking name. Now.",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Good, Utah has the death penalty and allows for a firing squad. Eye for an eye, you fucking piece of shit.",
                "author": "killedmytv"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk dead at 31 after shooting at Utah event, three officials confirm",
        "score": 2351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've never been so angry.",
                "author": "Fight_Fight_Fight"
            },
            {
                "raw_content": "This is so fucked, we can't go on like this with a violent enemy thriving within our own nation.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "# ALL Leftists in the US OWN THIS. - Media - Politicians - Voters",
                "author": "HellNoKameltoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Assassination culture is spreading on the left. . .The left is being whipped into a violent frenzy. Any setback, whether losing an election or losing a court case, justifies a maximally violent response. - Charlie Kirk",
        "score": 2539,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left has largely identified speech they don't like as being literal violence, and so they therefore have concluded that they can act in self defense against it.",
                "author": "Toohershat"
            },
            {
                "raw_content": "Remove CNN/MSDNC licenses immediately. Leftist \"Influencers\" who incite violence get removed. PUNISH AND ARREST CRIMINALS.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "This needs to be seen. Reality needs to set in. The cold war is not so cold. The left has been backed into a corner. They can't gaslight, manipulate, or bully anymore; and they CERTAINLY can't debate the issues directly without being embarrassed. The levers they've used to retain power and influence have all broken, and the only thing they have left is violence and terror. It will get worse before it gets better I WILL NOT SACRIFICE LIBERTY FOR THE SAKE OF PEACE",
                "author": "bananaguard62"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ABC's Aaron Katersky: \"Charlie Kirk was speaking about controversial things, issues of religion, making a connection between being transgender and gun violence when the shot rang out.\"",
        "score": 1354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No shit. Because those are all dangerous hateful terrorist things",
                "author": "SanityGumby"
            },
            {
                "raw_content": "What an odd thing to say.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "They weren't controversial 20 years ago.",
                "author": "Idontevenknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "iPhone 17 Models Include Toggle to Disable Screen Flickering (PWM)",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any idea how this would work at the hardware level?",
                "author": "AWildDragon"
            },
            {
                "raw_content": "i cannot _believe_ they’re actually doing this!! real actual DC dimming given that description. afaik only Asus and Motorola had this implemented at all, the other brands that advertised PWM-free just had high frequency implementations. this is really really great for those sensitive, and it’ll push Android manufacturers to add this too!! the era of smartphone purchase uncertainty is over!!!",
                "author": "elephantnut"
            },
            {
                "raw_content": "Am I the only one that thinks the back looks ugly?",
                "author": "No_Corner805"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple A19 pro - Geekbench CPU Scores",
        "score": 109,
        "text_content": "There’s a few benchmarks out right now, they show the scores ranging around: Single core score: 3500-4000 Multi core Score: 8800-10500 Single Core max frequency seems to be 4.26 GHz. Source: https://browser.geekbench.com/search?q=iphone18 https://browser.geekbench.com/v6/cpu/13747615",
        "comments": [
            {
                "raw_content": "The M5 will use the same core design as the A19 pro. Apple usually clocks their M series chips around 0.5ghz higher, than the A series chips. I’m expecting single core scores around 4200-4600 for the upcoming M5.",
                "author": "Apophis22"
            },
            {
                "raw_content": "That single core score is almost pushing the multi-core output of the Tensor G4. Yeah, I know the comparison is absurd… but holy hell. The sheer gap in engineering is mind blowing. Apple is sprinting while Google’s Tensor team feels like they’re tripping in slow motion. This is probably unrelated but: Google’s not even in the same conversation anymore. They are out here struggling to keep up with heavily sanctioned Huawei. 😂",
                "author": "cryptoneedstodie"
            },
            {
                "raw_content": "I wanna see the m5 in action",
                "author": "LuluButterFive"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ALSEYE W700 Pro White Review - White vest or blender in a snowsuit?",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another generic dual tower cooler? Wish we'd see a little more innovation in the space. I guess there's only so many ways you can put together a heatsink, but I liked the idea of things like the Juishark JK13 or whatever it was. Different form factors that attempt to maximise the utility they get from the space they use.",
                "author": "ClearlyAThrowawai"
            },
            {
                "raw_content": "The prose of the article insinuates this is an attractive cooler for its price, but the thing is hideous and looks cheaper than the chart-topping air coolers that cost 40% less.",
                "author": "Whirblewind"
            },
            {
                "raw_content": "Surprisingly competent, if a bit pricy.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DLSS 4 (TRANSFORMER) > NATIVE",
        "score": 1,
        "text_content": "People here hate DLSS but nowadays it beats Native in image quality, when used on Ultra quality / Quality (maybe Balanced too). Especially DLAA, DLAA is out of heaven..",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is A \"$500\" QD-OLED Worth It? - MSI MAG 273QP X24 Review",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tl;dw No, because you can't get it for $500 and because comparable $530 Alienware AW2725D exists.",
                "author": "No-Improvement-8316"
            },
            {
                "raw_content": "honestly, as someone who spent the money on a nice oled (the samsung sale for 4k240hz one), unless you LOVE dark mode or is watching / playing a lot of HDR content, it is kind of meh given the additional price and durability worries with burn in. I have a 1000 FALD LCD from innocn before the upgrade that is 4k160, and yeah the pure blacks is amazing for dark mode / reading ebooks or playing HDR content that pops out that much better with good motion clarity but is it worth that extra cost to you, esp as the innocn went as low as 430 dollars on a huge sale (torpedoed by tariffs recently so maybe it would come back later?) but has more common 500 dollar sales. i would say that if you are a light mode enjoyer and play games that isnt properly HDR tuned or content that is HDR, then it really isnt as big of a deal I hope that soon there are 200 dollar oleds with say 120 hz or even just 90 hz or hell 60 for people who just wants dark mode and HDR content, I love mine for reading ebooks (in dark mode) and dark mode websites and videos that is HDR mastered, but for gaming I honestly dont know if just oled was worth the upgrade even 240 vs 160.",
                "author": "theholylancer"
            },
            {
                "raw_content": "Contemplating something like this, or the recent 4th gen WOLED in ROG Strix XG27AQWMG Tim reviewed a few weeks ago. But that's supposed to be $699 which is a bit nuts. Gigabyte is actually coming out with a $500 model using the same panel, but using a \"matt\" finish. I really want glossy this time. Which means I'll probably have to wait until Christmas for a cheaper gloss finish with the 4th gen WOLED panels.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Just realized the background colors",
        "score": 1328,
        "text_content": "I’ve been playing Star Wars Outlaws and the colors of background of the intro match the Joy-Con colors. Just realized this, but it’s such a cool touch and attention to detail.",
        "comments": [
            {
                "raw_content": "I noticed the same thing, but apparently it's just a beautiful coincidence, as the same colours are also present on other platforms.",
                "author": "ryuStack"
            },
            {
                "raw_content": "As others have said, it's obviously just a coincidence... But damn it's a visually pleasing one lol",
                "author": "Gawlf85"
            },
            {
                "raw_content": "I'm very certain Fortnite has also did that with the original \"Evie\" skin.",
                "author": "Zebra500mcg"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You all remember when people said this was going to break? Have you seen any actually break?",
        "score": 1769,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Switch 2 Secrets Exhibition (Welcome Tour in other regions) actually directly commented on this! The connector is purposefully a loose connection in the joy-con and designed to flex slightly. If you try and snap the joy-con off whilst connected it will just come off before the connector takes any damage.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "I remember some people tried to break it by ripping the joy-con off in weird ways, but it was designed with that in mind.",
                "author": "mlvisby"
            },
            {
                "raw_content": "I haven’t seen anyone’s Switch 2 but my own.",
                "author": "Nintendo60sWhore"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Direct Is Confirmed To Be Roughly 60 minutes long.",
        "score": 1453,
        "text_content": "https://www.nintendo.com/us/nintendo-direct/9-12-2025/ There for the people that want the official confirmation. A place to discuss the time length",
        "comments": [
            {
                "raw_content": "Same length of the first Switch 2 direct. I don't even know what to expect besides dates.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Given that this should be focused primarily on switch2 games, this should be really really really good.",
                "author": "Shining_Commander"
            },
            {
                "raw_content": "Hoping for a tease for a new Animal Crossing 🤞🏻",
                "author": "Time_Grape_3952"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Direct confirmed! 12/9",
        "score": 1044,
        "text_content": "From the Nintendo Today! App",
        "comments": [
            {
                "raw_content": "First general direct after the release of Switch 2",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Metroid 4 release date I can feel it!!",
                "author": "StrtupJ"
            },
            {
                "raw_content": "The 9/11 direct legacy is dead",
                "author": "Thin_Molasses_2561"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Upcoming Direct has an Australian Age Rating of 15+... that's really it.",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What’s wrong with that? R18+ games are not that common. There are a lot of games that are 18 in Europe or M in North America that only get an MA15+ classification here.",
                "author": "Johntrampoline-"
            },
            {
                "raw_content": "So Mario drops an F bomb or what?",
                "author": "SirQrlBrl"
            },
            {
                "raw_content": "yoshi full on frontal nudity confirmed",
                "author": "geeisntthree"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Please announce this at the direct",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be nice however blizzard will not give us an off-line mode for this game. You should be able to play this game off-line if you choose.",
                "author": "xboxgamerxxx"
            },
            {
                "raw_content": "Nearly 1k hours on D4 on ps5 you better believe I'll be on a switch 2 port day one",
                "author": "Bloodstarvedhunter"
            },
            {
                "raw_content": "Path of Exile 2 I would prefer.",
                "author": "PorgVsPorg"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I decided to try Hollow Knight",
        "score": 170,
        "text_content": "So many people have been talking about Silksong and Hollow Knight, that it's been getting annoying, so i decided to try them myself. I started with Hollow Knight and now i'm obsessed! From the music, the mysterious storyline to the absolutely incredible fight mechanics, everything's simply amazing! (i also got Rune Factory 4 Special and i freaking regret it, slow as hell and the fighting mechanics suck lol)",
        "comments": [
            {
                "raw_content": "Artwork is amazing, top-tier game, and always love a successful indie story. Just a shame I suck at metroidvania difficulties and needing perfect timing on those bosses so don't really enjoy the games as would never get past the 1st boss most likely, lol. But objectively I can see why they are so successful and are great games.",
                "author": "ExoneratedPhoenix"
            },
            {
                "raw_content": "Hollow Knight is such a top tier game. Now you see why we've been feverishly waiting for Silksong since 2019 or whenever it was announced. Enjoy the ride, it's fantastic.",
                "author": "cloudlocke_OG"
            },
            {
                "raw_content": "And when you beat it you won’t have to wait for silksong to release 😂",
                "author": "Real_human27"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 direct bingo card",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m still holding out for YouTube app",
                "author": "anywhoImgoingtobed"
            },
            {
                "raw_content": "I'd except several first party games to get upgrades/switch 2 versions",
                "author": "KaiHavertzhatewatch"
            },
            {
                "raw_content": "god dude, mario kart world better get free updates, not dlc. at that price, it better be free. not buying dlc for that game. if it IS paid it needs to be the biggest thing ever done, like a whole other open world that has better roads and is bigger than the main game all for like $20 or something. that i'd buy, sure. if they're gonna sell a few cups that are completely standalone with no connection at all for $20 i'm gonna scream.",
                "author": "MBPpp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kurakasis suggests that the Mario Movie Sequel will be called Super Mario Galaxy",
        "score": 265,
        "text_content": ">\"world no galaxy yes >🍿🎟️👀\" [source](https://xcancel.com/Kurakasis/status/1965908841796911315)",
        "comments": [
            {
                "raw_content": "It's called Super Mario World",
                "author": "Death_Metalhead101"
            },
            {
                "raw_content": "Calling it Super Mario World is for the best",
                "author": "Placidao"
            },
            {
                "raw_content": "Huh. [According to another leak,](https://www.reddit.com/r/GamingLeaksAndRumours/s/shq2flSkk4) I thought it would be called “Super Mario World.”",
                "author": "MrRedoot55"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nate implies that the Kirby Planet Robobot remaster is delayed into 2026",
        "score": 97,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1965815292665397322](https://xcancel.com/NateTheHate2/status/1965815292665397322)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Why don't we include the quote instead of a vauge clickbaity title \"With Air Riders coming this year... odds favor Robobot slipping to 2026.\" This seems like speculating on his part and not a real leak",
                "author": "profchaos111"
            },
            {
                "raw_content": "Makes sense. Kirby just already had a remaster a couple weeks ago and is getting a new spin off in two months. Three Kirby releases in 1 year feels overkill. Even if he is essentially keeping the lights on at HAL.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo Direct Confirmed for September 12 at 6 AM PT",
        "score": 908,
        "text_content": "https://xcancel.com/Wario64/status/1965755135403188678#m Previous rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/8lwW4SdoNZ",
        "comments": [
            {
                "raw_content": "So they really did skip 9/11 lol",
                "author": "RecordReal123"
            },
            {
                "raw_content": "[60 minutes long](https://x.com/NintendoEurope/status/1965762232962138333)",
                "author": "xHypermega"
            },
            {
                "raw_content": "Switch Force suddenly a credible source lmao. Jokes aside hes been right on two major leaks now. Damn",
                "author": "Gallicah"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce has appeared to tease a system selling Mario game for the upcoming direct.",
        "score": 452,
        "text_content": "**Take this with a grain of salt; he could just be speculating/saying stuff that isn't actually a leak.** Source: [https://xcancel.com/TheSwitchForce/status/1965782433674199051](https://xcancel.com/TheSwitchForce/status/1965782433674199051)",
        "comments": [
            {
                "raw_content": "Finally, Mario is Missing 2!",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I guess, but its 40th anniversary, so I mean we know Mario is gonna be featured on Friday",
                "author": "BehindACorpFireWall"
            },
            {
                "raw_content": "Super Mario Galaxy 3 with as many planets as No Man’s Sky probably",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "hongxing2020: Rtx50 super series delayed.",
        "score": 68,
        "text_content": "https://xcancel.com/hongxing2020/status/1965617136786964877",
        "comments": [
            {
                "raw_content": "Wow, the opposite of what usually happens. I just bought a 5070 ti so I expected that to say that the 5070 Super is coming out tomorrow or something lol",
                "author": "DoNotLookUp3"
            },
            {
                "raw_content": "5090s are easily purchasable at MSRP even online. Looks like Nvidia needs to move more old stock before they debut the same cards with reasonable amounts of vram",
                "author": "ironypoisoning"
            },
            {
                "raw_content": "I guess I’m not regretting my 5080 I got last month…. Well a bit but still",
                "author": "Rudy69"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Legacy of Kain: Defiance is hitting PS5 and PS4 as part of the PlayStation Plus Classics Catalog on September 16",
        "score": 149,
        "text_content": "[Source](https://xcancel.com/gematsu/status/1965783004573548835?t=MCyQrPLppKqyBjee7Av23A&s=19)",
        "comments": [
            {
                "raw_content": "I got so excited thinking this was a remaster ala 1&2, damn...still good though, I would really love for this series to come back with proper funding and TLC",
                "author": "FARTING_1N_REVERSE"
            },
            {
                "raw_content": "I was hoping for a remaster if only to give Aspyr an excuse to change some of those fixed camera perspectives because they got in the way of platforming like a lot.",
                "author": "WT_FG"
            },
            {
                "raw_content": "Confirmed https://blog.playstation.com/2025/09/10/playstation-plus-game-catalog-for-september-wwe-2k25-persona-5-tactica-green-hell-fate-samurai-remnant-and-more/",
                "author": "Turbostrider27"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Binding of Isaac x Fortnite coming soon",
        "score": 113,
        "text_content": "https://xcancel.com/ShiinaBR/status/1965751597444866375 Full list of cosmetics is: - \"Isaac\" back bling (reactive, cries when taking damage and is excited when opening a chest) - Emote (TV with flies on & around it) - Pickaxe (either Mom's Knife or the Wire Coat Hanger) All items will be available in a bundle. No known release date, but presumably soon since a string for this collab was found in the files.",
        "comments": [
            {
                "raw_content": "I remember seeing someone ask Edmund about a Fortnite collab ages ago and he said they were in talks, kinda wild that it's just materialising now. Also a Wire Coat Hanger as a pickaxe is diabolical",
                "author": "ImAnthlon"
            },
            {
                "raw_content": "No full body naked Isaac skin? What's the point?",
                "author": "ThatGuyinYourCereal"
            },
            {
                "raw_content": "Give us a super jacked Meat Boy skin that fits regular Fortnite proportions like the cover art for some versions of the game",
                "author": "BlastMyLoad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sonic x Fortnite is happening soon. This opens up a possibility for a Persona collab",
        "score": 138,
        "text_content": "https://xcancel.com/ShiinaBR/status/1965755494200725676?t=DZhYxvdThzg9tk44z3KMIA&s=19 There was this leak earlier that said SEGA really wants sonic in Fortnite but there's been some issues with the character skeleton not fitting! If this turns out to be real, then it opens up the possibility for a persona collab! (Which was also previously rumoured to come to Fortnite)",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "Persona? RIP Fortnite. You had a good run. >!There was a time where mobile games that did a collab with Persona stopped service shortly after in a crazy coincidence!<",
                "author": "DokterShemp"
            },
            {
                "raw_content": "He’s going to look worse than original movie Sonic",
                "author": "ButIDigress79"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 3 205, 8-core budget Arrow Lake CPU tested, 48% faster than 14100 in Cinebench R23",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "would be nice if they released H810 motherboards now, or atleast lower tier B860's, the cheapest boards from where I am are still $190+",
                "author": "No_Entrepreneur_495"
            },
            {
                "raw_content": "Honestly a decent deal if only they unlocked it I don't get why intel has to lock half their cpus from overclocking",
                "author": "Educational-Gas-4989"
            },
            {
                "raw_content": "Only downside is that you have to invest in LGA1851, a dead platform Otherwise it's a great deal",
                "author": "Healthy-Doughnut4939"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Sapphire officially launches NITRO B850 and PULSE B850 motherboards globally",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice to have another possible competitor, if they keep going will definitely consider them strongly for my next board, though that likely isn't till AM6.",
                "author": "SagittaryX"
            },
            {
                "raw_content": "I thought that said B580 for a second and got really excited.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Noice",
                "author": "neoravekandi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI sets September 17 launch for B850 MPOWER, announces MPOWER D5 Memory Alliance",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finaly ffs",
                "author": "riba2233"
            },
            {
                "raw_content": "Oh that looks sweet....",
                "author": "None"
            },
            {
                "raw_content": "a day after the rumoured release date of the 9500f",
                "author": "MrBill_-_AlephNull"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "S&P 500 closes at record for second day on inflation data",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stocks aren't going up, dollars are going down.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "10 people lose their jobs and the country starts bitchin for rate cuts. What a bunch of bullsh*t this society is now.",
                "author": "Lojic_team"
            },
            {
                "raw_content": "The S&P 500 reached fresh highs on Wednesday after a reading on wholesale prices unexpectedly declined, a welcome development for investors clamoring for a Federal Reserve rate cut next week to boost the economy. The broad market index finished up 0.3% at 6,532.04, a record close for the index. It had risen about 0.7% at its peak to 6,555.97, scoring a new all-time intraday high as well. The Nasdaq Composite edged up 0.03% to end at 21,886.06, likewise notching a closing high after hitting an all-time intraday high prior to its afternoon pullback. The Dow Jones Industrial Average lost 220.42 points, or 0.48%, to finish at 45,490.92, bogged down by a decline in Apple shares as the latest iPhone announcement failed to impress investors. By the end of the session, most of the up-move was gone, with Oracle and artificial intelligence-linked stocks notching the biggest gains. There were more losers in the S&P 500 than winners. Sentiment was initially higher after the latest producer price index reading showed that wholesale prices fell 0.1% in August. Economists polled by Dow Jones had estimated a 0.3% gain. Core PPI, which excludes food and energy prices, likewise declined 0.1%, while the consensus called for 0.3%. The report serves as a positive sign heading into Thursday’s more closely watched consumer price index reading that inflation in the U.S. economy is cooling. Economists expect the CPI report to show monthly increases of 0.3%, according to Dow Jones. This includes the headline index as well as the core reading that excludes volatile food and energy prices. If this materializes, the annual headline CPI rate would be pushed up to 2.9%, though the core reading is expected to stay unchanged at 3.1%. If the numbers come in around these estimates, the Federal Reserve will have room to deliver another rate cut at its September meeting, according to CFRA Research’s Sam Stovall. Traders currently see a certainty that the Fed will cut by at least a quarter point, per the CME Fedwatch tool based on fed futures trading. They also increased their bets following the PPI data that the central bank could make an even deeper cut to rates of 50 basis points, or a half percentage point. “With the PPI surprising to the downside, with the employment data showing much greater softness than anticipated, that basically says that there could be a reason for the Fed to cut by 50 basis points,” Stovall said to CNBC. “What they want to do is to ensure that they are not going to be too slow, as the president describes Fed Chair Powell, and that they do at least keep up with or get ahead of the overall weakening trend.” “That could, I think, certainly light a fire under the market between now and the end of the year,” the chief investment strategist added.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage demand jumps to the highest level in three years, as interest rates drop sharply",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is .15% a sharp decrease? I dont understand how that small of an adjustment can mean that much more demand",
                "author": "yodog5"
            },
            {
                "raw_content": "I'm tracking 30 Year FHA, VA went from 6.5 to 6.0 in the last two months. I'd think a 10% decrease is pretty sharp like in any other asset class.",
                "author": "Ze_Paradoxial"
            },
            {
                "raw_content": "Anyone seen a 5% on 15 year fixed? Lowest I’ve seen is 5.25%",
                "author": "Electrical-Stick2850"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Cotality: House Prices Increased 1.4% YoY in July",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Florida, Texas, Montana, and Washington D.C. reported negative home price growth.\" As someone living in Texas, let's go! \"**July’s decline in home prices is atypical — the last two periods where we saw monthly declines in July was in 2022 and during 2006-2008 period** — but this year’s decline follows a year of relatively flat home prices and persistent weakness in homebuying demand,” Cotality’s Chief Economist Dr. Selma Hepp explained. I didn't put the sentence above in bold, it was pulled from the article.",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Wholesale prices unexpectedly declined 0.1% in August, as Fed rate decision looms",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well rate cuts are pretty much set up on a tee for the Fed at this point. Hopefully prices are high enough that it doesn’t cause another big increase in prices.",
                "author": "G0B1GR3D"
            },
            {
                "raw_content": "Do we really trust economic data coming out of this administration?",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "soft landing in action",
                "author": "Fullmetalx117"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Legal technology expert's reaction to realizing GPT-4 could replace his professional writing",
        "score": 555,
        "text_content": "Legal technology expert Richard Susskind describes his experience testing ChatGPT initially, then trying GPT-4 six months later and the moment he realized it could genuinely replace his professional writing.",
        "comments": [
            {
                "raw_content": "\"The market will show no loyalty to our traditional ways of working if AI systems can produce an outcome, an output that is quicker, cheaper, better...\"",
                "author": "Dizzy-Ease4193"
            },
            {
                "raw_content": "I watched a similar talk in person by Garry Kasparov 10 years ago about how he experienced the chess match against IBMs Deep Blue",
                "author": "CommercialComputer15"
            },
            {
                "raw_content": "Not everyone has the ability to pay a lawyer $200-350/hr. As “unwise” as it may be, it’s the reality of each individuals situation. When i say “appear in court,” that doesn’t just mean the physical presence. You “appear in court” anytime you file something into the court.",
                "author": "GlitchInTheMatrix5"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Oracle, OpenAI Sign $300B Cloud Deal; Twice previous estimates, now 66% of Oracle's future revenue",
        "score": 240,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|UDGKJdRBbLmGA)",
                "author": "FarrisAT"
            },
            {
                "raw_content": "OpenAI's investors must be giving it some serious spending money.",
                "author": "ezjakes"
            },
            {
                "raw_content": "How is OpenAI going to pay $300B for anything when their entire annual revenue is $12B ? I'm guessing this whole circus will come crashing down hard sooner or later.",
                "author": "Loud_Cream_4306"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ByteDance claims Seedream 4.0 beats Google's \"nano banana\" on aesthetics and alignment",
        "score": 271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With every new model you have to wait for the hype to die down before seeing how it really measures up in real world application.",
                "author": "Legitimate-Bug-964"
            },
            {
                "raw_content": "nano banana is on another level for consistency. From my tests, SeedDream relies on a text description of the reference image by an llm, nano banana imports the image natively. If you ask nano banana to change the expression of a human, you will get that same exact human with the new expression. I have not seen this in SeedDream.",
                "author": "plan17b"
            },
            {
                "raw_content": "It either comes close or beats nano banana at everything but text, in my experience, where google still wins. Seedream images look more true to life, less of that plastic AI \"sheen\".",
                "author": "jakegh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI is not just ending entry-level jobs. It's the end of the career ladder as we know it",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and here I am looking for a fucking job .",
                "author": "Glass_Philosophy6941"
            },
            {
                "raw_content": "\"It's not just X, it's Y!\" - sounds like the article was written by AI.",
                "author": "Karegohan_and_Kameha"
            },
            {
                "raw_content": "When no one has money to buy things these companies are going to collapse like a house of cards. The shortsightedness of this is shocking.",
                "author": "Grydian"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam being questioned by Tucker on the death of one of their employees turned whistleblower",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sam handled being accused of murder in an interview really well lol. Tucker is such a little weasel and I’m glad Sam called out exactly what he was doing immediately",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Crazy that the tweet replies think Sam committed murder. I think Sam is a shady individual but I do not believe he's a murderer.",
                "author": "Formal_Drop526"
            },
            {
                "raw_content": "Well that was weird.",
                "author": "Substantial_Yam7305"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The FBI spied on science fiction author Vernor Vinge (who coined \"The Singularity\")",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you haven't been spied on by or the victim of FBI psyops have you really done anything with your life?",
                "author": "ShardsOfSalt"
            },
            {
                "raw_content": "The FBI profiles almost everyone who is the CEO or board member of a medium or large company. Not detailed, follow them in unmarked cars kinda surveillance, but open a file, get public and some private data. Why? Just cause. After my dad died, and will read, etc. My uncle told us we should do a FOI request on dad. We got a 150+ page detailed report on everything he ever did in life. From high school to his terminal illness. Some stuff redacted. LIKE why are they interested in him? Our lawyer thought dad probably did some business with someone shady at some point, but we never found out and they wouldn't say.",
                "author": "dachloe"
            },
            {
                "raw_content": "Funny thing is they could just ask me if I wanted a paycheck instead of wasting money spying.",
                "author": "justmeandmyrobot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "PsiQuantum Raises $1 Billion to Build Million-Qubit Scale, Fault-Tolerant Quantum Computers",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI is aiming for economically-focused AI evals that could reshape how we measure model capabilities",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow actually huge? Real world and economic improvements. About damn time",
                "author": "None"
            },
            {
                "raw_content": "I got a feeling that AGI ain’t coming anytime soon lol",
                "author": "TheWordsUndying"
            },
            {
                "raw_content": "My business can’t function without knowing how many of a specific letter are in any given word. We need discerning technologists to focus on what matters - results.",
                "author": "o5mfiHTNsH748KVq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SeeDream 4 turns learned noise into something we mistake for truth",
        "score": 270,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its peculiar how image generation is practically solved now, but for robots slowly and clumsily putting objects from one container to another is still some cutting edge shit.",
                "author": "True-Wasabi-6180"
            },
            {
                "raw_content": "where do you guys access it ?",
                "author": "ExcellentBudget4748"
            },
            {
                "raw_content": "It legit looks beautiful, people can’t really say this is slop.",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    }
]