[
    {
        "post_name": "Ukraine is number 1 in child trafficking",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ukraine has been the child sex trafficking capital of the world since the 90's. What's happened more recently since the war in Ukraine broke is child organ trafficking. We heard of this, it's not new. The most horrendous crimes against humanity in modern day will come out one day. As sick as it is, the time of disclosure is near, and maybe, just maybe losing Greenland is enough for the Dutch to tolerate whatever humanity remains in their knowledge of the crimes against the abused children. We need Greenland, The Dane's don't know how precious that land is, like an innocent child.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "so it's a pedocrat sex toy breeding facility. makes sense now, what all the hubbub is about. evil ain't even hiding anymore",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Russian soldiers came out and said they liberated a \"child farm\" months into the invasion",
                "author": "Dangerous"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The #1 and #2 priorities of the Trump Administration are as follows:",
        "score": 463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yup. Correct me if I’m wrong but deporting illegal aliens was one of the biggest campaign issues of 2024, and that’s how Trump won.",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "Idk, I think he’s been all foreign policy all year.",
                "author": "SCP0073"
            },
            {
                "raw_content": "Who could have imagined letting invaders sack the coffers unchecked would be a problem?",
                "author": "FreedomFlowerDelta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Treasury Secretary Scott Bessent says there are TAPES of Minnesota AG Ellison taking money to stop investigations into Somali Fraud 🔥",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If this is true, I'm looking forward to the prison sentences.",
                "author": "LawyersPlayDota"
            },
            {
                "raw_content": "So fucking arrest him and all the others.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "well, I hope and pray, but ill believe it when I see it.. until then, its just words",
                "author": "DementiaJoseph"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: Just spoke with a guy who owns a small business. Complaining about the fact that that he pays his employees $18-20hr (minimum) but the people who hire illegal aliens pay them $6.50 an hour and hurt his business.",
        "score": 1351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know why it's not a felony to employ illegal aliens.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "He’s about right. The spread is about 20%. Guy makes $20/hr payroll, illegal get $16 tax free, and his employer saves 50% in payroll taxes, work comp, and healthcare.",
                "author": "Choomguy"
            },
            {
                "raw_content": "Hiring cheap foreign labor is only a part of the problem. 1) close borders 2) cant rent or sell property to ppl not legally here (need at least a visa or some paperwork) 3) 0 benefits for illegals 4) deport all illegals you can 5) go after remaining businesses taking advantage of it you cant START with going after business because it doesnt solve the illegal issue, it only hurts Americans. If an illegal can run his business with no paperwork and no license, but you cant, it just makes it so you can only hire illegals. I see this in CA construction where the rules for legals are way stricter than illegals. you have to approach it in the proper order.",
                "author": "fightfightfightx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats... Also Democrats",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "rainbow crosswalks are dangerous because they make police horses chimp out",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Remember \"silence is violence\"? Retarded isn't a strong enough word for the left.",
                "author": "LaPastillaEscarlata"
            },
            {
                "raw_content": "'I am not qualified to define a weapon. I am not an armorer.'",
                "author": "bratt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Investigators are now looking into ILHAN OMAR’S possible involvement in the Minnesota Somali fraud scandal GREAT! Even more of a reason to expel her from Congress, denaturalize and DEPORT 🔥 She is a traitor.",
        "score": 910,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Laser focus is needed here.. focus this and it all unravels.",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "Same old story. All talk, no action.",
                "author": "006rbc"
            },
            {
                "raw_content": "Wake me up when someone, anyone at all, is in handcuffs. 😴",
                "author": "WilliamWallace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They've Gone Looney! Well... Loonier! Chasing Down Armed Federal Agents... To... I Dunno..? Yell At Them?",
        "score": 1080,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine getting paid $20 an hour to be maced in the face",
                "author": "TRUMPWON2020BYALOT"
            },
            {
                "raw_content": "It’s okay he was wearing a mask.",
                "author": "grandfather_nurgle"
            },
            {
                "raw_content": "I love how she starts rubbing it in. Yeah get it in there real good lol",
                "author": "EdBuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BETRAYAL: The Republican majority passed 3 Dem bills tonight for more than $1 billion in spending, most of it on foreign countries. Tim Burchett was 1 of only about 20 Republicans that voted no on all 3. Republicans have to purge the party in primaries.",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will Trump be MAGA and veto this bullshit?",
                "author": "fthecoup"
            },
            {
                "raw_content": "Too bad Republicans refuse to turn out for primaries and special elections.",
                "author": "residue69"
            },
            {
                "raw_content": "Tim Burchett was 1 of only about 20 Republicans that voted no on all 3. Republicans have to purge the party in primaries. https://x.com/WallStreetMav/status/2010912938992050360?s=20",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I never want Americans to pay higher Electricity bills because of Data Centers. Therefore, my Administration is working with major American Technology Companies to secure their commitment to the American People",
        "score": 1303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With all this extra energy generation if anything we should be paying LOWER bills!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "This needs to be done because there will be mounting public outcry against buiding data centers as there already are questions being raised. People would rather not have the jobs they might bring than pay higher utility bills every single month",
                "author": "Diana"
            },
            {
                "raw_content": "Build nuclear power plants everywhere. ALSO STOP TAKING ALL OF THE RAM AND GPUs",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FBI, DOJ, DNI, and CIA are looking at a 10-year government conspiracy case eyeing RICO charges... DEMOCRAT PARTY",
        "score": 746,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TWO WEEKS GUYS!!",
                "author": "Whenagain"
            },
            {
                "raw_content": "After seeing how they handled the Comey case I'm sure they're all losing tons of sleep over this.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Hang by neck until dead.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kody Czerwonka, an LGBTQ activist and founder of Crossroads Montessori School in Illinois, was ARRESTED for allegedly grooming a student. He's now facing felony charges of sexual exploitation of a minor and unlawful sexual conduct with a child.",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kill it",
                "author": "Raetchel"
            },
            {
                "raw_content": "You can throw a rock at a leftist crowd and hit at least 3 pedos/groomers.",
                "author": "DT170x"
            },
            {
                "raw_content": "Groomers gonna groom. Chippers gonna chip.",
                "author": "SWRAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "hmmm",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look at your own picture, dumbass. Rhode Island and Vermont have ID required.",
                "author": "NewBrunswickPatriot"
            },
            {
                "raw_content": "I hate to be that guy, but technically it looks like there are 2 blue states.",
                "author": "allidoiswin"
            },
            {
                "raw_content": "What an odd coincidence",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ultimately responsible",
        "score": 861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The more time which passes between his presidency, the more it becomes apparent how much he royally screwed over our country and the citizens of the country. This guy must truly hate our people.",
                "author": "JBlaze056"
            },
            {
                "raw_content": "Suspect was last seen holding hands with a linebacker while fucking an entire country",
                "author": "Shakakka99"
            },
            {
                "raw_content": "Is there an image that goes with this post? I don't see anything.",
                "author": "freebirdie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A couple liberals find out that assaulting someone has consequences",
        "score": 1973,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I literally signed in to give this a double thumbs up. MOAR!!!!!!!",
                "author": "Farqquard"
            },
            {
                "raw_content": "Liberals are literally retarded.",
                "author": "dontdrinksoy"
            },
            {
                "raw_content": "Holding a loud siren to someone's ear is a threat to serious bodily harm which should be answered with pepper spray or a legal self-defense shooting.",
                "author": "GentleSlayer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Effective immediately, any Country doing business with the Islamic Republic of Iran will pay a Tariff of 25% on any and all business being done with the United States of America. This Order is final and conclusive. Thank you for your attention to this matter!",
        "score": 1473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2 birds one stone, this move will also make it harder for SCOTUS to go against Trump on the tariffs.",
                "author": "TakingCoatsWIN"
            },
            {
                "raw_content": "THE END, faggots",
                "author": "UncleTrumpsBand"
            },
            {
                "raw_content": "I guess that means China and Russia as the big players involved.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "conversation over. Good chat.",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thar she blows! ⛵💨",
                "author": "MythArcana"
            },
            {
                "raw_content": "Queerbeyondbelief...",
                "author": "Bornhere"
            },
            {
                "raw_content": "Shortly after the agent felt endangered, she felt something too. So all is well in feely-land.",
                "author": "Meister_Bockmist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Australian ambassador to the USA, Kevin Rudd, resigning months after Trump tells him \"I don't like you either and probably never will\" Trump found one",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope a dingo eats his cock off.",
                "author": "Porkchop-express"
            },
            {
                "raw_content": "Just so people are clear about who Kevin Rudd is. For 15 years, John Howard was the prime minister of Australia who beat the absolute crap out of Labor at nearly every election. Ultimately, Kevin Rudd ran a populist campaign that was very successful and won the 2007 election practically destroying the Liberal party. However, populists aren't always good at running governments and around a year later the Labor party cabinet voted him out. So his government ran out of steam within a year. This set up Julia Gilliard for prime minister of Australia and at the 2010 election Labors result had crumbled and a hung parliament resulted, meaning none of the majority parties had enough seats to claim victory. It came down to the independents who formed a block and decided to go with Labor after their electorates were promised pork barreling. Liberals promised nothing. Practically nothing good came from 6 years of Labor and just before the 2013 election the Labor party sacked Julia Gilliard and brought back Kevin Rudd who ultimately lost the election. He was known as the great backstabber, because he acted behind the shadows to get Julia Gilliard removed. That's when he became ambassador to the US. He replaced Kim Beasley who was a previous Labor leader who sat through three election defeats against John Howard. Just some minor details. I am leaving out the greatest hero in Australian politics, anyone care to take a guess at who? He ran the best opposition fight against Julia Gilliard through two elections, would be filmed at the beach wearing budgie smugglers.",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "Good riddance to this cunt but he will slime his way somewhere else",
                "author": "Joejoezepp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan calls Elon “one of the dumbest people on earth”",
        "score": 1190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dumb people think using \"literally\" makes them sound intelligent.",
                "author": "26magarat"
            },
            {
                "raw_content": "Lol, iq test time?",
                "author": "DementiaJoseph"
            },
            {
                "raw_content": "According to AI, her district is 59.9% white and 17.1% black. It says 3% of that 17.1% of blacks are Somali. Given the fraud, there's no telling how many times that 3% votes in elections.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Border Commander Greg Bovino reveals in just 3 DAYS in Minnesota, \"we've had well over 20 ASSAULTS on federal officers\" But in RED Louisiana: \"ONE assault in 30 days.\"",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, someone REALLY wants the Somalis to stay put in MN and remain as its colonizers. Saw some South Africans (BRICS member) ranting against ICE agents while pretending to be Americans, on social media.",
                "author": "bleeje"
            },
            {
                "raw_content": "I would assume that is because Minnesota is a third-world shithole with a decent side order of White libtard bluehairs.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Minnesota is enemy territory with enemy combatants supported by the local government both publicly and privately.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMFAO! These DlPSHlTS don't even know if they have filed a lawsuit yet against the Trump admin. Ellison says \"we filed a lawsuit already\" but then his Special Counsel reveals that \"I don't know if we filed quite yet.\"",
        "score": 800,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are all criminal, faggots and will find out about law suits real soon.",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "i'll be very curious to see what their actual arguments are",
                "author": "magaspif"
            },
            {
                "raw_content": "Piggy pack? Freud loves it. Keith Ellison is a communist.",
                "author": "lovemylibs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Qualcomm Snapdragon X2 Plus trades blows with Intel and AMD, but underperforms Apple M4",
        "score": 23,
        "text_content": ">It is worth noting that the benchmarked Snapdragon X2 Plus ran on a reference platform, while testers used commercially available products for the other chips. This is a key caveat, as results can vary widely depending on chip binning, cooling, power limits, SSD speed, memory latency, and installed apps. I will point out that the original X Elite [GB6 benchmarks](https://browser.geekbench.com/v6/cpu/3336908) released by Qualcomm in October 2023 as part of their PR strategy were never reached in any device (on a reference design running Linux no less, X Elite still doesn't support Linux in usable way) GB6 ST: 3,230 GB6 MT: 17,331 One of the higher results for the Samsung Book Edge 4 (which has the top end X Elite SKU) has the [following](https://browser.geekbench.com/v6/cpu/16004300) results: GB6 ST: 2,950 GB6 MT: 15,405 Most X Elite devices score lower than that. And this is a synthetic benchmark that has clear real-world limitations. Try running an x265 (or AV1) 1080p 24 frame encode at a high quality preset level (i.e. \"veryslow\") on a laptop and a desktop with comparable MT scores or running a complex strategy game on an X3D CPU versus another CPU with identical GB6 ST scores.",
        "comments": [
            {
                "raw_content": "Having bought a Ryzen AI Max+ 395 laptop last year, it always pleases me to look at these iGPU graphs. In all honesty, I would consider a Snapdragon X2 Elite device if it came with first-class, out of the box Linux support if it comes in a package as quiet as a Macbook Pro or a Mac Mini.",
                "author": "spaceman_"
            },
            {
                "raw_content": "I wish there was a fanless design with those chips, and I wish Windows on ARM was treated as a first class citizen. I'd buy one of those in a heartbeat. Been looking for an upgrade from M1 but at this point I think I'll just get an M4 Air or wait for the M5 Air. Might have to snatch an M4 now though since the M5 Air might have a significant price hike due to rising cost of several parts.",
                "author": "jacktherippah123"
            },
            {
                "raw_content": "It is worth pointing out that benchmark scores also depend on the TDP of the device, especially for MT tests. For X Elite, they used a 80W QRD, to showcase the max capability of the chip. Non of the OEM devices reached that high, so of course the benchmark scores were less.",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron addresses Crucial exit backlash: 'We are trying to help consumers around the world' — company warns that DRAM drought could last until at least 2028",
        "score": 492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Customers = ai companies. Just be truthful.",
                "author": "Slight_Dark9430"
            },
            {
                "raw_content": "\"we couldn't care less about lesser customers around the world\"",
                "author": "Aleblanco1987"
            },
            {
                "raw_content": ">guys you don't get it, these windfall profits to be made at your expense are just out of our hands. But we are doing our best for the everyman***** -Ram triopoly.",
                "author": "WhoTheHeckKnowsWhy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China’s Innosilicon LPDDR6/5X IP is now shipping to first customers , targets 14.4Gbps",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like it's just the controller rather than the DRAM chips themselves so likely won't have any impact on supply.",
                "author": "Independent_Ad_29"
            },
            {
                "raw_content": "Realistically what's the timeline for LPDDD6 adoption? According to rumours, this year's Dimensity 9600 and Snapdragon 8 Elite G6 will be the first to support it. That's expected, as flagship mobiles are the first adopters of every LPDDR generation. Laptops/PCs will follow afterward. Besides the best LPDDR5X hasn't been deployed in laptops. Panther Lake maxes out at LPDDR5X-9600 for example, and there is LPDDR5X-10700 (Nova Lake perhaps?), and [Samsung also announced a crazy LPDDR5X-12700](https://www.tomshardware.com/pc-components/dram/samsung-extends-lpddr5-to-12-7-gt-s-next-gen-devices-enjoy-a-nice-speed-boost) (beyond the JEDEC spec and treading into LPDDR6 territory).",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Dear China, flood the market and save it from AI plague",
                "author": "Teftell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD “Medusa Point 1” APU for nextgen laptops spotted, featuring 4x Zen6 classic + 4x Zen6 dense config",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Medusa Point keep pointing to RDNA 3.5 class graphics, sometimes described as RDNA 3.5+, and the same 8 CU limit shows up again. Everybody point and laugh",
                "author": "996forever"
            },
            {
                "raw_content": "8 CU RDNA3.5+ less than 16 CU RDNA3.5 in the 890M. Unless there's more $, higher clocks or frankensteined like the the PS5 Pro (IIRC RDNA2+RDNA4 ML/RT), I don't think there'd be any marketing material for gaming performance, ALSO when Nova Lake-H is expected to bump performance with Xe3P. I also get that they have this new strategy with the IOD being it's own thing and adding a Zen6 CCD (that can be borrowed from DC/desktop) for max nT, but CPU competition is already rough with Snapdragon and Apple much less Intel. The only thing I can think of they'd be proud of is a new NPU and well we all know how the market responds to that lol",
                "author": "Noble00_"
            },
            {
                "raw_content": "Why does AMD at 45% marketshare act like intel at 90% marketshare",
                "author": "errdayimshuffln"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASUS quietly pulled its Arc B390-powered Zephyrus G14 from CES after it appeared in Intelâ\u0080\u0099s own demo room [VideoCardz.com]",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "for context, this G14 was the one that gave us [the first ever Geekbench scores for Panther Lake](https://www.reddit.com/r/hardware/comments/1ocaslx/panther_lake_geekbench_leak_its_good/) over on r/hardware",
                "author": "LastChancellor"
            },
            {
                "raw_content": "When I first learned about I was confused why it existed. Not surprised Asus decided to cancel it.",
                "author": "Rollingplasma4"
            },
            {
                "raw_content": "It makes sense, a B390 only G14 kind of defeats the whole purpose of the Zephyrus, even as a base model. Basically brings the GPU performance down to 3060 levels (actually a little worse than that), which is roughly 4 years ago at this point.",
                "author": "steve09089"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Machines & More] Phanteks T30-140 - Is this the BEST 140mm fan?",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love M&M but this thumbnail is nightmare fuel lol",
                "author": "tennisjugador"
            },
            {
                "raw_content": "I was just thinking this week when we’d see the 140mm fan available.",
                "author": "FlatusSurprise"
            },
            {
                "raw_content": "they cost twice as much as what I bought T30-120s a few years ago.",
                "author": "EmilMR"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia’s Vera Rubin Architecture Thrives on Networking",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We are cheering them on while they are forging the very chains Palantir and the like will use to bind us.",
                "author": "Dizzy_Break_2194"
            },
            {
                "raw_content": "Meh, not that exciting apart from the regular networking improvements we have had. Mellanox once again knocking it out of the park, which is somehow not that exciting anymore >None of Nvidia’s host of new chips are specifically dedicated to connect between data centers, termed ‘“scale-across.” But Shainer argues this is the next frontier. “It doesn’t stop here, because we are seeing the demands to increase the number of GPUs in a data center,” he says. “100,000 GPUs is not enough anymore for some workloads, and now we need to connect multiple data centers together.” This however is the most exciting bit. If they can figure out a way make RDMA stable over distances, it would be one of the biggest improvments all data centre around the world would have. Also imo would effectively kill off FC.",
                "author": "tecedu"
            },
            {
                "raw_content": ">The new platform, set to reach customers later this year Something tells me normal people aren't going to buy these.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch Version 21.2.0 is now available",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I knew before the post, I could feel the stability.",
                "author": "JAB1982"
            },
            {
                "raw_content": "Water Buffalo is now standing on five legs",
                "author": "Medd-"
            },
            {
                "raw_content": "What are the patch notes?",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just bought what I truly need on my way to the office",
        "score": 371,
        "text_content": "I don’t own Switch 2 yet, but today I picked this up on my way to the office. Why you ask? I needed motivation to truly remember what I earn money for",
        "comments": [
            {
                "raw_content": "Nice purchase, I hope you can afford a Switch 2 soon, best of luck! 😊 Don't forget a screen protector as well, you won't regret applaying one at once. 👍",
                "author": "Forstmaschine"
            },
            {
                "raw_content": "Just got a switch 2 after no console since ps3 and bought this game as my first one It is f***** perfect",
                "author": "Boonz-Lee"
            },
            {
                "raw_content": "[https://i.imgur.com/MGsSIM7.png](https://i.imgur.com/MGsSIM7.png)",
                "author": "flyingtiger188"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "When the wife takes the TV",
        "score": 44,
        "text_content": "The switch 2 is peak life! Love this console ! Add me yall SW-8400-8561-7623",
        "comments": [
            {
                "raw_content": "*This Nintendo Switch 2 is an Xbox*",
                "author": "tman2damax11"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Stand name?",
                "author": "Veezq"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "High On Life Will Be The First Limited Run Switch 2 Game",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Limited Run lol buy a game today and you might get it in 7 months",
                "author": "Rayonical"
            },
            {
                "raw_content": "Hard pass",
                "author": "c_rorick"
            },
            {
                "raw_content": "Wow they really hand out ‘game of the year’ to everyone these days.",
                "author": "Otherwise-Music-8643"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo is monitoring high RAM prices and tariff impacts very closely, president Shuntaro Furukawa says",
        "score": 314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Our console prices go up so your grandma can share terrible AI art with you on Facebook",
                "author": "slashingkatie"
            },
            {
                "raw_content": "Dang, I’ve been holding off because I didn’t see a point in trading in my OLED yet. Now I feel like I might have to jump on that 25% trade in bonus GS is offering and get a 2…",
                "author": "callmesquid"
            },
            {
                "raw_content": "They priced (and then later increased) for tariffs, and now this? Wow we really are at a generation where user consoles might go for more than when they were new",
                "author": "Urd-ong_Shadong47"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Anyone getting Wizard101 tomorrow? $19.99 includes the first story arc and full cross-play with other consoles",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How similar is this version to the original game that released way back then? Have they made a lot of changes? I'm curious to relive some nostalgia but am wondering if the nostalgia is still there or if this is like RuneScape where you need to specifically seek out the classic version.",
                "author": "BriannaMckinley2442"
            },
            {
                "raw_content": "I think I will get it, I was going to try it out years ago but never did so I'll check it out",
                "author": "Needkoffing"
            },
            {
                "raw_content": "Sucks there's no dedicated Switch 2 version",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nightdive is “confident” System Shock Remake patches on Switch 2 will give players a locked 60fps as the team has “learned a lot” about Nintendo’s new handheld",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's just hope we don't have to wait too long.",
                "author": "--TeaBow--"
            },
            {
                "raw_content": "Promises promises. Learned my lesson after Yokka Replayee fisco.",
                "author": "Chompsky___Honk"
            },
            {
                "raw_content": "Was gonna wait for a physical anyway - guess I’ll keep on waiting !",
                "author": "LittleDeaths27"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Extra Docking Station",
        "score": 27,
        "text_content": "I finally decided to pull the trigger and order an extra dock for my office, and see it’s sold out. Do they restock on the Nintendo website often? I know no one knows for sure, but just curious if anyone’s seen it sold out before and then seen it restocked maybe a few days later. Thanks in advance.",
        "comments": [
            {
                "raw_content": "It's honestly probably kids buying extra docks after Christmas or parents buying them. I'm sure they'll be back in stock but honestly I'm shocked they sold out at $125 lol.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Was looking to just getting an adapter online. Is this not a good idea?",
                "author": "Positive_Soup_1411"
            },
            {
                "raw_content": "I bought one for my home office too. Got it at release. Rarely used it though as I would always just grab the switch 2 from the dock (either dock), bring it to my office and go table top mode. So sold it :/ Mainly because I only ever played brief gaming sessions there. Also when I'd been working in there all day, if I had decent amount of time in the evening, I wanted to be somewhere else and see a different set of walls :)",
                "author": "wezzauk85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil showcase to have more than 1 game",
        "score": 237,
        "text_content": "https://ibb.co/fGYNjtrc “Some of the games” Is this gonna be another multiplayer or the rumored CV remake?",
        "comments": [
            {
                "raw_content": "Yeah at most I can see them dicussing the Switch 2 ports and MAYBE a quick BTS of the new movie. But it’s gonna mostly be about Requiem.",
                "author": "Rickemrobo91"
            },
            {
                "raw_content": "Capcom isn't going to announce CV or any other new RE before RE9 comes out. That would be insane. If they show any other games, it will be past releases ported to new platforms like Switch 2.",
                "author": "guineapigtacosauce"
            },
            {
                "raw_content": "Probably just previous games. Maybe they’ll do a sale.",
                "author": "Dear-Juggernaut-3024"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cache of Deleted Development Data From Canceled Project Apollo Batman Game Found on Game Developer Hard Drive",
        "score": 137,
        "text_content": "A cache of videos and game development documents was recovered for Project Apollo, Monolith's canceled Batman game from around 2010: [https://bsky.app/profile/mrtalida.bsky.social/post/3mcba4da5xk2x](https://bsky.app/profile/mrtalida.bsky.social/post/3mcba4da5xk2x)",
        "comments": [
            {
                "raw_content": "Wasn't this the project that was supposed to use the nemesis system?",
                "author": "GameFrostYT"
            },
            {
                "raw_content": "A Monolith developed Batman game based on the Nolanverse? Well that's pretty interesting. I wonder what caused the project to be scrapped?",
                "author": "Minimum-Can2224"
            },
            {
                "raw_content": "Huh. If real, this is interesting",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Both the Prince of Persia Remake and Black Flag Resynced domains have been updated heavily the past 24 hours",
        "score": 434,
        "text_content": "They seem to have been switching their status from Inactive to Active and then back. Could there be an announcement this week? https://xcancel.com/TheRealZephryss/status/2010732617235378684?s=20",
        "comments": [
            {
                "raw_content": "Isn’t the PoP remake supposed to release this week according to Tom Henderson? Make sense to me if it’s a shadow drop",
                "author": "DonJohnsonFrmMiami"
            },
            {
                "raw_content": "This first blitz of remakes and remasters from Ubisoft seemingly coming in close succession is pretty exciting. I wanna see how all three of these turn out tbh",
                "author": "layth02"
            },
            {
                "raw_content": "![gif](giphy|3o7WIPku0tmvhunqwg)",
                "author": "FransD98"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ninja Theory's Project Mara Shelved, Hellblade 3 is Studio's Next Game",
        "score": 615,
        "text_content": "[**SOURCE**](https://www.altchar.com/game-news/ninja-theorys-project-mara-shelved-hellblade-3-is-studios-next-game-its-claimed-aKJnx5B1VvkQ) Ninja Theory's experimental horror project Project Mara is no longer in active development, with the studio instead focusing on Hellblade 3 as its next title, according to Jez Corden.",
        "comments": [
            {
                "raw_content": "Not that I have a problem with Hellblade 3 being made, but I find that shocking given that Hellblade 2 didn't seem to do well, and Microsoft's increased pressure on studios to overperform.",
                "author": "theblackfool"
            },
            {
                "raw_content": "Although I loved Hellblade 1 & 2 equally, with 3 they really need to make it a full fledged game instead of glorified tech demo.",
                "author": "Rarglar"
            },
            {
                "raw_content": "I haven’t played it but does Hellblade 2 need a sequel? I mean, financially it looks like it wouldn’t be a great idea didnt the game do pretty meh critically and sales wise?",
                "author": "honkymotherfucker1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "High on Life 2 leaked for switch 2",
        "score": 20,
        "text_content": "Here is the Amazon preorder page: [ https://a.co/d/edPbFyr ](https://a.co/d/edPbFyr) Release date: 20.04.2026",
        "comments": [
            {
                "raw_content": "I thought this said half life 2 ngl",
                "author": "TheRealTofuey"
            },
            {
                "raw_content": "Didn't even know it got a second game.",
                "author": "cowabanga_it_is"
            },
            {
                "raw_content": "I dont mean to be rude but isnt this known or am i just being dumb?",
                "author": "dudelovescak3"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite x Adventure Time wave 2 confirmed! (Fionna, Cake, Lemongrab)",
        "score": 36,
        "text_content": "Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/Ezc7wxMKSW https://xcancel.com/i/status/2010789180268560485",
        "comments": [
            {
                "raw_content": "Kind of weird they didnt choose Huntress Wizard since she played a big role in the most recent season and would be recognizable to fans of the original AT",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "Im looking forward to the Regular Show drop",
                "author": "DiaperFluid"
            },
            {
                "raw_content": "Can only hope CSM isn’t too far off, need this ingame. ![gif](giphy|2zGzZQUqdZZM7YQb1m)",
                "author": "aadipie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rent Concessions Are on the Rise in America’s Sunbelt Cities (WSJ)",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/8UVt7 TL;DR Cities like Phoenix overbuilt upscale housing when remote workers started showing up during the pandemic. Now that extra inventory means perks for renters. Quick Summary - Phoenix leads the U.S. in rental concessions, with 54% of properties offering at least one month of free rent amid an oversupply of luxury apartments. - Landlords use concessions like free rent and gift cards to attract tenants and maintain property values, rather than cutting baseline rental prices. - Phoenix’s rents fell 4% annually to a median of $1,350 by the end of 2025, contrasting with a 1.3% national decrease, primarily affecting higher-end units.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I love that people in this thread use this as a reason to build more luxury/Real Estate Investment housing somehow? When actually, this goes against the Supply and Demand arguments that validate building non-stop luxury apartments in all honesty. We see here, on display, that they built housing that, even with high demand, does not meet the actual demand. I would also like to point out, their incentive solution to avoid lowering rent prices and maintain rental prices shows how these businesses do not actually want rent to go down. There are people using this to justify more inappropriate building, but what this data *actually* shows, when you arent trying to enable badly built over priced apartments, is that people dont want what is being built.",
                "author": "treesarealive777"
            },
            {
                "raw_content": ">Landlords use concessions like free rent and gift cards to attract tenants and maintain property values, rather than cutting baseline rental prices. Yeah fuck em. So tired of the absolute nonsense believe that real estate should be treated as a business.",
                "author": "NepheliLouxWarrior"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. housing inventory growth slows to 10% as demand reshapes the 2026 market",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ahh yes. Everyone pulls their houses around now due to lower demand during winter. The slow down cant be attributed to that! No way! /s Wait until spring, the market is going to get nasty. Trump threating to pull out business from owning multiple homes, market uncertainty and overpricing. Definitely not a recipe for oversaturation.",
                "author": "ScarySamsquanch"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Struggling to sell my house in Washington after months on the market",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\> Listed for turn-key price \\> Needs new roof and major plumbing work Gee I wonder why their fixer-upper isn't selling for move-in ready price...",
                "author": "Less-Fondant-3054"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Driverless vans in China are facing all sorts of challenges",
        "score": 5987,
        "text_content": "From r/robotics",
        "comments": [
            {
                "raw_content": "“Good luck everybody else “",
                "author": "stinkyjim88"
            },
            {
                "raw_content": "The vans managed the challenges just fine, sounds like a you-problem for being in the way 😤",
                "author": "Hexdoctor"
            },
            {
                "raw_content": "Delamain!",
                "author": "themodernritual"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepSeek introduces Engram: Memory lookup module for LLMs that will power next-gen models (like V4)",
        "score": 534,
        "text_content": "DeepSeek released a new research module called **Engram,** introduced in the paper “Conditional Memory via Scalable Lookup: A New Axis of Sparsity for Large Language Models”. Engram **adds** a deterministic O(1) lookup style memory using modernized hashed N gram embeddings, offloading **early layer** pattern reconstruction from neural computation. Under iso parameter and iso FLOPs settings, Engram models **show consistent** gains across knowledge, reasoning, code and math tasks, suggesting memory and compute can be decoupled as separate scaling axes. **Paper and code are open source** **Source: DeepSeek** [GitHub/Full Paper](https://github.com/deepseek-ai/Engram/blob/main/Engram_paper.pdf)",
        "comments": [
            {
                "raw_content": "**Short summary** https://preview.redd.it/js1st7ta2zcg1.png?width=1080&format=png&auto=webp&s=c303c9466a31d7900a177b9163914120d370c3ec",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Deepseek goated lab fr.",
                "author": "KeikakuAccelerator"
            },
            {
                "raw_content": "Someone will shout \"it's just lookup\", but this news is solidifying that we will probably get continual learning this year",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Introducing Cowork | Claude | Claude",
        "score": 288,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"hey claude, organize my desktop folders\" *You have reached your weekly maximum.*",
                "author": "iamthewhatt"
            },
            {
                "raw_content": "r/singularity in 2027: \"introducing coworker (preview): claude controls your computer, joins your meetings for you, does site visits using claudebot, doesn't take a shit, doesn't sleep, and keeps learning every day with continual learning.\" and suddenly they don't need you anymore. gradually, then suddenly...",
                "author": "heyhellousername"
            },
            {
                "raw_content": "tldr it's claude code for people who don't know how to open the command line",
                "author": "HarenaVermis"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Shopify CEO uses Claude AI to build Custom MRI Viewer from USB Data",
        "score": 380,
        "text_content": "**Shopify CEO** Tobi Lutke shared how his MRI scans were locked to proprietary Windows software. Using **Claude,** he built a lightweight HTML based MRI viewer directly from the raw USB data, with clearer navigation,automated annotations and it's **One shot** prompt. A concrete example of **LLMs replacing** expensive, specialized software rather than just assisting existing tools. **Source: Tobi X** [Tweet](https://x.com/i/status/2010438500609663110)",
        "comments": [
            {
                "raw_content": "There are plenty of free/open source tools that allows you to view your MRIs and uses machine learning segmentation to identify specific parts of the body. I'm glad people are utilizing them even if they dont realize they are. [I actually just recently released a new open source tool for the spine](https://github.com/NeoNogin/MRI-GPT) that uses similar technology. I believe the one he is using is totalsegmentator or RadFM. Mine is based off of totalspineseg. I made a post about it [here](https://www.reddit.com/r/LocalLLaMA/comments/1q8scwx/i_built_an_opensource_tool_to_analyze_spine_mri/?ref=share&ref_source=link) if anyone is interested to learn more. In a nutshell, mine analyzes the spine, looks for issues, generates a report, then allows you to chat with it using Ollama (Qwen3-VL:8b model recommended).",
                "author": "Erdeem"
            },
            {
                "raw_content": "While this is cool, there are plenty of open source DICOM viewers out there. Still kinda impressive if Claude managed to one shot a working prototype with this UI.",
                "author": "arv66"
            },
            {
                "raw_content": "I'm not familiar with the format of his data but couldn't he just use a DICOM viewer or am I missing something?",
                "author": "Unlikely-Complex3737"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chat, how cooked are we?",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey Google, how do I build an EMP cannon?",
                "author": "ChildOf7Sins"
            },
            {
                "raw_content": "This reminds me of some movie but I forgot what it was",
                "author": "BestRetroGames"
            },
            {
                "raw_content": "Why is everything about teaching them how to fight? Is this a good idea",
                "author": "Griffstergnu"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Nvidia research.",
        "score": 52,
        "text_content": "Updating a models weights as you use it sounds huge. Is this as big of a deal as it seems to be?",
        "comments": [
            {
                "raw_content": "Being able to update a model’s weights in real-time is a huge step towards continual learning, but it doesn’t resolve well-known issues like catastrophic forgetting of old knowledge and misalignment. Thankfully a lot of progress has been made on these fronts in the past year, but I’m not sure if NVIDIA is incorporating any of those developments just yet. In my opinion, the most promising and largely under-appreciated development was Multiverse Computing’s usage of tensor train networks to reduce the parameter count in DeepSeek R1 by roughly 50% and selectively remove Chinese government censorship from its operation. The same technology can also be used to ensure that newly acquired knowledge and skills don’t overwrite the existing training.",
                "author": "FriendlyJewThrowaway"
            },
            {
                "raw_content": "[https://developer.nvidia.com/blog/reimagining-llm-memory-using-context-as-training-data-unlocks-models-that-learn-at-test-time/?ncid=so-twit-111373-vt37&linkId=100000402242985](https://developer.nvidia.com/blog/reimagining-llm-memory-using-context-as-training-data-unlocks-models-that-learn-at-test-time/?ncid=so-twit-111373-vt37&linkId=100000402242985)",
                "author": "foxeroo"
            },
            {
                "raw_content": "Only if it works better than offline models, online models have been a thing for a very long time, they are just too slow and require higher level hardware to be practical.",
                "author": "KFUP"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Former Google CEO funds first private space observatory bigger than Hubble",
        "score": 31,
        "text_content": "**Lazuli** is a 10.2 foot (3.1 meter) space telescope planned for launch by 2029, becoming the first privately funded space observatory. Funded by former Google CEO Eric Schmidt and Wendy Schmidt, Lazuli will have a **light** collecting area about 70 percent larger than Hubble and will **operate** in a stable lunar resonant orbit. It's science goals include **studying** exoplanet atmospheres, supernovae & cosmic expansion, including the Hubble tension. Lazuli is **part** of the Eric and Wendy Schmidt Observatory System, which also includes three **next generation** ground based telescopes announced at the American Astronomical Society meeting. **Source: Schmidt Science/IE**",
        "comments": [
            {
                "raw_content": "What an excellent way to distract from the accusation by his ex-mistress that he raped her and spied on her with hidden cameras while she was naked.",
                "author": "i-Wayfarer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Report: Apple chooses Google's Gemini to run next version of Siri",
        "score": 297,
        "text_content": "**CNBC Report:** Apple is **teaming up** with Google to use Gemini models for an AI-powered Siri. Reports swirled in August that Apple was in early talks the search giant to use a custom Gemini model to power a **new** iteration of Siri. **Google’s market value** surpassed Apple for the first time since 2019 and touched above $4 trillion following the news. **Source: CNBC** [Full Report](https://www.cnbc.com/2026/01/12/apple-google-ai-siri-gemini.html)",
        "comments": [
            {
                "raw_content": "**From Source** https://preview.redd.it/yb9fk4t3vxcg1.jpeg?width=1008&format=pjpg&auto=webp&s=fd9afa03d0abdc06d9cc1047ef4bc6eb435f4c5d",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "I think Gemini models will just be powering Siri features, it will all still be branded as \"Siri\" to consumers without any of Gemini branding. Only people that follow tech will know Gemini is powering these new Siri features. [Google does something similar with Samsung,](https://news.samsung.com/global/samsung-and-google-cloud-join-forces-to-bring-generative-ai-to-samsung-galaxy-s24-series) where Gemini models power \"Galaxy AI\" features.",
                "author": "Gaiden206"
            },
            {
                "raw_content": "If gem is integrated seamlessly in iPhone 18, I’ll finally upgrade",
                "author": "BlandinMotion"
            }
        ],
        "subreddit": "singularity"
    }
]