[
    {
        "post_name": "Alina Habba issues statement after judges try to remove her.",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha! Awesome! 1. Habba resigns as interim US attorney, ahead of a Friday deadline 2. Trump withdraws Habba's nomination to take the job permanently 3. AG Bondi appoints Habba First Assistant US attorney 4. Habba automatically becomes acting US attorney because of the vacancy.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "I like this. She's taking the tack the Democrats do with us. I'm in, now suck it.",
                "author": "airborne3502"
            },
            {
                "raw_content": "These judges are committing treason",
                "author": "Oodles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attention President Trump — You may want to fire your top NSA lawyer.",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is she a stroke victim? What's going on with this photo? Her eyes and face have an unusual level of asymmetry that is nonetheless fairly subtle. What am I seeing here, 'pedes?",
                "author": "sola_scriptura"
            },
            {
                "raw_content": "Is there even a vetting process?",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump, Bondi Outmaneuver Corrupt Judges, Appoint Alina Habba as Acting US Attorney for New Jersey",
        "score": 1451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THIS IS WHAT I VOTED FOR GOD BLESS YOU PRESIDENT TRUMP lex",
                "author": "Lexingtonminuteman75"
            },
            {
                "raw_content": "Time to go Assyrian on em Hubba.",
                "author": "shadypollster"
            },
            {
                "raw_content": "1) Habba resigns as interim US attorney, ahead of a Friday deadline 2) Trump withdraws Habba's nomination to take the job permanently 3) AG Bondi appoints Habba First Assistant US attorney 4) Habba automatically becomes acting US attoreny bc of the vacancy. The reason Trump has to withdraw her nomination is because the Federal Vacancies Reform Act prohibits the nominee for a Senate-confirmed office from holding the post on an \"acting\" basis. https://x.com/kyledcheney/status/1948496804728738187",
                "author": "Repentnow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reporter Matt Taibbi Hints at Big Story: Did the Biden Administration Spy on Trump’s 2024 Campaign Also?",
        "score": 799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All roads lead to Obama...",
                "author": "Moebius"
            },
            {
                "raw_content": "Well they suffered little to no consequences last time, so why not?",
                "author": "keeponwinning"
            },
            {
                "raw_content": "Release the files. Stop with the warm billowing hopeless 🦏 copium retarded bullshit. 🤓",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Planned Parenthood",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left also says it's bad that the Spanish conquered an empire of death cultists.",
                "author": "BasedOnWhat"
            },
            {
                "raw_content": "My penis can detect the onset of cervical cancer.",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "Destroy all their butcher shops.",
                "author": "TruthWillOut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMAO! The White House just framed and hung a copy of the court decision BARRING AP from the press pool on the wall of the briefing room, per @PenguinSix And it’s even SIGNED by President Trump himself! 🤣",
        "score": 1677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmao displaying his trophy head as a warning to all the other presstitutes still in the briefing room",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "# *EMOTIONAL DAMAGE!* This is what I voted for!",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Trump's troll master skill just went up +5! :D",
                "author": "thebeercules"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PUT US IN COACH, WE’RE READY TO PLAY, TODAY",
        "score": 1100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "POTUS or any government should have little or no say on what a private company wants to name their mascots. I do believe we shouldn’t have university sports or professional sports teams in DC though. I also think we shouldn’t have 290k black people living in DC either. Or all the homosexuals. In fact, no one should really live in DC unless you’re an ambassador or a member of scotus or POTUS or congress",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "Make Sports Great Again.",
                "author": "GOTHKING"
            },
            {
                "raw_content": "Link to Ben Garrison cartoon https://gab.com/GrrrGraphics/posts/114909616400691842",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRESIDENT TRUMP:",
        "score": 1065,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's convert some of those awful corn fields to cattle pasture land.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "They banned our beef b/c it is toxic. There is hardly any pasture raised grass finished beef anymore.",
                "author": "Finnigantoflannigan"
            },
            {
                "raw_content": "They better not get a better price than me. A couple of steaks shouldn't cost $50. GROW MORE BEEF!",
                "author": "NoFats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Is @JasmineForUS running this account?",
        "score": 1114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too stupid to understand they are showing a graph that explicitly shows the damage Biden has done.",
                "author": "SanityGumby"
            },
            {
                "raw_content": "End Welfare.",
                "author": "StrongIsland"
            },
            {
                "raw_content": "4 of the them are down from their peak... post Trump's election. These people are retarded. Sadly people don't seem to understand that inflation doesn't \"just go away\"... unless there is deflation. Biden's massive, historic inflation is here to stay.",
                "author": "FREN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“It’s time for America to follow California’s lead.”",
        "score": 650,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You could make the argument California's current state threatens national security, its pretty important militarily and logistically to have a strong west coast",
                "author": "tiamat"
            },
            {
                "raw_content": "No thanks we’ll follow Florida’s lead.",
                "author": "MiniMikeCoomberg"
            },
            {
                "raw_content": "Current wife.",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Cover-Up Begins: Establishment Media Is Going to Fight Tooth and Nail to Bury Obamagate",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why wouldn't they? They were part of the coup.",
                "author": "knnbccb"
            },
            {
                "raw_content": "St. Obama can do no wrong in their eyes, so of course the propaganda outlets will work overtime to bury this story. Watergate is the biggest Presidential scandal of all-time only because the propagandists wanted to dig into a Republican (Nixon didn't do anything that hadn't already been done to him by the Kennedys).",
                "author": "SteelDriver"
            },
            {
                "raw_content": "Find out who's handling them from CIA and FBI...",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump has officially signed the $9 BILLION DOGE rescissions package into law",
        "score": 1667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just make it 900 billion and maybe it will be a start.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Can we get back the Smith-Mundt Act?",
                "author": "CaJuN-Polak"
            },
            {
                "raw_content": "DOGE threw a lot of big numbers of \"wasteful spending\". What does this mean for the tax payer? Can we expect lower taxes? Can we expect some sort of refund/stimulus? I'm guessing the answer is no to both. I'm guessing taxes will continue to go up and the deep state will just shift our tax money to other pet projects that don't benefit us.",
                "author": "LlamasRevenge2004"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What time line am I on!?",
        "score": 454,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did he pull CNN off the air finally? Maybe not, I can still smell them from here.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Good kitty",
                "author": "ShotgunParade69x"
            },
            {
                "raw_content": "OrAnGe CaT bAd!",
                "author": "GuidedDisinfo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WSJ claims Bill Clinton wrote a disturbing birthday letter to Jeffrey Epstein",
        "score": 855,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we didn’t believe it for Trump, why should we believe this?",
                "author": "Viewer01"
            },
            {
                "raw_content": "Trump denied his and is suing. Let's see what Bill Clinton does.",
                "author": "dragonzer"
            },
            {
                "raw_content": "Written in the same style as the person who faked the so called 'Trump Card'...",
                "author": "Moebius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'm happy!",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish he'd piss off Epstein clients more...",
                "author": "barwhack"
            },
            {
                "raw_content": "I want my portion of taxpayer funds back for the Mystical Gold Palace of the Federal Reserve paid out in cash to: MythArcana 3902 Bumfucked Dirt Road, Hades, California 920777",
                "author": "MythArcana"
            },
            {
                "raw_content": "Straight from facebook.",
                "author": "Donger-Lord"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More winning! Trump EPA To Remove \"Greenhouse Gases\" From List Of Dangerous Pollutants",
        "score": 1057,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because all that \"ERMAGERD THE OZONE LAYER IS DISAPPEARING!\" bullshit from when I was a kid in the 80s was horseshit.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Now my wife can’t pull that card on me",
                "author": "Illuminaughty"
            },
            {
                "raw_content": "Imagine believing that CO2 which makes so many veggies and fruit grow in literal greenhouses is a pollutant. The left truly is diabolical in how it labels good things as evil.",
                "author": "MuslimsAreUglyHomos2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Ghislaine Maxwell’s lawyer says she fully cooperated and answered all DOJ questions during today’s interview.",
        "score": 1209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Were any of the questions \"Who were the clients?\"",
                "author": "canadianhere"
            },
            {
                "raw_content": "Did you witness Bill Clinton having illegal sex with a minor? A: Depends on what the meaning of is - is.",
                "author": "rivetjoint2"
            },
            {
                "raw_content": "'Ms Maxwell, are you a Mossad asset?' ''Why yes, I am.' 'That'll be all, ma'am.'",
                "author": "TheAftermath"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald Trump and Hulk Hogan arm wrestling and playing around",
        "score": 1322,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good frens.",
                "author": "airborne3502"
            },
            {
                "raw_content": "two legends",
                "author": "logan34"
            },
            {
                "raw_content": "Alternate angle: https://x.com/HulkHogan/status/1850693494932738278",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It was a Great Honor to tour the Renovation (and some new Construction!) of the Federal Reserve Building... With all of that being said, let’s just get it finished and, even more importantly, LOWER INTEREST RATES!",
        "score": 1002,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the temple of doom what's to celebrate?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Just do away with the fed and reutilize the building somehow.",
                "author": "Websitesdown"
            },
            {
                "raw_content": "What, so does he see the $2.5B as necessary for the work they're doing?",
                "author": "LogicCircuits"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The reunion...",
        "score": 1585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This makes me less sad",
                "author": "Illuminaughty"
            },
            {
                "raw_content": "I never got into wrestling so I associate Andre the Giant with Princess Bride.",
                "author": "Tele_Plus"
            },
            {
                "raw_content": "I miss Hot Rod the most, I think. R.I.P. Da Maniac. Hope you have your sunglasses",
                "author": "ohwell316"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US chipmaking nears death: Intel warns it may give up on cutting-edge chips",
        "score": 541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What happened to all those new ASML machines Intel bought. Are they not going be used or something?",
                "author": "roniadotnet"
            },
            {
                "raw_content": "So TSMC will be all but a monopoly. Great",
                "author": "Asleeper135"
            },
            {
                "raw_content": "So much for the CHIPS Act.",
                "author": "slickyeat"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CEO Letter to Employees",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Key points: * Q2 2025 revenue above guidance * 15% headcount reduction to 75,000 * 50% streamlining of management layers * Return to office in September * Foundry to be customer responsive, projects in Germany/Poland halted * 18A ramping to scale, * 14A to meet requirements of internal and external customers* * SMT to return to the roadmap * Refocus AI strategy to inference and agentic AI",
                "author": "ryanvsrobots"
            },
            {
                "raw_content": "only shareholders matter, the real customers...everyone buying our products are cow to farmed",
                "author": "nbiscuitz"
            },
            {
                "raw_content": "\"In data center, we are focused on regaining share as we ramp Granite Rapids while also improving our capabilities for hyperscale workloads. To support this, we are reintroducing simultaneous multi-threading (SMT). Moving away from SMT put us at a competitive disadvantage. Bringing it back will help us close performance gaps.\" This is BIG. Intel is now reversing course on eliminating SMT. It will likely be too late for Nova Lake, but I expect maybe Razar Lake and definanty Titan Lake to reintroduce SMT Razar Lake: Griffin Cove + Golden Eagle Titan Lake: Unified Core",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel beats on revenue, slashes foundry investments as CEO says ‘no more blank checks’",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some interesting points IMO (from the earnings, not from this article specifically) : * coral rapids in 28', or 29', and evaluating the future of this line. They don't think they will be competitive till then either. DMR is not enough to reach parity it seems like. * SMT back to DC. Too late for DMR I suspect, so DMR next, prob in 28 using Intel's usual 2 year cadence * no external customers, no 14a. Maybe they do have a tiny amount of volume for internal, but Intel says they are willing to pause it even if external customers don't come. * 14A has an initial product being planned for it * CCG margins tanking, server margins slowly going back up. * CCG margins struggling due to LNL, LNL ramp expected to be even better in Q3 (AI PC boom?) * Intel has \\~55% of server market. Prob including ARM in this calculation IMO. * NVL \"end of 2026\" * 18A used in the next 3 generations of intel products. * 14A same timeline as TSMC A14 (28, 29'). Seems likely they remain around a node behind. * 18A missed first wave of external customers, may be used in future waves",
                "author": "Geddagod"
            },
            {
                "raw_content": "Intels strength is ownership of their own foundaries, without that they wouldn’t even be at 50% of data centre Slashing investment in the future may make Wall Street happy but won’t be good for Intel long term. Yet again",
                "author": "mdvle"
            },
            {
                "raw_content": "Earnings looking a bit rough tho",
                "author": "TheSnekGod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What’s the latest Pixar movie a 5090 could render in real time?",
        "score": 122,
        "text_content": "I had an earlier discussion about a different card running the original Toy Story in real time, I feel like Cars would be the limit. this is more to discuss how hardware has grown in power over time, the original Toy Story needed a giant dedicated space full of PCs to render all those frames and now it can be done in real time on a mid end PC. whats the farthest we can go currently.",
        "comments": [
            {
                "raw_content": "There are two questions here: Can a 5090 render it on the original engine? You could probably get a pretty accurate answer by just comparing flops, and a single card would not get very far. Could a 5090 render something visually indistinguishable on a real time renderer with modern techniques? Much more likely.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "This is an interesting question but it mostly depends on how accurate they want the lighting and physics simulations to be. For example, we can render hair much more quickly now, but a lot of GPU acceleration tools are more “approximate” than they might like. If they use new simulators and renderers that aren’t as deterministic, is it the same movie?",
                "author": "octagonaldrop6"
            },
            {
                "raw_content": "Renderman is extremely compute heavy, so likely no pixar movie can be rendered in real time with a 5090. Let take the original Toy Story, for example. It took 7hrs per frame to render. The render farm used 120 SparcStation 20s. Which had a top performance on its highest SKU of \\~400MFLOPs. So for the entire farm, you would get a compound performance of \\~50GFLOPs A single 5090 has around 105 TFLOPs. So it is around 3000 times faster than the PIXAR render farm. Since each frame took the renderfarm 25000 seconds to render. A 5090 would take around \\~8 seconds to render each frame. Still impressive that you could, in theory, render Toy Story in half a day (\\~14 hrs) for a couple thousand dollars and less than 1KW. While the original system likely took a few orders of magnitude more on each of those dimensions.",
                "author": "xternocleidomastoide"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First AMD Strix Halo handheld gaming PC confirmed — GPD teases Ryzen AI Max+ 395 handheld in performance video",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Black Myth: Wukong runs from between 170 and 212fps Yes > 'CPU Power' varies between 55W and 58W No",
                "author": "ChickenCake248"
            },
            {
                "raw_content": "That thing is gonna have like 3 minutes of battery when gaming",
                "author": "KnownDairyAcolyte"
            },
            {
                "raw_content": "The sweat spot for this chip is 60w. That's too high for a handheld.",
                "author": "conquer69"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A New CPU Breakthrough Promising 100x Efficiency",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't get where the efficiency is supposed to come from. Carefully designed pipelines are very efficient already, maybe with clock gating? Are all these internal blocks supposed to be async, so the vast majority of the core consumes no power besides leakage? So it's like programmable async blocks with static routing. But hammer a multiplier block almost every \"clock cycle\" and most of the savings disappear? Feels like large programs will spend most of their time reconfiguring the core. Some area vs power/performance tradeoff.",
                "author": "autumn-morning-2085"
            },
            {
                "raw_content": "I did a [Ph.D on a concept rather similar to this in 1998](https://bridges.monash.edu/articles/thesis/A_self-reconfiguring_computer_system/14834991). I still think this concept has promise, although it the weakness of this architecture is that as the complexity of your program increases so do the demands on the silicon space required to execute it and the ability to rapidly reconfigure tiles. It's a powerful solution for simple, highly parallel programs but weaker for more sequential, highly complex programs. I'll be watching with interest to see how it works out for them.",
                "author": "zsaleeba"
            },
            {
                "raw_content": "That's pretty neat. Kind of like implementing a scheduler in the compiler to target PS3-esque cores. Wonder how similar this is to filling compute units on GPUs. Without more details it's just pure speculation though",
                "author": "Aggravating_Cod_5624"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's chip contracting plan in spotlight on earnings day",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel has previously, heavily implied that if they don't get external customers for 14A, the buildout will be non-existent or low scale. >14A we’re starting from day one with being a foundry process and having all the right PDKs and IPs in the industry. But if I were going through that process I would say to make those investments you need to know that you have a customer besides Intel products that’s going to fill that factory because you need that diligence I think to go and make that capital investment. And if you don’t have it then do you do iterations of 18A, 18AP and whatever after until you can show a customer that you can get there and then they come on board. And so I think those are the level of discussions that Lip Bu is going be having as he’s thinking about the overall balance sheet and the way that we deploy capital. BoA conference.",
                "author": "Geddagod"
            },
            {
                "raw_content": "intel really really needs to work on changing significantly some key aspects of their corporate culture, if they want to succeed as a fab for hire. Their current CEO has a corporate background in the EDA space, so I assume he's well aware of the challenges in doing so and has a more informed/connected approach than the previous guy.",
                "author": "xternocleidomastoide"
            },
            {
                "raw_content": "> However, if we are unable to secure a significant external customer and meet important customer milestones for Intel 14A, we face the prospect that it will not be economical to develop and manufacture Intel 14A and successor leading-edge nodes on a go-forward basis. In such event, we may pause or discontinue our pursuit of Intel 14A and successor nodes and various of our manufacturing expansion projects. source: Intel 10-Q https://www.intc.com/filings-reports/all-sec-filings/content/0000050863-25-000109/intc-20250628.htm",
                "author": "Vushivushi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A Detailed Look at the Shifting BoM Cost of Samsung Galaxy S23 Ultra, S24 Ultra, and S25 Ultra",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Reports Second-Quarter 2025 Financial Results",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: Shit, but less shitty than expected Two interesting things of note: * The first Panther Lake processor SKU remains on track to begin shipping later this year, with additional SKUs coming in the first half of 2026. * Intel 18A reached a key milestone with the start of production wafers in Arizona",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "> Intel is taking action to optimize its manufacturing footprint and drive greater returns on invested capital. As part of this effort, Intel will no longer move forward with planned projects in Germany and Poland. Glad they stated the obvious",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Little late to the party.",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love the framing here!",
                "author": "Coralcato"
            },
            {
                "raw_content": "TRIPLE BANANA",
                "author": "linkling1039"
            },
            {
                "raw_content": "THAT’S SUCH A COOL PICTURE",
                "author": "ICantEvenDolt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tipping culture has really gotten out of hand",
        "score": 1089,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ten gold is a shit tip in this game’s gold economy.",
                "author": "gokartmozart89"
            },
            {
                "raw_content": "They are offering the service to turn into any shop. On top of that, they give you records as a reward for your continued tipping. I tip everywhere if they gave you free stuff lol",
                "author": "LStudios3"
            },
            {
                "raw_content": "I tip the gentleman every time. He goes out of his way to service you at different locations with his one-stop shop. Plus getting an occasional record out of it is worth way more than the price!",
                "author": "Railshock"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Deeply unsatisfying",
        "score": 408,
        "text_content": "I tried. I really tried.",
        "comments": [
            {
                "raw_content": "That’s a weird design choice on Nintendos part. Why make an invisible wall there of all places in this game",
                "author": "Moistycake"
            },
            {
                "raw_content": "I got up there with a chunk jump and was so disappointed.",
                "author": "alphonso28"
            },
            {
                "raw_content": "Damn, Mario Odyssey would at least have some coins up there.",
                "author": "Eggxcalibur"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Party Jamboree in Handheld Mode Before & After Side by Side Comparison",
        "score": 115,
        "text_content": "The first image is rendered in 720p upscaled to the Switch 2 screen and the second image was taken in Jamboree TV which is rendered in 1080p in handheld mode. NOTE: The resolution bump does NOT apply to the base game in neither docked nor handheld mode.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/71eyt68x1xef1.jpeg?width=1920&format=pjpg&auto=webp&s=7cd15d7dbe756e2ea6a08e867f9e07e2f1d9ac0b Zoomed in to help. What doesn't help is the heavy image compression, but that's probably the fault of the Switch screenshot function.",
                "author": "Immediate_Character-"
            },
            {
                "raw_content": "The second picture looks clearer and less blurry.",
                "author": "MediocreContact411"
            },
            {
                "raw_content": "Can definitely see the difference but Mario Party is a game where I have 0 use case for handheld mode. And I’m very confused on what the benefits of the Switch 2 edition are if I do not plan to ever use a camera. Am I getting any benefit?",
                "author": "jbayne2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reminder another Nintendo Switch 2 exclusive game releasing on July 31",
        "score": 88,
        "text_content": "Game: “Dear me, I was…”",
        "comments": [
            {
                "raw_content": "the eshop says it’s $7.99 USD",
                "author": "gummyyoshis"
            },
            {
                "raw_content": "Going to buy it. I liked Another Code and Hotel Dusk so the next game in that style is something I want to play.",
                "author": "Mikey-Insanity"
            },
            {
                "raw_content": "That’s a Nintendo game, then how come they never advertise it?",
                "author": "Excaliburn3d"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Pro Controller Battery Amazing!",
        "score": 68,
        "text_content": "Just wanted to offer my own data point since I see a lot of others who have praised the switch 2 pro controller for it's awesoe battery life. I got mine on June 29th (around the same time I bought the console too) and just TODAY I got the first low battery warning. So yes, my s2 pro controller lasted over 3.5 weeks on just a single charge! I've been playing switch 2 pretty consistently but most days getting maybe 30-60 minutes and some days playing almost all day. (I'm a busy 31 y/o.) So the pro controller can last nearly a month on a single charge with daily light play, that's so impressive!!!",
        "comments": [
            {
                "raw_content": "I charged mine day 1 and have not had to charge since.",
                "author": "Blindfolded22"
            },
            {
                "raw_content": "Yeah bro it’s such a game changer. My ps5 controller is perpetually dead and it legit makes me use the console way less",
                "author": "aestheticbridges"
            },
            {
                "raw_content": "You can expect around 30-40 hours per Nintendo. 3.5 weeks is 24.5 days. Assuming 45 minutes a day, that's 1,102.5 minutes, or 18.375 hours. Add in a few days where you played all day, checks out.",
                "author": "Immediate_Character-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm proud of this sub's DKB players",
        "score": 125,
        "text_content": "I'm not going to actually spoil anything but I'm at the end of Donkey Kong Bananza and I just have to say that I love each and everyone of you that got to the end and kept quiet about what happens. Y'all are a Water Buffalo / 10",
        "comments": [
            {
                "raw_content": "OH BANANA",
                "author": "japan_kaaran"
            },
            {
                "raw_content": "Everyone already knows they reveal DK’s Donkey Schlong and it’s not nearly as big as we expected. There I said it.",
                "author": "Theobviouschild11"
            },
            {
                "raw_content": "I agree ON TWITTER HOWEVER!! I HAVE BEEN SPOILED SO MANY TIMES!! I even muted everything dk related but got spoiled by gifs",
                "author": "espinalchris"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Two days after I order their neogrip, Savage Raven has released a new grip case 😂😭",
        "score": 119,
        "text_content": "Looks to me like it uses the same grips as the neo grip though, unless I am mistaken.",
        "comments": [
            {
                "raw_content": "The new one is TPU and cover entire console, blocking usage of the stand. Your neo grip is hard plastic, with access to the kick stand. They’re 2 different products. Only the grip part is the same.",
                "author": "ghim7"
            },
            {
                "raw_content": "Thank you for your sacrifice.",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "No joke, I just ordered the neogrip hours ago on Amazon lol. I'm about to cancel.",
                "author": "deadpxlgames"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson: Ubisoft recently canceled a sequel to Star Wars Outlaws",
        "score": 703,
        "text_content": "Source: [https://www.youtube.com/live/1bFaIYn9H3g](https://www.youtube.com/live/1bFaIYn9H3g) (approximately 46:40 into the podcast) According to Henderson, Ubisoft canceled a sequel to Star Wars Outlaws which was very early in development, likely due to poor sales.",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Don’t worry, they’ll move everyone onto a Far Cry extraction shooter or something stupid",
                "author": "EarthwormJoe"
            },
            {
                "raw_content": "Unfortunate but not surprising. Outlaws felt like as Assassin's Creed/Watch Dogs situation where the first game didn't quite work out but a refined sequel could have been something truly special. Unfortunately this was a pretty obvious outcome when those dismal sales figures came in.",
                "author": "FourLiveBears"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: New Ghost Recon Built In Unreal Engine",
        "score": 142,
        "text_content": "On the latest Insider Gaming Weekly, Tom Henderson said that Ubisoft has moved away from its own in-house engine to build the next Ghost Recon on Unreal. CLIP: [https://www.youtube.com/watch?v=kpOK0fWDT9Q](https://www.youtube.com/watch?v=kpOK0fWDT9Q)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I thought I would migrate to snowdrop, it seemed the natural path",
                "author": "StudioIllustrious208"
            },
            {
                "raw_content": "Sad, I allways thought Anvil Next ran great.",
                "author": "Dodo1610"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA has accidentally leaked Battlefield 6’s release date (October 10th) in a 'game disclaimers' page",
        "score": 730,
        "text_content": "- Confirms the dates leaked by 1BF and bilibil-kun previously “This pre-sell promotional offer expires October 10, 2025.” Source: https://www.ea.com/games/battlefield/battlefield-6/game-disclaimers Article by Eurogamer: https://www.eurogamer.net/battlefield-6-finally-revealed-with-a-dedicated-multiplayer-reveal-coming-next-week",
        "comments": [
            {
                "raw_content": "I need to know a date for open beta",
                "author": "DiabloDex1"
            },
            {
                "raw_content": "Earlier than I expected",
                "author": "SpyroManiac36"
            },
            {
                "raw_content": "At this point I wouldn’t be surprised if some of this was purposeful.",
                "author": "TEoSaT"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Games industry interviewer KiwiTalkz claims that Metroid Prime 4 is still unfinished, keeps missing development milestones.",
        "score": 488,
        "text_content": "[https://xcancel.com/kiwitalkz/status/1947809648700002346](https://xcancel.com/kiwitalkz/status/1947809648700002346) [https://xcancel.com/kiwitalkz/status/1947803410151182341](https://xcancel.com/kiwitalkz/status/1947803410151182341) Interesting news as with the modern Nintendo development pipeline, many games are finished well ahead of release. Seems like work on Prime 4 may continue up until the last minute, or the game may see a delay into 2026 if necessary. EDIT: KiwiTalkz has interviewed many former Retro Studios developers and accurately described Project Harmony before it leaked. He has generally been reliable when it comes to news relating to Retro. EDIT 2: Further clairifcation from KiwiTalkz provided - [https://xcancel.com/kiwitalkz/status/1948454506909601920](https://xcancel.com/kiwitalkz/status/1948454506909601920) Other tweets from him imply that Nintendo/Retro are very confident in Prime 4 and that the game being incomplete is not indicative of development struggles, but rather that just being what the game demands.",
        "comments": [
            {
                "raw_content": "It’s odd that Nintendo has reiterated many times that it will release in 2025 if this is the case. But with how quiet they’ve been on the release date, a delay to 2026 wouldn’t be overly surprising.",
                "author": "logica_torcido"
            },
            {
                "raw_content": "But the London subway banner already has PEGI12 rating on it. You can't get it rated if it's unfinished, can you?",
                "author": "xhr0428"
            },
            {
                "raw_content": "it’s fine, I’ve been waiting +10 years, I can wait a couple months more",
                "author": "Inevitable_Judge5231"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Plants vs Zombies Replanted potentially leaked.",
        "score": 183,
        "text_content": "https://www.reddit.com/r/PlantsVSZombies/s/hGKzM4Rpny",
        "comments": [
            {
                "raw_content": "There was a rumour of a remastered version of Plants vs Zombies 1 for PC, consoles and mobile. [I guess this is it.](https://www.reddit.com/r/PlantsVSZombies/s/7X6Inc5mwm)",
                "author": "cautious-ad977"
            },
            {
                "raw_content": "It looks like it's gonna be a remake of PVZ1, I don't care what it is though i just want more classic PVZ",
                "author": "udderchaos2005"
            },
            {
                "raw_content": "dude this could be a remaster with literally _nothing new_ besides having modern video options and if that is it, i'd still buy it. the original game still runs at 480p, i'd be more than happy buying it for that alone",
                "author": "thatpikminguy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[The Game Business] \"Xbox is expected to announce more game ports to other platforms, including Nintendo Switch 2 and PS5, in the coming weeks.\"",
        "score": 468,
        "text_content": "https://www.thegamebusiness.com/p/bringing-your-games-to-other-platforms?utm_campaign=post&utm_medium=web “Xbox is expected to announce more game ports to the other platforms, including Nintendo Switch 2 and PS5, in the coming weeks.”",
        "comments": [
            {
                "raw_content": "Switch 2 version of Minecraft would be grand!",
                "author": "GrabMyPitchfork"
            },
            {
                "raw_content": "Gamescom is next month. Not surprising.",
                "author": "TheOneBearded"
            },
            {
                "raw_content": "How is this a rumor? Microsoft said like a day after the Switch 2 reveal that they will be releasing games for it.",
                "author": "Coolman_Rosso"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Overwatch 2's Wuyang had his entire ability kit and full-body render leaked on a Blizzard player survey",
        "score": 112,
        "text_content": "[Kit](https://files.catbox.moe/mq5ks3.webp) [full-body render](https://files.catbox.moe/rr9wmw.jpg) [~~The survey in question, public link~~](https://blizzard.qualtrics.com/jfe/form/SV_6DaB3cfbNgwHVKm) now down shout out to a user on a friendly discord for finding these.",
        "comments": [
            {
                "raw_content": "I bet 100$ he gets a wukong skin at new year",
                "author": "xXx_edgykid_xXx"
            },
            {
                "raw_content": "I mean he’s a pretty average-looking hero. I liked more weirdly shaped ones more tbh. Even recent Freja had a more interesting silhouette with her cape",
                "author": "starfieldnovember"
            },
            {
                "raw_content": "If you had told me this was the model for a random civilian in the cut PVE mode I would 100% believe you. He really does not have anything interesting going on.",
                "author": "HollowBlades"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "CDPR’s New IP Project Hadar Is An Action RPG With Melee Combat, Suggests Job Listing",
        "score": 314,
        "text_content": "CDPR is currently working on a brand new original IP codenamed \"Project Hadar,\" which is currently in the pre-production phase. Now new job posting has revealed that the new action RPG is heavily focused on melee combat. [Source](https://tech4gamers.com/cdpr-project-hadar-action-rpg-melee-combat/)",
        "comments": [
            {
                "raw_content": "We won't be seeing this until like, 2034 or something lmao",
                "author": "Taymatosama"
            },
            {
                "raw_content": "Is CDPR finally doing an original IP?",
                "author": "Arumhal"
            },
            {
                "raw_content": "Glad they’re hiring a combat designer for this. Genuinely baffling they didn’t have one for any of the Witcher games iirc. A decent Melee system is a lot harder to get right than a shooter which is why I was able to get through Cyberpunk but still haven’t been about to sit through Witcher 3",
                "author": "Johnhancock1777"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel reveals it will lose 33,000 employees this year and retreat in Germany, Poland, and Costa Rica",
        "score": 277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What an unbelievable awful management this company had the last few years",
                "author": "nofuture09"
            },
            {
                "raw_content": "There goes their international fabrication… Just handing everything to TSMC is scary stupid if the Taiwan / China War starts…",
                "author": "starshiptendies"
            },
            {
                "raw_content": "I saw the headlines today and the lizard part of my brain immediately panicked for a quick second. Then I realized I haven’t worked at Intel in like two weeks, after leaving voluntarily I wish all of my brothers and sisters who are still Blue Badges the best. Intel doesn’t deserve its employees. I promise you all that there are companies out there that want you, and have the culture Intel now pretends it still has. Take the best parts of what it once meant to be a BB with you, and find a place that values you as employees and as people.",
                "author": "Responsible-War-2576"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel CEO Letter to Employees",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Key points: * Q2 2025 revenue above guidance * 15% headcount reduction in layoffs, *plus attrition* to 75,000 * 50% streamlining of management layers * Return to office in September * Foundry to be customer responsive, projects in Germany/Poland halted * 18A ramping to scale, * 14A to meet requirements of internal and external customers* * SMT to return to the roadmap * Refocus AI strategy to inference and agentic AI",
                "author": "ryanvsrobots"
            },
            {
                "raw_content": "He will force more than 10k people out through Return to Office.",
                "author": "Then-Wealth-1481"
            },
            {
                "raw_content": "Of note...absolutely nothing new. So his entire plan is basketball, firing people, and listening.... *I'm more concerned all new products require him to oversee them, dude might be a genius, but he's not an IC designer lol.",
                "author": "AgitatedStranger9698"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "HP EliteBook X G1i 14 AI laptop review: Basic features wrapped in an executive package",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats a name if I've ever seen one",
                "author": "Matthijsvdweerd"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Asus ExpertBook B5 B5404CMA Laptop Review: A compelling business laptop with all-day battery life that overlooks one important aspect",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Mesa 25.3 Merges Vulkan AMD Anti-Lag Support",
        "score": 130,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear, Valve and two AMD employees are doing more active development for AMD users in Mesa than AMD's Windows driver team.",
                "author": "Logical_Specific_59"
            },
            {
                "raw_content": "I wish things could move a little faster. But then, nice to see things moving at all. But I would also like to see AMD to bring a graphical front end to the driver (amdgpu/mesa) that 'looks like' the AMD Adrenalin drivers on M$-Win10/11 for the ordinary gamers (without any knowledge of what the OS does).",
                "author": "readyflix"
            },
            {
                "raw_content": "just switched my 2nd rig to bazzite. Asking why I didn’t do it earlier.",
                "author": "Saitham83"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Who Makes the Better 8GB Graphics Card? - RX 9060 XT vs. RTX 5060 Ti",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tldr: 9060XT8GB >> 5060TI8GB 9060XT16GB = 5060TI16GB 9060XT PCIE 5.0x16 5060TI PCIE 5.0 x8",
                "author": "itzBT"
            },
            {
                "raw_content": "tldr?",
                "author": "Chitrr"
            },
            {
                "raw_content": "a.k.a. What's the less stinky turd in the toilet bowl?",
                "author": "GladiusLegis"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD WIN 5, the world's first Ryzen AI MAX 395+ Strix Halo handheld, to debut on August 1",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "...how is that gonna scale at handheld power levels where people would reasonably play unplugged (<20w) though?",
                "author": "996forever"
            },
            {
                "raw_content": "This will be tough to sell. My Win4 with the HX370 was already around 1300€, this thing will probably be 2k+. PC handhelds are already niche devices (yes, even the Steam Deck is) looking at the console market overall, let alone devices with a 1k+ price tag. Don't get me wrong, I love my Win4, but I use it both as a gaming device and a efficient general purpose PC running CachyOS (not handheld edition). Otherwise I could not have justified such a large expense. Also, no FSR4 since it's still RDNA 3.5. Valve is probably wating for FSR4+ coming to APUs for the next Steam Deck.",
                "author": "flatmind"
            },
            {
                "raw_content": "Wish there was a 40CU + Single 8 Core CCD variant SKU for this handheld. 16 Cores is totally not worth it.",
                "author": "Dangerman1337"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD RDNA 5 Specs Leak: TSMC 3nm, 128GB GDDR7, RTX 6090 Killer! (+ PS6 / XBOX Update)",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MLID videos should honestly be automodded.",
                "author": "kb3035583"
            },
            {
                "raw_content": "Do people actually believe this trash?",
                "author": "Wild_Chemistry3884"
            },
            {
                "raw_content": "I genuinely don't know how this guy has a platform",
                "author": "616inL-A"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "House price DROP imminent across all of America: Sales collapse at highest rate on record",
        "score": 583,
        "text_content": "",
        "comments": [
            {
                "raw_content": "insane of this article to refer to reconsidering after an inspection reveals problems as \"pickiness.\"",
                "author": "theoryfiles"
            },
            {
                "raw_content": "I’ll believe it when it’s local news - not the daily mail lol…",
                "author": "1GrouchyCat"
            },
            {
                "raw_content": "Buyers are walking away from home purchases in record numbers, causing complete chaos in the US housing market. In June, over 57,000 home sales across the country were abruptly canceled, equaling a staggering 14.9 percent of homes that went under contract, according to a report from Redfin. That number is an uptick from 13.9 percent of sales which collapsed this time last year. It's also the highest June figure ever recorded since Redfin began tracking cancellations in 2017, and the Sun Belt has become ground zero for cancelled deals. It's all down to the buyers, who currently hold the power in the real estate market.",
                "author": "dailymail"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homeowners are pouring their equity into renovations because there's 'no incentive' to sell in today's housing market",
        "score": 211,
        "text_content": "[https://archive.ph/l05ot](https://archive.ph/l05ot) * Homeowners are leveraging their home equity via HELOCs (home equity lines of credit) to fund renovations. * Renovations are often more affordable than buying new—averaging $49K cheaper to renovate, $79K cheaper to expand. * The housing market is tough across the board—buyers can’t afford, sellers aren’t getting offers they want. * New zoning laws are enabling easier home expansions and additional dwelling units. * High mortgage rates (nearly 7%) and steep home prices have made it hard for buyers to enter the market. * Many current owners have low mortgage rates from the pandemic era and don’t want to lose them by selling. * There's “no incentive” to sell, especially for millennials looking to upgrade from starter homes.",
        "comments": [
            {
                "raw_content": "I remember when remodeling was all the rage in the mid 2000s too - \"you'll make it all back in equity gains!\" It's a sham. You never get your money's worth back out of remodels, especially not ones you're financing on interest with a HELOC. Banks just want to cut loans, because transaction volume is how they make money.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Digging a bigger hole",
                "author": "ShadowHunter"
            },
            {
                "raw_content": "As a remodel contractor, I support this message",
                "author": "pqitpa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Inconvenient Truth",
        "score": 877,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I read more people over 70 are buying houses than under 30.",
                "author": "AdScary1757"
            },
            {
                "raw_content": "I bought my house in 2021. If I bought my exact same house today I would pay $1000 more per month due to to the increase in rates.",
                "author": "To_Fight_The_Night"
            },
            {
                "raw_content": "Everyone bought the manufactured “dip” so it’s not really booming. Interest rates haven’t budged below 6.5%, pricing is still bonkers on housing. Just a blinking contest. The Fed will reduce overnight lending and long term rates will increase because no one is buying long term treasuries like before 2025. The era of cheap money is gone and we are living in an inflated hard asset market.",
                "author": "ManufacturerOld3807"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Oxford Economics says the crumbling housing market will continue deteriorating because of two key factors",
        "score": 150,
        "text_content": "[https://archive.ph/huAmE](https://archive.ph/huAmE) * **Mortgage Rates & Prices**: Rates are nearly 7%, while home prices have jumped 55% since 2020, making affordability a core challenge. * **Low Supply Issues**: Years of undersupply and slow construction have led to tight inventory and sluggish sales.",
        "comments": [
            {
                "raw_content": "In NOVA (DMV), a townhouse that cost $300k precovid is bloated to upwards $600-700k. i genuinely hope it all crashes. housing should not be an investment tool not for mom & pop investors, not for airbnbs, not for flippers, and def not for corporations. it’s become a scheme for people to make a quick buck",
                "author": "MainAmbassador934"
            },
            {
                "raw_content": "supply issue is bullshit. Everyone wants to sit on their ass while their properties generate income. It's simple greed, always has been.",
                "author": "cosmoinstant"
            },
            {
                "raw_content": "Obsessed. The whole thing is a joke now. Affordability? Maxed. Out. They pushed the market so far that owning a home is now laughably more expensive than renting. Especially here in LA where a shit-hole is $1m+ in a bad area. In some places, it’s **50% more**. That old saying “buy because it's cheaper or equivalent ” narrative? Dead. I'm saving a fortune renting and putting that money into literally anything else. And let’s be real. This whole mess was fueled by bloated tech salaries. When you're handing out 300K to 500K to mid-level product managers, that cash floods into housing and distorts everything. Now AI is gutting those jobs left and right. The money is drying up. The layoffs have only just begun. Then there’s Airbnb. That party’s over too. Oversaturated. Underbooked. Cities are finally cracking down. Investors are bailing. The “easy money” fantasy is collapsing. So yeah. It’s not if it drops. It has to.",
                "author": "socialdirection"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just a silly back to back observation on my main feed.",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some folks who bought before the pandemic are up double and there's nowhere to upgrade to without doubling the monthly rates. Might as well throw some into the current home to expand or update. Meanwhile, those who bought in the last 2 years are flat or in declining markets. They're silly to put anymore into the home. Really depends situation by situation on when you bought and what rate you hold.",
                "author": "throwaway43234235234"
            },
            {
                "raw_content": "Yep, both are true. These are the two types of current home owners",
                "author": "wake4coffee"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory of New Single-Family Homes Spikes to Highest since 2007; in the South, Shoots Past Housing Bust High. Sales and Prices Drop",
        "score": 16,
        "text_content": "https://wolfstreet.com/2025/07/24/inventory-of-new-single-family-homes-spikes-to-highest-since-2007-in-the-south-well-past-housing-bust-high-sales-prices-drop/ Inventory of New Single-Family Homes Spikes to Highest since 2007; in the South, Shoots Past Housing Bust High. Sales and Prices Drop | Wolf Street Homebuilders cut prices, bring on supply; profits plunge back to earth. Medicine this overpriced housing market needs. By Wolf Richter for WOLF STREET.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why hasn’t our Dallas home sold yet??",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love entitled sellers who phrase it like it's their God given right to be able to sell their house at the exact price they want 😆",
                "author": "vblade2003"
            },
            {
                "raw_content": "Texas is why",
                "author": "Cosmic_Gumbo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New AI executive order: AI must agree on the administrations views on sex, race, cant mention what they deem to be critical race theory, unconscious bias, intersectionality, systemic racism or \"transgenderism\".",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being able to draw a ''Transwoman riding a tank on Tiananmen Square'' will in the future be the shibboleth that you are a human.",
                "author": "sinuhe_t"
            },
            {
                "raw_content": "This is extremely alarming. If you thought MechaHilter was bad... just wait",
                "author": "Medical_Bluebird_268"
            },
            {
                "raw_content": "Absurd. This is the kind of shit we clown the CCP for.",
                "author": "dday0512"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "“Do we really want to interact with robots instead of humans?” - Bernie sanders on Elon’s vision",
        "score": 848,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we had a robust safety net, or UBI like program, then I’d be fine with robots replacing human labor. Problem here is that they are trying to replace human labor while we don’t have shit in place to help the unemployed and a political party that is actively hostile to social welfare in power.",
                "author": "AGI2028maybe"
            },
            {
                "raw_content": "Yeah, that girl pretends to be happy to work there. We all pretend to be happy to work. Because no work =no food and we are passionate about staying alive. Make UBI mandatory Mr. Sanders. In USA first and then the rest of the world. We can enjoy living with the robots then (I like the cute robot on the left better than the one on the right :) )",
                "author": "mihaicl1981"
            },
            {
                "raw_content": "I would rather some poor girl not have to roller skate in a minidress to give me a fucking burger made by a minimum wage employee who hates his job and has bad hygiene. . I love Bernie, but he is way off here. I want AI to replace every bullshit job I have to do while society to moves away from capitalism and fucking realizes we have an entire universe to explore.",
                "author": "HeftySafety8841"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seems like Microsoft will be implementing GPT-5 in Copilot",
        "score": 272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can I use it to think hard and fast?",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "It blows my mind that copilot is powered by ChatGPT…it sucks shit. Okay, it’s better than Apple Intelligence, but it sucks so bad.",
                "author": "GreatSituation886"
            },
            {
                "raw_content": "Copilot UI on web is so bad it's almost unusable, the fact that they try to predict your prompt so every few letters are sent in an http request so they are collecting your prompt even if you don't submit, ears up so much resources in the dom it's makes everything slow as heck. Then the browser crashes after a moderately long response bc they feel the need to load every single part of the response even when reloading the UI, is so horrible I can't even. No way to customize these settings to disable either.",
                "author": "Extreme-Edge-9843"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why is Reddit so against AI?",
        "score": 145,
        "text_content": "I mean, outside of the AI-oriented subs, many redditors are outright hostile to it, calling it useless and a bubble. I know it's not perfect, but, for LLMs, it definitely helps out with productivity at work in a lot of ways. I also use Waymo often to get around, and it's nice and exciting to see it progressing. It's exciting to see the automation of various things around us. Why do people seem so negative and want it to fail so much?",
        "comments": [
            {
                "raw_content": "Fear of AI taking jobs. Lack of trust in the government to provide when AI does take jobs. Lack of trust in corporations in general. Dislike for AI being used to flood social media and marketplaces with very similar content. Dislike for AI being inserted in almost every application. Ultimately, the optimism around tech doesn't exist anymore. People saw companies kill useful projects, have terrible working conditions, experienced enshittification, listened to CEOs having zero empathy, and possibly couldn't count on their goverments to help them. So when new tech comes and promises to \"do everything you can do\", it's easier to imagine the negatives than the positives. There are other variables, like fear of unaligned AI, or the usage of AI as a control mechanism via censorship or narrative control. But the ones I said at the top are the most popular reasons.",
                "author": "rdlenke"
            },
            {
                "raw_content": "Lookup adoption curve. Where in the left of middle phase. Propaganda, fear mongering, film tropes of AI violence, immense energy demands, tax payer dollars going to corporations, AI leaders hyping with wishful outcomes with no real timeline, jaded with governments ability to regulate new tech and markets, and a general lack of understanding, exposure or capacity to understand the value. People are also familiar with ConvenienceTech turning into Spyware rather quickly. Society always rejects change at first. The same hysteria and sarcasm was prevalent when E-mail was first publicized. Many reasons... tldr; corporate gaslighting for decades made people jaded",
                "author": "el0_0le"
            },
            {
                "raw_content": "Because people keep telling them it will likely take their jobs, I think that would make most people hostile towards it if you don't see the more long term benefits. Its not like UBI will come easily so it seems like some hostility is to be expected.",
                "author": "samwell_4548"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Agent Mode is finally live for Plus users!",
        "score": 216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "curious to hear successful use cases as folks have them?",
                "author": "CrumblingSaturn"
            },
            {
                "raw_content": "Very limited, tried to get it to order any food from anywhere and couldn’t due to limitations in what it cans do.",
                "author": "Subnetwork"
            },
            {
                "raw_content": "Got it too, but have no idea what to use it for. I don't like weddings.",
                "author": "freekyrationale"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI prepares to launch GPT-5 in August",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guess that means gemini this month, or august too",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Some interesting tidbits from the article: Open Model coming before GPT-5: \"I’m still hearing that this open language model is imminent and that OpenAI is trying to ship it before the end of July — ahead of GPT-5’s release. Sources describe the model as “similar to o3 mini,” complete with reasoning capabilities.\" GPT-5, GPT-5-mini and GPT-5-nano: \"I understand OpenAI is planning to launch GPT-5 in early August, complete with mini and nano versions that will also be available through its API.... I understand that the main combined reasoning version of GPT-5 will be available through ChatGPT and OpenAI’s API, and the mini version will also be available on ChatGPT and the API. The nano version of GPT-5 is expected to only be available through the API.\"",
                "author": "Traditional_Earth181"
            },
            {
                "raw_content": "https://preview.redd.it/grb2t1kliuef1.jpeg?width=604&format=pjpg&auto=webp&s=ef31845d310ea04c5a0010cdd08d3d865265821a",
                "author": "IlustriousCoffee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Trump unveils his plan to put AI in everything, and wants to clear the way for a rapid AI revolution.",
        "score": 405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine the most important technological changes in our lifetimes overseen by the least capable and corrupt politicians in our lifetime...",
                "author": "JackStrawWitchita"
            },
            {
                "raw_content": "He just wants to ensure the AI LLMs are all purged of any references to his relationship with Epstein.",
                "author": "JackStrawWitchita"
            },
            {
                "raw_content": "It's pretty depressing to witness acceleration through an autocratic presidency. Fuck my chud life man",
                "author": "Puzzleheaded_Soup847"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Multi-Model AI Agents Team coded complex senior dev program in 10 hours instead of 4 weeks",
        "score": 14,
        "text_content": "I make autonomous AI coding agents, via my corp www.autonomo.codes. I recently made a breakthrough and my AI agents were able to code, almost totally unassisted, PHP's Composer version constraints parser with 100% fidelity (tested against all 65,000+ version constraints possibilities). It took three different models (DeepSeek R1 as the junior, Claude 3.7 Sonnet and OpenAI O3 as the seniors, with OpenAI o4-mini-high as the project manager) to code it, autonomously, in about 10 hours at a total spend cost of $15.75 plus another 5 hours of human development (~$350 after taxes + insurance + salary). I had a senior Indian developer do this as part of a scienitifc paper I'm writing, and it took him a total of 62 hours working 3-5 hours per day. 21.4 work days, across 4 work weeks at the cost of $3,000. I myself, it took me 2 1/2 weeks, some 35 hours at a cost of ~$6,000. Because you don't just pay for 2-5 hours of active work but all 8. And another senior dev in Germany took 3 weeks. That AI was able to do this largely unassisted in 10 hours is mind boggling. It did it at an average of 15.7x human speed for fractions of a dollar in cost. Here is the test project: * https://github.com/PHPExpertsInc/composer-constraints-parser-human It includes [unit tests](https://github.com/PHPExpertsInc/composer-constraints-parser-human/blob/trunk/tests/ComposerConstraintsHelperTest.php) against all [65,000+ combinations](https://github.com/PHPExpertsInc/composer-constraints-parser-human/blob/trunk/tests/constraints.json) of PHP's composer's version constraints system. And the tests have ~400% code coverage of Composer's `versionSatisfies()` core method. If you are able to pass 100% of all the unit tests, you are guaranteed to have made a fully compatible version constraints parser for Composer. See how long it would take you to implement this. You are allowed only two documents and one website to solve this problem: 1. [**The official Composer Versions and Constraints documentation**](https://getcomposer.org/doc/articles/versions.md) 2. [**How Composer Version Constraints Work**](https://www.iwader.co.uk/posts/2016/02/how-composer-version-constraints-work/) 3. [**The PHP.net manual**](https://www.php.net/docs.php) If you want to see the code generated by the autonomous AI team, go here: https://github.com/PHPExpertsInc/ComposerConstraintsParser As the senior team member, and only human, I only had to fix the final 32 combinations (out of 65,000+) and one of them was due to a documentation bug in the Composer version constraints documentation, that took me about 5 hours, in [this commit](https://github.com/PHPExpertsInc/ComposerConstraintsParser/commit/cb15e6d6eb2b799d6742fb75432ffb4f381122bf). AIs did 95%+ of the total work, unassisted. It was done via [Autonomo](https://www.autonomo.codes/) by Autonomous Proogramming, LLC, an agentic coding agent that creates its own branches, does its own coding, and commits to github without user intervention. Autonomo's latest fully-open sourced and autonomously-programmed project is [PHPExpertsInc/RecursiveSerializer](https://github.com/PHPExpertsInc/RecursiveSerializer): A drop-dead simple way to serialize objects, arrays, etc. in PHP and avoid infinite recursion crashes.",
        "comments": [
            {
                "raw_content": "Holy shit",
                "author": "SelfTaughtPiano"
            }
        ],
        "subreddit": "singularity"
    }
]