[
    {
        "post_name": "A black woman forcibly removed a Hispanic passenger from her train seat, claiming she was offended and saying, “Hispanics don’t deserve to sit next to me.”",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Say what you want if that's an Illegal I don't give a fuck",
                "author": "ACActual"
            },
            {
                "raw_content": "This is the end result of diversity, equity and inclusion. Which is why no nation in the entire history of the world has been stupid enough to ever do it until we had a dementia patient as president",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Their diversity pets aren’t playing nice together.",
                "author": "ViagraFalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sleepy Joe FORGETS the name of his former Press Secretary Karine Jean-Pierre. “My Press Secretary, ‘KAREEM’!”",
        "score": 635,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And his secretary of defense, Magic Johnson",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "Kareem Abdul Pierre, she used to touch my hairy legs.",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Never change Joe. LOL",
                "author": "here2red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vietnamese man in the US: \"We have never asked anybody to bow down or speak our language. Since when the fuck does this stupid ass mayor of… Somalian in Minnesota have to speak their language and apologize for those crooked-ass pirates?!\"",
        "score": 497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll give it to veitnamese they did assimilate and upheld their end working owning donut shops and other businesses without being criminal lowlives for the most part.",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "I know an old Vietnamese woman who talked of clinging to boats as a child, doing whatever she could to escape as the country fell. She did everything right and has lived the American dream. More importantly, she understands how much better life is here than anywhere else, and she wants it to stay that way.",
                "author": "lizardo221"
            },
            {
                "raw_content": "Ive never had a single issue with asians in our country (china aside.) They integrate, keep their head down, and understand who actually built this place.",
                "author": "DefineTheLine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Treason.",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wake up..... OMG BOMBSHELL DEMS PROVEN TO HAVE BROKEN THE LAW... Republicans do nothing... I go to bed...",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Once upon a time, those behind this would be rounded up and hanged by the neck until dead.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They made me pay double SS tax when I had my own business, and won't let me get a dime until I'm in 60s, when there's no money left. Meanwhile illegal wetbacks are being given this money on day-1 of their invasion. Every single day that goes by without public executions makes me dislike Trump more and more.",
                "author": "XxxRDTPRNxxX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Walz’s daughter melts down in a profanity-laced TikTok, says Trump’s “cult members” are driving by her house screaming that her family are “R words” ever since his Thanksgiving Truth Social post.",
        "score": 1193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a retard.",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "The whole family are Retards, except for the brother, he his just mentally disabled.",
                "author": "This_will_be_public"
            },
            {
                "raw_content": "The entire Walz family is SERIOUSLY retarded.",
                "author": "obamagavemeaphone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Serious Inquiries Only!",
        "score": 597,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that’s a lot of fish",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "What does something like that cost?",
                "author": "RudeFrog"
            },
            {
                "raw_content": "No lowballs! I know what I got!",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Watch the moment London’s Muslim Mayor Sadiq Khan realizes the Christmas song he’s singing is about Jesus Christ.",
        "score": 978,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like Pelosi holding an American flag.",
                "author": "greenroomsh"
            },
            {
                "raw_content": "So funny. You really have to ask yourself how the #1 city in UK is led by a muslim for so many years. At that point, the country was lost and continues to fall further. When their \"king\" is also dedicating mosques.... Their place is fucked, there's no fixing it.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "His fucking brain rebooted on the spot",
                "author": "IvIA6A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Special Needs Community Demands People Stop Comparing Them To Tim Walz",
        "score": 623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't consider special needs folk to be retarded...unless they vote for democrats.",
                "author": "Rucktoe"
            },
            {
                "raw_content": "If you were Retarded, wouldn't you?",
                "author": "TEXinLA"
            },
            {
                "raw_content": "https://www.youtube.com/watch?v=-I61NOrPNII Damn, Corky is 60. Even when Corky sees Walz on tv he's like get that retard off my tv",
                "author": "LearnAboutRoaches"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MN - The Handicapped Somali State",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Somalians have a low IQ because of ages of inbreeding. Minnesota Democrats are retarded because of Socialism.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Link: https://www.thegatewaypundit.com/2025/12/somalias-average-iq-score-meets-u-s-standard/",
                "author": "lothrop_evola"
            },
            {
                "raw_content": "I can teach a newborn puppy more skills than an adult Somalian.",
                "author": "Dev404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Journalist Nick Sortor gets attacked by an anti-ICE activist after the leftist grabbed him and tried to take his phone in New Orleans, Louisiana.",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They won't stop, until they're stopped.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "You never see CNN reporters out there.",
                "author": "GunToast"
            },
            {
                "raw_content": "Whip out the blade and get stabby. Or at least have a buddy with you.",
                "author": "Beelzy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former Prime Minister of Somalia: “The interests of Ilhan Omar are not the interest of Minnesota, nor is it the interest of Americans. The interests of Ilhan is that of the Somalian people and Somalia.” *massive applause*",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do Ted \"lsraeI First\" Cruz and Chuck \"lsraeI's greatest warror\" Schumer. We pay these cunts to represent us and they spit in our faces.",
                "author": "Oliphaunt"
            },
            {
                "raw_content": "Deport All Lightbulb Heads",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "it’s truly amazing how far this woman is gone and how she hasn’t been held accountable for anything",
                "author": "leakmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❄️🐸☃️",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love Franklin hanging out with us",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "It’s a PEPE Wonderland!!",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Looks like fun!",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We have the best women.",
        "score": 751,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I applaud this level of DGAF.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "Fucking Somalis provoked it. Pushing Islam Dress on her, commenting on her body. Fuck all Somalis",
                "author": "ACActual"
            },
            {
                "raw_content": "Not sure what this is about, but ok...",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sign me up!",
        "score": 1376,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*cuts to front of line.",
                "author": "Looniz74"
            },
            {
                "raw_content": "Does his wife open the window so she can hear and smell the exhaust?",
                "author": "ElectionMeddler"
            },
            {
                "raw_content": "I want my car horn to yell \"RETARD\", I can't think of a time when it wouldn't be applicable",
                "author": "MasterChief"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If we can clean up some of the fraudulent election rolls, GOP can flip some of these states.",
        "score": 1141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Democratic Party operates under constant loss voters-ship….. for the past 40 years, they relied on foreigners voting in our elections to make up the difference of Americans never voting for those stupid bastards….. No, or they do have a message which is the destruction of America and criminality stealing our money…. Yeah, clean the voter rolls up every state could probably go red",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "expose AZ and clean it up. Every trick you want to discover is there.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Fuck the GOP. They're nothing but losers",
                "author": "559throw"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On today's episode of TDS:",
        "score": 785,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tobacco. Two O's, not two A's. Otherwise, good meme, pede.",
                "author": "JimQPublic"
            },
            {
                "raw_content": "What the fuck is tabacco? 😂",
                "author": "Markosis17"
            },
            {
                "raw_content": "Don't call them businesses, they are drug dealers. They do not work on a paradigm based on pleasing customers.",
                "author": "rootGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newscum: THE BEST PRESIDENT IN MODERN AMERICAN HISTORY!",
        "score": 476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a funny looking autopen",
                "author": "DingleBalls"
            },
            {
                "raw_content": "someone is upset walz is getting all the attention",
                "author": "Raetchel"
            },
            {
                "raw_content": "Wow! He chose Biden over Obama??",
                "author": "Bruno"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He has one idea.",
        "score": 913,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is from 2005. They've been harboring this level of hatred for a long time.",
                "author": "nodoublestandards"
            },
            {
                "raw_content": "Seems he died in 2023. https://www.abibitumi.com/nanakamaukambon/ Also, he seems to have died in Ghana, so he did actually return to Africa.",
                "author": "JimQPublic"
            },
            {
                "raw_content": "No need to interact with white people if you move to Africa.",
                "author": "utfanx2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Retarded” ft. DJT & JD - TRUMP2028!🇺🇸",
        "score": 892,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Libs will try to call this AI.",
                "author": "MrMxyzptlk"
            },
            {
                "raw_content": "This is what AI is ment for :D",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "Drummer Vance is my favorite Vance.",
                "author": "Fakehistory2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes. Exactly. This shouldn't be controversial because it's obvious.",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Disband the EU, NATO, & UN. Then the IMF & WB.",
                "author": "Repentnow"
            },
            {
                "raw_content": "Now... What about the US federal government?",
                "author": "HanginChad"
            },
            {
                "raw_content": "Read Democracy in America by Tocqueville . He talks at length about the advantages of the American town and state level powers. A thousand page book written by a French guy who admired our glorious new world experiment.",
                "author": "WesternCivilization"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung’s 24Gb 40 Gbps GDDR7 DRAM receives presidential award in Korea",
        "score": 491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This would result in 640GB/s of bandwidth on a 128 bit bus. If only it wasn't all destined for AI datacenters.",
                "author": "WuWaCamellya"
            },
            {
                "raw_content": "gee i wish my country was able to fucking print money outside of oil",
                "author": "SignalSatisfaction90"
            },
            {
                "raw_content": "And I bet 90% of it is going to be put in ai gpus",
                "author": "Username999474275"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Things you can do with 8gb GPU's.",
        "score": 14,
        "text_content": "I just recently got a good deal on an RX 9060xt 8gb, knowing the types of games it could play. So far, it can: - Play Minecraft with shaders at 4k and massive draw distance (modded). - Play Need for Speed: Unbound at 4k with high details, framegen 100+ FPS. - World of Warcraft at 4k high details. If you aren't interested in upcoming games, these new budget 8gb cards can be a great deal.",
        "comments": [
            {
                "raw_content": "8gb is enough for a wide range of games but when you get to AAA titles , yeah you begin to struggle. Considering AAA games deliver a graphical experience too , you need to have certain settings enabled to be able to enjoy what you bought. Alan wake for example is a huge vram eater. Other games too. If you can , buy a 16gb vram GPU. It is way more future proof.",
                "author": "soa008"
            },
            {
                "raw_content": "I ended up with an RTX 4060 after my GTX 1070 unceremoniously kicked the bucket last year, because it was the only card I could get for a reasonable sum at the time. It's honestly perfectly fine for most things. Even more so for what I'm actually interested in playing, which rarely includes the latest and greatest unoptimized AAA whatever that barely works even on the most expensive hardware.",
                "author": "repocin"
            },
            {
                "raw_content": "8gb gpus are less a problem of what you can do and more a problem of what you cant do. sure its great you can play a ton of games, but it sucks when the one game you really want to play just doesnt work",
                "author": "LuminanceGayming"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Rocked by Executive Departures, With Chip Chief at Risk of Leaving Next",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean it makes sense for the man when he has achieved every success with the M chips, probably wants to take on wider scope projects outside of Apple. Especially in the AI factory boom like now.",
                "author": "bazhvn"
            },
            {
                "raw_content": "The salaries other tech companies are insane for top tier talent. The job market on the lower-mid range is terrible but if you are a top tier AI or hardware engineer it’s a great time.",
                "author": "dabocx"
            },
            {
                "raw_content": "5 bucks says Intel CTO.",
                "author": "darknecross"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung reportedly wins majority of Nvidia's 2026 SOCAMM2 supply",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One of the rare occasions where clicking on the article results in nothing gained vs just reading the headline",
                "author": "GNRZMC"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Restores PhysX Support for Select 32-Bit Games on GeForce RTX 50-Series GPUs",
        "score": 300,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I made a post nearly a year ago about [this](https://www.reddit.com/r/pcmasterrace/s/tDKw62YjTE). I am glad the games that I used as examples in the discussion mostly made the cut. Funny, I was thinking about physx recently and is nice to see Nvidia responded to community feedback (they reference the community in the patch notes, so maybe all the discussion around it at the time started off the process)",
                "author": "pleiyl"
            },
            {
                "raw_content": "Neat for my current Borderlands 2 run. RTX 5070ti and Ryzen 7800X3D were struggling trying to brute force the PhysX dipping into the 40s and 50s at times",
                "author": "Wasted1300RPEU"
            },
            {
                "raw_content": "I actually wonder how this is implemented.",
                "author": "SomeoneTrading"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia: \"Olympus CPU Core Software Optimization Guide\"",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Highly binned Arm V9.2-A Vera core, in case anyone was wondering what the non marketing meaning behind \"Olympus\" is.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Will be curious how soon it can be tested. 88C/176T in a “50W” package is already fun to see. 1:27:20 here: https://www.youtube.com/live/_waPvOwL9Z8?si=z3pFZU3wCclyl9r7",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HUB - $250 GPU Battle: Arc B580 vs RTX 5050 Performance Compared",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: GPU Models Tested: MSI Shadow 2X RTX 5050, Intel Arc B580 FE 16 games average: 1080P, High-Ultra Settings: Native TAA: Arc B580 is 14% faster, 23% faster at 1% lows due to higher VRAM DLSS 4 Quality vs XeSS Ultra Quality: Arc B580 is ~11% faster DLSS 4 Quality XeSS Quality: Arc B580 is ~20% faster DLSS 4 Balanced XeSS Balanced: Arc B580 is ~15% faster DLSS 4 Performance vs XeSS Performance: Arc B580 is ~14% faster",
                "author": "Antonis_32"
            },
            {
                "raw_content": "\"There was a time, about a decade ago when the $250 price tag offered solid products, but the world has changed\" Yep, inflation. $250 in 2015 money is $342 in todays money. And you can get a very solid product at that price tier, the RX 9060 XT is $369 on Newegg. GPU prices haven't gone up, you money is just worth way less.",
                "author": "atape_1"
            },
            {
                "raw_content": "I'd still probably go nvidia here as I don't trust intel's compatibility with older titles and the like. Still it would probably be better to spend $20 more on a 9060 xt 8 gb or $50 more on a 5060 than either of these.",
                "author": "JonWood007"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phoronix: \"Jolla Trying Again To Develop A New Sailfish OS Linux Smartphone\"",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Without a known processor i can't preorder, plus i would kill for an ARM Linux Tablet more than a Phone tbh They don't need to make the hardware, just partners with a Chinese OEM like Nubia/Red Magic",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "Not open source. Pointless",
                "author": "Wrong-Historian"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo grifters be like:",
        "score": 702,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just bought a Switch 2 yesterday, and I am very pleased. Playing through Prime 4 now and loving it, and I'll probably get Xenoblade Chronicles X next, since I missed out on that on the Wii U and the Switch 1. I so wish we could get a modern release/port/remaster of Xenogears as well... Probably going to be getting a Switch 2 Pro controller eventually too, because I keep mine docked and never really play handheld.",
                "author": "xTheDaltonatorx"
            },
            {
                "raw_content": "Nintendo channel these days",
                "author": "Old-Program3638"
            },
            {
                "raw_content": "I feel like buying another Switch 2.",
                "author": "Soultab"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Playstation 5 sold almost 2x as many units as the Nintendo Switch 2, during Black Friday week in the United States.",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the ps5 had some pretty big discounts",
                "author": "Environmental_Bus623"
            },
            {
                "raw_content": "What the heck is a NEX Playground",
                "author": "Glittering-Job4016"
            },
            {
                "raw_content": "Almost like retailers should have put the bundle on sale earlier instead of after Black Friday",
                "author": "irishyardball"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Forget Metroid, anyone buy Octopath Traveler 0?",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Octopath 0 made me remember that I still have 2 to play lol. Playing that after I get through DK.",
                "author": "tripleaamin"
            },
            {
                "raw_content": "How is it? I loved 2 especially, but a bit apprehensive on this one, as it looks very different.",
                "author": "xavadar"
            },
            {
                "raw_content": "I love how this game looks but I almost always end up not finishing octopath games lol Glad you're enjoying it!",
                "author": "Playful_Lecture7784"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just got delivered by Amazon!",
        "score": 302,
        "text_content": "Saw overnight delivery from Amazon last night and I couldn't resist I was a bit hesitant since I've never been into the first person Metroids, but it looked really good in trailers so here we go",
        "comments": [
            {
                "raw_content": "Is no one gonna mention the game to the right of Metroid Prime???",
                "author": "Creative_Eye7413"
            },
            {
                "raw_content": "Wtf is BDSM lol",
                "author": "LinkToThe_Past"
            },
            {
                "raw_content": "Lol, the dogs know they aren't going on a walk for awhile. Enjoy!",
                "author": "Englefrid"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I have really enjoyed the first 6 months of switch 2 its have been incredible!",
        "score": 98,
        "text_content": "Typically when a new consoles comes out there is little to play on it for like first year and its sales are basically just living off hype of being newer tech. DK bananza is a all timer such a great game cant say enough about it looks really good to total system seller and has someone who has dktf pretty high on there all time favorite game list to having to wait so long for another dk game was hard hope its not like 11 years before we get another dk game again. Metriod prime 4 enjoing a good amout looks amazing soundtrack is nice and this is my first metriod has i tend to hate fps has I just dont like first person camera view and perfer 3rd person always. But people where right in that its more of adventure/puzzles than a shooter atmosphere is solid to. Being my first game in the franchise and not the type of game i really play i am getting stuck at times going much slower than most people are probably going. Mario kart world open world is just chilling and relaxing game has a lot to do gets to much hate. Fast fusion i have to need to play more. Getting new content for kirby and the forgotten land was cool has the regular game was good and some more content that is basically like buying a 20 dlc i have no problem with. Backwards compatibility is good i know there are some games people would like to get patches that have not the 2 that come to my mind are luguis mansion 3 and Zelda SS HD just thanking give us 4k. But i have replayed bowsers furry, mario odyssey and they look a lot better than before. I started replaying zelda echos of wisdom looks great. Only played a little bit more of splatoon 3 but it looks unbelievable more clear than before. Having a spin off splatoon announced is cool hopefully we get a release date announced for that in a feb direct. Between metriod prime 4, mario kart world, DK bananza, kirby forgotten land dlc and replaying games that have been patched/switch 1 backlog there is already a lot to play. I cant wait for next 3d zelda but i know games take time and you are not going to get everthing in just first year.",
        "comments": [
            {
                "raw_content": "Yea I’ve been on Mario Kart World which is relaxing and stress free as you’ve said. And totk which is an amazing game of course and runs flawlessly on switch 2. Gonna open Metroid on Christmas. Hoping I can get into it I just started really getting back into gaming recently.",
                "author": "Miserable_Air_4292"
            },
            {
                "raw_content": "It’s essentially everything I enjoyed about the switch but better. Really looking forward to the future when it’s all said and done this might be my favorite Nintendo console ever.",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "There have been good games, but compared to switch 1 it's lacking that 1-2 punch of Mario Odyssey and Breath of the Wild. Those types of games are surely coming, but as of now we're being served \"merely\" good games.",
                "author": "ajswdf"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 reviews for the non-purist",
        "score": 27,
        "text_content": "Most negative reviews seem to be from someone with a very rigidly defined idea of what a Metroid game needs to be/not be. Those reviews feel applicable for other purists, but feel hard to know how to properly weigh them as a non-purist. If I’m not a Metroid purist, just someone who enjoyed MP1 remastered, will I enjoy the game? Looking for reviews from average gamers Edit: to clarify, those reviews aren’t inherently wrong. it’s just not a perspective that’s as useful for me, a casual player, who will weigh things very differently when determining if a game is enjoyable. I’m not looking for positive reviews, I’m looking for reviews from people who played from a casual perspective.",
        "comments": [
            {
                "raw_content": "Yup, I've been playing the game over the last few days, and I've been loving it. There are some genuine criticisms that can be made about the game, but I feel like we're going to end up with a Skyward Sword situation with Prime 4, where there was overblown hate when it was released, but years later people look back on it fondly.",
                "author": "HamFan03"
            },
            {
                "raw_content": "I’m not a purist, I’ve been loving it. It feels very Halo light. Like an action game primarily mixed with puzzles and some Metroidvania stuff. So far what I’ve really loved about it is the pacing . It feels more casual. If you go into it thinking “I want to play a beautiful action game that tells a mysterious story with some Nintendo game feel flare” I think you’ll have a lot of fun. Really what the purists are saying is “it doesn’t check every box in one genre well”. I think that’s fair feedback. For example, since it’s more Halo like there’s been times I wish I had a melee attack like master chief. There’s moments where the game feels like you should be able to do more but can’t. But…I keep wanting to go back and complete the story and it’s just so beautiful. Honestly it should get an award for art direction on Nintendo.",
                "author": "Vrayl_of_Gondor"
            },
            {
                "raw_content": "It’s a great game in its own right. I’d say if you’re not comparing it to some ideal you have, you’ll enjoy it.",
                "author": "MrEMannington"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After 6 months coming from a Switch 1, how do you feel about the eShop on a Switch 2?",
        "score": 266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not the type of person who keeps scrolling on Eshop, I just enter to buy a game I already have in mind. But it's really good how quick it is.",
                "author": "kahabraham"
            },
            {
                "raw_content": "I can scroll past the hentai games a lot faster.",
                "author": "RetroGamer9"
            },
            {
                "raw_content": "UI is way more palatable this time around. What I have a problem with is the amount of shovelware and no name mid stuff pushed. There's absolutely no reason something with middling reviews and absolutely no brand should be anywhere near the highest suggested stuff on the sales tab. There's also no reason for AI puzzle hentai bullshit to sit above something like Dragonball Xenoverse on the shop. Makes one miss when Nintendo was actually strict about their eShop, even steam at least buries that shit all the way down in the sales tab",
                "author": "Cozy-Panda777"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My AC Shadow’s is crashing every 15 minutes. What am I doing wrong?",
        "score": 101,
        "text_content": "I’m not sure how anyone can play this. Sat down to play for an hour for the first time whilst the wife was out and it’s crashed 3 times already. Barely made any progress as I keep having to re trace old ground… Might have to request a refund. Anyone know if it’s possible?",
        "comments": [
            {
                "raw_content": "It’s an issue with docked mode that still hasn’t been fixed. If you google it, so many people have had the same issue and even Digital Foundry has spoken about it. Playing in handheld is the only stable way for now tbh. Ubisoft has a patch coming next week.",
                "author": "Odd_Company3041"
            },
            {
                "raw_content": "Start it in handheld and dock it after loading your savefile. Will fix it for the session.",
                "author": "NintendoGalaxyYT"
            },
            {
                "raw_content": "r/tvtoohigh",
                "author": "sourcematerialx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GameStop leaks second playable character in RE9 (SPOILERS)",
        "score": 199,
        "text_content": "https://www.gamestop.com/pc-gaming/pc-games/products/resident-evil-requiem-deluxe---pc/20023062-2a094304.html * The Deluxe Edition includes the PC Steam Digital Code, a SteelBook Case, and the following digital content: * \"The Sanctuary\" Expansion Pass: Includes 2 new story scenarios and a major Mercenaries mode update. * \"Morphic Visor\" Cosmetic Filter: A unique cosmetic look for Rose's visor. * \"Shadow Walker\" Costume Pack: 3 exclusive outfits for Rosemary Winters. * Digital Artbook & Official Soundtrack It's Rosemary, not Leon. Archive link in case it's removed from the listing description: https://archive.ph/OFw6o EDIT: The listing has now been altered to remove all mentions of the DLC and Rosemary. > Survival isn’t guaranteed, only the creeping dread that every step forward may be your last. On PC, the Resident Evil Requiem Deluxe Edition delivers the full game along with five character costumes, four weapon skins, two visual filters, two weapon charms, the “Raccoon City Classic” audio option, and the “Letters from 1998” bonus files, all fully optimized for the strongest of people willing to brave Requiem. > The Deluxe Kit contains the following content: > > Five costumes including Grace's Costume: Dimitrescu > Two filters including Filter: Apocalypse > Four weapon skins including S&S M232 Weapon Skin: Apocalypse > Two charms including Charm: Mr. Raccoon > Audio Pack: Raccoon City Classic > Files: Letters from 1998",
        "comments": [
            {
                "raw_content": "Leak subreddits are nicer about warning for spoilers then most moan subs it's funny",
                "author": "marsgreekgod"
            },
            {
                "raw_content": "Pretty sure rose is still like 6-7 years old In RE 9. Unless it's future rose that would participate in the game.",
                "author": "Live_Present_2602"
            },
            {
                "raw_content": "if this turns out to be true we really need to get anything regarding DuskGolem to be banned from this sub",
                "author": "DKG9512"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "With TGA 5 days away, here is the current list of Confirmed vs. Likely reveals (Dec 6 Update)",
        "score": 563,
        "text_content": "We are in the final stretch. Based on the latest press releases and credible leaks (DuskGolem, etc.) from this week, here is what we are looking at for Thursday: CONFIRMED / LOCKED IN: Resident Evil Requiem: The title has been rated, and Capcom confirmed a \"World Premiere\" slot. Exodus: New gameplay trailer confirmed by Geoff. Neon Giant's \"Project Impact\": The devs tweeted a teaser for the 11th. HEAVILY RUMORED / LIKELY: Death Stranding 2 (PC Port Date): Kojima is in LA. It’s happening. Control: Resonant: The trademark just filed this week matches the \"Remedy\" slot rumors. Silent Hill Remake (Update): Konami has been quiet, but insiders are saying we get a release date here. DEBUNKED / UNLIKELY: Half-Life 3: (Obviously). GTA 6: Rockstar usually does their own thing, don't hold your breath for a trailer here. What is your \"One Last Hope\" dream announcement for this year? For me, I'm still clowning for a Bloodborne remake/remaster announcement.",
        "comments": [
            {
                "raw_content": "Debunked and Unlikely should be separate categories",
                "author": "AbyssNithral"
            },
            {
                "raw_content": "I don't know what I want to see, just show me something that's coming out in 6 months or less not 3 fucking years from now",
                "author": "Cyrisaurus"
            },
            {
                "raw_content": "It would honestly be weirder if Kojima didn't show up at a TGA show.",
                "author": "Nanocaptain"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kurakasis: The title of the \"big upcoming Star Wars announcement\" ends with \"The Old Republic\".",
        "score": 828,
        "text_content": "Source: [https://xcancel.com/Kurakasis/status/1997385253795590237#m](https://xcancel.com/Kurakasis/status/1997385253795590237#m)",
        "comments": [
            {
                "raw_content": "For some reason this makes me less sure it's KOTOR.",
                "author": "KingMan753"
            },
            {
                "raw_content": "Imagine it being a new hero shooter with the name of something like \"Star Wars: Heroes Of The Old Republic\"",
                "author": "Squallexino"
            },
            {
                "raw_content": "Knights of the Even Older Republic",
                "author": "CptDalek"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Draconis (aka \"Ooze\") Cancelled Sony/Deviation Games Gameplay Footage",
        "score": 77,
        "text_content": "Ooze cancelled game, actual working title was Draconis. I called it Ooze since I thought that'd be funnier, hide the code name while it was in dev, and it was the name of the enemies within the game. The game was being funded/supported by Sony, and developed by the now closed down Deviation Games. Had about an hour of footage of this thing, sharing about 10 minutes now that I know for sure it's not turned into something else and is just a full-on cancelled game. Which sucks since I actually was looking forward to it, but what can you do? [https://www.youtube.com/watch?v=\\_Fs7FNLad64](https://www.youtube.com/watch?v=_Fs7FNLad64) [https://www.youtube.com/watch?v=y5jhJxRhirg](https://www.youtube.com/watch?v=y5jhJxRhirg) Video was split into two parts so I could also post it on Twitter.",
        "comments": [
            {
                "raw_content": "Dusk, did you see the last thread posted here? About Rosemary being the second player character?",
                "author": "Dark_Jooj"
            },
            {
                "raw_content": "This looks great for early footage. Shame it was cancelled",
                "author": "Severe-Committee6240"
            },
            {
                "raw_content": "I thought it was a People Can Fly game.",
                "author": "Systemshock1994"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Early footage of starship troopers extermination has leaked",
        "score": 191,
        "text_content": "https://youtu.be/hac5h5gY_3A",
        "comments": [
            {
                "raw_content": "Honestly, the perfect Starship Troopers template was Helldivers 2. They were beaten to the punch.",
                "author": "Snoo_5808"
            },
            {
                "raw_content": "I'm out of the loop. This is the 2024 game right? I googled and saw a new update recently released. Is this some future update leak?",
                "author": "UsingTrash"
            },
            {
                "raw_content": "God this game was so disappointing after being such a fan since as a kid.",
                "author": "robjwrd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Raiders Society: a new remake of Tomb Raider (1996) rumored to be announced in TGA 2025.",
        "score": 291,
        "text_content": "This comes from a Tomb Raider news account who got things right and wrong before, so take this with a grain of salt. https://xcancel.com/RaidersSociety/status/1997388175656800702",
        "comments": [
            {
                "raw_content": "This game has both a remake and a remaster. It's one of my very last choices when it comes to PS1 remakes.",
                "author": "Stolen_Meme_Poster"
            },
            {
                "raw_content": "![gif](giphy|WRRIEjIXvWFUlOIFi0)",
                "author": "KekanKok"
            },
            {
                "raw_content": "there's one game begging to be remade in the classic series.. 🫠",
                "author": "TheIncredibleBucket"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier says statue game is “very cool and many will be excited for it”, doesn’t know if Cory Barlog’s game will be at TGA”",
        "score": 879,
        "text_content": "[https://maximumfun.org/episodes/triple-click/gamings-biggest-night-xii-the-revenge/](https://maximumfun.org/episodes/triple-click/gamings-biggest-night-xii-the-revenge/) On Triple Click at 53:05 Jason said he doesn't know if SSM plans to announce Cory's game at TGA To summarize Jason from the past few days: * The statue game is \"a good one\", something that a lot of people will be excited for, including the 3 members of Triple Click * He hasn't specifically said as much but from the wording and the attempt on both Geoff side and Jason side to create speculation to me heavily suggests it's an unannounced game, so we can rule out Lords of the Fallen 2 * Jason has publicly ruled out Diablo and ES6 * On Cory's game at Santa Monica he said he doesn't know if that will be announced at TGA, so we can cross that out as well * He also made some guesses on games that could be there that he didn't have insider info for that we can cross out: Tomb Raider, Control 2, Persona 6 * He also said he doesn't expect much EA stuff there at all * He raised that Ubisoft could show PoP and AC BF but PoP was already officially deconfirmed and Nate and Shinobi both said ACBF won't be there either Credit to Modiz on Resetera for the summary",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Whatever it is, I just hope it’s not an already announced game like some people are guessing",
                "author": "kargethdownload"
            },
            {
                "raw_content": "Beyond Good & Evil 2 will be there. Trust me.",
                "author": "Time_Hater"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RE9 \"Second Character\" is only playable in scenarios and not the base game",
        "score": 27,
        "text_content": "Source is a [random web site](https://www.gameplayla.com/product-page/resident-evil-requiem-playstation-5) doing some quick googling Multiple web sites mentioning **morphic visor** makes it legit imo >Face the terror of a new age with Resident Evil Requiem on PlayStation 5. This final chapter in the Winters family story follows Rosemary Winters as she investigates the sinister neo-Umbrella group, \"The Sanctuary.\" The gameplay returns to third-person survival horror, blending classic combat with Rose’s new psychic abilities and the \"Morphic Visor\" used to explore psychic memories. Feel every jump scare and every shotgun blast through the DualSense controller's unique haptic feedback.",
        "comments": [
            {
                "raw_content": "The description says re9 is about rosemary winters and that the game will be in third person. It's just an ai generated description lol",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "this is definitely AI generated, because it makes no mention of Grace, and it’s not referred to as a scenario, but it’s supposedly the base game",
                "author": "Systemshock1994"
            },
            {
                "raw_content": "Wasn't this kind of the plot of RE 8 DLC?",
                "author": "MakoInariYT"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake \"Arc B390\" iGPU Benchmarks Leak: 16% Faster Than AMD Radeon 890M, 83% Faster Than Lunar Lake \"Arc 140V\"",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact 890M is that much faster than 140V shows this benchmark is terrible anyway. In real gaming performance, 140V performs very close to 890M and does so at usually superior efficiency.",
                "author": "elmagio"
            },
            {
                "raw_content": "Almost 7600m performance ie stream machine. From a igpu . Hoping a handheld with this igpu under 1000usd",
                "author": "pixel-spike"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Several Intel Panther Lake CPU Benchmarks Leak: Core Ultra 7 366H, Ultra X7 358H, Ultra 7 365, & Ultra 5 332, First Panther Lake Handheld Spotted",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn it Bobby, I read the wccftech comments and remembered why I hate that website lol Even though I got a LNL MSI Claw 8 AI+ already, I'm really looking forward to a PTL handheld.",
                "author": "Molbork"
            },
            {
                "raw_content": "I have a Steam Deck OLED, and I absolutely love it. However, I will be very tempted to jump to a Panther Lake handheld that has SteamOS compatibility.",
                "author": "SSSl1k"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Arc Battlemage \"BMG-G31\" GPU Receives Brand New Support By The Chipmaker Itself, Is Big Battlemage Finally Ready For Launch?",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will be a interresting CES",
                "author": "Leicht-Sinn"
            },
            {
                "raw_content": "I'm half-expecting this to show up as a server-only AI-focused SKU with video outputs removed.",
                "author": "lusuroculadestec"
            },
            {
                "raw_content": "They can't even ship B60's.",
                "author": "Tai9ch"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "MSI presents first laptops powered by Core Ultra 300 \"Panther Lake\" CPUs - VideoCardz.com",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got a chance to check out panther lake on some upcoming products. I was impressed.",
                "author": "DannyzPlay"
            },
            {
                "raw_content": "16\" 'creator' laptop with no numpad? Annoys me every time. There's room. Blender is horrible without a numpad.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Gigabyte Z890 motherboards now ready for Core Ultra 200K Plus Arrow Lake Refresh",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "I was told this sub may appreciate this picture",
        "score": 498,
        "text_content": "Still waiting for the 9060 XT 16GB for my AMD build.",
        "comments": [
            {
                "raw_content": "7500F gang here. This is the most fascinating shot here. I don't know, it will be worth making a portrait picture to hold on a wall.",
                "author": "Juggernaut_911"
            },
            {
                "raw_content": "Lovely color work",
                "author": "Symphonic7"
            },
            {
                "raw_content": "Its a shame we have to stick (mostly) ugly coolers on them",
                "author": "MayorDomino"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D is 4.7% faster than 9800X3D in leaked PassMark test",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "The biggest factor of whether this will be loved or ignored *(regardless of price)* is we know that it's going to be higher binned chip, but for overclockers, if the memory controller on it is improved and people can push RAM overclocking into the 8600Mhz to 9000Mhz, then it will sell out amongst enthusiasts instantly. I expect Zen 6 to be able to do 9000Mhz+ but if they can squeeze out some extra juice with the 9850x3d on current generation, then it'll get the enthusiast community excited until Zen 6 drops.",
                "author": "FacelessGreenseer"
            },
            {
                "raw_content": "PassMark, my favorite game.",
                "author": "GSDragoon"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "RIP QT; long live ‘reserve management purchases’. Just please don’t call it quantitative easing, for Fed’s sake",
        "score": 7,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "06 December 2025 - Weekly /r/REBubble Discussion",
        "score": 5,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Florida: So many properties for sale. Even more for rent. Feels like the whole city I live in, small as it is, is “for rent” or “for sale”. Everyone just hoping the ground doesn’t tremble below them or hoping the water doesn’t rise.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Still making new highs where I am. Not expecting mortgages to respond before the year end.",
                "author": "TrainDifficult300"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "RIVR delivery poodle can do stairs",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": "geez. This has so much potential as a mobility device platform. A tri-cycle/ Tripod with this agility would beat out a motorized wheelchair. Hell you could just put a saddle on this thing and I'd buy that sumbitch for $10k",
                "author": "DHFranklin"
            },
            {
                "raw_content": "fkn piece of shit that's my job! I'm cooked, aren't I?",
                "author": "Choice_Isopod5177"
            },
            {
                "raw_content": "https://preview.redd.it/qzo8w0oy4n5g1.png?width=1280&format=png&auto=webp&s=e88a6d7b267e80825a10205930961fa4aec39911 Sneak 100",
                "author": "PwanaZana"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boston Dynamics plans to mass-produce their humanoid robots",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When you’re busy making AI pics and you remember you’ve had pizza rolls in the oven for 45 minutes https://preview.redd.it/m30ws51ltn5g1.jpeg?width=1099&format=pjpg&auto=webp&s=864912e652d43b9f121f7037704082c15858d031",
                "author": "SuspiciousPrune4"
            },
            {
                "raw_content": "This (or something like this) is what will really change the world. AI being good at computer jobs is one thing, but AI being able to climb into any existing machinery designed by humans, and operate them at 100% efficiency, nearly 24 hours a day... Oh, and the machine costs $24k, with a $200 monthly subscription. We need this to happen for UBI. Just replacing white collar jobs wont increase the economy, but an army of blue collar workers that are much cheaper than even minimum wage, changes the world.",
                "author": "fmfbrestel"
            },
            {
                "raw_content": "Im 52. My wife and I don’t have kids and our extended family is tiny. We need 1-2 of these in 2050 versions to take care of us in our late 70s and 80s. Otherwise we’ll just die neglected in our homes like Gene Hackman and his wife.",
                "author": "Electronic_Rub9385"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Just when we thought we’d seen it all in robotics",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, if they also would function as feet: insects are very successful…",
                "author": "marcandreewolf"
            },
            {
                "raw_content": "Literally nobody thinks we’ve seen it all",
                "author": "shittythreadart"
            },
            {
                "raw_content": "![gif](giphy|mBGcqUJQWR3zHIqHdT|downsized)",
                "author": "LettuceSea"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MechaHitler will have strong rival",
        "score": 1081,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wouldn’t be surprised if it’s a deepseek wrap",
                "author": "Who_watches"
            },
            {
                "raw_content": "Another crypto-style rug-pull to fleece his loyal followers...",
                "author": "JackStrawWitchita"
            },
            {
                "raw_content": "It's gonna be a chatGPT wrapper that imitates him and magas are gonna send it tons of money.",
                "author": "inculcate_deez_nuts"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "With current advances in robotics, robots are capable of kicking very hard.",
        "score": 754,
        "text_content": "Do you think this robot’s kicks are strong enough to break a person’s ribs?",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/5yh011yg6l5g1.png?width=588&format=png&auto=webp&s=898ff8887be55c7b7e3dad605cac5e8cb3b86d6b Last thing you ever see",
                "author": "Kenny741"
            },
            {
                "raw_content": "I assume there are already robots which have machine guns for arms and lasers on their heads in labs around the world...",
                "author": "KoalaDeluxe"
            },
            {
                "raw_content": "![gif](giphy|C3DJ5zE2l2VUc)",
                "author": "artdude41"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LaserWeeder G2, removing weeds without any chemical use",
        "score": 196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Accuracy must be very high. Much smaller automated turret set up is needed mosquitos and bed bugs.",
                "author": "brihamedit"
            },
            {
                "raw_content": "Can we get one for bugs next?",
                "author": "Imhazmb"
            },
            {
                "raw_content": "Now that would be genuinely useful!",
                "author": "Profanion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis: We Must Push Scaling To The Absolute Maximum.",
        "score": 537,
        "text_content": "Very interesting snippets from this interview. Overview by Gemini 3: https://youtu.be/tDSDR7QILLg?si=UUK3TgJCgBI1Wrxg >Hassabis explains that DeepMind originally had \"many irons in the fire,\" including pure Reinforcement Learning (RL) and neuroscience-inspired architectures [00:20:17]. He admits that initially, they weren't sure which path would lead to AGI (Artificial General Intelligence). >Scientific Agnosticism: Hassabis emphasizes that as a scientist, \"you can't get too dogmatic about some idea you have\" [00:20:06]. You must follow the empirical evidence. >The Turning Point: The decision to go \"all-in\" on scaling (and Large Language Models) happened simply because they \"started seeing the beginnings of scaling working\" [00:21:08]. Once the empirical data showed that scaling was delivering results, he pragmatically shifted more resources to that \"branch of the research tree\" [00:21:15]. >This is perhaps his most critical point. When explicitly asked if scaling existing LLMs is enough to reach AGI, or if a new approach is needed [00:23:05], Hassabis offers a two-part answer: >The \"Maximum\" Mandate: We must push scaling to the absolute maximum [00:23:11]. >Reasoning: At the very minimum, scaling will be a \"key component\" of the final AGI system. >Possibility: *He admits there is a chance scaling \"could be the entirety of the AGI system\"* [00:23:23], though he views this as less likely. >The \"Breakthrough\" Hypothesis: His \"best guess\" is that scaling alone will not be enough. He predicts that \"one or two more big breakthroughs\" are still required [00:23:27]. >He suspects that when we look back at AGI, we will see that scaling was the engine, but these specific breakthroughs were necessary to cross the finish line [00:23:45]. Other noteworthy mentions from the interview: >AI might solve major societal issues like clean energy (fusion, batteries), disease, and material science, leading to a \"post-scarcity\" era where humanity flourishes and explores the stars [08:55]. >Current Standing: The US and the West are currently in the lead, but China is not far behind (months, not years) [13:33]. >Innovation Gap: While China is excellent at \"fast following\" and scaling, Hassabis argues the West still holds the edge in algorithmic innovation—creating entirely new paradigms rather than just optimizing existing ones [13:46]. >Video Understanding: Hassabis believes the most under-appreciated capability is Gemini's ability to \"watch\" a video and answer conceptual questions about it. Example: He cites asking Gemini about a scene in Fight Club (where a character removes a ring). The model provided a meta-analytical answer about the symbolism of leaving everyday life behind, rather than just describing the visual action [15:20]. >One-Shotting Games: The model can now generate playable games/code from high-level prompts (\"vibe coding\") in hours, a task that used to take years [17:31]. >Hassabis estimates AGI is 5 to 10 years away [21:44]. Interesting how different the perspectives are between Dario, Hassabis, Ilya: Dario: Country of Geniuses within a datacenter is 2 years away and scaling alone with minor tweaks is all we need for AGI. Ilya: ASI 5-20 years away and scaling alone cannot get us to AGI. Hassabis: AGI 5 to 10 years away, scaling alone could lead to AGI but likely need 1 or 2 major breakthroughs.",
        "comments": [
            {
                "raw_content": "I can't really imagine the impact of AI with two more Transformers/AlphaGo level breakthroughs tbh I suspect there will be a lot of change even before that(simply with scaling alone)",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "I mean considering that scaling is still showing positive results, it would be a bit stupid at this point not too keep pushing that branch to the maximum to see what happens. I personally think scaling won't necessarily lead to what you could consider AGI, but will still lead to systems that can automate huge portions of the economy, so in the end, the distinction won't matter that much.",
                "author": "NoCard1571"
            },
            {
                "raw_content": "I trust Demis more than Dario because Demis and his engineers are leading experts on more AI types than just LLM. Dario says scaling is all. He doesn’t have any expertise or resources on other AIs. Of course he would say that, because if it turns out more breakthroughs are needed, Anthropic is a dead-end project. Unlikely to ever reach profitability.",
                "author": "RockyCreamNHotSauce"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI improved +16% for best AI model end of 2025 on Polymarket bets",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sendddddd it",
                "author": "HyperspaceAndBeyond"
            },
            {
                "raw_content": "5.2 for the win?",
                "author": "Unlikely_Equal_4415"
            },
            {
                "raw_content": "it got the peace prize right",
                "author": "Jabulon"
            }
        ],
        "subreddit": "singularity"
    }
]