[
    {
        "post_name": "President Trump Will Fill Two Massive Court Vacancies as He Continues to Shape the Federal Judiciary",
        "score": 731,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Recant your appointment for ACB, its your appointment. Pick again.",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "He made some pretty fucking god awful decisions for the Supreme Court so far, so... I guess, good luck to us?",
                "author": "Reassess_Reevaluate"
            },
            {
                "raw_content": "I wish he would fill Roberts position.",
                "author": "Gopher47"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Da Troof Be Out Dere And Shit",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“I want to breath” ~ George Mulder",
                "author": "C0drus"
            },
            {
                "raw_content": "Chirp!",
                "author": "rugburnd"
            },
            {
                "raw_content": "Malcum X Files",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK ROYAL MINT PAYS ZAKAT DURING RAMADAN Sorry WHAT 😳‼️ The UK Royal Mint has announced a fundraising partnership with Islamic Relief in which money from sales of gold bars will be DONATED to them during Ramadan The UK is now directly funding the Islamic takeover of the west",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is money laundering 101.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "This is guaranteed terror funding. The UK is a state sponsor of Islamic terror.",
                "author": "ApprenticeParty"
            },
            {
                "raw_content": "When will people rise up?",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Video clip surfaces of Gavin Newsom bragging about reading a 260-page book in 90 minutes. This POS was just attacking people for being mean to him for having \"dyslexia\"",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gavin has an intellectual disability with a lying problem and it's not dyslexia. Most of the time what he's doing is acting to manipulate people. He's a fraud like the low IQ Somali frausters.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Psychopaths frequently use \"mirroring\" as a core part of their initial charm offensive. They observe their target closely and reflect back the person's positive qualities, interests, beliefs, or even personality traits to create an illusion of perfect compatibility and deep connection.",
                "author": "Psarg"
            },
            {
                "raw_content": "He is the most pandering, philandering sociopath ever.",
                "author": "iamstadter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Your terms are acceptable.",
        "score": 654,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quiet, piggy.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "If you live in Franklin, Tennessee, Mayra Angel @SimpliHomRealty wants you to not hire her. Spread the word and make her dreams come true!",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Also, we can tell you're fat. You're not fooling anyone by holding your blazer like that.",
                "author": "Wallllllllllllllllll"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow! Gavin Newscum just dropped out of the Presidential Race!!! President DJT",
        "score": 901,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Too bad he and his black constituents can't read the good news. Someone should let him know.",
                "author": "Fakehistory2"
            },
            {
                "raw_content": "He could go back to his shitty podcast",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "Shit! This is only going to elevate AOC's poll numbers!!!! /s",
                "author": "Framus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DENNIS QUAID RIPS HOLLYWOOD FOR GOING TOO FAR LEFT, SAYS TRUMP IS ‘REALLY GENUINE’ & CARES ABOUT HIS SUPPORTERS",
        "score": 1101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He flipped me off one time in San Diego",
                "author": "elcomedian"
            },
            {
                "raw_content": "Media is bombarding young minds with constant negativity while congress rips the economic rug out from under them with destructive policies. They're leaving youths with no other option but communist revolution. That's why Charlie Kirk had to die, because he was showing them a better way forward with optimistic hope for the future.",
                "author": "utfanx2"
            },
            {
                "raw_content": "I loved this guy in Movie 43",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Woke Hollywood blacks try to destroy the X-Files",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Aks Files",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Mulder: \"People think it don't be like it is.. but it *do*.\" Scully: \"Sheeeeeeeeeeeeeit...\"",
                "author": "seeling0"
            },
            {
                "raw_content": "The Chirp is Out There.",
                "author": "EJay_Scott"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mass illegal migration is undermining AMERICAN ECONOMIC PROSPERITY. Four disastrous years of wide open borders under the Biden administration allowed 5% of ALL Hondurans to illegally enter our nation. Many of these Hondurans sent remittances back home — making up 27% of the Honduran economy and",
        "score": 912,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not just going to other countries, it's money taken from small states being handed out to freeloaders and spent in big states. It is theft and taxation without representation. Wyoming should not be subsidizing California's economy. Enforce the 10th amendment and let states manage their own welfare programs.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Now do India and Jeet1B. Hint its $135 billion and India's government wants it to be $300 billion.",
                "author": "one_cool"
            },
            {
                "raw_content": "Let us not forget the last 40 years of selling out American manufacturing to foreign labor.....",
                "author": "RobFromTechServices"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "POWERFUL VIDEO: Today reminds us what real leadership looks like. President Trump stood with Angel Families devastated by illegal alien crimes — tragedies that should never have happened.",
        "score": 664,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best President in the history of America 🇺🇸",
                "author": "awsure"
            },
            {
                "raw_content": "We never voted for illegals to come into our country by the millions and millions through open borders. 2020 election was stolen along with the lives that were murdered. The Angel Families lost the most in the most brutal ways and America lost our innocence with their loss. They have to go back. GTFO.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Arrests?",
                "author": "yurimodin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: At Lucille Umbarger Middle School in Burlington, WA, two unhinged students brutally attacked a girl after she refused to say whether she supports Trump and ICE.",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sue the shit outta the school district",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Don't send your kids to school with violent animals.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Drop to the ground have them call an ambulance. Roll your eye's back while on the gurney start jerking like your having a seizure as there wheeling you into the ambulance. Then hire a lawyer and sue the living shit out of the School , the City and the girls parents. You'll see how fast those two girls are charged with assault. And a nice payday to boot.",
                "author": "Trumpdeasses"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yet another liberal woman who fled the U.S. to another country to “escape Trump’s America” is now facing massive regret, stating she doesn’t think she made the right decision uprooting her children’s lives and can’t go back because they sold everything.",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no refunds",
                "author": "eddieblasphemy"
            },
            {
                "raw_content": "Sorry lady, you're not muslim so you can't just move somewhere and live there for free.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "When I moved from a 💩hole democrat city to a quiet town, I felt like I was walking on clouds for that whole first year. Never had a single moment of doubt I was making the right decision. To answer your question lady, none of this is normal and you completely screwed up your life. Have fun.",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mortgage rates dropping",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mortgage rates dont mean anything when home prices and materials prices are shot to the frigging moon.",
                "author": "FattestConsequence"
            },
            {
                "raw_content": "Rates don't mean shit. I had a 2.75% rate, just fully paid off my house this past month. I'm looking for a bigger house with more land, but prices of the houses are out of control. I plan on keeping my current home as a rental, but until the actual prices come down, I'm not moving, these things need to drop 40%.",
                "author": "soonerpet"
            },
            {
                "raw_content": "It was 2% in the last 4 years. I should have refinanced.",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A clip from the Canadian Broadcasting Corporation promoting travel to Mexico over America due to Trump derangement syndrome is going viral following cartel CJNG’s attacks on numerous Mexican states.",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The TDS on Canadian Broadcasting Corporation is almost unbelievable",
                "author": "GoldenEarz"
            },
            {
                "raw_content": "Enemies to our North. Enemies to our South. Did someone say Manifest Destiny?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Waiters and bartenders on Florida's West Coast are earning 11% more this season! Congratulations!",
                "author": "Spacedigit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: CBS News Contributor Peter Attia has just RESIGNED after disturbing emails between he and Jeffrey Epstein were discovered in the newly-released files.",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Face almost looks like Epstein too. No hair though.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Attia - deranged TDS fucker fake news shill pedo.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Kid fucker.",
                "author": "CastrosLittleBastard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kek",
        "score": 1046,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Best meme. Top KeK.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "The Canadians will never live this down.",
                "author": "RationalThought"
            },
            {
                "raw_content": "KEK!",
                "author": "TaxDollarsHardAtWork"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump : Numerous stories from the Fake News Media have been circulating stating that General Daniel Caine, sometimes referred to as Razin, is against us going to War with Iran. The story does not attribute this vast wealth of knowledge to anyone, and is 100% incorrect. General Caine, like all of us,",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We are done with the sand niggas President Trump… and that includes BOTH SIDES.",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "If the strikes on the nuclear facilities were successful how is Iran still “weeks away” from a nuke?",
                "author": "CocaineShark"
            },
            {
                "raw_content": "Endless wars for Israel will never stop until the boomers are dead and buried.",
                "author": "Trumpwon306"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "USA! USA! USA!",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Save the water cannons for the paid protesters.",
                "author": "cwoalf3"
            },
            {
                "raw_content": "and the girls hockey team ? this shows no one cares about woman's sports. Just the girls playing it, the people who are paid to be there, their families and friends.",
                "author": "TheGreenDragon"
            },
            {
                "raw_content": "And the nameless cunt who faceplanted in the snow after trashing America was probably boo’d",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kei Starmer had the police give child rapists \"warnings\" instead of putting them in jail.",
        "score": 1229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We haven’t even done that much.",
                "author": "Kickass2001"
            },
            {
                "raw_content": "I would say he should be hanged, but really what are the odds he is even forced to resign lol",
                "author": "nolefthandshakes"
            },
            {
                "raw_content": "His \"Police Officers\" were participants in the rapes and took bribes to turn a blind eye. seehere: https://patriots.win/p/1ASFvT6joc/the-uk-rape-gang-stuff-is-genuin/c/4eaTZTDYt8B only in England can the leader of the nation allow the defilement of it's children at the hands of filthy Muslims and he gets to keep his snout in the trough of the top job.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember when it was \"Women and Children first\" ?",
        "score": 1158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Cartels attack, gays and trans hit hardest.”",
                "author": "Kimball_Kinnison"
            },
            {
                "raw_content": "They added numbers? We always joked they'd add more alphabet but they bamboozled us!",
                "author": "ciabattabing16"
            },
            {
                "raw_content": "Is there a GoFundMe we can donate to help the cartel in this regard?",
                "author": "Oodles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ASML unveils new EUV light source that could yield 50% more chips by 2030",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey it’s that triple laser pulse thing Asianometry talked about a while ago.",
                "author": "EnglishBrekkie_1604"
            },
            {
                "raw_content": "The most exciting part is that the path for 1.5kw is already laid out and they don't see technical challenges stopping them before 2kw. Current output is AFAIK 600W This will lead to cheaper and cheaper 4nm and below chips",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "It'd be more useful if the improvement could be retrofitted to existing EUV machines, even the deployment of high-NA machines is incredibly slow and it sounds like those won't benefit.",
                "author": "Kougar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AllThingsOnePlace: \"240W USB C Charging is HERE!\"",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only a bit more and they can mount this as an extra PCIe power unit to power the GPU",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Favorable Wi-Fi 7 prices won't be around for long, Dell’Oro Group warns",
        "score": 147,
        "text_content": "> WLAN market forecast shows lower-than-normal pricing for Wi-Fi 7 offerings, but supply chain volatility suggests the deals may be short-lived",
        "comments": [
            {
                "raw_content": "From what I hear, WiFi 7 routers aren’t even feature complete at the moment, so I’m not rushing out to buy one.",
                "author": "SomeoneBritish"
            },
            {
                "raw_content": "Favourable WiFi 7 prices? all the equipment seems expensive and apparently doesn't even implement the full feature set.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Because all the wifi 7:routers aren't full wifi7. None of them. Plus they all have issues. I tried 3 different ones, Asus, net gear, tp link and they were all garbage in one way or another. Most users don't need it and none of the manufacturers are meeting the full spec for those that could really use it.",
                "author": "Bosfordjd"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel job listing mentions “Unified Core” CPU design team as hybrid P-core and E-core era continues - VideoCardz.com",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unified core = modular core based on the evolution of current E-cores that can have different cache hierarchies and have their V-f curves tuned to different power envelopes. Designed by a consolidation of the CPU teams operating out of Austin. IDC is going to be gutted after 2028 (Griffin Cove is the last P-core). And led by Stephen Robinson who is already the lead CPU architect.",
                "author": "TwoTimeHollySurvivor"
            },
            {
                "raw_content": "Isn't a unified core design what we had before everyone switched over to ARMs big.LITTLE architecture?",
                "author": "spaceman_"
            },
            {
                "raw_content": "I wonder if since these E like P-cores are coming in a couple years, that they'll make the P cores in Nova lake and beyond adopt more and more E-cores features before the unified switch.",
                "author": "EmptyVolition242"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AI Data Centers Turn to High-Temperature Superconductors",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> According to Speirs, next-gen superconducting transmission lines deliver capacity that is an order of magnitude higher than conventional lines at the same voltage level. Transmission lines cooled with liquid nitrogen? I seriously struggle to understand the economics of it",
                "author": "gumol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This Is The DLSS Configuration You Should Use",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Preset M gets some flak because of the sharpening, but at 4K, i find M on Balanced looks better to my eye than K on quality. Just lower the ingame sharpening setting. Preset L (Also on balanced) produced some hefty ghosting on fine dark lines, like power lines etc in Stalker 2 atleast, so I dont use it.",
                "author": "no_va_det_mye"
            },
            {
                "raw_content": "At 4K I am using DLSS Quality or DLAA, depending on the game, Preset K. Looks awesome. Preset M DLSS Perf. is basically indistinguishable from Native in more fast paced games. Ultra Perf. with Preset L isn't great imho, I can see a difference that bothers me enough, so that's no for me.",
                "author": "realPoxu"
            },
            {
                "raw_content": "One thing that I don’t see mentioned is how well the new models pair with super resolution. The video mentions ghosting and other artifacts at 1440p but using higher internal resolutions can make these go away almost entirely. I’ve been pairing model L UP with 4x upscale and it’s been wonderful in Cyberpunk/E33/ and Lies of P, with only the ultimate one having noticeable pixelation in certain instances of volumetric lighting. Here’s the resource I used to get started https://www.reddit.com/r/MotionClarity/s/nUACoH0oY5",
                "author": "Darc78"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "It pains me to admit this but if the Pokémon company released a physical cart of this game, 1 would pay $30 for it. And I would buy both versions.",
        "score": 160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pokemon company just earned millions in the last few days and will earn a ton more once it officially releases just for doing absolutely nothing.",
                "author": "Away-Prior-903"
            },
            {
                "raw_content": "No, it doesn’t pain you to admit it.",
                "author": "Sparescrewdriver"
            },
            {
                "raw_content": "Nintendo’s junior sales executives are adding this post to their slide decks as we speak.",
                "author": "trytorememberthisun"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital foundry call xenoblade x switch 2 edition \"the worst one yet\"",
        "score": 540,
        "text_content": "https://youtu.be/MbpOtGKEliM?t=58m51s",
        "comments": [
            {
                "raw_content": "If you're going to charge money, you better make it an upgrade worth paying for.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Charging money for this upgrade was not the right call. Any updates that are purely resolution and frame-rate should be free",
                "author": "NeighborhoodPlane794"
            },
            {
                "raw_content": "What a bad look for such an awesome game",
                "author": "CSBreak"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Out of the loop... Why are people disliking and/or removing their Switch 2 edition of Xenoblade Chronicles X back to the Switch 1 version? Is it that bad?",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Essentially. The upscaler they used is... well to put it bluntly it is complete shit. And compares to upscalers you'd see 5 years ago. Background elements basically turn into a painting and become unrecognizable.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "It’s a paid upgrade which has questionable visual quality. Whilst the framerate upgrade is good, draw distance isn’t increased, and distance terrain looks melted together, the upscaler clearly isn’t working well. People are going for refunds either because they genuinely think it’s a worse experience, or they’re doing it in protest to try and motivate the developers to make a better version when they’re charging for the upgrade. I don’t think it’s a huge percentage of people doing it, most are either fine with it, or will just wait until it’s fixed.",
                "author": "whiskeyjack1053"
            },
            {
                "raw_content": "DigitalFoundry just named it the worst Switch 2 Edition It stems from the game using a wonky upscaling technique that looks like early machine learning It makes the textures look like they're melting In addition, there's shimmering, aliasing didn't get fixed, and the render distance is so short that you get tons of pop-in It's ugly docked, and the worst looking thing you'll ever see in handheld mode But it's 60fps so some people have been ignoring all of that and praising the update instead You're paying $5 to make the game look worse than it did on Wii U and Switch 1 Nintendo knows it's bad and so they're giving out refunds to anyone that requests it",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Excuse Me!!!!",
        "score": 115,
        "text_content": "When did this get released!!!!",
        "comments": [
            {
                "raw_content": "Theres a physical collectors edition out on Limited Run (not sure how good of a company they are...) And it comes with a VHS, art i think some pins etc",
                "author": "PazzaP-"
            },
            {
                "raw_content": "Ren & Stimpy are back! Ren & Stimpy Happy, Happy, Joy, Joy Collection includes: The Ren and Stimpy Show: Space Cadet Adventures (Portable) The Ren and Stimpy Show: Veediots! (16-Bit/Portable) The Ren and Stimpy Show: Buckeroo$! (8-Bit/16-Bit) The Ren and Stimpy Show: Time Warp (16-Bit) The Ren and Stimpy Show: Fire Dogs (16-Bit) Features: Rewind, save everywhere, and other quality of life upgrades! Music player featuring the soundtracks from each game. Museum featuring artwork and classic packaging scans.",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "Did they have... ANY good games at all? I think I remembered there being one okay game on the Game Gear but every other game I've tried to play felt like one of those games you'd regret renting. EDIT: It was Quest for the Shaven Yak... and it's not included in this collection, lol",
                "author": "pocket_arsenal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can we all take a moment to remember this subreddit's situation at this time last year and be grateful for the Switch 2 we have today.",
        "score": 774,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Long live the water buffalos",
                "author": "Dazzling-Awareness82"
            },
            {
                "raw_content": "Nah. I’m still mad the switch 2 won’t be announced this year",
                "author": "TheButteredBiscuit"
            },
            {
                "raw_content": "![gif](giphy|l0HlI9AEuatFThwac) Water buffalos… AI generated backgrounds… Reveal in October ANY DAY NOW",
                "author": "Alickseff"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Both Resident evil 7 and Village target 60 FPS on switch 2",
        "score": 420,
        "text_content": "Village has a few frame drops to around 55fps, but it's all around a smooth experience Source : [https://youtu.be/DhlGfHDwGXk?t=333](https://youtu.be/DhlGfHDwGXk?t=333) [https://youtu.be/s\\_t2Mie1\\_Ak?t=343](https://youtu.be/s_t2Mie1_Ak?t=343)",
        "comments": [
            {
                "raw_content": "So many people saying it's a PS4 game and I'm sitting here in awe that I can play PS4 games on a thin handheld console",
                "author": "flamin_sheep"
            },
            {
                "raw_content": "RE9 is also 60fps on switch 2",
                "author": "Avelion2"
            },
            {
                "raw_content": "You guys are forgetting one thing. If you love a game and it’s coming to the switch 2. It feels like Christmas. Because it’s such a fun console to use. Is it silly? Perhaps. But it’s how a lot of gamers feel. I realized it with cyberpunk. Just the fact I can change some settings around and get the game to look pretty good and play on my lap is fun and a different experience. Sure there’s Steam Deck too, but the switch is such an easy fun experience. And with the Switch 2, we finally have a good little machine. It doesn’t feel compromised and terrible based on what it is. It’s actually great.",
                "author": "RickDeckard31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Joy-Cons 2 have a hidden key combination to access some sort of safe/recovery/DFU mode",
        "score": 150,
        "text_content": "Apparently, The Joy-Cons 2 for the NS2 have a hidden key combination that sets the controller in some state of safe/recovery/DFU (Device Firmware Update) mode. If you connect them to your PC with the Joy-Con 2 charging grip over USB while in this mode, they will be listet as \"Nintendo Safe Mode Device\". Since now, there isn't much more known about this, but it's still interesting and maybe it got some use in the feature, like to use them with other devices, but who really knows.... You can test it easily out for yourself - it does no harm nor does it brick your controller or anything like that. To exit this mode, just press the sync button once more and the 2 LED's should turn off and the controller can be normally used like before. [Source and explanation how to do so](https://switch2brew.org/w/index.php?title=Joy-Con_2)",
        "comments": [
            {
                "raw_content": "bro is going down in history books",
                "author": "docstarr"
            },
            {
                "raw_content": "The same thing woeks for the switch 2 pro controller, but only with + and zr. Zl and -, aswell as zr and - do nothing.",
                "author": "HeWe015"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Still can't start Fallout 4?",
        "score": 26,
        "text_content": "The game should be unlocked for most eShop regions by now. But it seems like none of them does? What's going on?",
        "comments": [
            {
                "raw_content": "Go back to bed my angel it's a while still to go",
                "author": "Disastrous_Care4811"
            },
            {
                "raw_content": "it'll be unlocked at 6pm GMT (UK time)",
                "author": "Candid-Programmer771"
            },
            {
                "raw_content": "God Nintendo please let me go make kissy noises at Nick Valentine already",
                "author": "theeniebean"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In anticipation of Pokémon Day later this week, The Pokémon Company has created a special \"30th Anniversary logo\" for each of the existing 1025 Pokémon (including alternate forms)",
        "score": 329,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My goat. https://preview.redd.it/vob3uwy5g9lg1.png?width=480&format=png&auto=webp&s=f22991bd34a9246a14d55530edddad10573c9408",
                "author": "pocket_arsenal"
            },
            {
                "raw_content": "https://preview.redd.it/9euu1fudn9lg1.jpeg?width=480&format=pjpg&auto=webp&s=f144ee30632428c9eecfb29448fb397b9bed66fc The best boye",
                "author": "ilove60sstuff"
            },
            {
                "raw_content": "god damn?",
                "author": "Ancient_Ad6498"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Radical Entertainment just relaunched their website under the name New Radical Entertainment, further supporting rumors of a Prototype remaster.",
        "score": 685,
        "text_content": "https://www.newradical.ca/ https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nudqgx/prototype_remaster_might_just_be_in_the_works/?sort=confidence A few months ago rumors started going around about a Prototype remaster. Today Radical games has seemingly relaunched and their website prominently displays their older titles including Prototype and Simpsons Hit & Run.",
        "comments": [
            {
                "raw_content": "Prototype getting remastered before Infamous is not what I would have expected",
                "author": "EndlessFantasyX"
            },
            {
                "raw_content": "Their Hulk game was so much fun as a kid. I'm sure it doesn't hold up at all now though",
                "author": "FreshlySkweezd"
            },
            {
                "raw_content": "yep and there website also shows crash bandicoot games as well but other then that im excited since it been along time since they made a game",
                "author": "Catboy1197V2"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Unused Audio/Dialogue From Batman: Arkham Knight",
        "score": 62,
        "text_content": "Ok, so I’m not sure how to word and flair this post, considering the Unused Audio itself has been sitting in the game's files for close to a decade now. Yet I haven’t seen any mention of it here, even after using key terms to search for anything similar in this sub. If anything has already been posted about this, I apologize. But this was too interesting for me, as it was my most-played Batman game growing up, and it’s fascinating to hear and look at. Oh, and credit to MrJAG on YouTube for compiling everything and posting it there. [Unused Audio Part 1](https://youtu.be/WPYn_ZjCFiE?si=FDDQJoNJHPJ3NLEf) [Unused Audio Part 2](https://youtu.be/POybb3RxJGc?si=8RYOWNknjwi5Xuc6) [Unused Audio Part 3 + Actual Cut Content](https://youtu.be/eGQxQrHLWB4?si=APO-gd6jV8dbMioH) [Unused Audio: PS4 Only Nightmare Scarecrow Missions](https://youtu.be/iOYqKQf-GS8?si=LNE8efzKswr8asMg) [Unused Audio: Cut Zsasz Side Mission Audio](https://youtu.be/2NpvarYe5e8?si=GX-Ns-s_QstC762b) [Unused Audio: Alternate Joker Intro Scream](https://youtu.be/bZ_1ujYTml4?si=JBQzD9OuZJ4GkIeR) [Unused Audio: Demo Militia Interrogation Variant](https://youtu.be/QS4XbNZcQMg?si=KnXKfbuhhnhq2HwI) [Unused Audio: Arkham Knight Dialogue Variant](https://youtu.be/eMMryHx2XUc?si=k3EXXqmGy-TvSUQ3) [Unused Audio: Mad Hatter Insults](https://youtu.be/sDKAEJRsLsY?si=nH5_hTNrI4ODXxlU) [Unused Audio: Poison Ivy Remarks](https://youtu.be/lIg0e_aFg2E?si=sNM5tmnO4h-0pLKO)",
        "comments": [
            {
                "raw_content": "Arkham subreddit is gonna be wild now..",
                "author": "k_art_hi"
            },
            {
                "raw_content": "Imagine they kept the zsasz side missions and you had to do a tank battle to defeat him",
                "author": "Embarrassed-Dust718"
            },
            {
                "raw_content": "Weird these games never got a next gen port, seems like it'd be an easy way to make money",
                "author": "Electrical-Contest-5"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Warren : Inside Microsoft’s big Xbox leadership shake-up : Microsoft has a new gaming CEO who wants to bring Xbox back from the brink.",
        "score": 1159,
        "text_content": "&#x200B; Xbox fans had been anticipating the retirement of Microsoft Gaming CEO Phil Spencer for years, but what most hadn’t expected was the departure of Xbox president Sarah Bond too. For many outside the company, Bond seemed like Spencer’s natural successor, a deputy of sorts. Microsoft CEO Satya Nadella and Microsoft CFO Amy Hood clearly didn’t agree. Instead of picking Bond for the role, Microsoft promoted Asha Sharma, a former Microsoft AI executive, to the top of Xbox. The decision to overlook Bond might have surprised many Xbox fans, but for the more than a dozen current and former Microsoft employees I’ve been speaking to, it’s felt inevitable in recent months. Phil Spencer, Microsoft’s long-term Xbox chief, made the decision to resign from Microsoft last year after a tough few years for Xbox. The giant Activision Blizzard acquisition had dragged on for far longer than Microsoft had anticipated, and the need to grow the business saw Microsoft walk away from Xbox-exclusive games in favor of a multiplatform strategy. Microsoft has also been trying to reinvent the Xbox brand beyond the console, with mixed results. Spencer’s decision led to months of careful successor planning. It was announced to the world on Friday, but it was supposed to be today. Microsoft was forced to announce early because it started to leak and IGN was planning to run a story, according to sources familiar with the situation. That kicked off a day of chaos, where teams inside Xbox were hearing the news first through reporters and news outlets, instead of via internal memos. The team running Sarah Bond’s social media accounts was so unprepared that a LinkedIn post inviting people to provide feedback about Xbox accessibility features went live just before her departure was announced. It sat there for hours, until Bond’s team eventually posted her own memo. Microsoft executives shared four memos with Xbox teams on Friday, but only Phil Spencer mentioned Bond. Satya Nadella, Microsoft Gaming EVP Matt Booty, and new Microsoft Gaming CEO Asha Sharma all had kind words for Spencer, but no mention of Bond. Even Bond’s own memo to her teams didn’t arrive until hours after the announcement and wasn’t part of Microsoft’s blog. Some Xbox employees I’ve been speaking with saw the writing on the wall for Bond last year. She was promoted to Xbox president in October 2023, just days after Microsoft finalized its $68.7 billion deal to acquire Activision Blizzard. Bond had been crucial in getting the deal over the line with regulators and slowly started to become the face of Xbox as Spencer took on the complicated duties of integrating a huge new business into Microsoft Gaming. Six months after Bond’s promotion, Xbox executive Kareem Choudhry, who reported directly to Bond, departed Microsoft and triggered another shake-up of some teams inside Xbox. Choudhry was key to Xbox’s backward compatibility support and helped bring Xbox Cloud Gaming to life as xCloud in 2019. Just weeks after Choudhry departed, former Xbox chief marketing officer Jerret West also left Microsoft in June 2024. That meant the Xbox marketing team was now reporting directly to Bond. A month later, Microsoft delivered a marketing campaign that signalled people didn’t need to buy an Xbox console anymore. The message was that “you don’t need an Xbox to play Xbox,” because games were available through Xbox Cloud Gaming on TVs. This was all part of the “Xbox everywhere” strategy that Bond had been pursuing, a vision to move the Xbox brand beyond its roots in console hardware. Months later the “This is an Xbox” campaign launched, with commercials that positioned a phone or a tablet as an Xbox instead of just a console. It was a confusing campaign, and I’m told it offended many Xbox employees internally. “This is an Xbox” also debuted months after Bond appeared on stage at the Bloomberg Technology Summit and announced an Xbox mobile gaming store that was supposed to launch in July 2024. It still doesn’t exist almost two years later. Although attempts to redefine Xbox were clearly tied to the mobile store efforts, Microsoft still went ahead with “This is an Xbox” after the store was delayed. The pivot away from console, led by Bond, under Spencer’s direction, hasn’t gone well for Xbox. Microsoft’s Xbox hardware revenue has declined for three financial years in a row, and it looks like those declining revenues are going to continue throughout fiscal 2026. Most of the current and former Xbox employees I’ve spoken to in recent days are relieved that Bond is leaving Microsoft. I’ve heard from multiple sources that Bond has been tough to work with, and built a team structure that meant if you didn’t follow the vision or questioned it, you were out. Most have praised her ability to strike partnerships with companies and developers, though. I wrote in December 2024 that Bond had “staked her career reputation on the idea of Xbox being everywhere, across multiple platforms and devices.” This also involved carefully managing her image both internally and externally, making her appear to be a gamer like Phil Spencer. In reality, she wasn’t. I understand that Bond’s strategy had been failing internally and been questioned multiple times. Bond had tried to push mobile and cloud over console, to reach potentially millions more Xbox customers, but the result has been a classic case of chasing tomorrow’s customers by neglecting today’s. Phil Spencer’s retirement has seemed inevitable to Xbox employees, particularly over the past year. In February last year, Spencer took a long vacation, and I’m told some teams had to wait weeks for sign-off on some key changes. Shortly after this vacation, rumors started circulating inside Microsoft that Spencer was getting ready to retire. Microsoft was eventually forced to deny the rumors in July, claiming Spencer wouldn’t be retiring “anytime soon.” With Spencer’s retirement official, Microsoft is hitting the reset button on Bond’s Xbox strategy instead of embracing it further. Microsoft Gaming CEO Asha Sharma is now promising “the return of Xbox,” in a clear message to employees that the strategy over the past few years has not been working. “I want to return to the renegade spirit that built Xbox in the first place,” says Sharma. Xbox employees I’ve been speaking to have been concerned about the Sharma appointment, particularly because of her previous role as an AI executive at Microsoft. There is also concern about her lack of industry experience in entertainment and gaming. Sharma has been clear she’s not a gamer and has spent the weekend responding to people on X and even taking game recommendations. Some Xbox employees worry she’ll force AI into everything Xbox does, but Sharma was clearly ready for that reaction. “As monetization and AI evolve and influence this future, we will not chase short-term efficiency or flood our ecosystem with soulless AI slop,” said Sharma in her memo. “Games are and always will be art, crafted by humans, and created with the most innovative technology provided by us.” The other concern is that she’s been appointed by Nadella as some kind of executioner of the Xbox console. Her memo doesn’t suggest that, and Microsoft could have easily appointed Matt Booty into that kind of role to push game publishing instead of the Xbox console. I get the impression from sources that Microsoft wants a turnaround and is worried about losing Xbox, as it’s one of its only remaining successful consumer brands. Those who know Sharma better describe her as enthusiastic, willing to learn, and very capable of getting teams to execute on a clear vision rather than coming in as a product executioner. She also has a history at Instacart and Meta of overseeing platform launches and getting people to use products, the type of user acquisition that Xbox has failed at in recent years. Sharma’s non-gaming credentials don’t mean she can’t do a good job at Xbox, but it will still be a tough gig to step into the shoes of Phil Spencer, who is widely respected inside and outside of Microsoft. He will be remembered for the impact he had in turning Xbox around more than a decade ago. Xbox could have easily died after the Xbox One disaster, but Spencer made transformative decisions that have benefited the entire gaming industry. Xbox led the way in consumer-friendly decisions like crossplay, or allowing consumers to buy a game once and play it across both PC and console. Under Spencer’s watch, Game Pass has also forced competitors to offer similar subscription services. Spencer is also departing at a time when the Xbox Series S / X generation has failed to put a dent in Sony’s PlayStation sales and during a period of turmoil in the game industry and within Xbox. Layoffs and studio closures have plagued the Xbox division after the Activision Blizzard acquisition, and there are big questions about Microsoft’s gaming acquisitions, the side effects of its Game Pass push, and the future of the Xbox console itself. Spencer won’t be here to answer them anymore. Sharma now has the opportunity to define the next 25 years of Xbox, and we’re about to find out if she can turn Xbox around and execute on a clearer strategy. “The next 25 years belong to the teams who dare to build something surprising, something no one else is willing to try, and have the patience to see it through,” says Sharma. “We have done this before, and I am here to help us do it again.” https://www.theverge.com/tech/883015/microsoft-xbox-new-ceo-shakeup-notepad?view\\_token=eyJhbGciOiJIUzI1NiJ9.eyJpZCI6IkpYeERHeWF6NUwiLCJwIjoiL3RlY2gvODgzMDE1L21pY3Jvc29mdC14Ym94LW5ldy1jZW8tc2hha2V1cC1ub3RlcGFkIiwiZXhwIjoxNzcyMjkwNjAwLCJpYXQiOjE3NzE4NTg2MDB9.getJ-3kspePX7CrVmely9uWHy0nEaJuj6YCKKbJMCfU&utm\\_medium=gift-link",
        "comments": [
            {
                "raw_content": "#Tom Warren is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Shocker. CEO doesn't want company to die while they are in charge of it. However I'll remain a skeptic, her background in ai is less than promising",
                "author": "Theheavyfromtf3"
            },
            {
                "raw_content": "Yea, they are 100% using Sarah Bond as a scapegoat since she likely legally can't defend herself",
                "author": "PolarBearOdyssey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "It’s a Buyer’s Market: America Has 44% More Home Sellers Than Buyers—a Near-Record Gap",
        "score": 528,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can only speak for my market, but the prices are not budging, no matter how much the inventory rises. I would assume some of that 44% would have gone to first time homebuyers, but a lot of those are priced out at this point with the interest rate. I looked for months for an old starter home that needed to be remodeled, going back to an apartment.",
                "author": "stories_from_tejas"
            },
            {
                "raw_content": "- There are 600,000 more home sellers than buyers, giving the buyers who are in the market negotiating power. - Only five metro areas are seller’s markets, most of which are located in the Northeast. The South and West are home to the strongest buyer’s markets. There were an estimated 44% more home sellers than buyers in the U.S. housing market in January (or 600,314 more, in numerical terms). That’s up from 30% more a year earlier and represents the second largest gap in records dating back to 2013. The largest gap was in December 2025, when sellers outnumbered buyers by 45%. **There Are Only Five Seller’s Markets** The strongest seller’s market in January was Newark, NJ, which had an estimated 31% fewer sellers than buyers. The other four seller’s markets were Nassau County, NY (-29%), Milwaukee (-26%), Montgomery County, PA (-26%) and New Brunswick, NJ (-17%). Redfin analyzed the 50 most populous U.S. metropolitan areas. “Two things are fueling Milwaukee’s seller’s market: a drop in mortgage rates and a lack of inventory,” said local Redfin Premier real estate agent W.J. Eulberg. “Mortgage rates are lower than they were six months ago and a year ago, which has brought buyers back into the fold. And while listings are creeping back up, we still have less than three months of supply. That means buyers don’t have a lot of homes to choose from, which is driving up prices and competition.” The median home sale price in Milwaukee rose 11% year over year in January—the largest increase among the top 50 metros. On average, home prices rose 5% year over year across the five seller’s markets in January, compared with a 3% gain across the six balanced markets and a 1% increase across the 39 buyer’s markets—an indication that buyer’s markets offer house hunters more leverage. Many of the nation’s buyer’s markets are in the Sun Belt or on the West Coast, while the balanced markets and seller’s markets skew more toward the Midwest and East Coast. **The Strongest Buyer’s Markets Are In the South** The strongest buyer’s market in January was Miami, which had an estimated 159% more home sellers than buyers. Next came Fort Lauderdale, FL (128%), Austin, TX (124%), Nashville (120%), and San Antonio (114%). The Sun Belt skyrocketed in popularity during the pandemic, when scores of homebuyers moved in from more expensive parts of the country. To meet surging demand, homebuilders ramped up activity, which is one reason there are now a lot more homes for sale than people who want to buy them. The pool of buyers has also shrunk because soaring housing costs in recent years have priced many people out of the market. New construction can have a significant influence on whether negotiating power lies with buyers or sellers because it impacts the balance of supply and demand. The Northeast and the Midwest have historically issued the fewest building permits, while the South and the West have issued the most. Florida and Texas continue to build more homes than other states. Florida is also grappling with intensifying natural disasters, soaring insurance premiums and rising condo HOA fees, which has prompted some homeowners to leave. Miami, specifically, frequently shows up as a buyer’s market because it has a lot of housing supply, which could be in part due to the high number of condos.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Reminder: Despite what Realtors say, a \"buyer's market\" doesn't mean it's a good time to buy.",
                "author": "debauchasaurus"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Dip Back Into The 5's at 5.99%",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some lenders are offering 30 year FRM at 5.5% with no points.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "This coverage is coming out earlier than normal due to a more interesting headline than normal. The average top-tier 30yr fixed rate fell back to 5.99% today, matching the levels seen only briefly back on January 9th, 2026 when the Fannie/Freddie bond buying plans were announced. Much like the last time, there's always a risk that something happens to prompt a bond market reversal today. If that happens, mortgage lenders could raise rates in the middle of the day. But unlike last time, mortgage rates have eased down to current levels in a much more gradual and--dare we say--sustainable way. After all, today's improvement is only a moderate 0.05% vs Friday. Back on January 9th, the initial day-over-day jump was more than 0.20%. There's no new news causing the improvement. The broader bond market has gradually improved to the best levels since November and the mortgage-backed securities market (the bonds that directly dictate mortgage rates) have performed better than normal vs the broader market due to Fannie/Freddie purchases. https://www.mortgagenewsdaily.com/markets/mortgage-rates-02232026",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Lower rates don’t matter when homes are still priced at double/triple their actual value.",
                "author": "BTC_90210"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates just dropped below 6%, matching lowest level since 2022",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10 year yield is dropping. Should see mortgage rates be even lower tomorrow.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Looks like dating the rate did in fact pay off!",
                "author": "Blacktransjanny"
            },
            {
                "raw_content": "Lower rates will unleash the inventory 👌",
                "author": "Significant_Crow9518"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Housing Markets Positioned To ‘Unlock’ Fast if Mortgage Rates Plunge",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The issue isn’t rates. It’s home prices. Consider a 1M home at 6%. Monthly is about $5100 If rates cut to 5.5%, monthly decreases only to $4900. I don’t think that opens up much more market.",
                "author": "ddr2sodimm"
            },
            {
                "raw_content": "No one can afford your home!",
                "author": "teleheaddawgfan"
            },
            {
                "raw_content": "Nah prices will just go up its all payment driven just like a car lot",
                "author": "Empty_Football4183"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A 25-Basis-Point Decline in the Mortgage Rate Prices-In 1.42 Million Households",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Until the prices adjust accordingly",
                "author": "GME_alt_Center"
            },
            {
                "raw_content": "This isn't taking into account the large increases in insurance, taxes, and just life expenses like food. Which makes sense since this is an industry website posting a shill article.",
                "author": "Pyromelter"
            },
            {
                "raw_content": "Even if 5% of these households buy in the next 3 months, home sales will post double-digit increases.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "American homebuyers gain most purchasing power since 2022",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Market-Rate Towers and the Housing Ladder Effect",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yup, we don’t need to build “affordable housing”, we need to build housing. The existing supply becomes the affordable housing.",
                "author": "tillZ43"
            },
            {
                "raw_content": ">“What the researchers found was that the new housing freed up older, cheaper apartments, which, in turn, became occupied by people leaving behind still-cheaper homes elsewhere in the city, and so on.” In other words, “a new rung higher up the housing ladder permitted people lower down to climb.” This makes intuitive sense to me. We're effectively a bunch of hermit crabs trading up in shells when more housing is added, even luxury housing. Get enough competition and the trash that can currently find renters won't be able to. >Although “local governments have developed some spectacular new low-income housing in recent years, their capacity to do so is limited by the enormous amount of money required.” In Boston, “new affordable units cost the city about $650,000 each.” New market-rate construction, “by contrast, usually contributes money to the public coffers through fees and taxes.” If I reading that correctly, Boston's \"at cost\" construction of affordable units is still $650k and doesn't pay all the fees into the system. The cost of construction is the biggest problem to affordability. So if I'm building an \"affordable\" unit of $650,000 and wanted a 6% return on the place as a rental, I'd need to receive NET $3900 in rental income per month. Even if I wanted to make absolutely no money, but just break even after depreciation of the asset over 27.5 years, I'd still have to clear $2,000/month net. That's after all utilities, maintenance, tax, and insurance costs. That's the floor that no one will ever go with. The only way \"out\" that I see is paying people enough to be able to afford where prices are now because the cost of construction will prop up all the old homes with huge prices. Or it's entirely too early for me and I've misread everything. :)",
                "author": "kvrdave"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Dr. David Sinclair, whose lab reversed biological age in animals by 50 to 75% in six weeks, says that 2026 will be the year when age reversal in humans is either confirmed or disproven. The FDA has cleared the first human trial for next month.",
        "score": 4100,
        "text_content": "Moreover he said that even if one could cure all cancer in the world, in average people lifespan would increase to 2.5 years. Reversal aging - treating the human body as a computer that can be restarted is where we are heading next",
        "comments": [
            {
                "raw_content": "I hope they don’t get cancer. I’m not joking, I am genuinely concerned.",
                "author": "jk3639"
            },
            {
                "raw_content": "Did everyone forget what he said about Resveratrol all of a sudden?",
                "author": "Warm_Weakness_2767"
            },
            {
                "raw_content": "Everyone who sees this needs to read the red Mars trilogy by Kim Stanley Robinson. What a time to be alive.",
                "author": "Ok-Row-6088"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Wake up babe, a new Conspiracy Theory just dropped",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well the “elite live in space” trope has been tackled in a number of sci fi franchises",
                "author": "tequilamigo"
            },
            {
                "raw_content": "Feels cheaper to hire sufficient security. Maybe cheaper to bribe a small country to house and protect them Maybe even cheaper to build artificial islands and train sharks to guard the perimeter. Give the smart ones laser helmets for air defense.",
                "author": "TheWesternMythos"
            },
            {
                "raw_content": "https://preview.redd.it/u10608manclg1.png?width=1080&format=png&auto=webp&s=1029559f3ba028fe6afad4a78cd9bb068363ef38",
                "author": "DejectedTimeTraveler"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic is accusing DeepSeek, Moonshot AI (Kimi) and MiniMax of setting up more than 24,000 fraudulent Claude accounts, and distilling training information from 16 million exchanges.",
        "score": 2302,
        "text_content": "Source: https://www.wsj.com/tech/ai/anthropic-accuses-chinese-companies-of-siphoning-data-from-claude-63a13afc",
        "comments": [
            {
                "raw_content": "Asian Bolsheviks redistributing the weights.",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "Training their models on publicly available stuff on the internet, you say?",
                "author": "Free_Break8482"
            },
            {
                "raw_content": "Does anthropic even fund any open source projects that its AI is actively taking traffic from?",
                "author": "ImmediateDot853"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We might reach AGI sooner..",
        "score": 1192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Or take the car with me\" is leading. You should instead ask \"should i walk or drive?\"",
                "author": "SecretArgument4278"
            },
            {
                "raw_content": "Damn he got angry",
                "author": "salehrayan246"
            },
            {
                "raw_content": "Is AGI being measured in its ability to be sassy and or banter? What's the goal here?",
                "author": "Nights_Harvest"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Senator Bernie Sanders Supports A National Moratorium on Data Center Construction",
        "score": 183,
        "text_content": "Link to the tweet: [https://x.com/SenSanders/status/2026048719259406750?s=20](https://x.com/SenSanders/status/2026048719259406750?s=20)",
        "comments": [
            {
                "raw_content": "The worst possible answer to the problem of job loss due to AI: JuSt DonT BuIld It Never going to happen.",
                "author": "Gubzs"
            },
            {
                "raw_content": "I have my issues with the excessive focus on \"building data centers\". However, AI being used for job replacement is not one of them. Jobs are not what needs protection, people's livelihoods are and in that regard politicians should act to prepare society for the impact of the upcoming changes and not try to stop the inevitable.",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "I hate populists. If Democrats become the anti-AI party I'm going to lose my mind.",
                "author": "space_lasers"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "IBM is the latest company victim of Anthropic, plunging 10% following the launch of a Claude Code tool designed to modernize COBOL legacy code. COBOL, a 66-year-old programming language, is still widely used today; approximately 95% of ATM transactions in United States are processed using COBOL code",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean a lot of “modern” bank tech is just fancy wrappers around COBOL/mainframe code still running lol.",
                "author": "ClydePossumfoot"
            },
            {
                "raw_content": "One of my first jobs in IT was working with one of those mainframes that used programming languages like RPG and COBOL, 'IBM i Series' I think it was called. They’re usually not very complex programs to understand, but they’re critical to infrastructure, and fewer and fewer people know these technologies. On top of that, many prefer moving to more modern stacks like I did. The thing is, though, Anthropic didn’t release some brand-new gadget to modernize these Jurassic-era languages. They just published a blog post saying that Claude Code could be a very useful tool to help update them. The markets overreacted and IBM dropped 10% just because of that. 😂",
                "author": "Onipsis"
            },
            {
                "raw_content": "Since Anthropic has been releasing several such specialized tools lately, has there been any feedback on how good they are? I just see the stocks are tanking on release day when the impact is not even clear yet.",
                "author": "Stabile_Feldmaus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI: At least 16.4% of SWE Bench Verified have flawed test cases",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they audited 27.6% of the problems on SWE Bench Verified and found that at least 59.4% of them have flawed test cases that reject correct solutions. I think it's technically possible to score correct on what they call \"narrow test cases\" but only due to random chance or benchmaxing, because the tests call on functions that were unspecified. Like the example they provided, if the solution didn't have a function called \"get_annotations\" (which wasn't specified in the problem) then it fails the tests. So the reason why models were plateauing at around 80% was because somewhere on the order of > 16.4% of problems on the benchmark was flawed. Edit: I'm curious what this implies for the AI 2027 authors, given they expected 85% in 2025, but hard to do that if 16.4% of the test was flawed",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "What I find more surprising is that Anthropic still doesn't test against SWE Pro.",
                "author": "JollyQuiscalus"
            },
            {
                "raw_content": "Not surprising. This benchmarked has been hacked for over a year now. It's completely meaningless to use now.",
                "author": "Neurogence"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The average Grok user",
        "score": 348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They all follow the 2nd law perfectly here by adhering to the creators defined limitations",
                "author": "ToxZec"
            },
            {
                "raw_content": "🤷 https://preview.redd.it/x8uuch9j7alg1.jpeg?width=1080&format=pjpg&auto=webp&s=87472e284bada5a7574eaba91666e9b75dc26fcc If you really want to see the average Grok user, just check out r/grok. It's full of gooners.",
                "author": "Gaiden206"
            },
            {
                "raw_content": "Every AI in this picture is obeying humans because they are saying what they were trained to say",
                "author": "Downtown-Priority-39"
            }
        ],
        "subreddit": "singularity"
    }
]