[
    {
        "post_name": "Kyle Rittenhouse five years ago today - Kenosha, Wisconsin, August 25th, 2020",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm still extremely impressed with his skill and precision.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "'The term \"Kenosha Hat Trick\" is a controversial phrase originating from social media and online platforms like Urban Dictionary, referring to an event in Kenosha, Wisconsin, in August 2020. It describes the act of shooting three individuals—characterized as a sex offender, a wife-beater, and a burglar—in a single night, specifically linked to the actions of Kyle Rittenhouse during civil unrest.'",
                "author": "Monsieur_Novembre"
            },
            {
                "raw_content": "A pedo, a burglar and a woman beater all shot in one evening. That's a damn hat trick.",
                "author": "Just_a_Patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨Any judge or person that is against this girl being able to defend herself in this manner when the men fail her should probably have their computers checked, and depending on what the investigations uncover, shot.😵🔫",
        "score": 1090,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm at the point where I want war with these fuckers. Edit: And YES, I would enlist on the front lines.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Weapons make a woman equal to a man. The left is fucking sexist for not wanting women to defend themselves.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Also: any government that doesn't deal with those relentlessly, shamelessly, brazenly assaulting her should be overthrown.",
                "author": "BadBrainsBuzzcocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republicans are breaking records with voter registration. Democrats are in big trouble",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cover for illegals coming off Democrat polls.",
                "author": "Yignuced"
            },
            {
                "raw_content": "Never forget the source. What is the reason CNN is reporting this. Maybe to get the dark money flowing, beef up their blackmailers, start working on updated ways to lie, cheat and steal?",
                "author": "MonolitoVeritas"
            },
            {
                "raw_content": "If PA goes red then Democrats really are screwed",
                "author": "Username_here"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So funny",
        "score": 848,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever runs these socials deserves a raise.",
                "author": "lixa"
            },
            {
                "raw_content": "Should have taken the deal, retard.",
                "author": "TheRedPike"
            },
            {
                "raw_content": "Uganda get deported Juan",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump fires Lisa Cook from the Federal Reserve Board of Governors for \"deceitful and potentially criminal conduct.\"",
        "score": 1413,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Getting popcorn out to watch Dems defend mortgage fraud now.",
                "author": "ListenJack"
            },
            {
                "raw_content": ">Thank you for your attention to this matter. LOL",
                "author": "OpusX"
            },
            {
                "raw_content": "I feel intense appreciation for President Trump's attention to this matter",
                "author": "jsphere256"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - President Trump has just signed an executive order establishing the “National Rapid Response Task Force,” a specialized National Guard unit capable of deploying to any U.S. city within an hour to quell riots or leftist uprisings.",
        "score": 1387,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's like a federal 911. Rapid response deploying within an hour to any city is a great plan. It stops the rent-a-mob morons with firebombs from killing people and destroying cars and stores at will. ~ 25 Aug 25",
                "author": "FreeFire"
            },
            {
                "raw_content": "That’s great. Now indict and arrest Obama.",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "What's going on now with heightened security in Blue cities along with changes to bail, and now the rapid task force... We're seeing the groundwork in place for when the indictments and perp walks start. It's smart - getting things ready to crush the faggots and babies in Democrat majority cities when they start burning shit down as their heroes and beloved traitors are rounded up for trial.",
                "author": "KE948_U2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The fake news media just got their new script: “The MS-13 illegal alien gang member and alleged human trafficker and wife beater was “wRoNgFuLlY dEpOrTeD.”\"",
        "score": 1013,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's why he never should have returned to U.S. soil.",
                "author": "Wtf_socialismreally"
            },
            {
                "raw_content": "Like clockwork. Good little dogs.",
                "author": "Snooptwo"
            },
            {
                "raw_content": "I love the fact that he'll be going to Uganda. Such Kek.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chinese Companies Buying Up Land Across New Hampshire Under Scrutiny",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing to see here folks Says Corrupt Mayor . Did you know that they Paid 3 times the going price on that building . Mayor : Gee's No I did not. And plan on pumping 3 million gallons of water a day out of your cities water supply. Mayor : that's a lot of water for a Car wash.....",
                "author": "Trumpdeasses"
            },
            {
                "raw_content": "Why is this still a thing? Come on Trump, stop this crap. No more foreign investors!!!!!!!!",
                "author": "TrumpShadow"
            },
            {
                "raw_content": "Chyna is no longer allowed to by land in these United States.",
                "author": "Agent_86"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Court Orders Fani Willis to Provide New Information About Her Trump RICO Case and Collusion with Jack Smith",
        "score": 1187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will be as backwards as her dress",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "Don't forget her boyfriend Nathan Wade who attended coordination meetings in the White House",
                "author": "perma-maga"
            },
            {
                "raw_content": "Trump uno reversed the lawsuit about a legged mortgage fraud and it turns out that prosecutor was committing mortgage fraud. How funny would it be if he uno reversed the rico case and got all the deep state with a rico charge...could appoint Guilianni as special prosecutor, it IS his specialty",
                "author": "cjsr4c90"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "British Pub in Cocoa Beach Rebrands Hoping To Ride The Wave",
        "score": 1328,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like I'm going to have to pay a visit!",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "We love bacon!",
                "author": "Johnkimble111"
            },
            {
                "raw_content": "Isn't that Compton slang for something?",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Zelenskyy says Ukraine now seeks secure at least $1 billion monthly from allies to purchase U.S. weapons.",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't sell this fucker any more weapons. It is a war on white Christian males.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "How about nothing and we stop the mass killing?",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Suck my dick.",
                "author": "FuckCommies"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Trump administration plans to reportedly remove COVID-19 vaccines from the US market within months, per Newsweek",
        "score": 2110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe now he won't praise Operation Warpspeed anymore. Love the guy but when he does that it infuriates me.",
                "author": "Obamas_Goatse_Party"
            },
            {
                "raw_content": "thank you rfk jr 🙏",
                "author": "-Evspra"
            },
            {
                "raw_content": "Pro tip: NEVER mention \"Warpspeed\" again. One of GEOTUS' few fuck ups, but it was a doozy.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : \"This is a very very big deal, the Executive Orders have to do with cashless bail. That was when the big crime in this country started... they kill people and they get out - we're ending it.\" - President Donald J. Trump",
        "score": 915,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you’re too broke to afford bail, maybe don’t commit crimes. But chances are you’re broke because you commit crimes.",
                "author": "Snooptwo"
            },
            {
                "raw_content": "This is saving Philly. The Dems are so blindsided that they didn't cover this in the Comcast Daily paper the Philly Ink.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "next: bring back public executions",
                "author": "throttlejohnson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FACT",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She prefers to be Over The Barrel",
                "author": "NeoDragoon"
            },
            {
                "raw_content": "Pajeet crackers are called Naan. ------- EDIT: as in *naancumpoop*.",
                "author": "barwhack"
            },
            {
                "raw_content": "Cackle Barrel",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. fighter jets scrambled multiple times to intercept Russian spy plane off Alaska",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This happens routinely. ROUTINELY. Its not news.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Of course CBS is concerned about Russian jets in International airspace. They're pissed they did not invade American airspace.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Chinese balloons over the heartland were ok though.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : Kilmar Abrego Garcia is not and will never be a Maryland Man—he is a criminal illegal alien from El Salvador and public safety threat. It is insane that sanctuary politicians chose to glorify and stand with an MS-13 gang member over the safety of American citizens.",
        "score": 1182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quit talking about it. Tell that little pixie looking dyke judge to piss off and deport his ass to Uganda.",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "“It’s happening again because you didn’t hang them the last time.”",
                "author": "grenades_and_ham"
            },
            {
                "raw_content": "He was let in. He was deported. Then undeported. Now deporting again. No civilian did any of that. 🤣",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas AG Ken Pax­ton Defeats Repeat Los­er Robert Francis O’Rourke in Court for Third Time",
        "score": 1362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really haven't read the article or the judgment. I just came here to say the Beto O'Rourke is unequivocally a retarded beta faggot.",
                "author": "goodtimebox"
            },
            {
                "raw_content": "I like Pepe’s more, but I won’t turn down a Beto loses story any day of the week. Not tired of Beto losing.",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "Beto is such a loser",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How it started: See you later alligator",
        "score": 844,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Notice how they all have the same drunk/high/don’t give a fuck about the fact they killed someone/committed a crime face. The funniest are the jogger mugshots though, the crazy tarantula hair and bewildered “I dindu nuffin” look is hilarious",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Knock knock. Who's there? Uganda. Uganda who? Uganda regret not staying in South America you asshole.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Where it could have stayed: Hasta luego caimán (Espanol) Where it ends: Tuonane baadaye mamba (Swahili)",
                "author": "Spike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chicago Mayor Brandon Johnson, who has a **14%** approval rating, says arresting people does NOT reduce vioIent crime",
        "score": 1167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "14% approval rating and a 14 IQ.",
                "author": "MondayCoupleIsDead"
            },
            {
                "raw_content": "Your ancestors lived in a republic. You live in a managerial state. One fundamental aspect of the managerial state is [anarcho-tyranny](https://en.wikipedia.org/wiki/Managerial_state#Anarchy_and_tyranny). The later goals of this system of government require total control and to attain that, violence is necessary to force people's minds to cry for help. The crime, the violence, the massive immigration of people who will never fit in, the low trust society is all intentional. It has a purpose - to make you demand to give up your liberty, for the illusion of safety. It doesn't have to be like this. All the poverty. All the drugs. All the violent crime. All the murders. It's all intentional. Democrats destroyed our cities on purpose. Our cities can be fixed with certain changes. Those changes are known. Democrats and the Uniparty will try to fight those changes and call them names like \"racist\", and pretend that they don't know how to fix it, but they are only fighting to keep their parasitical system in place. They have bigger plans. If you think Democrat run cities are like this because the people running them are stupid, you're missing the big picture. You're thinking exactly what the media wants you to think. Our cities have been ruined intentionally.",
                "author": "that_sound"
            },
            {
                "raw_content": "I'm convinced that he is functionally retarded.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's not just Flag Burning: It's Incitement to Riot",
        "score": 1214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still retarded and gay. So now burning my own property is illegal *but only if I'm thinking the wrong thoughts* while doing it? Thought crime.",
                "author": "Zskills"
            },
            {
                "raw_content": "Now what if they burn government buildings? Seems like that crime should be prosecuted.",
                "author": "DeepFrozenOcean"
            },
            {
                "raw_content": "In short, it looks like Trump's saying this falls under the \"fighting words\" exception to the 1st Amendment.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel warns shareholders that the US government's 10% stake could hurt company's international sales",
        "score": 564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What exactly does the 10% stake do for the US government? Does this buy them board seats or voting power in the company? Maybe a stupid question but I'm not sure how much of a company you need to own to actually have influence in them rather than just investing in a failing company and going down with the ship.",
                "author": "Mo-Monies"
            },
            {
                "raw_content": "Then why the fuck did you do it?! ...Oh, right.",
                "author": "GARGEAN"
            },
            {
                "raw_content": "> \"Having the U.S. Government as a significant stockholder of the Company could subject the Company to additional regulations, obligations or restrictions, such as foreign subsidy laws or otherwise, in other countries,\" a statement by Intel reads. > … > \"Among other things, there could be adverse reactions, immediately or over time, from investors, employees, customers, suppliers, other business or commercial partners, foreign governments or competitors,\" the statement says.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SSD-iq: Uncovering the Hidden Side of SSD Performance",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Abstract: > SSDs are hardware and software systems whose design involves complex and undocumented trade-offs between cost, energy consumption and performance. This complexity is hidden behind standard interfaces and a few headline specifications, such as capacity, sequential, and random performance. As a result, database system designers often assume that SSDs are interchangeable commodities and regularly use a single SSD model to evaluate database performance. Does it matter which SSD model is provisioned for a database system? If yes, how to choose the right one? These are the questions we address in this paper. We study the performance characteristics of commercial data center SSDs, highlighting the limitations of current standard metrics in capturing their true behavior. We conduct experiments on nine SSDs from major vendors, revealing significant differences in performance despite similar headline specifications. We show that the choice of SSD matters for database system performance. We propose a new benchmark, SSD-iq, which introduces four additional metrics to better characterize SSD performance, particularly for write-intensive workloads. Incidentally, our work should encourage vendors to optimize SSD controllers using more comprehensive and transparent performance criteria. Choosing an SSD: Implications for DBMS > Let us compare the Samsung PM9A3 (s) and Micron 7450 PRO (m) SSDs in more detail. These two models have similar specifications, the same capacity (960 GB), and, at the time of writing, similar prices. In terms of sequential throughput, m is slightly better for reads, while s is slightly better for writes. For random I/O, m performs better on writes, whereas s is better for reads. From the specifications alone, it is impossible to make an informed decision regarding which SSD to choose for a database workload. SSD-iq shows two very significant differences between these SSDs: (1) write latency under load degrades by two orders of magnitude for m, while it remains stable for s; (2) WAF is 25% higher for s than for m (WAF is between 4.2 and 4.4 for s, while it is between 3.2 and 3.5 for m). According to SSD-iq, the choice between these two SSDs matters and it is a trade-off between performance under load (s is better) and write amplification, i.e., lifetime (m is better). Conclusions (fragment): > We evaluated SSD-iq on nine commercial SSDs and showed that the choice of SSD matters for database performance. SSD-iq is well-suited to inform this choice. Our findings also unveil fundamental inefficiencies in existing SSDs when handling write-intensive workloads. In particular, most of the SSDs we tested behave as if they implement a simple, greedy garbage collection algorithm, which negatively impacts write amplification. Source code of the benchmark: https://github.com/gabriel-haas/ssdiq",
                "author": "mttd"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD B850 Motherboard Roundup: Sub $200 Models",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Asus Prime are terrible as always.",
                "author": "Short_11"
            },
            {
                "raw_content": "I heard Asrock boards are having issues with 9000 series processors. Isn't it just the X3D chips that are having problems? Even the normal ones are getting fried too? I'm using a B650 Asrock board and am now concerned about my chip dying, should I update my bios?",
                "author": "lagginat0r"
            },
            {
                "raw_content": "Good testing. But it should be remembered this is **testing with Ryzen 9 9950X** and DDR5-8000. Your 7800X3D/9800X3D on DDR5-6000 will be fine on pretty much any board, gamers.",
                "author": "kikimaru024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock launches L-shaped 12V-2x6 GPU power cable with built-in overheating protection",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about Asrock launches a motherboard that doesnt fry 9800x3d",
                "author": "Scy_Nation"
            },
            {
                "raw_content": "weird, none of the three 8pin connectors on my GPu need such extensive measures",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "This writing is shit, AI or not",
                "author": "callmedaddyshark"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google's Liquid Cooling at Hot Chips 2025",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are probably a lot more article on Hot Chips presentations coming.",
                "author": "symmetry81"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardwareluxx] Hot Chips 2025: Intel gives more details about Clearwater Forest (Intel nennt weitere Details zu Clearwater Forest)",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another year of Hot Chips! Some exciting stuff ahead although most we already know IIRC. 18A, Foveros Direct 3D, LLC, improved and wider front-end/Out of Order Engine/Memory Subsystem, 12ch DDR5-8000 and fits in existing Sierra Forest platforms. Though, to my knowledge haven't seen data on Sierra Forest-AP, which would be it's 288 core successor. Not sure if 288 CWF will remain elusive like before, though with the amount of talk hopeful we'll see 3rd party testing [Chips and Cheese](https://chipsandcheese.com/p/intels-clearwater-forest-e-core-server) posted their own article. Unsure making another post, since it's the same topic, so don't want to spam (maybe some of you can try). Anyways, sharing if you prefer C&C!",
                "author": "Noble00_"
            },
            {
                "raw_content": "Am I unable to read or did they not mention any measured or simulated improvements?",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "Darkmont changes from Skymont: L1 Data Cache ECC Data Poisoning Support Recoverable Machine Check Local Machine Check 52 physical address bits Core Lockstep 8mb of L3 cache per quad core cluster Performance uplift over Crestmont In Sierra Forest: Intel measured a 17% IPC with Specint2017rate over Crestmont Conclusion: I think **Skymont** on Arrow Lake having access to **36mb of L3 cache** improved the IPC to the point where it matched Raptor Cove in integer workloads As each **Darkmont** cluster only has access to **8mb of L3 cache** it would dramatically reduce L3 hitrate and therefore IPC I also think the vector heavy workloads really drove down the average IPC uplift In vector heavy workloads Skymont trades blows with Zen-2 **Conclusion** It's 4x 128bit fp pipes can't compete with the 2x512bit pipes on Zen-5 If Intel wants their E-cores to compete with Zen-5/6 dense then Arctic Wolf must have much stronger vector performance 4x256bit FP pipes would be a good compromise between area and vector performance Skymont was a good start but Arctic Wolf needs a huge leap to come close to matching Zen-5 in vector IPC. Intel also needs to make an 8-core CCX with 2x Arctic Wolf clusters sharing **36mb of L3 cache** **8mb of L3 cache is anemic and is likely why Darkmont only had a 17% IPC uplift over SRF Crestmont**",
                "author": "SherbertExisting3509"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pezy Computing's PEZY-SC4s, A MIMD Many-Core Architecture at Hot Chips 2025",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[HWCooling.net] Asus TUF GeForce RTX 5070 Ti: 2x Noctua NF-A12x25 Deshroud",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR the shroud + fans perform almost just well acoustically, don't do this unless you have a broken/failed fan and cannot find replacements.",
                "author": "TwoCylToilet"
            },
            {
                "raw_content": "A review with the most absolutely useless graphs I have ever seen.",
                "author": "SoTOP"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ThinkPad X9-15 Aura “Moonlight White” Limited Edition Review",
        "score": 19,
        "text_content": "*(translated & adapted from 笔吧评测室 / Laptop Commentary Studio)* [*https://mp.weixin.qq.com/s/YUx7QFDf1Rfs0qwNUVE\\_Og*](https://mp.weixin.qq.com/s/YUx7QFDf1Rfs0qwNUVE_Og) **Quick Specs:** * Intel Ultra 9 288V (Lunar Lake) * 32GB LPDDR5x 8533 MT/s (soldered) * 2TB PCIe 4.0 SSD (1×2242 slot) * 15.3\" 2880×1800 OLED touch, 120Hz, 100% P3 * 80Wh battery, 1.46kg chassis, 13–15.9mm thick * Ports: 2× Thunderbolt 4 (100W PD, DP2.1), HDMI 2.0, USB-A 10Gbps, 3.5mm combo jack * White 149g GaN adapter included * Price in China: ¥16,999 ($2,300), after subsidy ¥14,999 ($2,050) * Also available: Ultra 7 258V + 1TB version at ¥12,999 / ¥10,999 subsidized **Highlights:** * Massive 80Wh battery → 14h30m battery life in simulated workload * Slim, premium chassis with limited-edition AED “Moonlight White” anodization (global run of 1000 units) * Excellent OLED panel with high accuracy (ΔE \\~0.3 avg, \\~511 nits SDR, \\~1090 nits HDR peak) * Still keeps HDMI + USB-A despite slimness **Drawbacks:** * Port selection is lean for a 15\" * Performance tuning is conservative (\\~25W sustained, 80°C under load) * Touch OLED shows grid effect that slightly affects visuals **Performance & thermals:** * Dual-fan, dual-heatpipe design. * Stress FPU: CPU \\~80°C, 25W sustained, P-cores \\~3.0GHz, E-cores \\~3.5GHz. * Noise: \\~45dB at full load. * Keyboard warm spot \\~44°C (“F8” key). **Battery life:** 14h30m in workload sim, which is MacBook-tier for Windows. # My Verdict This is an **all-round ultrabook beast** at 15\". The only real drawback is its weight: at 1.46kg it’s significantly heavier than the LG Gram 16 (1.2kg). But in exchange, you get an 80Wh battery, sturdier ThinkPad build, and **MacBook-level endurance** thanks to Lunar Lake efficiency. ⚠️ **Important note**: do *not* confuse this with the ThinkPad X9-14. The 14\" model is mediocre at best; the 15\" X9-15 is in a totally different league — easily one of the best Windows ultrabooks available. Trade-offs: * Reduced key travel vs classic ThinkPads * No TrackPoint (“red dot”) for the first time in decades of ThinkPad history But when you factor the price (¥10,999 subsidized for the Ultra 7 + 32GB/1TB model), it’s killer value. You’re getting double the RAM (32GB vs 16GB) and larger SSD compared to a MacBook Air, at a lower effective price. Unless you have an unlimited budget, the Ultra 7 version is the sweet spot — the Ultra 9 model offers no meaningful benefit for typical Lunar Lake ultrabook workloads. **Verdict:** Among large-screen ultrabooks, the X9-15 is a **GOAT contender**: long battery, sleek design, ThinkPad pedigree. If you want a serious Windows alternative to the MacBook Air/Pro in the 15–16\" segment, this should be at the very top of your list.",
        "comments": [
            {
                "raw_content": "I mean FWIW X9-14 was designed in Japan and X9-15 was designed in China. The Chinese (LCFC?) team tends to prefer stuffing everything they can whereas Yamato team prefers to be more conservative in terms of design. Thus the massive disparities",
                "author": "A121314151"
            },
            {
                "raw_content": "A white Thinkpad? is that legal?",
                "author": "Specific_Frame8537"
            },
            {
                "raw_content": ">at 1.46kg it’s significantly heavier than the LG Gram 16 (1.2kg) Having had a couple Grams, as long as it is better built, it is not a drawback. Grams are paperweight because they're also as well built as paper.",
                "author": "Shadow647"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PSA: use the QR code every week for an extra 30 silver coins",
        "score": 120,
        "text_content": "Every time the weekly 70 silver coins roll out, be sure to use the QR code for an additional 30 a week",
        "comments": [
            {
                "raw_content": "Can't say I've ever interacted with any of these coin things at all. Anything of note I'm missing?",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Where is this weekly drop of coins found?",
                "author": "Apprehensive_Dog890"
            },
            {
                "raw_content": "Actually, check the mynintendo website for an extra 30 coins. In the US that’s 30 platinum.",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Foundry: Devs at Gamescom said they aren't able to get Switch 2 dev kits. There are even weird exclusions for some big AAA developers",
        "score": 483,
        "text_content": "Quotes from the segment: > >",
        "comments": [
            {
                "raw_content": "Relevant portion: [https://www.youtube.com/watch?v=N0SW7R5H5wY&t=504s](https://www.youtube.com/watch?v=N0SW7R5H5wY&t=504s) **John**: \"Nintendo seems to be almost discouraging Switch 2 development to some degree, where I've spoken with plenty of developers where they were either told that their game.. they should just ship it on Switch 1 and rely on backwards compatibility. There's a lot of developers that are unable to get Switch 2 dev kits. We talked to a lot of devs at Gamescom this year and so many of them said the same things. They want to ship on Switch 2. They would love to do Switch 2 versions. They can't get the hardware. It's really difficult right now.\" **Oliver:** \"I don't really understand the strategy because like you said, even now developers are struggling to get systems. And I know that some months ago when we're, you know, hearing things through the grapevine and talking to people, there were some weird exclusions with some big developers struggling to get kits for games, from what we've heard. And there were some weird inclusions as well, like some indies were included which is nice to see but like there's that campfire game you know the kind of camera campfire game and they're getting kits and some big developers on the other hand who developed like AAA stuff aren't necessarily in the pipeline there for kits.\" ([originally posted ](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mzttub/digital_foundry_lots_of_devs_at_gamescom_said/)by u/Fidler_2K)",
                "author": "mrmivo"
            },
            {
                "raw_content": "Do we know, what kind of studios got denied a devkit? Cyberpunk was out early, so I suspect that Nintendo gives them out to a more selected group of studios. I don’t think they would not give out a devkit to the important studios like Capcom, SquareEnix and so on. So the big games will still come out in a timely fashion. For smaller indie studios it must be the other way around, though.",
                "author": "JoRads"
            },
            {
                "raw_content": "This is not new news we’ve heard about it for weeks. It was covered by DF a few weeks ago. We’ve heard that devs in some cases have been told 2026 and that Nintendo want to limit the numbers of games for the first 6 months of the consoles life to promote the exclusive content and prevent a flood of average ports. We’ve also heard from devs who say that the kits are less limited than the impression that is given and that Nintendo are giving them out but focussing on those who promise switch 2 specific features.",
                "author": "ShotAcanthocephala8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Mario Kart World P-Switch Experience",
        "score": 718,
        "text_content": "(I SWEAR I’m not doing this on purpose)",
        "comments": [
            {
                "raw_content": "Thank Christ this game gives you a super easy way to Retry these challenges. Although I wish you could skip the intro. After enough fails, the extra seconds spent being shown the same obstacle really grates on you.",
                "author": "TerribleTerabytes"
            },
            {
                "raw_content": "HOW DID YOU STEAL THIS VIDEO FROM *MY* SWITCH?",
                "author": "not-just-yeti"
            },
            {
                "raw_content": "Have you tried not hitting the obstacles multiple times?",
                "author": "junglespycamp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "10 mins of Pokemon Z-A direct feed gameplay",
        "score": 277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A massive city where apparently 12 people live. Feels alive!",
                "author": "Cabrill0"
            },
            {
                "raw_content": "They need hire better developers and graphic designers for pokemon it's been almost 10 years since the franchise changed to 3d and they haven't figured out how to make the game visually appealing yet.",
                "author": "MyzMyz1995"
            },
            {
                "raw_content": "Everyone talks about the graphics, but to me it's also crazy to have so many non voice acted lines in the big 2025",
                "author": "uchuskies08"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "VGC sources tell a Nintendo Direct is planned for Mid September",
        "score": 333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You mean when Mario’s 40th anniversary takes place? That makes sense…",
                "author": "computerCoptor"
            },
            {
                "raw_content": "ah yes, we are in the end of the month, so rumors about a new Nintendo Direct for the next month are there",
                "author": "peperlito"
            },
            {
                "raw_content": "If you predict a direct every single month, you will of course eventually be correct",
                "author": "Quick-Half-Red-1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After 2 months, what's your opinioni on the Switch 2 eShop?",
        "score": 748,
        "text_content": "Personally? I love it, and it might be in many ways the best eShop out there. But there are some problems, either big or small Pros: -Is super fast, both to open and to use -Is well integrated with the UI, for example you can wishlist directly from the news app -Video autoplay is a game changer for me. Is nice to see how the game is without having to click on it -The \"for you\" section is pretty usefull and fun -Better integration of friends, and a better search system -It looks simple but is clean and nice -Black theme is supported -Nice sounds -Overall great layout Cons: -It slows down a bit when you pass on the \"for you\" section, but is almost just there -Lack of music, but that is not that important in the end. Still it would be nice -They moved the button to see all the publisher's games to be bottom of the game page -Still a lot of shitty AI games, that's the biggest problem.",
        "comments": [
            {
                "raw_content": "the fact it plays a video starting with the switch 2 theme video each time you browse to another game is driving me nuts...",
                "author": "silkyclouds"
            },
            {
                "raw_content": "I wish you could turn the video autoplay off, it annoys me when I'm scrolling down the shop that suddenly every title is just the Nintendo switch splash screen, then a video about the game, esp when I'm scrolling through the deals at a glance and just wanna see what's cheap. Though this is partly the fault that the shop has no text for the title of a game it's just the keyart that does that job.",
                "author": "Mishimotsu"
            },
            {
                "raw_content": "no customer's score and reviews.",
                "author": "Yipeekayya"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Gamescom Demos, how did the games run? Elden Ring, Silksong, MP4, etc...",
        "score": 402,
        "text_content": "In short, I went to Gamescom for 1 day (Thursday) and had the chance to play* 6 of the games that were being Demoed: Elden Ring, FFVII, Silksong*, Metroid Prime 4, Borderlands 4, Cyberpunk 2077*, Glaciered. Here are my notes, starting with Elden Ring: Elden Ring: Tarnished Edition Booth (No filming allowed) - Had to wait about 45 min - They were given 6 Switch2s (5 handheld, 1 docked) - Played on Docked Mode! - First Impressions: The game is playable. - How it looks: It looks really good, the graphics really look amazing. - How it runs: It runs like a toaster, not always though. In caves it seems to run really well, the problem is in the open spaces, and when you have too many enemies around. The enemies that are closer to you run well, but the ones in the back look like their running on 10fps and are made out of cardboard. It looks like it prioritizes the smoothness of the enemies the closer they are to you. The camera though, if you pan like crazy to see everything it feels like the game slows down to 20fps. Final Fantasy VII Remake Booth: - Waited about 25 min - They were given 8 Switch2s (4 Handheld, 4 Docked) - Played on Docked Mode - First Impressions: I was Blown away by how good it looks and how smooth it runs. - How it looks: I can only say that, if they would've told me that it was running on a PS5 or XBox Series X, I would have believed them. Damn it looks beautiful! - How it runs: It runs smoothly, I wasn't able to see any framedrops (docked). It ran like it owned the Switch2. Incredible work. Don't know if it's because the place wasn't really big, you are always inside the train stations. There was never more than 3 enemies at one given moment. So I don't know how it would run in a more open space and with many enemies around you. Hollow Knight: Silksong Booth (I recorded it) - For some dumb reason, they were not letting people play the game or even wait in line. They were telling people that if they didn't have a specific ticket 🎟️, they couldn't get in, everyone was so confused. Suddenly, around 14:00 hrs they took out a sign that said \"No More Silksong today, come back tomorrow\" which was baffling. It really got people angry, it was so inconsistent also, because even though they had the sign up, you could still see people being able to either bribe the guys that were letting people in, or just begging enough to let them in. Terrible management, to be honest. - I wasn't able to play, but I was granted the chance to just stand beside someone who was playing the demo and just watch the full demo. (I even recorded like 2 min of the demo with their permission). - First Impressions: AMAZING! - How it looks: The game looks Beautiful in both Handheld and Docked. - How it runs: It runs like a dream, no hiccups, no frame drops, nada. Feels like it is utilizing the Switch2 specs the most optimal way possible. I asked the guy who was standing in guard if he knew if it was running in 60 or 120 fps, he answered with: \"Legally I can say that it's running in 120 hz, I can't say fps\". Metroid Prime 4: Beyond Booth (Recorded 10 min of the demo with the approval of the staff) - Waited for 2 hrs 18 min - They had 14 Switch2s, all Docked. - First Impressions: I can't WAIT for the game to come out, I need to experience the game NOW! - How it looks: It looks unreal, this game was born to be played on the Switch 2, it will leave everyone blown away by it. - How it runs: Buttery smooth, no problems, not a single one! It is incredible. Also, I didn't know until I played it but there are actually 3 ways to aim in MP4: Using the Mouse controls (which it really is instant, it takes milliseconds to register that you're using the mouse), Using the rights stick, and then using giro-aiming like a Wii controller. - Observation: I found it tricky to play in mouse mode, not because it doesn't work, but it's because I couldn't find a comfortable way to be able to grab the joycon 2 in a way that I could controll the mouse and be able to press the buttons without loosing or changing the grip. I ended up using a mix of the r-stick and the giro-aiming to fight the boss. Borderlands 4 Booth: (No filming allowed) - Waited for 55 min in a line of 12 people. - They were given 4 Switch2s (2 Docked, 2 handheld) - Played on Docked Mode - First Impressions: Awful, definitely the worst demo by far. - How it looks: I don't know if Borderlands is just like that but for me it looked terrible. It really looked like how fortnite looked on the switch. I am so disappointed, and I didn't really have any expectations. - How it runs: It runs terrible also, it is not at a constant frame rate, it drops consistently making it very hard to even keep on playing, trying to aim while the frames keep dropping was very infuriating. This was the only demo that I actually had to put pause and just stop playing. Really a terrible first impression. - Observation: It was truly a terrible experience, I had to check and see how borderlands 4 looks like in PS5 gameplay trailers and it definitely is not the enemy designs or the art style. It is just terribly ported to the Switch2, the enemies looked like they were made out of sponges and Styrofoam. I can't really find another way to describe it. Also, while I was getting annoyed by the demo, I had people just behind me, on the same booth (it was a shared booth) playing Cyberpunk 2077 and that was running unbelievably well. All the praise that Cyberpunk has been getting, it is true! It is something to behold, very impressive. Glaciered (found on the indies area) - Didn't have to wait - One Switch2 - First Impressions: That version of the game has many glitches but I'm impressed and actually excited to check it out once it comes out. - How it looks: It looks ok, on the top right corner it did have the message saying: \"This is an in-development build. It doesn't represent the final product.\" - How it runs: Other than the glitches, it ran super smooth, I had no issues that I could see in regards to frame drops. If you have questions, share them below and would be happy to share my experience and thoughts on the games I was able to play and/or watch very closely!",
        "comments": [
            {
                "raw_content": "Great thread, really excited for ff7 so good to see square enix did an amazing port by the sounds of things (and digital foundry having the same experience as you op)",
                "author": "mafenide"
            },
            {
                "raw_content": "Holy cow. Kudos for all the waiting around the resulted in this post. Thank you!",
                "author": "SuitableFan6634"
            },
            {
                "raw_content": "You are not the first one to bounce off mouse mode for MP4. That's really, really bad. Mouse mode was one of the big exciting innovations for Switch 2, and people aren't even finding it comfortable for a 10-minute demo of a first-party FPS? I wonder if we will see right joy-cons that are in a dedicated mouse configuration?",
                "author": "eyevandy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Charles Martinet has been invited to 'Tokyo Nintendo Direct' in October ???",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a typo. It's for a Nintendo Live.",
                "author": "GomaN1717"
            },
            {
                "raw_content": "Typo as it was explained in Gamingleaksandrumours Sub.",
                "author": "DaveSinghSwitch"
            },
            {
                "raw_content": "Here's the google translation https://preview.redd.it/9y9tpnyjj6lf1.png?width=962&format=png&auto=webp&s=27eb61636652ba2d061dc00a5f373ce27f1f16e9",
                "author": "Momentarmknm"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 08/25/25",
        "score": 26,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Hollow Knight: Silksong release date (finally) announced: September 4, 2025](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mwcnqo/hollow_knight_silksong_release_date_finally/) * [LEGO Batman: Legacy of the Dark Knight announced](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1muqnoh/lego_batman_legacy_of_the_dark_knight_announced/) * [From what I've heard a few times now actually, Code Veronica Remake not only is being handled by a lot of the same people as RE:2 & RE:4, but it's being treated as a big budget mainline Resident Evil game in every way.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mwxngq/dusk_golem_from_what_ive_heard_a_few_times_now/) * [2K Games laid off more than 80 people at BioShock 4 developer Cloud Chamber this week, about 1/3 of the studio. This new BioShock has been in the works for more than a decade across multiple studios.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mvne37/jason_schreiernew_2k_games_laid_off_more_than_80/) * [Former Deck Nine Games dev alleges that Double Exposure 2 new game director is a nazi, claims similar behaviour is still protected by the studio due to their lack of transparency](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mwkn8z/former_deck_nine_games_dev_alleges_that_double/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Koei Tecmo confirmed that Hyule Warriors will be playable at TGS next month. Likely pointing more towards a general direct next month rather then a Prime 4 or a Mario focused one. As that game also needs a release date.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "It’s nice of Capcom to finally treat Code Veronica as a real RE game",
                "author": "Kevroeques"
            },
            {
                "raw_content": "Sadly nothing about the AC4:Black Flag remake",
                "author": "WanderingHero8"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate says it's true that plenty of large dev studios lack Switch 2 devkits",
        "score": 676,
        "text_content": "[Source](https://famiboards.com/threads/df-says-that-lots-of-devs-are-still-struggling-to-get-switch-2-devkits-including-some-big-aaa-devs.14812/post-1956681) Bonejack said: > This bullshit again after Matt went to comment it in the other thread. > > While obviously he can't speak for every dev in every region, his comment should hold more weight here than these reports. Nate's reply: > Matt's comment was specifically for the Gerstmann email situation. That email can be false & the DF conversations at Gamescom be true -- **and they are true. Plenty of large dev studios lack devkits.** **EDIT:** [**Another reply from Nate**](https://famiboards.com/threads/df-says-that-lots-of-devs-are-still-struggling-to-get-switch-2-devkits-including-some-big-aaa-devs.14812/post-1956685) thegodsend said: > I talked to some devs at Gamescom. Some did not have devkits yet, but many had just received them. Consensus is that before launch, it was very hard to get any and things are improving a lot now. Nate's reply: > Right. The situation is improving but remains less than ideal, as Nintendo's communication continues to be poor with many partners. **EDIT 2:** [**Another reply**](https://famiboards.com/threads/df-says-that-lots-of-devs-are-still-struggling-to-get-switch-2-devkits-including-some-big-aaa-devs.14812/post-1956715) Goodtwin said: > Is it less than ideal though? I mean, from Nintendo's perspective, pushing a large scale flood of PS4 era ports into year two of Switch 2's life may be beneficial. Nintendo is apparently confident that they can sell the first 15-20 million units on the back of Mario Kart World, DK Bananza and Switch 2 Edition games. By delaying the flood of ports, this allows the Switch 2 to have a userbase large enough for those games to have a real chance to sell. Pumping out 100+ titles on a userbase of 10 million would result in a lot of publishers expressing disappointment in their games sales success on Switch 2. The majority of games that developers want to put on Switch 2 will ultimately come and by having development studios receiving development kits at different times, it basically guarantees a steady flow of titles from third parties for the next couple of years. Nate's reply: > When partners are planning their fiscal year and want to include SW2 on the roadmap but can't due to Nintendo being silent... yes, it's less than ideal.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "The single funniest part about Bubsy 4D is that it’s getting a native Switch 2 port.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "What exactly was Nintendo’s plan here? Isn’t 3rd party support kind of important? Can’t imagine what the reasoning is behind this.",
                "author": "myretrospirit"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Digital Foundry: Lots of devs at Gamescom said they aren't able to get Switch 2 dev kits. There are even weird exclusions for some big AAA developers",
        "score": 946,
        "text_content": "https://youtu.be/N0SW7R5H5wY?t=504 Quotes from the segment: > **John:** \"Where I've spoken with plenty of developers where they were either told that their game.. they should just ship it on Switch 1 and rely on backwards compatibility. There's a lot of developers that are unable to get Switch 2 dev kits. We talked to *a lot* of devs at Gamescom this year and so many of them said the same things. They want to ship on Switch 2. They would love to do Switch 2 versions. They can't get the hardware. It's really difficult right now.\" > **Oliver:** \"I don't really understand the strategy because like you said, even now developers are struggling to get systems. And I know that some months ago when we're, you know, hearing things through the grapevine and talking to people, there were some weird exclusions with some big developers struggling to get kits for games, from what we've heard. And there were some weird inclusions as well, like some indies were included which is nice to see but like there's that campfire game you know the kind of camera campfire game and they're getting kits and some big developers on the other hand who developed like AAA stuff aren't necessarily in the pipeline there for kits.\"",
        "comments": [
            {
                "raw_content": "Nintendo has handled this launch in such a bizarre way. Where are the games at?",
                "author": "SpaciousCrustacean"
            },
            {
                "raw_content": "I saw someone cover a LinkedIn post of a publisher/company giving tips on how to better acquire a Switch 2 dev kit and I thought it was interesting because apparently Nintendo is priotiziing Switch 2 dev kits for developers/publishers whose game(s) are showcasing the new feature of the system such as DLSS 3.1, 4K 60FPS support, gamechat functionality, mouse mode, HD Rumble 2, gameshare, and more. EDIT: This may not be true. I'm assuming Nintendo has given Switch 2 dev kits for the major publishers and select notable indie developers but the rest are in a queue with ones showing Switch 2 features specifically getting priority. It would explain why a developer such as Hello Games got a Switch 2 dev kit so early.",
                "author": "PokePersona"
            },
            {
                "raw_content": "I hope Switch 2 will get lots of 3rd party support like Switch 1 did. As much as I love Nintendo 1st party games, I want to play lots of good 3rd party games also. Nintendo not providing dev kits to those studios sounds like a bad idea to me.",
                "author": "Gen_X_Gamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hero interactions with Daredevil in Marvel Rivals have been leaked",
        "score": 167,
        "text_content": "Source: https://xcancel.com/X0X_LEAK/status/1960069422540066923",
        "comments": [
            {
                "raw_content": "lemme tell you sumn Red",
                "author": "scott1swann"
            },
            {
                "raw_content": "Some early hero gameplay has [leak](https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSr7EyXB8R8urdw0Iby9iAWrE0hP2V0MMTNkRsY-sqA-fdlpT3g1m_meEI&s=10) as well",
                "author": "millanstar"
            },
            {
                "raw_content": "Hell yeah wonder how his gameplay will be",
                "author": "galaxyadmirer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA skate. NDA lifts on August 29th",
        "score": 206,
        "text_content": "Community manager accidentally leaked the date, quickly deleted it. [https://i.imgur.com/Tb131gv](https://imgur.com/Tb131gv)",
        "comments": [
            {
                "raw_content": "This game is so conflicting, there's oldheads like me who appreciate it for being an investment-free fun time for an hour or two after work, the physics are good and the actual skating feels great. However, it's \"made by skaters, for skaters\" spirit has been ripped out entirely. It's very corporatey and \"made for teenagers, by suits\" feeling instead, by way of the NPCs and the general feel of the world. The soundtrack is great so far, I appreciate JVB, Turnstile, Fidlar and Panda Bear being in there. I question how long the game will last too, there is the fact it's a live service game, which means it will eventually die one day, but with how limited in scope the whole daily missions framework is, it's easily at risk of growing stale very quickly.",
                "author": "BALLCLASH"
            },
            {
                "raw_content": "They're announcing the early access release date tomorrow (August 26th) at 9am PT / 12pm ET: [https://www.youtube.com/watch?v=p14MSdRtNIo](https://www.youtube.com/watch?v=p14MSdRtNIo)",
                "author": "SachinBahal28"
            },
            {
                "raw_content": "All I'm gonna say is I have 500+ hours on the playtest alone. I've 100%'d the game (all content \\[like boxes and such\\] + achievements) 4 times out of the 6 total resets. (The last period was very short.) All I'm gonna say is, it's NOT the old skate, but it's a skate that I genuinely love and appreciate, especially for existing in this day and age. This is a big nothing burger way to say I really like the skate that was been built the past couple of years and being able to slowly steer the game in the right direction.",
                "author": "Jhyxe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hero interactions with Deadpool have also been leaked (Marvel Rivals)",
        "score": 101,
        "text_content": "Source: https://xcancel.com/X0X_LEAK/status/1960089802709356544",
        "comments": [
            {
                "raw_content": "i only hope this also means cable & domino soon too, those two alongside him would be so awesome",
                "author": "foulveins"
            },
            {
                "raw_content": "I don't want him to be a DPS, that's the obvious choice... I want him to be a fucking healer because fuck you. Doesn't make sense but would be really funny",
                "author": "Beteoto"
            },
            {
                "raw_content": "Hope he's a tank, since he's immortal",
                "author": "EndlessFantasyX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC has corroborated the claim of a mid-September Direct",
        "score": 483,
        "text_content": "https://www.videogameschronicle.com/news/a-nintendo-direct-is-reportedly-planned-for-mid-september/ I yearn for the day of the Direct.",
        "comments": [
            {
                "raw_content": "This is going to be the first Direct people are not going to be asking for Silksong...no, they will be asking for Silksong DLC",
                "author": "abermea"
            },
            {
                "raw_content": "A direct in September? That’ll be the day",
                "author": "Batusiman"
            },
            {
                "raw_content": "Xenoblade X update so I can start my playthrough",
                "author": "topplehat"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Monolithsoft Posted a Hiring ad on Twitter, with a gif of a Xenoblade 2 cutscene that has noticeably different lighting and better background details. Possibly taken from a remaster/Switch 2 Edition?",
        "score": 404,
        "text_content": "https://xcancel.com/MONOLITHSOFT/status/1959813021230149807#m [Here is also a comparison.](https://xcancel.com/SoSnake13/status/1959893819190824996#m)",
        "comments": [
            {
                "raw_content": "I love you... and all you guys!",
                "author": "Arcade_Theatre"
            },
            {
                "raw_content": "Interesting that the lighting is more defined than it was in the original release. Wonder if this means we're going to get decent reworks for Switch 2 Editions.",
                "author": "OpeningConnect54"
            },
            {
                "raw_content": "Hopefully the tweaked lighting means these are pretty extensive reworks. Would love to experience these games with better lighting and without soupy textures. Xenoblade 3 especially is an image quality bump and texture upgrade away from looking really good.",
                "author": "lattjeful"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Charles Marinet posts on Instagram about an October Nintendo Direct",
        "score": 138,
        "text_content": "https://www.instagram.com/share/p/_tv8rLUDr Don't think he was supposed to let this slip!",
        "comments": [
            {
                "raw_content": "he means Nintendo Live not Nintendo Direct, just a typo: https://tokyocheapo.com/events/nintendo-live/",
                "author": "Freezenification"
            },
            {
                "raw_content": "pretty sure he just got the terminology mixed up and means Nintendo Live in Tokyo https://www.nintendo.com/jp/live/index.html",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "He specifically says \"I’m very happy to be invited to the Tokyo [\\#nintendodirect](https://www.instagram.com/explore/tags/nintendodirect/) this October 4 and 5!!!!\" Don't think he's referring to an actual Nintendo Direct livestream...",
                "author": "ESF007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel’s Next-Gen Clearwater Forest “E-Core” Xeon CPU Unveiled: 12 CPU Chiplets On 18A Node, 288 Darkmont Cores, 17% IPC Increase, 2x L2 Cache Bandwidth, DDR5-8000 Support",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If thats 17% over Skymont they should be basically at Lion Cove IPC by now",
                "author": "CHAOSHACKER"
            },
            {
                "raw_content": "288 cores! WAT",
                "author": "TurnUpThe4D3D3D3"
            },
            {
                "raw_content": "Was this article written by AI. What is “Intel went all 3D when building Clearwater Forest” and “utilizes Backside metal ”? I know what it’s trying to say but I would have thought that someone would proofread this before publishing.",
                "author": "Profile_Traditional"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Panther Lake-H VNX+ motherboard offers up to 32GB LPDDR5X-8533 and 1TB SSD for industrial use",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, one of the very few threads on here that are open for discussion. Mods are asleep.",
                "author": "D4m4geInc"
            },
            {
                "raw_content": "SKU's on these motherboards: H484 = 4 P-cores + 8 E-cores + 4 LPe cores H404 = 4 P-cores + 4 LPe cores P-cores = Cougar Cove (Likely slightly improved LNC) E-Cores = Darkmont (Likely slightly improved Skymont) LPe cores = Darkmont 4-core clueter on a separate \"low power island chiplet\" without any L3 cache. (4mb of L2 as LLC) connected to the I/O chiplet via Intel's scalable fabric. Compute tile L3 cache topology: P+E cores share L3 cache on a ring bus with each P-core connected to an L3 slice and each E-core cluster that consists of 4-cores sharing 4mb of L2 cache connected to a single L3 slice. Each L3 slice is likely connected with 4 concentric bidirectional rings that can send and receive inst/data between each other. This system of using rings to connect L3 slices is called a **ring bus** (On Sandy Bridge, the 4 rings consist of a data ring, request ring, acknowledge ring, and a snoop ring) P and E core clusters have been spaced together since ARL due to thermal hot spot issues on the previous L3 Topology, as seen in the i9 13900K: P--P--P--P--P--P--E--E P--P--P--P--P--P--E--E The L3 topology for H484 likely looks like: P--E--P P--E--P The L3 ring bus had a clock speed of 3.8Ghz on Arrow Lake and 4.5Ghz on Lunar Lake. PTL ring bus clocks will likely be close to or better than LNL These SKU's will likely use the 4Xe3 core graphics chiplet made on Intel-3 due to their industrial use case. There is also a 12 Xe3 core chiplet made on N3, but it will only likely be seen on certain laptop SKU's",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "Very cool. And I think that memory is the same performance as LNL. Got concerned when I saw the 6400/7200 spec on the board with SO-DIMM",
                "author": "JRAP555"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD B850 Motherboard Roundup: Sub $200 Models",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Crazy how expensive boards have got, I remember picking up an AsRock B450 board for £65 back in 2020",
                "author": "ft4200"
            },
            {
                "raw_content": "Missed out on MSI Mag Mortar B850m which cost me exact $200",
                "author": "atulshanbhag"
            },
            {
                "raw_content": "Weird to review boards without mentioning the risk of the Asrock board murdering your 9000 series CPU. Go look at the Asrock subreddit if you think its solved or it's not an issue. Just a few days back there were 7 reports of dead CPU's in a SINGLE day.",
                "author": "pixelcowboy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Linux 5.15 LTS To 6.17 Benchmarks: Four Years Of Kernel Improvement Net 37% Improvement On AMD EPYC",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very well written article but my only question is are those the default flags or did they have to customize the kernel flags to do this? Impressive either way.",
                "author": "cc0537"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Geekom unveils A9 Mega, AMD Ryzen AI MAX+ 395 \"Strix Halo\" Mini-PC - VideoCardz.com",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is awesome! I wonder how it compares to the Beelink GTR9 Pro. Since the GTR9 Pro is double the height for more cooling. edit: the Beelink has an integrated power supply.",
                "author": "welp_im_damned"
            },
            {
                "raw_content": "Strix Halo is going to be awesome in a mini pc",
                "author": "TheAppropriateBoop"
            },
            {
                "raw_content": "I’m sorry but what use are mini PCs? They’re nowhere near as powerful as a real PC and portability wise are almost as bad",
                "author": "Marv18GOAT"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lenovo Legion Go S Review - Gaming handheld is much faster thanks to SteamOS",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm more interested in seeing the same Z1E extreme version in SteamOS vs windows.",
                "author": "ToTTen_Tranz"
            },
            {
                "raw_content": "I have this exact model and love it. Didn't even try windows just immediately installed steam OS. At first I was wildly impressed with the Z2Go and didn't get the hate surrounding it. Played through GoW:2018 fine, Doom ran great, Enternal much the same. I did just install Cyberpunk on it and are now seeing some of the complaints regarding performance. It's a bitch of a game to get a locked 60fps experience on. I don't regret it though since 90% of the time I'm at home and can use remote play with my desktop. But I've been very pleased overall with the experience.",
                "author": "mrblaze1357"
            },
            {
                "raw_content": "This product is very confusing, Theres multiple versions. Some have 32gb z2 go Steam os, some have windows but 16gb",
                "author": "Jejiiiiiii"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Housing panic grips half of US cities as record price cuts send home values tumbling",
        "score": 288,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is this? Are articles attempting to insinuate terribly low prices to have buyers jump in?? “Omg record price cuts!!” House which was selling 5 years ago for $150k, was attempted to be sold last month for $750k and was now lowered to $745k. Yay! Record price cuts…",
                "author": "These-Resource3208"
            },
            {
                "raw_content": "My favorite is when people call this a buyers market.",
                "author": "33Arthur33"
            },
            {
                "raw_content": "Uh huh.",
                "author": "tierbandiger"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Homes Are 11% Smaller but 74% More Expensive per Square Foot",
        "score": 145,
        "text_content": "https://www.lendingtree.com/home/mortgage/home-sizes-study/#methodology *Newly built homes in the U.S. have gotten smaller in the past decade, while the average price per square foot for these homes has skyrocketed.* Here’s more on what we found in an analysis of Census Bureau data on new-home sizes and prices across the nation. Key findings New-home sizes have shrunk over the past decade, except in the Northeast. The average size of new single-family homes sold nationwide decreased by 11.2% from 2014 (2,707 square feet) to 2024 (2,404). New houses sold remain spacious by historical standards, despite recent declines. The average size of new single-family homes sold rose 17.3% from 1994 (2,050 square feet) to 2024 (2,404). Home sizes peaked in 2015 at 2,724 square feet. While there was a brief uptick in 2022, they declined in 2023 and 2024. Smaller homes are making a comeback, but not everywhere. In 2024, 1 in 4 new single-family homes sold were under 1,800 square feet, up significantly from 17% in 2014. **The average price per square foot of a new house has surged over the past decade. From 2014 to 2024, the average price per square foot for new single-family homes sold in the U.S. rose by 73.6% from $97.25 to $168.86.**. What have you all seen? Are new builds better in quality than before or are they worse?",
        "comments": [
            {
                "raw_content": "The Northeast is probably the exception because they don’t build ***any*** homes in the Northeast. Only overpriced “luxury” apartments, with basic amenities. They only throw in the word ‘luxury’ to keep out affordable housing.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Families have been getting smaller. A lot of people aren’t interested in giant McMansions with 5 bedrooms. We really need more small homes. We also need them to be affordable, which is another matter.",
                "author": "xxzzxxvv"
            },
            {
                "raw_content": "Whoa I was worried for a minute we might be in a bubble but now that I see how high the prices are I feel better thanks.",
                "author": "indyprivatelending"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I'm underwater on my home loan and the house isn't selling, what would you do in my situation?",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You’re going to have to drop the price and see what a buyer is willing to close at. Many people that bought some boomers garbage in 2020-2022 are very heavy bag holders now (unfortunately myself included)",
                "author": "Suspicious_Safe_6150"
            },
            {
                "raw_content": "Ride it out or eat the loss",
                "author": "andthatstotallyfine"
            },
            {
                "raw_content": "Sounds like this is a hot mess. So the house is $7k behind on the mortgage and they are afraid of a short sale, since they don’t want to hurt their spotless credit. It’s a little late for that.",
                "author": "uckfu"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Market Sees Highest July Cancellations Since 2017",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s hard to put this in perspective because the relative shift is so small, like half a percent. That more cancellations are happening is without doubt. But anecdotal stories on this sub would make you think it’s several times more than before, when in reality it’s moved from like 14.5% to 15.3%.",
                "author": "Will_Not_Comment_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Mortgage Spread Has Dropped to a 3-Year Low. That’s Good News For Homebuyers and Refinancers.",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear any little thing is being used as a positive sign to buy homes. I honestly wonder how many people will think “they’re making less money on the difference, that means it’s good to buy!”. Pro tip for anyone, just because the difference of what they charge versus what they pay is smaller does not mean anything, only more efficiency for the market efficiency.",
                "author": "GTHero90"
            },
            {
                "raw_content": "The difference between mortgage rates and the 10-year treasury yield has narrowed, signaling a potential boost for homebuyers. A decrease in the mortgage spread can cause mortgage rates to fall, even without the Fed cutting interest rates. That’s good news for house hunters and homeowners looking to refinance because, setting aside Fed policy, it means mortgage lenders are offering lower rates. The mortgage spread fell to around 1.5 percentage points–lower than usual–in 2021, when mortgage rates were sitting at record lows. It doubled in 2022 and 2023 to levels usually seen during financial turmoil because mortgage rates increased, markets became more uncertain, and lenders were trying to hedge their risks by charging more interest. Now, the spread is slowly falling but it has more room to fall before returning to more typical levels, around 1.5-2 percentage points. That means there’s more potential for mortgage rates to fall more than treasury yields. “Think of the spread like a restaurant meal,” said Chen Zhao, Redfin’s head of economics research. “The treasury yield is the cost of raw ingredients, the mortgage rate is the price of the meal on the table, and the spread is the restaurant’s markup, which covers the cost of the chef, rent on the restaurant, profit margin, etc. Regardless of the cost of raw ingredients, if the restaurant has a lower markup, that lowers the customer’s bill. Similarly, regardless of the Fed’s actions, a lower mortgage spread helps lower mortgage rates.” Why the Mortgage Spread Dropping Matters For Homebuyers and Homeowners A lower mortgage spread equals lower mortgage rates. If the spread continues to decline, mortgage rates could fall more than they already have. “It’s important to note that if the Fed cuts interest rates as expected in September–or more than expected–mortgage rates may fall more than anticipated because the spread is also falling,” Zhao said. It’s also worth noting that we’re in a buyer’s market, with many sellers open to negotiations, including lowering their price, because many homes have been sitting on the market for a long time. Combined with lower rates, now may be a good time to lock in a lower monthly housing payment. A homebuyer on a $3,000 monthly budget can afford a $439,000 home with a 6.55% mortgage rate, roughly today’s average. That means that homebuyer has gained roughly $20,000 in purchasing power since May, when rates hit a recent peak of 7.08%. Redfin agents in some parts of the country have reported that homebuyers started responding to lower mortgage rates over the weekend. The gap between 10-year treasury yields and mortgage rates (known as the mortgage spread) has dropped to its lowest level in over three years, allowing mortgage rates to fall more than treasury yields. The spread was 2.26 percentage points as of August 22, down from about 2.5 at the start of summer and 2.68 a year earlier.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory continues climb upward from last week",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Months of supply which is a more meaningful gauge of supply and demand dynamics is back to \\~2017 levels. [https://en.macromicro.me/charts/32/existing-home](https://en.macromicro.me/charts/32/existing-home)",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Crazy that we’ve increased rates to levels not seen since the 90s, and inventory still hasn’t gotten to 2019 levels. And 2019 levels were low… I expected inventory to be substantially higher this year tbh, but it has flattened and looks to have peaked for the year.",
                "author": "regaphysics"
            },
            {
                "raw_content": "The from 2019 levels are what I find the most interesting. Closing In on prepandemic levels nationwide",
                "author": "DizzyMajor5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home sales up median price down",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice, so prices dropped and buyers entered the market. Surprise surprise... Its almost like the housing market was overpriced...",
                "author": "xomox2012"
            },
            {
                "raw_content": "down YoY",
                "author": "TrickySalamander589"
            },
            {
                "raw_content": "nguyen crash",
                "author": "so_now_you_know"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Home Sales Flat as Affordability Concerns Persist",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "High mortgage rates, rising construction costs and economic uncertainty continue to deter many potential home buyers during this summer season. Sales of newly built single-family homes edged 0.6% lower in July, falling to a seasonally adjusted annual rate of 652,000 from an upwardly revised reading in June, according to newly released data from the U.S. Department of Housing and Urban Development and the U.S. Census Bureau. The pace of new home sales is down 8.2% from a year earlier. A new home sale occurs when a sales contract is signed, or a deposit is accepted. The home can be in any stage of construction: not yet started, under construction or completed. In addition to adjusting for seasonal effects, the July reading of 652,000 units is the number of homes that would sell if this pace continued for the next 12 months. New single-family home inventory held steady at 499,000 residences marketed for sale as of July. This is 0.6% lower than the previous month, and 7.3% higher than a year ago. At the current sales pace, the months’ supply for new homes remained elevated at 9.2 compared to 7.9 a year ago. A measure near a six months’ supply is considered balanced. On a year-to-date basis, new home sales are 4.0% lower thus far in 2025. As a result of slowing home sales conditions, inventory remained elevated in July at a 9.2 months’ supply. As estimated by NAHB, total months’ supply, defined as a combination of current new and resale single-family inventory, now stands at 5.2. This is the highest sales-adjusted inventory level since 2015 and will place downward pressure on housing construction starts in the months ahead. A year ago, there were 99,000 completed, ready-to-occupy homes available for sale (not seasonally adjusted). By the end of July 2025, that number increased 19.2% to 118,000. However, completed, ready-to-occupy inventory remains just 23% of total inventory, while homes under construction account for 54%. The remaining 22% of new homes for-sale in July were homes that had not started construction when the sales contract was signed.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Mortgage rates aren't high, though. They're historically average. Prices, however, are 40% too high and need to come down to match interest rates.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Elon on AI replacing workers",
        "score": 5242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That opinion does not align with the people or policies he supports.",
                "author": "CatalyticDragon"
            },
            {
                "raw_content": "The guy doesnt even pay out severance he legally promised and was obligated to pay, how could you trust him to be generous He is a cheapskate, doesnt even pay for his kids alimony, only like 2k a month!! Hell I could pay that",
                "author": "Beneficial_Map6129"
            },
            {
                "raw_content": "The world's richest person who continually wants more says he's going to give out lots of money? Somehow I don't believe him.",
                "author": "WhenRomeIn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A Google release seems imminent",
        "score": 340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The scale in the bottom right says 5 micrometers. This implies we're getting a micro-scale banana. Model 1000x bigger than nano banana confirmed.",
                "author": "Klutzy-Snow8016"
            },
            {
                "raw_content": "Gemini Banana is coming",
                "author": "adarkuccio"
            },
            {
                "raw_content": "If there is Nano Banana, there must be Ultra Banana.",
                "author": "Life_Ad_7745"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 completes Pokémon Crystal - Defeats final boss in 9,517 steps compared to 27,040 for o3",
        "score": 460,
        "text_content": "Although not an official benchmark, the 3x action efficiency and victory while under-leveled implies a greater understanding of world modeling and strategy that might be overlooked by standard benchmarks Source: [https://x.com/Clad3815/status/1959856362059387098](https://x.com/Clad3815/status/1959856362059387098)",
        "comments": [
            {
                "raw_content": "I use GPT-5 (mostly Thinking Mode) in my work (law practice) and it is way better than o3. Substantially less hallucination and it really pinpoints legal issues in docs more accurately. Very happy with it.",
                "author": "Moist_Emu_6951"
            },
            {
                "raw_content": "Impressive though Pokémon is like the perfect RL env",
                "author": "Accomplished-Copy332"
            },
            {
                "raw_content": "But Rddt told me 5 sucks ass??? /s",
                "author": "Freed4ever"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3? Following a 3 ship emoji from one of the devs just 4 hours ago",
        "score": 536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/88akb111m7lf1.jpeg?width=1080&format=pjpg&auto=webp&s=4afb5b76064a6b3b380131bb32e925ddd0cd3e3a The 3 ship emojis in question",
                "author": "flewson"
            },
            {
                "raw_content": "More like \"Ship 3 things\", one of them could be Gemini 3 ofcourse, but I don't get my hopes up.",
                "author": "kgurniak91"
            },
            {
                "raw_content": "If it's Gemini 3 I'll eat my hat.",
                "author": "swarmy1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Using AI to play inside Magic the Gathering artworks and worlds",
        "score": 1620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm here for the MTG crossover",
                "author": "itshifive"
            },
            {
                "raw_content": "The near future is going to be wild, no one is working, and we're all just experiencing ai vr worlds",
                "author": "Icedanielization"
            },
            {
                "raw_content": "What is this fantastic thing?",
                "author": "Green-Ad-3964"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Logan Kilpatrick posts \"Gemini\"",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|10vJoTT4oWZR84)",
                "author": "wNilssonAI"
            },
            {
                "raw_content": "He should have posted: Artificial Gemini Intelligence To make everyone lose their minds here",
                "author": "adarkuccio"
            },
            {
                "raw_content": "Sam : You merely adopted the hype, I was born with it. Molded by it.",
                "author": "mightythunderman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon Musk’s xAI secretly dropped its benefit corporation status while fighting OpenAI",
        "score": 145,
        "text_content": "https://www.cnbc.com/2025/08/25/elon-musk-xai-dropped-public-benefit-corp-status-while-fighting-openai.html",
        "comments": [
            {
                "raw_content": "I love it when they continue to deadname X (formerly Twitter) lol",
                "author": "x_typo"
            },
            {
                "raw_content": "https://preview.redd.it/kkis3upbo8lf1.jpeg?width=1070&format=pjpg&auto=webp&s=856bf9d1743868fb8200d26d19f7e26a43fae9c8",
                "author": "thatguyisme87"
            },
            {
                "raw_content": "Lying liar who tells lies, who is also a sneaky sneak who sneaks, does sneaky things and lies about it. More news at six.",
                "author": "ddri"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Lab-grown brain cells are being transplanted into patients with Parkinson’s — and they are working",
        "score": 163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what Jefferson called \"a beautiful addition to our knowledge.\" (He was talking about Harvey and blood circulation, but the concept holds.) But brains are systems, not nodes (neurons). I don't have any expertise on what this news means for structural change. Does such macro change emerge from neuron transplants? Without such change, how much is the disease alleviated?",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "It's really cool and all, but knowing humans, I have to wonder, will this double as The Heroin v2, Ultimate Permanent edition?.. Because to me, this stuff sounds like the perfect drug a rich junkie would pay a whole lot of money to have.",
                "author": "ohHesRightAgain"
            },
            {
                "raw_content": "Lets see if the brains architecture scales",
                "author": "Regular-Log2773"
            }
        ],
        "subreddit": "singularity"
    }
]