[
    {
        "post_name": "Trump haters wake up mad daily, it's beyond mental illness. You don't truly care about Epstein's victims; you're faking outrage hoping that Trump's name is involved.",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They try to change the channel in their brain, but the same show is on every one.",
                "author": "Tim_Berframer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden-Appointed Fed Governor Investigated For Stock Trade Violations Before Resigning, Gov Ethics Office Finds",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FUCK ISLAM",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because that's the UK, a Muslim is posting that. Maybe that's exactly why the reply...",
                "author": "Shitsbrokeyo"
            },
            {
                "raw_content": "All animals are made to be eaten",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "She's probably going to the pokey for that remark.",
                "author": "kippo_hard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fail: Illegal Alien Whom an Indicted Judge Allegedly Tried to Help Evade ICE Has Been Deported",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only fail is that the judge hasn't been deported",
                "author": "lolpaladins"
            },
            {
                "raw_content": "I forgot about that bitch. Hope she's convicted. Jailed. Loses job. Loses pension. Live out her sad life mocked and afraid.",
                "author": "Bongos"
            },
            {
                "raw_content": "Harboring an illegal is a federal crime, they specifically ask you about it if you apply for the DHS. Arrest her.",
                "author": "Gfloydvotestrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ten Years After the Paris Climate Agreement, Climatism Is Crumbling",
        "score": 498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The issue is that to make any real dent in pollution globally (which is a very real problem, let's not get that tangled up with the anthropomorphic climate change BS), you need to get China and India on board. And not with suicidal economy ending nonsense either. But common sense stuff, like maybe not treating your so-called sacred rivers like garbage dumps.",
                "author": "tholinz"
            },
            {
                "raw_content": "Michael Crichton, author of Jurassic Park, debunked all of this in his 2004 book \"State of Fear.\" It's the only fiction book I've ever read that had an extensive bibliography and citations. Hollywood isn't exactly bending over backward to option that one.",
                "author": "airborne3502"
            },
            {
                "raw_content": "> Reform UK, the opposition party led by Nigel Farage in the UK, is now using the phrase “Net Stupid Zero.” Good one!",
                "author": "uniformist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump admin begins massive crackdown on violent illegal migrants in Charlotte",
        "score": 521,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this, focus on this and stop with the dumb shit",
                "author": "magaspif"
            },
            {
                "raw_content": ">While the exact number of arrests remains unclear, local officials blasted the operation for “causing unnecessary fear and uncertainty” in a city home to more than 150,000 immigrant residents. they should be afraid, as none of them belong here.",
                "author": "-Evspra"
            },
            {
                "raw_content": "Personally, I care more about getting the illegals out than the Epstein list. Priorities.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Feds expand terrorism charges against Antifa members indicted in Texas ICE center shooting",
        "score": 404,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How do any of those people ever explain to a prospective employer during a job interview their felony arrest record on terrorism charges? Or will they openly brag about it because it's viewed as a resume enhancement?",
                "author": "Oldman1234"
            },
            {
                "raw_content": "When drone strikes on Portland",
                "author": "MikeyisNinja"
            },
            {
                "raw_content": "How about instead of this piecemeal throw-us-a-bone bullshit they do these things: * Identify chapters in each state, raid and arrest * Identify their funding paths, raid and arrest * Identify any standing members of govt that have assisted them, raid and arrest Everything else is just theater until they purge these fucking faggots and their supporters.",
                "author": "FrmrAmericanRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All junk food. All paid for by us",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why would anyone *even consider* going to work?",
                "author": "Bullet3250"
            },
            {
                "raw_content": "I wasn't racist 10 years ago. But now? Shiiiiiiiiet.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Stop calling 25 pounds of hot pockets and chips groceries.",
                "author": "Wtf_socialismreally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal Americans Are Six Times More Likely To Smoke Marijuana Than Conservatives, Poll Finds",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I smoke weed everyday and never once thought climate change was a problem or that a man can be a woman. Don’t care to see the republicans or the dmemocrats telling me what I can or cannot put it in MY body. If you hate weed, don’t fucking smoke it . However I notice a lot of weed haters like to pontificate about while drunk",
                "author": "FaRmErX2000"
            },
            {
                "raw_content": "Nobody cares, the crusade against pot has been expensive, entirely against our principals as the supposed side against government overreach, and not even successful. It's time to tell Big Pharma, Booze, and Tobacco that they're just going to have to deal with competition like any other industry and move our focus to more productive areas, like dealing with our collapsing economy.",
                "author": "LordKuroTheGreat"
            },
            {
                "raw_content": "Wow. The pill factories reallllllllly wanna keep pumping out pills. The coordinated effort to keep pushing pills on RFK’s watch allegedly because of “desk resisting bearucrats.”",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Swing Voters Have Some Bad News for Dems With Blowback Over Shutdown",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When you call people going hungry \"leverage\" there's not much room for recovery.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "They have Dominion and adjudication. FIX THAT. Until then it will be business and elections as usual. Sorry I dont think America always teeters 51/49 every fucking election.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Well, Dems out-performed their elections during the shutdown so I think this article is a bunch of cope. Dems are angry and ready to vote. MAGA is bitter that Trump seems to be going RINO/MIGA so not enthusiastic to vote. Gonna be a bloodbath in the midterms.",
                "author": "patriotpodcast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Blaze: \"America Didn’t Lose its Tech Edge — Globalist CEOs Gave it Away.\" This is the truth.",
        "score": 332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "H1b workers are inferior. They are not where innovation or problem solving comes from. They are a strategy for mediocrity, not excellence.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "Gave it to BRICS. Yep let's just give our advantage to an adversary because of muh costs",
                "author": "RizzlieDoodad"
            },
            {
                "raw_content": "Street shitter CEO's that were elevated to be in charge of the tech firms were put there to give it away",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sunday Prayday.",
        "score": 403,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blasphemy in jest is still. Eternity is forever. Jesus Christ is Lord and Savior! None shall be before God Almighty but through Him. You are chastised. 🤗 May the Grace and Mercy of God and Jesus Christ be with you all!",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "I thought this was going to be a serious post. Instead, it is seriously disappointing.",
                "author": "Mamapedia"
            },
            {
                "raw_content": "Flase idol",
                "author": "taxesaretheft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Government was shut down for 45 days and not one blue-collar worker was affected",
        "score": 457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I also work for white collar DoW. I know many on my team affected, including contractors out without pay. Any many gov. Granted we get back pay per law but it did become stressful for many living on savings and finding part time work, like I did. But gov still way too big outside DoW.",
                "author": "jonnyuno"
            },
            {
                "raw_content": "This wasn’t their first rodeo. The previous shutdown of over 30 days caused many to do the unthinkable in the most recent shutdown: they learned to cope.",
                "author": "Matehmateh"
            },
            {
                "raw_content": "So many people that live off the government don't realize they live off the government. Doctors, nurses, lawyers, engineers, coders, AND contractors.",
                "author": "blackswans"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: “I'm so saddened to see what happened in Europe with the immigration... Europe is not the same place.”",
        "score": 739,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sad about America.",
                "author": "Goozmania"
            },
            {
                "raw_content": "I only want to hear about Europe's immigration problems if the president is using their woes as justification to ramp up deportations and eliminate H-1Bs here.",
                "author": "airborne3502"
            },
            {
                "raw_content": "He JUST gaslighted America about H-1B Visas claiming there aren't any Americans that can do those jobs, (70 to 80% are enrty level), and agreed to bring in 300,000 Chinese back into our colleges to prop them up. Pretty sure this is the opposite that we want as Ameri-CANS.",
                "author": "BigE_123456"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 It's been CONFIRMED that everybody on SNAP will now be FORCED to reapply to the program after massive fraud was revealed. 186,000 THOUSAND dead people. Hundreds of thousands of double-dippers. Purge the fraud!",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prosecute the fraud!",
                "author": "Wizard_Glick"
            },
            {
                "raw_content": "Just end the program entirely. It's unnecessary. Let those NGOs who are so concerned about helping migrants fill this gap for those who really need it. Send government cheese to anyone who needs it. Make SNAP only pay for vegetables, lower cost cuts of meat, water and bread. People won't want to be on it for long. Any or all of these ideas are better than our current system.",
                "author": "JoePlumber"
            },
            {
                "raw_content": "But... muh 10 minutes of effort to lock in 20 hours of someone else's after-tax wage every month for the rest of muh life! The horror! So unfair!",
                "author": "SBOJ_JOBS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Truckload rates are falling leading into Thanksgiving. First quarter will be apocalyptic if the administration doesn’t take action.",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The great news is that nobody knows wtf spot rates are.",
                "author": "Protonboy"
            },
            {
                "raw_content": "The good news is fewer Indian drivers on the road killing people.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Explain this to me like I'm retarded (...because I am)",
                "author": "MaoHadOnly1Testicle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SCOTT ADAMS: Dilbert and Scott Update: Right hand - focal dystonia Left hand - semi-paralyzed I will continue writing Dilbert. My Art Director takes over the drawing. . . Starting today. How'd she do?",
        "score": 241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Scott went to apologize for being wrong on the clot shot. I am sad he is fighting to live. I pray God heals him",
                "author": "Seatacjoe"
            },
            {
                "raw_content": "heartwarming, yet depressing",
                "author": "-Evspra"
            },
            {
                "raw_content": "THE DIE IS CAST",
                "author": "catsfive"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Creating policies that lead to a 50-year mortgage term is a good thing, but it is hard to understand if you have not lived with a mortgage for a good stint.",
        "score": 249,
        "text_content": "<p>I suspect many young people (basically, anyone who has never been paying on a mortgage for a good stretch of time) do not understand why a longterm mortgage is not that burdensome. It was harder for people in their early-to-mid 20s to buy a mortgage during the disruption of the Covid scamdemic and the tepid return to quasi-normal.</p> <p>A policy that lowers the monthly mortgage rate through a 50-year term makes it possible for more first-time buyers to finance a house.</p> <p>But the vociferous complaints about the possibility of a 50-year mortgage term by the left (and faux-MAGA &quot;influencers&quot;) are resonating among people in their late 20s because many in this generation they have spent half a decade without being able to finance a mortgage (hard to do that with an uncertain economy during the covid scamdemic and tepid economic recovery thereafter).</p> <p>This generation has seen credit card debts appreciating faster than they can be paid off. So it would be natural - but incorrect - if they were to assume that a 50-year mortgage term means debt slavery.</p> <p>It's all about getting that first house through financing, and staying in it long enough to have far more options than people who have never bought a house. Basically, if a person has gotten to the point of being able to make monthly payments on a longterm mortgage, the burden is less and less as time goes on.</p> <p>Here is how it works:</p> <ol> <li> <p>There is a tax deduction on interest for a primary residence;</p> </li> <li> <p>Inflation / cost of living continue to rise over the years but fixed-rate mortgage payments do not;</p> </li> <li> <p>After a decent period of time with a mortgage - e.g., 20 years - the mortgage payments look ridiculously small compared to the cost of renting a house or an apartment in a safe and well-run apartment complex;</p> </li> <li> <p>It becomes easier and easier to pay off the mortgage as incomes adjust to inflation but the mortgage remains the same or even decreases (if it is a combination of a shorter-term and comparatively longer term loans, when the shorter term mortgage is paid off, there is a sudden drop in what is owed each month);</p> </li> <li> <p>Many people will sell a primary residence before the mortgage is paid off, in order to enter into a new mortgage agreement for a new primary residence. As long as the money is rolled from the sale of the 1st house into the new house, there is no federal income tax for the sale. A lot of people will buy a lower-end first house, wait 15 - 20 years, and roll it over into a new house. The appreciation in value of the first house means the person can have a higher percentage of equity (=value of house in excess of loan debt) in the new house than he had when he originally purchased the first house.</p> </li> </ol> <p>Provided that you do not buy a house in a decaying neighborhood of a state that is suffering from a mass exodus of citizens (think of all the abandoned shacks in Detroit), here is what this all means:</p> <p>Once you can stomach the monthly payment of a 50-year loan, you can spend some years in the house and get to the point where it is easier and easier to pay down the mortgage much faster (e.g., pay off in 25 years, not 50) or roll the proceeds of selling it at a much higher price (e.g., 15 years later) into a new house with a shorter mortgage term (20/30 year mortgage).</p> <p>The big barrier to entry is to save up enough to get to the point of buying the first primary residence. If a 50-year mortgage makes that easier, it means that more younger citizens will escape the trap of paying rent on a house or apartment. And more younger citizens will enjoy the benefits of an appreciating asset with monthly loan payments that become smaller and smaller (compared to the economy/cost of living) as time goes on.</p> <p>Everyone on PDW who has had a mortgage for a good stint understands these things.</p> <p>As I write this post, it occurs to me that the left's goal is not only to bring about historical amnesia (as in Orwell's 1984, when people do not know history it is harder to challenge Big Brother's narrative), but also to make it so that people are unaware of basic strategies for life that everyone used to know.</p> <p>A 5-year disruption to our economy was enough to create a huge number of people in their late 20s who have never had the experience of buying (and staying in) a primary residence through financing. And if enough people are unaware of how it really works with a mortgage, they may fear and oppose the idea of spreading out a loan over a longer term to enable a first-time buyer to stop renting a place he can never own.</p>",
        "comments": [
            {
                "raw_content": "It's another step down the slippery slope of keeping people in debt and dependent on government. How many people in this country do you think could pay off their debits if they were all called in at once?",
                "author": "Exsultate"
            },
            {
                "raw_content": "It's the wrong answer to an overinflated bubble of a housing market. Get the illegals and visa holders out, and housing prices would *crash*. 50 year mortgage, amortized with all that interest up front, is extremely profitable for banks. And would help continue the sustained housing bubble that's also very nice for property tax revenue. NO THANKS.",
                "author": "Consumerbot381732"
            },
            {
                "raw_content": "Elimination of homestead property taxes is the way",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "***** THIS IS WHAT I VOTED FOR !! *****",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# https://x.com/EricLDaugh/status/1989885248172155056",
                "author": "BillPigg"
            },
            {
                "raw_content": "moar!",
                "author": "Bullet3250"
            },
            {
                "raw_content": "Now that the shutdown is over and BBB funding will go through, deportations should scale up dramatically. Personally, I think we need to go right to NY and see if Mamdani is really going to challenge federal law. Let's get this battle started quick before he settles in.",
                "author": "TakingCoatsWIN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI companies to be subsidized by our government to NOT run data centers the same way farmers are subsidized to not grow crops!!",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This has more to do with slowing development down so China can catch up. Then we have this big race where everybody is hyped about \"The AI Race\" and congress can spend their fucking pants off to shower AI devs with tax money, only for us to win. And then China has a sudden breakthrough a month later (because we gave them the missing parts. Like we always do).",
                "author": "NomadicKrow2"
            },
            {
                "raw_content": "Picture a valley built on the myth of infinite scaling, suddenly smacking into a very old, very physical wall called physics. Santa Clara’s grid is an antique orchestra trying to accompany a stadium full of subwoofers, and the dissonance tells you something deeper about the moment we are living in. A hundred megawatts of empty data centers in the literal backyard of Nvidia is not a tech story. It is a civics story. It is the same pattern we keep seeing across the West: political elites promise a frictionless, electrified future while refusing to build the substations, transmission lines, transformers, or generation that make that future possible. They legislate dreams and budget away the infrastructure. California keeps telling the world it will run AI, EVs, and a green grid simultaneously. Instead of increasing dispatchable power capacity, they constrict it. Instead of streamlining permits, they bury everything under years of regulatory molasses. The result is predictable. The lights stay on only because demand is throttled. Even the mighty Silicon Valley hits the ceiling. This is the same failure mode you see in Europe’s energy crunch, Colorado’s transmission bottlenecks, and New York’s impossible timelines for electrification mandates. No civilization gets to “innovation” its way out of the need for actual kilowatts. Data centers do not run on vibes. If anything, this story is a warning flare for the entire AI gold rush. Compute demand is exploding, but Western governments are shrinking the very infrastructure that supports it. The people yelling loudest about “the future” are the same people who refuse to build the pipes that carry the future. A thread like this should explore the real question: can a high-tech society survive when its ruling class treats power generation as optional? The answer is already glowing red on the substation panel.",
                "author": "TallestSkill"
            },
            {
                "raw_content": "Put a windmill on the roof. Boom energy! Our taxes pay for our grid. These mega drains of electricity and energy need to find their own way ON THEIR OWN GRID.",
                "author": "EdBuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel's next-gen Granite Rapids-WS server CPU lineup leaked",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swear toms has the biggest hard on for intel. No performance leaks. Just core count leaks and they’re already saying Intel will somehow have this massive advantage over AMD like AMD is just going to sit still and not launch new product. It’s why I have stayed away from toms for a good while now. They pick and choose favorites not based on merit.",
                "author": "UltraSPARC"
            },
            {
                "raw_content": "Hello narwi! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "VRAM Cost Is About To Make GPUs Way More Expensive",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "everything makes gpus more expensive.",
                "author": "battler624"
            },
            {
                "raw_content": "Someone in this forum predicted during the nand and dram oversupply in 2023 that the manufacturers would try reducing supply and it would backfire due to sustained demand resulting in even worse scarcity than ever before MF nailed everything. I got my ddr5 6000 and ssd back then and am glad I did",
                "author": "anor_wondo"
            },
            {
                "raw_content": "I bought a gaming pc like two years ago, and it's beginning to look like it was my last one.",
                "author": "PeksyTiger"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "4K Mini-LED Gaming Value - KTC M27P6 Review",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Silicon Motion SM8388: 8-Channel PCIe Gen5 Enterprise SSD Controller Delivers 14.4GB/s at Sub-5W Power​​​​​​​​​​​​​​​​",
        "score": 4,
        "text_content": "Silicon Motion has announced the SM8388, an 8-channel PCIe Gen5 enterprise SSD controller optimized for nearline QLC NAND storage, delivering 14.4GB/s sequential read throughput and 3.5M IOPS random read performance while consuming under 5W active power. Built on the company’s MonTitan development platform architecture (shared with the 16-channel SM8366), the controller supports up to 128TB capacities, 3200MT/s per channel, and features a hardware-based Separate Command Address (SCA) accelerator to maximize channel parallelism and PCIe Gen5 performance. The SM8388 is NVMe 2.6 compliant, supports EDSFF (E1.S/E3.S) and U.2/U.3 form factors, and includes enterprise security features such as AES-256 encryption, TCG Opal, secure boot, attestation, and hardware root of trust, positioning it for AI-driven warm data storage applications in cloud and data center environments where read-intensive workloads demand both high throughput and exceptional power efficiency.​​​​​​​​​​​​​​​​",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "New laptop battery life record for the ThinkPad T14 series: this CPU [Intel 258V] makes the best known business laptop more efficient",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "how on earth is this the best battery life laptop they have tested? The laptop has a 57 Whr battery which is pretty small compared to some other 258v and the lower power 226v laptops which come is 70+ Whr laptops. not to mention the more efficent ARM chips like the snapdragon and apple stuff nvm I cant read it says the most efficent t14 which doesn't really mean much",
                "author": "Open_Map_2540"
            },
            {
                "raw_content": "Am I out of touch or the manufacturers I had a Thinkpad from work that supported 2 batteries and you could just hot-swap them, it was X230 from 2012 and it was already advertised as \"**all-day computing and performance with 24 hours battery life**\". In the field working out of grid we could hit 24h of constant work with 3 batteries on us. Hot-swap and recharge drained and off you go. Someone would say \"buT y0u hAvE poWeRbanKs, olD battEries werE buLk\" and I would say, had you ever herd about energy loss and inefficiency due to power conversion? Powerbanks provide 70-85% of efficiency, the only pros of PB is USB, one bank to charge everything. Still I rather see a hot-swap/dual batteries in modern chemistry than recharging laptop from a powerbank.",
                "author": "BunkerFrog"
            },
            {
                "raw_content": "Hello -protonsandneutrons-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Smartphones Are Made in China",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oppo's sta, now I really wonder if laptops could also stack motherboards to conserve space have the CPU (and dGPU) and all its associated components face down, then have the rest of the laptop's sockets facing up",
                "author": "LastChancellor"
            },
            {
                "raw_content": "Oh I love these kind of videos, explaining how things are made. The phone production lines in the video are just amazing!",
                "author": "anders_hansson"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Branch Education] How do CPUs Work? Exploring the 💻🧬 DNA of the Digital World",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Branch Education, what a GOAT.",
                "author": "zxyzyxz"
            },
            {
                "raw_content": "It's one of those videos, where it feels like each CPU subsection could get its own video series of 'branches'. Still summarized the key issues very well for an introduction. Carrying the weight of >50 years IC development plus most ISAs and programming languages, there's only so much half an hour can explain.",
                "author": "JuanElMinero"
            },
            {
                "raw_content": "30mins is way too short to explain even an old CPU. modern ones would take hours upon hours to go through each functional block.",
                "author": "randomkidlol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "First time in Kamurocho vs how it's looking right now",
        "score": 321,
        "text_content": "Kiwami 2 took a massive leap in terms of visuals. It's a beautiful game.🤩 *Kiwami on the Switch on top, Kiwami 2 Switch at the bottom",
        "comments": [
            {
                "raw_content": "I am so excited to see what this system can do in another year!",
                "author": "Jayeugene"
            },
            {
                "raw_content": "it looks great but did they actually just changed the stores, some are closed in switch 1 screenshot while they are open with ads in switch 2 version ?",
                "author": "thehood98"
            },
            {
                "raw_content": "Kiwami 2 is one of my personal favourites that sadly does not get much recognition. Always nice to see someone enjoying it",
                "author": "acewing905"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Pathless is $10!!",
        "score": 43,
        "text_content": "This game is like TOTALLY worth $10, one of my favorite games of all time. Its an open world game with an emphasis on speed. The hook is that there is absolutely no maps and absolutely no waypoints. You really gotta figure out how to traverse the world and it makes for a really unique experience.",
        "comments": [
            {
                "raw_content": "I absolutely loved this game. I mean, I love everything Giant Squid makes. But this is such a hidden gem. I should play it again soon. It’s been a while. The traversal mechanics are so much fun.",
                "author": "SailorPizza1107"
            },
            {
                "raw_content": "Also forgot to mention, it runs at 60fps on Switch 2 since its uncapped.",
                "author": "SyllabubOk5283"
            },
            {
                "raw_content": "£34 in the UK. It does look cool though.",
                "author": "yaboymuggins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New wave of Nintendo Switch backwards compatibility fixes live on Switch 2 - Xenoblade X, Batman: Arkham Knight, Tokyo Xanadu, more",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nier automata soon please i said before that I'd give my left nut for it but now im willing to give both just fix the damn game im not even asking for 60fps just make it playable at least dear god",
                "author": "Gladiolus_00"
            },
            {
                "raw_content": "This article doesn’t explain anything that changed lol",
                "author": "_lemon_hope"
            },
            {
                "raw_content": "I hope they fix Borderlands 3 soon.",
                "author": "TTBurger88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After dying 300+ times at Champions Road, I am finally done with Super Mario 3D World!",
        "score": 158,
        "text_content": "What a fantastic game. The only 5 stamps left are for clearing all leves with all characters, which I will leave for when I have friends to play with. Next stop, Bowser’s Fury 🚂",
        "comments": [
            {
                "raw_content": "Is this after beating the game? I'm about to go into the World 5 castle",
                "author": "cloudlocke_OG"
            },
            {
                "raw_content": "If you have extra controllers, just activate them and you can get at least 3 of them on the flagpole if you’re quick. Obviously not a very fun way to do it but it’s an option.",
                "author": "munchyslacks"
            },
            {
                "raw_content": "I want a full, big, actual sequel to 3D World.",
                "author": "FontFanatic"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "We Have The Legend of Zelda Movie at Home",
        "score": 29,
        "text_content": "Watching Legend again on Prime Video. The similarities between this and The Legend of Zelda are plentiful. Jack (Tom Cruise) is a child of the woods who is helped by a fairy to rescue a young woman of royalty. He acquires armor and a sword. There’s a puzzle with light from a mirror—more of a latter Zelda game similarity. But nonetheless he has to fight a large demon king. TLoZ is more inspired by than ripping off, at least not nearly as blatant as what Harry Potter did to Young Sherlock Holmes. If you hadn’t seen that, I suspect the writer was convinced not to pursue charges by getting to direct the movies.",
        "comments": [
            {
                "raw_content": "This movie is amazing!",
                "author": "Jayeugene"
            },
            {
                "raw_content": "Great but flawed film, recommend the US cut as well as it has a soundtrack by Tangerine Dream",
                "author": "temporary_location_"
            },
            {
                "raw_content": "It so is! Glad it is its own thing but love the connection!",
                "author": "Swank10"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4, Disingenuous Ragebait, and Rude Nintendo Fan Behaviors?",
        "score": 86,
        "text_content": "The entire discussion around Metroid Prime 4 and the new character seems completely fabricated. IGN immediately started out with a large hit-piece against the game over this single character. Nintendo fans who have defended and up roared for the continuation and support for niche and somewhat hard-to-get-into games have nothing but disgust for Metroid Prime 4 attempting to do anything. I will not name the obvious Youtuber, but I think it's fair to say that if you're a Metroid fan and a fan of other sci-fi games, you'd also feel like me. Very VERY sad. Every internet space is a hellhole making fun of Mackenzie when his presence is not even large, and in fact - a great addition. I didn't see any of the reactions yet, just watched the overview trailer and the 20 minute gameplay segment from \"Press Start Australia,\" and thought \"wow. What a colorful cast. Reminds me of Aliens.\" The game looks like it has so much charm and life into it. From the world, the music, even the cutscene production looks so fantastic. Better than one's I have seen in other AAA games like God of War or Horizon. Yet, this game introduces a comic character, who only has so many lines until you leave, and that is enough for Youtubers to create entire \"crash-outs\" against this game. What about the few Metroid fans? This is already a niche sci-fi series, unlike other Nintendo IPs, yet other Nintendo fans are also ripping this game to shreds without a single thought of \"maybe this isn't for me.\" I find the entire behavior extremely rude and disingenuous. This character absolutely did not cause this much pain. We have already seen the game. It is colorful, big, open, and less \"scarily isolating\" than past entries. No one could possibly think this is surprising. Even during the treehouse footage, there was such a highlight on the Federation troopers with their unique dialogues and voice lines. If you wanted to indulge in the \"isolated experience,\" you are free to play the prior games. Metroid Dread is brilliant and it's right there, with a likely chance of a sequel coming soon. Games like this used to be extremely celebratory. To have Samus be more stoic than ever, escaping a planet to actually save people, rather than killing an entire planet's life, is extremely noble and reminds me of the best of sci-fi gaming, Halo. These stories mean so much to people and it's extremely rare to have these sci-fi stories come out today. Finally, this reminds of Aliens, and while Ripley may not have saved the team, it might be wonderful to see a character like Samus, heroically save the team and potentially save the planet (a different outcome compared to each game before). I am disappointed in all the hit-pieces, and rage baiting journalists / YouTubers. I can't wait to play this game, and I hope Retro Studios, and all the new developers feel proud about themselves for what may be such a fantastic experience and new perspective for the Metroid franchise. The studio has inspired my life so much and I thank them for all their work. Thanks https://preview.redd.it/jyfo3vg7oi1g1.png?width=1798&format=png&auto=webp&s=ad66cfc893321daa72fa6b00401dc0cf0b1f04bb",
        "comments": [
            {
                "raw_content": "This is the most I've seen Metroid fans talking since......well ever, not even during Dread or Prime Remastered.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I'll reserve judgement until I play the game. But my bet is that this is just the first hour or so. Metroid Prime 3 was also quite talkative in the beginning before it settled into a pace similar to its predecessors.",
                "author": "DSMidna"
            },
            {
                "raw_content": "\"It's fair to say if you're a Metroid fan, you'll feel exactly like I do.\" Um, no. People can have their own opinions. That's exactly what those \"hit pieces\" are - people's opinions. But at least the \"hit pieces\" don't make ridiculous statements like \"if you're a real fan, you'll feel just like us.\"",
                "author": "SloopDonB"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Steam Controller with Switch 2",
        "score": 8,
        "text_content": "I realise this is probably too early to guess, but as many of the people in the community may know, Valve just announced a new controller with input parity with the Steam Deck. As a loving owner of both the Steam Deck and Switch 2, I ame really hoping I will be able to use the new controller with my Switch 2; are we likely to see a company like 8bitdo release an adapter that supports it connecting to Switch 2? (I am mainly wondering how well supported the original Steam controller was, to see if there is a decent chance it will be adopted by third party controller makers.)",
        "comments": [
            {
                "raw_content": "I'd actually be surprised if the existing adapter from 8bitdo won't work with it. Maybe with a firmware update, but if it's BT then it should.",
                "author": "Vayshen"
            },
            {
                "raw_content": "You would get the 4 back buttons IG But the gyro might be weird And the touchpads won't work It wouldn't wake the switch 2",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Id assume it should just work with the 8bitdo adapter. I'm pretty sure all it does is translate wireless xinput inputs to wired switch inputs.",
                "author": "ah_shit_here_we_goo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ubisoft is getting bought by someone",
        "score": 509,
        "text_content": "According to Omar Alamoudi ( same person who teased onimusha's return and xbox pulling out of the MENA ) He said and quote >Imagine, imagine, imagine, within a single generation, all the world's largest third-party companies have been acquired... Attaching the logos of EA, ABK and ubisoft The [source](https://xcancel.com/OAlamoudiTG/status/1990031877957386733#m)",
        "comments": [
            {
                "raw_content": "I’d say China. They’re already in bed with Tencent.",
                "author": "SynthwaveSax"
            },
            {
                "raw_content": "But do the new owners like Rayman?",
                "author": "KiNolin"
            },
            {
                "raw_content": "He says its tencent in the replies btw",
                "author": "Carlosless-World"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez seemingly backtracks a second (third?) time saying it was just a rumor during a discussion and that he doesn't know what Sony is planning regarding pc releases",
        "score": 279,
        "text_content": "https://xcancel.com/JezCorden/status/1989728119914389679?s=20 \"This was very barely a rumor on my part during a speculative discussion on the podcast. I have no idea what Sony is doing\"",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This dude should just stop talking for a while.",
                "author": "mashdpotatogaming"
            },
            {
                "raw_content": "![gif](giphy|AaQYP9zh24UFi)",
                "author": "DBZLogic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mike Straw: “It’s happening soon enough. Just be ready.”",
        "score": 958,
        "text_content": "https://xcancel.com/mikestrawmedia/status/1989713848924876952?s=46 Is it finally time? Half-Life 3? Edit: should have stated. This guy is a senior editor for Insider Gaming and works with Tom Henderson",
        "comments": [
            {
                "raw_content": "Time, Dr. Freeman? Is it really that time again? It seems as if you only just arrived. You've done a great deal in a small time span. You've done so well, in fact, that I've received some interesting offers for your services. Ordinarily I wouldn't contemplate them, but these are extraordinary times. Rather than offer you the illusion of free choice, I will take the liberty of choosing for you if and when your time comes round again. I do apologize for what must seem to you an arbitrary imposition, Dr. Freeman. I trust it will all make sense to you in the course of… well, I'm really not at liberty to say. In the meantime, this is where I get off.",
                "author": "F35_Mogs_China"
            },
            {
                "raw_content": "Clearly teasing Doctor Who: The Eternity Clock Part 2 - it's been a 13 year wait but our patience has worn off guys.",
                "author": "Barden_1996"
            },
            {
                "raw_content": "Knack 3... BY BALVE!!!!!!",
                "author": "FransD98"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 290K, 270K and 250K Plus spec leak: \"Arrow Lake Refresh\" with higher clocks, more cores and faster memory support",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When is Intel expected to compete with 9800X3D?",
                "author": "mountainyoo"
            },
            {
                "raw_content": "Hopefully they beat raptor lake for gaming lol",
                "author": "thatnitai"
            },
            {
                "raw_content": "Wonder if they tweaked the NGU/D2D considering how easily they OC and how much it helps for gaming",
                "author": "Touma_Kazusa"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "From vega 56 to 9060 xt 16GB",
        "score": 154,
        "text_content": "I'm very excited, i bought the vega like 7 years ago and it has been amazing for 1080p ultrawide but it was time to upgrade because it's struggling in new titles, this new guy should do perhaps doubles if not more the performance!!",
        "comments": [
            {
                "raw_content": "More than double the power. 2.2x according to Techpowerup",
                "author": "Tyr_Kukulkan"
            },
            {
                "raw_content": "Yeah booiii! I went Vega64/1700x to RX 9070/5700X3D. Enjoy",
                "author": "SrChuffington"
            },
            {
                "raw_content": "9070 xt is a damn underrated card. plays well even with 4k",
                "author": "csch1992"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Switched to AMD",
        "score": 171,
        "text_content": "I have been intel/Nvidia for the last 15 years and finally decided to switch teams. 9800x3d+9070xt on an msi x870e. Coming from a 14700kf+3080ti it finally doesn't feel like I'm next to a space heater while gaming!",
        "comments": [
            {
                "raw_content": "Awesome rig! Enjoy them frames!",
                "author": "SouthsideRapGod"
            },
            {
                "raw_content": "That's not a computer... it's a desk lamp that runs windows.",
                "author": "Tricky_Fun_4701"
            },
            {
                "raw_content": "Welcome to the Red Team. We have cookies (the nice kind, not the annoying internet ones haha) seriously lush rig OP!",
                "author": "locutuscub86"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Zillow raises red flag on mortgage rates, homes",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know it’s bad when even the website specializing in selling you a home is saying everything but explicitly telling you buying a home right now is a terrible idea",
                "author": "ouluuuuu"
            },
            {
                "raw_content": "Zillow can lick balls",
                "author": "chewonmysac"
            },
            {
                "raw_content": "I'm glad they mentioned rising property taxes. In my neck of the woods they are rising so much, they are comparable to having another car or even mortgage payment per month. I honestly don't think a lot of buyers realize their property taxes are going to increase and sometimes very significantly over what the current owner is paying.",
                "author": "EstateGate"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A recession is ALREADY here for 23 states - laying bare the cracks in the US economy",
        "score": 434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here in red Michigan, definitely feels like recession. Stores are closing everywhere, houses sitting for months, construction projects being cancelled. Unfortunately, prices continue to rise (for now).",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "My friends in Texas say things are bad. I don't believe they are growing.",
                "author": "NotClayDabbler"
            },
            {
                "raw_content": "It’s been this way for 18mo… most anticipated recession, drop, collapse, whatever you want to call it, in years",
                "author": "DocMicStuffeens"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Story Checks Out…",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s another cruise around the world at least",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Don't forget portable mortgagees so housing prices double because people are bringing 2% rates with them.",
                "author": "ShotBuilder6774"
            },
            {
                "raw_content": "Boomers truly are. .the most selfish generation. Nobody else comes close.",
                "author": "Skilletmasterx"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "An Example of how Insanely Biased Grok has Gotten with Elon’s Tweaks",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone who expects Grok to be unbiased after seeing what Musk has done in the last five years fully deserves the crappy products they get.",
                "author": "peakedtooearly"
            },
            {
                "raw_content": "Grok is getting worse by the day. The moment you ask it anything remotely political, it turns into an unhinged Newsmax commentator with extremely partisan and questionable responses. I can't count how many lies I have caught that bot in; it's by far the worst one out of the big 4.",
                "author": "kalisto3010"
            },
            {
                "raw_content": "Calling for an independent entertainment broadcaster to be taken off air for mocking you isn't \"based\", it's authoritarian. We're supposed to have freedom of speech in this country. \"Accountability\" in the market is handled by the market, if it was bad entertainment, they'd simply go out of business. There's no legal violation here, just a blatant desire to curb first amendment rights by misusing the FCC. It's not dissimilar to if the US government were to try getting a popular channel banned from Youtube for making fun of something the president said. \"Demanding balance from outlets that shape public discourse\" is just another way of saying people shouldn't have the right to criticize the actions of government officials or their friends. And this sure as hell won't apply to Fox \"News\" for *some reason*.",
                "author": "The_Architect_032"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A robot tries golf and ... it's a hole in one",
        "score": 1179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is an old video though. Years old.",
                "author": "Anen-o-me"
            },
            {
                "raw_content": "I wonder how accurate it is, like how often does it hit a hole-in-one? Interesting to think that absolute perfection in golf may be attainable if all variables are dialed in. It could possibly be used to be an extremely advantageous aid to golf coaches... It could be like chess where all the past players moves (and variables at the time the ball was hit) are documented and fed into the system, leading to virtual perfection.",
                "author": "duh1"
            },
            {
                "raw_content": "9 years old btw",
                "author": "Moriffic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Does anyone else feel like anti-AI sentiment on social media has reached a point where you'll be met with hostility if you say anything even neutral on the topic?",
        "score": 70,
        "text_content": "Over the last year or two, it feels like that \"anything related to AI is evil\" sentiment really started to take off, especially on social media. It seems to have become some kind of black-and-white, team sport, virtue signalling thing, where if you don't hate AI, you just hate the environment, hate human connection, hate creativity, hate artists, you're a thief, etc etc.. Even replying to a claim of \"AI has literally never been useful\" by saying \"they've helped me with simple programming tasks\" has gotten me harassed by a bunch of people throwing personal insults, more than once. I mention I once used AI to color a pencil sketch I made by hand, and get told I'm not a \"real artist\". ANY story or news article that has something negative to do with AI gets boosted to the top, even if it's obviously false. The top post on a Reddit updates subreddit right now is, IMO, pretty clearly ragebait (it's about a woman dramatically leaving a man at the altar during their wedding because she found out he used AI, and written very weirdly), but because the guy is being dumped for using AI, the community is eating it up. Maybe it's just me, but I'm starting to feel less and less welcome in any space that isn't specifically pro-AI, which sucks. I genuinely like seeing other viewpoints and having discussions with people about differing views. I don't want to be in just an echo chamber, I'm not gonna be right about everything. But in most online communities these days, it does NOT matter how respectful you are... Just saying something like \"some people do actually find AI to be helpful for specific jobs\" gets me mass downvoted with a lot of pretty nasty insults to boot. It doesn't seem to matter how much I try to see their side; if I say anything that isn't explicitly negative, then it's like I'm the enemy. Anyone else also starting to feel this way, or am I just being dramatic?",
        "comments": [
            {
                "raw_content": "They can complain all they want and tell themselves that \"LLMs are a dead-end\" or \"Its a bubble/fad\" since they desperately want to believe Ai will go away. But the truth is, Ai is only getting better and they will be left screaming at the clouds while their job is replaced. Its clear that they feel threatened by it. Its funny because there is nothing that will convince them of this. If all of their complaints with LLMs are fixed, they will still call it \"not real intelligence\". If it replaces their job, the will complain that executives were fooled by the Ai's capabilities. There is no way for them to ever admit they were wrong. This is cognitive dissonance.",
                "author": "JollyJood"
            },
            {
                "raw_content": "The same fundamental sentiment was directed against calculators in the 1970s, personal computers in the early 1980s and the internet in the late 1990s. They were seen as disruptive, needlessly complex, soul-destroying and mind-numbing. They were said to make people dumber and would contribute to the downfall of civilization. Yet here we are. What's disappointing is that much of this rancor is coming from younger people who should be far more forward-looking as well as enthusiastic about scientific and technological developments like their predecessors from prior generations but instead they think more like older people set in their ways when it comes to this subject. My two cents anyway.",
                "author": "human_in_the_mist"
            },
            {
                "raw_content": "Yeah. Your train of thought is identical to what mine has been for awhile. I absolutely recognize the issues that must be addressed with AI, but seeing the extremism that has been popularized with it often scares me, and I feel as if I can only feel truly safe in an echo chamber, try as I might in the opposite direction. The nuance seems to have been lost from a majority of social media and it's like we can't even consider alternate viewpoints anymore. And I've seen issues from both ends of the spectrum on this issue, without a doubt, but the \"antis\" have taken it to an almost... bigoted level. Yeah sure, sound the alarm when it's necessary but you have to be able to think for a few more seconds about everything before shouting reprehensible shit onto the internet. TL:DR - Idk if a middle ground even exists anymore and I am quite unsettled by that.",
                "author": "XxGoldenGaussxX"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure AI CEO doubles down on claiming UBTECH Robotics' videos are CGI",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why not post another video... Walking amongst them for example, instead of a text response",
                "author": "Diegocesaretti"
            },
            {
                "raw_content": "Adcock : Eternal Butthurt against Chinese Robotics Amodei : Eternal Butthurt against Chinese LLM's",
                "author": "Working_Sundae"
            },
            {
                "raw_content": "Fletcher is using chatgpt to write his comment, \"That's not X that's Y\" with that huge EM dash in the middle. What even is reality anymore",
                "author": "psychorobotics"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta is about to start grading workers on their AI skills",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This company is doomed to fail. They have all the money, they can buy most of the bests in each field, but they stick to there failing management strategy and tactics. I suspect the issue starts with Zuckerberg. He's terribly bad at managing people and taking critical decisions. Facebook was a fluke.",
                "author": "berzerkerCrush"
            },
            {
                "raw_content": "Tech bros on hopium for transformers llms",
                "author": "LateToTheParty013"
            },
            {
                "raw_content": "\\>Earlier this year, Meta overhauled its hiring process by allowing job applicants to use AI in coding interviews. This actually isn't a bad idea. The less a technical interview is about regurgitating some information you can find on Stack Exchange, the better employees you can find. The same goes for Leetcode interviews",
                "author": "averagebear_003"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4.20 stealth model released on OpenRouter? 1.8M context window! \"Sherlock Think Alpha\" and \"Sherlock Dash Alpha\".",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pelican on a bicycle looks like sh\\*t on Thinking Alpha [https://imgur.com/a/xPsDck8](https://imgur.com/a/xPsDck8) I dont think its a new Grok model",
                "author": "IcelandicMammoth"
            },
            {
                "raw_content": "Didn't pass my coding vibe check. I don't think this is their flagship model.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "their small grok code fast 2 ?",
                "author": "Critical_Lemon3563"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Turning sand into minds and sending them into space",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Houses are made of trees, and we have plenty of places to put houses. Therefore, everyone should own multiple houses.",
                "author": "endless_sea_of_stars"
            },
            {
                "raw_content": "What even is the point of posting this",
                "author": "Purusha120"
            },
            {
                "raw_content": "Sundar is referring to datacenters in space. And only SpaceX can launch them economically and at scale.",
                "author": "BagholderForLyfe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "More Nano Banana 2 images (We are cooked, for real this time)",
        "score": 885,
        "text_content": "",
        "comments": [
            {
                "raw_content": "woohoo... just in time for the Epstein files disclosure, so Trump can claim the photo of him blowing Bill Clinton is an AI fake...",
                "author": "Superduperbals"
            },
            {
                "raw_content": "That second image... I'm not going to lie the game looks tough. It's never easy when you have to fight two bosses at the same time.",
                "author": "Equivalent_Buy_6629"
            },
            {
                "raw_content": "https://preview.redd.it/74drdqb1hg1g1.png?width=1376&format=png&auto=webp&s=18c2f6f496392e05efdb1e3255d1cba0db7193bc",
                "author": "OmegaGogeta"
            }
        ],
        "subreddit": "singularity"
    }
]