[
    {
        "post_name": "Portland Antifa brag about walking into Portland services office, falsely claim to be homeless, and obtain a $200-plus EBT card. One of the many ways the taxpayers are funding leftist riots.",
        "score": 465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw people doing that 30 years ago. Just more people in on the scam.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Require them to present evidence of homelessness. My proposal is for each potential recipient to be provided with a syringe of heroin and fentanyl, which they must inject as proof. Impostors (subhuman communists) will either refuse and face denial, or roll the dice and presumptively perish.",
                "author": "HurtzLocker"
            },
            {
                "raw_content": "We are such an incredibly retarded country",
                "author": "Peatrie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Failing schools in America...She Couldn't Read Her Own Diploma: Why Public Schools Pass Students but Fail Society",
        "score": 333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A nineteen-year-old college student is suing her former high school for negligence because she graduated despite being unable to read or write.",
                "author": "elvisbird"
            },
            {
                "raw_content": "She went to day care for 12 years.",
                "author": "hey_spike"
            },
            {
                "raw_content": "She should have gone to school in her home country.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❤ MELANIA MONDAY 💖",
        "score": 250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well done! First lady Melania is the most beautiful and classy First Lady to ever darken the White House door!",
                "author": "Stars-n-Stripes"
            },
            {
                "raw_content": "It's only been Monday for 30 minutes and you're ALREADY POSTING MELANIA MONDAY?!?!?! I like the cut of your jib... 🫡 Good work. Carry on soldier.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Melania is classier, more elegant, more intelligent, more sophisticated, and more humble and more altogether awesome than Eleanor Roosevelt ever has been. And she is definitely for sure a woman, unlike Big Mike!",
                "author": "Trump_USA_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mexico figuring out how to pay the tariffs: \"Mexico proposes 50% tariff on Chinese imports\"",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wonder if that includes imports of the Chinese fentanyl, that kills so many Americans.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "China is asshoe Fuck Chy-nuh",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "That's tariffic!",
                "author": "A_Colostomy_Bag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Mass protests are happening in Japan, including in Osaka, with locals demanding an end to immigration and the resignation of Prime Minister Shigeru Ishiba.",
        "score": 821,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Globohomo has their sights on Japan as well as the West. They have been pushing the same leftist shit there.",
                "author": "TD_Covfefe_Crusader"
            },
            {
                "raw_content": "Nippon-it-in-the-Bud...",
                "author": "Moebius"
            },
            {
                "raw_content": "Not only do all these immigrants, legal or otherwise (mainly from China), not assimilate into Japanese culture, but this influx of people drives up inflation, especially in real estate. Japan is so used to almost zero inflation for the past 30 years that they're having a hard time adjusting.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "21st century British justice 🇬🇧⚖️",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm starting to get the feeling their purposefully pushing mass civil conflict to halt elections. Does UK have a version of marshall law?",
                "author": "RandoBudster"
            },
            {
                "raw_content": "Which way British man? Is it not time? If not now, then when?",
                "author": "nzsvz9"
            },
            {
                "raw_content": "This traces back to Tony Blair who overhauled the judicial system to allow this.",
                "author": "Lincoln6ech0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "By nature the second disallows the first and will destroy it",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muslims are not compatible with any civilized society",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Sure you can. Ban Shariah Law. It's unconstitutional. And what is Islam without Shariah?",
                "author": "_Liberty_Prime_"
            },
            {
                "raw_content": "They all need to go home.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GOOD NIGHT!!!",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GOOD NIGHT!!!",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "SLEEP TIGHT!",
                "author": "swarleybing"
            },
            {
                "raw_content": "Well it is either just a Good Night to all or a God Night to his enemies because it is the last one they will have !!! But I will just go for a Good Night to all, but 7:45pm seams early for him.",
                "author": "TheGreenDragon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk : A government that puts foreigners above their own people is, by definition, TREASONOUS and ILLEGITIMATE! The people of Britain deserve a government that represents their interests, not those of shadowy foreign organizations!",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Elon Musk put 100's of thousands of foreigners ahead of Americans.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "\"Take a big step back and F*** YOURSELF in the face. I will go to war on this issue the likes of which you cannot possibly comprehend.\"",
                "author": "Ronaldus"
            },
            {
                "raw_content": "*Terms and conditions apply. H1B's are excluded.",
                "author": "Internet_hugs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More than 15 Trillion Dollars will be invested in the USA, a RECORD. Much of this investment is because of Tariffs. If a Radical Left Court is allowed to terminate these Tariffs, almost all of this investment, and much more, will be immediately cancelled!",
        "score": 609,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eliminating income/property taxes just so any other president would slap them on in 2 days would be the ultimate red pill. Imagine being taxed 15%+ of your income overnight after having that to yourself.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "At this point, any commie that gets in MAGA's way should be killed.",
                "author": "Somebody157"
            },
            {
                "raw_content": "At this point, any commie that gets in MAGA's way should be killed.",
                "author": "Somebody157"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC is done. Chicago stage is being prepared for the National Guard to dance!",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the gov and the mayor should be the first ones arrested.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Chicago was safer when the mafia was in control of it.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I have never seen that shithole crime free or illegal free. This should be interesting to watch.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An actual professor and \"queer science communicator\" at College of the Holy Cross ( @holy_cross )",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gross 🤢",
                "author": "SomecatsareMAGA"
            },
            {
                "raw_content": "Must not have been that holy if it had a queer anything program.",
                "author": "BrianOfNazareth"
            },
            {
                "raw_content": "that professor sucks dicks",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Law enforcement are investigating after a Burning Man attendee was found in a pool of blood, prompting a launch murder probe",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what? how? they're such quality people. could not have happend.",
                "author": "Elephant_Trump"
            },
            {
                "raw_content": "gonna have to start calling it bleeding man instead",
                "author": "Deplorable556"
            },
            {
                "raw_content": "My cuckoo bird sister always goes to that pagan festival. It's not suprising to me that someone was killed. It caters to the worst of our society. My militaristic lesbian sister included.",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Temu Darwin Awards",
        "score": 453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soooooo is he actually a Houston area man, or an illegal?",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Some good can come of this… what brand helmet failed and what caliber was used",
                "author": "BoomShtick"
            },
            {
                "raw_content": "He wasn't arrested for the shooting. He was actually arrested for that ridiculous haircut.",
                "author": "Testamernt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ROGER STONE: Why was Mark Warner trying to meet with the author of the completely discredited Steele Dossier and insisted on leaving \"no paper trail. Rich asshole bought himself the governorship and Senate seat but will still end up in prison.",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"But will still end up in prison\" When?",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "I don't know much about loomer but it's hilarious how much she's getting under all these peoples skin, they're clearly threatened, I think I like her. They had a whole news segment on her the other day on pbs like she was some ominous sinister MAGA power puppeteer or something it was hilarious.",
                "author": "Sodak"
            },
            {
                "raw_content": "Warner is on the Senate \"Intelligence\" Committee where he used to get vomit out leaks on the BS Russiagate and all that. I guess it's not so much fun there for him nowadays, so he complains about Loomer?!",
                "author": "SoldanoSlo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CBS has been CAUGHT deceptively editing out DHS Secretary Kristi Noem's interview where she refers to Kilmar Abrego Garcia as an illegal alien \"MS-13 gang member, who was a wife beater [and] solicited nude photos from minors.\"",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe time for *another* lawsuit.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "Does anyone even watch TV anymore? I would have no clue what they're reporting if it wasn't posted here",
                "author": "Sea_Still"
            },
            {
                "raw_content": "This is one reason I cut the cable cord. Life is so much better and I save over $200 a month. Drain the cow.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Businesses are closed out in LA. store after store. \"The scariest thing about living in LA. right now, doesn't matter nice area or poor area...a lot of businesses are just out.\" Store after store is just vacant. \"So scary to see so many businesses go out. Feel like the city is dying.\"",
        "score": 992,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">recession The real reason is legalized shoplifting and skyrocketing crime. Retail has very thin profit margins, a couple percent even under good circumstances. If shoplifters can clean out the store faster than you can restock it, you just can't stay in business.",
                "author": "fskfsk"
            },
            {
                "raw_content": "oh shit....well i guess only COMMUNISM can fix it!!!!!",
                "author": "Gunmolester"
            },
            {
                "raw_content": "It's not just dying. It's being killed on purpose.",
                "author": "Prandogolio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Karens",
        "score": 1464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "College should probably be abolished at this point. College moves men 40 points to the left and women 52 points to the left.",
                "author": "duckduck"
            },
            {
                "raw_content": "Simple. Repeal the 19th.",
                "author": "IlhanOmarsFagBrother"
            },
            {
                "raw_content": "He couldn't have possibly grabbed that many by the pussy",
                "author": "AngryPoop"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dumbazz & globalists retarded mouthpiece ... 🥴🤦‍♂️",
        "score": 451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How dare you! she should be in skül!",
                "author": "leakmouth"
            },
            {
                "raw_content": "Sadly she was brainwashed at such a young age, she doesn’t even realize she has no idea what she is saying. She was praised for repeating a string of words in a particular order and trained like a monkey. Her brain never had a chance to develop.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "&#65038; But ... but ... but the polar bear are all drowning? &#65038; Oh, never mind, that was grifter Al Gore. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Front page on Reddit. These people are beyond insane.",
        "score": 673,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paid shills, bots, and brainwashed idiots. Take your pick which one.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Hasn’t Trump been seen like a half dozen times by now? He spent yesterday going over security footage just to shit on some subcontractors for fucking up some stone walk way.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Psst .. that's actually her piss .. 🤢😂",
                "author": "BOBON0101"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MediaTek Kompanio Ultra 910 laptop review",
        "score": 48,
        "text_content": "## Performance The Lenovo Chromebook Plus Gen 10 marks a significant shift in the ChromeOS landscape, primarily due to its processor. It is the first device to feature the new MediaTek Kompanio Ultra 910, a high-end System-on-a-Chip (SoC) designed specifically for Chromebooks. This is noteworthy because it introduces an ARM-based processor to the \"Chromebook Plus\" lineup, a category of high-performance devices that has until now been exclusively powered by chips from Intel and AMD. With this release, the Lenovo device establishes itself as a new performance reference. ### SoC and System Performance The performance of the MediaTek chip is impressive. In various benchmarks, the Kompanio Ultra 910 clearly pulls ahead of its competitors, delivering a level of performance unmatched by any recently reviewed Chromebook. This translates to a very smooth user experience, whether handling everyday tasks like browsing with numerous open tabs or running productivity applications. The Kompanio Ultra 910 also manages more demanding 3D calculations without difficulty. This is handled by the integrated Immortalis-G925 MC11 graphics unit, which is competitive with Intel's Iris Xe graphics chips. Taking a look at the benchmark results shows that the new Chrome 14M9610 from Lenovo is truly one of the best Chromebook Plus alternatives. ## Emissionen & Energie ### Noise Emissions The MediaTek Kompanio Ultra 910 does not require active cooling. As a result, the Chromebook is completely silent during operation. ### Temperature The trade-off for the completely silent, fanless cooling becomes apparent in the surface temperatures under heavy load. During our stress test, we measured localized peaks of up to 41°C (106°F) on the top surface around the keyboard, and as high as 45°C (113°F) on the bottom of the device. ## Battery Life Lenovo officially claims a runtime of up to 17 hours for the Chromebook Plus 14 (14M9610). In our own Wi-Fi web surfing test, conducted at an adjusted display brightness, the device lasted for an impressive 15+ hours. This result is even more remarkable considering our review unit had been used previously, suggesting its battery may have already experienced some wear. This results put the Lenovo Chromebook ahead of all the other \"Chromebook Plus\" models we've tested so far, demonstrating its remarkable endurance for extended periods of time without an external power source. However, during everyday activities like browsing the web, watching videos, or using office apps, the temperatures remain comfortably low and are not a cause for concern.",
        "comments": [
            {
                "raw_content": "At this price shouldn't it be more compared to snapdragon plus / i5 tier processors?",
                "author": "uragainstme"
            },
            {
                "raw_content": "Is there a teardown vid",
                "author": "Scy_Nation"
            },
            {
                "raw_content": "If only Chromebooks were made with less exotic hardware. These things are going to end up in a landfill somewhere faster than a normal laptop would.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Quantum internet is possible using standard Internet protocol — University engineers send quantum signals over fiber lines without losing entanglement",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What benefit is there to a quantum Internet over the traditional Internet?",
                "author": "Vb_33"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "um, doesn't quantum entanglement require no \"sending\"? This sounds like bullshit.",
                "author": "eldog"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "$20 for HK: Silksong confirmed by Team Cherry",
        "score": 423,
        "text_content": "https://bsky.app/profile/teamcherry.bsky.social/post/3lxqi3epy3s2p",
        "comments": [
            {
                "raw_content": "They know we will buy it twice.",
                "author": "sho0bydo0by"
            },
            {
                "raw_content": "Team Cherry definitely some real ones for pricing Silksong at $20. Consumer friendliness is rare these days.",
                "author": "deathbyvaccine"
            },
            {
                "raw_content": "Team Cherry is goated",
                "author": "Apprehensive_Row_161"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate confirms Nintendo Direct second week of September",
        "score": 870,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MP4 release date will probably be there.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "I’m expecting a Direct on the 12th with a Mario 40th Anniversary Direct announced for the next day on the actual anniversary.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "And this time he even gave a more specific range.",
                "author": "Douglas12dsd"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me trying to press the Home button before learning I could remap the GameChat button",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I believe 100% the GameChat button has a purpose and is probably really cool when it works, with that being said most of my Switch friends haven't made the upgrade yet so I'm stuck with the cute sound of pressing it whenever I'm bored 💔",
                "author": "curbicon"
            },
            {
                "raw_content": "I dont use chats in gaming sessions since 2017 so...",
                "author": "TomatilloFearless154"
            },
            {
                "raw_content": "Does anyone use that button? Feel like it could have just been a hold home setting. But I guess they really wanted to push it.",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I hope developers set 40fps as a standard performance mode in switch2",
        "score": 175,
        "text_content": "As we saw at cyberpunk, and many other current AAA games, It's not easy to achieve 60fps for switch as PS5 and XSX does (though they do struggle in some games to hit 60fps) So, I wish 40fps stands out as a standard performance mode on switch2 by sacrificing some resolution (maybe about 720p upscale?) For me, 40fps is enough in handheld device",
        "comments": [
            {
                "raw_content": "![gif](giphy|GcDtLf4RAdiRG)",
                "author": "WeAreNephilim"
            },
            {
                "raw_content": "We shouldn't expect better than XSS performance for current gen games",
                "author": "NoMoreVillains"
            },
            {
                "raw_content": "Not opposed to it but let's be realistic not everyone has a 120hz monitor to dock to, so... It's a nice option to have but seeing as it's niche at this current time idk if many devs will put the efforts needed for that...",
                "author": "ApprehensiveCoat9587"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hollow Knight: Silksong's Priced at $19.99",
        "score": 297,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">While it's not an official confirmation, Dont put it in the headline then.",
                "author": "Juklok"
            },
            {
                "raw_content": "We be robbing Team Cherry in a few days",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "Any reason it's not up for preorder? Would have thought an extremely well anticipated game like this would be.",
                "author": "Pale_Emergency_537"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think Youtubers and Creators are placing unrealistic expectations on the Switch 2's performance.",
        "score": 285,
        "text_content": "So we know the Switch 2 is pretty powerful, right? Despite what the detractors say, it's been proven that the Switch 2's raw raster graphical performance is most comparable to a PS4 Pro, with newer tech to bridge the gap and support games the PS4 Pro can't ever run. The problem is, I've seen some creators unrealistically expecting the Switch 2 to perform around the same as a Series S. I was watching the SW Outlaws preview from GVG, and while it's unsurprising that the game struggles, they seemed to be very disappointed that the Switch 2 version has some very obvious cutbacks, saying that other games like Street Fighter 6 performs similarly to the Series S version. But it's been established that the Series S version is unusually poor, so that game shouldnt be used as the sole reference. Another example: I watched a recent review of High On Life for Switch 2, where the reviewer seemed quite disappointed that it couldn't reach 60FPS like the current Gen consoles do, meanwhile even the Xbox One X only runs it at 30FPS. If we look at other games like Cyberpunk and Hogwarts Legacy, the Series S is a clear step above in performance. It can run those games at 60FPS while the Switch 2 can't. So, while it's true that some games might play to the Switch 2's advantage and DLSS can close the gap a little to the current Gen consoles, most of the time current Gen Switch 2 ports will come with obvious downgrades. The good news is, the obvious downgrades shouldn't result in an unrecognizable vaseline-smeared mess like some Switch 1 miracle ports were. TL, DR: People shouldn't expect the Switch 2 to have Series S - level performance. While it might be competitive in some cases, more often than not obvious cutbacks are expected for current gen games.",
        "comments": [
            {
                "raw_content": "The problem with people trying to equate it with other existing consoles is that it does not map 1:1 with any existing platforms, especially not stationary home consoles that draw 100w of power or more and are designed to look decent on large 4k TVs. In some aspects, the NSW2 is very modern and supports modern features like DLSS upscaling and fast storage and data decompression. But it’s still being powered by a mobile SOC (ARM CPU + Ampere GPU) that is operating on 25% of the Series S’ power draw and 10% of the PS5’s. It’s limited by memory bandwidth as well. Steam Deck is also not a very good comparison because that’s using an AMD x86 APU (which has a Zen 2 CPU that is easier to get games running at 40-60fps without special optimizations) and it plays the default Steam version of games which have very little platform-specific optimizations beyond what Valve does with Proton. At most you will get a Steam Deck graphical preset like Cyberpunk has. Switch 2, I think, will be like Switch 1. Where we saw everything from bad 7th gen ports, all the way to impressive 8th gen ports like Nier Automata, which looked almost as good as the PS4 version but ran at 30fps instead of an unlocked 60 fps. The results for each game will come down to how many developer resources got allocated to the project and how much time they were allowed to spend on it. We’re already seeing stuff like Sparking Zero and High on Life that seem to be rushed and not much care was allowed to be put into them, just going off what the resolution and frame rate targets are compared to Switch 1.",
                "author": "jedimindtricksonyou"
            },
            {
                "raw_content": "It wasn't just YouTubers. This sub was convinced it was a handheld Series S before launch.",
                "author": "technobeeble"
            },
            {
                "raw_content": "As their content is clickbait bullshit designed to wind up toxic gamer bros. Ignore the sad bastards.",
                "author": "Mundane-Security-454"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No 120 fps option in Mina the Hollower, even in handheld mode",
        "score": 82,
        "text_content": "As the title says - I do not see a “Max Game FPS” option in the Video settings in Mina the Hollower. This happens in both docked and handheld: I have a 120 hz tv, and even though I’m using the correct HDMI cable, no option. What’s even more confusing though is that this is also missing in handheld mode (see image), and I also just noticed that the resolution is limited to 720p. 120 hz is enabled in the Switch 2 system settings, by the way. Any ideas how I can solve this?",
        "comments": [
            {
                "raw_content": "I think you downloaded the switch 1 version. Check the eshop for the switch 2 version.",
                "author": "waxy15"
            },
            {
                "raw_content": "Are you sure you downloaded the Switch 2 version? The Switch and Switch 2 demos are seperate listings on the eshop, and the 720p limit in handheld is something that would fit the Seitch 1's screen.",
                "author": "JustThatOneGuy13"
            },
            {
                "raw_content": "you downloaded the switch 1 version. same thing happened to me",
                "author": "mafenide"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Posts video of Elden ring gameplay far away from over the shoulder",
        "score": 44,
        "text_content": "Comments: That actually looks pretty good That’s the worst thing I’ve ever seen This played so much better on Steam deck …Well valve optimized the Steam deck version themselves Elden ring doesn’t play well on anything The Switch 2 is already outdated hardware …This is on the devs not the Switch 2 Every time I click on this sub the last few weeks…",
        "comments": [
            {
                "raw_content": "I mean the Switch 2 is good hardware. But my god is Eldenring an unoptimized mess on Switch 2. I played it and its bad, super bad",
                "author": "Round_Musical"
            },
            {
                "raw_content": "People want good and optimized 3rd party titles for once, now that the hardware can actually manage it. One of the best games ever released it would be a shame to be an embarrassment and run poorly on a 2025 hardware.",
                "author": "Vissarionn"
            },
            {
                "raw_content": "I mean it seems like this sub doesn’t want people to say their true opinion on performance. Some people are taking this too personal. I will never understand crying because someone said a game doesn’t run great on a particular console. Who cares ? I’d rather be informed so I can buy the game somewhere else and be satisfied. I don’t want to play my games at barely 20 fps. Nintendo or X developper doesn’t need you to defend them. They will be fine. It might help us get a better product in the end.",
                "author": "louiphe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "9 minutes of the Battlefield 6’s BR map leaked",
        "score": 148,
        "text_content": "- Massive map - Swimming and going underwater confirmed - Ladder gadget seems to have two modes (ramp and ladder) Video: https://streamable.com/ydlo9l Source: Misako_Mikato_01 on bilibili",
        "comments": [
            {
                "raw_content": "They did a really good job on the guns. Love the animations and sheen.",
                "author": "drippinswagu69"
            },
            {
                "raw_content": "He's shooting his grenades, It's back! :D",
                "author": "According_Loss_1768"
            },
            {
                "raw_content": "Can't wait to play 1 single round of this then go back to the real battlefield and never touch it again haha",
                "author": "johncitizen69420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Team Cherry officially confirms Silksong's price to be $20",
        "score": 124,
        "text_content": "Source: [https://xcancel.com/TeamCherryGames/status/1962330350681735642?ref\\_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet](https://xcancel.com/TeamCherryGames/status/1962330350681735642?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet) Prior rumour: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n496oj/billbilkun\\_hollow\\_knight\\_silksong\\_price\\_is\\_1999/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n496oj/billbilkun_hollow_knight_silksong_price_is_1999/)",
        "comments": [
            {
                "raw_content": "What kind of insider knowledge do they have? Not sure if we can trust this one.",
                "author": "caulrye"
            },
            {
                "raw_content": "BREAKING: Team Cherry has detonated car bombs at the offices of all other indie developers",
                "author": "JustBath291"
            },
            {
                "raw_content": "That's a 33% increase from hollow knight ! This is a scandal ! /s",
                "author": "Herb-Alpert"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate semi-backs up SwitchForce's Sep 12 Direct claim, stating that the direct is \"on or around Sept 11 or 12th.\"",
        "score": 437,
        "text_content": "SOURCE: [https://xcancel.com/NateTheHate2/status/1962214416339833244](https://xcancel.com/NateTheHate2/status/1962214416339833244) Basically deconfirms that Friday is impossible, SwitchForce may be right! SwitchForce claim: [Prior r/GamingLeaksAndRumours post](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1n0gw2e/switchforce_states_the_direct_he_has_been_teasing/) **UPDATE - NateTheHate has now stated that he has not heard of any other additional directs slated for September, despite rumours of multiple directs:** [**https://xcancel.com/NateTheHate2/status/1962215523472519306**](https://xcancel.com/NateTheHate2/status/1962215523472519306)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Direct on 9/11 let's go",
                "author": "greatpxm"
            },
            {
                "raw_content": "![gif](giphy|fJBdqYlOoutB6)",
                "author": "Wazflame"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "007 First Light gameplay coming to State of Play",
        "score": 420,
        "text_content": "I’ve seen media and content creators flown into Copenhagen by IO Interactive to get their impressions of gameplay in 007 first light. They plan to reveal the gameplay in Septembers State of Play, then media ban will lift and content creators/media can give their impressions following the showcase. They have content creators staying at the Wake-Up Copenhagen hotel which is a 4 minute walk to the studio.",
        "comments": [
            {
                "raw_content": "I'd say u/minimAlswag is a Tier 1 source",
                "author": "PersonalityNo8280"
            },
            {
                "raw_content": "So did this just confirm that we’ll get a State of Play instead of a Showcase from PS this September?",
                "author": "RockRik"
            },
            {
                "raw_content": "Watch this guy beign 100% correct.",
                "author": "Lz537"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "mrsaintsgodzilla21 (Saints Row Youtuber) talks about how the reboot of Saints Row 2022 was first different compared to what we got.",
        "score": 302,
        "text_content": "Video link, this is the first part of his experience with the game and Volition. [https://www.youtube.com/watch?v=jZfzp0NrM4Y](https://www.youtube.com/watch?v=jZfzp0NrM4Y)",
        "comments": [
            {
                "raw_content": "All I know is that I bought Saints Row and gave it a chance when it came out. I didn't like it. I was fine with them acting the way that they did when they started the gang, but I was hoping - really hoping - they would grow into hardened criminals by the end of it. I lost all faith when the first DLC came out, when a celebrity screws them over and they say they can't just kill him because it would bring about too much heat. But throughout the game, they literally killed everyone. They had a body count in the thousands. But the cutscenes still refused to let them act like hardened criminals. There is a reluctance in media to let your main characters be bad guys. If we're playing a game about criminals, they're all going to be bad guys. There are no Robin Hoods in this world. I don't think anybody came out of GTA V thinking Michael, Trevor and Franklin were good people. Having good moments isn't the same as being good.",
                "author": "Benevolay"
            },
            {
                "raw_content": "I miss volition so much",
                "author": "Icy_Ad620"
            },
            {
                "raw_content": "I’ll copy and paste what I commented on the video: “Thank you. I was an intern at Volition in 2023 (and offered a job there prior to the closure) and the company was so passionate about everything they made (especially projects that were in the works). Everyone there was incredible and wanted Saints Row to be the best it could be, and they were aware of how very unfortunate circumstances out of their control lead them to the game that released. I miss Volition so much.”",
                "author": "pollosbro"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mega Starmie's model has been leaked",
        "score": 181,
        "text_content": "https://www.reddit.com/r/PokeLeaks/s/NgEZkeMs4g",
        "comments": [
            {
                "raw_content": "![gif](giphy|F3j9DCMUXE4Hm)",
                "author": "Ras_AlHim"
            },
            {
                "raw_content": "This is pretty much a 1:1 colored in model of what “leaked” all the way back in April https://x.com/chaogotchi/status/1909077733595885942?s=46&t=iLlEngNxYbGmrPcLv6TvPQ And I know Centro is hit or miss, they “confirmed” it’s real back in April, but said the model (which is in this “leak”) was AI generated https://x.com/centroleaks/status/1909087597705506950?s=46&t=iLlEngNxYbGmrPcLv6TvPQ Not saying it’s real or fake, I think it’s just worth noting this isn’t really “new” info",
                "author": "GloomySelf"
            },
            {
                "raw_content": "how the fuck did this design get approved",
                "author": "eliscyno"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to @LEGOTtNewsl, a suit based on The LEGO Batman Movie may appear in LEGO Batman: Legacy of the Dark Knight",
        "score": 84,
        "text_content": "https://xcancel.com/legottnewsi/status/1962199817934811360?s=46",
        "comments": [
            {
                "raw_content": "That's such a non-news.",
                "author": "Entire-Service603"
            },
            {
                "raw_content": "what's next, GTA VI is gonna have driving? nintendo switch 2 will have games?",
                "author": "slippinjimmyfan68"
            },
            {
                "raw_content": "There will also be Lego bricks in the game. Shocking, right?",
                "author": "ArcanaOfApocrypha"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ryzen 9950x3d + Asus x870e build. 20 years since I’ve had an AMD. Glad to be back.",
        "score": 165,
        "text_content": "Got an Ultrawide OLED 39” curved a few weeks ago (absolutely loving it). Started having issues with some games crashing + running rough. Have a 3080ti FE but so bottlenecked already with my old Intel i7 Coffee Lake and 2016 Asus Stix mobo. Seen that AMD has been doing really well lately so shifted back. Kingdom Come 2, Black Myth, Battlefield 6 beta, Helldivers 2, Cyberpunk, Elden Ring, and Marvel Rivals has been running 30-50fps extra easy and even updated the graphic settings on my games back to High/Ultra still running so smooth 120-160+ fps @ 3440x1440. Finally enjoying the joys of DDR5 too. Super happy with the build and being back to AMD!",
        "comments": [
            {
                "raw_content": "Amazing build. Prepared for LCD fan headache.",
                "author": "IndyONIONMAN"
            },
            {
                "raw_content": "Looks nice man 👊 Is that the HAVN 420 vgpu case? Which OLED did you go with? I’m talking myself in and out of about 3 different ones right now 🤣",
                "author": "immortalis88"
            },
            {
                "raw_content": "This looks incredible, that 3080ti looks great in it. Congrats on the upgrade!",
                "author": "FrequentWrangler1439"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ROG X870/Bitspower build",
        "score": 55,
        "text_content": "First attempt at water cooling with Bitspower components and I’d have to say I’m hooked. AMD 7700X CPU cooled very well by the Bitspower Summit water block and 2 360 mm radiators toward the front. AMD, thanks for giving us such a great processor! Thanks for viewing!",
        "comments": [
            {
                "raw_content": "Case is incredible, whole thing is honestly",
                "author": "FrequentWrangler1439"
            },
            {
                "raw_content": "This is so cool! love it!",
                "author": "Mostdubiously"
            },
            {
                "raw_content": "my gosh, what are we thinking? 40? 50 kilos? haha. It's so beautiful. Very well done. [https://www.million-dollar-pc.com/](https://www.million-dollar-pc.com/) really needs to update more often.",
                "author": "got-trunks"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My new AMD build",
        "score": 58,
        "text_content": "Coming from a 1080ti with a Ryzen 5 1600 and a NZXT 510 Elite case with basically no airflow, I upgraded my old Pc but it is basically all new except X63, SSDs and PSU. Specs: * Lian Li Lancool 216RGB * Ryzen 7 7800X3D * XFX Mercury RX 9070 XT OC * MSI MAG B650 Tomahawk WIFI * NZXT X63 * Team Group T-Force Delta 32GB DDR5 * Lian Li Infinity fans * Corsair RM750W PSU * 1TB SSD and 1 500GB SSD",
        "comments": [
            {
                "raw_content": "Looks good. Play on playa 😎",
                "author": "ApprehensiveTip8343"
            },
            {
                "raw_content": "Love the build. Might go this route myself once I upgrade.",
                "author": "Tonoend"
            },
            {
                "raw_content": "#HUGE FANS",
                "author": "IloveActionFigures"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ZOTAC Zone Pro to feature Ryzen HX 370, 7\" OLED screen, 32GB RAM and Manjaro Linux",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they are launching this late why not go with the Z2 models? 48.5Wh probably won't be amazing with a full 370.",
                "author": "AreYouAWiiizard"
            },
            {
                "raw_content": "Oh FFS... just launch with official SteamOS support. Why must the wheel always be reinvented?",
                "author": "Mageoftheyear"
            },
            {
                "raw_content": "This release the device this time ? Because Zone 1 was never release in many EU country, despite German origins of Zotac...",
                "author": "baby_envol"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Vastarmor RX 9060 XT Alloy ships with blue Radeon logo packaging",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The housing market is no longer a wealth-building engine as home prices continue to slump",
        "score": 615,
        "text_content": "**Real Wealth Decline**: Home prices are falling monthly and no longer outpacing inflation, meaning homeowners are losing purchasing power. **Shift from Pandemic Boom** * **Pandemic Surge**: Home values soared during 2020–2022, creating real wealth * **Current Reality**: Inflation-adjusted housing wealth has declined over the past year * **Muted Demand**: Spring/summer selling season was weak; new home sales and prices are slumping **Outlook & Regional Shifts** * **Sun Belt Cools**: Pandemic hot spots lose steam; demand shifts to industrial centers with better affordability and job growth * **EY-Parthenon Forecast**: Predicts annual home price declines by year-end due to rising inventory and low demand",
        "comments": [
            {
                "raw_content": "Wouldn't that imply the higher interest rates are working as intended?",
                "author": "rycar88"
            },
            {
                "raw_content": "Good. Make housing affordable for young families.",
                "author": "InterviewLeast882"
            },
            {
                "raw_content": "Good let's hope those with all the money invested in start selling their \"assets\" off.",
                "author": "HeadOfMax"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Number of Americans Selling Their Home Hits Major Milestone",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only this was putting substantial downwards pressure on prices...... I keep seeing the smallest \"reductions\" in prices. $15k reduction on a $1M house? Yeah, sure......",
                "author": "geoguy78"
            },
            {
                "raw_content": "\"Inventory is low with no sign of a change.\" \"Without massive job losses, inventory could remain tight.\" \"No one is going to give up their low rates.\" Inventory is always low until it isn't.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "hoomers be like \"this is fine.\"",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I disagree with this subs consensus: UBI IS inevitable",
        "score": 268,
        "text_content": "There’s been a lot of chatter on this sub about UBI and how many believe it’s just unlikely to happen. I personally disagree. While it’s true that the U.S., for example, won’t even give its citizens basic medical coverage, it’s not true that the government won’t step in when the economy tanks. When a recession hits (2008, 2020… sort of), the wealthy push for the government to inject capital back into the system to restart things. I believe there will be a storm before the calm, so to speak. Most likely, we’ll see a devastating downturn—maybe even 1929 levels—as millions of jobs disappear within a few years. Companies’ profits will soar until suddenly their revenue crashes. Any market system requires people who can actually afford to buy goods. When they can’t, the whole machine grinds to a halt. I think this will happen on an astronomical scale in the U.S. (and globally). As jobs dry up and new opportunities shrink, it’s only a matter of time before everything starts breaking down. There will be large-scale bailouts, followed by stimulus packages. That probably won’t work, and conditions will likely worsen. Eventually, UBI will gain mainstream attention, and I believe that’s when it will begin to be implemented. It’ll probably start small but grow as leaders realize how bad things could get if nothing is done. For most companies, it’s not in their interest for people to be broke. More people with spending power means more customers, which means more profit. That, I think, will be the guiding reason UBI moves forward. It’s probably not set up to help us out of goodwill, but at least we’ll get it ¯\\\\\\_(ツ)\\_/¯",
        "comments": [
            {
                "raw_content": "One thing I don't think gets talked about enough is how will UBI address inflation? Won't it simply acceleration currency devaluation to the point of UBI becoming useless?",
                "author": "Due_Lengthiness8014"
            },
            {
                "raw_content": "I hope you're right :)",
                "author": "Dramatic_Charity_979"
            },
            {
                "raw_content": "This is the most \"I only understand America and first world countries\" post I've ever seen lol. 75% of the entire global population is third world. Every single one of those countries cannot afford to implement UBI.",
                "author": "Techwield"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Banana+Heroes 3",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nostalgia bomb!",
                "author": "Icyforgeaxe"
            },
            {
                "raw_content": "The Kratos on the last one 💀",
                "author": "Bostero997"
            },
            {
                "raw_content": "If you like Heroes 3, it plays fantastic on Android with the VCMI app (you'll need the original files, can be bought for a few dollars on GOG)",
                "author": "jovialfaction"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Former OpenAI researcher says a $10,000 monthly UBI will be 'feasible' with AI-enabled growth",
        "score": 750,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm guessing a studio flat rent/month will be $15000 by then.",
                "author": "Blunt_White_Wolf"
            },
            {
                "raw_content": "It's feasible to feed everyone on the planet, but we still have famine. It's never a resource problem. It's a hoarding and distribution problem.",
                "author": "PeeperFrog-Press"
            },
            {
                "raw_content": "Just like trickle down economics? Right? No, the buck stops with the billionaires. Zucc gets a 14th mansion, you do not get free rent. The politicians will never come to save us",
                "author": "Hamm3rFlst"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Interesting benchmark - having a variety of models play Werewolf together. Requires reasoning through the psychology of other players, including how they’ll reason through your psychology, recursively. GPT-5 sits alone at the top",
        "score": 200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm also wondering where is Claude, Grok, and other models. From Raphael Dabadie, the creator of this benchmark: \"We want to scale this benchmark and approach to **more models**, but long, multi-day social games are compute/token heavy, so we’d welcome API support from labs to do that .\"",
                "author": "NutInBobby"
            },
            {
                "raw_content": "Source pls",
                "author": "dads_joke"
            },
            {
                "raw_content": "Where's Claude? I personally find it a very intuitive and emotionally intelligent model. Did they not test it because of the API price?",
                "author": "Ceph4ndrius"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "China Has a Different Vision for AI. It Might Be Smarter - WSJ",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: China has a centralized approach to AI *integration*. Nothing concrete is outright said about *development*, but they are trying to imply that Chinese companies don't aim for AGI (because, despite being bullshit, it lets them present the us vs them theme that readers love far more than facts).",
                "author": "ohHesRightAgain"
            },
            {
                "raw_content": "SUMMARY \"China is pursuing a distinct strategy in artificial intelligence compared to the United States. While U.S. tech companies like OpenAI, Meta, and Google are heavily investing in developing **artificial general intelligence (AGI)** that surpasses human intelligence, China, under Xi Jinping’s direction, is instead focusing on **practical applications**: tools that are affordable, enhance productivity, and address real-world needs in sectors like agriculture, policing, healthcare, and manufacturing. This strategy is state-backed and emphasizes **open-source development**, and is designed to sidestep the limitations imposed by U.S. semiconductor export restrictions. Although some Chinese entities are interested in AGI, Beijing currently appears risk-averse and favors immediate, incremental gains that support stability and efficiency.\"\"",
                "author": "MurkyGovernment651"
            },
            {
                "raw_content": "> But if AGI remains a distant dream, as more people in Silicon Valley now believe What do you mean \"now\"? What \"people\"? Just 5 years ago most expert AGI preditions were in the 2040s or later and now a lot more say early 2030s, so if anything predictions have been adjusted optimistically.",
                "author": "enilea"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Humans are being hired to make AI slop look less sloppy",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People use tools. Tools alone, without workers, don't produce good results. More news at eleven.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Outdated slop article. Look at the images they are using, that’s like one year old stuff. Just the typical ai bad stuff that people on Reddit like to eat up.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "It's called co-creation. Humans are hired to aid in co-creation. Someone should use AI to fix the human slop headline from NBC.",
                "author": "AwakenedAI"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"The Big Idea: why we should embrace AI doctors\"",
        "score": 38,
        "text_content": "Note: I am not advocating anything here. This is just FYI. [https://www.theguardian.com/books/2025/aug/31/the-big-idea-why-we-should-embrace-ai-doctors](https://www.theguardian.com/books/2025/aug/31/the-big-idea-why-we-should-embrace-ai-doctors) \"Given that patient care is medicine’s core purpose, the question is who, or what, is best placed to deliver it? AI may still spark suspicion, but research increasingly shows how it could help fix some of the most persistent problems and overlooked failures – from misdiagnosis and error to unequal access to care.\"",
        "comments": [
            {
                "raw_content": "I think if they RLHFed an AI specifically for this, it would be REALLY good, but current AI has some flaws. 1. If the patient does not give all of the info, AI is sometimes less likely to ask the right questions. With the right training this could easily be flipped around, where AI will take the time to ask questions a doctor won't ask. 2. Patients sometimes simply does not listen to the AI even when the right advice is given. Maybe with the right RLHF, the AI could be more convincing. I think if you fix these 2 things, AI could be a really good first line. It could order non-invasive tests when it seems appropriate, give lifestyle advices, and refer to a real doc when needed.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "once it becomes advanced enough hell yeah",
                "author": "Fluid-Giraffe-4670"
            },
            {
                "raw_content": "Perhaps related: I took a pic of my son's dental X-rays that were on the dentist's PC. I asked ChatGPT what it noticed, it said my son's birthday was wrong. Sure enough they included his full name and birthday in the filename and it had him 7 years younger. I brought it up - said I noticed it while looking at the screen - and they fixed it. ChatGPT didn't know my son's exact birthday but I did say the X-rays were of my 15 year old son.",
                "author": "dekogeko"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Earwax smell test using AI might help diagnose Parkinson’s: Study",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No surprise here. One thing our current AI tech can do very well is pattern recognition. So any diagnostic task can probably be done well with AI. It is just a matter of data and training.",
                "author": "NyriasNeo"
            },
            {
                "raw_content": "Scientists boiled earwax at different boiling points and with AI identified volatile organic compounds that allowed them to distinguish between people with/ without parkinson. The next step is earlier detection using these methods Anyone willing to contribute to r/vocs and r/human_vocs as mod (volatile organic compounds) is invited",
                "author": "Distinct-Question-16"
            }
        ],
        "subreddit": "singularity"
    }
]