[
    {
        "post_name": "Kyle Rittenhouse returns to social media and explains how Charlie Kirk affected him.",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This one shoots back, Commies.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "marriage is a beautiful gift when done in the sanctity of God, as is friendship having a trusting wife to adhere in confidence in the struggle of this evil world that bears your kids that will further bless this rebellion of sin God has blessed us greatly",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "The best revenge is to live well. Now go make a lot of babies.",
                "author": "Nat4Pat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Repeat after me:",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trans women are men. But don't forget that trans men (women) are also school shooters, never forget Audrey Hale, although the media would certainly love it if you never spoke that name for as long as you lived, so speak it often",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "You people need to become more compassionate. Trans people aren't born that way, they drank from poisoned wells. Years ago when I was a teenager there were literally ZERO trans people. Also almost zero gays.",
                "author": "Bazhosh"
            },
            {
                "raw_content": "Death cult still deathing.",
                "author": "TooBright"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Waiting for the mods to wake up",
        "score": 298,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Steal my meme. It's easy to find. It got stickied once.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "wholesome",
                "author": "Toohershat"
            },
            {
                "raw_content": "GN Fren",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newsweek asked RFK Jr. \"why don’t you stop promoting conspiracy theories?\"",
        "score": 471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a damn good answer.",
                "author": "Testamernt"
            },
            {
                "raw_content": "RFK has ended up being one of the best parts of Trump’s administration.",
                "author": "Bruno"
            },
            {
                "raw_content": "That'll be a tasty red pill for many.",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✊🏼 That's my President — Trump refers to '𝙨𝙝𝙞𝙩𝙝𝙤𝙡𝙚' 𝙘𝙤𝙪𝙣𝙩𝙧𝙞𝙚𝙨 at rally, calls Somalia '𝙛𝙞𝙡𝙩𝙝𝙮', per 𝘜𝘚𝘈 𝘛𝘖𝘋𝘈𝘠...",
        "score": 995,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not just filthy, it's Ganges River filthy. They all are. And they will make America better....how?? I always loved swimming. Now i'm apprehensive to go near a river ever again. Even far left kook-house environmentally-crazy Whites are more of a positive than thirdie turdie pedorapist brutes ever will be with the way they leave their uncompostable, filthy trash and toxic biomass everywhere. Though those same enviro-freaks are no better when they look the other way from these retard apes' behavior towards the pristine lands they so idealize, and continue to tighten the noose of those who are neutral or positive.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "All these people need to watch Black Hawk Down that alone makes me want to fucking kick every Somalian in the fucking face. They're fucking country is a shit hole.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Where's the lie?",
                "author": "Definitely_Not_FBI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 President Trump vows RETRIBUTION in the form of primary challenges for any GOP Indiana senator who opposes the 9R-0D 2026 redistricting map tomorrow.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need primary challengers for most of the GOP in the US",
                "author": "lixa"
            },
            {
                "raw_content": "Anybody who knows a buddy out in Indiana, give them a call about this. 📞",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Indiana is cucked af",
                "author": "SCP0073"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor Ron DeSantis just proposed a $117 billion Florida budget for 2026-2027. That’s $100B less than New York State’s budget even though Florida has more residents.",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Florida also has a balanced budget amendment. So in order to exceed the budget, they have to make cuts or generate new revenue.",
                "author": "CharlieMike"
            },
            {
                "raw_content": "Well duh, because Florida is ethnic cleansing!",
                "author": "Greenhills"
            },
            {
                "raw_content": "We get hella revenue from tourists",
                "author": "MAGAPlenty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Indiana Senate is voting TOMORROW on 2026 redistricting. The ONLY acceptable outcome: A 9-0 map. SENATORS FOR MAGA TO WATCH, PER TRUMP: Blake Doriot, Brett Clark, Brian Buchanan, Dan Dernulc, Ed Charbonneau, Greg Goode, Jim Buck, Rick Niemeyer, Ryan Mishler.",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully the rinos there pass it",
                "author": "Albo22"
            },
            {
                "raw_content": "Indiana GOP = 30 Pence",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Not gonna lie. It feels dirty having to support this shit. But if we don't drop our gloves at some point, we're going to get our cheeks clapped into communist eternity.",
                "author": "Patrick_Bateman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤢 𝐉𝐮𝐬𝐭 𝐈𝐧: “𝘐 𝘸𝘢𝘯𝘵 𝘵𝘰 𝘴𝘦𝘦 𝘵𝘳𝘢𝘯𝘴 𝘬𝘪𝘥𝘴. 𝘐 𝘩𝘢𝘷𝘦 𝘢 𝘵𝘳𝘢𝘯𝘴 𝘨𝘰𝘥𝘴𝘰𝘯.”—California Gov. Gavin Newsom.",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There is no such thing as a trans kid. The parent(s) are mentally ill child abusers. Yes I know it's probably a psycho leftist bitch doing this.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "Notice the lower case for \"God\"",
                "author": "Stossels_stach"
            },
            {
                "raw_content": "and half the voters are pigs who eat up this slop.",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BAAAHAHAHA: National Republican Senate Committee robocalled high-propensity Dems and urged them to call Jasmine Crockett to encourage her to run for senate. They also pushed polls suggesting she'd win. Crockett fell for it and launched her bid.",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This surely won't backfire!",
                "author": "spezisacuckold"
            },
            {
                "raw_content": "I believe it. Mike Johnson seemed to be *very* well-prepared today with the best speech I've ever heard him give, in response to a reporter's question about Crockett's Senate run. Video here, and very much worth watching: https://video.twimg.com/amplify_video/1998789138082893824/vid/avc1/1280x720/w9bqDgTPLyJLvao9.mp4",
                "author": "Deplora"
            },
            {
                "raw_content": "These Republicans should have been making robocalls for the GOP in the midterms. What a waste of time. Georgia dem won stronghold GOP yesterday. Dems also won Miami mayor another stronghold GOP seat.",
                "author": "Rosebud4Jesus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rest In Piss",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never had it. Because I'm not a herd animal and I don't care what idiots think.",
                "author": "LLP2"
            },
            {
                "raw_content": "lol you guys had white guilt?",
                "author": "Kricket"
            },
            {
                "raw_content": "Overton Window is shifting by the day in a positive direction.",
                "author": "duehuckleberry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’m the captain now",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey, it's free oil.",
                "author": "MadRussian"
            },
            {
                "raw_content": "Pirate Trump! I love it!",
                "author": "PatriotRunes76"
            },
            {
                "raw_content": "Was it full of drugs or something? Will this make oil prices lower?",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HISTORIC >>> DOJ Scraps Disparate-Impact Rules After 50 Years — Restores Equal Protection and Ends Race-Based Quotas In Federal Programs",
        "score": 1191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No more white guilt.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Five decades of anti-White discrimination codified into law, five decades of being lectured about systemic racism from people directly benefiting from the only systemic racism that existed.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "The damage is already done.",
                "author": "PoohBearBalloon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Watch US forces in action — U.S. forces seized sanctioned oil tanker off the coast of Venezuela",
        "score": 1103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seamen surprise!",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Trump is your Captain now.",
                "author": "King_Boobus_Toobus"
            },
            {
                "raw_content": "Hey, I remember doing this mission in CoD years ago. These guys look like they're almost as good as I was back then.",
                "author": "LiveFreeInXorDie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CRAZY, CRAZY CROCKETT- QUEEN OF THE GHETTO FRONTIER",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's not even really \"ghetto\", it all an act. She grew up in a rich family, in a rich area, went to a super expensive private school her entire life and went to a $40,000 a year, yes, PER YEAR, College. She's as fake as it gets, the whole thing, just a fake fucking cunt.",
                "author": "LokiHelmsdeep"
            },
            {
                "raw_content": "https://grrrgraphics.com/crazy-crazy-crockett/",
                "author": "SmartWomenLoveTrump"
            },
            {
                "raw_content": "Ben Garrison spelled it as \"RAYCISS\". Truly a great timeline!",
                "author": "guywholikesDjtof2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump just announced the United States has SEIZED a tanker ship off the coast of Venezuela",
        "score": 1257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We’re the captains now",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Why did they seize it?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Communists, \"Seize the means of production!\" Trump, \"Okay\" Venezuelan Commies, \"No! Not like this!\"",
                "author": "Lol_Garrus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VIDEO: Donald Trump sparks chants of \"send her back\" as he lays into Ilhan Omar. \"She married her brother!\"",
        "score": 1232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So why isn’t she deported already?",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Wake me up when \"Lock Her Up\" happens",
                "author": "Zskills"
            },
            {
                "raw_content": "\"Send her back\" is the new \"lock her up\" so we know it'll never happen now.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CERNOVICH: Senators aren’t even in session 2 days a week. Hundreds of Trump appointments are unfilled due to this lazy schedule. Ted Cruz spends all day shouting QATARLSON. This, and not podcasters, is why Republicans are going to lose the midterms.",
        "score": 585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmmm, so yeah, tracks, Uniparty are purposefully self-sabotaging to get Trump. Not really anything new, the difference is PDW is now full of Uniparty shills trying to defend them.",
                "author": "julianReyes"
            },
            {
                "raw_content": "Yup. People didn't vote for MIGA, they voted to drain the swamp, and MAGA. The people yelling at Nick, Tucker, Candace etc right now instead of holding the admin accountable are just making things worse. People are disillusioned and angry",
                "author": "CrazyPope"
            },
            {
                "raw_content": "Tel Aviv Ted is a bloviating waste of space",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It turns out the viral Cinnabon video where the white worker Crystal Wilsey was shown as the racist, left out the part where Somalians repeatedly taunted her They got kicked out and returned in different clothes to harass her again and again",
        "score": 513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will always give the White person the benefit of the doubt in any of these situations.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Sounds like she should sue the mall and Cinnabon for failing to protect her.",
                "author": "Lunatic_Fringe_PhD"
            },
            {
                "raw_content": "Sounds like a hostile work environment.",
                "author": "SmartyPants"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "(Know your enemy) Our GOP has had the majority in Congress for 342 days and not 1 secure election law has been passed. It’s pathetic!",
        "score": 657,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is deliberate. They will lose the midterms and blame the democrats for their inaction. The uniparty is alive and well.",
                "author": "Steve56775"
            },
            {
                "raw_content": "To make you feel better (or worse) even if they did pass a 100 laws, they'd just be ignored. I mean, I'm pretty sure we have laws against fraud already.",
                "author": "HanginChad"
            },
            {
                "raw_content": "Have there been any election law changes at the state level?",
                "author": "BillGall2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why are Apple CPUs' single core speeds so much faster than everyone else?",
        "score": 286,
        "text_content": "I am not a hardware engineer so I have no idea, but why do Apple's CPU cores seem so much faster than anything anyone else can produce? They are the fastest by a decent amount in Geekbench 6, they are fastest by a hell of a lot in Cinebench 2024 and they are also totally unmatched in Speedometer 3.1. Even anecdotally, MacBooks seem snappier in use than any high power non-Apple computer. Why is it so? Is their architecture so much superior? Surely macOS can't be that light. The node advantage isn't that huge. The M5 MacBook Pro can cross 200 points in CineBench 2024 in single core. On battery. With the fans off. The M5 Pro and M5 Max might go faster. The 9950X and 285K barely hit 150. The 275HX (285K's laptop version) doesn't get beyond 140. Do we believe Zen 6 will be 33% faster in single core to make up that gap? Even then, will it be power efficient enough to do it in a laptop? If anything, it looks like the Snapdragon X2 Elite might be closest when it ships with an \\~180 score and it might cross 50 in Speedometer 3.1. M5 does 62-63. Why such a difference?",
        "comments": [
            {
                "raw_content": ">The M5 MacBook Pro can cross 200 points in CineBench 2024 in single core. On battery. With the fans off. The M5 Pro and M5 Max might go faster. That hasn't happened on previous gens, single core benchmarks have been nearly identical from base to max CPU.",
                "author": "Sirts"
            },
            {
                "raw_content": "The simple answers: - Apple focuses on consumer, which highly prioritizes 1T performance. AMD & Intel care less because they need to sell datacenter CPUs, too, and they must share the same (or nearly the same) microarchitecture in servers, too. - Apple has been making CPUs for mobile for a decade plus, so they are pushed to focus on IPC more than clocks. They need to reuse the same microarchitecture (or they chose to). - Apple can’t let up because now iPhones, iPads, Apple Watches, and Macs (the majority of all revenue) depend on newer CPUs. - Apple has to release a new microarchitecture each year because they sell hundreds of millions of phones each year with the expectation consumers are getting a faster SoC. - Apple has fierce competition in the mobile space. Qualcomm, Arm, MediaTek, Samsung, Google, etc. all release mobile SoCs. So they are forced to compete, versus AMD & Intel that are a duopoly. - Apple sells relatively high-end devices, so Apple can spend more money on better engineers, better architects, better validation, better modeling, better optimization, better DTCO, better everything frankly. So that means Apple is already geared to focus on 1T performance in structural ways. But it’s not like some “special Apple-exclusive patent”. Anyone and everyone can do it, if they dedicate the time, effort, money, engineering, patience, etc. Just look at NUVIA at Qualcomm now. The die sizes argument is a little tired and predominantly false. https://www.reddit.com/r/hardware/comments/1fuuucj/lunar_lake_die_shot/ CPUs are relatively small parts of the die. Anyone who wants bigger CPUs can do it tomorrow. Shrink the NPU and GPU (huge parts of the die) a bit, voila, you can increase your CPU die allocation by 20% to 50% “overnight”. That is, AMD and Intel did their best and it still was not enough to beat Apple in 1T perf.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": ">The M5 can cross 200 points in CineBench 2024 in single core. The 9950X and 285K barely hit 150. The 275HX \\[..\\] get 140. Will Zen 6 will be 33% faster in single core? X2 Elite might be closest when it ships with an \\~180 score What does IPC look like for any of those? The original M1 had great IPC, and Apple has been adding wider decode and longer branch prediction in successive generations.",
                "author": "PracticlySpeaking"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory Price Surge Squeezes Game Console Margins; 2026 Shipment Forecast Revised Downward, Says TrendForce",
        "score": 51,
        "text_content": "In light of recent events of Nintendo losing $14 billion in market value due to a 41% increase in pricing for the 12GB RAM used on the Nintendo Switch 2",
        "comments": [
            {
                "raw_content": "I love the console people thinking they're safe from this",
                "author": "BudgetPractical8748"
            },
            {
                "raw_content": "I think we are going to see RAM minimum price normalization, basically they gonna cost a huge chunk of money and they wont sell lower capacities. Lets say in a year time they \"fix the supply issue\", you will have stock but they will remove 8GB module, only selling 16Gb or 32GB module. Any consumer buying new PC is either going to force to run 1x16GB or 2x16GB. And they gonna maintain this price as normal price until DDR6. tldr ; you'd gonna spend huge cunk of money just for ram with zero choice for lower capacities. Just like how GPU sell these days. (minimum $250-$300, used to be $150-$200)",
                "author": "hackenclaw"
            },
            {
                "raw_content": "Luckily we can survive with our current phones, video game consoles, and other computing devices. We don't need AI because it is simply taking humanity's knowledge and vomiting it back to us. These companies can go fuck themselves, and if governments don't fix this shit they will find themselves in a very fucking precarious situation.",
                "author": "Crim91"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD FSR Redstone launched: ML-based Upscaling, Frame Gen and Ray Regeneration for Radeon RX 9000 series",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Radeon subreddit is in shambles because it doesn’t support RDNA3, they’ve got pitchforks out and are claiming they’ll go nvidia next gen, lmao",
                "author": "Culbrelai"
            },
            {
                "raw_content": "Well that’s not cured my impotency. Damn.",
                "author": "inverseinternet"
            },
            {
                "raw_content": "I wonder if GN or HWUnboxed will roast AMD for their [misleading \"performance\" charts](https://cdn.videocardz.com/1/2025/12/AMD-FSR-REDSTONE-VC-5_videocardz.jpg) like they did for NVIDIA and MFG. I have no problem with Upscaling performance, but once you start introducing Frame Generation [like AMD has here](https://cdn.videocardz.com/1/2025/12/AMD-FSR-REDSTONE-VC-4.jpeg), you're muddying the waters of what is \"performance\".",
                "author": "KARMAAACS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Micron’s Exit Reportedly Opens Door for Huawei to Target Korea’s Consumer SSD Market",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd expect them to enter DRAM too",
                "author": "Slasher1738"
            },
            {
                "raw_content": "Is it using Chinese chips?",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "More competition is always welcomed.",
                "author": "throwawayerectpenis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asus lists ROG Strix 5K XG27JCG: 27-inch 5K (5120x2880) up to 180Hz",
        "score": 103,
        "text_content": "ROG Strix 5K XG27JCG Gaming Monitor – 27-inch 5120x2880, 180Hz (OC), 0.3ms (min.), Fast IPS, Dual mode (180Hz(OC) or QHD 330Hz), Extreme Low Motion Blur Sync, USB Type-C (15W PD), G-Sync compatible, DisplayWidget Center, tripod socket, HDR, Aura Sync - Ultra-clear 27-inch 5K Display – 5120 × 2880 resolution with 218 PPI pixel density delivers sharp, lifelike details for work and play - Ultra-smooth Gaming Performance – 180Hz (OC) refresh rate combined with 0.3ms GTG response time reduces motion blur and ghosting, delivering fluid, tear-free visuals ideal for competitive gaming - Frame Rate Boost Technology – Switch from 180Hz(OC) to QHD 330Hz for ultra-high frame rates and responsive gaming action - Next-gen Connectivity Options – Includes DisplayPort™ 1.4 (DSC) ×1, HDMI® 2.1 ×2, and USB-C with 15W power delivery for maximum compatibility - Immersive Gaming Visuals – 97% DCI-P3 wide color gamut and VESA DisplayHDR™ 600 bring vibrant, lifelike colors and deep contrast",
        "comments": [
            {
                "raw_content": "This is extremely exciting and exactly what I was waiting for. I work on a MacOS machine and game on a Windows machine on the same monitor and there are currently no monitors available that fully check all my boxes. This monitor could be it.",
                "author": "fntd"
            },
            {
                "raw_content": "No DP 2.1 for such a high res monitor is a pity.",
                "author": "AnitaSandwich69XXX"
            },
            {
                "raw_content": "I’m so excited for this monitor. Finally we get 5K high refresh rate.",
                "author": "Balance-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "FSR Redstone Frame Generation is Broken",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD saw people upset about FSR 4 not working on older GPU's, so they made sure it wouldn't work on newer GPU's either",
                "author": "Trexfromouterspace"
            },
            {
                "raw_content": "Frame generation always had frame pacing issues even on RTX 40 Series(not on FSR Redstone level). This will manifest as a flicker on sensitive panels like OLEDs. NVIDIA fixed this by introducing dedicated hardware on Blackwell GPUs called Flip metering. It shifts the frame pacing from CPU to GPU. AMD should have done something similar.",
                "author": "RedIndianRobin"
            },
            {
                "raw_content": "Another day, another broken AMD feature. Until AMD sorts out constantly pushing out broken and half-baked features, whether it be Frame Generation, Anti-Lag (which got people banned from games because it was a flawed implementation from the beginning) or FSR Upscaling, they're always going to be seen as the cheaper but inferior alternative to NVIDIA. It's all so tiresome.",
                "author": "KARMAAACS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why no one is talking abound in-bound ECC? (ECC on normal ram with penalty)",
        "score": 7,
        "text_content": "Recently noticed some of \"smaller\" intel cpus like n100 have option to sacrifice part of memory and bandwidth to do ECC. While performance penalty can be even 25% in some tests (link below, single channel ram doesn't help here), imho this completely flips market for cheap servers. https://forum.odroid.com/viewtopic.php?t=48377 https://git.kernel.org/pub/scm/linux/kernel/git/torvalds/linux.git/tree/drivers/edac/igen6_edac.c Caveats: Elkhart Lake and newer, also bios needs to have switch for this.",
        "comments": [
            {
                "raw_content": "Because it is an ugly hack, and you can instead get real ECC memory.",
                "author": "3G6A5W338E"
            },
            {
                "raw_content": "Hello! It looks like this might be a question or a request for help that violates [our rules](http://www.reddit.com/r/hardware/about/rules) on /r/hardware. If your post is about a computer build or tech support, please delete this post and resubmit it to /r/buildapc or /r/techsupport. If not please click report on this comment and the moderators will take a look. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix ponders U.S. stock market listing through ADR as AI chip demand soars",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Im sorry Bethesda but this is unplayable",
        "score": 1552,
        "text_content": "The imput lag is insane 😭",
        "comments": [
            {
                "raw_content": "Oh wow...I heard it was bad, but now that I see it...",
                "author": "Zenium7"
            },
            {
                "raw_content": "Imagine shadow dropping a game that isn't even ready yet Todd, you absolute Chad",
                "author": "NathanCollier14"
            },
            {
                "raw_content": "that's genuinely the kind of input lag you'd get trying remote play on any console with bad wifi",
                "author": "EditorEducational201"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wario World – GameCube – Nintendo Classics – December 2025 Game Updates",
        "score": 312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "O shit, one of the few 1st party Gamecube games I never played. Probably not in the top tier of Gamecube games from what I’ve heard, but being a new to me game almost makes it more interesting than something I’ve played before. Also the shadow drop and not being included on the initial list of games coming to the service.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "Hell yes! I love this stupid game.",
                "author": "drama-wanker"
            },
            {
                "raw_content": "Holy hell what a game to just shadow drop out of nowhere",
                "author": "KarateKid917"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "6 months in !!",
        "score": 201,
        "text_content": "My physical and digital collection so far after 6 months! Been a super fun console launch",
        "comments": [
            {
                "raw_content": "I really really wish I could set a group as my default launch screen.",
                "author": "RetroPandaPocket"
            },
            {
                "raw_content": "Nice. I decided to make the jump to digital with Switch 2 because I travel so much, I miss having a physical collection on display already.",
                "author": "LootedToaster"
            },
            {
                "raw_content": "Needs more balatro, slay the spire, and hades.",
                "author": "Code_Combo_Breaker"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wario World out now on NSO GameCube",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Treasure didn’t do a lot of games for Nintendo but the ones they did were bangers, this game, Mischief Makers and the Sin and Punishment titles come to mind",
                "author": "SuperKong47"
            },
            {
                "raw_content": "Whoa! I never did get to play this when I had a GameCube. Well, I know what I’ll be doing tonight. WAH!",
                "author": "bowlofpasta92"
            },
            {
                "raw_content": "This is great, but I am still reading so patiently for fire emblem",
                "author": "Silent_Anxiety4828"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Early Christmas Present to myself :)",
        "score": 249,
        "text_content": "Today's haul + the new Metroid collection :)",
        "comments": [
            {
                "raw_content": "The bike one is amazing. The best amiibo I’ve bought.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "I respect your decision to buy what you enjoy, but damn that's over $100. Amiibo prices went crazy! Hoping the bike goes on sale at some point so I can snag one.",
                "author": "Gethixit"
            },
            {
                "raw_content": "Hades 2 becoming an Amiibo... Tough 😔",
                "author": "peperlito"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Rumble Fish 2 NS2 Edition Announced, Releases Jan 22nd 2026 For $20 ($5 Upgrade)",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a fishing game? Huge letdown.",
                "author": "wewewi"
            },
            {
                "raw_content": "I couldn’t make it through the trailer because of the music.",
                "author": "Raging_Pwnr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "N64 games for December",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To those wondering why Tonic Trouble is kind of a big deal, it basically was the first 3D title Ubisoft ever made essentially being a testbed for Rayman 2's engine",
                "author": "Wolfgabe"
            },
            {
                "raw_content": "Smash bros, i get why they wont drop that. Pokemon Gameboy games, i get why they wont drop that. DK64? that just feels like nintendo messing with folks at this point lol.",
                "author": "Old-Way-5529"
            },
            {
                "raw_content": "THIS IS WHAT I BEEN WAITING ON OMG, RAYMAN 2 😭😭 i never beat it because no memory pak on 64",
                "author": "Unfair_Pear8446"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kotaku: “Sources tell us that it now costs over $1 million to buy a 3-minute trailer at TGA”",
        "score": 1239,
        "text_content": "https://xcancel.com/ethangach/status/1998862969523098013?s=46 If the show is around 2 to 4 hours.. Geoff is getting some BAGS",
        "comments": [
            {
                "raw_content": "For Kojima it's free",
                "author": "Arcanunn"
            },
            {
                "raw_content": "Makes sense considering how big it has gotten. It’s basically the premiere game showcase these days.",
                "author": "Beautiful-Garbage812"
            },
            {
                "raw_content": "It was $5k a second when I got a deck around 2022. But we also got some placements for free depending on if Geoff deemed it relevant enough! Was at an agency that did a mix of big and small games. Good and bad.",
                "author": "NeedleworkerBorn6023"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tomb Raider: Legacy of Atlantis Leaked Screenshots/Cover Art: Potential TR Remake!",
        "score": 261,
        "text_content": "__[Cover Art](https://i.postimg.cc/fyn7xg44/Eroq4Yl.png)__ __Source:__ https://www.resetera.com/threads/rumor-leak-spoilers-potential-box-art-and-some-info-of-tr1-remake-“retelling”-has-leaked.1379143/ __Update:__ The Cover Art pose matches perfectly with this future of Tomb Raider teaser by The Game Awards: https://xcancel.com/thegameawards/status/1998093291594883300",
        "comments": [
            {
                "raw_content": "Someone in the other thread said it looks like a Scholastic book fair book cover and its crazy how accurate of a way to describe it that is lol",
                "author": "FindTheFlame"
            },
            {
                "raw_content": "Tomb raider is on the verge of becoming as complicated as the terminator franchise timeline.....",
                "author": "ZLancer5x5"
            },
            {
                "raw_content": "Awful box art if real Edit: Can’t believe it’s actually real, TGA just confirmed it on twitter, fire whoever the fuck made it",
                "author": "ballviewer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to what Borys Nieśpielak said (he’s Polish and has good contact with local gamedev) : He confirmed in multiple sources that DLC for Witcher 3 is 100% happening.",
        "score": 199,
        "text_content": "https://youtu.be/qVuNjsGTNk4?si=KshjLUCvsdUPkwCE 1:20:24",
        "comments": [
            {
                "raw_content": "![gif](giphy|a6YHwnkn0ctOM|downsized)",
                "author": "FromChicago808"
            },
            {
                "raw_content": "> he's Polish It is well known all Polish are connected together through a shared, genetic hivemind. Boris Bene Gesserit-ed his way through the ranks of game devs until he could find someone working on the DLCs. (I understand the context. It's just a joke).",
                "author": "giulianosse"
            },
            {
                "raw_content": "Switch 2 update? Or like an actual expansion Holy shit just realized it’s been more than 10 years since it’s been released",
                "author": "Embarrassed-Dust718"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jonathan Blow's (Braid, The Witness) new puzzle game will be shown at the TGA",
        "score": 205,
        "text_content": "He pretty much confirmed it in his [latest stream](https://youtu.be/5dqaQHHJLaU?si=z04DpN9z4ryW3hvI). It will probably be his Sokoban-style game that appeared in many of his streams in the past few years.",
        "comments": [
            {
                "raw_content": "is this a threat?",
                "author": "thr1ceuponatime"
            },
            {
                "raw_content": "I know he's a prick, but The Witness is my favorite puzzle game ever. Nothing since has scratched that itch the same way",
                "author": "Cyrisaurus"
            },
            {
                "raw_content": "Hasn't he kind of lost his mind",
                "author": "IncendiaryChicken"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi hints at potential PlayStation announcements at TGA",
        "score": 258,
        "text_content": "In this thread, Shinobi responds to a guy inquiring about potential PlayStation announcements tomorrow aside from the ones we know. Sorry couldn’t copy paste what he said as formatting was weird. This is the link. https://www.resetera.com/threads/playstation-studios-ot48-has-ot48-been-hijacked-by-ot47-ot46-and-ot45-to-the-detriment-of-48-ots-of-history.1329010/page-194",
        "comments": [
            {
                "raw_content": "Surely something about Cory’s game? Or is that a myth lol",
                "author": "FromChicago808"
            },
            {
                "raw_content": "Shinobi PS2 remake",
                "author": "poofynamanama123"
            },
            {
                "raw_content": "So from what I see about the rumours of Sony Santa Monica’s next game is that it isn’t God of War, it’s an existing IP (that isn’t sci-fi), but that “it might feel like a new IP” Any guesses?",
                "author": "LukePS7013"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The creator of the fanmade Shenmue 4 trailer has issued an apology to YS Net and the Shenmue community",
        "score": 108,
        "text_content": "Apology video file uploaded to the Shenmue Dojo Youtube channel: https://www.youtube.com/watch?v=5dplFKbO1eA The original post on the Shenmue Dojo forum: https://www.shenmuedojo.com/forum/index.php?threads/a-statement-regarding-my-shenmue-4-trailer.5878/ Previous threads: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pe9jay/shenmue_iv_teaser_potentially_leaked/ https://www.reddit.com/r/GamingLeaksAndRumours/comments/1phb1pa/shenmue_4_trailer_is_confirmed_to_be_fake/",
        "comments": [
            {
                "raw_content": "So what are the odds we still have people claiming its actually real, there were still some people saying that after YS Net's statement Also definitely not looking forward to this sort of thing becoming more and more common thanks to AI",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "I'm just learning of this now, and no offense to anyone, but did people really think it's real? It's so awkward, so many fast cuts and awkwardly zoomed in framing which is extremely indictive of either AI or just trying to hide poor animation, and really just overall looks like ass.",
                "author": "Redred1717"
            },
            {
                "raw_content": "that was really shitty",
                "author": "Gintoro"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi hints at more than one Tomb Raider announcement at TGA",
        "score": 302,
        "text_content": "In the ResetEra thread about a new Tomb Raider announcement at TGA, Shinobi replied to a post saying there is \"more than one thing\" and implies at least one of those is a mainline game. [https://www.resetera.com/threads/new-tomb-raider-announcement-confirmed-for-the-game-awards.1376347/page-7#post-148669696](https://www.resetera.com/threads/new-tomb-raider-announcement-confirmed-for-the-game-awards.1376347/page-7#post-148669696)",
        "comments": [
            {
                "raw_content": "Remake of Tomb Raider 1 and Tomb Raider 12",
                "author": "Numerous_Ad_9579"
            },
            {
                "raw_content": "calling it now: one \"big\" AAA game, and also a 2D metroidvania that gets announced in the pre-show",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Sounding like a good game awards",
                "author": "thelastsupper316"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi hints at Control 2 showing up at TGA",
        "score": 382,
        "text_content": "In the ResetEra thread about analyzing and predicting announcements at TGA, Shinobi replied to a post saying that Control 2 is \"too early\" to announce, and seemed to imply it's not. https://www.resetera.com/threads/deducing-tga-announcements-from-the-various-leaks-and-reports-open-spoilers.1378060/post-148696141",
        "comments": [
            {
                "raw_content": "![gif](giphy|9hLq3XV0tykOINfyXc|downsized) Me tomorrow",
                "author": "Mindless_Stuff9179"
            },
            {
                "raw_content": "There was a leak a bit ago saying Control 2 was 2027 so I don’t think it would be too early to show up at TGA",
                "author": "SilentNova300"
            },
            {
                "raw_content": "Months ago I saw a comment from a Finnish account saying that Control 2 was actually further along than most people realized and would actually come before the MP remakes, despite entering full production after them. At the time I figured they were full of shit (and they still could be) but this does make me think of that. The ARG Sam’s involved with, POE saying she’s sticking around LA till the Game Awards, and the recent trademark all make me think we’re definitely getting some kind of teaser or info",
                "author": "LewdSkeletor1313"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Foundry Research Tackles Major Obstacle in Delivering Power to Ever-Shrinking Transistors",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nice self serving blog",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.12.1 Release Notes",
        "score": 498,
        "text_content": "[https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-12-1.html](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-12-1.html) # Highlights * **New Features** * Support for AMD FSR™ “Redstone” * **New Product Support** * AMD Radeon™ AI PRO R9600D * AMD Radeon™ AI PRO R9700S * **Fixed Issues** * Radeon Anti-Lag 2 option may not be available while playing Counter-Strike 2 (DX11) with Radeon Anti-Lag 2 enabled on some AMD Graphics Products, such as the Radeon™ RX 9070 XT. * Intermittent system crashes may be observed while using some high-bandwidth HDMI 2.1 displays during display standby. * Intermittent application freeze when using the in-game Radeon™ Overlay. * Intermittent application crash when playing ARC Raiders on the Blue Gate map on Radeon™ RX 9000 series products. # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370. * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. * Some shadows may not render correctly while playing Call of Duty^(®): Black Ops 7 on some AMD Graphics Products. AMD is actively working on a resolution with the developer to be released as soon as possible.",
        "comments": [
            {
                "raw_content": "From r/radeon * Ray Caching: Only available in Warhammer40K today, more games next year. * Ray Reconstruction: Only available in Black Ops 7 today with more games next year. * AI Frame Gen: Available in Black Ops 7 today with 40 games by end of 2025.",
                "author": "NGGKroze"
            },
            {
                "raw_content": "It's almost 2026 and AMD keeps reinstalling the AMD Install Manager that I do not want and have to keep manually uninstalling. Stop this AMD.",
                "author": "MihawkBeatsRoger"
            },
            {
                "raw_content": "What is fsr redstone? and which games use it?",
                "author": "laxusdreyarligh"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen™ Chipset Driver Release Notes 7.11.26.2142",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Installed successfully and quickly on Windows 11 Pro 25H2 (9800X3D + DDR5 6400 1:1), did run a few benchmarks that yielded results within margin of error and I'm now running a couple of stability tests (TestMem 5 mainly), no issues so far. Remember that if you have a 5600/5700/5800/7600/7800/9800X 3D cache CPU then the AMD 3D cache optimizer driver shouldn't be running (but it doesn't hurt anything if it's installed), it will automatically detect that the CPU is a single CCD processor and thus it won't start.",
                "author": "BNSoul"
            },
            {
                "raw_content": "Curious when was the last release I don't remember",
                "author": "clark1785"
            },
            {
                "raw_content": "Someone please kindly explain to AMD engineers, that one year ago, when Microsoft released Windows 11 24H2, they have removed among other things also feature VBSCRIPT and it's also removed from 25H2. You can still add it via optional features, but by default it's not installed anymore. While many people will simply upgrade Windows and VBSCRIPT feature will carry over from 23H2, there are also many people who done or plan to do a clean installation of 25H2 which by default does not have VBSCRIPT installed and as a result will AMD Chipset Drivers fail to install with error of unsupported system. Because under that fancy AMD splash screen is ancient installer build around VBSCRIPT. Dear AMD, it's time to wake up and write a modern installer for your chipset drivers. Thank you.",
                "author": "lh6205"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR Redstone launched: ML-based Upscaling, Frame Gen and Ray Regeneration for Radeon RX 9000 series",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "7000 series owners get nothing",
                "author": "No_Construction2407"
            },
            {
                "raw_content": "I was a long time nvidia fanboy, decided to switch to the 7900 xtx when it just made so much sense considering price point and rasterization value. The future looked so bright with the card, and it still smashes anything I throw at it…but this just outright dismissal of their previous flagship is abhorrent to me in just the most drastic of ways. I thought I was switching to the “good guys” who cared about consumer value with the vram and price performance vs nvidia’s cards at the time, minus dlss…but as reports and constant articles/gamers nexus videos has shown, both major graphics companies just don’t give a flying motherfuck about us. I’ll be going back to nvidia. As much as I hate them atm, at least they give their cards support and updates.",
                "author": "Green_88"
            },
            {
                "raw_content": "AMD's fine wine turned into vinegar.",
                "author": "gypsygib"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "FSR Redstone Frame Generation is Broken",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait, so Frame Generation was borked from the very beginning with this terrible frame pacing? How come everyone was praising it for motion fluidity, if HUB says it's very jittery because of this? Am I missing here something?",
                "author": "-CynicalPole-"
            },
            {
                "raw_content": "the image quality was very good before, the only thing i wanted from this update was for them to fix frame pacing on VRR displays :(",
                "author": "SamuTuretta"
            },
            {
                "raw_content": "Not supporting features on brand new RDNA 3.5 iGPU's is really lame. I'm fully aware that the silicon capabilities are not the same as RDNA 4.... doesn't matter. AMD needs to plan better and not alienate their own customers.",
                "author": "burninator34"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD supported Amuse AI software goes open source, works with all GPU vendors",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice! Let's get that ported to linux.",
                "author": "CatalyticDragon"
            },
            {
                "raw_content": "Article reads like an AI summary",
                "author": "you_killed_my_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen Master 3.0.1 - Release Notes",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Release Highlights * The newer GUI introduced in the last release is now applicable to AMD Ryzen™ 7000 Series processors and beyond * Localization support available for languages German, French, and Simplified Chinese * Added support for DDR Nitro Mode – advanced memory tuning feature for high-frequency DDR5 modules to boost performance # Known Issues * The application may take a bit longer to load on systems with higher core count CPUs * In certain scenarios, when Ryzen Master is launched from AMD Software: Adrenalin Edition™, Ryzen Master Dashboard may not display accurate metric values. As a workaround, restart your system, and then launch Ryzen Master before starting AMD Software: Adrenalin Edition™. \\------------- Download page is here: [https://www.amd.com/en/products/software/ryzen-master.html#download](https://www.amd.com/en/products/software/ryzen-master.html#download) The 3.0.1 release actually references the 3.0.0.4819 version of RM. Also, the download link for the latest generation (9000 Series) only grabs version 3.0.0.4199. The other two are 2.x releases. Why are there three versions of RM now? Glad you asked. So, uh... Good luck, everyone. If anyone's at AMD, maybe check the batteries in the carbon monoxide detectors?",
                "author": "AK-Brian"
            },
            {
                "raw_content": "Have a 9800x3d it’s saying it’s not compatible once opening?? Update for those after me: worked after reboot.",
                "author": "MagicHoops3"
            },
            {
                "raw_content": "I wish Intel had an official tool like this",
                "author": "Lord_Muddbutter"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR 4 Redstone Review",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL:DR Pretty good, and closes the gap with DLSS, except for the lack of 3x and 4x frame gen. biggest complaint is that its only for rx 9000 cards, and they havent released it for 7000 or 6000 cards.",
                "author": "JTibbs"
            },
            {
                "raw_content": "no mention of the frame pacing issues that Hardware Unboxed detailed.",
                "author": "SSmasterONE"
            },
            {
                "raw_content": "Considering BF6 already has frame gen im a bit surprised it doesn’t support this? Or maybe they missed it in their list.",
                "author": "NoiceM8_420"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Introducing AMD FSR \"Redstone\" - ML-Enhanced Performance and Immersion",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD will just abandon the 9000 series when the 10000 series releases",
                "author": "No_Construction2407"
            },
            {
                "raw_content": "Grea, but I'd brefer FSR4 for vulkan. Sorry AMD but it's been 9 months. It's not even a technical issue since FSR4 already works on Linux on vulkan through DX12 translation.",
                "author": "Lawstorant"
            },
            {
                "raw_content": "I really don't like this guy. He's a salesman, not an engineer. In one of these videos he claimed he was a real gamer who loves playing ashes of the singularity... What a liar. If I had to guess who is choosing to limit AMD's old graphics cards, it's this guy. Anything for a sale.",
                "author": "Tallkid"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "[Gamers Nexus] AMD FSR Redstone: Image Quality Frame Gen Comparison, Latency Benchmarks, & Ray Regeneration",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This kicks me right in the 7900XT",
                "author": "sibunAA"
            },
            {
                "raw_content": "AMD marketing being AMD marketing.",
                "author": "max1001"
            },
            {
                "raw_content": "![gif](giphy|rKBXZ6XsYnYLaKth5G)",
                "author": "QueenGorda"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Foreclosures jump over 20% as Americans fall behind on mortgages amid affordability crisis",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In November, 35,651 properties had a foreclosure filing — up a staggering 21 percent from just one year earlier. 'November marks the ninth straight month of year-over-year increases in foreclosure activity, underscoring a trend that has steadily taken shape throughout 2025,' said Rob Barber, CEO at ATTOM.",
                "author": "dailymail"
            },
            {
                "raw_content": "The 3M figure wasn’t defaults nor was it said that it was.",
                "author": "Lootefisk_"
            },
            {
                "raw_content": "Looks dire in Delaware. Leading the pack at 0.052%",
                "author": "Responsible_Knee7632"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed cuts rates by a quarter point, as expected",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zzzz",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Surely this will reinvigorate the housing market. I expect bidding wars to resume tomorrow. /s",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "Correct decision. Powell has handled a difficult situation exactly as he should have. Now I expect they’ll wait for a decent while, with another cut not coming until at least April.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Jerome W. Powell strikes again",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mission was accomplished like a year ago.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Refinance demand for FHA loans jumps 24%",
        "score": 17,
        "text_content": "Many are doing FHA cash-out refinances and getting cash out as the loan-to-value (LTV) ratio of their home has dropped well below 80% thanks to home price appreciation.",
        "comments": [
            {
                "raw_content": "I didn't see that note in the article (cash-out refinances). I would be interested in knowing who is looking for a lower rate vs. those taking cash out.",
                "author": "Xicsess"
            },
            {
                "raw_content": "If the Fed and our government/Wall Street get their way on rates, refinances are about to go to the moon. The mission is to get rates so low, that the economy booms again. Inflation just doesn’t register to these people. Just keep the asset prices elevated.",
                "author": "Nuvuser2025"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Across NYC, the average homeowner tenure among New Yorkers who sold in 2025 stood just below 11 years",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Someone asked Gemini to imagine HackerNews frontpage 10 years in the future from now",
        "score": 1351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Why functional programming is the future (again)”🤣",
                "author": "liofa"
            },
            {
                "raw_content": "\"Google kills Gemini Cloud Services\" 💀💀💀",
                "author": "Alternative_Advance"
            },
            {
                "raw_content": "\\> Why functional programming is the future (again) (haskell.org) Lol. Best one.",
                "author": "jonomacd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Research From Bioarxiv Suggests Humans Could Live to be 430 Years Old",
        "score": 316,
        "text_content": "ABSTRACT: Somatic mutations accumulate with age and can cause cell death, but their quantitative contribution to limiting human lifespan remains unclear. We developed an incremental modeling framework that progressively incorporates factors contributing to aging into a model of population survival dynamics, which we used to estimate lifespan limits if all aging hallmarks were eliminated except somatic mutations. **Our analysis reveals fundamental asymmetry across organs: post-mitotic cells such as neurons and cardiomyocytes act as critical longevity bottlenecks, with somatic mutations reducing median lifespan from a theoretical non-aging baseline of 430 years to 169 years.** In contrast, proliferating tissues like liver maintain functionality for thousands of years through cellular replacement, effectively neutralizing mutation-driven decline. Multi-organ integration predicts median lifespans of 134-170 years —approximately twice current human longevity. This substantial yet incomplete reduction indicates that somatic mutations significantly drive aging but cannot alone account for observed mortality, implying comparable contributions from other hallmarks.",
        "comments": [
            {
                "raw_content": "You can retire at 429",
                "author": "brain_fartus"
            },
            {
                "raw_content": "Just read it. You misread it completely. In argues the opposite: it uses 430 years as a hypothetical \"non-aging\" baseline to demonstrate how somatic mutations would likely \\*\\*prevent\\*\\* us from ever reaching that age.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "My 401k will never last that long",
                "author": "Salt_Recipe_8015"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are on the verge of curing all diseases and solving energy, yet public trust is at an allTime low. Is this the Great Filter?",
        "score": 2251,
        "text_content": "Saw this on Twitter and it really hit me. If society is losing trust in basic science right now, how are we supposed to navigate the transition to AGI? It feels like the biggest bottleneck to the Singularity might not be the tech, but whether people will actually accept it.",
        "comments": [
            {
                "raw_content": "\"We have arranged a society based on science and technology, in which nobody understands anything about science and technology. And this combustible mix of power and ignorance, sooner or later is going to blow up in our faces.\" - Carl Sagan \"If noone understand it, then who is making all the decisions about it?\" - Carl Sagan May be the most prescient thing he talked about. https://youtu.be/dtCwxFTMMDg?si=e0SLy0SyTxPBOxfe",
                "author": "zebleck"
            },
            {
                "raw_content": "The education system didn't keep up. Advances became indistinguishable from magic for many.",
                "author": "KoolKat5000"
            },
            {
                "raw_content": "My trust in oligarchy and autocracy collapsed, not my trust in science.",
                "author": "sebesbal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind releases FACTS Benchmark: Gemini 3 Pro defeats GPT-5 in factuality (68.8% vs 61.8%). Even Gemini 2.5 Pro scores higher than GPT-5.",
        "score": 273,
        "text_content": "Google DeepMind has just dropped a **new** comprehensive benchmark suite called **FACTS,** designed to measure **\"truthfulness\"** across internal knowledge, search and multimodal inputs. **The Leaderboard is controversial:** **#1 Gemini 3 Pro (68.8%)** - The clear winner, dominating in \"Search\" and \"Parametric\" knowledge. **#2 Gemini 2.5 Pro (62.1%)** - Surprisingly beats GPT-5. **#3 GPT-5 (61.8%)** - OpenAI's flagship falls behind Google's previous generation in this specific metric. **#4 Grok 4 (53.6%)** - xAI is catching up but still a tier below. Despite the hype, no model scored above 70%. **\"Multimodal Factuality\"** (understanding images/video truthfully) is still a disaster zone, with every single model scoring below 50%. We are getting smarter models, but we aren't necessarily getting truthful ones yet. **Is OpenAI losing its edge or is this benchmark biased because it was created by Google?** (Note the huge gap in 'Search' scores). **Source: Google DeepMind Blog** 🔗: https://deepmind.google/blog/facts-benchmark-suite-systematically-evaluating-the-factuality-of-large-language-models/?utm_source=ALL&utm_medium=social&utm_campaign=&utm_content=",
        "comments": [
            {
                "raw_content": "So Google made its own benchmark then said Gemini is the best at the benchmark it created? Okay lol...",
                "author": "scrollin_on_reddit"
            },
            {
                "raw_content": "This is not counting tool use... Gpt 5 is deadly (compared to gemini) when it comes to reliability if citing scholarly articles when asked. Gemini just hallucinate sources, even with \"grounding\" turned on.",
                "author": "medialoungeguy"
            },
            {
                "raw_content": "2.5 Flash over 5.1 is hilarious",
                "author": "KvAk_AKPlaysYT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "🧄🧄🧄🧄🧄",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/9ikeramkhg6g1.png?width=1024&format=png&auto=webp&s=2ccc0ee6f54225550720ef99350242298ad1ba34",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Please tell me that GPT Image 2 is called Nano Garlic",
                "author": "usernameplshere"
            },
            {
                "raw_content": "Okay ChatGPT is back to vague posting that gives me the sense that we're so back",
                "author": "Glittering-Neck-2505"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia backed Starcloud successfully trains first AI in space. H100 GPU confirmed running Google Gemma in orbit (Solar-powered compute)",
        "score": 352,
        "text_content": "The sci-fi concept of \"Orbital Server Farms\" just became reality. **Starcloud** has confirmed they have successfully trained a model and executed inference on an **Nvidia H100** aboard their Starcloud-1 satellite. **The Hardware:** A functional data center containing an Nvidia H100 orbiting Earth. **The Model:** They ran Google Gemma (DeepMind’s open model). **The First Words:** The model's first output was decoded as: \"Greetings, Earthlings! ... I'm Gemma, and I'm here to observe...\" **Why move compute to space?** It's not just about latency, it’s about **Energy.** Orbit offers **24/7** solar energy (5x more efficient than Earth) and free cooling by radiating heat into deep space (4 Kelvin). Starcloud claims this could eventually lower training costs by **10x.** **Is off-world compute the only realistic way to scale to AGI without melting Earth's power grid or is the launch cost too high?** **Source: CNBC & Starcloud Official X** 🔗: https://www.cnbc.com/2025/12/10/nvidia-backed-starcloud-trains-first-ai-model-in-space-orbital-data-centers.html",
        "comments": [
            {
                "raw_content": "AI Gods finally tricked humans to take them out! Well done little humans!",
                "author": "jmnemonik"
            },
            {
                "raw_content": "I still don't understand how heat dissipation isn't a showstopper. Can someone explain?",
                "author": "CoolStructure6012"
            },
            {
                "raw_content": "\\> 'trains' only ran inference \\> gemini was only gemma (10x-100x smaller than gemini judging by open counterparts) we cannot get basic facts straight in the reporting on this 😭",
                "author": "ihexx"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro scores 69% trust in blinded testing up from 16% for Gemini 2.5: The case for evaluating AI on real-world trust",
        "score": 60,
        "text_content": ">A new vendor-neutral evaluation from Prolific puts Gemini 3 at the top of the leaderboard. This isn't on a set of academic benchmarks; rather, it's on a set of real-world attributes that actual users and organizations care about. >The latest HUMAINE test evaluated 26,000 users in a blind test of models. In the evaluation, Gemini 3 Pro's trust score surged from 16% to 69%, the highest ever recorded by Prolific. Gemini 3 now ranks number one overall in trust, ethics and safety 69% of the time across demographic subgroups, compared to its predecessor Gemini 2.5 Pro, which held the top spot only 16% of the time. >Overall, Gemini 3 ranked first in three of four evaluation categories: performance and reasoning, interaction and adaptiveness and trust and safety. It lost only on communication style, where DeepSeek V3 topped preferences at 43%. The HUMAINE test also showed that Gemini 3 performed consistently well across 22 different demographic user groups, including variations in age, sex, ethnicity and political orientation. The evaluation also found that users are now five times more likely to choose the model in head-to-head blind comparisons. >\"It's the consistency across a very wide range of different use cases, and a personality and a style that appeals across a wide range of different user types,\" Phelim Bradley, co-founder and CEO of Prolific, told VentureBeat. \"Although in some specific instances, other models are preferred by either small subgroups or on a particular conversation type, it's the breadth of knowledge and the flexibility of the model across a range of different use cases and audience types that allowed it to win this particular benchmark.\" >The HUMAINE data provides a framework: Test for consistency across use cases and user demographics, not just peak performance on specific tasks. Blind the testing to separate model quality from brand perception. Use representative samples that match your actual user population. Plan for continuous evaluation as models change. >For enterprises looking to deploy AI at scale, this means moving beyond \"which model is best\" to \"which model is best for our specific use case, user demographics and required attributes.\"",
        "comments": [
            {
                "raw_content": "Nice",
                "author": "Calaeno-16"
            },
            {
                "raw_content": "Looking at the methodology, it looks very much like LMarena [https://huggingface.co/blog/ProlificAI/humaine-framework](https://huggingface.co/blog/ProlificAI/humaine-framework)",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Check out a fully modular robot arm",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok I need this!",
                "author": "MeatWaste4508"
            }
        ],
        "subreddit": "singularity"
    }
]