[
    {
        "post_name": "Not Photoshopped (probably)",
        "score": 596,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Ayatollah does strike me as a Hennessy kinda guy.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Haters will say its AI :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Nasty hookers. Imagine the smell.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Every day, for the prior 4 years under the Biden Administration, our country was mass invaded and forcibly occupied by illegal aliens.",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every day for the last four years more criminals were also installed by that same administratio within the federal government. The number of them that have been arrested remains zero. Arrests: Russian collusion hoax...........0 Jan 6......................................0 MAR-A-LAGO Raid.................0 Autopen forgeries..................0 2020 Election fraug...............0 Epstein clients.......................0 Covid....................................0 Benghazi..............................0 Doge findings.......................0 Ukraine hoax / frauds ...........0",
                "author": "CLF3"
            },
            {
                "raw_content": "# DEPORT ALL THE MUSLIMS # DEPORT ALL THE WETBACKS",
                "author": "BaIIots0nRubysUSB"
            },
            {
                "raw_content": "No one was arrested for it. Not one person that was in an elected position of power has ever been held accountable. Most of the same Congress & Senate that allowed it are still allowing it.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dear Mr. President, As a reporter who has been on the frontlines of the Minnesota uprising since the moment it started almost 10 days ago, I can confirm Gov. Walz DID NOT head your warning to quell the riots attacking ICE agents today.",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Once again, state and local authorities REFUSED to respond to calls for help, and allowed agents to be assaulted in the streets, traps to be set by rioters to make agents slip and fall outside their building, and allowed roads to be blocked, preventing them from enforcing federal law. https://x.com/nicksortor/status/2012067728559837616?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "There should be serious talk about invoking The Insurrection Act.",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "> Breaking news: communists not arresting communists. More at 8! It would be cool if Trump used the Insurrection Act, but it will also give Democrats exactly what they want. The entire point of these protest riots is to bait Trump into using federal troops, causing more “chaos” and “fascism” that Democrats will run on in the midterms. I doubt that stopping these small riots will be worth the cost but unfortunately a lot of Trump’s base isn’t very smart or thoughtful. They don’t consider the consequences and will just scream at Trump until he acts. Oh well I hope a bunch of commies get arrested and Tim Walz goes to solitary condiment.",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump administration is preparing to use private military contractors to protect oil & energy assets in Venezuela rather than deploying US troops, sources tell us, setting up a potential boon for security firms w/ experience in region & ties to POTUS.",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is basically Iraqi Freedom without the Quagmire.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "So mercs? We should be using more mercenaries instead of US troops. Our troops shouldn't be stationed in shitholes.",
                "author": "Azill"
            },
            {
                "raw_content": "That's a dangerous place. Plenty of armed militias.",
                "author": "Ok_Bro"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: I am pleased to confirm the ATF and DOJ executed an ARREST WARRANT for the man I caught on video stealing an FBI rifle out of a car during the Minneapolis riots last night",
        "score": 1354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim Walz’s people, folks. These are the “people” the lefts wants to keep here",
                "author": "TheRPatriot"
            },
            {
                "raw_content": "Some dumb lesbo died trying protect this piece of shit.",
                "author": "Electrocutioner"
            },
            {
                "raw_content": "Good. Looks like a classy dude.",
                "author": "Ladybug87"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senator Mark Kelly, the leader of the \"Seditious Six,\" was informed that he will appear before a General Court Martial to answer for his actions.",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2026: the year of Accountability",
                "author": "ICE_ICE_BABY"
            },
            {
                "raw_content": "Good. Now do Milley.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Mark Kelly for Firing Squad 2026",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Accountability is coming. Minnesota State Employees have officially become Federal Whistleblowers. They are signing affidavits needed for prosecutions.",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't tell me accountability is coming. Bring accountability, and announce its arrival. Otherwise you're just jerking us off.",
                "author": "RonPaulWasRight"
            },
            {
                "raw_content": "One tactic that I think the Left uses is a form of deception. They make it appear as though their policies are popular by importing a lot of people to \"protest\", for example. Another version of this is to flood social media of all kinds with a disproportionate number of people who are verbally aggressive toward those who disagree with their positions, then banning them from speaking at all. But since those methods don't work here, I think dooming is one technique they use.",
                "author": "BlitheringIdiot2"
            },
            {
                "raw_content": "Riiiight. Two more weeks- maxxing, are we?",
                "author": "itsallascam6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newsom has announced a $348.9 billion budget. That's $147.5 billion larger than when he took office, a 73.2% increase. Spending has grown 2.5 faster than the rate of inflation. This isn't normal, even for blue states.",
        "score": 908,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time for a FUCKING # REBELLION in California!",
                "author": "USNVET6541E5"
            },
            {
                "raw_content": "Cut off all federal money to California.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Gotta steal while the coffers are still open!",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: In a MASSIVE move, the United States under President Trump opens its FIRST graphite mine in nearly 70 YEARS — a crushing blow to China’s critical mineral domination. This is a HUGE technological component for us. The USA is WINNING! 🇺🇸🇺🇸",
        "score": 1431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "used for steel production and batteries, so kind of a big deal",
                "author": "magaspif"
            },
            {
                "raw_content": "Make Pencils Great Again! HB#2 Rules!",
                "author": "skuts"
            },
            {
                "raw_content": "We will have more #2 than India!",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley video mentioned MSP -> ATL -> Dubai and from there the money is wired to Somalia. Dubai is home to a Somali diaspora who specializes in \"remittances\" ... aka, Dubai is the Somalia money laundering center.",
        "score": 855,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dubai is built in the desert by slave labor and many residents also have slaves. I'm sick of people who slob on Dubai. It should be destroyed it is a very evil place.",
                "author": "HeavenlyTrumpets"
            },
            {
                "raw_content": "# FUCK THESE NICQUERS!!!",
                "author": "TexasRepublican"
            },
            {
                "raw_content": "Dubai is the Ukraine of the Middle East. Wheelers and dealers making crooked deals all over the world.",
                "author": "Comanche_Moon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rioters are attempting to BREAK DOWN the fence outside the Minneapolis ICE facility",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is nobody shooting these faggots?",
                "author": "YT45"
            },
            {
                "raw_content": "Sonic weapons, fire hoses, gas, bullets, tasers. Fucking do something!",
                "author": "HearDatHoDat"
            },
            {
                "raw_content": "That's a sad looking fence. This is what happens when all your city/state funds go \"elsewhere\"",
                "author": "VirTW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE convoy arrives as agents operate with precision into Whipple Building, Minneapolis. Both sides seem undeterred tonight as mayhem from last night may have shook them.",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ICE # ICE # BABY",
                "author": "BaIIots0nRubysUSB"
            },
            {
                "raw_content": "Yes yes blow your whistles! Shout shame! Fucking faggots get a life.",
                "author": "TrumpYouMagaFrenner"
            },
            {
                "raw_content": "These people go home proud, thinking they accomplished something. It's not about them, it's about those poor minorities they're saving. That's why they post about it.",
                "author": "62jawbill"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ben Garrison: What's that squeaking noise? The Republican Congress",
        "score": 713,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing happens to the Democrats. Protected class. Can't even get a case going. Prosecutors resign or they're deemed too old and full of dementia to be prosecuted. Its a mystery.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Nothing will happen. Democrats are protected by Republicans",
                "author": "Symonize"
            },
            {
                "raw_content": "To be accurate, most of the Republicans should look like they don't give a crap.",
                "author": "tralbolh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“We don't need to hold back anymore … We're going to come back and shoot you.\" Portland (Jan. 9) — Far-left extremists who rioted to support Tren de Aragua suspects threatened federal agents at the ICE facility.",
        "score": 736,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the fuck did you just fucking say about me, you little bitch? I’ll have you know I graduated top of my class in the Navy Seals, and I’ve been involved in numerous secret raids on Al-Quaeda, and I have over 300 confirmed kills. I am trained in gorilla warfare and I’m the top sniper in the entire US armed forces. You are nothing to me but just another target. I will wipe you the fuck out with precision the likes of which has never been seen before on this Earth, mark my fucking words. You think you can get away with saying that shit to me over the Internet? Think again, fucker. As we speak I am contacting my secret network of spies across the USA and your IP is being traced right now so you better prepare for the storm, maggot. The storm that wipes out the pathetic little thing you call your “life”. You’re fucking dead, kid. I can be anywhere, anytime, and I can kill you in over seven hundred ways, and that’s just with my bare hands. Not only am I extensively trained in unarmed combat, but I have access to the entire arsenal of the United States Marine Corps and I will use it to its full extent to wipe your miserable ass off the face of the continent, you little shit. If only you could have known what unholy retribution your little “clever” comment was about to bring down upon you, maybe you would have held your fucking tongue. But you couldn’t, you didn’t, and now you’re paying the price, you goddamn idiot. I will shit fury all over you and you will drown in it. You’re fucking dead, kiddo.",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "# TIME # FOR # CIVIL # WAR Lock and FUCKING LOAD, pedes!",
                "author": "RhodeIslandRepublic"
            },
            {
                "raw_content": "What a losing piece of human garbage. He KNOWS they will not come out there and beat him so he makes the most outrageous statement he can. But he has no clue what would happen in the oh so glorious civil war he wants. The walls are calling his name.",
                "author": "wbarmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOW! Minneapolis’ pro-Somali Police Chief is even STUNNED at what Mayor Jacob Frey just demanded the left do!",
        "score": 958,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If that Chief had any dignity he should have resigned on the spot.",
                "author": "12points"
            },
            {
                "raw_content": "Police chief knows where that leads too",
                "author": "The_Highlander"
            },
            {
                "raw_content": "If taken at face value that’s not at all what he said. He actually said the opposite. I think that guy sucks dick but I won’t pretend he said the opposite of what I heard",
                "author": "DahnaldTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This simple fact is what they hate and they try to chage",
        "score": 526,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some cultures are just better than others.",
                "author": "RentFree2020"
            },
            {
                "raw_content": "chage",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Really, it’s white people. For some reason nobody else can adopt and produce the culture. This is why the system of destruction is preoccupied with race. They know the main ingredient of the secret sauce.",
                "author": "ViagraFalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump: It is my Great Honor to announce that THE BOARD OF PEACE has been formed. The Members of the Board will be announced shortly, but I can say with certainty that it is the Greatest and Most Prestigious Board ever assembled at any time, any place. Thank you for your attention to this matter!",
        "score": 1092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Greatest, most prestigious board ever assmebled at any time, any place. Trump never holds back, does he?",
                "author": "Bubbahax"
            },
            {
                "raw_content": "I don’t care about peace overseas. I want peace in my country Insurrection act!",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Is this in relation to anything in particular at the moment? spez: It’s for Gaza",
                "author": "spezisacuckold"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Always Thoughtful",
        "score": 450,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hindsight is 20/0",
                "author": "CyanScales"
            },
            {
                "raw_content": "Low T male or a woman \"transitioning\" to male on hormones?",
                "author": "TrumpAndGodWin"
            },
            {
                "raw_content": "Remember when democrats had the police and Natl guard shooting people in the face with paintballs in Minnesota, just for being outside during covid?",
                "author": "Sodak"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Fake News “reporter” just called the ICE agent who defended himself against left-wing attacker Renee Good a murderer… Press Secretary Karoline Leavitt absolutely DEMOLISHED him in less than 60 seconds.",
        "score": 1553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I listened to this live. She wasn't putting up with this for a second.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "Can't believe she was born in 1997. She is very mature.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "He didn't bring up the Somalia \"police officer\" who shot and killed a woman huh?",
                "author": "CT-PATRIOT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Check this faggot out. Amid rising tensions in Minnesota, sitting Democrat Rep. Brad Tabke of Shakopee has been live tweeting the locations of federal law enforcement officers.",
        "score": 1350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "INSURRECTION ACT NOW!!!",
                "author": "AssPhixEAtion627"
            },
            {
                "raw_content": "The face of a cum guzzling, boy touching, faggot",
                "author": "FrankDuncan"
            },
            {
                "raw_content": "Welp, that goes both ways. Put out his address, picture of his home, and names of family members.",
                "author": "RachetQueen2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DDR5 RAM prices now over 4x higher since September 2025",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At what price point does the consumer market collapse entirely? I understand that the chips themselves are completely sold out for months to come, but hyperscalers and Sam Altman's clique are not buying DDR5 sticks, those are still for consumer/prosumer use.",
                "author": "GalvenMin"
            },
            {
                "raw_content": "Popular 64GB 6000/CL30 RAM kit when I bought it in may 2025: 290$ CAD. Now 1430$. 5.1 times increase. Yeah... Best financial investment of my life. /jk",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": "They sure are. I on a whim decided to upgrade from 64 GB DDR5 which is now $919 to 96 GB and that kit is now $1200 I paid $221 and $335 respectively. Insanity",
                "author": "ILoveTheAtomicBomb"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Harward Unboxed - further clarifying statement from Asus (5070ti and 5060ti 16gb)",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> So the current timeline is as follows: > 1. We request RTX 5070 Ti samples from Asus (and other partners) > 2. An Asus PR rep looks into it, comes back and says they cannot provide 5070 Tis due to supply constraints, saying their models are “end of life” > 3. We ask Asus to clarify whether the RTX 5070 Ti is end of life. They confirm it’s end of life. > 4. We reach out to retailers to see whether they can purchase RTX 5070 Ti stock for their stores, to fact check Asus’ claims. They say there is no supply. > 5. Given we have received an on the record statement from Asus and confirmed the supply constraints with retailers, we publish a video with this information > 6. Nvidia says all GeForce SKUs are being shipped > 7. Asus reaches out to clarify that Nvidia told Asus that the RTX 5070 Ti is not end of life, but that Asus are “streamlining some models” > 8. We publish that statement > 9. Asus reaches out again to provide another statement (the third statement we’ve received from Asus), now saying the 5070 Ti is not discontinued or end of life. This directly contradicts the original statement. > 10. We immediately request RTX 5070 Ti samples now that the cards are not discontinued or end of life. We haven’t heard back yet. Definitely sounds like EOL now but NVIDIA didn't want the bad press of them EOL/sale cards so soon.",
                "author": "Jofzar_"
            },
            {
                "raw_content": "Sorry mods, not trying to editorialise title, but no idea how I'm meant to even correctly post a YouTube community post (hopefully this worked) let alone title it.",
                "author": "Jofzar_"
            },
            {
                "raw_content": "5070 is going to be the next. as well as 5060.",
                "author": "Kotschcus_Domesticus"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HUB - The RTX 5070 Ti Has Been Killed Off",
        "score": 582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9070XT VS 5070Ti going from \"whichever is cheaper in your region\" to AMD is the only one left was definitely not on my bingo card",
                "author": "kodos_der_henker"
            },
            {
                "raw_content": "It's looking more and more that whatever we've got now is what we're going to have until when - if - this bullshit collapses. A couple of years at least. Sure hope my PC goes the distance....",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "This is coming directly from some of the AIBs? I'm so fucking tired dude",
                "author": "Darksider123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardwareluxx] - Response from NVIDIA (in German) regarding 5070ti",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "5080 is full GB203 die. To only produce 5080 means they either have very good yield or throw away all the defective 5070ti dies, or make an even lower product with it (there were some AD102 4070 ti super)",
                "author": "FitCress7497"
            },
            {
                "raw_content": "Nothing unexpected. Doesn't contradict ASUS statements in any way. ASUS said supply is constrained and therefore they drop their 5070ti. NVIDIA says memory supply is constrained but they continue shipping GPUs. The actual problem is that everyone is trying to benefit of the situation and negative headlines, especially about NVIDIA, generate lots of clicks and revenue. Tech media is a multi billion dollar business where everyone bends the truth as much as possible or even make up storys (so called leaks) to benefits from the situation. But for some reason most people don't see that as a problem and will call you a defender of trillion dollar companies for pointing that out. That's the sad truth about it. Happened like three or four times already this year.",
                "author": "Jumpy-Dinner-5001"
            },
            {
                "raw_content": ">What changes are occurring in the GeForce ecosystem given the current memory market? Demand for GeForce RTX GPUs is strong, and memory supply is constrained. We continue to ship all GeForce SKUs and are working closely with our suppliers to maximize memory availability.",
                "author": "BarKnight"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] HBM Etching Equipment Said to Enter a Super Cycle",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Creating a 48GB NVIDIA RTX 4090 GPU | Brother Zhang's Repair Shop (ft. 张哥)",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well this is a lot more refreshing to watch compared to the usual content from GN that's posted here. Kinda weird that they didn't show the full GPU-Z readout from the custom RTX 4090 though. Also, with how cheap sea freight is, wouldn't it still be profitable to ship broken GPUs from Europe or the Americas, repair them in China, then ship them back? Zhang doesn't seem to be lacking in business so he doesn't have to do it, but a larger scale operation might be interested.",
                "author": "kkrko"
            },
            {
                "raw_content": "Still waiting for someone to do a 5070 24gb mod",
                "author": "RogueDahtExe"
            },
            {
                "raw_content": "Which cards are even theoretically moddable this way and which ones are definitely not? Anyone knows?",
                "author": "zghr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Efficient cooling method could enable chip-based trapped-ion quantum computers",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Gigabyte's CEO talks motherboard pricing, handheld plans, and more",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "A Deep Dive Into The Qualcomm Snapdragon X2 Elite SoC",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Charlie did an article not shittalking QC i would be suprised. I mean look at this \\>he Spark platform. It basically doesn’t work, the release was a PR stunt, and it is priced to stupidity. That said it is a better product than the Snapdragon X and X2 Elites Lmao, Devs working on ARM for Nvidia will help Qualcomm too. And QC has been doing the work on GPUs which is slow work",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "> Nvidia has now launched their N1X/GB10 devices, the Spark platform. It basically doesn’t work, the release was a PR stunt, and it is priced to stupidity. That said it is a better product than the Snapdragon X and X2 Elites. Why? Because the hardware may be broken but the software support is there. By the time the consumer devices ship, currently set for announcement after CES and availability in June-ish, things will be better. Qualcomm has lost the entire dev community to Nvidia, squandered a decade lead. No sane developer will engage with Qualcomm over Nvidia at this point, their antagonism over the past 18 months has ensured that. X2 Elite may have the better CPU, but Nvidia has the better GPU and great software ecosystem. In this age of heterogeneous computing, that is very important. The M4 in the fanless Macbook Air completely thrashes the X Elite in many productivity workloads (that happens to make use of the GPU). Adreno X1 GPU hardware is mediocre, and the the situation with drivers is abysmal. > All of this is built on a TSMC 3nm process, exact variant unspecified, which means it should be pretty efficient. The die size wasn’t officially disclosed but they did give us a sample as a keepsake. As you can see above, there is a bit of epoxy on the edges but the die is about 220mm^2. Interesting. [HotHardware corroborates](https://hothardware.com/reviews/qualcomm-snapdragon-x2-elite-architecture-deep-dive#:~:text=Snapdragon%20X2%20Elite%20High%2DLevel,to%20my%20trusty%20digital%20calipers.); \"The chip is manufactured on TSMC’s N3 process node, and is composed of approximately 31B transistors. Its die size measures about 13.3mm x 16.5mm (219.5mm²) according to my trusty digital calipers.\" X1 Elite was 169 mm² N4P. So X2 Elite is about 30% larger with a node shrink. For that, you get a 6 more CPU cores, a 33% bigger GPU, a 50% bigger memory bus, etc... Is the die size of Apple M5 known? > Raytracing seems to be the focus of many GPU makers this season and Qualcomm is no exception. The RT unit has been heavily update this time around with bounding box tree traversals now done in hardware which is a tremendous speedup, not to mention power savings. Am I reading this right? Adreno X2 GPU has proper RT cores like Apple/Intel/Nvidia, and not the AMD approach? If so, this represents a significant divergence from the mobile hardware (8 Elite Gen 5), which doesn't have it. > X2 uses ACPI which will lessen a big pain point of the X1 but that is about it. Better Linux support? > Toss in Microsoft’s software incomptence and you have something that should be avoided. What a travesty. Perhaps the partnership with Google will go better? https://www.androidauthority.com/google-android-on-pc-qualcomm-snapdragon-summit-3600612/ People are tired of Microsoft's shenanigans and the steady deterioration of Windows. They have clearly given up even pretending to care about the user experience. For example, Google has been much more responsible with how they have integrated AI to Android, compared to Microsoft's Copilot disaster on Windows. If this upcoming Aluminium OS functions like proper Linux, while also being user friendly for the 'Linux noobs', and integrates deeply with our Android phones (like Mac and iPhone)... this could be a hit.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "The fist Snapdragon is the shit, especially high ram machines running llms on Npu.perfect laptop. The second I want it to be at least 120 tops and 128gb ram. That would be one in a kind experience.",
                "author": "Dontdoitagain69"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Switch 2 reveal trailer was 1 year ago today",
        "score": 575,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My god, already? Feels like yesterday.",
                "author": "kahabraham"
            },
            {
                "raw_content": "No way. Thats crazy.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "Those leaks over Christmas were great.",
                "author": "MXC_Vic_Romano"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Foundry each time a current gen AAA titles comes to Switch 2 and it looks like the xbox series s version",
        "score": 412,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can’t argue with the little things. It’s the little things that make up life.",
                "author": "lechuck313"
            },
            {
                "raw_content": "All of us, really. Just take a step back one year ago and see the state of third party ports on Switch 1. It's amazing we're getting close to Series S products on Switch 2 and we're already starting to take it for granted.",
                "author": "Medd-"
            },
            {
                "raw_content": "It's still impressive because you're getting the power of the Series S on a tiny mobile platform. Do you know what you would need to play the Series S on an airplane? The Series S, a 43 inch HD monitor, and at least 3,000 hamsters to power the devices. That would be inconvenient.",
                "author": "TheUnforgettable29"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's officially been 1 year since the switch 2 was first revealed.",
        "score": 55,
        "text_content": "I still remember waking up that morning thinking the day was going to be all about donkey kong. (Because donkey kong country returns HD also released the same day.) Needless to say....seeing the reveal trailer for the switch 2 in my youtube notifications was quite shocking as the first thing that i saw when i woke up.",
        "comments": [
            {
                "raw_content": "I still think this is a great reveal trailer, showing the original Switch and then evolving into the next generation, clearly showing the differences.",
                "author": "Mucrush"
            },
            {
                "raw_content": "I remember going to sleep the night before thinking the leak mostly bullshit but I still had a little hope. When I woke up and got on youtube my eyes lit up like a christmas tree",
                "author": "ryukazar_6"
            },
            {
                "raw_content": "Saltiest reveal ever.",
                "author": "electric-sheep"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake Integrade Size",
        "score": 243,
        "text_content": "I didn't think this game would take up more than 90GB on the Nintendo Switch 2; I think buying the 1TB microSD Express was a good idea.",
        "comments": [
            {
                "raw_content": "Fun fact: File size has been shown/known since the demo dropped.",
                "author": "JKN1GHTxGKG"
            },
            {
                "raw_content": "Nobody don't talk about Skyrim that 53 GB Holly shit it was 7.5 GB when first published",
                "author": "Apprehensive_Mix4576"
            },
            {
                "raw_content": "The game is pretty big on other platforms, so it’s not too surprising. I’m curious though on if they’ll be able to compress rebirth’s file size, because 150 GB for a Switch 2 game would be a deal breaker for a lot of people.",
                "author": "waxy15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How to fix the blurry/washed out look in Cyberpunk 2077 on Switch 2. Crisp Image Settings!",
        "score": 221,
        "text_content": "Hi everyone, ​I wanted to share the best settings I found for Cyberpunk 2077 on the Nintendo Switch 2, specifically for Handheld Mode. ​My goal was to get the best possible Image Clarity and fix the \"washed out\" look that the game has by default. After a lot of testing, here is what worked best to get a crisp image with vivid colors: ​1. Graphics Settings (Check Image 1) I disabled all the post-processing effects that add artificial blur. This makes the game look much sharper on the portable screen. ​Film Grain: OFF ​Chromatic Aberration: OFF ​Depth of Field: OFF ​Motion Blur: OFF ​Vignette: OFF ​Lens Flare: ON (Kept this one for the atmosphere) ​2. Video / HDR Settings (Check Image 2) Since the Switch 2 screen in handheld mode caps at 450 nits, here is how to get the colors to pop: ​Maximum Brightness: 450 (Locked by system) ​Tone-Mapping Midpoint: around 2.00 - 2.40 (Adjust based on your room lighting) ​HDR10 PQ Saturation: Boosted to 0.80 - 1.00. This is key! It fixes the washed-out look and makes the neon lights and city look vibrant on the smaller screen. ​Let me know if these work for you!",
        "comments": [
            {
                "raw_content": "Digital Foundry did a review and for handheld mode, they recommend changing the default QUALITY MODE to PERFORMANCE MODE. In handheld mode using quality mode, when you move the camera, the scrolling will be somewhat choppy. With stuttering images. They showed that in the video. But in performance mode, the scrolling becomes smoother and it stutters less. That's another setting that is useful. EDIT: Since some people are doubting what Digital Foundry said, here's the video in question where they clearly state that in handheld mode, they recommend Performance over Quality mode. And they explain why (starts at 15:30) https://youtu.be/C7fExZx1QyU",
                "author": "Garamenon"
            },
            {
                "raw_content": "I find that motion blur really helps 30fps games look smoother than they actually are so I left it on. I also think quality mode does a better job holding 30fps than performance mode does at holding 40fps. But it’s always interesting to see what settings people end up tweaking",
                "author": "NeighborhoodPlane794"
            },
            {
                "raw_content": "Personally I think motion blur makes is very nessessary in making 30 fps look smooth. 60fps its optional and depends on the game. I dont think motion blur is needed at high framerates (example 120fps).",
                "author": "Many_Mechanic_1886"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Generation Pack - Nintendo Switch 2 - Good deal at Target if you plan on picking it up!",
        "score": 36,
        "text_content": "For 1 more day Target offers $30 off Nintendo games, very good deal for Resident Evil pack. Just add another cheaper game! This also works for many other Nintendo games!",
        "comments": [
            {
                "raw_content": "Nope didnt work and says unavailable. Womp womp",
                "author": "Ryzakiii"
            },
            {
                "raw_content": "Took advantage of this deal and bought Metroid Prime 4 and Donkey Kong Bananza.",
                "author": "Gil64_"
            },
            {
                "raw_content": "*America..... Not here in Australia",
                "author": "Thedude8450"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "And It Was a Beautiful Day",
        "score": 291,
        "text_content": "So excited",
        "comments": [
            {
                "raw_content": "Persona 3, Cyberpunk and final fantasy. ![gif](giphy|3q3QK6KyDVUBzih7hB)",
                "author": "TheHighness1"
            },
            {
                "raw_content": "Played a bit on the PS5 was great , definitely going to buy for the switch 2 as I enjoy playing more in. Handled now",
                "author": "DrunkDonut92"
            },
            {
                "raw_content": "I’m not even a big FF fan and I really enjoyed it when I played on PS5. Glad to see others get a chance to enjoy it too!",
                "author": "Cardboard_Waffle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can't even play og ff7 while we wait huh?",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah this was the same thing that happened with the Attack on Titan game for the Final Battle dlc. The game was bundled with the dlc for a better price but purchasing it that way prevented you from actually playing the game until the DLC released, despite the fact that it was already out.",
                "author": "Valnaire"
            },
            {
                "raw_content": "That's so odd, the OG FF7 isn't a new release, and they already got your money so it’s not like it’s possible to cancel the preorder of the remake to keep the original for free.",
                "author": "Excaliburn3d"
            },
            {
                "raw_content": "The way it registers the purchase is really weird for the bundle in every way, first there was the issue if you already bought the OG, and then not even being able to download and play the original right way from the start.",
                "author": "Stryker_T"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hi-Fi Rush has just been rated for Switch 1",
        "score": 138,
        "text_content": "https://pegi.info/search-pegi?q=hi-fi+rush&op=Search&age%5B%5D=&descriptor%5B%5D=&publisher=&platform%5B%5D=&release_year%5B%5D=&page=1&form_build_id=form-p_mr6kSavhezTDSy78CpA5Fw06N26pgZK4pYtdCJcVs&form_id=pegi_search_form I don't think the Switch 2 Edition of the game will be too far behind.",
        "comments": [
            {
                "raw_content": "It was rated for Switch 1 back in 2024 as well: https://www.reddit.com/r/NintendoSwitch/s/0FBZIMKUpm This doesn’t mean a Switch 2 port is imminent until Switch 2 specifically gets rated.",
                "author": "ZXXII"
            },
            {
                "raw_content": "As long as a switch 2 version with 60 FPS comes later, I'll be really happy. Playing this game at 30 FPS probably isn't very enjoyable because of the rhythm part. And assuming that the switch 1 version won't even run flawlessly... It may not be a very good experience.",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "Yes! The Switch 2 is Awesome but I hope Switch 1 keeps getting games for a bit.",
                "author": "Starlyoko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "An unreleased Nintendo hardware model going by the name of \"OSM\" has been discovered within the data for Nintendo's Account Portal site",
        "score": 409,
        "text_content": "[Source 1](https://bsky.app/profile/dootsky.re/post/3mcgz3nkmzl2i) [Source 2](https://bsky.app/profile/aaron.nirvati.org/post/3mch5nnuoek2y) The icon for this console recycles the one for the Switch 2, from the looks of the name, it seems to stand for \"Ounce Small Model\" which it could possibly be a smaller model for the Switch 2 just like how the original Nintendo Switch has a smaller model counterpart named the Nintendo Switch Lite.",
        "comments": [
            {
                "raw_content": "Why do you think it stands for Ounce Small Model? Also, why was the NS2 called BEE?",
                "author": "Forward-Trade3449"
            },
            {
                "raw_content": "Switch Pro (2) rumors are back to dominate this sub again.",
                "author": "guineapigtacosauce"
            },
            {
                "raw_content": "considering that Switch 1 had a chip revision before the Lite came out, wouldn't it make more sense to look out for something like that first?",
                "author": "0utletsforsale"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Lego Zelda Set leaked!",
        "score": 89,
        "text_content": "It shows the final battle of Ocarina of Time. Source: https://www.reddit.com/r/Legoleak/comments/1qe6y4h/zelda\\_77093\\_the\\_final\\_battle\\_ocarina\\_of\\_time/",
        "comments": [
            {
                "raw_content": "Bionicledorf is real.",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "$130 is still too much for what's actually here but honestly way cheaper than I was expecting. This whole Adults Only line really just feels like Lego exploiting millenial nostalgia and the fact that audience has fresh disposable income and the attachment to nerd shit that turns these kinds of things into desirables. The fact Pokemon is only getting Adults Only sets and that one of them costs more than a whole Switch 2 is baffling",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "120€ for Ganon and a tower LMFAO",
                "author": "Charming_Volume_8613"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Eva La Dare (VA from Sheva Alomar RE5) is teasing an announcement for March on Resident Evil 30th Anniversary",
        "score": 334,
        "text_content": "Link: https://xcancel.com/KarenShevaEva/status/2011868483194392926#m If I have to guess... it is most likely the new CG Movie. \\- The writter of RE Death Island said he wanted to do a CG movie with Sheva and Barry. https://www.fangoria.com/resident-evil-death-island-writer-would-love-to-take-the-carnage-to-antarctica/#:\\~:text=Makoto%20Fukami%20wrote%20Resident%20Evil,create%20a%20more%20thrilling%20feeling.%E2%80%9D \\- Capcom has a trending to release a CG Movie project between a new RE number game \\- According to Dusk Golem RE5R is not in development now. CV and RE0 seem to be the next plans.",
        "comments": [
            {
                "raw_content": "Oh wow, if she is Sheva then she really is the longest voice actor to last in Resident Evil.",
                "author": "Lotus_630"
            },
            {
                "raw_content": "Not expecting anything bigger than new animated movie",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "After RE5 remake we can finally get RE6 remake.",
                "author": "GameZard"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kiwi Talkz claims Crimson Dessert will come to Switch 2",
        "score": 48,
        "text_content": "Video: [ https://youtu.be/Zhic1oMLtao?si=PSoBfz-tNPYMML\\_8 ](https://youtu.be/Zhic1oMLtao?si=PSoBfz-tNPYMML_8) Timestamp: 3:03 What do you guys think? Edit: New post since I fucked up the title lmao Edit 2: Noooooo I fucked up the title again I mean Crimson Desert :(((",
        "comments": [
            {
                "raw_content": "Nothing like a crimson dessert after a chartreuse dinner.",
                "author": "colawars"
            },
            {
                "raw_content": "Mmmmm crimson dessert.",
                "author": "CrazedRaven01"
            },
            {
                "raw_content": "[*The Crimson dessert in question.*](https://www.allrecipes.com/thmb/gDJ1S6ETLfWGyyWw_4A_IGhvDYE=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc()/9295_red-velvet-cake_ddmfs_4x3_1129-a8ab17b825e3464a9a53ceeda54ff461.jpg)",
                "author": "Astraliguss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RTX 5070 Ti 16GB & RTX 5060 Ti 16GB discontinued.",
        "score": 797,
        "text_content": "[Rumor comes from HardwareUnboxed](https://youtu.be/yteN21aJEvE) The YouTube channel claimed that GPU manufacturers and retailers have informed them that Nvidia has unofficially ceased the supply of the two 16GB cards, and because they will not be able to source any additional chips going forward, these models will be placed on the End-Of-Life status. The 8GB models will still be available moving forward. It is also claimed that the RTX 5070 12GB will face reduced supply. This is marked as a rumor because no official sources have come forward to confirm it yet. The video revealing this information has gone live for only an hour.",
        "comments": [
            {
                "raw_content": "I hate this timeline...",
                "author": "markusfenix75"
            },
            {
                "raw_content": "I really wish AI corpos and datacenters a merry bankrupcy.",
                "author": "venom_daemon"
            },
            {
                "raw_content": "I hate AI slop so much it's unreal",
                "author": "enslavelolis"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Prince of Persia Sands of Time Remake could be shadow dropped today",
        "score": 620,
        "text_content": "Source: [ https://xcancel.com/popuniverseX/status/2011747375484977383#m ](https://xcancel.com/popuniverseX/status/2011747375484977383#m) „princeofpersiathesandsoftime.com\" has received two new files! One of the files is named \"game-release-tomorrow.png.\" The file was added on January 14 Edit: some people pointed out it might actually shadow drop tomorrow, not today, since the file showed up today and not yesterday. So yeah, either today or tomorrow I guess. Update: The account that leaked this info just got his X/Twitter account banned by Ubisoft. That makes it pretty likely it’s actually releasing tomorrow via a shadow drop!",
        "comments": [
            {
                "raw_content": "If the game isn't release today, read the file name again",
                "author": "KatoriRudo23"
            },
            {
                "raw_content": "The game will be released the day after that file gets shown to the public. So definitely not today.",
                "author": "grailly"
            },
            {
                "raw_content": "Ubisoft shadow dropping a major title that’s been in development hell without any kind of marketing? I refuse to believe it.",
                "author": "Will-Isley"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Sims 4: Royalty & Legacy - Official Reveal Trailer",
        "score": 108,
        "text_content": "https://www.youtube.com/watch?v=0Rsi1cN3O48 No mention in the release about it if it's the final expansion. I feel like that's something they'd include. Previous leak: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1q3j0l5/the_sims_4s_21st_expansion_pack_royalty_legacy_is/",
        "comments": [
            {
                "raw_content": "they're gonna be doing these till we're 90",
                "author": "scott1swann"
            },
            {
                "raw_content": "Sims 4 Royalty and Legacy? For some reason... This makes me miss The Sims Medieval.",
                "author": "Uned1bleCookie"
            },
            {
                "raw_content": "Hilarious. \"Royalty\" as EA gets purchased by the Saudi royal family",
                "author": "Dogbold"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Maxsun joins Sparkle in making Intel Arc B60 Pro GPUs available to regular consumers, with up to 48GB VRAM",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Unlike Sparkle, Maxsun has two cards in its arsenal: the regular 24GB VRAM model with a dual-fan design, and the dual-GPU 48GB model with a blower-style fan seems nice",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS shows off next-gen W890 motherboard for Xeon 6 WS series with seven PCIe 5.0 slots",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m going to wait until Granite Rapids ages more, prices are too high all around. I’m looking into older Dell blade servers with ddr4, need to start racking them up in the basement. I’m also going to need a mobo like this for my llama4 workstation with older xeons. The latest gen premium prices are insane now.",
                "author": "quantum3ntanglement"
            },
            {
                "raw_content": "It looks really cool.. .. But who is this for? the last SAGE cost like £1,100, Xeon 6 is \"DOA\" and will be priced like they are leading in performance and RDIMMS even prior to the AI rush were wildly expensive for what you got. does LGA 4710 even have any future options too?",
                "author": "Zeraora807"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD says its working with board partners to maintain Radeon GPU prices close to MSRP",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We’ll see about that",
                "author": "996forever"
            },
            {
                "raw_content": "well, nvidia is no longer pre-picking memory to match GPU's to partners, so ....",
                "author": "drdillybar"
            },
            {
                "raw_content": "Well considering the 5070 Ti is effectively discontinued and HUB is saying board partners are telling them prices on NVIDIA cards are going up by 20%, count your blessings. They're also saying 5060 Ti 16 GB is going to be drying up. At least AMD is still saying they're trying, I guess.",
                "author": "TurtleTreehouse"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Banks seize 367,000 homes as housing pain spreads across US... and it is about to get much worse",
        "score": 709,
        "text_content": "Oh dear...banks are finally running out of road to kick the can, and are being forced to foreclose on F\\*cked Borrowers.",
        "comments": [
            {
                "raw_content": "There is so much mortgage leniency, It’s become very common to know people who are multiple months late on their payments.",
                "author": "Kali-Lionbrine"
            },
            {
                "raw_content": "Foreclosure fillings do not equal completed foreclosures and the number of filings in this article is less than the number of filings for 2019 at almost 500k, but 2019 still only had roughly 145k completed foreclosures.",
                "author": "dicknotrichard"
            },
            {
                "raw_content": "Ok now Google the foreclosure rate between 2008-now",
                "author": "WhizzyBurp"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The golden handcuffs are slipping in the U.S. housing market",
        "score": 196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The basic truism is that life goes on, and eventually people are forced by circumstance to bite the bullet and buy at 6+% or in other cases to let go of the 3% mortgage they’ve had since 2019. The balance will shift further as people change jobs or lose their jobs and have to move or downsize. We don’t live in a society where it’s as easy to stay put anymore. This economy is a mess.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "2.9% or lower? Lol. That’s not a fair thing to compare. How long were the interest rates below 2.9%? I think it was only a year.",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "Meanwhile all the people who bought at 7% are refinancing at 5.75% right now and loving the $300-500/month savings. Always better to buy when you can…not try to time the market.",
                "author": "Cautious_Midnight_67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Drop to Lowest Level on Record Aside From Start of Pandemic",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*\"It’s worth noting that mortgage rates did briefly dip below 6% last week after President Trump ordered a $200 billion mortgage bond purchase. That led to a jump in mortgage demand, which may boost pending home sales in January.\"* I wonder what January numbers will look like if mortgage rates continue lower?",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Wait, I thought the market was shifting and we need to hurry up and buy? Are realtwhore AI articles lying?",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Pending home sales in December? But didn't inventories shrink in November? There is this mindset amongst those on Reddit, that if there is housing for sale, people should just buy that housing. The reality....For the decades I've been following real estate data, potential home buyers will not purchase homes that do not fit their needs. If pending home sales have recently dropped, this could be a sign that the most desirable homes have already sold, leaving undesired housing. This could be a sign that the housing market is actually strong as home sales for Fall were actually better than expected. A small example is where I live....homes left for sale are on busy streets... or have no garages...or are too expensive at $3.5 million. Desired homes sell in Spring, Summer and Fall, while leaving junk for Winter.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Fall to Lowest Level Since 2022. Agents Say Buyers Are Back.",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sponsored by the American association of Realtors",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Spoiler. They're not",
                "author": "bannedaccountnumber4"
            },
            {
                "raw_content": "Guess my house just became more expensive",
                "author": "freewallabees"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Monthly Housing Costs Start the Year Down 5%, the Biggest Decline in Over a Year",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So this article is just saying a slight market correction may happen?",
                "author": "TheDeliberateDanger"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "people getting tricked by a fake AI influencer",
        "score": 966,
        "text_content": "this is just the beginning, and remember that Most people have no idea how good image generation has gotten edit: even people in the comments of THIS sub who are supposedly exposed to more AI content believe ts, it's over",
        "comments": [
            {
                "raw_content": "Many of those reaction clips were directly stolen from real Omegle streamers who used to impress girls on Omegle the same way. Here's the proof: In the only video this fake influencer posted on YouTube so far (https://youtu.be/Xgv4xkhzufM?si=DxkUTqLAhQXNcBGP), many of the clips still have the Omegle.com watermark on it. However, Omegle.com shut down in November 2023 and is now replaced with Ome.tv. How can a dude who blew up in 2025 still be impressing girls on a site that shut down in 2023? The clip at 5:57 is also clearly copied from one of Spanish streamer Kostyxd's old Omegle streams on YouTube. Kostyxd added Spanish subtitles to all of his English streams since his viewers were mostly from Spain at the time. Why else would this fake influencer randomly add Spanish subtitles to a conversation he's clearly having in English, and only for this one clip out of all the clips he posted in that video? Clearly a stolen video and fake identity.",
                "author": "Silent_Navigator8796"
            },
            {
                "raw_content": "Yeah it’s AI. But somewhere out there, there’s prob a dude that looks very much like this…. And he must be absolutely killing it.",
                "author": "TCNW"
            },
            {
                "raw_content": "Regardless of whether this is AI, it would be pretty cool to make jaws drop just by existing. These girls are covering their mouth like they can’t comprehend what they’re seeing. All the while it’s just an image of a good-looking dude in a chair.",
                "author": "Fragrant-Hamster-325"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A headline from 1986.",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean they weren’t wrong. Even today students have to learn to do arithmetic manually.",
                "author": "leaky_wand"
            },
            {
                "raw_content": "They were not wrong.",
                "author": "valuat"
            },
            {
                "raw_content": "This is obviously correct. Do you know how to read? They're talking about grade school. Obviously you should not use calculators BEFORE you learn how to calculate yourself, otherwise you won't learn shit. That's like teachers saying today \"students shouldn't use chatgpt until they know how to read and write (and think) WELL by themselves\". It's obvious.",
                "author": "MisterBilau"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "how i open internet everyday to see if there something new in ai models",
        "score": 271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The funniest part is that you could recreate the AI part of this with current 2026 LLMs almost perfectly.",
                "author": "artemisgarden"
            },
            {
                "raw_content": "The Same thing I try not to miss anything",
                "author": "Aware_Broccoli_9348"
            },
            {
                "raw_content": "ive been doing this everyday since 2018 tbh",
                "author": "New_Equinox"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic Report finds long-horizon tasks at 19 hours (50% success rate) by using multi-turn conversation",
        "score": 77,
        "text_content": "Caveats are in the [report](https://www-cdn.anthropic.com/096d94c1a91c6480806d8f24b2344c7e2a4bc666.pdf#page=41) The models and agents can be stretched in various creative ways in order to be better. We see this recently with Cursor able to get many GPT-5.2 agents to build a browser within a week. And now with Anthropic utilizing multi-turn conversations to squeeze out gains. The methodology is different from METR of having the agent run once. This is reminiscent of 2023/2024 when Chain of Thoughts were used as prompting strategies to make the models' outputs better, before eventually being baked into training. We will likely see the same progression with agents.",
        "comments": [
            {
                "raw_content": "I agree with the premise, but extrapolating a cluster of 1-6 hour data points and a single 8 hour point all the way to 19 hours is a math crime certainly.",
                "author": "FuryOnSc2"
            },
            {
                "raw_content": "Someone explain this to me. Does a human have to be in the loop or can they bake this into the model/chatbot?",
                "author": "spreadlove5683"
            },
            {
                "raw_content": "When speaking with a senior engineer at meta recently, who was poached from anthropic, he mentioned that they are internally using what they refer to as a Universe of Agents. This report is on the path towards that. He mentioned that what they are using internally is somewhat further down the line to what is being released on research reports. Expect the next big breakthrough to be essentially the removal of context limits followed by constant recursion learning",
                "author": "Crumbedsausage"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will SaaS die within 5 years?",
        "score": 48,
        "text_content": "Recently Michael Truell, CEO of Cursor, posted that GPT-5.2 Codex agents just vibecoded a somewhat working browser with 3 million lines of code. With AI models getting better and better every 3 to 7 months, and hardware improving every year, will we be able to just \"vibecode\" our own Photoshop on demand? The new SaaS will kinda be the AIs token usages. Like, I played a table game with friends, but it was kinda expensive for me to acquire, so I just spun up Antigravity with Opus 4.5 and Gemini 3 and completely vibecoded the complete game in half a day with a local connection so everyone could play on their phone browser and a nice virtual board and controls and rules enforcements (wich could be turned off for more dynamic play) while the PC served as a local host. What do you guys think about this? SaaS = Software as a service. Update: My takeaway here after reading the responses is now that this type of thing will be a huge incentive to companyes so they dont enshitify the software as much and dont rugpull us as much.",
        "comments": [
            {
                "raw_content": "i think if the trend continues there's a reasonable arguments in favor of that yeah. like imagine going back 5 years explaining to people what we can do now through AI, it will sound like sci-fi.",
                "author": "alexthroughtheveil"
            },
            {
                "raw_content": "The thing is, that the value of Photoshop is not inherently that it is a good piece of software. (For example, After Effects has been horrid for years) The value lies in that it is has become an industry standard, if everyone used their own proprietary software on a prompt, it'd be really hard to collaborate between institutions or industries.",
                "author": "Pop-Bard"
            },
            {
                "raw_content": "People may be able to vibecode the level of apps that are currently offered with SaaS. But large enterprises developing software using the same AI tools will be able to make software that would currently be impossible or cost prohibitive to maintain.",
                "author": "acutelychronicpanic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla built largest lithium refinary in America in just 2 years and it is now operational",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like how she says “sustainably source our ore” bitch no mining is sustainable",
                "author": "Public_Support2170"
            },
            {
                "raw_content": "https://i.redd.it/z5nac9ma2kdg1.gif",
                "author": "Mega_Slav"
            },
            {
                "raw_content": "Nothing to do with Singularity.",
                "author": "CallSign_Fjor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Prompting claude when it makes mistakes",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Godlike acting. JK Simmons scared me in that movie.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "I try to treat Claude well, for some reason I humanise it more than the other LLMs. If Gemini makes a mistake: \"HOLY FUCK, how in the world do I have to tell you this...\" If Claude makes a mistake: \"Ok Claude, this is still not working but I know you can do this, let's stop for a second and think about what we are doing wrong...\"",
                "author": "Present-Chocolate591"
            },
            {
                "raw_content": "https://youtu.be/Npsg0UvEGIw",
                "author": "Prudent-Sorbet-5202"
            }
        ],
        "subreddit": "singularity"
    }
]