[
    {
        "post_name": "Trump to Democrats: \"these people are crazy. I'm telling you. They're crazy.\"",
        "score": 780,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump right again.",
                "author": "Maxmax"
            },
            {
                "raw_content": "Run this for campaign ads. Seriously. It’s 30 seconds. Just run it on loop.",
                "author": "MikesDong"
            },
            {
                "raw_content": "Theyre not crazy . They know exactly what theyre doing. They are here to destroy America",
                "author": "highenergywinning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump sickened by Democrats not standing for Iryna Zarutska’s sobbing mother.",
        "score": 838,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This hurt me. The Dems don't see all the people, all the Americans, that they hurt.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "Iryna is their worst refugee: Genuine White Working Loves America",
                "author": "IlhansBrother"
            },
            {
                "raw_content": "He buried them tonight. The media will say no, but he buried them when he asked members to stand up who believe it's their job to support Americans first, and none of them stood. They would have done better to walk out with Al Green.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin No!",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I'm a bit of an illiterate porch monkey, myself!\"",
                "author": "seeling0"
            },
            {
                "raw_content": "KEK <————— THIS ONE KEK KEK",
                "author": "MikesDong"
            },
            {
                "raw_content": "Don't they know what comes after every time they hold up a piece of paper or a sign like this?",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cameraman needs a raise",
        "score": 685,
        "text_content": "",
        "comments": [
            {
                "raw_content": "someone looks very uncomfortable and guilty",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "Did I see the cameraman pan over to the trans retard in Congress when Trump was talking about the girl Sage (?) who was essentially kidnapped by her school that tried to make her a boy?",
                "author": "ARMENTO"
            },
            {
                "raw_content": "He should get a CMH too!",
                "author": "UntakenUsername"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEMOCRATS JUST SHOWED AMERICA WHO THEY CARE ABOUT.. AND IT'S NOT AMERICANS. Trump just said that the first duty of the government is to protect and prioritize citizens and not illegal aliens...and that anyone who agrees should stand.... Not one Democrat stood",
        "score": 1075,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They have to support their electorate.",
                "author": "Burning"
            },
            {
                "raw_content": "# Democrats are a hostile force to the United States of America. DESTROYERS",
                "author": "CommieCrats"
            },
            {
                "raw_content": "Democrats don’t exist without illegal aliens. They are frauds.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The NYT just did a hit piece on the US men's hockey team for not rejecting Trump's call",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They don't live in reality. They really, really hate our country and our people.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "They have themselves convinced they are the majority. The truth is that they are correct: The US hockey team has nothing to do with them. That's old America. Conservative America. The real America. The woke America that they live in with rampant black crime, tranny shootings, foreign invaders, open borders, and woman skiers who eat shit going down a mountain is their America. It's no wonder they can't relate to a bunch of White Americans bleeding on the ice to finally achieve a hard won victory. That was never them and never will be.",
                "author": "SimaYi"
            },
            {
                "raw_content": "> Some of the U.S. men's Olympic hockey teams goodwill has diminished. Goodwill for fucking what? \"Congrats on the gold, now be mouthpieces for our propaganda\".",
                "author": "Minn2000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Congratulations, Royce! Try to Hold it together! She is hot, she is still the First Lady! Thank you for your service & massive respect for your humility.",
        "score": 722,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet he just had his best day ever!!!",
                "author": "YoMamma2020"
            },
            {
                "raw_content": "Remember, he shot down Russkies flying fast swept-wing MIGs while flying a slower straight-wing Panther.",
                "author": "goldwater2"
            },
            {
                "raw_content": "Holy shit, is that ~~Barron~~ The Expert?",
                "author": "Forgototherpassword"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Delivers the State of the Union Address",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh, I know we're all supposed to circle jerk about Trump's State of the Union but what exactly did that accomplish? Do you actually think that earned him votes? Saved the midterms? Convinced Republican congressmen to stop being pussies? If anything he turned off more centrists and further emboldened the leftists. Hard to see how that helps.",
                "author": "NDPatriot"
            },
            {
                "raw_content": "Best SOTU speech by the best president in my lifetime.",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "That was a good Trump speech, loved it.",
                "author": "Captainlizard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today, our border is SECURE, our spirit is RESTORED - America is RESPECTED again perhaps like never before. 🇺🇸",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happy for a secure border. But it’s tenuous at best. As soon as a democrat cheats into office, the borders will be thrown open again. And we still have a long long road to get rid of all the illegals. Not to mention the visa grifters.",
                "author": "Filo76"
            },
            {
                "raw_content": "Yeah pretty tired of this guy serving up shit sandwiches and asking us to pretend they're prime rib.",
                "author": "heytherefaggot7"
            },
            {
                "raw_content": "“Were richer than ever before” and yet it feels the opposite.",
                "author": "603taco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is bringing down mortgage costs",
        "score": 799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry but the answer is to bring down home prices...",
                "author": "Couchbeer69"
            },
            {
                "raw_content": "No matter how much he might be bringing it down, insurance rates and taxes are more than making up for it.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "50 year mortgage......... usury is not an acceptable solution to inflation",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS has confirmed Democrats are trying to BRING ILLEGAL ALIENS to President Trump's State of the Union tonight. That INCLUDES fraudsters and violent offenders",
        "score": 1359,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they want a televised arrest. lol",
                "author": "abstr4ct"
            },
            {
                "raw_content": "I wouldn't put it past Dems slipping a gun to an illegal to try to assassinate him during his speech",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Sounds like we should have ICE there arresting people then.",
                "author": "America_No_1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House: State of the Union Bingo",
        "score": 971,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rubio gets another job. kek",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "I wonder if the Geico cavemen (Al Green) will interrupt the speech again",
                "author": "McFatty7"
            },
            {
                "raw_content": "Link https://x.com/WhiteHouse/status/2026458273340096888?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WAIT WHAT does Tlaib's Badge SAY AGAIN?",
        "score": 569,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The herpes in her brain has herpes She has to freebase valtrex nightly",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Omar must have a rough tongue",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Both those disgusting bitches need to be DEPORTED.",
                "author": "trumpetgirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats Stage Bizarre ‘State of the Swamp’ Circus with Inflatable Frogs to Counter Trump’s SOTU (VIDEO)",
        "score": 659,
        "text_content": "",
        "comments": [
            {
                "raw_content": "are they tryin' to steal pepe again?",
                "author": "Raetchel"
            },
            {
                "raw_content": "Those frogs are gay!",
                "author": "Flubadub"
            },
            {
                "raw_content": "You know we got a good thing when they try to steal it 🐸",
                "author": "TxPede1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On Monday, college kids told us Trump didn’t do so well at the State of the Union. The only problem…it hasn’t happened yet.",
        "score": 955,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care what liars and commies think.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "The indoctrination is strong with this generation.",
                "author": "FredRedd"
            },
            {
                "raw_content": "Obvious DEI admissions.",
                "author": "Dems-R-Dumb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dear John Fetterman: Respect.",
        "score": 474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only sane democrat is the one who suffered a brain damaging stroke.",
                "author": "DrinkTeaNotKoolaid"
            },
            {
                "raw_content": "The least brain dead Democrat.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "What was he clapping for?",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN is running MAJOR cover for Newscum.",
        "score": 1106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fascists are quoting him exactly; here is why that's a bad thing.",
                "author": "CyanScales"
            },
            {
                "raw_content": "CNN = CIA propaganda wing.",
                "author": "grenades_and_ham"
            },
            {
                "raw_content": "Commie propaganda needs to die.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Over $17 Million in Soros Cash Is Powering the Democrat’s ‘People’s State Of The Union.’",
        "score": 755,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So arrest soros and seize this terrorist's assets. This has gone on for far too long.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "The President is literally the Executive of this country. He is LITERALLY the People’s Representative of all Americans. So HIS SotU is The People’s SotU, therefore, which people are the democrats making a SotU for? because it sure as hell is not Americans.",
                "author": "realPixelDust"
            },
            {
                "raw_content": "Sounds very communist.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Commiepope Allegedly Labels \"Far Right\" His Greatest Concern In Private Meeting",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's his greatest concern because the far right sends pedo's to hell.",
                "author": "raptormissle"
            },
            {
                "raw_content": "You’re the goddamn pope. If there’s anyone on Earth who should be far right it’s you.",
                "author": "MAGA9428"
            },
            {
                "raw_content": "Total Chicago faggot just like Obongo, probably went to the same bathhouses",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley and his fraud-exposing partner David Hoch are at President Trump’s STATE OF THE UNION tonight",
        "score": 1131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet Walz isn't in prison. Neither is Ilhan. In fact, NONE of the people they exposed have been arrested. The Somali community as a whole came out and is now demanding more money from taxpayers for the grief ICE caused them. OMG already caught a government official that stated no one is going to jail for this. They will simply wait until Trump is gone and it's back to business usual. https://patriots.win/p/1ARwwogM9R/omg-caught-on-hidden-camera-fbi-/c A white female judge also recently overturned a jury's slam dunk verdict on massive Somali fraud and let the fraudsters walk, keeping their money. https://patriots.win/p/1ARczAAOwQ/some-animals-are-more-equal-than/c",
                "author": "MissingTrump"
            },
            {
                "raw_content": "David Hoch is a boss. Guy drives through bad neighborhoods and sees suspicious things and looks deeper. Then gets invited to the white house. Right place at the right time for that man.",
                "author": "mikejones"
            },
            {
                "raw_content": "will netenyahu and his partner huckabee be there as well?",
                "author": "Above_Reproach"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ars Technica: \"Panasonic, the former plasma king, will no longer make its own TVs\"",
        "score": 533,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss the 80s and 90s Japanese electronics, you knew you was getting some of the absolute best stuff you could buy. Even scammy people at flea markets would say \"It has Sony guts\" when selling bootleg VCRs with their bootleg VHS tapes.",
                "author": "the7egend"
            },
            {
                "raw_content": "Are there any actual Japanese TV makers left or has it all gone to mainland Asia? I know Sony was already using panels from LG and others. Feels like an end of an era for anyone who lived during the Japanese CRT golden age.",
                "author": "dparks1234"
            },
            {
                "raw_content": "With Sony and Panasonic exiting the TV display business, 2026 will be the last year you can buy from these brands before they turn to ewaste brands.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia N1 SOC laptops in H1 2026 with 20 cores, integrated RTX 5070",
        "score": 149,
        "text_content": "leaked info originally reported from The Wall Street Journal",
        "comments": [
            {
                "raw_content": "WoA compatibility will be the make-or-break for these as gaming laptop chips. On the Linux side, Nvidia's drivers will be, but that market is relatively small and has had some help with the existence of DGX Spark. The CPU design is also possibly going to lead to some inconsistent performance issues. There are 4 types of threads, but as far as I can tell, all X925 and A725 cores are treated equally. The set of X925 and A725 cores on the larger L3 pool are faster than their counterparts with halved L3 cache. If your game gets put on the wrong CPU cluster, it's going to inexplicably perform worse for example. I'm sure these can be ironed out, but that weird split CPU design is going to be an extra thing to worry about. I feel like this chip would've been better off with the X925s and A725s as their own separate clusters rather than the 5+5+5+5 setup it has.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "And will cost more than an intel plus 5070 combo surely.",
                "author": "Qsand0"
            },
            {
                "raw_content": "hardware wise, it sounds great. it's the software OS side that has me like \"eh\" since it's basically a Windows Arm laptop.",
                "author": "EnigmaSpore"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD clinches mega chip supply with Meta, $60 billion over 5 years",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meta also gets 10% of AMD shares. This is on top of OpenAI getting 10% At this point everyone will own 10% of AMD.",
                "author": "From-UoM"
            },
            {
                "raw_content": "All that money and still couldn’t support the Z1 extreme driver updates for 3 years🤡",
                "author": "Ok_Program_7549"
            },
            {
                "raw_content": "wow steam machine is cooked",
                "author": "Math_Mortician"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "vivo is testing a phone with a 12,000mAh battery",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very important caveat: the author made a mistake regarding the voltage. The specified 4.53V is the max charging voltage, not the nominal voltage. Nominal voltage is more likely to be below 3.8V.",
                "author": "BlueSwordM"
            },
            {
                "raw_content": ">10,000mAh@4.53V Please, can we just use Wh? And actual Wh, without micro and using thousands. So 45.3Wh.",
                "author": "gorion"
            },
            {
                "raw_content": "Looks like you soon won't be able to bring your phone on a plane.",
                "author": "DerWanderer_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "120mm of Microsoft's borosilicate glass can store 2Tb for 10000 years with 18.5Mbits write speed",
        "score": 8,
        "text_content": "A new option for long term data storage",
        "comments": [
            {
                "raw_content": "2TB would take 20 days to copy with that speed. Useful for governments and dying TV channels probably.",
                "author": "OldSkoolHunter"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google Cloud N4 Series Benchmarks: Google Axion vs. Intel Xeon vs. AMD EPYC Performance",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh. Need to see 16 core vs 16 core. 16 vs 8 kind of skews",
                "author": "Slasher1738"
            },
            {
                "raw_content": "Has anyone dug up what sort of fabrication process and die size those Google Axion chips are using? Would be interesting to compare that against Xeon and Epyc chips.",
                "author": "GenericUser1983"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Speeds up Expansion in Taiwan: up to 10 Fabs Reportedly under Construction or Starting in 2026",
        "score": 52,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Taiwan's Semiconductor Paradox: Why TSMC Soared, DRAM Sank",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welll over 60% of Micron’s DRAM are made in Taiwan… so…",
                "author": "charliehu1226"
            },
            {
                "raw_content": "A few days ago I was asking myself this question: Given that TSMC is so successful, why are there no big DRAM manufacturers in Taiwan? When trying to find an answer for this question, I found this article and wanted to share it here. The largest DRAM manufacturers are Samsung and SK Hynix (both in South Korea), Micron (US) and CXMT (China). There is also a Taiwanese DRAM manufacturer called Nanya, but they have a very low DRAM market share and are much smaller compared to TSMC. Here are some excerpts from the article why Taiwanese DRAM is not as big as TSMC: >First, the government had always approached the DRAM industry with caution and apprehension. >Lee Kun-Hee, then 47-year-old Chairman of Samsung, even audaciously flew to Taiwan to meet with Morris Chang, Stan Shih, Chin-Tay Shih, and others, intending to deter Taiwan from entering the DRAM industry. >He offered several reasons, including Samsung’s technological lead and first-mover advantage. More importantly, Samsung possessed vast financial resources, enabling it to weather the cyclical booms and busts of the DRAM market. He suggested that Taiwan, with its state-funded ventures, might be abandoned by the government during downturns. >In hindsight, this proved to be the most critical factor. “Only conglomerates can sustain the high-risk nature of the DRAM business—mainly because they can leverage the financial resources of an entire nation,” Shih and Chen explain in their book. >Moreover, thanks to financial and telecom liberalization in the 1980s, Samsung acquired a 49% stake in Korea Telecom and launched its own bank—greatly enhancing its risk-taking capacity.",
                "author": "financeboy0"
            },
            {
                "raw_content": "Micron operates a pretty large fab in Taiwan though.",
                "author": "StarbeamII"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Should have played this years ago!!",
        "score": 117,
        "text_content": "Fallout 4 very addicting",
        "comments": [
            {
                "raw_content": "If it’s your first Fallout, then get ready to get lost in play for hours. In the good way I mean. It really is addicting and easy to lose track of time.",
                "author": "Aurelius5150"
            },
            {
                "raw_content": "Regardless of debate Fallout 3, New Vegas, and 4 are all very very good games. Flawed, but fantastic. Glad it’s getting new life on Switch, but that price is crazy to me.",
                "author": "TheStickofMagic"
            },
            {
                "raw_content": "It’s a good game. Reddit is just negative",
                "author": "Federal-Grass9880"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "People who are complaining that Fallout 4 is $60 on the Switch 2",
        "score": 63,
        "text_content": "I keep seeing so many comments and videos calling Nintendo greedy for Fallout 4 Anniversary Edition being $60. So instead of typing a rant I just made a meme to get my point across. And I'm not talking about the performance of the game or how it's a code in a box, which is stupid and dumb they would do that.",
        "comments": [
            {
                "raw_content": "Blaming Nintendo is stupid for this. And I'm glad that people on the Switch 2 can finally play Fallout 4. That being said, Bethesda charging $60 for it is hilarious.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Nintendo doesn't even set that price.",
                "author": "Robertinho678"
            },
            {
                "raw_content": "The internet used to be a fun place to share your passion but it just no longer is that. The sooner you understand this the better.",
                "author": "Medd-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fallout 4 On Switch 2 Looks Better Than The Average Handheld PCs + 40 FPS Is Something That Developers Should Consider More Moving Forward",
        "score": 480,
        "text_content": "[https://www.youtube.com/watch?v=RsB8-YOVCRA](https://www.youtube.com/watch?v=RsB8-YOVCRA) Blunty has made some comparisons and the SW2 version seems to be running/looking better than average handheld pcs. 60 FPS is nice and all, but the 40 FPS mode with higher resolution is probably the best way to play. Switch 2 supports 120hz so ANYONE can utilize this mode in handheld mode. As for dock mode, you NEED to have a tv/monitor that supports 120hz to use this feature. Quick Edit: The game supports 30 FPS, 40 FPS and 60 FPS. I just wish more games had support for 40 FPS like this one.",
        "comments": [
            {
                "raw_content": "I want to get it regardless of the graphics debate but I would never spend 60 bucks on this. Probably 20-30 max.",
                "author": "Responsible_Durian72"
            },
            {
                "raw_content": "Man all of that guys stuff just click bait bs, he literally has about 10 videos about fallout 4 on switch from past 2 weeks praising it one day and shitting on it next day.",
                "author": "bitknight1"
            },
            {
                "raw_content": "Ugh why $60 Bethesda. You guys are so greedy now, I love your games but your practices just suck now.",
                "author": "Rare_Ad_3871"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Pokopia – Nintendo Treehouse: Live | February 2026",
        "score": 196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so doomed. I'm sinking 500 hours on this shit.",
                "author": "kahabraham"
            },
            {
                "raw_content": "This game is gonna sell massive numbers, along with Tomodachi Life",
                "author": "snfi1"
            },
            {
                "raw_content": "This looks so nice, fuck it, make it the spin off with the most unit sold",
                "author": "PlantQuick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza Version 3.2.0 is now available",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Say it, Bart!”",
                "author": "GamercatDoesStuff"
            },
            {
                "raw_content": "Latest update: Ver. 3.2.0 (Released February 24, 2026) General Several issues have been addressed to improve the gameplay experience.",
                "author": "battier"
            },
            {
                "raw_content": "Maybe its just me but i replayed it a few days ago and a lot of the performance issues seem to be gone. There are still drops here and there but not nearly as frequent as before. Elephant bananza dosnt seem to make my s2 scream in pain",
                "author": "deibd98"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fallout is out now... Also, 60FPS",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are three options: 30, 40, 60.",
                "author": "cath91"
            },
            {
                "raw_content": "Is there also a 40 FPS target mode?",
                "author": "Theman457"
            },
            {
                "raw_content": "This runs so well on the Switch 2",
                "author": "Top-Procedure843"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "February 27th. The day of days.",
        "score": 86,
        "text_content": "Is it just me or is this the biggest game day of the last year or so?? Pokemon FR/LG and Resident Evil 9 Usually I’m searching for things to play and now I’m at a crossroads . Who’s playing these and in which order??",
        "comments": [
            {
                "raw_content": "These next 4 weeks are wild for gamers! Pokemon, Marathon, RE9, Crimson Desert 😭😭",
                "author": "BraevGhost"
            },
            {
                "raw_content": "Got 'em preinstalled and ready to go. Gonna be an awesome weekend.",
                "author": "kyuubikid213"
            },
            {
                "raw_content": "Im playing Leaf Green as the prequel to RE9 then following up RE9 with its critically acclaimed sequel Resident Evil 10: Pokemon Fire Red German Edition. And then im playing Resident Evil 11: Pokemon Fire Red English Edition which is supposed to be less scary than the German edition",
                "author": "WeisMobilityScooter"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fallout 4 30fps mode has much better Graphics & Resolution",
        "score": 192,
        "text_content": "I'm glad they give you the option. Haven't tried portable mode or 40fps mode",
        "comments": [
            {
                "raw_content": "40 fps is also very good and feels much smoother",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "Would Hope so",
                "author": "Afc_josh12"
            },
            {
                "raw_content": "It's almost the same with skyrim anniversary. When you set it to 30fps the visuals get a lot better",
                "author": "Volcan32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Have Nintendo overestimated the appeal of Switch 2 editions?",
        "score": 817,
        "text_content": "I feel like Nintendo are positioning these releases as similar to the Wii U ports that filled out the Switch 1's early days without understanding that the Wii U ports sold so well and were so popular with so many people because they were essentially new games to the overwhelming majority of Switch owners. Like most people, I didn't have a Wii U so getting Tropical Freeze, Mario Kart 8, Bayonetta 2, Hyrule Warriors all within the first year or so of the system's life felt like a massive deal. It was a shame for Wii U owners, sure, and I often saw them complain more at the time about the Switch's early line up, but the reality is they were a tiny minority of people. Meanwhile, even though I really liked Mario Wonder and I absolutely loved Kirby and the Forgotten Land, I have very little interest in these upgrade packs. If the DLC had come out 6 months post-release, I'd probably have been very interested, but on Switch 2, they just don't hit the same. And I'm pretty sure I'm not the only one. When stuff like Tropical Freeze released, you'd see loads of posts around release from people playing the game. When Star-Crossed World released, I barely heard a peep. It almost seems like Nintendo haven't understood that the appeal of Mario Kart 8 etc was that to most Switch owners, that was effectively a new game - I'd imagine lots of casuals or younger players probably never even knew they were ports at all. With these Switch 2 editions, however, the ratio of people for whom these would feel like new games has flipped with probably 90% of Switch 2 owners having owned a Switch 1 and had access to these games for years (of course, for those few people who *didn't* have a Switch 1, they must feel like they're sat before an all-you-can-eat buffet). I feel like there's a big discrepancy between how much Nintendo is pushing these upgrade packs and the excitement / interest in them from players.",
        "comments": [
            {
                "raw_content": "They're meant to keep evergreen games selling. Nintendo are happy with that.",
                "author": "FutureLarking"
            },
            {
                "raw_content": "I don't feel that the Switch 2 editions are meant to take the place of brand-new games. We've been getting fully new games as well, and we'll keep getting those. The Switch 2 editions and DLCs are extras, not replacement.",
                "author": "mrmivo"
            },
            {
                "raw_content": "We cannot know, we don't have the worldwide sales numbers.",
                "author": "szanda"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 02/23/26❄️",
        "score": 44,
        "text_content": "[Aliens are real](https://media.tenor.com/C8Wjn-M-5yYAAAAj/aliendance-alien.gif) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks**\\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Bluepoint is being shutdown](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r97pl9/jason_schreier_posts_that_bluepoint_is_being/) * [Phil Spencer Retiring, Sarah Bond Out, Matt Booty Promoted as Microsoft AI Exec Asha Sharma Named New Xbox Boss previously the President of Microsoft's CoreAI product](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ra6mm8/ign_phil_spencer_retiring_sarah_bond_out_matt/) * [Christopher Judge (Kratos) says GoW remakes will have TC Carson and new combat system, new SSM game reveal late summer](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r8poeu/christopher_judge_kratos_says_gow_remakes_will/) * [Inside Microsoft’s big Xbox leadership shake-up : Microsoft has a new gaming CEO who wants to bring Xbox back from the brink.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1rcjray/tom_warren_inside_microsofts_big_xbox_leadership/) * [Post Ragnarok ending hidden dialogue has now been found within the game files \\*POTENTIAL FUTURE SPOILERS\\*](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r9qgda/post_ragnarok_ending_hidden_dialogue_has_now_been/) # [Want to help us improve this subreddit? Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Fire Emblem news any day now surely... Any day now...",
                "author": "wintersodile"
            },
            {
                "raw_content": "We need RDR2 tahiti update, or we’re all DEAD",
                "author": "ShadowVen_"
            },
            {
                "raw_content": "The backlash against Skyrim's Switch 2 upgrade must've been immense because apparently Fallout 4 has a 30, 40 AND 60fps mode out of the box and they apparently all run well (albeit with handheld mode compromises at higher framerates) I mean, good on Bethesda for listening to criticism. I was fully prepared for Fallout 4 on Switch 2 to just be a prettied up straight port of the PS4 version Also as an aside, if third party Switch 2 games can't do 60, I will happily accept 40fps as a compromise. I hope it's more normalized as a performance preset the way 60 is on the higher end consoles",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Unannounced Serious Sam title \"Serious Sam: Shatterverse\" rated in Korea",
        "score": 134,
        "text_content": "Reported by Gematsu [https://xcancel.com/gematsu/status/2026492031959257320/](https://xcancel.com/gematsu/status/2026492031959257320/) [https://www.grac.or.kr/Board/Explanation.aspx?searchtype=004&type=view&bno=304&searchtext=](https://www.grac.or.kr/Board/Explanation.aspx?searchtype=004&type=view&bno=304&searchtext=)",
        "comments": [
            {
                "raw_content": "Im so glad that this franchise is not dead. It's so fun to play, i hope they keep making more.",
                "author": "MinervaXN"
            },
            {
                "raw_content": "AAAAAAAAAAA",
                "author": "MisunderstoodBadger1"
            },
            {
                "raw_content": "#AAAAAAAAAAAAAAAAAAAAAAAAAAAA",
                "author": "AscendedViking7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A guy has been livestreaming RE9 for 9 hours",
        "score": 117,
        "text_content": "https://www.youtube.com/live/s0zz7aF4EA4",
        "comments": [
            {
                "raw_content": "Ten thousand deaths.",
                "author": "longbrodmann"
            },
            {
                "raw_content": "Capcom be like: \"How interesting. Kill this man immediately.\" ![gif](giphy|Le7zxGiKkqjnx5Gzpx)",
                "author": "EntertainmentBreeze"
            },
            {
                "raw_content": "Oh man I won’t be able to play until late next week guess I better delete reddit for now",
                "author": "GrapefruitSea7656"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marvel’s Wolverine launches on September 15th, 2026",
        "score": 941,
        "text_content": "Source: [https://bsky.app/profile/playstation.com/post/3mfmnedu6zs2y](https://bsky.app/profile/playstation.com/post/3mfmnedu6zs2y) Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/xQ0OnZUrKz",
        "comments": [
            {
                "raw_content": "I have a feeling they're prepping for a big Game Informer cover story like what Spider-Man got back in 2018. There's no other reason they'd date it this early when they didn't even give a window beyond Spring for more info I'm also expecting like all the promotion for this game to be shouting out Raven Software for Origins the same way they were comparing Spider-Man PS4 to Treyarch Spider-Man 2. I already know of some of the unrevealed characters that were leaked during the hack two years back so I wonder how they'll go about unveiling them",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "September sounds lovely",
                "author": "Ajax_Da_Great"
            },
            {
                "raw_content": "So GTA VI is gonna be November 2026 for sure I guess, this announcement was very \"TBD\" until Sony knew if GTA would hit this year and this date gives Wolverine a bit of room before it comes out.",
                "author": "gambra"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VSCOOPER: SNK is developing a connected Fatal Fury / King of Fighters Film & TV universe An \"Arcane\" level reboot centered on turning Southtown into a mythic warzone. Featuring Terry, Andy, and Geese, with deeper drama and lore redefinition Studio deals are in progress",
        "score": 186,
        "text_content": "Link to tweet : https://xcancel.com/thevscooper/status/2026341357057626359?t=Gh138MX8xuc8xyyi07sfEg&s=19",
        "comments": [
            {
                "raw_content": "I love when they have these bold universe ideas mapped out before they’ve even done the first project.",
                "author": "Robsonmonkey"
            },
            {
                "raw_content": "Bro between Ronaldo and the AI ad for Season 2, I'm finding it exceedingly hard to be excited for anything SNK-related.",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Maybe it's different in Japan, but nobody in the USA gives a fuck about SNK enough to justify this. This smells like some executive looking at riot and going \"let's just do that\".",
                "author": "RogueLightMyFire"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The 30-Year Trap: Why the American Dream is mathematically broken in 2026.",
        "score": 102,
        "text_content": "We are constantly told that buying a home is the \"smartest financial decision\" you'll ever make. But looking at the macro data, it looks more like a liability trap for the middle class. I ran the math on the \"Silent Depression\" of homeownership. If you buy a $400k home today, you have to appreciate by nearly $1 MILLION just to break even on the unrecoverable costs (interest, taxes, insurance, repairs) over 30 years. Meanwhile, the S&P 500 has historically crushed real estate appreciation (7% vs 1.1% real return). By tying up your liquidity in a house, you are losing the one thing that actually builds wealth: compound interest on productive assets. I documented the \"Great Escape\" from this trap and the hidden history of money here: [https://youtu.be/GX7541rK5mI?si=EsEKgoPqKdrcO9vz](https://youtu.be/GX7541rK5mI?si=EsEKgoPqKdrcO9vz) Is anyone else planning to rent forever and just invest the difference, or is the FOMO too strong",
        "comments": [
            {
                "raw_content": "You do have to factor in rent not paid over 30 years, as well as the fact you can borrow money for a house, so its comparing a $400K house vs the $80-100K downpayment invested in the stock market. Also factor in Capital Gains tax on any sold stock",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "Counterpoint: the satisfaction and pride I get from owning and maintaining a place that is MINE, the security of knowing with 100% certainty where I will be living in 5-10 years barring a disaster, etc— is priceless. I get way more out of living in & enjoying my own home, vs renting & dumping all my money in the stock market (which also is not a guaranteed return btw.) Would also like to point out that very very few people are going to be disciplined enough over the course of 30 years to consistently invest money that they’d otherwise be putting into a house",
                "author": "thuwa791"
            },
            {
                "raw_content": "I feel like Reddit likes pushing a defeatist narrative and lots of users love it because it’s the easy path",
                "author": "suspicious_hyperlink"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nearly 1 in 7 Home Sales Are Falling Through, a Record For This Time of Year (dating back to 2017)",
        "score": 164,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I recently cancelled a contract after inspections. There were some items we asked for credits for and the seller didn’t make an effort to negotiate. We really loved the house but we had other options available. That home has been on the market for 3 months since we cancelled. I think sellers are stuck in the post Covid mindset where multiple buyers will outbid each other and that’s just not the case. They lost the sale over a couple grand. I’m sure they’ll regret it if they stay on the market for anymore length of time.",
                "author": "vwblazer"
            },
            {
                "raw_content": "Home-purchase agreements are canceled at the highest rate in San Antonio, where sellers outnumber buyers two to one–giving buyers the upper hand and plenty of choices. Nearly 40,000 home-sale agreements nationwide were canceled in January, equal to 13.7% of homes that went under contract that month. That’s up from 13.1% a year earlier, and the highest January share in records dating back to 2017. This is based on a Redfin analysis of MLS pending-sales data. The data is seasonal; typically, there’s a higher share of cancellations at the end of the year and a lower share in the spring. That’s why we compare this January to past Januarys. Please note: Homes that fell out of contract during a given month didn’t necessarily go under contract that same month. This data is subject to revision. Sales are falling through at a higher rate than in the past largely because it’s a buyer’s market, with hundreds of thousands more U.S. home sellers than buyers. That gives buyers negotiating power; they may back out during the inspection period if they see a home they like better or an inspection issue arises. Another major reason buyers are backing out of deals is financial uncertainty. While housing costs have come down from their peak, they are still near historic highs. Some would-be buyers are canceling purchases because they’re getting jittery about buying a house when they’re anxious about things like layoffs, tariffs and geopolitical tensions. “More buyers are backing out,” said Alin Glogovicean, a Redfin Premier agent in Los Angeles, where 16.7% of home purchase agreements were cancelled in January, up from 15% a year earlier. “They’re second-guessing the wisdom of making a huge purchase when there’s a fear in the back of their mind about the state of the economy and the uncertainty of their finances. That’s particularly true when they’re first-time buyers who don’t have equity from a previous home sale, and they’re using most or all of their savings on a down payment.” San Antonio, Atlanta Have the Highest Cancellation Rates, Bay Area Has the Lowest In San Antonio, more than one in five (21.2%) home-purchase agreements were canceled in January, the highest share of the 47 major U.S. metros Redfin analyzed. It’s followed by Atlanta (18.5%) and Cleveland (17.9%). Riverside, CA (17.5%) and Orlando, FL (17.3%) round out the top five. Cancellations are especially common in those places largely because they’re mostly buyer’s markets, with many more home sellers than buyers, giving buyers the option to back out of deals and move on to the next house. In San Antonio, for instance, there are twice as many sellers as buyers, and in Atlanta, there are 80% more. On the other end of the spectrum, just 3.5% of home-purchase agreements in San Francisco were canceled in January, the lowest share of the metros Redfin analyzed. It’s followed by Nassau County, NY (4.8%), San Jose, CA (5.3%), Milwaukee (7.6%) and Oakland, CA (8.4%). Contract Cancellations Are on the Rise in Most Metros Contract cancellations increased most in San Antonio, rising from 15.6% last January to 21.2% this year. Next come Cleveland (17.9%, up from 14.9%) and San Jose, CA (5.3%, up from 2.9%). The share of home-purchase cancellations fell year over year in 11 of the metros in this analysis. The biggest decline was in Tampa, FL (15.1%, down from 17%). It’s followed by Milwaukee (7.6%, down from 9.3%) and Nassau County, NY (4.8%, down from 6.4%).",
                "author": "SnortingElk"
            },
            {
                "raw_content": "When there's blood in the streets buy real estate!",
                "author": "ElvisDumbledore"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, February 24, 2026: Another new low (5.76% 30-year fixed)",
        "score": 31,
        "text_content": "Mortgage rates are dropping like a rock.",
        "comments": [
            {
                "raw_content": "I dated the rate, a 30 year, broke up with it 6 months later and started going with a much lower, younger 20 year rate!",
                "author": "zorg-18082"
            },
            {
                "raw_content": "I just refinanced a month ago ago but if these rates keep going down I’m gonna have to do it again",
                "author": "Outside-Pie-7262"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Single-family construction slowed measurably in 2025, new data shows",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Builders are taking note. Completions up for 2025 but not looking good going forward for more SFH construction. - Single-family starts declined by 6.9% in 2025 - Single-family permits in 2025 totaled 909,600, down 7.4% from the previous year. https://www.realtor.com/research/new-home-construction-december-2025/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Drop to Lowest Level Since 2022, Handing Homebuyers More Purchasing Power",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Housing to the moon 🚀 /s",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "No. Wage and job stagnation, paired with sellers attempting to squeeze every dollar out of the move to lower rates, means nothing has changed.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "Click bait headline. We saw lower rates than this in 2023 and 2024 for a brief time. Also rates have been range bound since 2023, and still is. The only thing I’ll give it is that rates have stayed more stable with a little bit of a downtrend signal.",
                "author": "MarcoVinicius"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FHFA: U.S. House Prices Rise 1.8% Year over Year",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty standard appreciation in normal times. Absolutely manageable, prior to 2020. Now, adding fuel to a fire.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "Washington, D.C. – U.S. house prices rose 1.8 percent between the fourth quarter of 2024 and the fourth quarter of 2025, according to the U.S. Federal Housing (FHFA) House Price Index (FHFA HPI®). House prices for the fourth quarter of 2025 rose 0.8 percent compared to the third quarter of 2025. FHFA’s seasonally adjusted monthly index for December rose 0.1 percent from November. Significant Findings - Nationally, the U.S. housing market has experienced positive annual appreciation each quarter since the start of 2012. - House prices rose in 41 states between the fourth quarter of 2024 and the fourth quarter of 2025. The five states with the highest annual appreciation were 1) North Dakota, 6.4 percent; 2) Delaware, 6.3 percent; 3) Illinois, 6.1 percent; 4) Wisconsin, 5.7 percent; and 5) Michigan, 5.5 percent. House prices were down in nine states and the District of Columbia. Florida experienced the most significant price decline at 2.7 percent. - House prices rose in 66 of the 100 largest metropolitan areas over the previous four quarters. The annual price increase was the greatest in Allentown-Bethlehem-Easton, PA-NJ at 8.9 percent. The metropolitan area that experienced the most significant price decline was Cape Coral-Fort Myers, FL at 9.1 percent. - Six of the nine census divisions had positive house price changes year-over-year. The East North Central division recorded the strongest appreciation, posting a 5.0 percent increase from the fourth quarter of 2024 to the fourth quarter of 2025. The Mountain division recorded a 0.2 percent decline. - Trends in the Top 100 Metropolitan Statistical Areas are available in our interactive dashboard: https://www.fhfa.gov/data/dashboard/fhfa-hpi-top-100-metro-area-rankings. The first tab displays rankings, and the second tab offers charts. The FHFA HPI is a comprehensive collection of publicly available house price indexes that measure changes in single-family home values based on data that extend back to the mid-1970s from all 50 states and over 400 American cities. It incorporates tens of millions of home sales and offers insights about house price changes at the national, census division, state, metro area, county, ZIP code, and census tract levels. FHFA uses a fully transparent methodology based upon a weighted, repeat-sales statistical technique to analyze house price transaction data. FHFA releases HPI data and reports quarterly and monthly. The flagship FHFA HPI uses seasonally adjusted, purchase-only data from Fannie Mae and Freddie Mac. Additional indexes use other data including refinances, mortgages insured by the Federal Housing Administration, and real property records. All the indexes (including their historic values) and information about future HPI release dates are available on FHFA’s website: https://www.fhfa.gov/HPI. Tables and graphs showing home price statistics for metropolitan areas, states, census divisions, and the United States are included on the following pages.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Lot of great graphs and table figures in this 39 pg doc https://www.fhfa.gov/document/d/hpi/fhfa-house-price-index-report-2025q4",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.3% year-over-year in December",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "- The S&P Cotality Case-Shiller U.S. National Home Price NSA Index posted a 1.3% annual gain for December 2025, down from a 1.4% rise in the previous month. - Inflation outpaced home price appreciation from June 2025 onward, eroding real home values through year-end and reversing a decade-long trend of positive real returns. - Geographic divergence widened sharply: Chicago and New York led all markets with gains above 5%, while Tampa, Phoenix, Dallas, and Miami posted the steepest declines among markets that finished the year in negative territory. ANALYSIS “With December's results, we can now assess 2025's full-year performance in historical context,” said Nicholas Godec, CFA, CAIA, CIPM, Head of Fixed Income Tradables & Commodities at S&P Dow Jones Indices. \"National home prices grew just 1.3% for the year — the weakest full-year gain since 2011, when prices fell 3.9%, and 5.3 percentage points below the 6.6% 10-year annual average. Even excluding 2021's near-20% Covid-era surge, the 10-year average annual gain stands at 5.2%, still 3.9 percentage points ahead of this year's result. “Two structural forces have reshaped the market over recent years: mortgage rates and inflation,” Godec continued. \"The 30-year mortgage rate closed 2025 at 6.2%, well above the 4.8% 10-year average and a sharp contrast to the 3.9% average that prevailed from 2016 through 2020. Meanwhile, annual inflation for 2025 came in at 2.7% — modestly below the 3.1% 10-year average — but still outpaced home price appreciation by 1.4 percentage points, effectively eroding real home values for most owners. This marks a notable reversal: Over the prior decade, national home prices outpaced inflation by 3.7 percentage points annually, a dynamic that has quietly reversed, with real home price returns turning negative in June 2025. “Decomposing 2025 price returns reveals a year of two halves,\" Godec concluded. \"The first six months saw prices rise 2.6%, while the back half delivered nominal declines of 1.3% — and every one of the 20 tracked metro areas posted negative price returns over that same period. At the city level, Chicago (+5.3%), New York (+5.1%), Cleveland (+4.0%), and Minneapolis (+2.7%) led all markets for the full year, while Tampa (-2.9%), Denver (-2.1%), Phoenix (-1.5%), Dallas (-1.5%), and Miami (-1.5%) posted the steepest declines. This geographic divergence reflects the broader reordering underway: Historically steady Midwest and Northeast markets continued to outperform as Sun Belt markets that surged during the pandemic cycle extended their correction.” YEAR-OVER-YEAR The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 1.3% annual gain for December. The 10-City Composite saw an annual increase of 1.9%, down from a 2.0% increase in the previous month. The 20-City Composite posted a year-over-year increase of 1.4%, in line with the previous month. Chicago reported the highest annual gain among the 20 cities with a 5.3% increase in December, followed by New York and Cleveland with annual increases of 5.1% and 4.0%, respectively. Tampa posted the lowest return in December, falling 2.9%. The chart below compares year-over-year returns for different housing price ranges (tiers) in Chicago. MONTH-OVER-MONTH The pre-seasonally adjusted U.S. National Index saw a drop of 0.3%, and both the 10-City Composite and the 20-City Composite Indices decreased 0.1%. After seasonal adjustment, the U.S. National Index reported a monthly increase of 0.4%, and both the 10-City Composite and 20-City Composite Indices posted month-over-month gains of 0.5%. SUPPORTING DATA The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, which covers all nine U.S. census divisions, recorded a 1.3% annual increase in December 2025. The 10-City and 20-City Composites reported year-over-year increases of 1.9% and 1.4%, respectively.The chart below depicts the annual returns of the U.S. National, 10-City Composite, and 20-City Composite Home Price Indices. https://www.spglobal.com/spdji/en/documents/index-news-and-announcements/CSHomePrice_Release_0224.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I've read that prices and regions are like other asset markets now. By that I mean that expensive homes, similar to expensive stocks, are often still increasing because the usually older, but any wealthy demographic still has disposable income and theyr'e doing most of the spending, and therefore can still push expensive properties, like stocks, higher. Last year the average homebuyer was 59, I think. That seems nuts. Can anyone confirm this - bifurcation by property value? I guess it could also be common at or near the peak of a cycle, if that's the case now - higher rates and record prices. I quit following the market closely but I'm interested in economic patterns. I just don't have the time or resources to conduct this kind of research myself. Most of the available housing data we get, like this national price index, is aggregate data and doesn't break down these kinds of unique trends. If this theory is true, it means competition at the low and mid range of the market could be more price sensitive and therefore more responsive to changing market conditions and pre-financialization of the industry, such as historic wage to home price values. That's good for lower wages and FTB's, unless the properties are picked off by investors - who own 25% of US SFH's right now. This should be disincentivized, IMO. For the very richest, they're just not as impacted through any cycle, all things considered, and they've never been doing so well anyway. That could keep aggregate figures high, and for longer, while specific regions and the low to mid end could see greater price corrections. I don't really know. I'm curious to find out though.",
                "author": "h4ms4ndwich11"
            },
            {
                "raw_content": "Now do inflation",
                "author": "WrongThinkBadSpeak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seedance 2.0: Neo vs Agent Smith, The Matrix",
        "score": 989,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can’t say I hated that.",
                "author": "mop_bucket_bingo"
            },
            {
                "raw_content": "Can we remake the entire last season of Game of Thrones?",
                "author": "Furiousguy79"
            },
            {
                "raw_content": "Honestly it's already so good now that it's less about making the technology better and more about finding ways to integrate it in current workflows.",
                "author": "EmptyVolition242"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Chinese researchers have found the cause of hallucinations in LLMs",
        "score": 176,
        "text_content": "https://arxiv.org/abs/2512.01797 Abstract: Large language models (LLMs) frequently generate hallucinations – plausible but factually incorrect outputs – undermining their reliability. While prior work has examined hallucinations from macroscopic perspectives such as training data and objectives, the underlying neuron-level mechanisms remain largely unexplored. In this paper, we conduct a systematic investigation into hallucination-associated neurons (H-Neurons) in LLMs from three perspectives: identification, behavioral impact, and origins. Regarding their identification, we demonstrate that a remark-ably sparse subset of neurons (less than 0.1% of total neurons) can reliably predict hallucination occurrences, with strong generalization across diverse scenarios. In terms of behavioral impact, controlled interventions reveal that these neurons are causally linked to over-compliance behaviors. Concerning their origins, we trace these neurons back to the pre-trained base models and find that these neurons remain predictive for hallucination detection, indicating they emerge during pre-training. Our findings bridge macroscopic behavioral patterns with microscopic neural mechanisms, offering insights for developing more reliable LLMs.",
        "comments": [
            {
                "raw_content": "We've also been incentivizing them to hallucinate during training. You know how when you're taking a multiple choice test and you run into a problem where you're not sure? Do you leave the answer blank and guarantee getting it wrong? No, you take a guess. They increase their benchmark scores overall when they guess and sound confident about it. None of us actually behave that way outside of a test environment, but the LLMs don't know any better. They're out here in the real world still behaving as though they're gaming a test.",
                "author": "AlarmedGibbon"
            },
            {
                "raw_content": "“You’re right - that’s exactly the kind of insight that proves inference is necessary.”",
                "author": "kootrtt"
            },
            {
                "raw_content": "Press X to doubt. Hallucinations are not well defined for this case. If someone said they found the neuronal cause of being wrong I would think they're utterly confused. Similarly here.",
                "author": "Tough-Comparison-779"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bullshit Benchmark - A benchmark for testing whether models identify and push back on nonsensical prompts instead of confidently answering them",
        "score": 618,
        "text_content": "https://x.com/scaling01/status/2026398199993258428?s=46",
        "comments": [
            {
                "raw_content": "Oh, there are three colors, wonder what they mean... *Looks at labels*: \"Categories: Green, Amber, Red\" Oh, that explains nothing.",
                "author": "suamai"
            },
            {
                "raw_content": "Gemini has a tendency to answer bs prompts with sarcasm, as evidenced by the car wash test. I wonder if that’s why it’s rated so low.",
                "author": "MangusCarlsen"
            },
            {
                "raw_content": "we desperately need more benchmarks like this. half the existing ones are basically testing whether the model memorized the training data. testing if it can detect bs is way more useful for real world use",
                "author": "AppropriateDrama8008"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree introduces Unitree AS2: AI-powered robot dog carries 143 pounds, runs 11 mph with LiDAR",
        "score": 84,
        "text_content": "Robotics firm Unitree Robotics has unveiled the vAs2, a high-performance quadruped robot built for speed, payload strength and advanced autonomous capabilities. **The key features of this model include:** **Exceptional Payload:** It can support a standing load of up to 65 kg (approx. 143 lbs) and a continuous walking payload of 15 kg. **High-Speed Performance:** It reaches a top running speed of 5 m/s (approx. 11 mph), making it highly agile for industrial tasks. **Superior Torque:** The robot is equipped with motors delivering a 90 N·m peak joint torque, providing a high torque-to-weight ratio for its 18 kg body. **Advanced Sensing:** It utilizes a 4D LiDAR system (with 360°x90° coverage) for ultra-wide environmental recognition and obstacle avoidance. **Source:** [Unitree](https://x.com/i/status/2026221314676228580)",
        "comments": [
            {
                "raw_content": "![gif](giphy|jpKBqEU9qdfaZxQj6p)",
                "author": "Armageddonn_mkd"
            },
            {
                "raw_content": "I would like 4 of these with a throne on a platform.",
                "author": "nederino"
            },
            {
                "raw_content": "Range?",
                "author": "BalancedTidings"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic has no intention of easing restrictions, per Reuters",
        "score": 251,
        "text_content": "https://www.reuters.com/world/anthropic-digs-heels-dispute-with-pentagon-source-says-2026-02-24/",
        "comments": [
            {
                "raw_content": "Healthy mindset. Hope they go the same route when it comes to privacy.",
                "author": "BlueberryWorried6493"
            },
            {
                "raw_content": ">During the meeting, Hegseth delivered an ultimatum to Anthropic: get on board or the government would take drastic action, people familiar with the matter said. The options included labeling Anthropic as a supply-chain risk or have the Pentagon invoke a law, the Defense Production Act, that would force Anthropic to change its rules, the people said. Pathetic. American rants about the CCP controlling Chinese businesses were always nothing more than a projection.",
                "author": "Evermoving-"
            },
            {
                "raw_content": "If Anthropic actually holds to this, I'm shifting all my subscriptions and usage over to them. Claude Code already kicks enough ass to justify it on its own, this is just the icing on the cake.",
                "author": "Saedeas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic believes RSI (recursive self improvement) could arrive “as soon as early 2027”",
        "score": 301,
        "text_content": "[https://www.anthropic.com/responsible-scaling-policy/roadmap](https://www.anthropic.com/responsible-scaling-policy/roadmap) \\>We believe that AI models could, in the next few years, have a broad range of capabilities that exceed human capabilities. In particular, most or all of the work needed to advance research and development in key domains - from robotics to energy to cyberwarfare to AI R&D itself - may become automatable.\" so ASI in the next few years according to their roadmap",
        "comments": [
            {
                "raw_content": "I already had RSI years ago, although that was repetitive strain injuries, which are not as lucrative.",
                "author": "Olobnion"
            },
            {
                "raw_content": "![gif](giphy|OCu7zWojqFA1W)",
                "author": "DanOhMiiite"
            },
            {
                "raw_content": "![gif](giphy|VG1tHuNQhF0KhHSaEe)",
                "author": "NoSignificance152"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jian Yang launches “Not Claude”",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|3o7qDDquZ5Yi4ZlJ4I)",
                "author": "A380085"
            },
            {
                "raw_content": "He knows what claude's answers are because he knows what they aren't",
                "author": "jimmystar889"
            },
            {
                "raw_content": "OpenHotDog",
                "author": "fluffywabbit88"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "‘It’s going to be painful for a lot of people’: Software engineers could go extinct this year, says Claude Code creator",
        "score": 278,
        "text_content": "“I think by the end of the year, everyone is going to be a product manager, and everyone codes. The title software engineer is going to start to go away,” Cherny said recently on [an episode](https://www.youtube.com/watch?v=We7BZVKbCVw) of *Lenny’s Podcast*, hosted by Lenny Rachitsky. “It’s just going to be replaced by ‘builder,’ and it’s going to be painful for a lot of people.” Cherny knows this in part because Claude Code has written 100% of his code for months. Originally designed as a side project, Cherny developed Claude Code while working in Anthropic’s Bell Labs-style experimental division. The tool was quickly adopted by engineers internally, before it was released to the public. “I have not edited a single line by hand since November,” he said, explaining that he still checks the code. “I don’t think we’re at the point where you can be totally hands-off, especially when there’s a lot of people running the program. You have to make sure that it’s correct, you have to make sure it’s safe.” Cherny predicts that many other companies and coders will have Claude write all of their code by the end of this year, too.",
        "comments": [
            {
                "raw_content": "I’m getting hype fatigue….",
                "author": "Khaaaaannnn"
            },
            {
                "raw_content": "I use Claude Code all day. The guy paying me to do it isn't going to use Claude Code all day.",
                "author": "gthing"
            },
            {
                "raw_content": "Surely an impact, a big impact even but a complete wipeout it's completely overblown. However, if this does something in motivating governments into doing something to allow a smoother transition to wherever the heck we're going with this will be great.",
                "author": "slackermannn"
            }
        ],
        "subreddit": "singularity"
    }
]