[
    {
        "post_name": "🚨 BREAKING: SH0TS are ringing out in Washington, DC’s Navy Yard, less than ONE MILE from the Capitol Building! Over 100 black teens have taken over the park, terrorizing the neighborhood",
        "score": 562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad to see strict gun laws are successfully keeping only criminals armed.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "I'm fatigued, boss.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "More than 6% black in an area....you're fucked.",
                "author": "Mindcrym"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NO MORE KINGS IN CONGRESS 👑",
        "score": 513,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Congress needs term limits",
                "author": "FearGodTheAlmighty"
            },
            {
                "raw_content": "If anyone has earned their right to be the President for as many terms as he wants to run for it, it’s Trump🇺🇸❤️🍊. It wasn’t in the original Constitution for a reason. He’s the voice of the people and capping it was silencing the speech of regular folks. The President should know when to step down, and do so, and if it’s right for the country for him to run once or twice more he should be able to.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "I'm not sure term limits will fix anything. I'm not sure restriction of the executive branch to two terms is a good idea.",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "One of the best names for a bill ever to grace the US Congress is the Preventing Elected Leaders from Owning Securities and Investments, or the Pelosi Act. It just advanced through senate committee 8-7 as the Honest Act, but it will forever be known as Pelosi Act. Let’s go!!",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nancy is a fucking demon reincarnated in flesh. And her hammer time husband.",
                "author": "DeportThemAllForever"
            },
            {
                "raw_content": "Nancy will drink to that. 🍷",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Shouldn’t be a surprise to anymore, Obama and his contemporary RINOs re-legalized insider trading shortly after he made it illegal. There was a lot of media coverage when Obama banned insider stock trading in 2012, but he really quietly reversed it just a year later with the help of the Republican led house. If you try to search for the STOCK Act you mostly get results celebrating the 2012 signing but nothing regarding the later modification unless you really narrow down your search. https://archive.ph/EhqA2 https://archive.ph/8Tiwv >A year ago, President Obama signed the Stop Trading on Congressional Knowledge Act into law at a celebratory ceremony attended by a bipartisan cast of lawmakers.\\ \\ \"I want to thank all the members of Congress who came together and worked to get this done,\" he said.\\ \\ …\\ \\ But on Monday, when the president signed a bill reversing big pieces of the law, the emailed announcement was one sentence long. There was no fanfare last week either, when the Senate and then the House passed the bill in largely empty chambers using a fast-track procedure known as unanimous consent.\\ \\ **In the House, Majority Leader Eric Cantor, R-Va., shepherded the bill through. It was Friday afternoon at 12:52. Many members had already left for the weekend or were on their way out. The whole process took only 30 seconds. There was no debate.** That last bit is the most infuriating. Every bit of it. Them leaving work before 1pm on a Friday, votes after lots of people were gone, no debate, no discussion, no publicity. You don’t hate the RINOs enough.",
                "author": "POTUS_DonnieJ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Valentina Gomez crashes a Beto O’Rourke rally giving no f*cks",
        "score": 1104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A real Latina against a faggot wanna be",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Has Beto ever won an election? He seems unelectable even for Democrats",
                "author": "geckogreen"
            },
            {
                "raw_content": "Beta O'shit is trying to incite his supporters to spark a Civil War.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Beto O’Rourke vows to give amnesty to all illegal aliens next time Democrats are in power",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This guy does more for Republicans than most Republicans",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "ain't gonna be a next time beta",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "That sounds like a threat.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a deranged and profane rant, Chronic Loser Beto O'Rourke calls Republicans \"fascists\" and tells Democrat states to redraw their districts now. \"Fuck the rules, we are going to win whatever it takes.\"",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No rules. Existential battle. Got it.",
                "author": "seeling0"
            },
            {
                "raw_content": "The Democrats have no State they can gerrymander anymore they already did it in 2020 they're out of cards Biddle O'Rourke is a fucking douchebag blow hard.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "The best thing about beto is that he has no filter and tells us exactly what he would do if he ever gets in office. Anyone remember \"hell yes we're going to take your guns!\"",
                "author": "BasedProf1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hospitals are full of sick people and I'm not referring to patients.",
        "score": 1210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People should be very afraid about going to the hospital. If it's not the danger of being medicated wrong and dying from adverse effects or getting a secondary infection completely unrelated to what you went in for and dying from that you might end up under the care of some psychopath that either wants you to die or some new age nut job nurse that thinks they can cure you without the doctor's help.",
                "author": "RusherOfDin"
            },
            {
                "raw_content": "If you need ER care, I mean *real* ER care like you have crush wounds from a car accident, not you're an illegal with the sniffles, American hospitals provide some of the very best care in the world. Our emergency medicine is top notch. But they must be AVOIDED for anything else if at all possible. This has been confirmed by my own family's experiences and by family and friends who are RNs, CNPs, and M.D.s. All of them are over 45 years old and say that medical care is nothing like it was when they were in med school. People got into the medical field who should never have and would have been screened out in years past. If you must be hospitalized, look for providers who are 50+ and white. Don't feel bad or guilty about asking for a second or third opinion until you get the providers you want. It's your care and totally up to you to dictate - NOT them. YOU have to live with your health care decisions. They do not. It's bad out there.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "I haven’t been to a doctor in years and I feel great.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC Mayor Adams vs. the far-left City Council: 14 vetoes on bills ‘defying common sense’ and counting",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're trying to install far left socialists on the Philly City Council also using fraud. There are three Sorosbots funded by the Tides Foundation in something that is straight DSA socialism called \"The Working Families Party,\"",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "This is what happens when Trump gives you permission to not be a faggot.",
                "author": "RFKJrsVocalChords"
            },
            {
                "raw_content": "Thats why they want to install the socialist. Adams somehow is the voice of reason in NYC and its crazy.",
                "author": "inksday"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Warren: What Zohran is saying is 'I want people to be able to afford to live in NYC' Reporter: But raising taxes in order to do it? Warren: Oh my goodness! Oh dear! Are you worried that billionaires are going to go hungry?",
        "score": 857,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She's not that stupid, which means she's a liar / propagandist.",
                "author": "SqRt7744"
            },
            {
                "raw_content": "The billionaires won't go hungry. They'll pack up and move.",
                "author": "presticus"
            },
            {
                "raw_content": "Zohran is jealous of rich powerful alphas like Trump",
                "author": "pollsarefake"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I want ICE to leave the Home Depot parking lots and raid the tech companies instead. I want to see 50 flights per day leaving all international US airports bound for India.\"",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And with 10k more agents online by next year they can do both.. So cheer up and keep calling in the reports to the ICE hotlines..",
                "author": "roadrunner0"
            },
            {
                "raw_content": "Nah!…Do *both*.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "Why not do both.",
                "author": "Captinhowdy45"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former FBI employees are warning that mass firings have begun at the bureau.",
        "score": 1492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "punkalicious"
            },
            {
                "raw_content": "If you kneeled for BLM... FIRED! If you walk in pride parades... FIRED!",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Waiting for mass prosecutions.",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Six suspects indicted on assault, aggravated riot charges over brutal Cincinnati mob beating. If convicted on all counts, each suspect faces nearly 30 years in prison.",
        "score": 1520,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Examples need to be made.",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "If HATE CRIME isn't being charged than why have them?",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "And yet, no federal hate crime charges for this racially motivated, savage attack.",
                "author": "bill_in_texas"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats issue a new warning to MAGA - that Gavin Newsom will become president and bring “payback” for all that President Trump has done.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine thinking this faggot being in power is a good thing. Pure retardation",
                "author": "LowEnergyFaggot"
            },
            {
                "raw_content": "Not if he gets prosecuted first.",
                "author": "HoganP"
            },
            {
                "raw_content": "Lol… not without cheating… and Trump is making sure they can’t cheat. There won’t be enough illegals here for them to cheat!",
                "author": "Texar1991"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am woman, hear me ROAR!",
        "score": 864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His mother is how he ended up this retarded and gay.",
                "author": "AgnesDomini"
            },
            {
                "raw_content": "Lol, zero awareness that HE still 100% looks like a male. Not just male, but one of those weak preys on kids males. Top kek",
                "author": "FattestConsequence"
            },
            {
                "raw_content": "He's going through a lot of effort to pretend not to be a faggot.",
                "author": "AbrahamLincoln"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep MTG: I am not paying to rebuild Ukraine. I am not paying to rebuild Gaza. I am not paying to kill foreigners in foreign wars.",
        "score": 594,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unless she is opted out of paying taxes, she will continue to finance it and love it. President Trump should have pulled the plug on Ukraine. Gaza is not our problem either.",
                "author": "Patriot4TN"
            },
            {
                "raw_content": "Damn ,she almost copy and pasted comments from us pedes and pederellas. Kudos for that. Keep going. Please copy and paste my retarded takes about the faggots ,commies and traitors. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "The war would end today if Trump would pull all support for Zelensky. It would be over. This pisses me off.",
                "author": "MemphisMontoya71"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We have 40 months to keep Democrats from staying in power forever",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are powers & principalities older than humanity joining the game now. They have been trying to kick the can down the road for 2,000 years, but God is about to force their hand. They know they can't win, but their goal is to wound God, by taking you with them into the outer darkness. Because God loves you so much.",
                "author": "Melchizedek18"
            },
            {
                "raw_content": "Less, until mid terms.",
                "author": "Scumbag-reddit"
            },
            {
                "raw_content": "I predict Soros will be settled into his dirt nap by then, he turns 95 next week.",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IRS Commissioner Billy Long was fired hours after refusing to give DHS taxpayer data on suspected undocumented immigrants",
        "score": 1509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, prosecute him for aiding and abetting too.",
                "author": "inksday"
            },
            {
                "raw_content": "IMO this clearly exposes the fact that filing taxes is a direct violation of your 5th amendment right. They have been using tax filing information for criminal investigative purposes even though they expressly tell you otherwise THIS ENTIRE TIME.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "so who exactly vouched for this cocksucker in the first place? who is putting these traitors forward to Trump? Loomer's uncovering them as fast as a single person can, but it;s clearly not enough...",
                "author": "Scuffers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am pleased to announce that I am nominating Tammy Bruce, a Great Patriot, Television Personality, and Bestselling Author, as our next Deputy Representative of the United States to the United Nations, with the rank of Ambassador.",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She is the woman who said Israel is the greatest nation on earth.",
                "author": "unotrumpcard"
            },
            {
                "raw_content": "[\"America is the greatest nation on earth, next to Israel.\"](https://twitter.com/kenklippenstein/status/1936914515955728442) ~Tammy Bruce",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Californian Feminist Lesbian \"former\" Democrat, who never had a Father in her life. Was in an relationship with a 34 yr old Hollywood actress at the age of 17, who later killed herself. President of the National Organization for Women to push what do you know abortion womens rights for 7 years. Great pick..",
                "author": "ebeezy705"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Explain to me …",
        "score": 457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "not only that but every week your dollar is worth less",
                "author": "twentytwentyfourr"
            },
            {
                "raw_content": "The massive solar and wind farms are probably a chunk of it. That bulbs are a negligible part of most people's power bill is another. HVAC is the lion's share, and though the tech got better, the freon has gotten worse to compensate. That businesses never lower prices without being undercut is another, and power companies usually have either a captive or semi-captive customer base. If someone invents cheap home natural gas generators that have efficiency that approaches within 90% of a big central commercial one, then I bet your electricity bill comes down.",
                "author": "tralbolh"
            },
            {
                "raw_content": "Our bill went up 150%. We're going to struggle.",
                "author": "Websitesdown"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy 10th anniversary to those who celebrate",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmmm... it's our 10th anniversary, too.",
                "author": "danneskjold"
            },
            {
                "raw_content": "https://x.com/TRHLofficial/status/1954251966202171704 I hope the never Trumpers start every day requiring a breakfast of Pepto and blood pressure pills.",
                "author": "HoganP"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump announces 100% tariff on computer chips. Here's what it could mean for your wallet.",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It sounds like all the big companies have an \"out\" in one form or another, but the small ones are going to get fucked.",
                "author": "Exist50"
            },
            {
                "raw_content": "We need to stop calling them tariff's, which is jargon to obscure what they really are: import taxes which the end consumer ultimately pays for.",
                "author": "NerdProcrastinating"
            },
            {
                "raw_content": "Like clockwork. Announced on a weekend, market tanks on Monday, all his buddies buy up stock, walk it back on Tuesday and profit when the market bounces back.",
                "author": "F9-0021"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's confusing 'Series 2' CPU brand is a massive step backwards (Core 7 240H \"Series 2\" is RPL)",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there like a chart or some visual representation that explains Intel's new naming scheme. I still don't get it exactly. Intel's new naming scheme and AMDs laptop naming scheme are so shitty",
                "author": "UnifiedBruh"
            },
            {
                "raw_content": "probably the same people are coming up with naming at openAI",
                "author": "szakee"
            },
            {
                "raw_content": "Intel's own product page clarifies that it is Raptor Lake, but in my mind the \"non-ultra\" 200 Series should have been reserved for Meteor Lake? https://www.intel.com/content/www/us/en/products/sku/241653/intel-core-7-processor-240h-24m-cache-up-to-5-20-ghz/specifications.html See like Series 2 could mean that the CPU is N-2, or maybe not?",
                "author": "Stennan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Best SSD for Gaming 2025: PCIe 5.0 vs 4.0 vs 3.0 vs SATA vs HDD",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really appreciate them benchmarking all these load times Including throwing in TWO different hard drives so you can see the difference between a fast and slow HDD (tldr both are slow)",
                "author": "EasyRhino75"
            },
            {
                "raw_content": "Recently I installed and played Spider-man 2. What’s relevant is that when I started it up, the intro cutscene stuttered like crazy. Out of sync audio, characters t-posing and jittering as they struggled to load in fast enough, constant full freezes of video as audio played. I’m sure you can see where this is going. I was deeply peeved, wondering what combination of rogue drivers or hidden issue I might need to spend hours diagnosing. Then a tickle in my brain told me to look at which drive I’d installed the game to. Yup, one of my old but reliable backup HDDs meant for video and old games. Oops. An unforgettable example of how SSDs have gone beyond a suggestion for AAA games.",
                "author": "MrRoivas"
            },
            {
                "raw_content": "Doesn't surprise me to find HDDs are obsolete now and often a problem. Good to see SATA drives still hanging in there most of the time, I still have a 1TB WD one but mostly games are all on NVMe's drives these days. I would like to see a test of the various PCI-E 4/5 drives with highly comparing the 4k performance which I think is what dominates in practice most of the time and why PCI 3/4/5 rarely shows practical improvements. We have been stuck around 100MB/s 4k throughput for a while but cheap drives can be as bad as half the performance here even when capable of 7000MB/s sequentially. The game file verification is limited by the algorithm Steam uses being quite lowly threaded, the same limitations occur in the update algorithm and the backup and restore functionality as well.",
                "author": "BrightCandle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Nova Lake Mobile to feature up to 28 CPU cores (8P+16E+4LP) with 12 Xe3 GPU cores - VideoCardz.com",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Title is mashing 2 together here unless I'm grossly misreading something myself. Jaykihn says the NVL mobile skus are: > 2+0+4 CPU & 2 Xe Cores > 4+0+4 CPU & 4 Xe Cores > 4+8+4 CPU & 4 Xe Cores > 4+8+4 CPU & 12 Xe Cores > 8+16+4 CPU & 4 Xe Cores",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Looks like the U Series is becoming somewhat closer to V Series/Lunar Lake, no longer has E Cores (but still has LP E cores), and has more P cores versus last gen U Series I think that makes sense as long as Intel's P cores make a good leap in efficiency. Intel's LP E cores are still pretty powerful, so the loss of E cores shouldn't hurt?",
                "author": "Vince789"
            },
            {
                "raw_content": "Hello Geddagod! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fair warning if you use jeans when playing Drag x Drive",
        "score": 547,
        "text_content": "Didn't expect the fabric of my jeans to rub off onto my Joy-Con (and my fingers too). Thankfully it cleans off easily with electronic wipes, so just a heads up if you're playing the same way I did.",
        "comments": [
            {
                "raw_content": "If the dye from your blue jeans is bleeding onto the joycpns imagine where else it is ending up",
                "author": "bestray06"
            },
            {
                "raw_content": "What type of jeans do you use? I had no issues.,",
                "author": "zenru"
            },
            {
                "raw_content": "Have u tried jeans that match the switch blue in one leg and orange in the other?",
                "author": "dropkicksoul"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Drag x Drive is so much better than I was expecting",
        "score": 452,
        "text_content": "I don’t know how many people will agree with me, but I personally found the game to be extremely fun. It looked pretty soulless and boring from the initial direct. However, I’m pleasantly surprised. I’ve played 1.5 hrs at this point with the Joy-Cons on my legs, and it plays great. The controls feel exceptionally refined, and the haptics feel fantastic. The game itself is also surprisingly fun for being wheelchair basketball, and it’s very intense. I wasn’t expecting that at all. I’ve read some posts about people struggling to adapt to the controls and using the Joy-Cons, which makes sense considering how slender the controllers are. But playing on my leg with pants on made the game super comfortable for me. I was fully expecting Nintendo to charge $30-40, but $20 seems like a pretty decent ask to me. I might actually pick it up (once I get through my backlog, haha).",
        "comments": [
            {
                "raw_content": "For some reason I hadn't expected the haptics. The haptics feels really cool, when you drag the joycon, it feels like you are spinning the wheels, like you feel it rolling. That's really cool. The controls are really cool and I got used to them quick. If you brake with just one wheel you can execute some quick sharp turns. It's actually kind of tiring. This is a game you'll have to build up some stamina for. You can definitely burn some calories with this",
                "author": "sendhelp"
            },
            {
                "raw_content": "I agree. I'm having a ton of fun with it. The price tag seems appropriate. It's a little uncomfortable on my wrists after a while, though. I might just need a wider lap desk to play on. I'd be interested to hear what physical setups people find most comfortable while playing this.",
                "author": "F6Reliability"
            },
            {
                "raw_content": "I'm convinced that this is the Wii Sports Resort basketball game on steroids. I'm getting it now I don't care what anybody says",
                "author": "deoxir"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Master chief is ballin'",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they continue to expand the customization to this game. Also, adding different modes can help improve the game's longevity. - 3pt shooting competition - Relay race around the court - Trick shots - Plenty of other ideas (team or solo) This simply give players another option if they're not in the mood to play the main game mode.",
                "author": "WinterStarlightZone"
            },
            {
                "raw_content": "I don't like the user interface or art style of this game at all. It feels like they're trying to go for some 2000's halo type of digital screens motif, but it's too smooth and modern to look cool and have a sense of place in a wheelchair basketball game. With that such a niche sport, I would imagine there could be so much opportunity to explore a new, edgy, grungy, or fringe art style, to fit thematically with the off-the-wall idea that this game is in the first place. It also doesn't seem to have much variety in gameplay. Super bare bones looking software, where is the Nintendo charm? I'm tired of Nintendo introducing new, potentially innovative gimmicks to their controllers, then making these low stakes games to show them off with.",
                "author": "CicadaCarson"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NSO: ‘Wii Nintendo Classics’ Concept",
        "score": 220,
        "text_content": "This is my concept for a potential “Wii Nintendo Classics” addition to the Nintendo Switch Online subscription. The Wii is such a huge part of Nintendo’s legacy that I think it will inevitably join the program, so this is my take on what I think they would offer as well as what I’d hope to see! SELECTION OF INITIAL GAMES: A good variety of games including the mega hits such as ‘Wii Sports’ and ‘Mario Kart Wii’. Included ‘The Legend of Zelda: Twighlight Princess’ and ‘Super Mario Galaxy 2’ as to get a couple more 3D Zelda and 3D Marios playable on the system. There are so many amazing Wii games that are currently stuck on that system so this program would be amazing at finally replaying them. CONTROLLERS I think Nintendo should continue the tradition and offer a revamped Wii, Wii Sensor Bar, and Nunchuck. The technology is there to include gyro functionality in the shell of the original Wii Remote so no need for Wii Motion Plus, and the Wii Sensor Bar is dirt cheap to make so Nintendo could include it in every controller purchase. I also think Nintendo sees the nostalgic value in playing these games how they were intended to be played. Yes the Joy-Cons can operate with Wii Remote like functionality, however it is less than ideal. Still playable, but would have calibration issues in games such as the Metroid Prime Trilogy where aiming is constant. You can get around this if you include an extra input to “recalibrate” your aim to center, but the best solution would be offering an updated modern Wii controller setup. It’s a Win Win since Nintendo can charge a premium for it making money and the fans get to play the games the way they were intended. VISUAL ENHANCEMENTS: This is a pipe dream since GameCube doesn’t really offer anything special but alas. Would be great to see Nintendo put effort into this emulator and actually push these games to 4K. Unofficial emulators have managed this already and the Switch 2 has more than enough power to manage it. They could also improve the frame rates which would offer noticeable improvements to games such as Wii Sports, imagine playing that game at 120 fps for example, it wouldn’t just look better but in some cases would improve gameplay itself as the higher your fps the better motion controls feel. ONLINE PLAY: Continue to offer this as part of the service however actually invest in dedicated servers so the latency is actually playable. This is probably the most unrealistic part of this whole mockup.",
        "comments": [
            {
                "raw_content": "The more recent you get, the larger file sizes get. A Wii NSO would take up a lot of storage if you can’t choose which games you want to download",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "They didn't improve the framerate and only improved the resolution to 900p for GameCube games, so definitely don't expect 4K 120fps for Wii.",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "They shouldn’t make a new sensor bar. They should just make a Wii Remote than can handle accelerometer and gyro controls like Joy Cons. And then in the emulation it can translate the difference. Wii Sports also needs to be there on Day One. Would be really funny if it wasn’t.",
                "author": "caulrye"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kawhi Leonard Wins The Series At The Buzzer!",
        "score": 99,
        "text_content": "This game is fun but I'm afraid I'll become very toxic if I continue playing it lol",
        "comments": [
            {
                "raw_content": "![gif](giphy|QuUAMw3daPVlRyCjd0|downsized)",
                "author": "bowlofpasta92"
            },
            {
                "raw_content": "Yeahhhh, this was uncalled for. Sincerely, a Sixers fan : )",
                "author": "SuperSpetta"
            },
            {
                "raw_content": "Im struggling so much with this game man, the learning curve sucks and I don't like being this rough with my joycons😔",
                "author": "emtenta"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just 100% Dk after about 77 hours",
        "score": 22,
        "text_content": "What a game long game and just flat out master peace of a game. The final thing i had to do was hard probably spent like 10 hours on it no joke. I have not put so many hours into a game in such a short time sense zelda totk when I put like 230 hours into it in first like 2 months but also had a lot more free time than normal around than has I was on unemployment at the time. 100% I kind of want to cry. What am I supposed to do now lol",
        "comments": [
            {
                "raw_content": "Did you get all 1000 bananas?",
                "author": "lugerd"
            },
            {
                "raw_content": "Take a lil break before you dive into your next big one. Decompress from the experience a little bit- are there any games you're excited to dig into your back log or have any games you can just do some quick sessions on, e.g: rocket league, etc? Anyway, that's an amazing feat, I'm only about 10h in or so, just got delivery of the game earlier this week. Excited to dive in further :)",
                "author": "UnauthorizedGoose"
            },
            {
                "raw_content": "Play Tony Hawks 3+4 remakes. You have game mods which makes tricks etc. so much easier. First time I got into Tony Hawks,feels like a platformer at times with it's collectibles.",
                "author": "Safe-Elk7933"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden 26 Review From Nintendo Life",
        "score": 51,
        "text_content": "https://www.nintendolife.com/reviews/nintendo-switch-2/ea-sports-madden-nfl-26 This is sooooo awesome! I can’t wait to play it on Thursday. I am so excited. It’s been 10 years since I have really gotten back into Madden. So this will be great for me. The gameplay videos are also encouraging as the game looks really good on the Switch 2. Do any of you have it already? What are your thoughts?",
        "comments": [
            {
                "raw_content": "I have it and have played a ton of it already for the early access and it’s honestly a lot of fun .. the port overall could’ve and should’ve been better for sure but it’s not bad , and the gameplay is still very solid it’s great having Madden on the go",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "It isn’t 40 fps. Good vibes gaming did a framerate graph for it, and it is an unstable 30 Video: https://youtu.be/wpSHDeEBnlw?si=Q0i_w5KGFTkAuBNN For everyone downvoting, it is okay if 30 fps is good enough for you, but potential customers deserve to know that the game is 30 FPS.",
                "author": "Chuckles795"
            },
            {
                "raw_content": "Good game but I’ll wait for a sale. That’s basically my feeling.",
                "author": "StrangeIsntIt22"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Drag x Drive is live",
        "score": 518,
        "text_content": "Can’t wait to try it out! I’ll comment my thoughts after",
        "comments": [
            {
                "raw_content": "Not sure why, but I picked up the controls really fast. I can tell other players haven’t, yet. It’s so fun once you get the hang of it. Also, got rid of the arm/wrist ache by relaxing my arms and kinda playing on the sides of my legs. It feels much more natural. Not ideal to have to figure out an ergonomic way to play the game. Not easy either. Still, I’m enjoying it.",
                "author": "Haxishax"
            },
            {
                "raw_content": "Glad I got my fix while it was free. My main problem is the Joy Con 2 just aren't all that comfortable to hold in the position the game asks of you, so I really don't anticipate long play sessions being in the cards. It's fine for sure, but I don't see the online player base sticking around long enough for me to get my money's worth unfortunately.",
                "author": "bird_4_brains"
            },
            {
                "raw_content": "So after my first proper match I’d say that it’s a good concept and I like mouse x motion controls and it would work a lot more in a chill game, it’s just not that comfortable for me to play, however if I was a wheel chair user and I was used to the strain on my arms then I bet I’d have a lot more fun. Gonna play a bit longer and see if it gets easier.",
                "author": "Queenspence2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mark Darrah: EA refuses to fund a remake of Dragon Age Origins or a remastered collection of the Dragon Age trilogy (Origins, 2 and Inquisition)",
        "score": 133,
        "text_content": "After the success of Mass Effect Legendary Edition, a lot of people wonder why Bioware/EA hasn't released a Dragon Age Legendary Edition yet. Well, according to former Bioware executive producer Mark Darrah, Bioware has already pitched a remake of Dragon Age Origins or a remastered collection of the Dragon Age trilogy (Origins, 2 and Inquisition) several times, but EA refused to fund it every single time. More specifically, he says EA is against remasters overall, and Dragon Age would be harder to do than Mass Effect. Bioware actually wants to do it, but EA refuses to give them more money, so Bioware would have to do it with the resources they already have. Unfortunately, they can't afford it at the moment since they are already working on Mass Effect 5. Source (they start talking about all of this around 15:29): https://youtu.be/1Pd9OG3HmN0?si=HjcxhYNLJEg2wVRo",
        "comments": [
            {
                "raw_content": "UGH. I’ve wanted a Dragon Age Origins remastered on switch for **so long**",
                "author": "Greatsnes"
            },
            {
                "raw_content": "I think EA talked about this, they said it was too difficult since those three games use different engines: Origins uses the Eclipse engine, the second the Lycium engine and Inquisition Frostbite. Another thing we can talk about is Bioware as a studio because I feel like this is the result of years of bad direction and bad leaders within the company; after seeing the documentary that Mark Darrah made about the development of Anthem and comparing it with what Jason said in his Anthem report, I feel that Bioware was a studio, like Bungie, that had a lot of talent but never matured, they never got serious, they always chasing their own past successes to the point where that lack of growth and innovation made them what they are now, they always wanted to do what they did with Mass Effect 2 but they always fail. Can we blame EA for this? Yes, but we also can't ignore the role Casey Hudson played in all of this. He was the one who promised EA a live service, he was the one who diverted resources. And don't even mention how they design projects. Hell, even Dragon Age Origins had horror stories about its development.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "How much money did oblivion remaster make?",
                "author": "asexyshaytan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DeNA talked about new major update to Pokemon TCG Pocket in its financials",
        "score": 185,
        "text_content": "DeNA, the team behind *Pokémon TCG Pocket*, shared some updates during their quarterly briefing: * Player retention has dropped since launch. * A **major update** is in the works to address it. * Launch planned before the end of this year. * Focus will be on improving the **card collection experience**. * More info coming later in the year. [https://ssl4.eir-parts.net/doc/2432/ir\\_material3/256980/00.pdf](https://ssl4.eir-parts.net/doc/2432/ir_material3/256980/00.pdf)",
        "comments": [
            {
                "raw_content": "Releasing a new set every month is getting overwhelming.",
                "author": "Deadybears"
            },
            {
                "raw_content": "It would be nice if the pack points weren't pack dependent. They release expansions way too fast so it'd be nice to focus on the current pack then use the pack points across all expansions to clean up the past ones. I wonder if having so many expansions is a bit daunting to new players. I'm guessing they wouldn't bother trying to get packs from the old expansions with new ones releasing at the end of each month.",
                "author": "eagleblue44"
            },
            {
                "raw_content": "The pack releases were way too frequent. I never 100% any set and only got all unique Mons/Trainers on a single set. In particular, the amount of super rares is insane even in the smaller packs. It was also a pain to collect all the Promo cards. I only ever got every one in a set, I think, once, and they were never gettable again once cycled out before I dropped the game.",
                "author": "foodisyumyummy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokémon Sleep Trading Might Be Coming, According to a Recent Patent",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can I have Pokemon Home support",
                "author": "robertman21"
            },
            {
                "raw_content": "1. Why 2. Why (Patents on videogame mechanics shouldn't even be allowed)",
                "author": "kritterhouse"
            },
            {
                "raw_content": "Pokemon company will do anything but release a game that feels finished",
                "author": "I_am_crazy_doctor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Far Cry Series Adaptation In the Works at FX",
        "score": 397,
        "text_content": ">Mac (It's Always Sunny in Philadelphia, Mythic Quest, Welcome to Wrexham) and Hawley (Fargo, Alien: Earth) are the co-creators of the Far Cry series. Hawley will also serve as showrunner, while Mac is set to star in the show. The series will be executive produced by Mac, Hawley, and Jackie Cohn for More Better Productions; Michael Garcia for 26Keys Productions; Nick Frenkel for 3Arts Entertainment; and Gerard Guillemot, Margaret Boykin, and Austin Dill for Ubisoft Film & Television. >\"This collaboration is really an embarrassment of riches. Far Cry a psychological tailspin that doesn't shy away from the darkest and most absurd parts of humanity, which aligns perfectly with FX's bold and fearless storytelling style,\" said Margaret Boykin, head of film and television content, Ubisoft Film & Television. >An anthology drama \\[...\\], each season will be set in a new world with a different cast of characters following the video game franchise's signature standalone storytelling format. Original source is from a Ubisoft News article, which seems to have been posted prematurely. [Original article link here:](https://news.ubisoft.com/en-us/article/2YgRby0tgbIWL7K03LKN4t/far-cry-series-adaptation-in-the-works-at-fx) (redirects to the main page now). The quotes above are taken from people posting them in the r/farcry post on the topic [HERE.](https://www.reddit.com/r/farcry/comments/1mlalqt/far_cry_series_adaptation_in_the_works_at_fx/)",
        "comments": [
            {
                "raw_content": "\"The Gang Goes Skydiving\"",
                "author": "timelordoftheimpala"
            },
            {
                "raw_content": "Very optimistic with Noah Hawley involved in this, Fargo's style of violence/comedy is perfect for Far Cry.",
                "author": "ErickJail"
            },
            {
                "raw_content": "I was not expecting Noah Hawley to be doing another show. Fargo isn’t cancelled (he’s just burnt out on it so it’s on hiatus) and Alien: Earth isn’t planned to be a 1 season only show (don’t know how many seasons but I know he has more seasons planned)",
                "author": "Joshdabozz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Second wave of Street Fighter 6 amiibo cards incoming",
        "score": 102,
        "text_content": "As spotted a few hours ago on the [amiibo subreddit](https://www.reddit.com/r/amiibo/comments/1miw482/street_fighter_6_amiibo_card_booster_packs/) and [subsequently corroborated ](https://www.nintendolife.com/news/2025/08/street-fighter-6s-next-wave-of-amiibo-cards-surface-online-heres-a-look)by *Nintendo Life*, multiple retailer listings have surfaced for a second series of *Street Fighter 6* amiibo cards that will be compatible with the recently released Nintendo Switch 2 version of the game. In addition to reprints of the existing 22 characters that were included in the Starter Set launched on June 5, [images show](https://images.nintendolife.com/634e26f1a6488/street-fighter-6.large.png) that they will also introduce new cards for the post-launch fighters included in Year 2 and Year 3 of DLC, which means everyone from Akuma to Ingrid will now be covered in the upcoming set. There's also [new packaging](https://www.nintendolife.com/news/2025/08/street-fighter-6s-next-wave-of-amiibo-cards-surface-online-heres-a-look#enlarge-3) that prominently highlights A.K.I., M. Bison and Elena front and center to boot. Amiibo cards can be used in *SF6* on Switch 2 to save player data such as character costumes and costume colors as well as control style preferences in addition to unlocking viewable Gallery items. Honestly for the prices these go for and especially since a lot of these are going to be reprints of two month old stock, the least they could do is feature new art for Costume 2 and 3 sets on the existing fighters imo.",
        "comments": [
            {
                "raw_content": "I'm wondering if the Terry amiibo can work in SF6 now Remember, Terry has a Smash amiibo and Ryu and Ken's Smash amiibo is compatible with SF6 so I'm wondering the same thing might be patched in for Terry since he's getting a second amiibo (in card form mind you)",
                "author": "Secure-Report-3592"
            },
            {
                "raw_content": "These look very cool, but their only functions are to save a single player preset (character, costume, colour, control scheme) and get a unique background for the avatar’s phone It would’ve been nice if it at least unlocked the Costume 2s",
                "author": "LukePS7013"
            },
            {
                "raw_content": "I know its unlikely, but i would LOVE some SF6 nso icons. Not the end of the world but id much prefer it to more amiibo cards",
                "author": "Playful_Lecture7784"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Nova Lake Full Leak: 52C Pictured, 288MB L3, Hammer Lake on LGA 1954!",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "isnt MLID banned from this sub as a source?",
                "author": "Space_Reptile"
            },
            {
                "raw_content": "That much L3 cache on Nova Lake already makes it the size of the total silicon area of all tiles in Arrow Lake - on a PCB with the same dimensions as LGA1851. For L3 alone. Rubbish rumors from MLID as usual.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "MLID, so take it with an ocean's worth of salt, but it does match up with the recent rumors.",
                "author": "F9-0021"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Nashville: Once the hottest, now the slowest RE market in the country (realtor.com via TNledger)",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nashville is absolutely going to collapse. it's a dump",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "Nashville’s price-to-rent ratio is in the mid-20x range. everything that happens in the Nashville house market hereforth isn’t random; it’s because of this. the price-to-rent ratio is in the 20s. it really is as simple as that. look, everyone understands this concept pencils-out, so the best argument i’ve heard is “we are going to live here forever though. this is our forever house. we are going to be here for thirty years, because everything about this house is perfect for us now and in the future.” that actually would be a sound argument on paper. but in practice it’s also an improbable and irrational argument. you do not know what’s going to happen to you in the future. taking on a lot of risk assuming you’ll enjoy some steady-state does not insulate you from the fact that the risk exists. it’s not about your present expectations about steadiness, it’s about present risk. you don’t have any control over the consequences from a high risk environment you opted-into. no matter how bad you want things to stay the same.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory of Homes for Sale Balloons in Texas and its Big Metros: Dallas-Fort Worth, Houston, Austin, San Antonio",
        "score": 17,
        "text_content": "https://wolfstreet.com/2025/08/08/inventory-of-homes-for-sale-balloons-in-texas-and-its-big-metros-dallas-fort-worth-houston-austin-san-antonio/ Amazing turn of events: From desperate “housing shortage” to massive inventory pile-up in four years. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "it's over for hoomers. they only have one cope left, the fabled north east. but it will fall too",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "It’s never been a house that people who cry shortage want. It’s a location that they could not afford. It won’t matter if houses in Texas went to $5 as long as it’s a million in San Francisco or New York then a shortage will be what is standard.",
                "author": "KoRaZee"
            },
            {
                "raw_content": "…but someone here who owns a $200k tract home in rural / exurb Pennsylvania told me prices keep going up in their area",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Household Debt Rises to $18.39 Trillion in Q2",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "every fukin month i have a 1000 dollar expense. car, house, whatever. 1000 bux says no way chief, fuck you, i'm out. Fuckin' loser. I can handle it, but i feel for people who cant since most people, according to these same stats, can't afford a 500 dollar bill or it'll end them. Getting shittier and shittier out there bros :<",
                "author": "suburban_homepwner"
            },
            {
                "raw_content": "Weird that this headline provokes people. In a growing economy, debt grows proportionally.",
                "author": "jredful"
            },
            {
                "raw_content": "Just wait, people are dumb to over spend........ CC, Cars, Homes. Watch all the Foreclosures coming, CC delinquencies and repos. It IS coming just takes little bit to get in the pipeline. Foreclosures are already on the raise, not huge but it's coming",
                "author": "tigger19687"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 admits it \"doesn't know\" an answer!",
        "score": 1096,
        "text_content": "I asked a GPT-5 admits fairly non-trivial mathematics problem today, but it's reply really shocked me. Ihave never seen this kind of response before from an LLM. Has anyone else epxerienced this? This is my first time using GPT-5, so I don't know how common this is.",
        "comments": [
            {
                "raw_content": "This is one of the main things they worked on. Getting it to say I don't know instead of confidently hallucinating a false answer.",
                "author": "mothman83"
            },
            {
                "raw_content": "far and away this immediately makes GPT-5 far superior to 4 anything.",
                "author": "y0nm4n"
            },
            {
                "raw_content": "It's good that it says it doesn't know instead of spitting bullshit, I appreciate this",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What the hell bruh",
        "score": 2736,
        "text_content": "Maybe they do need to take that shit away from yall, what the hell😭💀",
        "comments": [
            {
                "raw_content": "I honestly didn't know some people had that kind of relationship with AI, goes to show how much the world has changed in just three years",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "OMG I just can’t stand the whole “not some XXX, not XXX, but…XXX” 😩 And I hate that damn em dash on top of it which pisses me off even more lol",
                "author": "laitdemaquillant"
            },
            {
                "raw_content": "Ok I changed my mind shut it down",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Physicians GPT-5 Review. Finally trades IQ flexing for reliability.....",
        "score": 172,
        "text_content": "I’m a doctor with an expertise in neurodevelopmental conditions. I’ve messed around with every model under the sun and my take is that an AI can be “super intelligent,” but if it continues to do dumb errors/hallucinations, its real world utility is cooked. Reliability is the whole game in the medical world. Putting benchmarks aside, GPT5 feels like a major step because the hallucination rate in thinking tasks actually dropped hard. Tool use is excellent, and the early wobble thing around “when to think harder” seems resolved. The contextual understanding jump is huge. Tokens per second is way up, and cost per intelligence is way down, which is nice. Smaller notes: image analysis is a minor improvement, sycophancy is moderately reduced, and coding is only a small lift overall except frontend work, which got a big upgrade. Most importantly for me, this is the first model where I’d say its medical reasoning and clinical acumen are on par with mine. It would be a good buddy to have around to help with cases realtime if it passed privacy laws. That crosses a line from “neat toy” to “2nd brain thats says less absurd things and can understand the whole case\" Cons: The context window is still small, and the personality’s flatter. I get why people dislike that. But OpenAI has like 800M users where chasing raw “intelligence” without nailing accuracy, hallucination reduction, and alignment was never the move. This may look like a slowdown, but if you want a reasoning model at this level to be useful, these are the upgrades that matter. Also advanced voice mode still really sucks. Like its unusable. Grok has the best voice implemtation so far. For what it’s worth, Claude Opus 4.1 is still better in a few areas, but it’s significantly more expensive. GPT5 hits the reliability per dollar sweet spot right now. I think if there were zero releases from GPT4 to GPT5 we would be like wtf. However. the hype created high expectations so thats on them.",
        "comments": [
            {
                "raw_content": "Keep in mind we're just getting started on this model. Guessing there will more tuning and improvements in upcoming months.",
                "author": "TheCanadianPrimate"
            },
            {
                "raw_content": "Curious what kind of coding you’re doing as a doctor",
                "author": "i_write_bugz"
            },
            {
                "raw_content": "They'll figure it out in time. GPT-4 from two years ago at launch was even more sterile and emotionless than GPT-5 now. Now that there's financial pressure to do so, they'll definitely figure out a way to fine-tune GPT-5 to be even more addictive than 4o ever was. I give it a couple months at most. You can already see they're tuning it and testing it as we speak.",
                "author": "NIU_NIU"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I am personally loving gpt 5",
        "score": 140,
        "text_content": "That's all I'm here to say. I've been having a blast with this thing. For me, it's noticably way better. Hallucinations have decreased dramatically. Also to my surprise this thing really is actually pretty opinionated. It's a lot less centrist than it used to be like it will actually have takes on things",
        "comments": [
            {
                "raw_content": "I agree, at first I was skeptical. But its far superior to 4o. I hope they don't change it. It definitely feels like magic because whatever they did with the memory makes the model so much smarter. The more conversations that I have with it and the more things that we build together, it just seems to recall conversations better than before. So whereas 4o seemed like a gimmick, this feels more adaptive.",
                "author": "frograven"
            },
            {
                "raw_content": "I am liking it too. Text is more concise and punchy. And the output tokens per seconds feels much faster.",
                "author": "RipleyVanDalen"
            },
            {
                "raw_content": "Dude what are you doing?? You're breaking the hate train streak",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "My knowledge work as a neurosurgeon is cooked",
        "score": 614,
        "text_content": "The so out vibes from the gpt-5 launch seem to continue to cloud it But just a reminder that even if the current trajectory doesn't have AI solving death next year what AI is doing is still really impressive. And considering the whole of human experience is still moving at light speed. As a neurosurgeon I largely agree with this statement from Elon. Sam has said similiar things. There is some nuance and inside the house of medicine that can be shouted about. But foundation models in terms of diagnosing, prescribing, working up - the knowledge work - is better than your average physician encounter. I'm so convinced of it. And that's gonna be a huge thing for patient convenience and safety and experience.",
        "comments": [
            {
                "raw_content": "What's better than a doctor who can remember everything they ever read about anything health related",
                "author": "Infamous_Mall1798"
            },
            {
                "raw_content": "It’s impressive but there’s a long way to go to replace surgeons in a physical sense without any human supervision. For the AI to see you, diagnose you, decide on the surgery, and do it without human supervision. Absolute trust in the whole process. I don’t think anyone here can realistically imagine this being soon. There’s too many caution variables.",
                "author": "DeviceCertain7226"
            },
            {
                "raw_content": "Thought the title was just you joking. AI is definitely improving but this is just CEO talk tbh. Elon has been saying we’re inches away from all self-driving cars for well over a decade",
                "author": "wainbros66"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I don’t understand why everyone hates Sam Altman and OpenAI so much. It’s like everyone is waiting for them to fall.",
        "score": 317,
        "text_content": "Yes, Sam Altman hypes ChatGPT a lot, but the dude is competing with trillion-dollar companies, and unlike Google, they don’t have hundreds of billions of dollars in the bank. Yes, they’ve made mistakes and done things worth criticizing, but I still don’t understand this level of hate. I don’t think the chart error in the GPT-5 presentation was as big of a deal as people made it out to be, and I believe they’ll fix the transition issues with the new model in a few days. Their job is already difficult, going up against trillion-dollar companies without the same financial resources. It’s like everyone is waiting for them to fall. As if all the other companies are innocent and only they are the devil. In my opinion, it’s much better to have OpenAI competing rather than letting dominant companies like Meta and Google hold a monopoly. I think they’ve done a good job so far. Also, unlike everyone else, I’m satisfied with GPT-5. While GPT-4o had unique features, its constant praise, agreeing with me, and sycophantic personality really annoyed me. Also, they’ve already added a personality selection feature for those who want it to be friendlier. I chose “Robot,” and for the first time, it doesn’t use em dashes in its responses.",
        "comments": [
            {
                "raw_content": "Personally, I'm sick of the \"just had the agi feeling again this morning. big week coming next week\" tweets",
                "author": "Curtilia"
            },
            {
                "raw_content": "It's entirely due to the hype. Had he said something like \"we're necessarily getting diminishing returns but I'm still extremely excited about and impressed by GPT-5\" that's a lot more understandable than just posting pics of the death star and hyping this thing as a potential replacement for CEOs",
                "author": "One-Attempt-1232"
            },
            {
                "raw_content": "Do you think that all the people who have worked closely with Sam Altman and left the company in disagreement did it because they simply do not like him hyping their products a little bit too much? The guy is a pathological liar. Maybe not in the same league as Elon Musk, but he's definitely not 'consistently candid'. As far as OpenAI goes, I don't feel any different about them than about any other company full of Silicon Valley tech bros.",
                "author": "REOreddit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Crazy that it’s already a thing for some cars",
        "score": 1391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone got any more info about this seemingly autonomous vehicle? E.g. What company makes / operates it? Interested because this is the 1st robotruck I've seen that specifically has zero space for any human driver at all.. EDITED TO ADD: Thanks to u/Paraless and u/Incener who were able to identify this as a Zelos / ZelosTech autonomous vehicle, from the writing on the back of it: [https://zelostech.ai/](https://zelostech.ai/)",
                "author": "DukeRedWulf"
            },
            {
                "raw_content": "Couldn’t they at least add a smiley face or something.",
                "author": "LeatherClassroom524"
            },
            {
                "raw_content": "What a terrible version of that song",
                "author": "ratfacechirpybird"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "WE ARE DOOMED",
        "score": 511,
        "text_content": "What is this communit",
        "comments": [
            {
                "raw_content": "I wouldn't be surprised if some of them are trolling, but some genuine. Either way, I don't really care, the internet is nowhere near like it was in the late 90's or early 2000's when AOL, Yahoo and MSN were popular in my opinion, trying to find someone to chat with was easy back then, but for a while it's been on the decline. Ghosting, and simply refusing to reply to a message is a big thing these days. I gave up a long time ago even trying to communicate with most people because of that.",
                "author": "PeterPigger"
            },
            {
                "raw_content": "There are some older ladies I'd love to get hooked on this instead of the scammers that keep bilking them for gift cards.",
                "author": "silencerider"
            },
            {
                "raw_content": "Not to worry, this is only the beginning",
                "author": "sidearmpitcher"
            }
        ],
        "subreddit": "singularity"
    }
]