[
    {
        "post_name": "nitecrew",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let me tell you, it was so crazy you wouldn't believe it.",
                "author": "CommieCrats"
            },
            {
                "raw_content": "I kid you not, President Trump is almost certainly awake right now. Think the man only gets 3 or 4 hours per night. 💤🌙",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Oldie but goldie! 🐸❤️🫡",
                "author": "TruthWillOut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I guess Congress is waiting or something?",
        "score": 1421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They just don't have the balls to do this.",
                "author": "Awakened"
            },
            {
                "raw_content": "A precedent has been set. A recalibration is needed.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "Retribution will be meaningless unless the system is recalibrated.",
                "author": "Son0fLiberty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Liberal SCOTUS Justice Sotomayor's argument in favor of black Congressional districts was just PUMMELED in front of the entire court🔥",
        "score": 1203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Riddle me this you dumb bitch if white people won't vote for a black candidate how the fuck did Obama get elected?",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Sotomayor was hands down the stupidest justice until Kween Wakanda Jumanji came along.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Fucking retarded racist cunt",
                "author": "CaptRedbeard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NBC News has terminated 150 staff members from its diversity units — NBC Black, NBC Latino, NBC Asian, and NBC Out. The layoffs account for about 7% of its workforce amid growing financial troubles. Woke garbage isn’t selling, and it’s not a sustainable business model.",
        "score": 1701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And they didn't cut one person from NBC White, those racist bigots!!",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "How you say, \"Learn to code,\" in faggot?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Woke garbage has also stopped receiving the ESG subsidies that propped up these unpopular and failing business models *cough* USAID *cough*",
                "author": "WeeWillyWinkler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump on Chuck Schumer \"He's a loser. I've known him all his life. Always been sort of a loser - but an intelligent one.\" \"But I think he's losing IQ points with time. I think that happens. I hope it hasn't happened with me. I know if it DID, you guys would let me know about it very quicky",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Schumer is a professional Jew. He's very good at it.",
                "author": "infinitysupreme"
            },
            {
                "raw_content": "Negative IQ points protruding. Very, very disrespectful",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "I’m absolutely dying reading that quote 😂😂😂",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General James Uthmeier : Tonight, we filed a lawsuit against Gavin Newsom and California in the US Supreme Court because their so-called “sanctuary” policies for illegal aliens are harming states like Florida. California must pay for the carnage of their open border policies and unlawful",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "𝐈𝐍𝐒𝐔𝐑𝐑𝐄𝐂𝐓𝐈𝐎𝐍 𝐀𝐂𝐓 𝐍𝐎𝐖",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They're shoving it off to an Obama/Biden appointed judge to shut it down so they can throw their hands in the air and act like they tried. Both parties are equally rotten and in deep with the Swamp.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "This seems like a case that determines the future of the US and whether we can save the country through the rule of law or not.",
                "author": "terribletwos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our trucks are 13'6 high. It would help if you understood English.",
        "score": 690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a much bigger problem up in Canada. Here, we're at least deporting this garbage and draining the sewer.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Foreigners have no respect for 12 and under.",
                "author": "RockyBalboa"
            },
            {
                "raw_content": "Charge and deport. Prosecute should he ever return.",
                "author": "Just_a_Patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chin up, Pedes. All of you.",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thanks pede! We loves ya!",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "I see what's happening now and I want that so bad for our future.",
                "author": "SCP0073"
            },
            {
                "raw_content": "I hope. We really need at least 3 terms to clean house.",
                "author": "DebunkTheLeft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💸 The Wall Street Journal is reporting that President Donald Trump plans to use the IRS to target or pursue left-leaning groups...",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Screw being fair. Playing by the rules isn't how republics get saved.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Lois Learner has entered the chat... You made us not give a fuck about abuse of govt power, now live with your consequences.",
                "author": "USDMaga"
            },
            {
                "raw_content": "They probably left out the part that those left-leaning groups are funding terrorists.",
                "author": "_Sully_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FBI has found and located 5,400 children!",
        "score": 1620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And that's just in Biden's basement!",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "God Bless, Kash! I told you fucking doomers this man was busy and shit takes time. You all want shit NOW NOW NOW! Well, guess what, here’s a big deal that just happened. Kash is delivering. It takes time.",
                "author": "MAGAJuice"
            },
            {
                "raw_content": "Just 5 million to go",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC Judge and Sable Supervillain Kendra Biggs Lets 'Big Balls' Attackers Walk Free",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll protect their kind at every opportunity, at the detriment of everyone else. Time we do the same again.",
                "author": "GarbageManCan47"
            },
            {
                "raw_content": "Oh. What a shock. https://patriots.win/p/1ARJcztJHq/if-all-judges-were-white-males-a/c Why did the founders only want white men to vote? Such a mystery!",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "We should have picked our own cotton.",
                "author": "NancyCirrhosi"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump on Powell: On his new WH ballroom: \"I'm VERY good at building things on time. You're not going to see, like the Fed, where they're up to $4B or something, to build some walls. It's the craziest thing I've ever seen. This guy, he's too late!\" He should have been too late with that one",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love when President Trump talks construction. You can tell he truly loves being a builder",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "It’s not incompetence, it’s theft.",
                "author": "Easzq8"
            },
            {
                "raw_content": "🚨 JUST NOW: President Trump has the whole room CRACKING UP after he mocks \"Too Late\" Jerome Powell 😂 On his new WH ballroom: \"I'm VERY good at building things on time. You're not going to see, like the Fed, where they're up to $4B or something, to build some walls. It's the craziest thing I've ever seen. This guy, he's too late!\" \"He should have been too late with that one, not done it! It didn't need to be done. He could have painted the ceilings.\" \"They ripped down a gorgeous ceiling like this. And then they said, we have a problem. Now we have to put one up. How do you do a ceiling like this? And they're way over budget.\"",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AOC, confirming that she is the one in control of the party and not Chuck Schumer, says she needs President Trump’s signature approving all Democratic demands, including free healthcare for illegals, to reopen the government.",
        "score": 544,
        "text_content": "",
        "comments": [
            {
                "raw_content": "rich girl pretending to be from the block is so full of shit",
                "author": "perma-maga"
            },
            {
                "raw_content": "Ok, retard.",
                "author": "The_Ikonoclast"
            },
            {
                "raw_content": "🍿 So what's everyone's favorite popcorn flavor? I like cheese.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just announced he will be SURGING federal agents into San Francisco to clean up crime LONG overdue!",
        "score": 1504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Funny thing is, 80% of SF want this, even by leftwing polls",
                "author": "Lol_Garrus"
            },
            {
                "raw_content": "If President Trump really wants to end the madness in California, he’d invoke the insurrection act, arrest Newscum, and replace the elected leadership with MAGA loyalists",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Oh boy this is one is going to be GOOD!",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two very different reactions",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look at that arm fat. Good God.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "right",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Well I am an idiot because I don’t know what this is supposed to mean. I understand the first part but am befuddled by the second.",
                "author": "Decepticons-superior"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Left-wing violence receives legal cover from judges and political cover from politicians and commentators, sending one very loud message to their militants: Don’t stop.",
        "score": 1219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The right is not as ruthless as the left. We have morals. They do not.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "street justice is coming by someone who will be wronged, these judges are soldiers for the dems",
                "author": "PunishedOrange"
            },
            {
                "raw_content": "Yet Trump still refuses to declare Martial Law.",
                "author": "Roadcruiser2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grand jury expected to indict ex-national security adviser John Bolton for transmitting classified documents: sources",
        "score": 1514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Having them and transmitting them are seriously different. This could really be bad if he shared them for any reason.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "What's the penalty for storing them on an unsecured server and transmitting them by personal email?",
                "author": "IvIA6A"
            },
            {
                "raw_content": "According to the article, they are expecting an indictment either today or tomorrow.",
                "author": "Marianasoctober"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Justices Sotomayor & Jackson right now...",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Neither has the intellect to perform life-saving procedures on the other.",
                "author": "loooooof"
            },
            {
                "raw_content": "A single grunt from Thomas carries more meaning than anything they have to say.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "Why is there no thread for the press conference that is happening right now...?",
                "author": "berserkerbarrage"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Was Right",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They aren’t there for the wages. They make their money while there many other ways.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "Members of Congress should not be paid.",
                "author": "infinitysupreme"
            },
            {
                "raw_content": "They aren’t doing the jobs we need them to do… THEY SHOULD BE FUCKING FIRED AND A NEW ELECTION NEEDS TO BE SCHEDULED WITHIN THE MONTH.",
                "author": "Jakylangelo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wife is pregnant!!! Please pray for us the next few weeks 🙏",
        "score": 1407,
        "text_content": "<p>This is our second baby, we had a miscarriage before our first so the next couple of months we will be very stressed out until the 12 week ultrasound.</p> <p>We are doing our part to raise homeschooled, Christian babies. God is good.</p>",
        "comments": [
            {
                "raw_content": "Don;t worry -we got your back. You just relax, and we'll find the guy that did this!",
                "author": "edxzxz"
            },
            {
                "raw_content": "GOD BLESS YOU AND YOUR WIFE!",
                "author": "loooooof"
            },
            {
                "raw_content": "Praying for the three of you, Fren.",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Android Authority: \"Nothing blames Apple patents for the lack of more phones with magnets for wireless charging\"",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought I had a stroke reading that headline",
                "author": "kkibb5s"
            },
            {
                "raw_content": "This is a Nothingburger. Apple patents haven't stopped anyone from adding magnets. The midrange HMD skyline had them a few years ago and the Pixel 10 series has them. Android OEMs are just in a race to the bottom in cutting costs. Even flagships. The microSD card slot wasn't removed to upsell storage (many Android OEMS have a history of not even offering bigger storage in some markets) but for the half a cent per unit it saves them. Magnets are expensive and even flagship Android consumers have demonstrated tighter purse strings than Apple consumers. They all oscillate in a given year on what they're cutting to reduce costs. A few years ago QHD screens basically disappeared. iPhone style 1.5k screens began being produced by the Chinese, so resolution has at least finally gone back up a little. We've had memory and storage cuts from 2020-2023 on a lot of flagships, too. Integrated magnets is just a BOM cost most Android OEMs don't want to add. Google is cheaping out so much on the SoC they seemed to have been able to justify adding them. Hopefully it pushes Samsung to eventually add magnets as well.",
                "author": "Darkknight1939"
            },
            {
                "raw_content": "Samsung is implementing Qi2.2 soon",
                "author": "CalmSpinach2140"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple unleashes M5, the next big leap in AI performance for Apple silicon",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they have a dedicated ML acceleration block, but also now ML acceleration built into every core of the GPU? Can someone explain why?",
                "author": "ChunkyThePotato"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Are geopolitics banned from this sub?",
        "score": 36,
        "text_content": "Or just articles that mention China? Yesterday there was an interesting post about the Netherlands and China that got removed, this is a common theme on this sub and I was hoping for some clarity as to why such hardware industry related subjects are being removed.",
        "comments": [
            {
                "raw_content": "Neither articles about china nor articles with politics are banned. However, posts may be removed and/or comment sections locked for a number of reasons including if the mod team feels the article is not sufficiently about hardware, does not contain enough new hardware-related content (versus rehashing old hardware news in light of a more recent political event), or the comment section veers too far off the topic of hardware. The Dutch/China thread yesterday was removed due to significant brigading in the comment section.",
                "author": "Echrome"
            },
            {
                "raw_content": "The discourse around china on this sub is very ugly It just devolves Americans calling people Chinese bots, and Chinese calling people American bots or similar There is ultimately no intelligent discourse to be had, the commenters do not allow it",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "It happens because people can't stay on topic. In this specific example, the US pressured the Netherlands to take control of Nexperia. Being a hardware sub, that topic should lead to conversations about what this means for Nexperia and the wider market. Or how China's retaliatory rare earth sanctions would impact the market. Or just general speculation on what impact these moves will have on the wider Hardware market - maybe even a hint of the legal basis and motivations for these actions. Instead, the comments usually devolve into low effort \"Drumpf Bad\", \"China is so amazing why are they being bullied\", \"Trump is saving America\", shit slinging that's overly partisan or overtly propagandized - straight up debating the existence of there even being a tech war between the west and China. The threads will stay up with comments open so long as the conversations are ultimately centered around how these actions impact the hardware market specifically. I'm happy the mods take this approach because there are already hundreds of popular subs to have shitslinging political \"discussions\" on",
                "author": "soggybiscuit93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA Adds Samsung Foundry to NVLink Fusion Ecosystem for Custom Silicon Manufacturing",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Adata chairman says AI datacenters are gobbling up hard drives, SSDs, and DRAM alike — insatiable upstream demand could soon lead to consumer shortages",
        "score": 196,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First they came for GPUs, now they come for memory, ram and storage?",
                "author": "Unfair-Sell-5109"
            },
            {
                "raw_content": "When this bubble finally pops, the secondary market is gonna be ***flooded*** with cheap server parts.",
                "author": "shadowtheimpure"
            },
            {
                "raw_content": "It seems to never be a good time to be a PC enthusiast. 😮‍💨",
                "author": "-Suzuka-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung accelerates HBM4E process, aims for 3.25TB/sec bandwidth ready for NVIDIA Rubin AI GPUs",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "8x AMD Instinct MI355X take back the lead over 8x Nvidia B200 in FluidX3D CFD",
        "score": 46,
        "text_content": "8x [AMD Instinct MI355X](https://www.amd.com/en/products/accelerators/instinct/mi350/mi355x.html) take back the lead over 8x [Nvidia B200](https://www.nvidia.com/de-de/data-center/dgx-b200/) in [FluidX3D CFD](https://github.com/ProjectPhysX/FluidX3D), achieving stellar 362k MLUPs/s (vs. 219k MLUPs/s). Thanks to Jon Stevens from [Hot Aisle](https://hotaisle.xyz/) to run the OpenCL benchmarks on the brand new hardware! 🖖😊 * AMD MI355X features 288GB VRAM capacity at 8TB/s bandwidth * Nvidia B200 features 180GB VRAM capacity at 8TB/s bandwidth In single-GPU benchmarks, both GPUs perform about the same, as the benchmark is bandwidth-bound. But in 8x GPU configuration, MI355X is 65% faster. The difference comes from PCIe bandwidth - MI355X achieves 55GB/s, B200 has some issues and only achieves 14GB/s. And Nvidia leaves a lot of performance on the table by not exposing NVLink P2P copy to OpenCL. Can't post images here unfortunately, so here is the charts and tables linked: * Full [single-GPU benchmark chart/table](https://github.com/ProjectPhysX/FluidX3D?tab=readme-ov-file#single-gpucpu-benchmarks) * Full [multi-GPU benchmark chart/table](https://github.com/ProjectPhysX/FluidX3D?tab=readme-ov-file#multi-gpu-benchmarks) . |----------------.------------------------------------------------------------| | Device ID | 0 | | Device Name | AMD Instinct MI355X | | Device Vendor | Advanced Micro Devices, Inc. | | Device Driver | 3662.0 (HSA1.1,LC) (Linux) | | OpenCL Version | OpenCL C 2.0 | | Compute Units | 256 at 2400 MHz (16384 cores, 78.643 TFLOPs/s) | | Memory, Cache | 294896 MB VRAM, 32 KB global / 160 KB local | | Buffer Limits | 294896 MB global, 301973504 KB constant | |----------------'------------------------------------------------------------| | Info: OpenCL C code successfully compiled. | | FP64 compute 62.858 TFLOPs/s (2/3 ) | | FP32 compute 138.172 TFLOPs/s ( 2x ) | | FP16 compute 143.453 TFLOPs/s ( 2x ) | | INT64 compute 7.078 TIOPs/s (1/12) | | INT32 compute 38.309 TIOPs/s (1/2 ) | | INT16 compute 89.761 TIOPs/s ( 1x ) | | INT8 compute 129.780 TIOPs/s ( 2x ) | | Memory Bandwidth ( coalesced read ) 4903.01 GB/s | | Memory Bandwidth ( coalesced write) 5438.98 GB/s | | Memory Bandwidth (misaligned read ) 5473.35 GB/s | | Memory Bandwidth (misaligned write) 3449.07 GB/s | | PCIe Bandwidth (send ) 55.16 GB/s | | PCIe Bandwidth ( receive ) 54.76 GB/s | | PCIe Bandwidth ( bidirectional) (Gen4 x16) 55.00 GB/s | |-----------------------------------------------------------------------------| AMD Instinct MI355X in [https://github.com/ProjectPhysX/OpenCL-Benchmark](https://github.com/ProjectPhysX/OpenCL-Benchmark) |----------------.------------------------------------------------------------| | Device ID | 1 | | Device Name | NVIDIA B200 | | Device Vendor | NVIDIA Corporation | | Device Driver | 570.133.20 (Linux) | | OpenCL Version | OpenCL C 3.0 | | Compute Units | 148 at 1965 MHz (18944 cores, 74.450 TFLOPs/s) | | Memory, Cache | 182642 MB VRAM, 4736 KB global / 48 KB local | | Buffer Limits | 45660 MB global, 64 KB constant | |----------------'------------------------------------------------------------| | Info: OpenCL C code successfully compiled. | | FP64 compute 34.292 TFLOPs/s (1/2 ) | | FP32 compute 69.464 TFLOPs/s ( 1x ) | | FP16 compute 72.909 TFLOPs/s ( 1x ) | | INT64 compute 3.704 TIOPs/s (1/24) | | INT32 compute 36.508 TIOPs/s (1/2 ) | | INT16 compute 33.597 TIOPs/s (1/2 ) | | INT8 compute 117.962 TIOPs/s ( 2x ) | | Memory Bandwidth ( coalesced read ) 6668.71 GB/s | | Memory Bandwidth ( coalesced write) 6502.72 GB/s | | Memory Bandwidth (misaligned read ) 2280.05 GB/s | | Memory Bandwidth (misaligned write) 937.78 GB/s | | PCIe Bandwidth (send ) 14.08 GB/s | | PCIe Bandwidth ( receive ) 13.82 GB/s | | PCIe Bandwidth ( bidirectional) (Gen4 x16) 11.39 GB/s | |-----------------------------------------------------------------------------| Nvidia B200 in [https://github.com/ProjectPhysX/OpenCL-Benchmark](https://github.com/ProjectPhysX/OpenCL-Benchmark)",
        "comments": [
            {
                "raw_content": "I always love seeing these benchmarks out there. With so much focus on AI performance right now, it's nice to see this hardware still being useful for other things too, like CFD. You mention that both perform similarly when memory bandwidth-bound, but I know from some experience using this software that the total capacity is also important for the size of the simulation. How much bigger or more detail could the MI355Xs handle given they have 1.6x the VRAM?",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "OpenCL has never been Nvidia's focus.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "These are great to see as always, but I wonder if there even are any OpenCL workloads being run on these systems. I dare say the multi-GPU results are worthless because they're not measuring the very thing that makes these 8x boards special.",
                "author": "farnoy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(Geekerwan, ROG Xbox handheld review) ROG Xbox 掌机 X 上手体验：手感极佳的强大掌机！",
        "score": 15,
        "text_content": "English subtitles available",
        "comments": [
            {
                "raw_content": "Summary: ROX Xbox X is slightly larger than a Switch 2. The Ryzen AI Z2 extreme is the same die as the Ryzen AI 9 HX 370, but with 3 Zen 5 cores and 5 Zen 5C. In Cinebench R23 the multicore is around the same as the previous Z1 extreme while single core is around 16% higher at 1975pts, compared to 1700pts. In 3DMark Steel Nomad Light the 890M is around 17% faster at the same power draw, while with Lunar Lake the performance is similar around 25w (note, watts includes motherboard and not just GPU). In games the avg fps has increased by \\~10-15fps. Battery life in heavier games is around 2 hours (note, this was with 17w) while in lighter games it lasted almost 6 hours (5h 56min).",
                "author": "Chairman_Daniel"
            },
            {
                "raw_content": "It's not a bad device but hard to justify over the many cheaper Z1 Extreme devices.",
                "author": "OwlProper1145"
            },
            {
                "raw_content": "Isn’t the point of this to hold off enthusiasm for Xbox until their next gen release in 2027?",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Japanese semiconductor company Renesas explores $2 billion sale of timing unit",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The process is expected to draw interest from other major chipmakers, including U.S.-based Texas Instruments and Germany's Infineon, the sources added, requesting anonymity to discuss confidential information. .... >The division develops and supplies specialized integrated circuits that manage clock, timing and synchronization functions. These components are critical for ensuring the orderly flow of data in high-speed networking equipment. >Key markets for the unit include data centers, where its products support communication between servers, as well as telecommunications infrastructure and the build-out of 5G mobile networks.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Whyyyy? Not again. Silabs Clock / Timing ICs were among the best but they sold it all to Skyworks. Had to migrate to Renesas as existing SKUs stopped being available with online distributors. And barely anything new since. Are all of them allergic to diversification or something? Only TI seems to be sticking with or developing for their existing markets. Silabs looks like a Nordic Semi clone now, just IoT and wireless flavour-of-the-day.",
                "author": "autumn-morning-2085"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This game's movement is so peak",
        "score": 821,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My lord remind me not even to try to play online when I eventually get this",
                "author": "ScytherCypher"
            },
            {
                "raw_content": "I feel like they should add a mode that's similar to Tony Hawk. Try to do a certain amount of tricks and collect items in a contained area before the time limit. It might work well with this moveset.",
                "author": "GuybrushThreepwood99"
            },
            {
                "raw_content": "I'm sorry for playing the same game as you 😭🤣🤣 that's cool, I can't even reliably get on the rails",
                "author": "Cozy-Panda777"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Day early delivery from Amazon.",
        "score": 845,
        "text_content": "Never got a video game delivered early from Amazon until today and I’m happy. It’s just so happy to be this game. Do you guys think I will be OK to play it? I don’t have to worry about a ban if I play today early do I?",
        "comments": [
            {
                "raw_content": "Is there some reverse cover art?",
                "author": "Tribal_Cult"
            },
            {
                "raw_content": "Man, the branding on this fuckin sucks. The paragraph at the bottom and ‘Nintendo switch 2 edition’ when it’s clearly labeled at the top?",
                "author": "Watt_About"
            },
            {
                "raw_content": "Meanwhile best buy won't even ship mine until tomorrow",
                "author": "ah_shit_here_we_goo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokemon vs Digimon? Nah I choose peace",
        "score": 712,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|3ohfFhG5VDtDTzQv2o|downsized)",
                "author": "CH40T1C1989"
            },
            {
                "raw_content": "The truth is.. they are vastly different games. Main similarity is \"Monsters.\" I will say though, that if Pokemon did some of the things they did in Time Stranger we'd never hear the end of it.",
                "author": "Amazing-War3760"
            },
            {
                "raw_content": "Hoping it gets ported to switch 2 sometime next year! If not I’ll buy it on Steam!",
                "author": "bloody_velvet"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo is really flexing their music muscles this era!",
        "score": 46,
        "text_content": "Pokemon Legends ZA OST already sounding like bops and I'm only 10 minutes in",
        "comments": [
            {
                "raw_content": "You guys are going to give me FOMO. I'm really happy for you though. I hope you enjoy the game a lot",
                "author": "Away-Shower-2960"
            },
            {
                "raw_content": "Haha yea I noticed that too! Loving the music so far. Especially the hotel music",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "It’s great game so far",
                "author": "Sqwerks"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Responds To Reported 'Crimson Collective' Hack With Official Statement",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR; *Nintendo responded to an interview with the Sankei Shimbun on the 15th, saying, \"We have not confirmed any leak of personal information, and there has been no leak of development or business information.\" Some external servers that display Nintendo's website were defaced, but the company said there was no evidence of damage to customers or intrusion into the company.*",
                "author": "PlaceDowntown7102"
            },
            {
                "raw_content": ">*no leak of development or business information* Credibility level: North Korean TV news anchor",
                "author": "wewewi"
            },
            {
                "raw_content": "📢Bullllllllllllshit!🤨",
                "author": "PreferenceAny3920"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pikmin 4 might be the game which would benefit most from a switch 2 edition.",
        "score": 42,
        "text_content": "I adore Pikmin 4. It is one of my favorite switch games, and probably in my top 15 games ever. Pikmin might be in my top 5 video game franchises of all time. I like pikmin so much, I played the stupid mobile game for years because I enjoyed just looking at Pikmin. 4 does not have a lot of problems at all. But the problems that are there… are bad. Auto lock might be my least favorite thing about this game, especially coming off of 3. Despite the gyro for 3 being weird and inconsistent at times, it is far superior to fiddling with the auto lock. There needs to be an option to turn it off. Apart from the very final cave, this game also falls into the trap of being too easy. As much as I love Oatchi from both a design and gameplay perspective, I’d be lying if I said he didn’t throw off the games entire balance. He’s just too good. A hard mode would make repeat playthroughs even more fun than they currently are. Pikmin 4’s co-op is terrible. Pikmin 3’s co-op is incredible. Just let player 2 play as Oatchi, and this game would probably turn into one of my favorite couch co-op games. Finally, graphics. Pikmin 4 is a very good looking game, especially for switch. But on any consoles other than switch, it would have been gorgeous. Having this game running at anything higher than 1080p would allow its visuals to shine so much more. Again, I love this game to death, and that’s why I want these changes. If these things were added, it would be nearly perfect in my opinion.",
        "comments": [
            {
                "raw_content": "They don’t use the switch 2 editions to fix anything with the main game like you are asking for. They just would add a mode, update the graphics very minor. Pikmin 4 was the best game to me in the series, the auto lock is not a problem for someone who doesn’t want to play outdated games like the older Pikmin. Better off just hoping for a Pikmin 5.",
                "author": "Banks201"
            },
            {
                "raw_content": "I'm a big Pikmin 1 fan and I adored 4. It's one of the few games I finished 100%, but I totally agree about it being too easy. My favourite thing about Pikmin 1 is, controversially, the time limit. It's generous enough that you don't truly have a threat of losing your save, but tight enough that it encourages you to engage in smart multitasking and planning. Pikmin 4 doesn't really have stakes, and the dog makes everything VERY forgiving. There's no time limit, there's no need to strategize too deeply because you can slowly just brute-force most problems. I had the most fun with the very cool endgame missions (I won't spoil them). I would love to get a Switch 2 update that smoothed out performance but, more importantly, gave some new challenges to play through. The mechanics are incredible in Pikmin 4, and having some really meaty stages that made you smartly engage with all of them could potentially make it my favourite game in the series.",
                "author": "A_Unicycle"
            },
            {
                "raw_content": "I don't think you really grasp what next gen upgrades are. You don't like Pikmin 4 (that's fine), and want fundamental design changes that would just be Pikmin 5.",
                "author": "BooberSpoobers"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The next Nintendo Switch Online Game Trial is Shin Megami Tensei V: Vengeance",
        "score": 168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BEGGING for a Switch 2 upgrade",
                "author": "Tobisbrother"
            },
            {
                "raw_content": "My favorite turn based combat system",
                "author": "EastCoastTone96"
            },
            {
                "raw_content": "what is an online game trial?",
                "author": "arosal8093"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "9 hours to go I'm so excited",
        "score": 82,
        "text_content": "Is anyone else super excited about the release in 9 hours? Which starter will you be using? Go go pokemon go!!",
        "comments": [
            {
                "raw_content": "Whats dropping? Pokemon game?",
                "author": "Nelsonius1"
            },
            {
                "raw_content": "This post belongs in r/tomorrow lol",
                "author": "HonestWhile2486"
            },
            {
                "raw_content": "I lost interest in Pokémon awhile ago, but I hope you all have a ton of fun!",
                "author": "Gold_Assembly"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Six More Game Modes Could Be Coming To Battlefield 6 - Insider Gaming",
        "score": 237,
        "text_content": "According to data obtained by Insider Gaming, 6 more game modes are likely coming to Battlefield 6. Two of them are already known as confirmed (Sabatoge and Strikepoint), but there are four more listed in the files. Source: [https://insider-gaming.com/six-more-game-modes-could-be-coming-to-battlefield-6-datamine-reveals/](https://insider-gaming.com/six-more-game-modes-could-be-coming-to-battlefield-6-datamine-reveals/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": ">Looking at the strings found shows modes called “Raid”, “Payload”, “Sabotage”, “Squad Shootout”, “Strikepoint”, and “TankHunt” Since OP was too lazy to write them out",
                "author": "Fluffy_Moose_73"
            },
            {
                "raw_content": "This game doesn't need a lot of game modes tho, we have portal for that. More maps are just needed",
                "author": "Brilliant_Writing497"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Riot Games is hiring for a new unannounced FPS game set in the Valorant universe",
        "score": 183,
        "text_content": "[Source](https://thegamepost.com/riot-games-developing-new-unannounced-fps-game-valorant-universe/) \"Experience creating characters for the FPS genre. Experience working on a highly recognizable stylized game. Experience working with modern game engines such as Unity, Unreal, or proprietary technologies. Familiarity with the Valorant IP.\"",
        "comments": [
            {
                "raw_content": "This could literally just be valorant itself no?",
                "author": "Narutohatake"
            },
            {
                "raw_content": "Yeah none of this indicates it’s another Valorant game this could very easily be a position on the main game. Edit: here’s the egg on my face: the article says “unpublished R&D product” so could be something internal but there’s a chance it’s a separate thing because product can be a broad term.",
                "author": "r_lucasite"
            },
            {
                "raw_content": "obviously extraction shooter unless they went the looter shooter way",
                "author": "MediocreSumo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Billbil-kun: PS Plus Extra games are Silent Hill 2, Until Dawn (2024), As Dusk Falls, Tekken 3, V Rising, and Tomb Raider Anniversary",
        "score": 452,
        "text_content": "Source: https://www.dealabs.com/magazine/ps-plus-dautres-titres-dont-une-exclu-ps5-viennent-etoffer-le-catalogue-de-jeux-doctobre-2025-60636",
        "comments": [
            {
                "raw_content": "Nice, I've been interested in seeing what's new in the until dawn remake but not for $60",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Jesus it’s been one year since SH2",
                "author": "cc17776"
            },
            {
                "raw_content": "Such a good month for PS plus, excited for V Rising",
                "author": "suerteinsan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MLB The Show could be coming to PC",
        "score": 228,
        "text_content": "According to a job listing from Sony San Diego studio. they mention AAA PC title in the job description. https://job-boards.greenhouse.io/sonyinteractiveentertainmentglobal/jobs/5585604004",
        "comments": [
            {
                "raw_content": "Today I learned MLB The Show wasn't on PC",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Wasn't San Diego working on Marvel Tokon as a support studio? So there's a chance that's it, but I find it curious that they haven't expanded that game to PC.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "Was it not?!",
                "author": "trojanreddit"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "HUGE LEAK: Full 5-Book Story Plot for the Upcoming Avatar Fighting Game",
        "score": 240,
        "text_content": "This material was obtained through internal sources familiar with the project's development and represents the complete narrative design for the single-player campaign. This saga is a massive, high-stakes crossover that deals with the fate of the spiritual world itself. ​The Core Crisis: The Harmonic Rift ​The entire story is built around a monumental spiritual threat: the Harmonic Rift, a tear in the fabric of reality that originated when Avatar Wan first sealed Vaatu, the Spirit of Chaos, inside the Tree of Time. This rift is ruled by a chaotic new spirit named Dhukah (the spirit of impermanence), who intends to use the growing chaos to free and merge with Vaatu, thus ending all reality. ​Book 1: Attachment ​The Set-up: Avatars Aang (struggling with his moral choice before facing Ozai) and Korra (recovering from emotional trauma) are both grappling with inner doubt when they are separately approached by the spirit Dhukah. ​The Pull: Dhukah lures the Avatars into the Harmonic Rift, a dimension where time and geography are fractured, promising to connect them. ​The Antagonist: They encounter Yuka, a waterbender who was a pirate from Avatar Kyoshi's era. Yuka now serves Dhukah and uses a unique fighting style combining ancient waterbending with modern Korra-era technology. ​Climax: Aang and Korra finally achieve a physical meeting, but the spiritual link between them causes the Rift to destabilize, pulling all their most strongly-connected friends and foes into the chaos. ​Book 2: Imbalance ​Forced Teams: Heroes are separated and forced into desperate, cross-era teams in the shifting reality: ​Katara, Zuko, and Zaheer find themselves together at the Northern Water Tribe. ​Toph, Lin Beifong, and Uncle Iroh are thrown together, with the mother and daughter constantly clashing. ​Aang meets his future son, Tenzin, and they journey together. ​The Vaatu Connection: When Korra faces Yuka, she feels a strange, malicious pull inside her—the spirit of Vaatu stirring prematurely, confirming the urgency of the threat. ​Book 3: Imbalance (Part 2) ​The Clashes: The teams converge on Republic City, battling Anchors (shadow versions of characters that manifest from psychological weaknesses) to stabilize the Rift. ​Major Confrontations: Tenzin and the Korra-era characters recognize and confront Zaheer. Korra fights Azula, telling the disgraced princess she sees her own shattered confidence reflected in Azula's eyes. ​The Avatar Showdown: Avatar Kyoshi makes her entrance and demands Aang and Korra attack and destroy Dhukah immediately. A philosophical conflict ensues between Kyoshi and Aang, culminating in them both entering the Avatar State and fighting each other, which destabilizes the Rift and buries Aang, Korra, and Katara deeper into the chaos. ​Book 4: Dharma ​Searching for Answers: The remaining heroes seek a way to break through Dhukah's defenses. Tenzin and Iroh travel to Wan Shi Tong's Library to research the spirit of impermanence. ​The Ultimate Price: Aang is guided by Avatar Wan in the Spirit Wilds. Korra is forced into a confrontation where Vaatu emerges from her thousands of years ahead of time, merging with the sealed spirit. Zaheer is horrified at the chaotic tyrant he helped create, while Aang and Korra are banished into the Void. ​Kyoshi's Choice: Kyoshi and Toph confront Yuka. Kyoshi declares this is her fight and sacrifices herself to completely remove Yuka from the Rift, intentionally leaving her own final destiny unclear. ​Book 5: Impermanence (The End) ​The Void: Katara plunges herself into the Void of Impermanence and is guided by her love for Aang to find him and Korra. ​The Final Truth: Guided by the voice of Guru Pathik, Aang and Korra realize they cannot beat Dhukah while spiritually connected—they were brought here by their shared doubt. ​Purification: Aang and Korra sever their spiritual link and, fighting individually, they assail Dhukah from different timelines. In the final stage, they use their power to purify Dhukah (similar to how Korra purified dark spirits). ​Resolution: With Dhukah purified, Vaatu—who is not yet 100% restored—cannot maintain the Rift, and it begins to unravel. All characters are sent back to their original timelines after a final farewell, leaving Aang and Korra confident they can face their respective futures.",
        "comments": [
            {
                "raw_content": "Well I hope this is real. If it gets taken down, I am inclined to believe it",
                "author": "Poetryisalive"
            },
            {
                "raw_content": "Wait, they are actually attempting to tell a competent original story here? Huh. I might actual have interest now.",
                "author": "supermariozelda"
            },
            {
                "raw_content": "If this is real then the last of the 12 launch characters might be: Zaheer, Iroh, Beifong, Tenzin and Kyoshi. Yuka sounds like maybe a boss character but could also be playable instead of one of the above.",
                "author": "TrepieFF"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra X9 388H with Arc Xe3 iGPU scores over 6300 in Time Spy, 30% faster than Lunar Lake",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To summarize from the article for some folks: 6300 puts this GPU as 33.4% faster than the 140V, 71.3% faster than the 890M, and 54.3% of the 8060S. Just over half of Strix Halo's top config. Bear in mind though, that this benchmark favors ARC GPUs compared to gaming results. The 140V and 890M are roughly equal and this benchmark puts the 140V as 28.4% faster.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "Ugh, who is naming these products?!?!? Between the internal code names (which are now publicly used) and the actual product names, it's a mess. As bad as monitor naming.",
                "author": "grendelone"
            },
            {
                "raw_content": "This sound more realistic and not as good as the 50% better Intel announced. For Intels sake I am hoping the 50% is real",
                "author": "No-Relationship8261"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD next-gen “Zen 6” CPUs rumored to support 600/800-series motherboards with both 32 MB and 64 MB BIOS",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "As expected. It would be bad pr if it wan't. For the smaller BIOS ones, they can always shave off zen4 support. Or delet some of those bitmap images from the BIOS UI which can be used for more microcode.",
                "author": "menstrualobster"
            },
            {
                "raw_content": "10800X3D",
                "author": "TheCrispyChaos"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor launches Radeon RX 9070 XT Hellhound REVA Edition graphics card",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd buy it",
                "author": "BucDan"
            },
            {
                "raw_content": "normalize anime chicks on gpus again!",
                "author": "zoomcar222"
            },
            {
                "raw_content": "I would buy if it was non xt",
                "author": "Plenty_Reception_431"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Builders Stay Cautious as Single-Family Permits Weaken",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Will Smith Eating Spaghetti in Veo 3.1",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's even crazier when you realize the original \"Will Smith eating spaghetti\" was generated in 2023. It's only been 2 and a half years.",
                "author": "bucky133"
            },
            {
                "raw_content": "say what you will about Will Smith but the man has become the benchmark for AI video generation, if that's not legacy building stuff, I don't know what is",
                "author": "Bleord"
            },
            {
                "raw_content": "I don't now why but Veo3 has \"this is made by AI\" feeling.",
                "author": "letmebackagain"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The butthole logo has to be intentional at this point.",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what has been seen cannot be unseen",
                "author": "c0l0n3lp4n1c"
            },
            {
                "raw_content": "It literally cannot be anything else at this point",
                "author": "PigOfFire"
            },
            {
                "raw_content": "r/angryupvote",
                "author": "RevoDS"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora goes up to 15 second generations for normal users and 25 seconds for Pro users",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sora 2 is really amazing . Big leap ahead. It renewed my faith in the pace of progress. I can't see how we won't have Hollywood blockbusters within a couple years",
                "author": "floodgater"
            },
            {
                "raw_content": "Just tried it as a Pro user and damn impressive.",
                "author": "Its_not_a_tumor"
            },
            {
                "raw_content": "Holy Jesus they’re giving away even more compute time?! Their API charges $0.1 per second (for the standard version). If their costs are half of that, they’re now spending $0.75 per video. That’s several dollars a day at least per user, and upwards of $22.50 per day per user (at 30 videos a day). Considering potentially millions of users already, this is one of the biggest giveaway of all time.",
                "author": "DynamicNostalgia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New OpenAI model spotted on OpenRouter: \"gpt-5-image\"",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How does it compare to Gemini 2.5 Flash Image/ Nano Banana?",
                "author": "Conscious_Warrior"
            },
            {
                "raw_content": "I just an AI that generates image better than Seedance",
                "author": "liquidflamingos"
            },
            {
                "raw_content": "When will it arrive at LMArena?",
                "author": "Casq-qsaC_178_GAP073"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Made with open source software, what will it be like in a year?",
        "score": 600,
        "text_content": "Made using ComfyUI, WAN2.1 Infinitetalk, VibeVoice, Midnight-Miqu-70B-v1.5, and ffmpeg.",
        "comments": [
            {
                "raw_content": "I would be stoked if there were interactive series that would generate based on your inputs... Or if you could speak to characters and modify the plot .. like an infinite choose your own ending book",
                "author": "Few-Preparation3"
            },
            {
                "raw_content": "My guess would be that in a year, doing longer videos like this one will be much more accessible and easier to do. Right now it takes significant human efforts to do this. And costs will go down.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "https://i.redd.it/uzmn1ao9abvf1.gif",
                "author": "141_1337"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro spotted",
        "score": 243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If it's free like Gemini 2.5 Pro is, I'll quite literally go cuckoo. Perhaps even zany.",
                "author": "New_Equinox"
            },
            {
                "raw_content": "It is all shit posting until it isn’t!",
                "author": "HotDogDay82"
            },
            {
                "raw_content": "Can’t wait. I use Gemini a lot (ai studio). It’s a really, really good model. A few days ago I had a conversation with a length of 150k tokens then it started hallucinating unfortunately but it was very productive before that. I use Claude for code but I literally cannot live without Gemini anymore. I’ve become dependent on it",
                "author": "rafark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anduril showcases EagleEye; it lets Warfighters control unmanned systems and call fires with a hands-free HUD",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soon enough we'll have robots with guns being controlled by 16 year olds with Xbox controllers teabagging the oppressed...",
                "author": "bonecows"
            },
            {
                "raw_content": "PlayStation ass experience",
                "author": "hisglasses66"
            },
            {
                "raw_content": "And then they'll use it on their own citizens. Stop marketing this shit for them.",
                "author": "iStaticccc"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro: Retro Nintendo Sim one shot – with proof & prompt",
        "score": 481,
        "text_content": "source: [https://x.com/chetaslua/status/1978438353918779461](https://x.com/chetaslua/status/1978438353918779461) proof: [https://x.com/chetaslua/status/1978438358197043549](https://x.com/chetaslua/status/1978438358197043549) demo: [https://codepen.io/ChetasLua/pen/JoGrxYz](https://codepen.io/ChetasLua/pen/JoGrxYz) prompt: Design and create a nintendo switch sim like full functional features from , first make most beautiful nintendo switch console exterior super detailed super mario street fighters car racing to pokemon red full clone All buttons is functional with touch and also we can press same button in keyboard to use those Use whatever libraries to get this done but make sure I can paste it all into a single HTML file and open it in Chrome.make it interesting and highly detail , shows details that no one expected go full creative and full beauty in one code block",
        "comments": [
            {
                "raw_content": "Please stay where you are Nintendo lawyers are converging in your location.",
                "author": "141_1337"
            },
            {
                "raw_content": "ship it",
                "author": "TheAuthorBTLG_"
            },
            {
                "raw_content": "Holy shit and with that disaster of a prompt is amazing",
                "author": "ShadowbanRevival"
            }
        ],
        "subreddit": "singularity"
    }
]