[
    {
        "post_name": "OH CANADA! The Pattullo Bridge was named in honor of Thomas Dufferin Pattullo, the 22nd Premier of British Columbia. It is being torn down and replaced with another bridge with a gobbledygook name no one can pronounce in a language that was apparently just made up.",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Canada isn't a real place.",
                "author": "MOLON-LABE"
            },
            {
                "raw_content": "It's probably still gonna be called the Pattullo bridge everywhere except some obscure local government document.",
                "author": "DoMe22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JB Pritzker Goes After President Trump Over Supposedly ‘Racist’ Obama Video Where the Illinois Governor Appears as an Elephant and the Social Media Replies Are Brutal",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get in my belly!!🤣",
                "author": "wst4"
            },
            {
                "raw_content": "Sloppy and rotund",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Normal white people don't care about racism anymore. Anyone who cares about racism already thought Trump was racist just because he's white. So this is an empty statement.",
                "author": "buchanancanon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MN Dem Candidate Shares’ ICE Fear’ Food Deliveries — Mom of Daughter Left Disabled by Illegal Hits Back",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leftists live in a parallel universe. They legitimately believe ICE is not law enforcement, and that they just go around shooting and arresting random brown people.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. John Fetterman just DEMANDED VOTER ID — infuriating Democrats. “And now me, as a Democrat, I do not believe that it’s unreasonable to show I.D. just to vote!”",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The lump has reason.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America’s Elections are Rigged, Stolen, and a Laughingstock all over the World. We are either going to fix them, or we won’t have a Country any longer. I am asking all Republicans to fight for the following: SAVE AMERICA ACT!",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Our Retardican \"leaders\" have no interest in winning anything",
                "author": "Sea_Still"
            },
            {
                "raw_content": "No one who receives income from the government should be able to vote. Conflict of interest.",
                "author": "SwedishChainsaw2"
            },
            {
                "raw_content": "They should rename the bill something less Trumpian. Make the Democrats vote “no” on the “Show ID to Vote” Act. Make it more clear what they’re opposing.",
                "author": "ModsAreSchmucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vermont spent $8 million on electric buses that don’t work in cold weather. They must have forgotten winter.",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's nothing on earth like a genuine, bona fide, electrified, six-car monorail!",
                "author": "canadianhere"
            },
            {
                "raw_content": "They knew...just another slush fund to raid.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Actually they only paid 2.5 Million for the buses, .5 million went into the pockets of the grifters who endorsed buying the buses.",
                "author": "Kilroy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here are the names of the 51 intel officials who conspired and I overthrew the United States government:",
        "score": 1206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ho hum…yawn. Somebody please wake me when (even) one of the 51 is arrested. Yawn",
                "author": "IAmRetard"
            },
            {
                "raw_content": "Have them all put to death.",
                "author": "Somebody157"
            },
            {
                "raw_content": "This has been out for awhile now. Arrest them already.",
                "author": "Websitesdown"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pakistani rapist let off after he agrees to have his own sister raped by his victim's brother.",
        "score": 556,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Plot twist, they're already cousins!",
                "author": "SWRAD"
            },
            {
                "raw_content": "> Published: 11:51 GMT, 26 March 2018 an oldie but a goodie, just like your mom",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "I love how the capital of Pakistan is “Islam Bad”",
                "author": "ModsAreSchmucks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Epstein–Bill Gates–JPMorgan vaccine/pandemic profiteering complex warrants federal investigation.",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "unpardon Fauci",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Absolutely. Let's get a couple dozen committee's going who can investigate for a few months till we move on and then determine there's nothing to investigate. Government is just one huge horse and pony show and we're all just standing around eating popcorn and clapping.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Don't tell clueless Pam Bondi. Nothing will be done and nothing will happen. She and Trump stopped the America First movement we had 6 months after the election.",
                "author": "Hamilton_Miller"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Celebrating an important moment in black history",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm surprised this low IQ shit knew how to trigger the fire alarm.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Chirp, ironically",
                "author": "kippo_hard"
            },
            {
                "raw_content": "Imagine if a J6er had pulled a fire alarm. Prob 15-30 years, no trial.",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Curse Strikes Again!",
        "score": 495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She forgot to shut up ad ski.",
                "author": "LostElf"
            },
            {
                "raw_content": "Victim of a right wing attack CNN-",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Oh no! anyway...",
                "author": "FLIBS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wall Street Mav @WallStreetMav · Trump during his first term started a trend that has dramatically reduced China's imports to the USA, as a percentage of all US imports.",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make Temu nonexistant again.",
                "author": "TooBright"
            },
            {
                "raw_content": "It’s moved from China to Mexico. When we take over Mexico and make it a non-voting part of the empire, we will have great domestic manufacturing!",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "No country should supply more than 5% of our imports as a national security measure.",
                "author": "Redeemable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Never forget how an 18 year old active duty service member was treated for refusing to take the experimental mRNA injection",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One always has a choice to do good or evil. All those officers, should be removed from duty with no pay, permanently.",
                "author": "Somebody157"
            },
            {
                "raw_content": "Grok sez: >This appears to be the case of USAF SrA Lance Castle, a veteran (not 18-year-old) who refused the COVID vaccine. He was arrested in April 2023, held 60 days pre-trial, and court-martialed on charges like desertion and disrespect. He was acquitted on all counts in September 2023 but reportedly demoted later. The mandate was rescinded in Jan 2023. He was a SSgt, busted to SrA. Follow the link to X for more info.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": "Bro they dont give a f about you. You are literally worth less than a chicken or a beetle to them. Stop being their slave.",
                "author": "LinnocenceDeLame"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here's the NFLs halftime show",
        "score": 326,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# HOMOSEXUALITY # IS MENTAL ILLNESS. *Change My Mind*",
                "author": "MarylandRepublic"
            },
            {
                "raw_content": "Disgusting, send him to be Alligator feed.",
                "author": "MeMargie"
            },
            {
                "raw_content": "Faggot",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bongina didn't do shit.",
        "score": 306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's weird is how Dan just came back and is doing his show like he never left. There's this gaping hole in what he focuses on, like he's been told to shut up about the J6 pipe bomber and whatnot. The show is............ *different*",
                "author": "NewJerseyRepublic"
            },
            {
                "raw_content": "Has somebody done the obvious and checked the meta data in the doc to see if the document was really created after JE was dead and so the date typed in was just a typo? Confirm that and then you have something.",
                "author": "Boobarino"
            },
            {
                "raw_content": "Blockhead Bongina is a complete embarrassment. His recent rants have been pathetic. Just go away Dan. You had a chance to really make a difference. You turtled for your greatest ally. What a gutless turd.",
                "author": "Sgt_Hulka"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Doesn't make sense.",
        "score": 598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "H1Bs should only exist in the following scenario: Step 1: offer job to Americans Step 2: if no qualified americans can be found increase salary for position for Americans Step 3: if no qualified Americans can be found again, increase salary again for Americans Step 4: if no qualified Americans can be found again, increase salary again for Americans …. Step 999: if no qualified Americans can be found again, increase salary again for Americans Step 1000: if you have not found an American willing to do what is necessary to become qualified for this job, society has probably collapsed, the world might have long died after nuclear holocaust caused by the international cliques / enclave groups, people probably don’t exist, it if they do, yeah sure, put out a Craigslist and see if anyone from India wants to come on over",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Preach, brother! Say it louder for the brothers and sisters in the back.",
                "author": "sobriquet"
            },
            {
                "raw_content": "Like a good neighbor - State Farm's got thousands of them. We call it Bombay/Normal instead of Bloomington/Normal.",
                "author": "JoeDapper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐸 GM 🥶",
        "score": 694,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was 80 here yesterday. Don't worry, you'll be laughing in 6 months when it's 115 here.",
                "author": "DeploraBen"
            },
            {
                "raw_content": "Yes, it is very cold: https://patriots.win/p/1ASFcjZKbo/damn-that-is-cold/c/",
                "author": "MEGAWATTMAGASIGN"
            },
            {
                "raw_content": "GM ☕︎𓆏",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Germans work hard their entire lives and don’t get this kind of luxury. The Mohamoud family gets it for free.",
        "score": 897,
        "text_content": "",
        "comments": [
            {
                "raw_content": "11 children and a grandchild OK, so American blacks aren't the only ones pulling that shit?",
                "author": "vote_for_MAGA_2020"
            },
            {
                "raw_content": "All tbose rooms! *Chirp chirp chirp chirp chirp chirp chirp",
                "author": "Antero"
            },
            {
                "raw_content": "",
                "author": ""
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Women's Downhill Skier Breezy Johnson Captures Team USA's First 2026 Olympic Gold Medal 🇺🇸🥇",
        "score": 267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good job, Breezy!! 🇺🇸🇺🇸 We all feel ya 🙏",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "I'm interested in the way she represents the United States, bc I don't want to be sending ungrateful shitbags to wear a flag they hate",
                "author": "Dieselslacker"
            },
            {
                "raw_content": "So did Vonn trash America and Trump during the Olympic press conference?",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am full-on 100% cheering against the US Olympic faggots and any other such faggots that would still wear masks. Absolutely incredible. They just ignore that masks failed everywhere on earth and rush back to their completely useless ritual like we’re back in 2020.",
        "score": 821,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Womens sports = lol",
                "author": "SimaYi"
            },
            {
                "raw_content": "I care more about them being America-hating communists than them wearing retarded masks.",
                "author": "MondayCoupleIsDead"
            },
            {
                "raw_content": "This will be the worst US performance in the Olympics ever. Bank on it.",
                "author": "keeptherepublic1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Move over, MacBook: The new Dell XPS 14 is now the longest-lasting laptop we’ve ever tested",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$2300 CAD for 16 GB LPDDR5X, 512 GB SSD. 😭",
                "author": "InadequateUsername"
            },
            {
                "raw_content": "That is impressive, presumably most Panther Lake machines with reasonable batteries will have exceptionally good battery life. I hope Windows plays nice with them as regards sleep etc, that's really a matter of ensuring everyone's drivers play along.",
                "author": "jenny_905"
            },
            {
                "raw_content": "I see Dell and I know the price is bonkers",
                "author": "salmonmilks"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Last Week on My Mac: Why E cores make Apple silicon fast",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why the M chips feel so snappy even when you compare them with equivalent Geekbench x86 chips for example. Efficient cores on x86 is still new but not correctly leveraged by Windows. Linux on the other hand is on the level as MacOs on this part, thanks to the intense integration of Linux powered ARM devices for 2 decades now",
                "author": "MiHumainMiRobot"
            },
            {
                "raw_content": ">The first and last M-series chips to have only two E cores were the M1 Pro and Max, since when every one has had at least four E cores, and some as many as six or eight. Intriguing question. How many E cores is enough?",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell XPS 14 2026 review: Fully reborn with Intel Panther Lake X7",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At that price it’s competing with 14” MacBook Pro with the full die M4 Pro chip (14 core cpu, 20 core iGP). I don’t know if it’d compare favourably in any way.",
                "author": "996forever"
            },
            {
                "raw_content": "Pros: + significant design improvements over previous gen + near RTX 4050-level gaming performance + strong graphics performance-per-watt + strong speakers for the size + long battery life Cons: - smaller screen size than outgoing XPS 14 design - limited Turbo Boost sustainability - key feedback still feels shallow - where is the camera shutter? - no more MicroSD slot",
                "author": "Antonis_32"
            },
            {
                "raw_content": "Is anyone going to include the current generation of Thunderbolt in their Panther Lake laptops? I'm yet to see it. I'm also surprised that reviewers apparently haven't noticed that they're not including it.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sandisk's rebranded Optimus SSDs now available at eye-watering $999 for 2TB, $1,799 for 4TB — Optimus brings a 5% MSRP over previous models, but WD Black predecessors can still be found for less",
        "score": 510,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Excuse me but just... what?",
                "author": "horrorwood"
            },
            {
                "raw_content": "$1K for 2TB? I got a 2TB ~~970~~ 990 evo plus for $150 and I got sad when it was discounted to $100 later. This is 10x the price for what?",
                "author": "battler624"
            },
            {
                "raw_content": "In December of 2024 I bought 6x WD SN850X 4TB for a total price *after taxes* that was less than the price of 1 of these new 4TB drives *before taxes*. And it wasn’t even close… it was a few hundred dollars less. Wild.",
                "author": "Stingray88"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I Tested Snapdragon X2 Elite Early - Performance Preview",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like I opened reddit at a good time! So it seems they are testing the **non extreme** variant. Lowest 18 core SKU without the 5ghz boost and 192-bit bus. With limited tested as you'd expect great CPU performance. No nuanced power consumption analysis, but at similar TDP with highest end PTL, \\~47% faster in CBr24 nT, \\~12% faster in 1T. \\~72% faster in CPU rendering in blender and \\~47% in CPU transcode in Handbrake. 12.5% more total cores in X2E than PTL, though, in comparison PTL heterogeneous core design is much different to X2E with fewer performant cores. If there were still a u/TwelveSilverSwords around, I'd like to see an analysis on ppa of these cores. Top of my head I don't know the sizes of PTL's compute tile and X2E's die. As for GPU, this is interesting. Just a few samples, but it's no slouch (not like before with X1). Possibly more driver improvements (also check out [ARM64EC](https://youtu.be/3yDXyW1WERg?si=mxaZfuGsSv87zHFD&t=1895))and the flagship X2Ee yet to be seen, this'll be def interesting to follow. HW acceleration in Resolve is something QC need to catch up on. Apple's and Intel's media engine capabilities are still class leading but again, in the future with possible improvements this will be interesting to follow.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Meta / rant: The gen-on-gen comparison is *rather* misleading. He is comparing the X2E 88 (18C, nearly highest X2E clocks) vs the X1E 78 (12C, slowest X1E SKU, **no Turbo**). I do not know why this problem affects many laptop reviewers. Desktop reviews usually get it. Nobody would test a **9900X** (12C, nearly highest 1T clocks) vs a **7600X** (6C, slowest 1T clocks) and then claim (3:45): \"*Let's be honest, this kind of performance uplift in a single generation is huge*.\" Mate, you are not comparing a single generation leap. We also jumped like 5+ CPUs up in the product stack. The appropriate comparison does (or rather will) exist: the X2E 78 exists, another 12C, low-tier SKU. We saw the same with the X9 388H (PTL) being compared to then mid-tier CPUs. // Laptop reviewers seem notorious for no clocks / cores on each CPU in the charts: it'd be beneficial, with the alphabet soup AMD, Intel, and Qualcomm use, for more clarity what SKU is what. On desktop, we can match by price. ***If*** the X2E 88 *is* found in all the cheaper laptops that housed the X1E 78, it makes more sense. But until then, just match the SKUs or provide that context for users. // Also, it seems like this has slower perf / GHz 1T on CB2024? Some quick maths: X1E 78 (108 pts / 3.4 GHz): 31.8 Pts / GHz X2E 88 (146 pts / 4.7 GHz): 31.0 Pts / GHz I would for more optimizations, but ASUS specifically said the Cinebench numbers were in line, so it is weird. However, it *may* be like Geekerwan's 8EG5 results, where the CPU actually notably throttles at 1T boost, so it can't hold the 4.7 GHz clock (thus dividing by 4.7 GHz is not accurate).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "this is the most edgy thumbnail i’ve ever seen",
                "author": "xX_CommentTroll_Xx"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Germany pivots to Korean chipmakers as Intel retreats",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been trying to keep up; what led to Intel's Europe foundry business being derailed? Was it not being able to secure the 3rd party wafer orders to justify the build outs?",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "To produce which chips?",
                "author": "KeyboardG"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch Pro 2 controller might be one of the best ever",
        "score": 719,
        "text_content": "My gf got me a new Switch 2 Pro controller for my upcoming birthday. At first, I was like, “It’s just another controller.” I already had the first-gen Pro, so I didn’t think much of it—until I actually held it. The feel is completely different. First off, it’s lighter and the build quality just screams premium. It also feels slightly smaller than the original. But the real game-changer was playing Mario Kart World with it. The HD rumble is on another level—way more detailed, like the new Joy-Con. And the sticks… I don’t even know how to describe it, but they’re so smooth. Buttons feel better too, almost silent and more comfortable. Overall, if you’re on the fence about getting one, I’d say this is easily one of the best controllers out there right now. The lack of analog triggers is a bummer—especially with rumors about Forza Horizon 5 maybe coming to Switch 2—but honestly, it’s not a dealbreaker. TL;DR: Switch Pro 2 controller = lightweight, premium, smoother sticks, improved rumble. No analog triggers, but still highly recommended.",
        "comments": [
            {
                "raw_content": "The battery life blows my mind",
                "author": "Mashm4n"
            },
            {
                "raw_content": "It is very good. And the back buttons are really appreciated (I use it for the R3/L3 because I don't like clicking the sticks too much) in a \"standard\" controller. Nice size too. And battery life is incredible. My only complaint is that I find it a bit too light. I don't know, it feels a bit \"empty\" when compared to the Series X or PS5 controller, in my opinion.",
                "author": "Panoptes91"
            },
            {
                "raw_content": "https://preview.redd.it/tx69rk896aig1.jpeg?width=3000&format=pjpg&auto=webp&s=6a5a3e86a6adebe2b02f88cef0248bd8f7816427 Literally bought one today! So blown away with the build quality. It feels incredibly premium and smooth.",
                "author": "Rockalot_L"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m obsessed with this damn game",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m loving it, too! Can’t wait for Rebirth!",
                "author": "Jealous_Inevitable33"
            },
            {
                "raw_content": "Agreed I play it every night I just got to chapter 17 feels bitter sweet it’s about to end but at least we got Rebirth soon",
                "author": "Jeezy52"
            },
            {
                "raw_content": "I do highly recommend you play the original before rebirth as it's story is VERY important to rebirth same with crisis core after but it's good the og game has cheats(that's how I played it it makes it faster and makes you be able to focus on the Story)",
                "author": "patricklarsendk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Which Pikachu dock cover do you prefer?",
        "score": 79,
        "text_content": "I originally made the all yellow one but then it seemed like it might be a little too much so I changed it up. I see plusses for both so i thought I’d poll the audience.",
        "comments": [
            {
                "raw_content": "They’re both cool but I’d say 2.",
                "author": "Stik601"
            },
            {
                "raw_content": "the yellow one looks way cooler imo",
                "author": "No-Character3592"
            },
            {
                "raw_content": "All yellow.",
                "author": "Sasanachal"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are going to buy resident evil requiem?",
        "score": 38,
        "text_content": "Do you guys think it will be a good port? I wanted to support the developers but I'm worried that the PS5 version is better",
        "comments": [
            {
                "raw_content": "Why do people put themselves in this mindset? Of course the ps5 version will run better than the switch version. However, the switch version is 60fps and capcom seems to have put so much effort and advertisement into the switch 2 version. So I’m expecting it to at least be functional throughout the gameplay and will be getting it on the switch 2 over my ps5",
                "author": "xYehox"
            },
            {
                "raw_content": "Yes. Getting the triple pack",
                "author": "wiidsmoker"
            },
            {
                "raw_content": "No. I’m too scared to play it.",
                "author": "OmegaMaster8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Concrete release dates are pretty big, important announcements actually",
        "score": 51,
        "text_content": "Probably the most common criticism about the recent Partner Direct was there weren't enough new announcements and that 'we already knew' about games like Fallout 4, Indiana Jones and Final Fantasy VII Rebirth. And on the one hand, yeah, that's not incorrect. But on the other hand, we had no real idea when any of them were coming, which - for me at least - makes it a bit hard to get excited for them. Like, when Elden Ring was announced way way back at the Switch 2 reveal, yeah, that was a cool announcement. Yet the reality is that here we are in early 2026 not only with no Elden Ring but no idea when it might appear after it missed its initial 2025 window. We now know the same will not be happening (or at least is massively unlikely to happen) with the games mentioned above - and that's surely a huge positive. With Fallout 4 and Indiana Jones having been initially given just '2026' as a release year, that's already a long ass time to cover and, as seen with Elden Ring (and Final Fantasy VII Remake actually) it's always very possible to see games slip into the following year. Instead, we now know these 'big' games are coming and coming very soon. We will actually be playing them instead of just wondering about them. For me, the thing I most want from any Direct is to fill up my upcoming wishlist, and that's exactly what this Partner Direct has done. The first half of this year now has more than enough games to keep me very occupied and that's really all I care about.",
        "comments": [
            {
                "raw_content": "I have lots of games to play like Yakuza, Final Fantasy, 007, Indiana Jones, Pragmata etc... Though I understand the traditional Switch user who plays a Switch for Nintendo games, may be a bit disappointed. 3rd party games will be carrying the first 12-18 months, and atleast that line up of games is extremely strong.",
                "author": "B0bcat5"
            },
            {
                "raw_content": "My only criticism regarding the direct was ending with Bethesda. I think ending with FF Rebirth would have a bigger impact. Yeah, we knew it was coming but not so soon.",
                "author": "kahabraham"
            },
            {
                "raw_content": "I agree! It feels like there is a very vocal minority online who is only interested in mainline Zelda/Mario/Smash and in day-one releases of brand-new games and complains loudly and widely when these very specific titles are not delivered, but for those of us who are interested in a wider variety of games and/or do not own a gaming PC or PS5/Xbox Series, the current Switch 2 lineup is a smorgasbord of games. I'm a fan of most of Nintendo's first-party series (basically everything but Smash and Metroid) and adore RPGs of any kind, so the first half of this year is draining my fun budget (and free time!) to the dregs. FF VII Remake in January, DQ VII Reimagined in February, Pokopia and MH Stories 3 in March, Tomodachi Life in April, FF VII Rebirth in June, Digimon Time Stranger in July, and likely Yoshi and the Mysterious Book and Fire Emblem Fates' Weave releasing at some point within the April-July window, as well. I literally will not be able to buy all these games on day one *because I don't have enough time to play them* since I'm an adult with a full-time job, a house to look after and a semblance of a social life to maintain. I'm pretty sure that those complaining that there are no new or exciting games to play on the console either are only fans of a couple of very specific Nintendo IPs or have another platform that they have already played every recent third-party game on.",
                "author": "Jooles95"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PLAY PRAGMATA",
        "score": 195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I thought it was interesting and has a lot of potential!! Will be picking it up for sure",
                "author": "hal-incandeza"
            },
            {
                "raw_content": "Being old suck. My gaming twitch is so bad now. Before I could beat Mike Tyson on NES. Now I can't. Pragmata looks cool, but doing the unlock part, I feel like I'm too slow.",
                "author": "brandont04"
            },
            {
                "raw_content": "Pleasantly surprised",
                "author": "GoldenAgeGamer72"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just got all the Diana sketches in the Pragmata demo",
        "score": 137,
        "text_content": "There are 8 in total. It's safe to say I really enjoyed this game. I'm glad they released a demo. Every game should have demos!",
        "comments": [
            {
                "raw_content": "I dunno. Something about her design doesn't sit well with me. I'm getting Bride of Chucky vibes from her.",
                "author": "Alvin-Earthworm"
            },
            {
                "raw_content": "God damn record time lol. I can’t wait to play this on my new OLED",
                "author": "Aggressive-Hyena5532"
            },
            {
                "raw_content": "Very nice! I did as well. The demo instantly clicked with me and I loved it.",
                "author": "Redred1717"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Windows Central - Xbox Next Gen is Running Full Windows 11, Console Like Interface, 2027 Launch is “Best Case Scenario”, Xbox First Party Handheld, OEM Consoles for Higher End and Lower End",
        "score": 311,
        "text_content": "[https://www.windowscentral.com/gaming/xbox/exclusive-the-next-gen-xbox-2027-locked-in-most-ambitious](https://www.windowscentral.com/gaming/xbox/exclusive-the-next-gen-xbox-2027-locked-in-most-ambitious) Xbox Next Gen capable of running full Windows 11, by default will have a console like interface Microsoft surprised by AMD CEO’s comments of supporting Xbox launch in 2027, still polishing on Windows 11 console interface. 2027 launch is “best case scenario.” OEM consoles by manufacturers like ASUS. First Party Xbox serves as baseline, could see more higher end premium consoles from OEMs as well as cheaper slimmed down versions from a variety of companies Xbox first party handheld in development",
        "comments": [
            {
                "raw_content": "I’m unsure why there keeps being news about this. We’ve known this for at least like, a year and a half. The next Xbox is just a living room PC.",
                "author": "alexjimithing"
            },
            {
                "raw_content": "How are they going to make money if it’s like a pc, wouldn’t mos people buy their games from steam",
                "author": "ZenitsuSakia"
            },
            {
                "raw_content": "“Sorry, you need to update your calculator app before you can boot Halo” -next Xbox",
                "author": "Dr_Mantis_Trafalgar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Windows Central & Tom Warren: Xbox looking to merge PC Game Pass with Xbox Game Pass Premium + Xbox seeking more bundles with third-party services for Game Pass",
        "score": 317,
        "text_content": "Key Quotes >The news comes from Tom Warren of The Verge, and [the latest edition of his weekly Microsoft column Notepad](https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad) in particular. He reports that in addition to potentially testing free [Xbox Cloud Gaming](https://www.windowscentral.com/tag/xbox-cloud-gaming) soon for a possible launch later in 2026, Microsoft is also looking to \"expand\" [Xbox Game Pass](https://www.windowscentral.com/tag/xbox-game-pass), and \"is in the early stages of exploring ways\" to do so. >Specifically, Warren says that the firm might be planning to merge the [PC Game Pass](https://www.windowscentral.com/tag/pc-game-pass) tier with another, such as [Xbox Game Pass](https://www.windowscentral.com/tag/xbox-game-pass) Premium; Windows Central can corroborate this with our own sources. He also notes that Microsoft is looking to bundle more third-party services with Game Pass memberships. >\"While the free Xbox [Cloud Gaming](https://www.windowscentral.com/tag/cloud-gaming) won’t be a new Game Pass tier, sources tell me Microsoft is in the early stages of exploring ways to expand its Game Pass subscription lineup,\" Warren reports. \"I understand that Microsoft is looking at ways to bundle third-party services with Game Pass subscriptions and potentially even merge Xbox Game Pass Premium and PC Game Pass together.\" Sources Tom Article: [https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad](https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad) Windows Central: [https://www.windowscentral.com/gaming/xbox/microsoft-plans-to-expand-xbox-game-pass-and-merge-pc-game-pass-with-another-tier-more-third-party-service-bundles-may-be-on-the-way-too](https://www.windowscentral.com/gaming/xbox/microsoft-plans-to-expand-xbox-game-pass-and-merge-pc-game-pass-with-another-tier-more-third-party-service-bundles-may-be-on-the-way-too)",
        "comments": [
            {
                "raw_content": "#Tom Warren is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Get ready for $40 a month Gamepass lmao",
                "author": "KooTheBird"
            },
            {
                "raw_content": "Gotta find some way to raise those prices again.",
                "author": "UnTaG83d"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "All upcoming rumoured RE games/content.",
        "score": 245,
        "text_content": "**In-development:** \\- *Resident Evil Requiem (2026)* Leon previously rumoured from [**Dusk Golem**](https://xcancel.com/aestheticgamer1/status/1931146096807702994?s=46) \\- *Resident Evil Requiem Alyssa DLC (2026)* From [**Dusk Golem**](https://xcancel.com/AestheticGamer1/status/2014825268079440276) \\- *Resident Evil 2/3/4 remakes native ports on Switch 2 (2026)* From [**NateTheHate**](https://www.youtube.com/watch?v=JwMQiG9bc4c) \\- *Resident Evil CODE:Veronica remake (early 2027)* From [**NateTheHate**](https://xcancel.com/natethehate2/status/2014767509803512263?s=46) and [**Dusk Golem**](https://xcancel.com/i/status/2012597154825515449) \\- *Resident Evil 0 remake (2028)* From [**MP1st**](https://mp1st.com/news/report-resident-evil-0-remake-in-development-new-casting-and-plot-details-unearthed) and [**Dusk Golem**](https://xcancel.com/AestheticGamer1/status/1795075373727613065?s=20) \\- *Resident Evil 10 (??)* From [**Dusk Golem**](https://xcancel.com/aestheticgamer1/status/1960759958850691089?s=46) **Not in-development:** \\- *Resident Evil 5 remake (??)* From [**Dusk Golem**](https://xcancel.com/i/status/2012597154825515449) **Uncertain/cancelled:** *- Biohazard HUNK (??)* From [**Dusk Golem**](https://xcancel.com/aestheticgamer1/status/2014825996948799597?s=46) *- Resident Evil Revelations 3 (??)* From [**Dusk Golem**](https://xcancel.com/aestheticgamer1/status/2014825996948799597?s=46) *- Resident Evil 1 RE remake (??)* From [**DanielRPK**](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1cqllq0/danielrpk_a_resident_evil_1_remake_is_in/)",
        "comments": [
            {
                "raw_content": "![gif](giphy|uUnPYB37kLHvFnH4bi)",
                "author": "SwordsAndTurt"
            },
            {
                "raw_content": "Resident evil is in it's current golden era. I'm all for it. I'm currently in a RE marathon.",
                "author": "TheMink0921"
            },
            {
                "raw_content": "i feel like before remaking 5, i want a remake of 1 in third person perspective like 2 remake basically and everything after we getting cvx, so going back to 1 and do that again would be good and it would build up wesker even more and then do 5 idk if they will do 6, especially because 6 takes way more work anyway and 5 takes a lot of work too, cvx and 1 are definitely something they should do first",
                "author": "Luf2222"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mihir Sheth, Sr. Product Development Director at PlayStation has retweeted last year's February State of Play announcement",
        "score": 491,
        "text_content": "[Mihir Sheth](https://xcancel.com/search?f=tweets&q=Youtheremehere), Sr. Product Development Director at PlayStation has retweeted last year's February State of Play announcement [[Screenshot](https://imgur.com/a/kmEDxZw)] My guess is that the subconscious has probably betrayed him because the rumoured state of play may also be this year's 12th of February Edit 1: He has deleted the retweet",
        "comments": [
            {
                "raw_content": "Sounds like the name of a boss from a soulslike",
                "author": "Lemickworth"
            },
            {
                "raw_content": "I just hope we'll finally see that God of War 2.5D game.",
                "author": "poklane"
            },
            {
                "raw_content": "My guess for what’s in it is a big focus on Saros and Marathon, new Marvel Tokon characters and finally the 2.5d god of war game and maybe the Firesprite horror game.",
                "author": "Kind_Development708"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi hints at Halo Campaign Evolved releasing before September.",
        "score": 268,
        "text_content": "Source: [https://www.resetera.com/threads/xbox-game-studios-bethesda-abk-ot36-oops-all-obsidian.1310962/page-270#post-151000852](https://www.resetera.com/threads/xbox-game-studios-bethesda-abk-ot36-oops-all-obsidian.1310962/page-270#post-151000852) Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qwrpq3/the\\_verge\\_xbox\\_plans\\_for\\_2026\\_halo\\_gears\\_kiln\\_etc/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qwrpq3/the_verge_xbox_plans_for_2026_halo_gears_kiln_etc/)",
        "comments": [
            {
                "raw_content": "I bet they wanted November because of the 25th anniversary since they also dropped Combat Evolved Anniversary on the 10th anniversary of CE and MCC on the 10th anniversary of Halo 2, but then GTA got delayed",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Yea the verge already told us nice try",
                "author": "FlattedFifth"
            },
            {
                "raw_content": "I think July is probably the target. September is way too close to GTA.",
                "author": "GoodSelective"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A new Tumblr page has supposedly leaked screenshots and information about DELTARUNE Chapter 5",
        "score": 174,
        "text_content": "[ https://www.tumblr.com/dr-anon2026 ](https://www.tumblr.com/dr-anon2026) Take it with a massive grain of salt, due to as far as I know, Deltarune stuff rarely gets leaked outside of any official partners or intel accidentally being posted early. Also all of the screenshots are from the Japanese version. Here’s a rundown of all the major information with the important stuff in bold: •Chapter 5 begins extremely similarly to Chapter 1 •**The Voice** talks to the player yet again •**The beginning of Chapter 5 is the Festival** •Half-way through the festival we enter the Dark World which is, indeed, via **Flower King** •Chapter 5 opens up with Kris & Susie in a large field, with a giant silhouette in front of a pink & gold sky (seems to be either Asgore or a Titan?) •Kris & Susie are trying to find Ralsei while enemies attack from the bushes •New enemies include *Magimagikun,* an unnamed blue species with red armor, and some shadowy cat-like creatures \\*•\\*Ralsei is kidnapped by a group of NPC’s lead by a, *“tall lady,”* who is apparently named **Estoc** according to a shopkeep •Something happens were Estoc invites the Fun Gang to join her in the **Royal Garden** •Something happens that makes **The Soul leave Kris**, which results in a chase scene. Kris chases the soul while throwing objects at it •After escaping the garden, a hall of roses would appear, with shadows of **cats** coming from them. These cats try to attack the Fun Gang will bullets via a giant Paw •Kris & Susie are benched for a segment of the chapter (something happens were they get super sleepy), and **you take control of Ralsei**…sort of. •**The Soul once again escapes from Kris and leads Ralsei via shining their light.** •**Ralsei is seemingly getting the Secret Boss this chapter** (akin to Spamton & Kris and Gerson & Susie) •No information on the Weird Route •**You can only fight Estoc with Ralsei** •Estoc turns the Soul **Purple** akin to Undertale’s Muffet •Ralsei will get a **new weapon** at the end of the Secret Route •**The Heroes of TV Time** reappear for the Chapter’s **Egg Route** •Chapter 5’s Flower King Dark World is a giant Castle with fields of flowers and a noticeable amount of cherry blossoms •**The Roaring Knight** appears at the very end of the Chapter •Asgore, *“does something,”* to Estoc •No mention of **Sans** in the Chapter so far •No word on if the **Six Flowers** will appear, although the **Blue Flower** has a role in the **Egg Route** •Estoc’s Lightner form has something to do with **pens & paper** •Chapter 5 **WILL** expand on I**mage\\_Friend** \\*\\*•Queen will be fighting with the Fun Gang in the Party Dojo (\\*\\*the screenshot noticeably shows her against Tenna) •Egg Mission involves backtracking through the castle and back into Flower King, and something about a wheat field and the Heroes of TV Time •Ralsei’s **HP** apparently grows **twice towards the end of the Chapter** *To be updated if there is any more information…*",
        "comments": [
            {
                "raw_content": "I feel like this is a hoax. It's very very easy to rip sprites and replicate Deltarune's art style. I doubt anyone on Toby Fox's team would actually leak the new chapter.",
                "author": "OpeningConnect54"
            },
            {
                "raw_content": "Feel free to correct me if I’m wrong but I just can’t imagine a game with such a small(?) team as Deltarune leaking especially in this capacity",
                "author": "Crabacus"
            },
            {
                "raw_content": "For previous chapters, localization was finished **before** any console porting started. For the upcoming chapter the translation is still ongoing. “But what if they’re just testing it on console?” That doesn’t really make sense. Testing a build with unfinished localization would mean doing extra work for no benefit, there’s also nothing meaningful to “test” about localization itself at this stage. Either the text is finished, proofread, and implemented, or it isn’t. Console testing is about things like new bugs, performance, and controller support, not placeholder or incomplete dialogue. **TL;DR:** They can’t be running the chapter on consoles yet because the translation isn’t done. The leak doesn’t add up.",
                "author": "BeastMsterThing2022"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dell XPS 14 2026 review: Fully reborn with Intel Panther Lake X7",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, Lunar Lake was really built different. Mich better battery life and almost 2 years old wow.",
                "author": "Minimum_Leadership51"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock says latest AMD X870 and X870E beta BIOS fixes boot failures on certain CPU configurations",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Certain CPU configurations.” That reminds me of these certain DDR5 modules that are certified at ultra-high speeds, but you can’t buy because they’re only engineering samples.",
                "author": "sascharobi"
            },
            {
                "raw_content": "Certain?",
                "author": "riba2233"
            },
            {
                "raw_content": "I installed it will tell you when I get home it happens most common for me and always after a cold boot.",
                "author": "zenoen"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "California ballot proposal would exempt seniors from paying property taxes",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They already own everything",
                "author": "Nearby-Poetry-5060"
            },
            {
                "raw_content": "All seniors? Including millionaires and billionaires? Mansions and castles?",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "Lets rename this \"The Boomers final fuck you to younger generations!\" Lets be honest here, they have screwed every younger generation with their never ending greed its in ways that no other generation in history has envisioned.",
                "author": "Coupe368"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage and refinance interest rates today, February 7, 2026: Back under 6%",
        "score": 68,
        "text_content": "Encouraging news on mortgage rates. The 10 year yield decisively moved lower as people finally exit frothy crypto and speculative stocks and even precious metals and move into the safety of US Treasuries.",
        "comments": [
            {
                "raw_content": "Hopefully this continues dropping further. Would love to see it hit 5% so I can refi.",
                "author": "atlsan26"
            },
            {
                "raw_content": "Mortgage rates lowering any significant amount quickly will prolong the bubble and cause harm to everyone except the ultra rich. More buyers flood the market. Prices skyrocket again. Properly tax, remodels, maintenance all increase. As such, rent will increase. As such, people will demand more money. As such everything increases. Even if you own, this isn't good for you. Your homes worth is traded value. If your house doubles, so does the upgrade you want. It doesn't help us retirement either. Because if your house doubles, eventually so does retirement living facilities, medical expenses, etc. It is like people have no memory of even the past only 7 years ago. The only way you could argue this MIGHT help the masses is for first time buyers that, in all honesty, shouldn't be buying a house. If you need 3% on a 850k dollar property, all you are saying is you want to owe the bank 1.4 million after 30 years. An extra 600k. Not to mention your down payment would be 170k... Good luck. And monthly payments after everything will be 3-4k Seriously, this only helps the banks/ultra wealthy. Demand better. Fix the real issue. Salaries have not kept up. Build more housing.",
                "author": "PolyBend"
            },
            {
                "raw_content": "The millions of homeowners absolutely want their values to go up. Suggesting otherwise is ridiculous. Can people recognize that Homeowners are the silent majority and the loud minority of people outside of homeownership that want a house and hope for a crash are not practical? The complaining on Reddit about cheaper housing or building more is just venting and will never happen. Buy now, build equity, get ahead. I am not a realtor and I am just part of the same system we all inherited. But this screaming into the void about prices going up being bad for everyone is nonsense. Also, Homeowners vote, renters don't.",
                "author": "Gr1009"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In these major U.S. cities, earning $150,000 a year no longer guarantees a comfortable life",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wtf is dailyw*ii*re.com?",
                "author": "vtstang66"
            },
            {
                "raw_content": "A comfortable life is 4 walls and a roof in any location. -Gen X",
                "author": "KoRaZee"
            },
            {
                "raw_content": "150k never guarantees a comfortable life",
                "author": "DumpingAI"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Incomes would need to rise nearly $50,000 for median-priced homes to be as affordable as they were in 2019",
        "score": 522,
        "text_content": "Did you see how they spun this headline to make it seem like it's an income problem (\"you need to step up\"), versus an outlandish home price problem? It's like those women with unrealistic dating expectations. The 2nd bullet point acknowledges that a 56% rise in income is unrealistic, but at the same time, the 3rd bullet point states that they expect home prices to (somehow) continue rising, as if it's some kind of foregone conclusion. The mainstream media keeps hoping buyers are still living under a rock, while simultaneously pumping sellers with hopeium drugs, as if home prices aren't declining everywhere outside the Northeast ....and even then, the actual sales are slowing down. Which means that if they can't sell the house, they're stuck with that house for life, along with all of its carrying costs. * Housing affordability has deteriorated sharply since 2019, with mortgage payments now consuming over 30% of median household income. * Restoring 2019 affordability would require either a 56% jump in median income or mortgage rates falling back to \\~2.65%, neither of which is realistic. * Even if rates fall, home prices are expected to keep rising because demand will rebound faster than supply. * The core issue is a 4‑million‑home national shortage, driven by zoning limits and slow permitting. * Regional timelines vary dramatically: the South could close its housing gap in \\~3 years, while the Northeast is projected not to close it at all under current trends.",
        "comments": [
            {
                "raw_content": "Yup it's LITERALLY as simple as this. You have EVERYTHING priced highee since COVID...fucking everything...but wages have not kept up AT ALL. I'm not saying shit needs to be 1:1 but are you fucking kidding me?",
                "author": "btoned"
            },
            {
                "raw_content": "Anything to keep my house listed at 3 million that I bought for $300k",
                "author": "toolateforfate"
            },
            {
                "raw_content": "Boomers ruined every young persons life. I don’t mean average people but every politician, banker, etc.",
                "author": "NYCTS9719"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "1102 Benjamin Franklin Dr #310 Lido Surf And Sand",
        "score": 0,
        "text_content": "Luxury beachfront condo on Lido Beach in Sarasota, Florida. Fully renovated with Gulf views, a massive private balcony, and resort-style amenities. Sharing a full walk-through and lifestyle tour of one of Sarasota’s most desirable beachfront locations. \\#lidobeach #Beachfrontcondo #jennsellsgulfcoast #sarasotaliving #waterfront property",
        "comments": [
            {
                "raw_content": "Must be tough in FL is these listings are coming to reddit. Just eat the loss dude...move on.",
                "author": "dnr41418"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "POV: You ask Opus 4.6 to change a 3 to a 4 on your frontend.",
        "score": 102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Write for loop",
                "author": "Brilliant_War4087"
            },
            {
                "raw_content": "Lol it output a document for me, which was great. Then I was like, \"oooh I forgot to include this section of the contract, can you paste it in there?\" So I copy paste and run it. I'm not sure what it did for 5 minutes, but it sure as hell was thinking for way longer than it should have.",
                "author": "reddit_is_geh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The AI boom is so huge it’s causing shortages everywhere else",
        "score": 205,
        "text_content": "The Washington Post reports that the rapid expansion of AI infrastructure is placing growing pressure on other parts of the economy. Five leading public AI companies are collectively on track to spend about **$700B** this year on large-scale projects, primarily data centers filled with powerful computer chips. This level of spending is **nearly double** what they spent in 2025 and is comparable to roughly three-quarters of the annual U.S. military budget. This type of investment is contributing to shortages of skilled labor such as electricians, rising construction costs & tighter supplies of computer chips. **Industry analysts** said this has already pushed up prices for memory chips used in smartphones and computers, with higher consumer electronics prices expected to follow. The data center construction boom is also drawing workers and resources away from other types of building projects, while smaller technology firms face declining **access** to funding as investment becomes increasingly concentrated among a small number of large AI companies. **Source:** The Washington Post (Exclusive)",
        "comments": [
            {
                "raw_content": "**From Source:** https://preview.redd.it/vl3zd5kr49ig1.png?width=1080&format=png&auto=webp&s=ca89d28f726c2da90560bb41e24d69c141735a43",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "If they're already hitting $700 billion, where's the cap? How long is a typical spending cycle of this sort? Even if it's just 5 years that would probably suggest a cap of $2T",
                "author": "No_Aesthetic"
            },
            {
                "raw_content": "Comparing it specifically to the military budget was probably not the best idea. 😬",
                "author": "Altruistic-Skill8667"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Stealth model dropped on OpenRouter and nobody knows who made it",
        "score": 103,
        "text_content": "https://preview.redd.it/huqol422e9ig1.jpg?width=796&format=pjpg&auto=webp&s=82a1b197dd3237a5d434070a6141a6cb80a9e873 https://preview.redd.it/2qjv0222e9ig1.jpg?width=805&format=pjpg&auto=webp&s=33a0e0de8e2ad628aa8752f8487e99db863ece73 OpenRouter just added a stealth model called Pony Alpha with zero info about which lab built it. Claims: next-gen foundation model, strong at coding/reasoning/roleplay, optimized for agentic workflows, architecture refactoring with dense logic reasoning. Speculations are around Sonnet 4.6, Deepseek v4, Grok 4.20 and GLM 5. What is your take?",
        "comments": [
            {
                "raw_content": "It's GLM-5. A few days ago Zhipu announced [they were racing to launch GLM-5 ahead of China's Lunar New Year](https://www.techinasia.com/news/chinas-zhipu-ai-to-launch-glm-5-model-ahead-of-lunar-new-year).",
                "author": "Arcosim"
            },
            {
                "raw_content": "GLM 5",
                "author": "Eyelbee"
            },
            {
                "raw_content": "It says it's glm most of the time, it has Chinese history censorship, it's intro description is the same as other glm models.",
                "author": "the_shadowmind"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's first hardware product will be AI-powered earbuds, codenamed \"Dime\"",
        "score": 165,
        "text_content": "OpenAI reportedly planning AI earbuds ahead of more advanced device, points to an audio-focused wearable(simple headphone) rather than a more complex standalone device. OpenAI may launch a simpler version than expected first, delaying a more advanced design beyond 2026. **Source:** [Mint](https://www.google.com/amp/s/www.livemint.com/technology/tech-news/openai-reportedly-planning-ai-earbuds-ahead-of-more-advanced-device/amp-11770469908801.html) / AA",
        "comments": [
            {
                "raw_content": "Alexa would have worked if this would work. The lack of multimodal options is a deal breaker. Better smart glasses are more likely a success, unless these ear buds can somehow project something in front of users.",
                "author": "imdaviddunn"
            },
            {
                "raw_content": "Niw why would openAI go into hardware now? What’s next, smartphone? Just goes to show that they don’t know how to use their technology, as no one is adapting it beyond chat (writer and coder). And i am not hating, i am just trying to understand, as i don’t see people buying this + subscription to chatgpt, to do what? What kind of problem is this solving?",
                "author": "nekize"
            },
            {
                "raw_content": "**Dime\\~> A nod to the US 10-cent coin** https://preview.redd.it/8t6ghwg6b8ig1.png?width=1080&format=png&auto=webp&s=c3de8fdad3befae8570d3a66dbd48bff22f27cb2",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OAI researcher Noam Brown responds to question about absurd METR pace saying it will continue and METR will have trouble measuring time horizons that long by end of year",
        "score": 293,
        "text_content": "Link to twitter thread: https://x.com/polynoamial/status/2020236875496321526?s=20",
        "comments": [
            {
                "raw_content": "The *upper bound* of the confidence interval is pushing past 16 hours. I think they already have issues measuring the longer time horizon tasks.",
                "author": "GeneralZain"
            },
            {
                "raw_content": "Doubling every 4 months means week long tasks by the EOY at 50% reliability. With more datacenters coming online the rate might even accelerate. Buckle up, I guess.",
                "author": "Maleficent_Care_7044"
            },
            {
                "raw_content": "FYI his response is in a second screenshot. It was too hard to fit it in the first",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Saturates anthropic AI R&D evaluations btw.",
        "score": 141,
        "text_content": "Feel like not enough people are taking about this so...",
        "comments": [
            {
                "raw_content": "Anthropic benchmaxing their own benchmarks... Jokes aside, it reminds me when I think Anthropic or OpenAI said that it kept taking longer and longer for their in-house experts to come up with harder and harder task that the models didn't just steamroll.",
                "author": "CheekyBastard55"
            },
            {
                "raw_content": "I'm confused... could you explain? If 0 of 16 thought the models could be a drop in researcher, isn't that pretty poor performance on a benchmark?",
                "author": "Rd545454"
            },
            {
                "raw_content": "Can you link to the content itself ?",
                "author": "Eeameku"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic releasing a 2.5x faster version of Opus 4.6.",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yes, get we can 0.25 speed but 4x usage?",
                "author": "pjotrusss"
            },
            {
                "raw_content": "Can we have one that's 1/4 the speed but extra economical?",
                "author": "acutelychronicpanic"
            },
            {
                "raw_content": "https://preview.redd.it/5mryuql7m4ig1.jpeg?width=1170&format=pjpg&auto=webp&s=d6a801ac5dd30b4c7f26007593cf72c1d4294f73 Deal breaker",
                "author": "RedRock727"
            }
        ],
        "subreddit": "singularity"
    }
]