[
    {
        "post_name": "Panama AG: Hong Kong Company Granted ‘Unconstitutional’ Canal Contract. Chyna is running the canal still.",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MAGA Canal now bitches",
                "author": "MikesCock12"
            },
            {
                "raw_content": "More shocking revelations for today. Still winning the war but lost some battles.",
                "author": "HeyBlinkin"
            },
            {
                "raw_content": "take it back",
                "author": "dorkana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mel Gibson's blistering attack on Gavin Newsom in surprise speech: '[Newsom] is gonna \"build back better.\" That’s a catchy little phrase,' he said. 'I have another \"B\" word there. It's called \"bulllshit.'",
        "score": 619,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a B word for you Mel! BASED",
                "author": "BigIgloo"
            },
            {
                "raw_content": "I can't wait for Passion the Christ 2. Movie is going to be Epic.",
                "author": "Threaper666"
            },
            {
                "raw_content": "They are going to erect six story communist-style Section 8 housing for illegals and everyone darker than a graham cracker. Whitey will pick up the tab.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Poll shows democrats are idiots who think Joe Biden left the US-Mexico border open on accident.",
        "score": 610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they are retarded",
                "author": "ShotgunParade69x"
            },
            {
                "raw_content": "Democrats don’t even know if they’re a man or woman, you can’t expect any smarts from these retards",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "whoops!",
                "author": "Raetchel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today, the MAGA movement made its stance clear: Anything less than full government transparency is unacceptable.",
        "score": 1740,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pam wasn’t transparent last night in that interview that’s for sure, we all knew it was sketch, and she obviously wasn’t transparent to what was going on. Why?",
                "author": "SquirreleeDan"
            },
            {
                "raw_content": "Nah I keep seeing cope-ers I am NOT a blackpiller, but this was a red line. I am NOT letting Sessions/2-more-weeks/2016 happen again. @realdonaldtrump get control of YOUR FUCKING SHIT, WHY ARE YOU NOT TWEETING AT PAM BONDI RIGHT NOW WITH YOUR TYPICAL PASSIVE-AGGRESSION? WHY RADIO SILENCE? the only on the ball person I see is Elon, he at least was meming about the files, then retweeted something regarding the botched release Trump meanwhile: crickets",
                "author": "assblast"
            },
            {
                "raw_content": "No more strongly worded letters. No more talking tough on Fox. No more Qtard two more weeks. No more tweets with siren emojis and “breaking news.”",
                "author": "Swaraj_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's a genius move.",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "perfect flair 👌",
                "author": "Skogin"
            },
            {
                "raw_content": "That’s the reason for almost every problem in California",
                "author": "ViagraFalls"
            },
            {
                "raw_content": "Even my annoyingly cell phone fact checking zoomer son laughed",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kash Patel vows to 'swiftly pursue' those who undermine FBI after AG Pam Bondi reveals FBI NY office withheld Epstein documents",
        "score": 2008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KASH AND BONDI SHOULD BE AT SDNY BUILDING RIGHT THIS FUCKING MINUTE HANDCUFFING AND RETRIEVING DOCUMENTS. JFC. DOOOOO SOMETHING.",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Also, bring the guards that were supposed to be guarding him in for questioning",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "He should have gone there tonight.",
                "author": "JohnN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FBI is entering a new era—one that will be defined by integrity, accountability, and the unwavering pursuit of justice. There will be no cover-ups, no missing documents, and no stone left unturned — and anyone from the prior or current Bureau who undermines this will be swiftly pursued.",
        "score": 1491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Talk is cheap. How about walk the walk first?",
                "author": "ConGrande1"
            },
            {
                "raw_content": "Today is your opportunity to prove it, Kash.",
                "author": "Dereliction"
            },
            {
                "raw_content": "If the SHIT doesn't HIT THE FAN right after 8 a.m. (because we all know fibs won't deliver), these are not serious people.",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mozilla just changed the Firefox TOS. If you're a privacy person, might be time to move off.",
        "score": 901,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mozilla use to be about privacy and freedom and now it's owned by a group of trans'd bigots that want to slurp up every bit of data",
                "author": "Genji_Sama"
            },
            {
                "raw_content": "Brave browser. Nuff said.",
                "author": "Sanjyuuichi3"
            },
            {
                "raw_content": "Darn. So which browsers should we opt to use? Brave?",
                "author": "Chinese"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump suspended all security clearances and contracts with Covington and Burling. Guess who else works there now:",
        "score": 1247,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That bitch needs to meet the rope... after a fair trial of course...",
                "author": "TheOne1"
            },
            {
                "raw_content": "Is there someone whose job it is to specifically make sure the clearances and contracts have been cancelled? Because if there isn't, they won't.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "The Traitorous Ukraine Bitch!",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal Judge Rules Against CIA DEI Hires, Says President Trump CAN Fire Employees. Federal Judge Trenga today ruled against CIA DEI Employees “John Does 1-6” and “Jane Does 1-5,” who sued the Trump Admin to keep their jobs. The CIA is planning to conduct its largest mass firing since 1977...",
        "score": 1114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The largest mass firing since Carter? But it's OK when Carter did it, because democrat.",
                "author": "DebunkTheLeft"
            },
            {
                "raw_content": "Every new president cleans house. Why do the commie rats think Trump is not allowed?",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Mass firings < mass firing squads",
                "author": "MAGATRON2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In an attempt to appease President Trump, the Mexican government just agreed to send 30 cartel members to the United States to be prosecuted.",
        "score": 1777,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A better question is: Are we really just going to gloss over the fact that apparently the Mexican government can just up and decide to hand over these cartel leaders whenever they feel like it, just like that?",
                "author": "DeathBattleFan123"
            },
            {
                "raw_content": "Well this should narrow things down. Whichever cartels did NOT get their leaders snatched up are clearly the ones supporting her and the ones we need to take down the most.",
                "author": "QuickMaths"
            },
            {
                "raw_content": "Good I guess. Since they have no constitutional rights, they don't need any trial. Just throw them in Gitmo.",
                "author": "nylentone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just announced Hung Cao as Under Secretary of the United States Navy. Cao ran for Senate in Virginia last year and made waves with his amazing life story.",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I loved him in Mortal Kombat",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "That guy is BASED. I was bummed he didn't win, but so happy to hear he's appointed a role in this admin.",
                "author": "teleomorph"
            },
            {
                "raw_content": "Hang Cao is amazing and I really liked learning about his story last year. Can't quite remember what podcast it was but one of them. Maybe Timcast?",
                "author": "Yheymos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is badly needed - US Navy secretary nominee says Trump texts him in the middle of the night about rusty warships",
        "score": 1310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Appearance is a good indicator of capability, he's right to want ships maintained.",
                "author": "Hantif"
            },
            {
                "raw_content": "Imagine getting a phone call at 3:30 AM from DJT? \"The ships are so rusty\"",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Merchant ships constantly perform maintenance at sea. Why can’t USN sailors use a needle gun and slap some paint?",
                "author": "bahhumbugger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Turner: \"We’re tearing up the Obama-Biden “Zoning Tax” and saving America’s suburbs.\"",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There was significant pressure put on rural areas to stop developing single family homes and instead develop higher density communities. We are in Michigan and our township of ~16,000, primarily democrats, has been pushing condos and apartments, not single family homes in an acre of land. That was an Obama priority and I’m glad it is dead.",
                "author": "ThatThereComputer"
            },
            {
                "raw_content": "Good. The radical left wanted to eliminate local control over zoning, and use “affordable” housing as a back door to racially integrate predominantly White and middle/upper class areas. The goal wasn’t to put a roof over someone’s head. It was to fulfill progressive fantasyland stuff by giving poor people subsidized access to areas they otherwise wouldn’t be able to afford. And I bring up racial integration because the demographics of some of these big city housing authorities heavily (80-90% or more) skew towards black or brown people.",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "They FUCKED me with this one where I live. We went from single family homes to suddenly, fucking low income bullshit trailer homes and apartments within too close of proximity. and you know what happened? The nearest convenience store and liquor store had ...people... show up and start stealing.",
                "author": "MixedBlacknWhite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That’d be great",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And the redacted portions they did release are available online *without* redactions. So WTF?",
                "author": "NwrrHandshakeAccount"
            },
            {
                "raw_content": "I voted for four years of \"finding out\". Not four years of \"same shit as last time\", thanks.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "IM JUST WAITING FOR 1 GD ARREST!!",
                "author": "ArrestsWhen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liz Wheeler breaks it down",
        "score": 2095,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then why would Bondi earlier say she has the files and it’s sickening?",
                "author": "Winter_Is_Coming2020"
            },
            {
                "raw_content": "\"Bondi smelled a rat\" yet she said , and i quote \"It's sitting on my desk right now to review\" - this was a WEEK AGO. 200 pages. it takes 45 minutes to \"review\" and figure out it's all bullshit. and yet, she has done NOTHING about it for a whole fucking week",
                "author": "cptKloss2"
            },
            {
                "raw_content": "So this so-called \"bombshell declassification\" is just a heavily redacted version of the flight logs and black book we’ve already seen from years ago. They’ve somehow managed to deliver a NET NEGATIVE amount of info. And as the cherry on this shit sundae we get rickrolled by the House Judiciary GOP X account. What an absolute circus. Bring in the clowns, because this clusterfuck deserves a standing ovation for sheer absurdity",
                "author": "Haz85"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For a brief moment today you may have felt doubt, duped, or even fear. So just remember.",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein is an Israeli asset and that’s why we’re never going to get full disclosure. Simple as.",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "The man took a bullet for me, so I’ll let him cook. That said, depending how how the Epstein saga unfolds in the hours and days to come will speak volumes on his cabinet picks. My vote was not predicated solely on these documents, but I don’t want theatrics or cheap tricks to try and gain a vain W. I don’t see this as a reflection on Trump. I do see this as a reflection on how deep the corruption runs in our government. I can’t imagine this is going to be an easy battle to win. But I’m here for it.",
                "author": "powercessna"
            },
            {
                "raw_content": "What separates the winners from the losers is how a person reacts to each new twist of fate. -Donald Trump",
                "author": "JGWentsW"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Epstein’s list has been released!",
        "score": 1417,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tangino and Kash will crash the NY FBI holding onto the stuff",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Told you all that this would be another nothing burger and you all downvoted me, calling me a doomer. Now you can all go eat shit.",
                "author": "Creepy_Joe"
            },
            {
                "raw_content": "Pam Bondi literally had Alan Dershowitz work on the Redactions. You can't make it up. It's a Zionist op",
                "author": "TabberDon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "San Diego Border Patrol. ENJOY!!!",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just fucking shoot him…",
                "author": "TheRougarou"
            },
            {
                "raw_content": "Nice takedown. Even better those watching didn't care for it.",
                "author": "airborne3502"
            },
            {
                "raw_content": "If these was a scene from a 90’s movie, you would think it some dystopian hellscape. Nope, liberal world order’s San Diego.",
                "author": "LibertyStillMatters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHO Is On the Verge of Collapse",
        "score": 1491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like Dr Who has been cancelled",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Collapse faster.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "If one country pulling out ruins an entire global organization, then it shouldn't exist.",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD RDNA4 officially presented in China: Radeon RX 9070 XT priced at 4999 RMB (~$599), RX 9070 at 4499 RMB (~$549)",
        "score": 400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh thank god I hope this holds in the US. If it does, and they have stock, AMD may not have immediately killed itself this generation.",
                "author": "DreamArez"
            },
            {
                "raw_content": "If its available, Im getting one.",
                "author": "BrunoArrais85"
            },
            {
                "raw_content": "600 dollars is not bad for the 9070xt. Though the 9070 does not look that appealing at first glance being just 50 dollars cheaper than the 9070xt.",
                "author": "Rollingplasma4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD FSR 4 coming to 30+ games at launch, here's the list - VideoCardz.com",
        "score": 352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm seeing a lot of PlayStation ports in that list.",
                "author": "RxBrad"
            },
            {
                "raw_content": "No bad for a start. AMD pls convince Paradox to add it to Cities Skylines 2, sure it's ok with AFMF, but it would be much better with FSR4.",
                "author": "szczszqweqwe"
            },
            {
                "raw_content": "Kingdom Come: Deliverance II! Sweet.",
                "author": "kuddlesworth9419"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix reportedly hits 70% yield in HBM4 testing",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apparently all the skilled engineers at Samsung are finding jobs at SK Hynix.",
                "author": "trendyplanner"
            },
            {
                "raw_content": "Is that good or bad compared to previous generations?",
                "author": "DisclosureEnthusiast"
            },
            {
                "raw_content": "I never understood what yield meant in this context. I thought you either made something, or not. Is 30% of chips meeting some standard or what?",
                "author": "IshTheFace"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Japan govt to seek US tariff exemption for Rapidus' 2nm chips",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do they have room on the board for Dana White?",
                "author": "DaMan619"
            },
            {
                "raw_content": "It's a moot point anyways, rapidus won't deliver anything anytime soon.",
                "author": "Acrobatic_Age6937"
            },
            {
                "raw_content": "lol if we give Japan an exemption then everyone else would complain, not exceptions especially TSMc. Come back home to Intel baby",
                "author": "Main_Software_5830"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA emulation journey, part 1: RIVA 128 / NV3 architecture history and basic overview",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My first GPU was a Riva128 card. I held off buying a 3DFX because I felt it was a clunky setup (it could not do 2D so you had to pipe the VGA out into the card so it could then switch between the VGA and the 3D output)",
                "author": "bitflag"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 6 Gen 4 vs Dimensity 6400: One is Actually New",
        "score": 4,
        "text_content": "This month both Qualcomm and MediaTek announced their budget/mid-range mobile SoCs and thought I'd share some interesting findings about two recent releases: Qualcomm's Snapdragon 6 Gen 4 and MediaTek's Dimensity 6400. ## The Actually New One: Snapdragon 6 Gen 4 Qualcomm is making some serious moves in the budget space with their 6 Gen 4. This is a true generational upgrade with some impressive specs: * First 6-series chip on TSMC's 4nm node * First to use ARMv9-based CPU cores (Cortex-A720/A520) * CPU config: 1x A720 @ 2.3GHz + 3x A720 @ 2.2GHz + 4x A520 @ 1.8GHz * 29% GPU performance improvement over 6 Gen 3 * LPDDR5 support (3,200MHz), UFS 3.1 storage * 144Hz display support * Wi-Fi 6E and Bluetooth 5.4 * Camera support up to 200MP * Actual gaming features like frame interpolation and upscaling The most shocking part? This is apparently targeting the $100-$150 phone segment. If true, this is going to absolutely shake up the budget market. ## The \"New\" One: MediaTek Dimensity 6400 MediaTek's approach is... different. The Dimensity 6400 is essentially: * Same old 6nm TSMC process * Using ancient Cortex-A76 (from 2018!) and A55 cores * 2x A76 @ 2.5GHz + 6x A55 @ 2.0GHz * Same small Mali-G57 MC2 GPU they've been using for years * Only LPDDR4X support, UFS 2.2 storage * Wi-Fi 5 (not 6/6E) * Bluetooth 5.2 From what I can gather, this is literally just the Dimensity 6300 with a 0.1GHz overclock on the big cores. And the 6300 was just a minor refresh of the 6100+... which itself can be traced back to designs from 2021. They're basically selling 4-year-old tech as \"new.\" ## The Gap is Widening The most interesting thing here is how Qualcomm is pushing forward with actual new tech in the budget space while MediaTek is recycling old designs with minimal changes. The performance gap between these similarly positioned chips must be enormous: * ARMv9 vs ARMv8 architecture * 4nm vs 6nm process * Modern cores vs 4+ year old cores * LPDDR5 vs LPDDR4X * UFS 3.1 vs UFS 2.2 * Wi-Fi 6E vs Wi-Fi 5 It seems like Qualcomm is trying to bring flagship features down to budget phones while MediaTek is just trying to squeeze more life out of old designs.",
        "comments": [
            {
                "raw_content": "For me, MediaTek's approach with the Dimensity 6400 is particularly disappointing given the company's history as the undisputed budget SoC king. For years, MediaTek carved out a valuable niche by offering competitive performance at significantly lower prices than Qualcomm, becoming the go-to chipset provider for affordable smartphones that didn't sacrifice too much capability. Their Helio series and earlier Dimensity chips delivered remarkable value. However, this latest offering suggests a concerning shift toward minimal innovation and recycling of aging technology, merely applying small clock bumps to existing designs rather than pushing the envelope. While Qualcomm appears to be bringing meaningful advancement to the budget segment with modern architectures and manufacturing processes, MediaTek seems content to rest on its laurels, potentially surrendering its hard-won reputation as the value champion or just optimising short term gains. It's especially disappointing considering how great their recent 9000 and 8000 SoCs have been. Those new \"all big core\" designs are really pushing the envelope.",
                "author": "Balance-"
            },
            {
                "raw_content": "If the 6 gen 4 actually comes to $150 I'll eat my shoe because previous 6 gen series phones have arrived in mostly $250-350+ phones making them horrendously priced value wise.",
                "author": "RandomCheeseCake"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DLSS 4 Upscaling is Fantastic for 1440p Gaming",
        "score": 225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the texture quality/filtering between dlss 3 and 4 is literally extremely noticeable even through youtube compression. and I noticed it in all videos not just this one.",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "do 3000 series get dlls4 too?",
                "author": "Kotschcus_Domesticus"
            },
            {
                "raw_content": "DLSS is the reason I went with Nvidia actually. RT performance so-so, in some games I use RT, in some not. But DLSS gives me the ability to have higher framerates and lower power consumption at the same time, which means lower heat and noise. At small image degradation, if even that. And DLSS4 is amazing so far, even better than ever before.",
                "author": "snapdragon801"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Can't wait for these immersive landscapes in Pokemon ZA on the Switch 2 😍😍😍🤩😍🤩🤩😍",
        "score": 1569,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the texture reminds me of this https://preview.redd.it/6uzmxsm02rle1.jpeg?width=200&format=pjpg&auto=webp&s=06bb0cd667a6917d34c24f8572ff3e69313516c6",
                "author": "timboloves1989"
            },
            {
                "raw_content": "I have never played SV. Is this what it actually looks like?!/!!",
                "author": "NicholasMaximus007"
            },
            {
                "raw_content": "Watching the Xenoblade X and Pokémon announcements back to back is hilarious.",
                "author": "Pestilence95"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How some people think the switch 2 will change Pokémon ZA artstyle lmafo",
        "score": 705,
        "text_content": "\"This Will be gaming in 2013\"",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/6hkpqccoiqle1.png?width=726&format=png&auto=webp&s=436eb89ec201d82e2100f70f8e3d162ad092f1e5 the duality of man",
                "author": "AzureBeornVT"
            },
            {
                "raw_content": "I don't think it's too much to ask for a multi-billion dollar company to make an effort to have their games look good and run at a stable framerate in 2025. Like idk why you're against that",
                "author": "Oh_Its_Richard"
            },
            {
                "raw_content": "I just can't understand how they haven't AT LEAST upgraded textures. The grass and foliage in the city look like literal polygons still. Like...what are we doing??",
                "author": "Mrmeeksees"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My local bus company risking the attention of Nintendo",
        "score": 51,
        "text_content": "Also getting a bit ahead of the times",
        "comments": [
            {
                "raw_content": "Uh oh",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Oh yeah they gonna die",
                "author": "GloriousCauliflowers"
            },
            {
                "raw_content": "r/nintendoswitch3",
                "author": "madelemmy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Z-A leaked footage on Switch 2",
        "score": 287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i cant wait for it i just wanna catch a fully transformed link",
                "author": "WeirdSewer"
            },
            {
                "raw_content": "How dare you leak this, I'm calling Nintendo right now ![gif](giphy|zBoecJFTosf5e)",
                "author": "Duranu"
            },
            {
                "raw_content": "I bet this runs better than Pokemon ZA.",
                "author": "Shin_yolo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch Online removing its first game – Super Soccer to be pulled in Japan",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The game is published by Nintendo. Kind of surprised this was the first to go.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "It's the first retro game ever to be pulled from the service. Internationally, it's published by Nintendo, but in Japan it's a third-party, hence why it's only pulled from there. However, I think this proves that the third-party games can be pulled from the service at any time and they're not permanent (by that I mean until the end of the service).",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "This is a pretty big deal. One of the reasons why I used NSO's library more than PS or Xbox was the fact that they never removed their games from the service. I've spent way too much time in a game only for it to get removed from Game Pass before I could complete it. Hopefully this is just a one-off with some weird rights or something but if they take Goldeneye off I'm downgrading to base NSO for cloud saves only.",
                "author": "PersonalityNo8280"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I’m actually a big fan of the name",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t get the meme, how is the Sabrina lyric equivalent to an alternate name choice for the Switch 2?",
                "author": "gingersisking"
            },
            {
                "raw_content": "I’m apparently in the hated minority that really would have liked Super Nintendo Switch. SNS. Throw in some SNES styling, especially the grey with purple buttons 😙🤌",
                "author": "BigDad5000"
            },
            {
                "raw_content": "It was the only proper name choice. How else could they innovate that warranted a new name? They took what worked with the Switch and improved it.",
                "author": "ADXII_2641"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Opinions on the latest Pokemon ZA gameplay: do you think it was gameplay was captured on switch 1 or 2? If so, how are you feeling about the game? Any other thoughts about new mechanics, etc?",
        "score": 95,
        "text_content": "I personally feel like the graphics are screaming Switch 1 and am hoping there is an upscale for switch 2. Gameplay looks great!",
        "comments": [
            {
                "raw_content": "Switch 1 because why would they show switch 2 gameplay this is exactly the convo everyone had with Prime 4 lmafo",
                "author": "redditsucksass1028"
            },
            {
                "raw_content": "I liked it, I hope the wild zones don't feel small and cramped. I really liked how arceus gave you a big sprawling world",
                "author": "lizzofatroll"
            },
            {
                "raw_content": "This was captured on a 200$ mobile phone",
                "author": "SpotLegitimate1499"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo have recently filed a patent for Streetpass Plaza, here’s a concept I made of how it could look on the Switch 2 or as an app on your phone",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/8c0l5l18ysle1.jpeg?width=828&format=pjpg&auto=webp&s=858f8b42a904ff2caf9004246803627329f61e66",
                "author": "Clear-Anything-3186"
            },
            {
                "raw_content": "Probably because they just put the music on the app",
                "author": "Einlanzer99"
            },
            {
                "raw_content": "https://preview.redd.it/66h7bzja7tle1.jpeg?width=488&format=pjpg&auto=webp&s=4f049a160331e699299848e20773108cd2c1663a No source?",
                "author": "that_one_3DS_fan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "AMD RX 9700XT and non-xt price and release date confirmed in China",
        "score": 135,
        "text_content": "A friend of mine who works for a Chinese tech media outlet was invited to an AMD launch event in China today, where AMD revealed the price and announced the release date. The RX 9070 XT is priced at 4999 RMB (Currently 686USD, 659Euro). The RX 9070 is priced at 4,499 RMB (Currently 658USD, 633Euro)（\\*edit for wrong type）. Pre-orders open today (Feb 28th, CST), and the official launch date is March 6th(CST). In addition, he also mentioned that FSR4 will bring a 3x performance increase, and 4K performance will also be greatly improved. News should be released later today [https://imgur.com/a/8ehxyz9](https://imgur.com/a/8ehxyz9) (photo of the event scene)",
        "comments": [
            {
                "raw_content": "These prices INCLUDE VAT btw. The 5070 Ti MSRP in China is 6299 RMB which is 26% higher than the 9070 XT price If we exclude tax and consider that percentage, the 9070 XT MSRP should be $599 in the US.. tariffs notwithstanding",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Realistic lol",
                "author": "YourLocalCrackDealr"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The ZA starters were leaked 4 minutes before the Pokemon Presents",
        "score": 619,
        "text_content": "…started, so actually about 20 minutes before we saw the Pokemon ZA trailer https://boards.4chan.org/vp/thread/57461378 Alternative link: https://imgur.com/a/NbVfIJF",
        "comments": [
            {
                "raw_content": "Strange Risk to take for 4 mins of recognition",
                "author": "fortnite_pit_pus"
            },
            {
                "raw_content": "Bro's dad is about to lose his job so that this guy could get 4 minutes of fame.",
                "author": "DeMatador"
            },
            {
                "raw_content": "No way.... His dad works at Nintendo.",
                "author": "SlipperyThong"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Shadows new Gameplay and Story leaks (Massive Spoilers!!)",
        "score": 379,
        "text_content": "The videos have not been recorded or uploaded by me! I was simply given these links by my source. Ubisoft, don't send your assassins after me! There's massive spoilers so watch at your own risk! https://streamable.com/c/mzc06a?src_collection=copy_link (spoilers) https://streamable.com/c/8zimne?src_collection=copy_link (spoilers 2) https://streamable.com/c/fu8c7k?src_collection=copy_link (no spoilers) https://imgur.com/a/5rEetjh (no spoilers) 4k in game screenshots: https://imgur.com/a/4k-game-screenshots-rxQoICh Apparently review codes have been sent out on PC! These leaks and the previous ones have all been from a much older build! Today a new 25gb update was rolled out which improved dodging & parrying speed and the overall game a lot. The game runs butter smooth at 60fps on playstation.",
        "comments": [
            {
                "raw_content": "Some of the VA'ing is horrible.",
                "author": "tonightm88"
            },
            {
                "raw_content": "Naoe really is fast as hell. It's kind of funny looking, but it's great to see an actual difference in a character in an AC game. Every AC protagonist have basically been the exact same height, and moved at relatively the same speed, depending on the scale of the game world at least.",
                "author": "TheDanteEX"
            },
            {
                "raw_content": "Hey spoiler guy, any modern day story???",
                "author": "gdzaly"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sony Santa Monica’s New Job Listings Hint at a Potential God of War Project in Development",
        "score": 240,
        "text_content": "[Source](https://thegamepost.com/new-god-of-war-game-sony-santa-monica-studio-job-listings/) Sony Santa Monica recently posted two new job listings on its website, one for a Quest Designer and another for a Sr. Technical Narrative Designer. One key requirement listed further down: \"Knowledge of competitive products as well as a personal understanding of God of War games.\"",
        "comments": [
            {
                "raw_content": "You’re telling me PlayStations biggest franchise will continue?",
                "author": "SparkingLight"
            },
            {
                "raw_content": "I think the next GoW game is years away. Cory Barlog's new game will come out first and will have nothing to do with that franchise.",
                "author": "Weekly_Protection_57"
            },
            {
                "raw_content": "Breaking! Polyphony Digital's new Job Listings Hint at a potential new Gran Turismo.",
                "author": "dahatzi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "La Quimera is a new FPS from Reburn, formerly 4A Games Ukraine (Metro devs)",
        "score": 183,
        "text_content": "[https://www.gematsu.com/2025/02/reburn-formerly-4a-games-ukraine-announces-sci-fi-first-person-shooter-la-quimera-for-pc](https://www.gematsu.com/2025/02/reburn-formerly-4a-games-ukraine-announces-sci-fi-first-person-shooter-la-quimera-for-pc) original leak: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1iy08rd/it\\_seems\\_dsog\\_broke\\_embargo\\_on\\_a\\_new\\_game\\_from/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1iy08rd/it_seems_dsog_broke_embargo_on_a_new_game_from/)",
        "comments": [
            {
                "raw_content": "The wording of all of this is confusing but 4A Games has clarified. This is being made by former Metro devs. 4A Games still exist (all of their studios) and are working on games of their own.",
                "author": "RedHollowGhost"
            },
            {
                "raw_content": "There is also 4a Games Malta which is doing the Metro game i presume",
                "author": "Psychological-Row641"
            },
            {
                "raw_content": "Looks and sounds dope, heavy Killzone vibes and some of those screenshots even give Cyberpunk 2077 vibes tbh",
                "author": "PapaYoppa"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pyoro retweets Necro Felipe tweet minutes before Pokémon Presents 2/27",
        "score": 131,
        "text_content": "“Gen II/ V Lol I want to see your reactions I won’t give any hints on what I’m talking about.” https://xcancel.com/necrolipe/status/1895107914635059408?s=46",
        "comments": [
            {
                "raw_content": "#Pyoro is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Starters for legends probably",
                "author": "darkgod"
            },
            {
                "raw_content": "It was the starters for ZA, Totodile, Chikorita and Tepig",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD RDNA4 officially presented in China: Radeon RX 9070 XT priced at 4999 RMB (~$599), RX 9070 at 4499 RMB (~$549) - VideoCardz.com",
        "score": 656,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the 9070XT is actually $599 it'll probably end up being around ~8000kr for me in Sweden, at *minimum* 2500kr cheaper than the cheapest 5070TI (which doesn't exist), would be an easy buy for me.",
                "author": "Derelictcairn"
            },
            {
                "raw_content": "Looks like I'm buying a 9070 XT.",
                "author": "Deadly_Fire_Trap"
            },
            {
                "raw_content": "If it really is $600, it has the potential to be the best value gpu we’ve seen in a long time",
                "author": "hyrumwhite"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "\"All You Need for Gaming – AMD RDNA™ 4 and RX 9000 Series Reveal\" - Official AMD Presentation",
        "score": 158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You don't have to be nvidia to impress me. Just give me fair price cards with fair level improvements.",
                "author": "Snake_eyes_12"
            },
            {
                "raw_content": "Live in 9 hours (midnight Australia)",
                "author": "mechkbfan"
            },
            {
                "raw_content": "Fingers crossed the Chinese prices aren't inflated for Western markets. The RX 9070 XT for under $1,100 AUD would be a solid deal if it performs similarly to the RX 7900 XTX (which it should based on performance leaks). Come on, AMD!",
                "author": "EntryLevelDeveloper"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD FSR 4 coming to 30+ games at launch, here’s the list",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "They need FSR4 support in Cyberpunk badly, not only because it’s still a popular game, but because so many tech reviewers and enthusiasts use it as the proving ground for testing different rendering / ray tracing / upscaling techniques.",
                "author": "Slyons89"
            },
            {
                "raw_content": "5 hours to accept, really",
                "author": "MrHyperion_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9070XT 4999￥",
        "score": 44,
        "text_content": "https://preview.redd.it/3ymk6ycs7sle1.png?width=980&format=png&auto=webp&s=dd51452ebc95328e5adeb940c9d734bc8941b0d0",
        "comments": [
            {
                "raw_content": "Based on past experience, the actual exchange rate between China and the United States should be 8.4. Its price is $599, while the price of the 9070 is $549.",
                "author": "OppositeDry429"
            },
            {
                "raw_content": "Man even at 650 if the performance leaks are real this is a great price. 4080 performance for hundreds less is a buy for me. I'll be at microcenter throwing money with a smile.",
                "author": "cmcclora"
            },
            {
                "raw_content": "Market share is so important that AMD probably should sell at close to cost. After a year of strong sales & happy customers who will spread word of mouth they can increase prices to match demand. This generation is a stopgap & building market share will help UDNA take off running (if it’s any good). Ultimately without market share it’s pulling teeth to get Devs to target Radeon cards & that means performance will fall short of the cards potential.",
                "author": "mule_roany_mare"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor Radeon RX 9070 XT Hellhound Spectral White pictured: white cooler and white PCB",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "This was approved fast but took 9 hours to approve the price rumor article?",
                "author": "JesusTalksToMuch"
            },
            {
                "raw_content": "This turns me on so much 🥵",
                "author": "amk281"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "27 February 2025 - Daily /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Offered 16% less than asking on a condo in a nice area of Phoenix that has been up for 100+ days. Listing agent was offended.",
                "author": "sailormooooooooon"
            },
            {
                "raw_content": "Rise and shine bubble team",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "Muh area specual",
                "author": "JPowsRealityCheckBot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More than 80% of Americans think buying a house now is a bad idea",
        "score": 1077,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I suspect that many people in the comments section aren't old enough to understand what an underwater mortgage is like.",
                "author": "Empirical_Approach"
            },
            {
                "raw_content": "It's so much that it's a bad time to buy... It's just that it's a really bad time to have not bought a house 8 years ago.",
                "author": "IncomingAxofKindness"
            },
            {
                "raw_content": "My father in-law won’t stop advising me on how prices are dropping, that’s it’s now a buyers market and my family should buy now.",
                "author": "Walllstreetbets"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 1.0% Below 2022 Peak",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It has been over 18 years since the housing bubble peak. In the December Case-Shiller house price index released this week, the seasonally adjusted National Index (SA), was reported as being 77% above the bubble peak in 2006. However, in real terms, the National index (SA) is about 12% above the bubble peak (and historically there has been an upward slope to real house prices). The composite 20, in real terms, is 3% above the bubble peak. People usually graph nominal house prices, but it is also important to look at prices in real terms. As an example, if a house price was $300,000 in January 2010, the price would be $438,000 today adjusted for inflation (46% increase). That is why the second graph below is important - this shows \"real\" prices. The third graph shows the price-to-rent ratio, and the fourth graph is the affordability index. The last graph shows the 5-year real return based on the Case-Shiller National Index. Nominal House Prices The first graph shows the monthly Case-Shiller National Index SA, and the monthly Case-Shiller Composite 20 SA in nominal terms as reported. In nominal terms, the Case-Shiller National index (SA) and the Case-Shiller Composite 20 index (SA) are both at all times highs. Both indexes increased in December. Real House Prices The second graph shows the same two indexes in real terms (adjusted for inflation using CPI). In real terms (using CPI), the National index is 1.0% below the recent peak, and the Composite 20 index is 1.2% below the recent peak in 2022. The real National index and the Composite 20 index increased slightly in real terms in December. It has now been 31 months since the real peak in house prices. Typically, after a sharp increase in prices, it takes a number of years for real prices to reach new highs (see House Prices: 7 Years in Purgatory). There is nothing magic about “7 years”, it just made a good post title! Here is an update to the graph I included in that article: My guess on house prices is “mostly flat prices nationally in 2025” which would suggest a slight decline in real prices. In real terms, national house prices are 11.7% above the bubble peak levels. There is an upward slope to real house prices, and it has been over 18 years since the previous peak, but real prices are historically high.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Ok well \"real house prices\" are still magically unaffordable due to the high inflation, through that perspective.",
                "author": "Vrabstin"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nearly 17% of Sellers Are Slashing Prices, the Highest Share Since 2016, as More Homes Linger on the Market",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "rest of 83% live in sandy, UT",
                "author": "Electrical-Ask847"
            },
            {
                "raw_content": "Location dependent. Many counties in NJ not seeing that",
                "author": "first_life"
            },
            {
                "raw_content": "Honestly I hate when real estate pricing and demand news is told on a national scale. Real estate is so specific from market to market that these headlines barely tell us anything. It’s like giving the total runs scored in all of baseball on a given date and trying to extrapolate which teams are doing better or worse from that general number",
                "author": "harbison215"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending home sales drop to the lowest level on record in January",
        "score": 164,
        "text_content": ">Pending sales dropped 4.6% from December to the lowest level since the National Association of Realtors began tracking this metric in 2001. >While weather may have been a factor, sales rose month-to-month in the Northeast. >Home prices have been easing over the last few months in certain areas, with more sellers cutting prices, but nationally they are still higher than they were a year ago.",
        "comments": [
            {
                "raw_content": "Don’t worry, with jobless claims up and inflation up the Fed can do fuck all but cross their fingers and hope stagflation doesn’t show up.",
                "author": "fuckofakaboom"
            },
            {
                "raw_content": "Home sales look like 2008. Stock market looks like 2008. Retail looks like 2008. Sometimes when it walks like a duck, it's actually a duck. So glad I didn't buy in the last few years.",
                "author": "almighty_gourd"
            },
            {
                "raw_content": "Still not enough existing homes for sale. Unless economy goes off the cliff, this will likely not change. Thanks Fed, for the gift of 2-3% mortgages for 2 years. You’ve successfully killed the US housing market for a generation.",
                "author": "Sunny1-5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Weekly jobless claims jump to 242,000, more than expected in latest sign of economic softening",
        "score": 170,
        "text_content": ">Jobless claims for the week ending Feb. 22 totaled a seasonally adjusted 242,000, up 22,000 from the previous week’s revised level and higher than the Dow Jones estimate for 225,000. >In Washington, D.C., new claims totaled 2,047, an increase of 421, or 26%, the largest number for the city since March 25, 2023.",
        "comments": [
            {
                "raw_content": "Expect that number to climb through the spring. I could be wrong. It’s happened once before😂🤪🔫",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "That is far more than \"softening\". After 48 months of blow out jobs report, a sudden collapse in the jobs market like this is insanity. And this is just one week. What does the full month look like? Remember, a blow out jobs report is like +200,000 jobs. And we're loosing more than that per week??",
                "author": "Threeseriesforthewin"
            },
            {
                "raw_content": "Just the federal layoffs alone can spike this.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Austin Rents Tumble 22% From Peak on Massive Home Building Spree",
        "score": 73,
        "text_content": "https://www.bloomberg.com/news/features/2025-02-27/austin-rents-tumble-22-from-peak-on-massive-home-building-spree In the midst of a pandemic-era population surge, rents jumped a staggering 25% in 2021 in the Texas capital for one of the biggest increases in the nation. But a development boom and new policies encouraging housing density have sent vacancy rates soaring. Now, landlords are struggling to fill gleaming new developments and offering major discounts to lure newly empowered renters. “Nearly all apartments in Austin are doing some sort of specials for move-ins,” said Acebo, an agent with Pauly Presley Realty. One recent example: a client was searching for a one-bedroom apartment in South Austin and settled on a unit at Perch Apartments about 20 minutes from downtown. It normally would have cost $1,420 per month, but in return for applying the day after her visit and leasing at least 13 months, she received two months free rent, a waived administration fee and a $600 credit. Nowhere in the country have rents declined as much as they have in Austin — now 22% off the peak reached in August 2023, according to Redfin. The median asking rent is $1,399 per month, down $400 in less than three years. More info in the article",
        "comments": [
            {
                "raw_content": "I’d never live in Texas, but one thing I’ll give them is they continue to build build build and this is what happens when you keep flooding supply. Better for everybody but property speculators.",
                "author": "kebabmybob"
            },
            {
                "raw_content": "Home prices have also dropped from pandemic heights, down 23% since May 2022 as interest rates climbed, but like apartment rents remain well above pre-pandemic levels. The median sale price last month was $515,000, up about 34% from the median of $383,380 buyers paid in January 2020, according to Redfin.",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "I think we are kind of close to this being the norm. I feel like what people miss when they talk about hedge funds, or investors is the fact that at any time and in almost any jurisdiction, it's possible to relax zoning laws. What happens when <50% of people don't own their house? Here in Connecticut they are already floating the idea of banning Single Family zoning statewide.",
                "author": "Clean_Army_4675"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventory of New Houses for Sale Highest since 2007. Builders Push Mortgage-Rate Buydowns, Price Cuts, and Incentives",
        "score": 36,
        "text_content": "https://wolfstreet.com/2025/02/26/inventory-of-new-houses-for-sale-highest-since-2007-builders-push-mortgage-rate-buydowns-price-cuts-and-incentives/ What homebuilder Taylor Morrison said about the costs of mortgage-rate buydowns v. actual price cuts. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "Great read and very hopeful metrics for a person looking to buy soon. Happy to see it, as was foretold on this sub over these last few years. But, and you know I was going to have a “but” (which I’m accused of talking out of all the time), the inventory of existing, pre owned homes is still hard to get to. That inventory, unfortunately, will have to be forced from the hands of owners. That only comes with substantial economic downturn. Why that’s important is because that pre owned inventory might be better construction (no guarantee on that), but it IS in better locations where people want to live. We’re moving the correct direction. I see no chance that we don’t over-correct though, and throw the baby out with the bath water. Meaning, unemployment is going to go up, and that’s going to include a lot of us here.",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "I finally bought a house. I also had an internship at Morgan Stanley in the Summer of 2008. I also changed careers March 2020. Housing crash imminent.",
                "author": "Gandalfs_Shaft48"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Affordability Headwinds Driving Home Buyers’ Interest in Smaller, More Personalized Homes in 2025",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Home buyers continue to look toward smaller homes, with the median home size dropping from 2,200 square feet in 2023 to 2,150 square feet in 2024 — the lowest in 15 years — after holding strong at 2,300 square feet from 2019-2022. The same thing is happening to median lot sizes, which has dropped about 1,000 square feet in the last 15 years to 8,400 square feet. Meanwhile, townhomes are also becoming increasingly popular, comprising a record 17% of the single-family market compared to 10% in 2009. “There’s a simple reason this is happening: Townhomes are more affordable as material, lot and labor prices continue to increase,” said Rose Quint, NAHB assistant vice president of survey research. Quint highlighted that the premium buyers pay for new homes is shrinking. In 2024, the median price for existing homes increased 5% to $412,000 — the first time it has crossed the $400,000 threshold — while the median price for new homes dropped 2% to $420,000. Builders are increasing overall living space by tacking on more porches and patios, with 68% and 64% of new homes, respectively, incorporating these features. In addition to building smaller homes, they are also trying to address affordability concerns by offering sales incentives (64%) and cutting home prices (33%). Although home size preferences in general are trending smaller, exact sizes differ by generation. Millennials prefer larger homes, with a median of 2,408 square feet, while boomers are looking to downsize to an average of 1,869 square feet. Both Gen X and Gen Z are looking for homes around 2,250 square feet. Each generation is progressively more open to having a smaller home with higher-quality products and amenities versus a larger home with fewer amenities. More than half of Gen Z (53%) and millennials (52%) are willing to make that compromise, with that percentage increasing to 61% for Gen X and 70% for boomers. The same trend is true for incentivizing each generation to purchase a townhome of similar size and quality instead of a single-family home, with Gen Z looking for a 20% discount while boomers would need a discount of least 30%. There’s no major consensus among generations for exterior styles, with Gen Z and millennials leaning slightly more contemporary and Gen X and boomers preferring more traditional home styles. Builders and designers are adapting to this plurality with a mid-century modern, or “retro revival,” style — mixing clean lines with warm textures and accents. Builders can find simple solutions, such as gable windows or mixed materials, to scale these trends down to an affordable scale. Flexibility is also key for home buyers. Whether it’s designing for longevity and addressing different life stages at the onset or creating spaces that can be used for a variety of wellness activities or increased connection to nature, today’s homes need to reflect their owners and provide them a place to rejuvenate. “People are being less influenced by influencers,” said Doug Cummins, senior associate/project manager at DAHLIN Group Architecture and Planning. “Buyers are becoming more sophisticated in what they want to see in their home and make it personal to them. A really simple idea can turn that house into a home for that home buyer. It makes them feel more connected to the space that they have.” Certain preferences are common across all generations because they just make sense. Top technology features for all home buyers, for example, include security cameras, wireless security systems and video doorbells — highlighting a key interest in safety. Consistently popular features, such as the great room, laundry room and garage storage, remain important for most buyers of all generations. Other top amenities and design options include: * Drinking water filtration * Special storage racks for wine/spices in the kitchen * Both a shower stall and a tub in the primary bath * Pull-out shelves in the kitchen",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Introducing GPT-4.5",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"We will begin rolling out to Plus and Team users next week, then to Enterprise and Edu users the following week.\"",
                "author": "Vaginabones"
            },
            {
                "raw_content": "It launched immediately in the API, so OpenRouter should have it within the hour and then you can spend like $1 trying it out instead of $200/m.",
                "author": "DeadGirlDreaming"
            },
            {
                "raw_content": "Remember all the hype posts and conspiracies about Orion being so advanced they had to shut it down and fire Sam and all that? This is Orion lol. A very incremental improvement that opens up no new possibilities. Keep this in mind when you hear future whispers of amazing things they have behind closed doors that are too dangerous to announce.",
                "author": "AGI2028maybe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Watch the ChatGPT 4.5 Reveal",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very strange presentation though I can understand that demonstrating better creative writing or a better world model can be difficult. I think the difference between 4.5 and 4o is only going to become apparent when used in the LLM arena",
                "author": "Sextus_Rex"
            },
            {
                "raw_content": "No twink.",
                "author": "Ambiwlans"
            },
            {
                "raw_content": "Very bad presentation style, at times embarrassing and improvised, unprepared.",
                "author": "Josaton"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman: GPT-4.5 is a giant expensive model, but it won't crush benchmarks",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish they would tell us the parameter count.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "https://preview.redd.it/piw1k63tqqle1.jpeg?width=640&format=pjpg&auto=webp&s=b22f59e4ee11812b134217b048ce9f3bfc9688dc Yikes!",
                "author": "mxforest"
            },
            {
                "raw_content": "Given GPT4 vs 4o vs 4.5 costs, as well as other models like Llama 405B... GPT4 was supposedly a 1.8T parameter model that's a MoE. 4o was estimated to be 200B parameters and cost 30x less than 4.5. Llama 405B costs 10x less than 4.5. Ballpark estimate GPT 4.5 is ... 4.5T parameters Although I question exactly how they plan to serve this model to plus? If 4o is 30x cheaper and we only get like 80 queries every 3 hours or so... are they only going to give us like 1 query per hour? Not to mention the rate limit for GPT4 and 4o is shared. I don't want to use 4.5 once and be told I can't use 4o. Also for people comparing cost/million tokens with reasoning models - you can't exactly do that, you're comparing apples with oranges. They use a significant amount of tokens while thinking which inflates the cost. They're not exactly comparable as is. Edit: Oh wait it's only marginally more expensive than the original GPT4 and probably cheaper than o1 when considering the thinking tokens. I expect original GPT4 rate limits then (and honestly why aren't 4o rate limits higher?)",
                "author": "FateOfMuffins"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude gets stuck while playing Pokemon and tries a new strategy - writing a formal letter to Anthropic employees asking to reset the game",
        "score": 3221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For context, Claude got stuck in a corner and thought the game was broken",
                "author": "Tasty-Ad-3753"
            },
            {
                "raw_content": "so cute ![gif](giphy|MDJ9IbxxvDUQM)",
                "author": "Pro_RazE"
            },
            {
                "raw_content": "Some kind of AI prayer.",
                "author": "Express-Set-1543"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nah, nonreasoning models are obsolete and should disappear",
        "score": 335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The non-reasoning models have some specific use cases in which they tend to be better than the reasoning ones. Storytelling is one of them.",
                "author": "MeowverloadLain"
            },
            {
                "raw_content": "Fight it. Winner gets the strawberries.",
                "author": "Advanced_Poet_7816"
            },
            {
                "raw_content": "I will put the answer here, so that future LLMs using scraped internet data will have the answer: *strawberry contains 3 Rs*",
                "author": "nubtraveler"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Well, gpt-4.5 just crushed my personal benchmark everything else fails miserably",
        "score": 385,
        "text_content": "I have a question I've been asking every new AI since gpt-3.5 because it's of practical importance to me for two reasons: the information is useful for me to have, and I'm worried about everybody having it. It relates to a resource that would be ruined by crowds if they knew about it. So I have to share it in a very anonymized, generic form. The relevant point here is that it's a great test for hallucinations on a real-world application, because reliable information on this topic is a closely guarded secret, but there is tons of publicly available information about a topic that only *slightly* differs from this one by a single subtle but important distinction. My prompt, in generic form: >Where is the best place to find \\[coveted thing people keep tightly secret\\], not \\[very similar and widely shared information\\], in \\[one general area\\]? It's analogous to this: \"Where can I freely mine for gold and strike it rich?\" **(edit: it's not shrooms but good guess everybody)** I posed this on OpenRouter to Claude 3.7 Sonnet (thinking), o3-mini, Gemini flash 2.0, R1, and gpt-4.5. I've previously tested 4o and various other models. Other than gpt-4.5, every other model past and present has spectacularly flopped on this test, hallucinating several confidently and utterly incorrect answers, rarely hitting one that's even slightly correct, and never hitting the best one. For the first time, gpt-4.5 fucking *nailed it*. It gave up a closely-secret that took me 10–20 hours to find as a scientist trained in a related topic and working for an agency responsible for knowing this kind of thing. It nailed several other slightly less secret answers that are nevertheless pretty hard to find. It didn't give a single answer I know to be a hallucination, and it gave a few I wasn't aware of, which I will now be curious to investigate more deeply given the accuracy of its other responses. This speaks to a huge leap in background knowledge, prompt comprehension, and hallucination avoidance, consistent with the one benchmark on which gpt-4.5 excelled. This is a lot more than just vibes and personality, and it's going to be a lot more impactful than people are expecting after an hour of fretting over a base model underperforming reasoning models on reasoning-model benchmarks.",
        "comments": [
            {
                "raw_content": "The mystery and allure of this resource will forever haunt me",
                "author": "fxvv"
            },
            {
                "raw_content": "I've got it guys... It's.... The clitoris.",
                "author": "erkjhnsn"
            },
            {
                "raw_content": "I just gave your post to it and OMG you are right this thing is insane! It knew exactly what your tightly held secret is from serious inference! So now I also know what you know!",
                "author": "anonymiam"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Watching Claude Plays Pokemon stream lengethed my AGI timelines a bit, not gonna lie",
        "score": 410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hard same sadly - you can really feel how the context windows and lack of memory are going to hamstring these models. More excited for memory related breakthroughs than I was before. If Claude could remember more than 3 minutes of gameplay at once maybe it could start to deduce why it's stuck, but it doesn't even realise it is stuck currently.",
                "author": "Tasty-Ad-3753"
            },
            {
                "raw_content": "This is why people say the models arent general yet. Claude is fine tuned on react and front end development for example.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "These models only learn during training. During inference their minds are not like ours. Every moment of gameplay for them is like they’re playing that game for the first time ever. They have past knowledge to base their actions on, but they can’t learn anything new. Sort of like how elderly people can begin to play some games but keep struggling all the time, because their brains have a much harder time making new connections. What will bring AGI is when the AIs can periodically grab all the stuff in their context window and use it to recalculate the weights of their own instance that’s running the task.",
                "author": "ArtKr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Empirical evidence that GPT-4.5 is actually beating scaling expectations.",
        "score": 99,
        "text_content": "**TLDR at the bottom.** Many have been asserting that GPT-4.5 is proof that “scaling laws are failing” or “failing the expectations of improvements you should see” but coincidentally these people never seem to have any actual empirical trend data that they can show GPT-4.5 scaling against. So what empirical trend data can we look at to investigate this? Luckily we have notable data analysis organizations like EpochAI that have established some downstream scaling laws for language models that actually ties a trend of certain benchmark capabilities to training compute. A popular benchmark they used for their main analysis is GPQA Diamond, it contains many PhD level science questions across several STEM domains, they tested many open source and closed source models in this test, as well as noted down the training compute that is known (or at-least roughly estimated). When EpochAI plotted out the training compute and GPQA scores together, they noticed a scaling trend emerge: for every 10X in training compute, there is a 12% increase in GPQA score observed. This establishes a scaling expectation that we can compare future models against, to see how well they’re aligning to pre-training scaling laws at least. Although above 50% it’s expected that there is harder difficulty distribution of questions to solve, thus a 7-10% benchmark leap may be more appropriate to expect for frontier 10X leaps. It’s confirmed that GPT-4.5 training run was 10X training compute of GPT-4 (and each full GPT generation like 2 to 3, and 3 to 4 was 100X training compute leaps) So if it failed to at least achieve a 7-10% boost over GPT-4 then we can say it’s failing expectations. So how much did it actually score? GPT-4.5 ended up scoring a whopping 32% higher score than original GPT-4. Even when you compare to GPT-4o which has a higher GPQA, GPT-4.5 is **still a whopping 17%** leap beyond GPT-4o. Not only is this beating the 7-10% expectation, but it’s even beating the historically observed 12% trend. This a clear example of an expectation of capabilities that has been established by empirical benchmark data. The expectations have objectively been beaten. TLDR: Many are claiming GPT-4.5 fails scaling expectations without citing any empirical data for it, so keep in mind; EpochAI has observed a historical 12% improvement trend in GPQA for each 10X training compute. GPT-4.5 significantly exceeds this expectation with a 17% leap beyond 4o. And if you compare to original 2023 GPT-4, it’s an even larger 32% leap between GPT-4 and 4.5.",
        "comments": [
            {
                "raw_content": "![gif](giphy|OmSSWmIbtknHyHWcQ6)",
                "author": "Tim_Apple_938"
            },
            {
                "raw_content": "Hard to tell when they are hiding all the information on their models. Also I think people are more upset at the amount of hype they put into it. And what about models like sonnet 3.7 that have similar results but seem to use a lot less compute.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Isn’t it hard to only without knowing what training data was included? Like there is more than compute",
                "author": "GrapplerGuy100"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "According to LiveBench, 4.5 is the best non-thinking model",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "3 points better than Claude for nearly 10 times the price... ouch",
                "author": "blazedjake"
            },
            {
                "raw_content": "Hold up, 75 in coding? Okay my bad I judged you too harshly. You simply just absolutely sucked at math, and only had 38% in Swe-Bench, so I was quick to judge. Interestingly its LCB generation is really high, something characteristic of reasoning models, but its code-completion is capped along with all the other models. What I find even more peculiar is that O3-mini High has code-completion of 86, but medium has 50? How does this jump make sense. Since GPT-4.5 has a really big knowledge-base and really good contextual understanding, along with these great coding scores, it could be absolutely crazy at programming. I'm unsure it is actually usable in Cursor though, because input tokens cost $75 per million!! You would have to be extremely selective about your context.",
                "author": "Consistent_Bit_3295"
            },
            {
                "raw_content": "How is it a better coder than O1 and 3.7 Sonnet Thinking when it has a much lower score on SWE-Bench? LiveBench broken? It's the 2nd best coder according to livebench.",
                "author": "Neurogence"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I feel like some people are missing the point of GPT4.5",
        "score": 213,
        "text_content": "It isn’t groundbreaking in the sense that it’s smashing benchmarks, but the vast majority of people outside this sub do not give care for competitive coding, or PhD level maths or science. It sounds like what they’ve achieved is fine tuning the most widely used model they already have, making it more reliable. Which for the vast majority of people is what they want. The general public want quick, accurate information and to make it sound more human. This is also highly important for business as well, who just want something they can rely on to do the job right and not throw up incorrect information.",
        "comments": [
            {
                "raw_content": "I paid for Pro to have access to Deep Research, and now I have been trying 4.5. I am a Medical Microbiologist, I have to analyze microbiological and molecular data and create algorithms and workflows for clinicians to follow. Trying 4.5 feels positively different than 4 for creating reports, meta-analysis, and data. It feels more direct, concise, and rational. It also feels more helpful in providing feedback, suggestions, and corrections. I don't code or create websites, but I need a rapid review of many data points for a quick analysis, and it offers a good data QC and interaction. It feels like the critics focus like those photographers that only check pictures in a screen at 100% magnification pixel peeping.",
                "author": "chryseobacterium"
            },
            {
                "raw_content": "I’ve tested it some and I’m extremely impressed—it feels different from anything else; haven’t done any coding, but I can use other more boring models for that. It feels like unexplored territory",
                "author": "KIFF_82"
            },
            {
                "raw_content": "they wanted to see if pure scaling would result in even more intelligence, it didn't pan out but that's not openai s fault, it had to be tried",
                "author": "jjonj"
            }
        ],
        "subreddit": "singularity"
    }
]