[
    {
        "post_name": "WASHINGTON, DC - There is another area DOGE & Musk can look into in search of Gov't Abuse, with the US Marshals Service (USMS) reporting that it has lost track of how much Bitcoin it holds, along with experiencing what is described as “serious organizational issues.” USMS has long mishandled crypto.",
        "score": 843,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Back Up Link: https://lawenforcementtoday.com/hey-elon-and-doge-take-a-look-over-here-us-marshals-service-has-no-idea-how-much-cryptocurrency-it-holds The USMS is charged with managing assets seized during criminal investigations, including real estate, cash, jewelry, antiques, and vehicles. It is also charged with handling cryptocurrencies, including billions of dollars worth of Bitcoin seized by the FBI from Silk Road, a darknet marketplace, in 2013. Unfortunately, according to a source familiar with the matter, the USMS has no clue how much crypto it currently holds and cannot even estimate its Bitcoin holdings. ==> “**They’re One Bad Day Away From A Billion-Dollar Mistake**,” Borman said...",
                "author": "5121313"
            },
            {
                "raw_content": "I'm tire of the latest career criminal getting words like \"mishandle\" \"did not pass audit\" and \"scholar\" We all know that's not true and we should be pissed that they try to soften hard criminality.",
                "author": "doodaddy"
            },
            {
                "raw_content": "The best part about Bitcoin is that all the wallets and transactions are traceable.",
                "author": "Valiazaner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Social Security Administration \"eliminates\" its civil rights office",
        "score": 794,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to do better. They need to put White history month back on the calendar.",
                "author": "SandyHookWasAHoax"
            },
            {
                "raw_content": "Why would social security need such an office? Another make-work DEI program full of useless employees.",
                "author": "AerialRush"
            },
            {
                "raw_content": "Racists",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Truth: \"TRUMP GAZA\" 🔥🤣",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why are we pumping our fists in celebration for yet trillions more dollars for nation building in foreign 3rd world shitholes? oh, coz it's trump's idea, so that means it's good? but if biden wanted to do it, it's bad? gotcha 👌",
                "author": "yodayoda"
            },
            {
                "raw_content": "Trump is one crazy motherfucker, lmao!",
                "author": "TakingCoatsWIN"
            },
            {
                "raw_content": "Trump has reached full no fucks give.",
                "author": "Drewniverse"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kristi Noem DHS Director, announces they are enforcing the Alien Registration Act of FDR’s a 1940 law requiring anyone entering the country illegally to register within 30 days and be deported. She says she’s just enforcing existing law.",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People who know what they're talking about have said that we don't need to pass any new laws, just enforce the ones already on the books.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Can't wait for Bernie to react on this one following his great campaign pitch: \"Sanders lays out his vision for America: finish what Franklin Roosevelt started\"",
                "author": "Monsieur_Novembre"
            },
            {
                "raw_content": "Cue activist judge in 3, 2, 1….",
                "author": "Windsor_Locke_III"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tulsi just fired every NSA employee that participated in that creepy group chat.",
        "score": 1919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make sure to take their security clearances.",
                "author": "AngeredKabar"
            },
            {
                "raw_content": "I need Fauchi. Please deliver.",
                "author": "CommieCrats"
            },
            {
                "raw_content": "That's 100 plus of the worst rot gone just like that, this is a win for us and they made it easy. Freaks",
                "author": "CrazyPope"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Every Democrat in the House of Representatives just voted against No tax on tips and No tax on overtime.",
        "score": 1902,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am thoroughly enjoying the Democrats' death spiral.",
                "author": "seeling0"
            },
            {
                "raw_content": "So they hate the working class and seniors",
                "author": "Logan051361"
            },
            {
                "raw_content": "They also started the 1865 civil war. Won it. Lied. changed our form of government to a corporation. Then made everyone an employee without pay. They sure taught us to not mess with their slaves.",
                "author": "AmericanBrave"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If ANY judge ANYWHERE can block EVERY Presidential order EVERYWHERE, we do NOT have democracy, we have TYRANNY of the JUDICIARY.",
        "score": 2246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ignore them",
                "author": "k-doe1"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Congress and Presidents get their power checked all the time. But you hardly ever see the judicial branch get checked. It's supposed to be separate but equal branches. The balance is off.",
                "author": "MAG_n_KAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegals can no longer fly unless being reported.",
        "score": 1724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they were allowed to fly without identities being verified then that means the TSA shouldn't exist in the first place.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "They can fly, but only in one direction: SOUTH!",
                "author": "RogueLeaderX"
            },
            {
                "raw_content": "Abolish the TSA, have airlines pay for their own security and ATC's",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CIA ppl leaking to CNN they’ll spill state secrets if @DOGE fires them? My friends, that is treason. And just more proof they need to be fired. ASAP.",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have state secrets? I bet it's going to be a bunch of stuff where everyone says, yep. WE ALREADY KNEW.",
                "author": "FlyinHeadlock"
            },
            {
                "raw_content": "How patriotic of the leftist CIA faggots. They lose their jobs and they sell out to China. What about when they retire? Lol. Fire them now",
                "author": "HeatherSwanson"
            },
            {
                "raw_content": "Even more reason to get rid of the CIA altogether.",
                "author": "BigMikesSwingingCock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Point of view",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hah, I see what she did there",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "Im just going to say it. Dan is a fool. What a dipshit. Anyway, he will be in office for a very long time.",
                "author": "Jbliss"
            },
            {
                "raw_content": "Kek <——— this one Kek Kek Kek",
                "author": "Gwoz8881"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They've completely lost their minds in Europe.",
        "score": 1601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're going OD on cope",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "This is acceptable. Go ahead.",
                "author": "GreyGooseDown"
            },
            {
                "raw_content": "This is going to be fun.",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "George Soros “collects your people like Pokemon cards”....",
        "score": 1493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "blah blah blah blah blah blah,, *January 6th* she really thought she got one in there",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Did anybody vote for Kamala to be the presidential candidate in the 2024 election? Oh yeah that's right. She pulled a bloodless coup on Biden's ass to acquire that position. If these fucking CNN dykes were honest, they would be mentioning that.",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "Great line. Kudos, Scott.",
                "author": "GoldwaterVoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Red Francis Stacked the College of Cardinals To Ensure Next Pontiff Will Be a Communist Like Him",
        "score": 1120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s destroying the Catholic Church like Biden destroyed the US.",
                "author": "Steve56775"
            },
            {
                "raw_content": "When Pope Benedict “retired” l, it was a Soros backed “Globalist” infiltration of the Catholic Church.",
                "author": "RogueLeaderX"
            },
            {
                "raw_content": "Reminder that hell has open borders.",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Crenshaw Facing Ethics Complaint After Threatening To Kill Tucker Carlson",
        "score": 1804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fellow Pedes... Continue posting ANY negative Crenshaw info you see. This globohomo is the rep for my district. Many want him out, but we have a high percentage of lazy, low info voters. Local media runs interference for him. We need everything we can collect to inform voters. My Crenshaw file grows.",
                "author": "Pederella"
            },
            {
                "raw_content": "Bull shit. They expelled George Santos for less.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Ethics complaint? Would you or I get a little ethics complaint if I made death threats to someone like this?",
                "author": "JoeMcCarthyWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Attorney General Pam Bondi has sent letters to the attorneys general of California, Maine, and Minnesota, ordering them to stop permitting boys to compete in girls’ sports or risk legal consequences.",
        "score": 1806,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein list when?",
                "author": "SedimentTrap"
            },
            {
                "raw_content": "Was it *sternly* worded?",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "I grow weary of her. She needs to perform or else please fire her Trump",
                "author": "BasedMedicalDoctor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Kash Patel and the FBI have launched an investigation into former Director James Comey’s spying on President Trump’s 2016 campaign. JUSTICE IS COMING! 🔥",
        "score": 2710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein's list",
                "author": "BuddyFett765"
            },
            {
                "raw_content": "Years of \"investigations\" have left me jaded. Wake me up when somebody actually gets charged.",
                "author": "yourheadasplode"
            },
            {
                "raw_content": "Too slow.",
                "author": "cwo5al"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump just ROASTED a fake news reporter. The hack tried to claim Trump was singling out certain people in these Executive Orders. Trump: “ I was the target of corrupt politicians for four years. Don't talk to me about targeting.\"",
        "score": 2107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9 years",
                "author": "gravenspine"
            },
            {
                "raw_content": "Translation - go fuck yourself",
                "author": "awsure"
            },
            {
                "raw_content": "These reporters make themselves look so blatantly stupid I’m sure they get red in the face with embarrassment after some of these responses",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Speaker Mike Johnson just said he has the votes to pass the budget resolution - which includes no taxes on tips, overtime, & social security. Reporter: \"Mr. Speaker, do you have the votes?\" Johnson: \"We have the votes.",
        "score": 1516,
        "text_content": "",
        "comments": [
            {
                "raw_content": "According to Rand and Massie, it doesn't cut anything, still funds USAID and increases the budget about 1/2 trillion a year. Not happy with that if that's what's in it.",
                "author": "SilentGuardian"
            },
            {
                "raw_content": "The fact they tax SSI is fucking retarded.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "SHUT DOWN THE FUCKING GOVERNMENT! I hate these omnibus bills. Congress has one main power, and that's spending. Instead of doing their job they throw money into a trough and push it through.",
                "author": "CyanScales"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leaked Chats Reveal CIA Officials Mocked the Death of Christian Leader Pat Robertson",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"This is a recurring theme in the NSA chatrooms: hatred against Christians, conservatives, Italians, and heterosexuals. One intelligence officer even casts aspersions on his own grandmother.” Some seriously tainted individuals.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "It doesn't bother me that they had these opinions. What bothers me is they had these and other pornographic chats on GOVERNMENT SERVERS. Where's the DEI guard at here? Regardless of the leftist/communist spin, they'd have been immediately sacked at my office for using company equipment in such a manner!",
                "author": "Skywise"
            },
            {
                "raw_content": "How did so many fags wind up in these places?",
                "author": "bonejack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Andy Ogles: I’m drafting articles of impeachment for U.S. District Judge Amir H. Ali. Yet another PARTISAN ACTIVIST attempting to weaponize his position to block President Trump from cutting wasteful foreign funding.",
        "score": 1454,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Orders Trump to Reinstate Foreign aid Because the Judge is foreign.",
                "author": "gaijin_ronin"
            },
            {
                "raw_content": "Why is a Middle Eastern goatfucker who immigrated here from Canada a judge on the DC District Court?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Please, enough with these useless stunts. Removing that judge would require a 2/3 vote in the Senate, which we all know isn't happening. This is just a waste of time.",
                "author": "briantrash"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Framework Desktop, A Monster Mini PC Powered By AMD Ryzen AI Max",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The system is a bit on the larger side of the mini PC spectrum. It might be fair to also consider it a tiny small form factor PC? Inside the 4.5L chassis is a standard mini-ITX mainboard, which includes ATX headers, a PCIe x4 slot, and a good variety of rear I/O like dual USB4 ports, two DisplayPort outputs, HDMI, and 5 Gigabit Ethernet. You’ll also get two PCIe NVME Kinda what I came here for.",
                "author": "Liesthroughisteeth"
            },
            {
                "raw_content": "Their website is now unreachable, with an estimated wait time of 1 hour lmao. Seems like many people are interested. Also, some of the slides in the presentation are absolutely hilarious. They put a comparison with a $5000 Mac Pro and a Digits (price: a leather jacket, I'm serious). I'm guessing because Nvidia hasn't actually announced the price for the 128GB model? Or perhaps they expect the street price to be much higher? Edit: still, I feel like the price is a bit steep, similar mini-PCs from asian manufacturers are likely to be announced soon likely at slightly more popular prices.",
                "author": "Kryohi"
            },
            {
                "raw_content": "These are going to sell out so fast. I really wish I hadn’t just purchased a new desktop.",
                "author": "manafount"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Announces the 9100 PRO Series SSDs, with Breakthrough PCIe® 5.0 Performance",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we get some cheaper large SSDs as well? They've been fast enough for most use cases for a while now.",
                "author": "Frexxia"
            },
            {
                "raw_content": "Hey, the name is taken. https://www.techpowerup.com/ssd-specs/micron-9100-pro-3-tb.d1828",
                "author": "YairJ"
            },
            {
                "raw_content": "Hopefully these won't run stupidly hot and won't have the firmware issues that caused the 980/990 to die early.",
                "author": "Link3693"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ServeTheHome] Intel Xeon 6700P/6500P Granite Rapids-SP overview",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD teases Radeon RX 9070 focusing on sub-$700 price point - VideoCardz.com",
        "score": 207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nvidia -50$, who could've seen that one coming?",
                "author": "M4fya"
            },
            {
                "raw_content": "There's a reason they worded it <$700 and not <$600. I think everyone should stop hoping the 9070XT will be 599 or less, it's not gonna happen. Waiting for the Hardware Unboxed DOA video.",
                "author": "Various_Pay4046"
            },
            {
                "raw_content": "joever, just ordered thermal paste and putty for my ageing rtx 3070",
                "author": "Significant_L0w"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 9000 vs. Intel Core Ultra Arrow Lake On Linux In ~400 Benchmarks",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 9800X3D almost reaching the 285K in performance is pretty crazy, especially when it consumes just 2/3rd the power on average.",
                "author": "SmashStrider"
            },
            {
                "raw_content": "For those who say Arrow Lake was designed for Productivity applications, I am very sure productivity applications is what Intel was targeting as their main customer base",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Another incorrect testing methodology. I'm not even surprised at this point at the level of incompetence across the industry. Arrow Lake CPUs only run gear 2 mode at minimum because it targets high frequency memory, gear 2 is the same as 1:2 ratio on AMD for memory, and here he has ran all the tests on DDR5-6000. This alone benefits AMD by a significant amount because Arrow Lake is not designed to run below JEDEC spec. Arrow Lake's JEDEC default is actually 6400. The expectation for a good testing is at least throw on a pair of CUDIMM and run them on XMP. What we have in comparison now in terms of bandwidth is setting half bandwidth access for Intel, and also underclock memory vs full bandwidth on AMD with overclocked memory from 5600 to 6000. If someone did a test that disabled the 3D cache I'm sure people will be rioting with pitchforks out",
                "author": "jeeg123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock addresses Ryzen 9000 boot issues with new BIOS for A620, B650, B850 and X870 motherboards",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9800x3d not damaged like some rumors said. It's an asrock board memory compatibility problem causing boot failures which has now been addressed by a new bios release.",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "I'm still setting a hard voltage limit just for safety's sake.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GeForce RTX 5070 reviews coming March 4th, with Radeon RX 9070 reviews the next day.",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't wait to be disappointed two days in a row.",
                "author": "Yasuchika"
            },
            {
                "raw_content": "Just a day later is weird strategy for me.",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "I said it in another thread, but this is gonna be the new 1060 vs 480",
                "author": "toodlelux"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So there was really no February Direct huh.",
        "score": 966,
        "text_content": "Just three weeks ago it seemed like everyone thought there was going to be a direct this month but I guess not. Not really disappointed though (as it was all speculation), still got the Switch 2 showcase to look forward to. 🔥",
        "comments": [
            {
                "raw_content": "its on the 31st. trust",
                "author": "friskdr33mur"
            },
            {
                "raw_content": "they postponed it to march 1st just to make the leakers look like liars.",
                "author": "Green-Variety-2313"
            },
            {
                "raw_content": "I'm still delusionally waiting https://preview.redd.it/3wgdynyuoble1.jpeg?width=1179&format=pjpg&auto=webp&s=73dcb57530fae2873636f3772015e61f7dab6ab1",
                "author": "TheJimDim"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "STREETPASS MII PLAZA? MENTIONED BY NINTENDO? IN 2025? (Likely means nothing but I hope in means something)",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/s8j230vcidle1.jpeg?width=1280&format=pjpg&auto=webp&s=3284699152eac674a8097a341f210e7aa557f750 It'll only be a matter of time",
                "author": "WordDependent9269"
            },
            {
                "raw_content": "Nah they doing a remake of super mario bros 2",
                "author": "Lawfulash"
            },
            {
                "raw_content": "And also SUPA MARIO BRUDDAS 2 BAYBEE",
                "author": "MacksNotCool"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "my switch 2 concept",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/z0osfybkx9le1.jpeg?width=500&format=pjpg&auto=webp&s=5183cfd63f29e9e6f4790332f319813ef5576814",
                "author": "WordDependent9269"
            },
            {
                "raw_content": "THE LEAKS WERE FAKE! https://preview.redd.it/5j8zgyvx7ale1.jpeg?width=1170&format=pjpg&auto=webp&s=39ce491bd7d75ed7cb4d05f6a6e1d79fb521deb2",
                "author": "TR3NTM4ZING"
            },
            {
                "raw_content": "*finally* some sanity",
                "author": "Rei_Rodentia"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Before it was revealed",
        "score": 219,
        "text_content": "Fr tho",
        "comments": [
            {
                "raw_content": "They where acting like this but trust me, they where in agonizing pain :)",
                "author": "InformationMuted3454"
            },
            {
                "raw_content": "Nintendo: .............. Designers: Should we....show the design? Nintendo: Yes......and make sure whoever leaked this design is taken care of........and make sure to tell those \"people\" that we plan on explaining more about what this \"new console\" does......... Designers: O-Okay sure thing. Nintendo: ...............So thats the game they want to play eh? Welll two can play at that..........",
                "author": "VanitasFan26"
            },
            {
                "raw_content": "I think the funny part is that the form factor is so fucking similar, it didn't even matter that it leaked lol.",
                "author": "stoic_spaghetti"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I know the first game for the Nintendo Switch 2",
        "score": 21,
        "text_content": "Water Buffalo - THE GAME Im not revealing my source, so you best take my word for it.",
        "comments": [
            {
                "raw_content": "It wouldn’t be remotely close to even being in the same sentence as Super Mario Galaxy though.",
                "author": "Brilliant_Advice1015"
            },
            {
                "raw_content": "Super buffalo Adventures: The way of water. Only on Nintendo Switch 2. Pre-order to get Exclusive Water buffalo hair strands.",
                "author": "GazelleEmotional7491"
            },
            {
                "raw_content": "Damn I was hoping it would be Funky Barn 2 :(",
                "author": "Dogelore92"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Sub! What do you hope won't carry over from the Switch 1 era into the Switch 2 era and why?",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Joy-con drift \\^\\^; (self-explanatory)",
                "author": "PMC-I3181OS387l5"
            },
            {
                "raw_content": "eShop shovelware, especially the ones that are basically por- *Nintendo needs to have more moderators*",
                "author": "maricthehedgehog"
            },
            {
                "raw_content": "Decade old games being $10 or less on every other platform, but $60 on Switch. Edit: I'm talking about 3rd party games, other platforms don't get Nintendo games",
                "author": "kierantop"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How do we feel about this?",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo never listens to the fans (me). I've sent Shagaru Myamo so many letters and he hasn't responded to a single one. The gaming industry is cooked. And my pizzas never will be. 😔",
                "author": "HeroponBestest2"
            },
            {
                "raw_content": "Unironically pizza will be made BECAUSE of the switch 2 direct in April. Is that pizza by proxy?",
                "author": "Norbluth"
            },
            {
                "raw_content": "Feel like I seen this same joke 50 times this week and it's still not funny",
                "author": "wankstain234"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 02/24/25",
        "score": 37,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [The Elder Scrolls VI is 'Hammerfell', Dragons Returning, to feature Naval Battles and Ship Building](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iuhakp/extas1s_the_elder_scrolls_vi_is_hammerfell/) * [ God of War Remaster announcement will happen around the anniversary in March ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iviz5z/jeff_grubb_says_god_of_war_remaster_announcement/) * [ Cyberpunk 2077 Sequel will be in First Person. Job Listing reveals.](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1itxihb/cyberpunk_2077_sequel_will_be_in_first_person_job/) * [ Assassin’s Creed Shadows leaks and tidbits from someone with a copy ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iwloil/assassins_creed_shadows_leaks_and_tidbits_from/) * [ A Persona 4 related project may be in production. Shihoko Hirata (vocalist for P4's OST) has been recording songs for an unannounced game where all Persona soundtracks are recorded + liking Persona 4 related tweets ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1ivcvdx/a_persona_4_related_project_may_be_in_production/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "With it looking like there's no Feburary direct here soon I really hope we still get news about the Genealogy of the Holy War remake along with the Project Robobot remaster at some point soon. Robobot I can see being a shadowdrop, but for a full remake of Genealogy I can't really see them doing that, I feel like they would want more eyes on it, so maybe they're holding it out for the Switch 2? Or maybe I'm just coping.",
                "author": "udderchaos2005"
            },
            {
                "raw_content": "Nintendo starving people for real news is gonna pay off super hard for them when April 2nd comes around.",
                "author": "InfernalLizardKing"
            },
            {
                "raw_content": "the last Switch 1 Direct could just be on MAR10 day to announce some Mario ports and movie stuff.",
                "author": "RinRinDoof"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: WB is closing Monolith Productions, Player First Games, and WB San Diego, sources tell Bloomberg",
        "score": 1348,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3lizk5skwps2d Wonder Woman game is canceled too",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Holy fuck, I thought Montreal or even Rocksteady would've been shut down before Monolith. It's been almost 8 years since Shadow of War, what the hell happened?",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "Monolith Productions was working on the Wonder Woman game. They also made [*Middle-earth: Shadow of Mordor*](https://en.wikipedia.org/wiki/Middle-earth:_Shadow_of_Mordor) and [*Middle-earth: Shadow of War*](https://en.wikipedia.org/wiki/Middle-earth:_Shadow_of_War)*.*",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Valve's $1200 wireless VR headset (codename Deckard) will release by the end of 2025",
        "score": 120,
        "text_content": ">Several people have confirmed that Valve is aiming to release new standalone, wireless VR headset (codename Deckard) by the end of 2025. The current price for the full bundle is set to be $1200. Including some \"in-house\" games (or demos) that are already done. Valve want to give the user the best possible experience without cutting any costs. Even at the current price, it will be sold at a loss. A few months ago, we saw leaked models of controllers (codename Roy) in the SteamVR update. It will be using the same SteamOS from Steam Deck, but adapted for virtual reality. One of the core features is the ability to play flat-screen game that are already playable on Steam Deck, but in VR on a big screen without a PC. The first behind closed doors presentations could start soon. [gabefollower](https://xcancel.com/gabefollower/status/1894636466480771136#m) edit unrelated but there's code I found that indicates HLX already have FSR3 implemented [https://www.reddit.com/r/HalfLife/comments/1iy7r6c/hlx\\_features\\_fsr3/](https://www.reddit.com/r/HalfLife/comments/1iy7r6c/hlx_features_fsr3/)",
        "comments": [
            {
                "raw_content": "Idk the valve index somewhat justified the price because itnwas new technology and it was unmatched. But now im not sure how succesful another 1200 priced vr headset is going to be when the competition is rather good nowadays. Only the real vr enthousiasts will be interested, and im not sure how big their market is",
                "author": "Jer_Sg"
            },
            {
                "raw_content": "What about the Steam controller v2? When is that releasing??",
                "author": "AzMainMan916"
            },
            {
                "raw_content": "![gif](giphy|vjjCsx3izfSyQ)",
                "author": "AdDesperate3113"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Extas1s: Fable was delayed due to technical reasons",
        "score": 347,
        "text_content": "[According to a source from Extas1s](https://www.youtube.com/watch?v=YRqCBq1OsI8) (which informed him of a possible Delay around the end of January), the reason for postponing Fable has nothing to do with porting the game to PS5, or even a Switch 2 port (which is likely), but rather problems with the game's development time, quality control because of the the Forza engine, which was made for racing games. According to his sources, they are making adjustments to the gameplay because the game didn't seem very fun at first and they're also fixing the pace of progression",
        "comments": [
            {
                "raw_content": "#eXtas1s is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "A Fable game delayed due to technical reasons I’m sorry but we have never been more back than we are right now",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "So let me get this right, exstas1s heard it was delayed at the end of January yet only now is talking about it after it was announced, that's how you know he's full of shit.",
                "author": "Brokenbullet14"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tony Hawk’s Pro Skater 3 + 4 rated in Singapore for PS5, Xbox Series, PS4, Xbox One, Switch, and PC",
        "score": 695,
        "text_content": "https://www.gematsu.com/2025/02/tony-hawks-pro-skater-3-4-rated-in-singapore-for-ps5-xbox-series-ps4-xbox-one-switch-and-pc https://imdaonline.imda.gov.sg/Classification/Search/VideoGames/SearchDetail.aspx?sTitle=IDX/2502/000036",
        "comments": [
            {
                "raw_content": "Kinda crazy that we are still releasing games on Xbox one and ps4",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "THUG 1+2 next, please? Underground 2 was my childhood and I’d love to play it in 4K60 with a modern look",
                "author": "ibrahero"
            },
            {
                "raw_content": "LET'S GO!",
                "author": "spectre97x"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Natedrake - Fable will release on PS5 in 2026, speculates it's the reason for the delay",
        "score": 407,
        "text_content": "[Resetera](https://www.resetera.com/threads/xbox-game-studios-update-with-craig-duncan-fable-delayed-to-2026.1118379/page-4#post-136255851) \"If I had to speculate as to why Fable was delayed: it's to allow some extra time for polish & to make the PS5 version a Day 1 release alongside Xbox/PC because the PS5 version was always slated for 2026.\" Update: [NateDrake clarifies his statement ](https://www.resetera.com/threads/xbox-game-studios-bethesda-abk-ot34-reseteora.1090722/page-202#post-136273683) \"Speculation is in regards to the nature of the delay. But Fable coming to PS5 in the year after it launched on Xbox/PC is not speculation. Keep in mind that timeline was based on when Fable was slated for 2025 on Xbox/PC. With Fable now delayed to 2026... it stands to reason that it arriving on PS5/Xbox/PC on the same day is within the realm of possibility\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Although this is obviously happening, I’m not sure this would be the reason for a delay. Probably more so to do with polish and also GTA releasing in roughly the same window",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Day and date ps5 ports will now be a thing. Microsoft is not interested in leaving any money on the table",
                "author": "Dr_Mantis_Trafalgar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloober Team are officially working with Konami again for \"Project G\". This might further tell us Silent Hill 1 and 3 Remakes are what's coming:",
        "score": 503,
        "text_content": "Translated from [here](https://www.bankier.pl/wiadomosc/BLOOBER-TEAM-S-A-Zawarcie-istotnej-umowy-przez-Emitenta-8897811.html#pvy7zfso61), Bloober Team has officially revealed today that they're working with Konami again for Project G: >*The Management Board of Bloober Team SA with its registered office in Kraków (hereinafter referred to as the \"Issuer\") hereby announces that on February 25, 2025, it concluded a material agreement with Konami Digital Entertainment Co., Ltd, with its registered office in Tokyo, Japan (hereinafter referred to as \"KONAMI\"),* ***concerning the production of a game by the Issuer for the PC, PS5 and Xbox X/S platforms, based on IP belonging to KONAMI, under the code name Project \"G\"****.* What's interesting to recall is that we *already knew* that Project G was already in concept phase way back in 2023, along with a Project H being \"in plans\". We just didn't know for sure G was *another Konami collaboration* until today, and we were just speculating or trusting bad sources ([I made a post about it in here, too](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1hia2gt/silent_hill_3_remake_and_maybe_1_by_bloober_team/)). So now that we officially know that Project G is another Konami game that was approved at least 1 year before Silent Hill 2 Remake was even released, it's possible that the post and the source were in the right direction, and it's interesting to know that both Project G and H are being done internally, and both were [revealed to be coming at the same time in 2023](https://wnhub.io/news/other/item-45059). And, like mentioned in the previous linked post, to see that they're the only current Bloober projects with an alphabetical order compared to all the others (Project C, M and F). Considering SH1 and SH3 follow the same story, it's possible they were approved at the same time.",
        "comments": [
            {
                "raw_content": "Project G - Gillespie (Silent Hill 1 Remake) Project H - Heather (Silent Hill 3 Remake) Surely I am not coping",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "God I hope we get SH1 first.",
                "author": "SmokedUp_Corgi"
            },
            {
                "raw_content": "SH2 was so good. My first time playing",
                "author": "jackie1616"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fable Delayed to 2026",
        "score": 391,
        "text_content": "[Source](https://xcancel.com/Wario64/status/1894418507489792425?t=CieywR8YAN7XDigUfA6Ecg&s=19) [Previous rumor](https://www.reddit.com/r/Fable/s/tXjwdJkn43)",
        "comments": [
            {
                "raw_content": "What happened to the developers from playground games drinking till their balls in an English town to celebrate the completion of fable?",
                "author": "tinfoilad"
            },
            {
                "raw_content": "Sadly, the alcohol theory wasnt true",
                "author": "nicksuperdx"
            },
            {
                "raw_content": "MS and Sony know when GTA is out since they participate in the marketing and prep on their ends GTA is going to absorb at least 3 months of potential customers",
                "author": "VonDukez"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pyoro claims \"Ranked battles in March\" in Pokémon-related thread",
        "score": 13,
        "text_content": "https://xcancel.com/eb576dcfe/status/1894572652054155489 On Xitter, Pyoro added a new post to a thread. Most seem to be ascribing this to TCG Pocket.",
        "comments": [
            {
                "raw_content": "#Pyoro is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "No doubt it’ll be announced during the Presents tomorrow alongside the next card set. The latter was mistakenly announced a day early on the official Pokemon tiktok account. Whoops. https://x.com/centroleaks/status/1894551923203637657?s=46&t=Io5Oo0r4_9FrBZkUYZL-Mg",
                "author": "EliteTrainerXeos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Framework Desktop is 4.5-liter Mini-PC with up to Ryzen AI MAX+ 395 \"Strix Halo\" and 128GB memory",
        "score": 332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flawless victory.",
                "author": "-Suzuka-"
            },
            {
                "raw_content": "I'd like one. Maybe when the price cools down I'll get the basic model.",
                "author": "Crazy-Repeat-2006"
            },
            {
                "raw_content": "i like framework but all their products seem to ship 6+ months later than the competition and cost 50-100+% more. the economics only work out if you were going to rebuild/upgrade their laptop 3x.",
                "author": "Fastidious_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD teases Radeon RX 9070 focusing on sub-$700 price point",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "finally the post got approved the big question is does the source rumor image mean the 9070 series or the 9070 non-xt being under $700?",
                "author": "wademcgillis"
            },
            {
                "raw_content": "The year is 2030, UDNA is released, AMD posts a blog statement about how they are targeting the mid to low end next gen to regain market share",
                "author": "DeathDexoys"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New Chipset Drivers v7.02.13.148",
        "score": 112,
        "text_content": "https://www.amd.com/en/resources/support-articles/release-notes/RN-RYZEN-CHIPSET-6-10-17-152/RN-RYZEN-CHIPSET-7-02-13-148.html # Release Highlights * New program support added. * Bug fixes. # Known Issues * After installing the AMD Chipset Installer version “7.xx.xx.xx”, users cannot install version “6.xx.xx.xx” or earlier. Workaround: * Un-install the latest version of the AMD Chipset installer (version 7.xx.xx.xx or later). * Delete the “Qt\\_Dependencies” folder located at \"C:\\\\Program Files (x86)\\\\AMD\\\\Chipset\\_Software\\\\\". * Install any older version of the AMD Chipset installer (version 6.xx.xx.xx or earlier).\\\\ * On a non-English OS, some driver names may appear in English. * Occasionally, Ryzen PPKG may not install or upgrade. Release Highlights New program support added. Bug fixes. Known Issues After installing the AMD Chipset Installer version “7.xx.xx.xx”, users cannot install version “6.xx.xx.xx” or earlier. Workaround: Un-install the latest version of the AMD Chipset installer (version 7.xx.xx.xx or later). Delete the “Qt\\_Dependencies” folder located at \"C:\\\\Program Files (x86)\\\\AMD\\\\Chipset\\_Software\\\\\". Install any older version of the AMD Chipset installer (version 6.xx.xx.xx or earlier).\\\\ On a non-English OS, some driver names may appear in English. Occasionally, Ryzen PPKG may not install or upgrade. EDIT - Link fixed. Sorry I posted this and then went to work. Classic OP.",
        "comments": [
            {
                "raw_content": "\"New program support added\" ok.... what program?",
                "author": "Goldman1990"
            },
            {
                "raw_content": "This \"bug fixes'\" update heralds the monumental version 7.0 release of the AMD chipset drivers /s",
                "author": "Gnerma"
            },
            {
                "raw_content": "I no longer see 3D V-Cache running in Task Manager. Under services, \"amd3dvcacheSvc\" is Stopped. Is this normal? Edit: Tried both installing/overwriting the previous chipset driver and doing a full strip/uninstall of the driver and fresh install of the new. Neither fixed it. Holding on to the previous driver for now.",
                "author": "Toast_Meat"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9800X3D CPU failures acknowledged by ASRock and users might have pinpointed the issue",
        "score": 330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“According to a recent Reddit thread, unusually high SoC voltage levels are being monitored (1.815V). The original poster reports using an X870E motherboard – an ASUS ROG Crosshair Hero in this specific case. There are also reports of unlocked SoC voltage on an MSI X870-P WiFi. This high voltage could be a reason for CPU deaths due to short-circuiting.” ^ in case you don’t want to scroll through several ads to get to the interesting bit",
                "author": "sharksandwich81"
            },
            {
                "raw_content": "Yikes, all these companies seem to be skipping QA these days",
                "author": "Celcius_87"
            },
            {
                "raw_content": "This is why I adjust voltages manually. How did this not get picked up during testing?!",
                "author": "random_reddit_user31"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD announces Ryzen 9000/7000 and Radeon 7000 \"Monster Hunter Wilds\" game bundle",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got monster hunter world for free back in the day with my rx 5700. Looks like it's time to get another free monster hunter game.",
                "author": "spartan55503"
            },
            {
                "raw_content": "I hope they will add 9070 series once announced. I was mainly upgrading my gpu to play this game. Effectively -70$ to the gpu price for me.",
                "author": "AloyHzD"
            },
            {
                "raw_content": "Definitely more enticing than that Unknown 9: Awakening bundle.",
                "author": "sharksandwich81"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock addresses Ryzen 9000 boot issues with new BIOS for A620, B650, B850 and X870 motherboards",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "X670E? Plz?",
                "author": "NunButter"
            },
            {
                "raw_content": "I’m working on a new build and waiting for my 9800X3D to get delivered. Does this mean we have to use the flashback method to update the bios before putting our 9800X3D in the socket?",
                "author": "NBtadpole"
            },
            {
                "raw_content": "Actually kind of incredible timing since I just switched to AMD for the first time this weekend and the board I got is listed here. Have a 9900x though so I hope/think I’m alright?",
                "author": "NowieTends"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 9000 vs. Intel Core Ultra Arrow Lake On Linux For Q1-2025 In ~400 Benchmarks",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tldr ... wins and losses breakdown from 402 test cases, the Ryzen 9 9950X straight-up won 50% of the time with a first place finish. The Core Ultra 9 285K was the first place finisher 28% of the time and the Ryzen 7 9800X3D in first around 14% of the time with its 3D V-Cache. With a mix of single and multi-threaded workloads explored, in a handful of cases the Ryzen 9 9900X",
                "author": "ObjectiveSeaweed5787"
            },
            {
                "raw_content": "Ryzen 9 for the win",
                "author": "sorehammer"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "25 February 2025 - Daily /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Interest rates falling through the floor right now. Should not be a trigger for those shopping for a home to rush out to buy. We have an economy that is getting more negative news than it has in a while, at the moment.",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "6.80 📉📉📉 I hope nobuddy has their downpayment invested in crypto coins.",
                "author": "rentvent"
            },
            {
                "raw_content": "10 year is dropping which means lower interest rates, but you have to look at the reason for which it is dropping. There is too much uncertainty in this economy. The February consumer confidence report came out today and shows that people are not feeling good. The only thing propping up the economy right now is the low unemployment figures. Federal employees have been getting laid off left and right and with a slowing economy, businesses aren't hiring as much. It is not looking good for the U.S economy.",
                "author": "Jjglo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Low-income Americans are skipping meals and selling belongings to afford housing",
        "score": 299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“If your income is too high for government aid, negotiating your rent might help. Long-term tenants in good standing can ask for a reduction, as landlords prefer stability over vacancies or unreliable tenants.” lmao what a garbage article. I’ve lived at my place over 5 years. Never missed a single payment. Keep my place nice. Abide by the rules. They refuse to negotiate price with me year to year. They use price fixing with algorithms and there’s nothing we can do about it. Only hope is to find those rare private landlords that actually keep up their end of the bargain and are reasonable to deal with. This country is cooked and we’re gonna go through a lot of much more painful times very soon. Adjusting my grocery costs lower each month, keeping my heat off in the winter, avoiding taking long drives anywhere, and having nothing left over to eat out or go to a movie is not living. It’s being labor and nothing more. It’s extra frustrating to be in this position after educating myself and working in a demanded field too. Wtf else am I supposed to do?",
                "author": "meesh137"
            },
            {
                "raw_content": "Getting worse every year since the pandemic",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Not surprised, but extraordinarily sad to hear",
                "author": "monkehmolesto"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Depot exec says Americans may soon embrace sky-high mortgage rates as 'the new normal' and invest in housing anyway",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At the end of the day the prices are too high. It doesn’t matter what the rates are if a two bedroom is going for $400,000. Add in ever increasing HOA‘s and property taxes and insurance costs and there just simply aren’t enough people that make enough money to be able to cover the $4000 a month that comes with those prices and rates.",
                "author": "ejdawson3"
            },
            {
                "raw_content": "We bought our home in 1980 when interest rates were 12%. Everyone told us we were crazy until two weeks later when they went up to 18%. We had a modest mortgage so we were able to make the payments, but it was not easy. This is a wild assumption given the cost of housing now. Who can afford a 20% mortgage on a $1 million home?",
                "author": "Entire_Dog_5874"
            },
            {
                "raw_content": "I highly doubt that. This isn't the seventies. Back then, people were buying homes with super high mortgages, some as high as in the double digits, but with most of them in the mid teens. At that time, the U.S. was coming out of a recession that hit everyone across the country hard. My parents were paying 16.8% on their mortgage, as was everyone else where we lived. Today is a different story. There's absolutely no way I can see the public accepting insanely high mortgage rates. The worst ones that I saw as an adult was the 9.9% I paid on my home after the 2008 crash, and that was pretty extreme. It's going to take a lot more to get people to cave and accept massively high rates.",
                "author": "RedSunCinema"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Only 24% of all US home sales in 2024 went to first-time home buyers, the lowest share in history",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homer Simpson: “The lowest _so far_”",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "2009 you got paid 8 grand from Uncle Sam to buy your first home. How times have changed!",
                "author": "pissantz34"
            },
            {
                "raw_content": "Not surprised. Even on engineers pay I can’t find an acceptable place in my area. Unless a trailer park is acceptable.",
                "author": "monkehmolesto"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Typical Buyer’s Down Payment Is 16% of the Home’s Price",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* That’s up from 15% a year ago. The typical U.S. homebuyer now puts down roughly $63,000, about $4,000 more than last year, because of a jump in home prices. * About 31% of buyers are purchasing homes using all cash, down from about 34% a year earlier. * 15% of mortgaged homebuyers are using FHA loans, and roughly 7% are using VA loans. The amount of money homebuyers are putting down is higher than a year ago mainly because home prices are up: A higher price means buyers typically make a bigger deposit. The median U.S. home-sale price rose 6.3% year over year in December, to roughly $428,000. The percentage buyers are putting down is relatively high because mortgage rates are elevated near 7%, and some buyers are putting down more up front to bring down their monthly interest payments. Down payments are no longer seeing the wild swings they were during the pandemic. The median U.S. down payment rose from the 10% range before the pandemic to the 15% range in 2021, which was the height of the pandemic homebuying frenzy. Mortgage rates also drove that increase, but the dynamics were very different then: Record-low rates of under 3% were fueling intense bidding wars among homebuyers, which motivated many to put more money down to make their offers stand out in a competitive environment. “While a larger down payment can lower monthly mortgage payments and help strengthen an offer in a bidding war, bigger isn’t always better,” said Sheharyar Bokhari, a senior economist at Redfin. “Housing markets in much of the country have started tilting in buyers’ favor, allowing buyers to set the terms they want. That means house hunters don’t necessarily need to break the bank for a huge down payment if it makes more financial sense to save some money for things like future home renovations or other investments.” 31% of Homebuyers Pay in Cash, Down From 34% a Year Ago Roughly three in 10 (30.6%) U.S. homes were bought with all cash in December. That’s down from 33.8% a year earlier, but up from September’s three-year low of 28.6%. The share of buyers paying in cash peaked in 2023 because that’s when mortgage rates peaked, hitting a two-decade high of nearly 8%. Buyers who can afford to pay in cash are more inclined to do so when rates are high because they’re avoiding high monthly interest payments, and saving money in the long run. Mortgage rates have since come down slightly and evened out in the 6% to 7% range, bringing down the share of buyers who are paying in all cash. Additionally, investors–who make up a big share of all-cash buyers–are purchasing fewer homes. On an annual basis, 32.6% of 2024’s home sales were made in cash, the lowest share in three years. 15% of Mortgaged Homebuyers Use FHA Loans, Little Changed From a Year Ago Roughly one of every seven (15%) mortgaged home sales used an FHA loan in December, down slightly from 15.9% a year earlier but up from mid-2022’s decade-low of roughly 10% . The share of mortgaged home sales using a VA loan rose to 6.7%, from 6.2% a year earlier. FHA and VA loans are both insured by the U.S. government. FHA loans, meant for low-to-moderate-income borrowers and popular with first-time homebuyers, have lower financial requirements than conventional loans; typically, they require a 3.5% down payment. VA loans are available to veterans, service members and their surviving spouses, and require little to no down payment. More homebuyers are using FHA loans now than in late 2021 and early 2022, when the ultra-competitive environment favored buyers with higher down payments and more ability to prove their financial security. Now, buyers are more likely to get an offer using an FHA loan accepted. Additionally, higher home prices mean more buyers find it hard to afford large down payments, making FHA loans more popular. Conventional loans are by far the most common type of mortgage. Nearly four in five (78.4%) borrowers used a conventional loan in December, little changed from 77.9% a year earlier.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I had to do 35% just to have a humane payment",
                "author": "neutralpoliticsbot"
            },
            {
                "raw_content": "Lmao and here I am using USDA Loan for $0 down. Hard to save up $50k+ while paying obscene rent prices.",
                "author": "Alternative-Bee-1716"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. Economy Depends More Than Ever on Rich People",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">All this means that economic growth is unusually reliant on rich Americans continuing to shell out. Mark Zandi, chief economist at Moody’s Analytics, estimated that spending by the top 10% alone accounted for almost one-third of gross domestic product. >Between September 2023 and September 2024, the high earners increased their spending by 12%. Spending by working-class and middle-class households, meanwhile, dropped over the same period. >“The finances of the well-to-do have never been better, their spending never stronger and the economy never more dependent on that group,” said Zandi, who oversaw the analysis, which was based on data from the Federal Reserve. The analysis runs through the third quarter of 2024 because that is the most recent data available. >Taken together, well-off people have increased their spending far beyond inflation, while everyone else hasn’t. The bottom 80% of earners spent 25% more than they did four years earlier, barely outpacing price increases of 21% over that period. The top 10% spent 58% more. >A stock market selloff or decline in home values that rattles the confidence of the top 10% and causes them to cut back would have a significant effect on the economy. Consumer sentiment is starting to slide overall, including for the wealthiest third of consumers, thanks in part to tariff threats. I found this to be a pretty alarming statistic. If the top 10% start pulling back it could be catastrophic. It just feels like a small percentage are what's keeping this economy afloat and everyone else is trying to get blood from a stone.",
                "author": "Background_Tune4679"
            },
            {
                "raw_content": "Too much money in the hands of far too few.",
                "author": "epsteinpetmidgit"
            },
            {
                "raw_content": "You say \"depends on,\" I say \"caters to.\" Re-distribute those funds to the poor and middle-class and they'll still get spent. The economy *depends* on whoever is producing whatever is consumed or traded. Finding humans willing to consume is not the challenge.",
                "author": "StrengthToBreak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "February consumer confidence comes in lighter than expected in latest sign of slowing economy",
        "score": 62,
        "text_content": ">The board’s Consumer Confidence Index slipped to 98.3 for the month, down nearly 7% and below the Dow Jones forecast for 102.3. This was the lowest reading since June 2024 and the largest monthly drop since August 2021. >“Views of current labor market conditions weakened. Consumers became pessimistic about future business conditions and less optimistic about future income,” said Stephanie Guichard, the board’s senior economist for global indicators. “Pessimism about future employment prospects worsened and reached a ten-month high.” >Though most economic indicators reflect continued growth, the Conference Board gauge matches other recent surveys showing waning confidence. Last week, the University of Michigan reported a larger-than-expected monthly decrease of nearly 10% in February while the five-year inflation outlook among respondents hit its highest level since 1995. >Along with the overall drop in confidence, the Expectations Index tumbled 9.3 points to a 72.9 reading, the first time since June 2024 that the measure has fallen below the level consistent with recession. However, the current conditions measured improved somewhat, with 19.6% saying conditions are “good,” up 1.1 percentage point from January. >However, a closely watched measure of the labor market saw a worsening, with 33.4% saying that jobs were “plentiful” while 16.3% said positions are “hard to get.” That compared to respective readings of 33.9% and 14.5% in January.",
        "comments": [
            {
                "raw_content": "The bubble that is the U.S. economy is very close to bursting.",
                "author": "Jjglo"
            },
            {
                "raw_content": "Pessimists like me aren’t “vindicated” by this reading. What I see is a reality check, a hard one, coming for the over-exuberant economy of the last 2-3 years. Sticky inflation has come home to roost, as well as stagnant job market, save for government and healthcare hiring, since early 2023. It’s been smoke and mirrors for 2 years, propped up by the promise of “AI” and stock markets reaction to that. The music is ending.",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "*wonder what it could be…*",
                "author": "WrongKielbasa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New and Existing Home Price Gap Shrinking",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From what I see in other subs the quality of new construction is mostly disgraceful shit these days. Cheap materials, low skilled labor, cost cuts in every corner. You get a better and more solid house that was built pre-covid, and the feeling of being the very first owner doesn't have a resale value.",
                "author": "Giantmeteor_we_needU"
            },
            {
                "raw_content": "Seen this before.. it wasn’t good at all.",
                "author": "Mysterious-Extent448"
            },
            {
                "raw_content": "In my state you can save thousands a year on property taxes when you buy an older home, this is the primary reason why I never even looked at a new build. Also, all the new builds have very small yards and have a worse commute. Where a new build can be good though is interest rates, often you can find a low interest rate for the first couple of years.",
                "author": "walkerstone83"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 3.9% year-over-year in December",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The S&P CoreLogic Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 3.9% annual return for December, up from a 3.7% annual gain in the previous month. The 10-City Composite saw an annual increase of 5.1%, up from a 5% annual increase in the previous month. The 20-City Composite posted a year-over-year increase of 4.5%, up from a 4.3% increase in the previous month. New York again reported the highest annual gain among the 20 cities with a 7.2% increase in December, followed by Chicago and Boston with annual increases of 6.6% and 6.3%, respectively. Tampa posted the lowest return, falling 1.1%. National home prices have risen by 8.8% annually since 2020, led by markets in Florida, North Carolina, Southern California, and Arizona. While our National Index continues to trend above inflation, we are a few years removed from peak home price appreciation of 18.9% observed in 2021 and are seeing below-trend growth over the history of the index. +52.3% --> Since January 2020 https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20250225-1477035/1477035_cshomeprice-release-0225.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Demand has picked back up in my area. Prices have stabilized but quality homes that are move-in ready continue to be sold in less than a week.",
                "author": "BigShallot1413"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "So glad to be in a time of constant AI progress",
        "score": 565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/1h5r74qhvdle1.png?width=1675&format=png&auto=webp&s=676248069b6a29a5bd81cb6fb09331938f1f8684 you know when a singular 1 day has this much news and it still feels like a pretty slow day that we're in major breakneck acceleration speeds (granted this AI newsletter I run does include leaks so not 100% of these are strictly announced things by company officials but most are legit and I only use the highest quality model credible sources for leaks)",
                "author": "pigeon57434"
            },
            {
                "raw_content": "Can it do this? ![gif](giphy|uDwKGxTFrADvO)",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "Hyyyype",
                "author": "BetImaginary4945"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is what AI was meant for, video enhancement - Project Starlight",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Open source alternative (it's actually the same thing Topaz uses, the name isn't a coincidence): [https://github.com/NJU-PCALab/STAR](https://github.com/NJU-PCALab/STAR)",
                "author": "lucellent"
            },
            {
                "raw_content": "It’s very impressive, but at the same time, side by side, he doesn’t quite look like the same person anymore? And there’s an issue where the AI sharpens and adds detail to an area that really should be out of focus?",
                "author": "Portatort"
            },
            {
                "raw_content": "Wow, this is pretty impressive.",
                "author": "paiigelisa"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Singulaity might be the solution, Help us",
        "score": 4194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You would probably have been a peasant anyway",
                "author": "Monsieur_Brochant"
            },
            {
                "raw_content": "0.01% chance: You are a knight or a king/lord 99.99% chance: You are a peasant working on some lord's land until some war band comes through and chops off your head and takes your wife, and that's if you survive thousand diseases hunting you until that point.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Born too late to die of sepsis at 14 after grazing my leg while working the fields for 12 hours a day, every day. Born to early to eat the barrel of my plasma rifle at 32 when my body finally rejects the cold metal prison that has shielded me from the endless abyss my entire life, craving an organic natural world I've never known to the point of crippling depression and insanity. Born just in time to play video games after work and go hiking with friends at the weekend.",
                "author": "Nonikwe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists Just Created Shape-Shifting Robots That Flow Like Liquid and Harden Like Steel",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A step towards programmable matter. And to think this was science fiction just 5 years ago...",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "I feel like none of these researchers have seen terminator two: judgment day",
                "author": "Radfactor"
            },
            {
                "raw_content": "Watch out John Connor!",
                "author": "Indoorsman101"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 3.7 is playing Pokémon Red on Twitch.",
        "score": 294,
        "text_content": "Claude 3.7 is playing Pokémon Red on Twitch. It’s a dedicated experiment channel (not an existing user or personality) if you wanna chrck it out > https://www.twitch.tv/claudeplayspokemon You can watch the AI think since its a reasoning model.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/f8bv7m7pfdle1.png?width=1960&format=png&auto=webp&s=f55254dddeee3103a516481f4d4763493ef9c182 Amazing, I love this",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "I don't know why but I think this is kind of adorable. The way it just cautiously thinks through every move :)",
                "author": "LordFumbleboop"
            },
            {
                "raw_content": "Claude enjoys talking to NPCs. Makes sense.",
                "author": "Hemingbird"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deep research is now rolling out to all ChatGPT Plus, Team, Edu, and Enterprise users",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Including Europe? Because whenever they say \"all Plus users\" that means \"actually no plus users in europe\". We still don't even have sora",
                "author": "Radyschen"
            },
            {
                "raw_content": "it also now supports embedding images into the reports it generates and understands sources better than before which is huge https://preview.redd.it/ctq1yrrd1cle1.png?width=742&format=png&auto=webp&s=ad7ffb058b1e6e708cd9de96153f7614cace9c15",
                "author": "pigeon57434"
            },
            {
                "raw_content": "https://preview.redd.it/i2dxycvm2cle1.png?width=751&format=png&auto=webp&s=a44479151ef0530c79aac286ee7bb9674998cea5 it is confirmed to use full o3 too even for plus users despite some people being worried it would use o3-mini on the plus tier [https://x.com/polynoamial/status/1894459508795347031](https://x.com/polynoamial/status/1894459508795347031)",
                "author": "pigeon57434"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There’s a new mystery model floating around",
        "score": 571,
        "text_content": "If true, poor sonnet 3.7",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/qynv696m6cle1.jpeg?width=1206&format=pjpg&auto=webp&s=b38071f1c07c0a272729517265944b0324510a0b This is what Claude 3.7 with extended thinking made. Better than what he showed but still far behind the alleged mystery model.",
                "author": "Affectionate_Smell98"
            },
            {
                "raw_content": "https://preview.redd.it/5vd7lrxmacle1.jpeg?width=354&format=pjpg&auto=webp&s=b7de4ba65cc182f7e3569eb6fe335d805089de0d Here is o1 Pro",
                "author": "Character_Order"
            },
            {
                "raw_content": "I'm OOL here with no explanation of what's being shown. So anyone wanna enlighten me?",
                "author": "kalabaleek"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are rolling out a version of Advanced Voice powered by GPT-4o mini to give all ChatGPT free users a chance to preview it daily across platforms.",
        "score": 291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OpenAI have been shipping like they're an Amazon fulfillment center lately, what a change from just 7 months ago.",
                "author": "Valuable-Village1669"
            },
            {
                "raw_content": "There's NO chance that the AVM in Plus mode is using 4o under the hood. It is much dumber than 4o. I will frequently drop out of AVM to instead dictate prompts and use the Read Aloud feature when I get frustrated with how dumb the model underlying AVM is being.",
                "author": "RipleyVanDalen"
            },
            {
                "raw_content": "Can we get this for the API ? Also thanks to all the free user that will refill openAI voice training data",
                "author": "Kathane37"
            }
        ],
        "subreddit": "singularity"
    }
]