[
    {
        "post_name": "Probably the worst part about being a ICE agent.",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The first thing you see is the hair - pink, green, every color of the rainbow. If only their looks were that diverse. No. Instead, they're all ugly, each one more hideous than the next.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "\"Ugly liberal\" is a bit redundant isn't it?",
                "author": "Filo76"
            },
            {
                "raw_content": "Their smell is worst.",
                "author": "NeverGiveUpTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's all so fucking gay",
        "score": 823,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't worry about the dead kids, focus only on the pronouns and the backlash. OR ELSE.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Life in Canada.",
                "author": "SenorTrumper"
            },
            {
                "raw_content": "> they arrest you for misgendering the gunperson",
                "author": "MadRussian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec. Scott Bessent: “We’re encouraging whistleblowers who know about fraud, people stealing from the American taxpayer, to come forward. At Treasury, we’re setting up a website, and we will be giving rewards up to 10–30% of the fines we levy.”",
        "score": 725,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much do I get for reporting congress?",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "Now I am interested in being like Nick Shirley.",
                "author": "Icepck"
            },
            {
                "raw_content": "How about they investigate those PPP loans that were abused religiously by the blacks during covid?",
                "author": "Kendoextendo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Anna Paulina Luna's promise to Sen. John Fetterman",
        "score": 632,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He would be the only Democrat to win their next election if he did",
                "author": "ActualStory"
            },
            {
                "raw_content": "open bobs for 1 month in DC",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Will the real John Fetterman please stand up",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: These are the Democrats now shutting down DHS.",
        "score": 504,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait a minute. You mean the people who want me penniless, tortured, and dead are also hypocrites? Well. That changes everything.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Yeah, we know that dumbfuck. We want you to fucking fix it.",
                "author": "M-m-m-my-corona"
            },
            {
                "raw_content": "Dems are defunding DHS?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jeffrey Epstein’s newly released files name Jay-Z as a sick predator who drugged and r*ped multiple women and was literally naked in a room with Harvey Weinstein.",
        "score": 1094,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he's produced the super bowl halftime show for the last seven years, iirc. which explains a *lot*, innit?",
                "author": "snuggs316"
            },
            {
                "raw_content": "He probably gave Harvey a piece of his ass to gain favor.",
                "author": "Rock9Head"
            },
            {
                "raw_content": "Fuck all this. This gets stickied? It’s a random report that anyone can make. Remember just two weeks ago when the liberals were running crazy about how Trump was in the emails because it reported he assaulted a lady at his golf course that wouldn’t exist for years later. This is the same garbage. I’m not sorry anymore… people got taken in by online grifters and were told to believe that all the evil people were in these files and once we all read them the world would purge itself of evil and everything would be sunshine and rainbows. The republicans did it, the democrats did it, because low IQ people fell for it.",
                "author": "Prof_Smith"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 HOLY CRAP. President Trump will sign an executive order mandating VOTER ID NATIONWIDE for the 2026 midterms if the SAVE America Act fails. This will now FORCE Democrats to battle voter ID in court — an 85-15 issue with the American people. GENIUS MOVE!",
        "score": 1671,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean what choice does he have? But everyone and their sister knows that theres atleast a dozen judges already waiting to toss it out or suspend it for midterms due to lack of time. SC will punt on it bc without congress they ll defer to state rights. THIS HAS TO GO THRU CONGRESS if its to stand a chance in the courts.",
                "author": "tw0scoops"
            },
            {
                "raw_content": "This was one of the biggest selling pint for my vote this time I'm very happy were finally getting it... Just wish it could include state elections not just federal ones",
                "author": "Jehsun"
            },
            {
                "raw_content": "Boasberg says what?",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 MAJOR BREAKING: Susan Collins has now BACKED the SAVE America Act, meaning Republicans now have 51 VOTES in the Senate, including JD Vance LET’S GO!!!",
        "score": 1599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "keep calling and emailing these fucktards they need to hear your voices on this.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "They need to add a line that voter fraud is a felony, and you'll spend a decade in a federal pound-me-in-the-ass penitentiary.",
                "author": "elmerecido"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "5th Circuit UPHOLDS Texas ban on paid ballot harvesting!",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats in fucking shambles",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "There shouldn’t be any votes by mail, if you can’t vote in person on Election Day you shouldn’t get to vote at all.",
                "author": "CocaineShark"
            },
            {
                "raw_content": "F you have vote by mail how does this stop? You have to find and prove that it’s happening. Seems easier to just ban vote by mail.",
                "author": "Prof_Smith"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is Camp Brave Trails, an LGBTQ camp in California for CHILDREN.",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Even if - and it's a big, big if - someone started a camp like this with genuine, naive, good intentions, it would take about eight seconds for every predator in a ten-mile radius to come running and apply for a job.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "My first thought was there's a 100% chance of kids being molested at this camp. but then, My second thought was you'd only sign up for this camp if you actually WANTED to be molested.",
                "author": "akai_ferret"
            },
            {
                "raw_content": "Grooming* camp",
                "author": "Gwoz8881"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "C'mon, become cosponsors of the SAVE Act...",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You'll much sooner see Fetterman vote for it than Mitch. Fetterman is a betterman.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "McConnell is a swamp turtle. I don't know why anyone ever thought he was some great Republican.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "It is insane that having to show ID to vote is even up for debate, shows just how far left the overton window is, we could one day seriously see a vote on if the sky is blue or not.",
                "author": "RationalThought"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Duffy: : TRUCKING CARRIERS & SCHOOL HELD ACCOUNTABLE AFTER DEADLY INDIANA CRASH INVOLVING ILLEGAL TRUCKER🚨 After a Kyrgyzstani illegal alien plowed his big rig into a van and killed four men from a tight-knit Amish community, this is what USDOT is doing NOW:",
        "score": 898,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrests would be a whole lot better than \"going out of business\"",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "🚨BREAKING: TRUCKING CARRIERS & SCHOOL HELD ACCOUNTABLE AFTER DEADLY INDIANA CRASH INVOLVING ILLEGAL TRUCKER🚨 After a Kyrgyzstani illegal alien plowed his big rig into a van and killed four men from a tight-knit Amish community, this is what USDOT is doing NOW: ❌🚛 KNOCKED OUT OF SERVICE: Illegal trucker’s employer, AJ Partners ❌🚛 KNOCKED OUT OF SERVICE: Two other SHADY carriers connected to AJ Partners - Tutash Express & Sam Express ❌🚛 REVOKED CERTIFICATION: Sham school, Aydana, that helped the illegal trucker get a license This crackdown is JUST GETTING STARTED. We will not rest until every bad actor is held ACCOUNTABLE. Thank you @FMCSA for your quick work 🇺🇸",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Time for ACTION. Arrests, fines and prison",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rudy should be completely exonerated.",
        "score": 649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Luckily there will be a strongly worded letter, or a gotcha! Moment caught on camera to flex online.",
                "author": "JustAnotherPsyopNPC"
            },
            {
                "raw_content": "What about restitution for Rudy?",
                "author": "Trajano"
            },
            {
                "raw_content": "Exonerated and made whole, with interest, from those two fucking land whale apes and everyone who funded them.",
                "author": "DJTXLV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "based af ICE agent",
        "score": 1310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol based gay ICE officer pwns AWFL. Yeah she doesnt care. And I dont care if theyre \"detaining legal citizens\" 1. She has no way of knowing that. 2. If the \"legal citizens\" committed crimes if rape and murder, that should be fast track to de-naturalization and either deportation or execution proceedings.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Yuri Bezmenov warned us about these levels of propagandization. She could see the murder or rape happen and wouldn't acknowledge she's wrong.",
                "author": "c_programmer"
            },
            {
                "raw_content": "I got $100 on Blue , as her hair color 👨‍🎤",
                "author": "NinjaPlease"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HILARIOUS: President Trump: “We're also purchasing 30 new and modified Abrams tanks. Still the best tank, right? It was named in honor of Stacey Abrams.”",
        "score": 1402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy fuck 😳😂",
                "author": "couranto"
            },
            {
                "raw_content": "KEK",
                "author": "Bullet3250"
            },
            {
                "raw_content": "Abrams should be in jail for failing to disclose 4 million in campaign contributions, and 3 million in spending, during her run for governor in 2018. She got hit with a $300,000 fine, but that leaves plenty of money left over. Not to mention her organization registered 800,000 \"new voters\" leading up to the 2020 election.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: DHS Secretary Kristi Noem is PERSONALLY on the ground in Arizona as HSI ramps up their investigation into VOTER FRAUD. “We discussed voters who may have voted here but are registered in another state!” AZ is one of the WORST states for fraud!",
        "score": 1238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m sure Arizona is trembling after all the arrests in Georgia",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Kari Lake should be the Governor. Not the dingbat commie we have now (KKKatie Hobbs).",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "Another announcement but still nobody in jail!",
                "author": "SonOfThunder"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mike Lee : Enforcing the Talking Filibuster is NOT “eliminating” the filibuster. It’s just enforcing the Senate’s rules and making Democrats opposed to the SAVE America Act actually *speak* if they want to filibuster. If we don’t do this now, we might as well prepare to lose.",
        "score": 385,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But the Dems wont regain Senate control for decades if we have fair elections and stop counting non citizens in the census to decide congressional districts.",
                "author": "shapeshifter_69"
            },
            {
                "raw_content": "Prepare your anus because Thune is going in dry.",
                "author": "SmokeDopeDank"
            },
            {
                "raw_content": "I wont even bother voting anymore unless they demand to see ID. Not playing make believe anymore.",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Large fire erupts at one of Cuba’s largest oil refineries, Ñico López, Havana,",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Somebody better seize the means of a fire hydrant.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "That isn't going to help the fuel shortage",
                "author": "Sea_Still"
            },
            {
                "raw_content": "The country is shutting down because Trump cut off Venezuela oil. Now it's more fucked?",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our enemies will shake in fear… 😱🤣",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully no gaps in the armor.",
                "author": "Rucktoe"
            },
            {
                "raw_content": "Gonna need a Bailey bridge to cross that massive Gap",
                "author": "NinjaPlease"
            },
            {
                "raw_content": "absolute savage",
                "author": "magaspif"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They raided a fucking squirrel.",
        "score": 400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "P'Nut and Fred... RIP. Dozen SWAT and animal control raided a home because they could and slaughtered the animals. NEVER forget what they've TAKEN from US.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "thanks Bondi, great job bringing justice!",
                "author": "etcetera"
            },
            {
                "raw_content": "i heard there was nothing actionable in the Epstein files can we democratically recall presidential cabinet appointments?",
                "author": "joemccarthysghost"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Smartphones don't need more power - They need cheaper chips",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are cheaper chips in cheaper phones which do every single task without any lag. Cheaper phones also come with 120hz screens and decent storage speeds. There is literally no \"need\" to have an expensive chip in your phone these days unless one wants to do high end gaming.",
                "author": "Gambler_720"
            },
            {
                "raw_content": "They need more battery",
                "author": "PCMasterCucks"
            },
            {
                "raw_content": "Just don't buy flagships. No one holds a gun to your head to do so.",
                "author": "Kinexity"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A Chinese gamer's MSI GeForce RTX 5090 reportedly caught fire immediately after first use",
        "score": 392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that is where the leg is that sits in the latch of the pcie slot. That leg has been damaged and circuits run through them on all gpus. My sisters 3060ti suffered the same fate. I would say it was either mishandled by the person or by shipping.",
                "author": "theRealtechnofuzz"
            },
            {
                "raw_content": "The first thing he did while his pc was litteraly burning was to take a photo? 👺",
                "author": "inyue"
            },
            {
                "raw_content": "Am i really the only one questioning if this is actual news. I mean its hardware operated by electricity, so there is always a risk of fire. Usually very small, although errors while building the system of handling the card can enlarge that risk. But we don't know if a mistake while handling the card or building the system happened here. But with the sheer amount of GPU's manufactured and used globally stuff like this is bound to happen in at least a handful of cases during a GPU generation even if its a 1 in a million chance of this happening to any given GPU.",
                "author": "Chronia82"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell XPS 14 2026 with Intel Panther Lake delivers 55% longer battery life vs 2025 Dell 14 Premium",
        "score": 140,
        "text_content": "A significant accomplishment by Intel & Dell; the overall laptop efficiency is much closer to the earlier U-series CPUs (i7-1165G7, i5-1230U) and Lunar Lake (256V), **but** with OLED this time, so that is a significant win over those designs. The data going as far back as my motivation will allow. |Notebook|CPU|Screen|Battery|Wi-Fi Battery Life|Min / WHr|Idle power (avg)| |:-|:-|:-|:-|:-|:-|:-| |Dell XPS 13 (2020)|i7-1165G7 (TGL-U)|13.4\" IPS|52 WHr|657 minutes (11 hours)|12.6 min / WHr|5.9 Watts| |Dell XPS 13 (2021)|i5-1230U (ADL-U)|13.4\" IPS|51 WHr|888 minutes(14.8 hours)|17.4 min / WHr|6.8 Watts| |Dell XPS 13 Plus (2021)|i7-1280P (ADL-P)|13.4\" OLED|55 WHr|346 minutes (5.8 hours)|6.3 min / WHr|7.8 Watts| |Dell XPS 13 Plus (2023)|i7-1360P (RPL-P)|13.4\" OLED|55 WHr|436 minutes (7.3 hours)|7.9 min / WHr|7.4 Watts| |Dell Premium 14 (2024)|155H (MTL-H)|14.5\" OLED|69.5 WHr|465 minutes (7.8 hours)|6.7 min / WHr|9.9 Watts| |Dell XPS 13 (2024)|256V (LNL)|13.4\" IPS|55 WHr|1,236 minutes (20.6 hours)|22.5 min / WHr|2.5 Watts| |Dell Premium 14 (2025)|255H (ARL-H)|14.5\" OLED|69.5 WHr|648 minutes (10.8 hours)|9.3 min / WHr|6.1 Watts| |Dell XPS 14 (2026)|358H (PTL-H)|14.5\" OLED|69.5 WHr|1,005 minutes (16.8 hours)|14.5 min / WHr|3.6 Watts| Sources: [Dell XPS 13 9310 Core i7 Laptop Review: The 11th Gen Tiger Lake Difference - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-XPS-13-9310-Core-i7-Laptop-Review-The-11th-Gen-Tiger-Lake-Difference.499291.0.html) [Dell XPS 13 9315 laptop in review: Low performance, incredible battery life - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-XPS-13-9315-laptop-in-review-Low-performance-incredible-battery-life.640173.0.html) [All three Dell XPS 13 Plus 9320 SKUs in review: Core i5-1240P, i7-1260P, or i7-1280P OLED? - NotebookCheck.net Reviews](https://www.notebookcheck.net/All-three-Dell-XPS-13-Plus-9320-SKUs-in-review-Core-i5-1240P-i7-1260P-or-i7-1280P-OLED.644466.0.html) [Barely any better than the previous year: 2023 Dell XPS 13 Plus 9320 Core i7-1360P review - NotebookCheck.net Reviews](https://www.notebookcheck.net/Barely-any-better-than-the-previous-year-2023-Dell-XPS-13-Plus-9320-Core-i7-1360P-review.733651.0.html) [Dell XPS 13 9350 laptop review: Intel Lunar Lake is the perfect fit - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-XPS-13-9350-laptop-review-Intel-Lunar-Lake-is-the-perfect-fit.911314.0.html) [Dell XPS 14 2026 review: Fully reborn with Intel Panther Lake X7 - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-XPS-14-2026-review-Fully-reborn-with-Intel-Panther-Lake-X7.1218670.0.html) [Dell 14 Premium laptop review: An XPS 14 in all but name - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-14-Premium-laptop-review-An-XPS-14-in-all-but-name.1086446.0.html) [Dell XPS 14 2024 review - The multimedia laptop with the slowest RTX 4050 Laptop in the world - NotebookCheck.net Reviews](https://www.notebookcheck.net/Dell-XPS-14-2024-review-The-multimedia-laptop-with-the-slowest-RTX-4050-Laptop-in-the-world.822652.0.html)",
        "comments": [
            {
                "raw_content": "Why are they putting anything less than 99Wh in these?",
                "author": "jenny_905"
            },
            {
                "raw_content": "Looks like if you're prioritizing battery life, Lunar Lake is still better? But for similar class chips, Panther Lake is far better than Arrow Lake.",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "It should be noted that it was Arrow Lake, but the fact that they're getting much better battery life is a huge achievement.",
                "author": "DYMAXIONman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Corsair has managed to 'successfully navigate a constrained global semiconductor market to secure supply' for memory, as its PC gaming hardware profits jump 60% in a year",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the memory constraints didnt start until like december and they are talking about profits for the whole year...",
                "author": "TophxSmash"
            },
            {
                "raw_content": "Someone signed a long term supply agreement before shsit hit the fan I guess. So nice when the market situation makes you look good :'). I guess this is arguably a situation in which the management have made their own luck.",
                "author": "ClearlyAThrowawai"
            },
            {
                "raw_content": "When the market crashes and they bought RAM modules at a higher price, do we expect them to keep the price high to cover the cost of hardware? or sell at a loss to maintain revenue?",
                "author": "monsieurvampy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GDC: DirectX State of the Union 2026 - DirectStorage and Beyond",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The first dx12u capable hardware was released in 2018. Now in 2026 we are still trying to figure out how to polish it. And the most pathetic part is that we should be looking forward to anything we can do to improve current hardware performance cause new hardware isn't coming anytime soon.",
                "author": "dantemp"
            },
            {
                "raw_content": "I’m not against it, but there are maybe 3 games that is using it, no?",
                "author": "Correct-Explorer-692"
            },
            {
                "raw_content": "Also, what with the naming? Why dx 12\\_1, 12\\_2, 12ultimate?",
                "author": "Correct-Explorer-692"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron 9650 NVMe SSD Enters Mass Production as First PCIe Gen6 Enterprise SSD",
        "score": 2,
        "text_content": "Who uses these ?\\ There is no PCIe6 capable HW in sight...",
        "comments": [
            {
                "raw_content": ">Who uses these ? There is no PCle6 capable HW in sight... What is that question, OP? Did you read a news article that you linked ? >becoming the first data center SSD Data center SSD. Not for your personal use with your home PC.",
                "author": "East-Today-7604"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PlayStation UK Now Offers PS5 Leasing Starting at £9.95 per Month",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"You'll own nothing, and you'll be happy\"",
                "author": "IshTheFace"
            },
            {
                "raw_content": "£10 x 36 months = £360. For perspective, the PS5 Slim has an MSRP of £390 in U.K. In any case, I wonder if this lease covers Dual Sense controllers, which tend to go belly up in a year or two (mostly stick drift issues).",
                "author": "GenZia"
            },
            {
                "raw_content": "Surely you'd be better off just financing it? Even though that's obviously also not the best financial decision..",
                "author": "ClickClick_Boom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo really needs a filter for this shit.",
        "score": 465,
        "text_content": "why do they even allow this in the store.",
        "comments": [
            {
                "raw_content": "I wish we had sales figures for all of the Furry and Hentai games. I need to know if these games are actually making enough money to be worth it.",
                "author": "ParkPants"
            },
            {
                "raw_content": "If they filtered it then how the hell would I ever find Furry Girls Paradise?",
                "author": "6ftToeSuckedPrincess"
            },
            {
                "raw_content": "Man do I miss being able to browse the eshop's new and indie titles. Now it's 99% Ai Shovelware slop. From what information I've been able to find, Companies and Publishes after acquiring a license to publish to the eShop can seemingly publish at their own discretion and some of said companies turned it into a business model to publish whatever slop is out there. One of the first ones I noticed was reddeer games (and I've even gotten horrible ai generated ads for them to publish games to switch) but now many others have picked up the same strategy. I frankly don't care if they purchased it or not, says licenses need to be revoled for this shit.",
                "author": "ZeeGee__"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "After 15 Hours With Mario Tennis Fever – An Honest Review From a 38-Year-Old Gamer",
        "score": 331,
        "text_content": "First of all, if you’re reading this, please know this review is completely honest. No exaggeration, no blind hype. I’m writing this after 15 hours of gameplay. For those who obsess over Metacritic scores, this game is proof that a title under 90, even under 80, can still deliver one of the best gaming experiences you’ve had in years. It’s still very early since release, but I genuinely believe this will be one of those games people appreciate more over time. Mario Tennis Fever is the definition of pure fun. This is an arcade sports game. Smooth gameplay and addictive mechanics are mandatory, not optional. And this game delivers. Many critics praised the core gameplay but lowered their scores because of the adventure mode. In my opinion, that mode is simply a bonus. The real strength of this game lies in its mechanics, competitive depth, and replayability. At first glance, you might think it’s similar to Mario Tennis Aces, but aside from both being tennis games, they feel completely different. Aces had an extremely high skill ceiling. I put over 140 hours into it, but only around 10 of those hours were spent in standard mode with the full mechanics like Zone Shots and special abilities. The rest of my time was in simple mode with no superpowers, no tricks, just straightforward tennis, because the standard mechanics often felt overwhelming. Tennis Fever strikes a better balance. It is easy to pick up, but mastering it is something else entirely. In that sense, it reminds me of Mario Kart, accessible for everyone yet layered with depth for players who want to improve. The Fever rackets add real strategic variety. You can use the Mud Racket to slow parts of your opponent’s court near the net and then pressure them into those zones with smart drop shots. Or you can equip the Star Racket to neutralize your opponent’s Fever effects. These mechanics genuinely change positioning, pacing, and mind games. Very few games give me that just one more match feeling. Only Mario Kart and FIFA have done that consistently for me, and now Tennis Fever joins that league. Now to be fair, there are definitely areas that need improvement, especially online. Online performance is hit and miss, especially when playing ranked matches, in some games there is no way to play not happen often but when happens it’s ugly. It is nothing close to Mario Kart World in terms of consistency. I have only played online with one friend so far, and about 90 percent of the time it was smooth and enjoyable. However, sometimes inputs simply do not register, and this is a high reflex reaction game. If your swing does not register at the right moment, that point is basically gone. There is currently no way to play ranked doubles with a friend, which is honestly a missed opportunity for a game like this. In general, the online experience could be improved both in terms of UI and overall features. That said, the core gameplay is so addictive, fun and strong that I keep coming back. I’m playing this game nonstop like a possessed person lol. And when I’m not playing, I’m thinking about gathering my brother and cousins for endless 2v2 doubles matches. That is when you know a game has something special, when you are excited to share it. There is much more I could say, but honestly, this is some of the most fun I’ve had with a game in years. I truly believe that years from now people will still be playing it and remembering it as one of the best party sports games of its generation. My rating is based purely on gameplay quality, fun factor, and replayability. 10/10.",
        "comments": [
            {
                "raw_content": ">There is currently no way to play ranked doubles with a friend This is hilariously on-brand for Nintendo.",
                "author": "LunchPlanner"
            },
            {
                "raw_content": "I'm fortunate enough to still play Aces with my family, and we prefer the traditional mode. We've been playing frequently for over four years, and I have no doubt that Fever will continue to entertain us just like the last Aces installment.",
                "author": "Icy-Concert4764"
            },
            {
                "raw_content": "Preaching to the choir. I still play mario tennis on the 64 lol. These are good \"chill out\" games. When I don't want to use my brain after work, these and racing games scratch the gaming itch without too much investment",
                "author": "majin_buu_brother"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 outsells Playstation 5, both editions combined, more than SEVEN TIMES over in Japan.",
        "score": 1065,
        "text_content": "Welp, time to build up those optimising muscles.",
        "comments": [
            {
                "raw_content": "Even the Switch LITE is outselling the PS5?? In 2026?",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I’m guessing Japan is very fond of mobile/ portable gaming",
                "author": "DOndus"
            },
            {
                "raw_content": "Doesn’t Japan sell them at a discount there while PS5 prices have gone up? I would assume that would help.",
                "author": "delbertjrw"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Local target clearancing out some switch 2 games",
        "score": 186,
        "text_content": "My local one usually does this, they had a bunch of PS5 too, but I don't care for them so, not pictured.",
        "comments": [
            {
                "raw_content": "Cant wait to go to mine and find the Crayola Scooter game for 35 dollars.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "I can never find my clearance section.",
                "author": "DoctorSchwifty"
            },
            {
                "raw_content": "ToTK - $39.99 BotW - $48.99 Wonder - $41.99 Pacman- $16.34 Tony Hawk - $19.49 Star wars - $26.49 Cyber Punk - $48.99 Daeman Machina - $34.99",
                "author": "Erock2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's funny how DS emulation on single screens have existed for years with multiple fan made reworks, yet people get confused when Nintendo, who literally made the system, may be interested in DS NSO.",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell, Switch already has emulated DS games in the Castlevania Dominus Collection. It really is simple, not perfect, but simple.",
                "author": "Male_Inkling"
            },
            {
                "raw_content": "Are people forgetting on the Wii U you could just put the 2nd screen in a corner if you played it handheld? Thats how I played all the DS games, top screen filling majority and bottom screen in the top corner",
                "author": "azaanabbas"
            },
            {
                "raw_content": "People have been doing photoshops of a second screen that uses the top port of the Switch 2, or doing custom builds of other consoles like the Steam Deck with a second screen. Honestly that seems like a nightmare. It would be way too top heavy to play anything effectively. If they're going to do DS on NSO, I think they should sell an accessory like the Flip Grip. Attach a joycon each to the top and bottom of the tablet and turn the whole thing on its side. That would take advantage of the most screen space without being too big and making games look worse with the lack of detail on the original.",
                "author": "macklin67"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kingdom Come Deliverance 1 just got a free 60fps patch, but not on Switch 2",
        "score": 352,
        "text_content": "Pretty strange they didn’t make a switch 2 edition when it can easily handle it. hopefully they’re working on it",
        "comments": [
            {
                "raw_content": "I got happy and excited for a second there :(",
                "author": "Flat-Drummer-9351"
            },
            {
                "raw_content": "you're yanking my pizzle, backhanded clickbaity title got my hopes up for a moment:( one of the best games on the platform right now. really hope we get KCD2 later",
                "author": "Happy-For-No-Reason"
            },
            {
                "raw_content": "It’s made by the same studio that did the switch 1 port. Funny enough",
                "author": "Rocco_Morrashow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reanimal on Friday the 13th. So excited",
        "score": 17,
        "text_content": "Kinda wish I had an oled screen to get the deep blacks but loving the performance rn. Can’t wait to shit my pants playing this.",
        "comments": [
            {
                "raw_content": "Excellent game.",
                "author": "TrionCube"
            },
            {
                "raw_content": "Did they fix the performance?",
                "author": "oakgecko13"
            },
            {
                "raw_content": "Waiting for the friends pass to release then I’ll be playing it for sure.",
                "author": "TruckFreak6417"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's here and can't be used yet!",
        "score": 276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have back pain just looking at this picture",
                "author": "haelous"
            },
            {
                "raw_content": "You can take the red plastic out and try Mario Odyssey or Breath of the Wild. Don't know the other VR compatible games from the top of my head. Mario Kart?",
                "author": "AmsterdamReddFan"
            },
            {
                "raw_content": "The stand is on backwards",
                "author": "DotheUrkel"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "the Black Flag Remake will be revealed in April according to InsiderGaming.",
        "score": 313,
        "text_content": "“One game that is still coming is the Assassin’s Creed: Black Flag Remake. The latest rumors suggest that a reveal will take place in April after being delayed out of the current physical year” . https://insider-gaming.com/six-games-ubisoft-canceled/",
        "comments": [
            {
                "raw_content": "Is this an early April Fools joke?",
                "author": "LinkedInParkPremium"
            },
            {
                "raw_content": "Fiscal year * lol but that makes sense. Although there is that art book on Amazon with a release for March. Maybe it'll be delayed too?",
                "author": "Hydroponic_Donut"
            },
            {
                "raw_content": "Yves found a new fetish by cancelling games the year they were supposed to come out",
                "author": "ManateeofSteel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Castlevania: Belmont's Curse listed for $39.99 USD on all platforms by Best Buy",
        "score": 708,
        "text_content": "Despite [only being made available to wishlist](https://www.konami.com/games/castlevania/belmonts_curse/us/en-us/) digitally for the time being with no other details shared by Konami, [Best Buy](https://www.bestbuy.com/product/castlevania-belmonts-curse-nintendo-switch/J76T5H3L52) has put up a retail listing for *Castlevania: Belmont's Curse*, which appears to confirm a physical release for all consoles and a **$39.99 USD** price tag. None of this information has been officially confirmed by the publisher at this time.",
        "comments": [
            {
                "raw_content": "Konami just woke up one day and remembered they can make new games with all the IP they own. New Silent Hill games and now a new Castlevania. Wonder if they’ll take things further and make a new Metal Gear?",
                "author": "PleaseGiveUsHope"
            },
            {
                "raw_content": "Whoever hit Konami in the head to be doing this needs all the praise in the world lol",
                "author": "YukYukas"
            },
            {
                "raw_content": "Guys Konami is cool again ![gif](giphy|J1XRNM2NpzcyC1Eg4m)",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: RE10 is right now aiming for a 2029 release",
        "score": 492,
        "text_content": "https://xcancel.com/aestheticgamer1/status/2022244942085832763?s=46 This would mean we are getting annualised RE games until 2030 2026 - RE9 and its DLC 2027 - CV remake 2028 - RE0 remake 2029 - RE10 and maybe DLC?",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Where’s Jill",
                "author": "NautaBaut"
            },
            {
                "raw_content": "Awesome if true. 1 per year, and then 1 silent hill per year. Survival horror is back on the menu twice a year!",
                "author": "MetalFungus420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming: The Six Games Ubisoft Has Canceled Amid Restructuring",
        "score": 266,
        "text_content": "In the latest episode of Insider Gaming Weekly, it was revealed the six games that were canceled at Ubisoft when they announced the cancelation of Prince of Persia: Sands of Time remake. Two games were Assassin's Creed mobile games, including the end of support for Assassin's Creed Rebellion. The other three were three new IPs called Project Crest, Project Pathfinder, and Project Ether. Show with timestamp that has more discussion: [https://www.youtube.com/live/rZcgQAfLRd4?si=k8dedz7N5aQ7E0D9&t=3247](https://www.youtube.com/live/rZcgQAfLRd4?si=k8dedz7N5aQ7E0D9&t=3247) Article with just the games: [https://insider-gaming.com/six-games-ubisoft-canceled/](https://insider-gaming.com/six-games-ubisoft-canceled/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "* **Prince of Persia: The Sands of Time Remake** – Canceled after being first announced in 2020. * **Project Ether** – In development since 2019, which was canceled, but has morphed, in a way, into a newer project. Believed to have been in development at [Ubisoft Halifax](https://insider-gaming.com/ubisoft-closes-halifax-studio-employees-unionized/). * **Project Pathfinder** – Known previously as Project U * **Project Crest** – A World War 2 extraction shooter * **Assassin’s Creed Rebellion** – Stopping support * **Assassin’s Creed Singularity** – A new mobile Assassin’s Creed Game",
                "author": "nathlapatate"
            },
            {
                "raw_content": "So....so...rayman is ok?",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ben Starr's creepy voice lines as Durandal in Marathon leaked",
        "score": 256,
        "text_content": "- Supposedly he says these eerie phrases at the start of random matches \"You should not have come here\": [https://streamable.com/628oh3](https://streamable.com/628oh3) \"You walk across your tomb”: [https://streamable.com/k111wl](https://streamable.com/k111wl)",
        "comments": [
            {
                "raw_content": "Ben Starr? Of Balatro fame?",
                "author": "ienjoymen"
            },
            {
                "raw_content": "Brooding. Slow. Dark. Ben Starr? ![gif](giphy|3oxQNDG9BswdLjN8Va)",
                "author": "Tyray90"
            },
            {
                "raw_content": "Ben Starr is quickly become the new \"voice actor thats in everything\" To be clear this is 100% a good thing",
                "author": "Totheendofsin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Castlevania: Belmont's Curse Announced + \"numerous new products\"",
        "score": 131,
        "text_content": "As per prior rumors, Castlevania is back. Castlevania: Belmont's Curse announced [https://www.youtube.com/watch?v=X3-SJLWzjmE](https://www.youtube.com/watch?v=X3-SJLWzjmE) And additional \"products\" >\"The doors of Castlevania open once more. This year marks the 40th anniversary since the original ‘Akumajō Dracula’ first saw the light of day. In this commemorative year, “Castlevania” will be revived. First up is this title: ‘Castlevania: Belmont's Curse’. We couldn’t think in other studios to work together rather than Evil Empire and Motion Twin, studios brimming with talent and passion, to deliver a new exploration-based 2D action game that captures the essence of Castlevania while bringing fresh innovation. This is the beginning of numerous new products around Castlevania. Look forward to the return of the magnificent “nightmare” lurking in the darkness.\" [https://www.konami.com/games/castlevania/eu/en/](https://www.konami.com/games/castlevania/eu/en/) Prior Rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l9nudj/new\\_castlevania\\_game\\_still\\_coming\\_according\\_to\\_vgc/?sort=new](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1l9nudj/new_castlevania_game_still_coming_according_to_vgc/?sort=new)",
        "comments": [
            {
                "raw_content": "\"deliver a new exploration-based 2D action game that captures the essence of Castlevania while bringing fresh innovation.\" Finally, this is all I wanted to hear. I enjoy Dead Cells but did NOT want it to be a rogue/lite.",
                "author": "NautaBaut"
            },
            {
                "raw_content": "Us Castlevania fans prayed for times like these.",
                "author": "TheOJsGlove"
            },
            {
                "raw_content": "hoping for a collection of the 3D games soon",
                "author": "TeamDarkRonnie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kingdom come Deliverance PS5 and Series X/S update out now",
        "score": 154,
        "text_content": "previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/UNtcmqqURD https://xcancel.com/i/status/2022339993675702449 just like I predicted 😏",
        "comments": [
            {
                "raw_content": "Jesus Christ be praised! Henry's come to see us!",
                "author": "Brother_Clovis"
            },
            {
                "raw_content": "You are a god. Predict when Switch 2 version is coming.",
                "author": "kalaspuffar16"
            },
            {
                "raw_content": "I was hoping they would’ve made some tweaks to combat as well, but this is still good news. Maybe a mod will bring it up to KCD2 levels.",
                "author": "Horibori"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "EA UFC 6 releasing in June-July 2026, reveal coming in May",
        "score": 78,
        "text_content": "- Late spring/early summer release to drop alongside the International Fight Week - The game will launch on consoles & PC with full crossplay support, a first for the franchise. - The striking feature is supposedly getting a complete overhaul Source: Mike Straw (Insider Gaming) and Combat eSports Media Mike talking about UFC 6 (32:02): https://www.youtube.com/watch?v=HnnnJ6AywdI",
        "comments": [
            {
                "raw_content": "Having it on PC is nice",
                "author": "UsefulActuator9630"
            },
            {
                "raw_content": "Where is the Fight Night?",
                "author": "DreamEray"
            },
            {
                "raw_content": "Glad to see this one finally hit PC. It’s flown under the radar for far too long, I even picked up a cheap Series S just to play UFC 5 with friends",
                "author": "bensastian"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Nova Lake \"Dual Compute Tile\" CPU Power Limits: 150W PL1, PL2 Almost 500W, 800W+ PL4",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This isn't surprising at all, considering that the existing 24 core 285K has a PL2 of 250W, so 24 cores \\* 2 = 500W for 48 cores (not including LPE)",
                "author": "SmashStrider"
            },
            {
                "raw_content": "who cares how much power it uses, its like 52 cores in a workload that most people will never do. how fast are these things, thats all that matters",
                "author": "Zeraora807"
            },
            {
                "raw_content": "By next week, it'll be 1000W. Then 2000W the following week.",
                "author": "F9-0021"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Expanding Intel Panther Lake to a lower price bracket: Lenovo releases new ThinkBook 14 & 16 G9 IPL laptops",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uff good luck there. The Ryzen AI 7 350 already goes for less than half that price, has a better battery life and at least double the iGPU performance. Tough sell.",
                "author": "Minimum_Leadership51"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Congatec Panther Lake embedded modules add LPCAMM2 and up to 96GB LPDDR5X options",
        "score": 38,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock posts stable AM5 BIOS 4.10 addressing AMD Ryzen AM5 CPU boot issues",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My X870E Nova already killed a 9800X3D. Just got a 9950X3D to replace it and will live on this BIOS version and higher only. If this one dies too, I'm taking one for the team to confirm the existence of murderboards.",
                "author": "Zetzun"
            },
            {
                "raw_content": "Interesting that Asrock has this out as a stable bios while everyone else still in beta.",
                "author": "Opteron170"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The affordability crisis is driving unprecedented price cuts in the housing market, Realtor.com says",
        "score": 245,
        "text_content": "The housing affordability crisis is forcing homebuilders to do something they’ve almost never done: slash prices on new homes more aggressively than homeowners are for their homes on the market. This is a first for the housing market in recent history, according to a [Realtor.com](http://Realtor.com) report released Thursday. “The current housing market is entrenched in an affordability crisis, leaving many average American families feeling excluded from the traditional promise of upward mobility and homeownership,” said Stuart Miller, CEO of Fortune 500 homebuilder Lennar, during a December earnings call. Lennar’s average sales price dropped 10% year over year to $386,000 in Q4 2025, according to its earnings report. During the fourth quarter of 2025, nearly 20% of new homes faced a price cut, the Realtor.com report shows, and existing home price reductions trail at about 18%. This shift suggests we’re entering a buyer’s market, Realtor.com says, as home prices drop. Read more: [https://fortune.com/2026/02/12/housing-affordability-crisis-new-home-price-cuts-realtor-com-report/](https://fortune.com/2026/02/12/housing-affordability-crisis-new-home-price-cuts-realtor-com-report/)",
        "comments": [
            {
                "raw_content": "Buys home for 500k in 2020. Sells for 1 million in 2026. No one buys. Cuts price by 100k. $100k cut is insane. $900k is such a steal!!!",
                "author": "falling_knives"
            },
            {
                "raw_content": "Every new construction I look at either condos, townhouses or houses are starting at $550,000 to 5 million.",
                "author": "Pickle-Rick-C-137"
            },
            {
                "raw_content": "Ppppfffff. Covid caused unprecedented price increases. So much so that I can say, in my entire adult life I have never seen such staggering hikes.",
                "author": "LightBeerOnIce"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Consumer prices rose 2.4% annually in January, less than expected",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Totally believable data",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "Of course, it’s less than expected. You just can’t afford to buy food anymore. That’s all.",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "KEY POINTS * The consumer price index for January accelerated 2.4% from the same time a year ago, down 0.3 percentage point from the prior month and the lowest since May 2025. * Excluding food and energy, the core CPI was up 2.5%. Economists surveyed by Dow Jones had been looking for an annual rate of 2.5% for both readings. * The lower-than-expected reading helped boost the outlook for Federal Reserve interest rate cuts in the futures market. The cost of goods and services rose at a slower annual rate than expected in January, providing hope that the nagging U.S. inflation problem could be starting to ease. The consumer price index for January accelerated 2.4% from the same time a year ago, down 0.3 percentage point from the prior month, the Bureau of Labor Statistics reported Friday. That pulled the inflation rate down to where it was the month after President Donald Trump in April 2025 announced aggressive tariffs on U.S. imports. Excluding food and energy, the core CPI was up 2.5%, the lowest level since April 2021. Economists surveyed by Dow Jones had been looking for an annual rate of 2.5% for both readings. On a monthly basis, the all-items index was up a seasonally adjusted 0.2% while core gained 0.3%. The forecast had been 0.3% for both. Though the category accounted for much of the CPI gain, shelter costs rose just 0.2% for the month, bringing the annual increase down to 3%. Shelter makes up more than one-third of the CPI. Elsewhere, food prices increased 0.2% as five of the six major grocery group categories posted gains. Energy fell 1.5% while vehicle prices also were muted, with new vehicles up just 0.1% and used cars and trucks falling 1.8%. Airline fares jumped 6.5% while egg prices fell 7% and are now down 34% over the past year after a meteoric surge.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A decade-by-decade look at why and when housing became unaffordable",
        "score": 2,
        "text_content": "yes, it is possible for affordability to get worse in the US. just because it sounds unbelievable and unfair, doesn't mean it can't happen.",
        "comments": [
            {
                "raw_content": "Chart completely incorrect, because it starts at the exact wrong time. They passed the Real Estate laws in the 60s, but no one noticed until late 90s. Late 90s it became gently expensive and people started flipping houses. Clinton and Bush added gas to the fire with the laws they passed and we had total bubble passed 2000, even though we had a recession and small Real Estate crash in 2002-2003. That crash was still in bubble territory. Ever since housing values exploded in nominal terms, but priced in GOLD everything (stocks, real estate, all assets) started losing value since 2000 peak. Right now Real Estate is the cheapest ever in the history of USA priced in GOLD. If you don't understand what that means I will help: You're not poor. You were robbed. Our currency failed, but we got paid in it, except for top few families in the country that knew what was happening. Humans \"investing\" in real estate since about 2014 actually lost wealth relatively speaking. Only their nominal number went up. 99.9% of humans always get caught in that simple game. Your house worth 3 millions has no meaning. You did not gain. You lost. I'm not even going to start talking about affordability. That alone should have been a revolution long ago. Read Epstein files, they are making fun of us for not revolting on that one. Last time Real Estate was cheap was 2011, and early 90s. Last time stocks were actually cheap was 1980. You can't win buying assets after 1971. Not physically possible, no matter what you thinking. Nominal number is not wealth. If it was, we would be the richest ever right now.",
                "author": "aw33com"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Cooler January CPI Keeps Fed Rate Cuts In Play",
        "score": 8,
        "text_content": "10 year yield has moved closer to 4%. We should see significant decline in mortgage rates this afternoon and early next week.",
        "comments": [
            {
                "raw_content": "Great news, I lock in my rate in the next week.",
                "author": "gcadays09"
            },
            {
                "raw_content": "when mortgage 4% normal again ?",
                "author": "tasty_meatballs69"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT5.2 Pro derived a new result in theoretical physics",
        "score": 519,
        "text_content": "Link to tweet: https://x.com/kevinweil/status/2022388305434939693?s=20 Link to paper: https://arxiv.org/pdf/2602.12176 Link to blog: https://openai.com/index/new-result-theoretical-physics/",
        "comments": [
            {
                "raw_content": "It would be amazing if these scaffolded models were available to all.",
                "author": "MrMrsPotts"
            },
            {
                "raw_content": "\"Stochastic parrots\" figuring out physics way outside of comprehension of people calling them stochastic parrots.",
                "author": "TheJzuken"
            },
            {
                "raw_content": "The claim over on HN was that this was figured out in the 80s: https://journals.aps.org/prl/abstract/10.1103/PhysRevLett.56.2459 Can any experts opine? I can read the words but they don't mean anything to me..",
                "author": "Aeonmoru"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Priorities",
        "score": 9929,
        "text_content": "Credit: [Charles Curran on X (Seedance 2.0)](https://x.com/charliebcurran/status/2022463429823598999)",
        "comments": [
            {
                "raw_content": "Priorititties",
                "author": "FeDeKutulu"
            },
            {
                "raw_content": "lmao that ending got me",
                "author": "FishDeenz"
            },
            {
                "raw_content": "The zoomed out shot at the end was fucking cinema 😂😭",
                "author": "Void-kun"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Says Internal Model May Have Solved 6 Frontier Research Problems.",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well they're also speculating on those 6 solutions correctness, I am sceptical until the actual solutions are published",
                "author": "Solid-Carrot-2135"
            },
            {
                "raw_content": "Just like the IMO last year, this is one of the rare glimpses into the actual frontier of AI models, because the thing that they have right now - we're not getting it for half a year perhaps. Btw if we are to believe OpenAI's timelines on AI research intern as of September 2026, then likely they would just started training that particular model maybe around now ish (and ofc they would use it internally for many months before anyone on the outside ever gets access to it, or maybe even know of it). So this model that they tested here is probably the generation right before that AI intern. Edit: Anyways regarding 1st Proof There's gonna be a number of different types of attempts on these. There will be attempts to have a model without any scaffolds to try and solve it in one shot. There will be attempts where there's minimal human effort in a multi turn chat (like, the human has no understanding whatsoever, but merely tells the model to improve the rigor of the proof of Lemma 3 used in the proof or something). There will be attempts where an amateur will try to solve the problem as a human-AI collaboration. There will be attempts where a semi expert will try to solve the problem as a human-AI collaboration. Like, AI provides some of the ideas, fails in some sections, but the semi expert takes the idea and refines it properly. Kevin Barreto (AcerFur) did that in Google's Aletheia paper, with Erdos 1051. Basically trying to see where the AI capabilities are at right now, because even if it's not fully autonomous one shot, knowing that it's good enough to be a collaborator is a good data point in evaluating its capabilities Edit2: I think it's good that they're publishing the fact that they've attempted it before the deadline, but I do wish that there was more organization involved in all this. I like to remind people of what Terence Tao said last year with the IMO results: the fact is that unlike proper competitions where the competitors are known in advance, only labs that do well will announce their results, creating a survivorship bias. If xAI or DeepSeek or whatever participated in this challenge, but never posted their results, we wouldn't even know that they participated. They could've participated and failed and that's why there's no response. So do be wary of this. I'd be surprised if Google didn't try Aletheia or whatever on this for example. But also note, because they *did* post their results, I think OpenAI is rather confident in their results here in comparison to other labs. Because this is an experimental internal model at the absolute forefront. If another lab embarrasses them here for instance, they're kind of fucked no? Cause they probably don't have much better than this model. Edit3: Prediction from 1 mathematician (weak sample size I know) of how many he expects to be solved from a few days ago https://x.com/i/status/2020356298680987746, so I think 6 is definitely above expectations Edit4: Oh man *so many* OpenAI researchers are tweeting about this in the last hour. They must be really confident. Imagine if some of the solutions were wrong or Google secretly mogs them (like they did to Google at the ICPC)",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "AI doubters must be in shambles at this point",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's already here.",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol",
                "author": "clarkymlarky"
            },
            {
                "raw_content": "unironically i wonder if we are just gonna create god and it actually influencing the present to make its creation easier",
                "author": "Winter_Ad6784"
            },
            {
                "raw_content": "Honestly I hope it discovers time travel so I can keep my foreskin",
                "author": "Sea_Relative_5719"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Hollywood is cooked",
        "score": 1476,
        "text_content": "New video from Seedance 2.0 shows precision in character movements and near consistency. Next year or end of year, we will have 15min to 30min of movies generated. I repeat, Hollywood is cooked.",
        "comments": [
            {
                "raw_content": "Hollywood gonna be fine. They gonna be churning out sequels and prequels of their money makers.",
                "author": "african_cheetah"
            },
            {
                "raw_content": "Jet Li's expression never changes the whole time.",
                "author": "Super_Translator480"
            },
            {
                "raw_content": "I think this is a good example of how the most likely outcome really is a 90/10 mix with the 10% human being quite important. This is pretty damn good but also definitely NOT movie quality: \\- very stuttery movements at times \\- facial expressions are flat for most of it \\- several cuts / moves have the actors doing a bit of teleporting \\- Most of the interactions with physical objects is still a bit 'off' \\- the choreographing itself is not particularly interesting Which, \"This is a B-tier kung-fu movie, created for probably $100\" is a HUGE improvement. But still a long ways from \"This will spit out the next Ip Man\"",
                "author": "the8bit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI all hands (after losing 25 senior staff last week, 46 minutes)",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "losing 25 senior staff in a week is insane lol. at some point you gotta wonder if the all hands is for the people still there or for the investors watching. 46 minutes feels short for a company thats basically on fire rn",
                "author": "Pitiful-Impression70"
            },
            {
                "raw_content": "Losing that much staff is a cause for celebration. The last thing we want is for xAI to be the first to develop ASI and have Elon as God-King of the universe for all eternity.",
                "author": "Mindrust"
            },
            {
                "raw_content": "Summary: recap of achievements followed by introduction of the new group leads after massive resignations at the top. And, Elon says a bunch of shit like we'll be using 1% of the Sun's output with datacenters in space and a mass driver on the moon, and then interstellar colonization at the end. Some interesting footage from inside the Memphis datacenter as it's being built out internally.",
                "author": "Competitive_Travel16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT 4o is being retired today, and some users are very unhappy about it. A petition with around 20,000 signatures is urging OpenAI not to remove it. The same group is also calling for a mass cancellation of subscriptions in protest.",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dystopian lol",
                "author": "Hogo-Nano"
            },
            {
                "raw_content": "This is proof that they need to do something before humanoid robots are out there. If they're this upset about a text-based LLM... I don't even want to think how paranoid they'll be about a robot that looks human.",
                "author": "sammoga123"
            },
            {
                "raw_content": "They are mentally unwell and need help.",
                "author": "suuraitah"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Pentagon Used Anthropic’s Claude in Maduro Venezuela Raid",
        "score": 75,
        "text_content": "”We cannot comment on whether Claude, or any other AI model, was used for any specific operation, classified or otherwise,” said an Anthropic spokesman. “Any use of Claude—whether in the private sector or across government—is required to comply with our Usage Policies, which govern how Claude can be deployed. We work closely with our partners to ensure compliance.” I wonder if their usage policies allow killing people if you're the government?",
        "comments": [
            {
                "raw_content": "This just gave me an idea, I'm gonna try to tie Claude into Counter Strike 2 and see if he can give me real time advice and strategy lol Edit: there text to speech while I play, and F9 to take a screenshot and give further analysis, \\*freedoms internally\\* https://preview.redd.it/hozserenddjg1.png?width=2731&format=png&auto=webp&s=0c9be6d522c485f46b70cb25ed6297f2a9728a05",
                "author": "mobcat_40"
            },
            {
                "raw_content": "Some staffer during one of those long meetings: \"Which pizza should I order in DC?\" wsj: \"Pentagon Used Anthropic’s Claude in Maduro Venezuela Raid\"",
                "author": "BagholderForLyfe"
            },
            {
                "raw_content": "Claude: “Why don’t you just go in and abduct the guy? It’ll honestly be a lot easier and less messy than this plan of yours to nuke Greenland and Caracas.”",
                "author": "FriendlyJewThrowaway"
            }
        ],
        "subreddit": "singularity"
    }
]