[
    {
        "post_name": "Rep. Anna Paulina Luna: Arrests need to be made.",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I/we have been faked out many times..but I am seriously starting to like the cut of her jib",
                "author": "Farmcatarmy"
            },
            {
                "raw_content": "OK, well, now that that's settled, let's actually do it. What these people did was far more damaging to our country than killing someone. Imagine if they had killed someone instead, and we had legislators and talking heads on TV 12 hours a day \"There need to be arrests made!\". MFer don't tell me, I already know! Go crawl up Blondie Bondi's ass and start setting off firecrackers till she does something useful.",
                "author": "DestroyerofCobwebs"
            },
            {
                "raw_content": "Arrests would have been made BEFORE Tulsi released that stuff. We are only going to get angry, fist-rattling remarks. I will gladly eat some crow if even one arrest happens.",
                "author": "Tabascocat12"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sheeeeeeeee-it",
        "score": 522,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NOW, we'll be officially from the hood.",
                "author": "magaboom"
            },
            {
                "raw_content": "I know I'm going to get hate for this, but I cannot wait anymore for the arrests to start. Every god damn thing is another fortnite! Can we fucking arrest these people?!?!",
                "author": "WarCry"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MIGA/ Make Indians Great Again! Trump Suggests He May Force NFL Franchise Washington \"Commanders\" To Change Name Back To \"Redskins\" and Wants Cleveland \"Guardians\" to Change Back to \"Indians\"",
        "score": 535,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are not the Indians I care about. Cancel all H1Bs",
                "author": "altYPNeT"
            },
            {
                "raw_content": "There's no recourse for Cleveland, but it may be possible to have Washington revert to the Redskins name and logo as part of the stadium deal, as Trump suggests here.",
                "author": "mattytr"
            },
            {
                "raw_content": "The important issues of our time",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The disgraceful child has not spoken to his parents since 2017 cuz of Trump.",
        "score": 428,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope the parents changed their will.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "I'll take 'Things that never happened' for $200, Alex.",
                "author": "Internet_hugs"
            },
            {
                "raw_content": "...and everybody clapped. Do you really not recognize fanfic when you see it?",
                "author": "2016TrumpMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Robert Kennedy Jr. Fires Two Top HHS Officials After They Approved Moderna COVID Vaccine While He Was on Vacation",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RFK is kicking ass. Fuck moderna and their shitty LNP poison shots",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "RFK has proven he's one of Trumps finest appointments...just getting the job done.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "I love this guy. He is my Rocky Balboa. Getting stronger!!! Time to kick butt Rambo!",
                "author": "grannylovestrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It feels amazing. Keep it going!!",
        "score": 1396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Feels good, man.",
                "author": "LibertyFox"
            },
            {
                "raw_content": "🚂THIS! TRAIN! HAS! NO! BREAKS!!!!🚂",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Imagine how good it would feel if we got the folks that killed Seth Rich. Imagine how good it would feel if we got the folks that paid the Las Vegas shooter. Imagine how good it would feel if the servers raided in Europe actually led to convictions.",
                "author": "bonedancr"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hot off the press! Shifty Shiff is in BIG TROUBLE!",
        "score": 1171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing will happen to a sitting member of congress. They will claim political persecution and the media will support it.",
                "author": "bonedancr"
            },
            {
                "raw_content": "Still nothing happens to these people just a show",
                "author": "STONKATRUCK"
            },
            {
                "raw_content": "Then do something! \"We the People\" are sick of this shit.",
                "author": "HurtzLocker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 Trump is absolutely cooking right now 🔥",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wake me up when anyone faces real accountability. I'm really hoping to meme into reality, but we'll see..",
                "author": "halfstep"
            },
            {
                "raw_content": "Missing Hillary in the middle!",
                "author": "thebeercules"
            },
            {
                "raw_content": "This is just junk food for his base to get riled up and distracted from Epstein. Nothing is happening to this group. It's all talk.",
                "author": "PhoneBandit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan’s ‘Trump Inspired’ Rightwing Surge Leads to Crushing Defeat of Liberal PM Ishiba, Who Refuses to Resign in the Midst of Trade Negotiations With the US",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Japan's left killed Abe and it backfired on them, it seems!",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "MJGA",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Get fucked, bastards. And he will use any excuse to hang onto power, not just \"trade talks\". He's been given a mandate by the people to resign and he refuses. Authoritarian left can never admit they are tyrants when their every action says so. Lie, lie, lie.",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Until this happens...nothing will change",
        "score": 1048,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel a VERY stern letter coming",
                "author": "awsure"
            },
            {
                "raw_content": "Hey PAM , DAN, & KASH,.. let’s make this a reality like NOW.",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "If only he was president maybe.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Antifa gunman Benjamin Song's bail is set at $15 million — the highest ever in U.S. history for a captured Antifa violent suspect. He's accused of being one of the ringleaders in the shooting ambush on ICE where an officer was shot in the neck.",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Long Haired Chicom",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "Why is he even offered bail?????????????",
                "author": "AwShitHereWeGoAgain"
            },
            {
                "raw_content": "Hang him from a lightpost with a sign that says \"Terrorist\", along with every other puke, and this stops tomorrow.",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "6 Months of winning! Boss says let’s MAGA.",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Except when he attacked half of his voters and never apologized.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "Didn't take long for the Epstein story to start going away.",
                "author": "Ralphusthegreatus"
            },
            {
                "raw_content": "Congratulations, Israel",
                "author": "shogun5000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In an exclusive interview with CBS News, the head of U.S. Immigration and Customs Enforcement said his agents will arrest anyone they find in the country illegally, even if they lack a criminal record, while also cracking down on companies hiring unauthorized workers — CBS",
        "score": 1693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They all have a criminal record. Being illegal IS a criminal record",
                "author": "DingleBalls"
            },
            {
                "raw_content": "I just reported my local Walmart. I asked a random lady for an item and I got back \"I don't speak English, sorry\" in Spanish (I took it in high school and knew what she said). How can they hire someone who just admitted they can't speak a lick of English? Fuck em",
                "author": "DrWeeGee"
            },
            {
                "raw_content": "Going after companies and employers that exploit illegals as a labor force is something everyone should be able get behind.",
                "author": "20MagnusKonrad20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEVELOPING: I'm told there are texts/emails indicating Hillary Clinton campaign aides directly coordinated with the Obama White House, NSC, State Dept and Intelligence Community officials in efforts to dig up dirt tying Donald Trump to Vladimir Putin in July 2016",
        "score": 1306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thought Hillary \"wiped\" all of those like with a cloth.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "We knew all this 10 years ago wtf",
                "author": "IslandMan69"
            },
            {
                "raw_content": "Trust me bro",
                "author": "BidenSniffsLittleKid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "1) It's going to be Tulsi Gabbard vs Tom Cotton! [Patriots vs Sea Island] Remember this. SSCI Chairman Cotton is assembling his weapons right now, he has no choice - Cotton accepted the role. Tom Cotton is the \"hand\" of the Intelligence Community.",
        "score": 696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Senator Cotton is a corrupt piece of shit who works for the DeepState, NOT the American people. Primary his sorry, corrupt ass out of office.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "the predator picture is so so cool so so good",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Cotton is going to be covering for/playing defense for Brennan, Clapper, Comey, Wray, Garland, Obama ?????????????????????",
                "author": "fthecoup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bernie Moreno on Trump’s Call to Change ‘Guardians’ Back to ‘Indians’: ‘Cleveland Wants This, Let’s Go!’",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Guardians\" and \"Commanders\" are as counterfeit as a $20 bill from George Floyd.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Nobody wanted it just like they didn't want Aunt Jemima taking off our syrup or the Indian lady taking off our fucking butter.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Redskins and Indians names were choses at the time to designate toughness and bravery in their respective teams as well as to honor given individuals --- but you already knew that.",
                "author": "ReturnOfSmarm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PORTLAND, OR- ANTIFA has been harassing, attacking and vandalizing the ICE facility and agents in Portland, OR, for over a month, and now Portland's city council is trying to revoke ICE’s permit.",
        "score": 470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ICE's permit? Federal law enforcement doesn't need a permit to operate anywhere on US soil.",
                "author": "Danofdestiny"
            },
            {
                "raw_content": "God am I tired of Communists.",
                "author": "Easzq8"
            },
            {
                "raw_content": "Please Mr. President. Designate Antifa as domestic terrorist.",
                "author": "MAGA_Fiend"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reporter: Which part the Epstein hoax is the hoax part? White House: The president is referring to the fact that Democrats have now seized on this as if they ever wanted transparency when it comes to Jeffrey Epstein",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's really not adding up for me. This thing sounds like the kind of talk babble and backtracking I get from nazi, megalomanical democrats.",
                "author": "doodaddy"
            },
            {
                "raw_content": "It's amazing how they choose the worst soundbite and optics every. Single. Time. Statistically, it's impossible to be this bad on an issue. And they still don't get it. It's baffling.",
                "author": "DrWeeGee"
            },
            {
                "raw_content": "Democrats couldn’t keep making hoaxes if you arrested them for their crimes…..",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grok is spreading propaganda.",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Citing, what a retard.",
                "author": "usernamechecksout"
            },
            {
                "raw_content": "The Mueller Report found no evidence of Russian collusion. Mueller stated that to Congress.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "It's a misnomer to call these machines AI, which stands for Artificial Intelligence. The proper term is Large Language Model, otherwise known as Glorified Search Engine",
                "author": "Crappydatum"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "✨ BYE BITCH ✨",
        "score": 791,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is it hooking up with Rosie now",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Epstein flight log.",
                "author": "LostElf"
            },
            {
                "raw_content": "What a DeGenerate.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel Announces It's Shutting Down Clear Linux",
        "score": 298,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It makes sense. It was a pain to use compared to any other distro, and many others like CachyOS have picked up all the optimizations that Intel made and applied to their distros as well",
                "author": "WJMazepas"
            },
            {
                "raw_content": "Intel is now consolidating it's activities in the wake of the layoffs Expect more of this",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "Unfortunately it seems that Intel is cutting a lot more of its projects. Clear Linux was not user friendly and perhaps if Intel had made it more user friendly, it might have picked up some adoption. I wonder if some of these may by counterproductive in the long run. Clear Linux has many of the optimizations that demonstrate what is possible with Intel CPUs. Some of it has migrated to other distros like Cachy OS, but it's always easier to control one's own distro. Another consideration is that some of these optimizations are not possible without dropping legacy hardware compatibility (that's part of the reason why Apple does so well, apart from the outstanding M SOCs, they don't hesitate to drop old hardware compatibility and have full control over their software). Perhaps this may be a opportunity as well for AMD to develop its own optimized distro.",
                "author": "RandomCollection"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "We benchmarked Cyberpunk 2077 on Mac M1 to M4 — the numbers don’t lie",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Playable for those that only own a MacBook but i got a m3 air, and the playability is in the no thanks. (Upgraded recently a base 8/256 m2 to m3 24/512) I love my air, but anything demanding gaming wise is just not worth it. I haven’t compared the settings to my rog ally, running steam os. But from memory it looks to be about similar results.",
                "author": "imKaku"
            },
            {
                "raw_content": "Intel looking jealously as lack of gaming performance gets defended",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "Interesting to see the results, for the mac gaming evangelists, the performance falls short of their synesthetic benchmarks for esp the M4 Max, as it matches 4060 laptop in terms of RT ultra performance at 1080p (maybe it is better off in without RT situations), but that was the only apples to apples (heh) comparison they did here. And it gets worse from there. As many people have argued that it is like a 4070 or 4080 even in some cases, but in real games (even when fully ported) it falls short of that lofty claim it seems. The GPU in macs are not magical, but it is nevertheless IMPRESSIVE as heck, given the M4 MAX tdp is 70w, while a 4060 just by itself eats up 115w just on its own, nvm the CPU bits. I can certainly see the whole argument for its own stack of everything from HW to the metal api being super tailored and having efficiency extracted from the thing top to bottom. It is almost console like in that regard. But, it does seem that CDPR was able to tune the game to the point where even M1s can have a smooth gaming experience, just obviously like any older hardware, got to turn things down to get good frame rates.",
                "author": "theholylancer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snot-filtering tech could be the answer to a dust-free PC — Korean scientists turn to nature to improve air filtration",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd really like to use my PC as an additional air purifier",
                "author": "Clean_Experience1394"
            },
            {
                "raw_content": "You think that filter would use some advanced tech but it's just snot.",
                "author": "PM_ME_UR_TOSTADAS"
            },
            {
                "raw_content": "This sounds exactly the same in principle as the oiled airfilters that K&N has been making for around 60 years.",
                "author": "shoneysbreakfast"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phoronix: \"NVIDIA Bringing CUDA To RISC-V\"",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be clear this is the CUDA driver and runtime libraries. You'll be able to use your Nvidia GPU with your RISC-V board.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "A proprietary vendor lock in is coming to an open architecture. meh",
                "author": "noiserr"
            },
            {
                "raw_content": "TL;DR NVIDIA will be releasing its proprietary GPU driver on RISC-V. Whereas Intel and AMDs GPUs use the open source mesa3d implementation and thus already work on RISC-V. Boring news, not much to see here.",
                "author": "3G6A5W338E"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Shunt Modded RTX 5090 Laptop: 250W vs 175W - Record Setting Benchmarks, Thermals, and",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The problem is that laptops are much more thermally constrained than desktops. A shunt mod can increase the performance, but without adequate cooling, the laptop will see its lifespan exponentially shortened.",
                "author": "RandomCollection"
            },
            {
                "raw_content": "I imagine that's going to vary drastically by laptop. Many laptops probably don't have a the thermal headroom for this, in which case I expect minimal gains at best and likely a lot of stuttering.",
                "author": "Asleeper135"
            },
            {
                "raw_content": "tldr; As expected the 5090M performs close to its undervolted 5080 desktop counterpart. even temps at 250w were manageable. I imagine AMD would release a 9080M (N48) that competes favorably with the 5090m if they push it to 200w+",
                "author": "fatso486"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "This 1980’s Hard Drive tried its Best…",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "r/NintendoSwitch2 Discord",
        "score": 0,
        "text_content": "Hello everyone we wanted to remind you all about our subreddit discord. Rules are slightly different so please check them before posting and remember to be kind! [https://discord.gg/8tCfhXHD](https://discord.gg/8tCfhXHD)",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Bananza be like",
        "score": 2040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/sgodt4hlp4ef1.jpeg?width=1015&format=pjpg&auto=webp&s=79d67bee4907ce89d1c2c6606462bedd9ff602f6",
                "author": "Alickseff"
            },
            {
                "raw_content": "But imagine if you went to the depths, and then you found another hole and jumped down it to find a 2nd Hyrule.",
                "author": "Williekins"
            },
            {
                "raw_content": "I can't believe TOTK invented falling from the sky that's bananas",
                "author": "forlackofabetterpost"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "DK Bananza is the first game that I’ve played that is this back loaded",
        "score": 1132,
        "text_content": "In the first few worlds I felt like “Okay so this is just an Odyssey spin off” and I was a little underwhelmed. Everything felt too abstract. I wasn’t digging the worlds fully. It didn’t feel yet DK. By the mid point I was sold and having an outrageous amount of fun but wasn’t ready to call it a masterpiece. But the last half of the game has the coolest worlds and mechanics and bosses. It just kept getting cooler and cooler and cooler. And that final act, oh my god. I’m ready to call it the best 3D platformer I’ve ever played. I have no idea what the logic was of backloading the game like they did. This is like the only game I’ve ever played in my life that’s so back loaded. It just gets exponentially better the deeper you go. In fact it’s funny a lot of the early criticism being tossed around is by people in the early levels. Criticisms about bosses and worlds and stuff. And it just makes me smile because they’re going to find out. I CANNOT wait for people to start finishing the game so real discussion can start in the coming week",
        "comments": [
            {
                "raw_content": "You gotta go deep man, it's the whole point of the game!",
                "author": "fanfarius"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "I played for an hour and I honestly felt a little underwhelmed compared to the hype, then I played for another hour and immediately got it. What a fun game",
                "author": "JPiLLa"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I've 100% Donkey Kong Bananza",
        "score": 506,
        "text_content": "This game has honestly been a **breath of fresh air** in the gaming scene. It brought back memories of *Super Mario Sunshine*, *Mario 64*, *Odyssey*, *Luigi’s Mansion*, and *Mario Galaxy*—and even gave me *Majora’s Mask* vibes with the transformations. But despite those familiar echoes, it still **carved its own path**, and has now earned a spot among my **all-time favorite Nintendo titles**. This could have easily been the **greatest launch title** Nintendo ever released, but you can tell it wasn’t rushed for a console debut. The people who made this clearly **poured their hearts into every detail**. I primarily played it docked and had **zero issues**—it was **honestly perfect**. I **rarely give games a 10/10**, but this might be a first. It **made me feel like a kid again**. I’ve spent **over 35 hours** with it and **loved every second**. If you're still on the fence about picking it up, **don’t let it pass you by**. https://preview.redd.it/fwnm1c5lz3ef1.png?width=1280&format=png&auto=webp&s=c62fe89f83e78bf5bd97afba3972c4a8cc0d3239",
        "comments": [
            {
                "raw_content": "How on earth have you already 100% the game",
                "author": "YAPPYawesome"
            },
            {
                "raw_content": "Bro..is this shit your job?? Game only been out for 3 days?!?",
                "author": "reddittothegrave"
            },
            {
                "raw_content": "35 hours and you 100%????",
                "author": "Confident-Plan-7279"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Have you warmed up to DK’s updated design",
        "score": 112,
        "text_content": "It was long overdue, but the change of his face did seem like a new character in some ways. But 15 hours into Bananza it seems hard to think of this game with the old Rare look.",
        "comments": [
            {
                "raw_content": "I always thought the permanent frown looked a bit odd so I instantly liked the new design. It fits more varied expressions, which works better for a main character. They also did a great job with the animations.",
                "author": "Ebantero"
            },
            {
                "raw_content": "never had a problem with the redesign and never missed the old one. some people just overreact over anything. the new one just works and fits very well.",
                "author": "Dry_Love_4797"
            },
            {
                "raw_content": "I think his redesign really grew on me after playing Bananza, because before that I thought he looked a little unusual in Mario Kart World (but to be fair he looks odd in MK8 as well) but in this game the redesign makes a lot more sense in my opinion.",
                "author": "Momo2318"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Look at this cracked line-up of games. 🥵",
        "score": 176,
        "text_content": "I played NMS for the first time today. DK:Bananza really is so good, that I’m actively trying to not just burn through it.",
        "comments": [
            {
                "raw_content": "Shame you can’t buy portal 2 rn. Been wanting to play that game with the fiancée on switch 2.",
                "author": "BytesSWE"
            },
            {
                "raw_content": "Shadow Labyrinth just came out Friday too and so far I’m enjoying it! It’s a metroidvania style game that’s actually pretty difficult. Looks great on switch 2, definitely suggest it!!",
                "author": "kinggcroww"
            },
            {
                "raw_content": "Lol same. I’m moving between NMS, DK and some Raidou to make DK last me longer. Your line-up is 10/10. I completely forgot Portal 2 was on Switch!",
                "author": "Diligent-Coat8096"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This duo is one of the best aspect of the game",
        "score": 741,
        "text_content": "Their chemistry is pretty nice and one of the strenghts of the game. Pauline is not a huge backseat, like we could feared at the first place. I like their interactions at every new bedroom you unlocked !",
        "comments": [
            {
                "raw_content": "Ooooh-WOAH-OHH-oh",
                "author": "CelticSith"
            },
            {
                "raw_content": "Agreed, honestly really like Pauline as a charcter, she actually feels like she has some charcter devolopment",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "I sometimes have to ignore how good some of the effects are because I just want to try all their different outfits. lol",
                "author": "NIN10DOXD"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I love how the game lets you do this",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't bully the Fractones! They're so precious. 🥹",
                "author": "Fenicillin"
            },
            {
                "raw_content": "It records how much of them you break too and technically pays out little depending on how much you do.",
                "author": "4umlurker"
            },
            {
                "raw_content": "Well the shop owner that ask you to pay 10 for his service and if you aren't careful enough you just press A A A.and you pay him. I smashed him really good for that. What is cool too is that you can pickup dirt smash it in his face and it becomes the same stone as himself. That way he can't see anymore.",
                "author": "advator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Blowing off steam",
        "score": 248,
        "text_content": "I’ve been playing Donkey Kong Bananza since day one, and I’ve only made it to the 2nd sub layer, strictly because I’m obsessed with smashing shit. Because im going through some stuff emotionally this past week, I’m finding it extremely therapeutic to just grab a boulder and start smashing. Anyone else feel the same way? :)",
        "comments": [
            {
                "raw_content": "I wish I could play all day but I'm not feeling well today.",
                "author": "linkling1039"
            },
            {
                "raw_content": "It's the perfect game to unwind. Good for days when I'm overthinking... When I'm feeling good, it's a great addition to my automation games. After all that calculating, it's nice to swing a boulder and snack on some bananas.",
                "author": "Klopapierspender"
            },
            {
                "raw_content": "Anybody else get kind of dizzy playing this game? I love it but I feel like the camera makes me a little ill.",
                "author": "JediTrainer42"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A linkedin page of a 3D Character Modeler mentions work on a sequel to a Nintendo SRPG coming exclusively for the Switch 2",
        "score": 114,
        "text_content": "[Source](https://youtu.be/gAPgmb2p7L8) Seems it is very likely going to be a new Fire Emblem title. EDIT: Original source of this page is found: [https://www.linkedin.com/in/taksehi-maruyama-17864747/](https://www.linkedin.com/in/taksehi-maruyama-17864747/)",
        "comments": [
            {
                "raw_content": "It can't be Fire Emblem, because that would be Intelligent Systems in Kyoto This job cites Nintendo in Tokyo",
                "author": "KMoosetoe"
            },
            {
                "raw_content": "Nintendo's marketing team must be on vacation, so we're getting unofficial announcements instead.",
                "author": "Straight-Ad6926"
            },
            {
                "raw_content": "It's me or he is nearly breaching his NDA lol. Like are you that dumb to write on a social media that you have worked on a game (especially a Nintendo one) that is not even reveal yet, especially on the Switch 2. It's weird.",
                "author": "Tryst_boysx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Concept art for cancelled sequel to Evolve",
        "score": 345,
        "text_content": ">\"Evolve 2 began development shortly after the launch of the first game. However, after spending a few months in pre-production, the project was canceled when Turtle Rock shifted focus to other ideas and pitches\" [source](https://mp1st.com/news/report-evolve-2-was-once-in-development-concept-art-reveals-scrapped-sequel)",
        "comments": [
            {
                "raw_content": "I was sooo hyped for Evolve, I used to watch the E3 demo again and again before it launched because I loved the concept of playing as huge monsters. It’s a shame that they abandoned it and the potential sequel.",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "It's a shame the game failed, as the whole idea and gameplay of it were pretty great. I missed the chance to play some more of it when it briefly returned for a few weeks. I do remember the monetization being bad, though.",
                "author": "TheVoidDragon"
            },
            {
                "raw_content": "I have no idea as to how Turtle Rock studios is still open. Their so called \"spiritual sequel\" to Left4Dead was okay-ish at best and fizzled like a fart in the wind.",
                "author": "Durin1987_12_30"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Pokémon Presents scheduled for Tuesday will have a runtime of 24 minutes.",
        "score": 466,
        "text_content": "[https://youtu.be/XBG9hLTJUHI](https://youtu.be/XBG9hLTJUHI) Source is Korean Pokémon YouTube channel >The Pokémon Presents scheduled for Tuesday will have a runtime of 24 minutes. This was confirmed after the official Korean Pokémon YouTube channel unexpectedly uploaded the video placeholder ahead of time. [https://xcancel.com/Light\\_88\\_/status/1946903182447198670?t=4F5h3d1HrQnkcNaUvg27aA&s=19](https://xcancel.com/Light_88_/status/1946903182447198670?t=4F5h3d1HrQnkcNaUvg27aA&s=19)",
        "comments": [
            {
                "raw_content": "Keep in mind most of the stuff won't even be video games on the switch. There'll be stuff like pokémon Pocket and merchandise.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "Clown makeup on for anything involving getting some of the classics playable on Switch.",
                "author": "Feoraxic"
            },
            {
                "raw_content": "Unironically, I wonder if a gen 10 announcement is possible? If it releases next year, that'd be 4 years after S/V after all, which would be **longer** than the 3 years it took for S/V to release after SwSh. And it's already been 4 years since BDSP released, and it's not like ILCA is occupied by the main series like Gamefreak is with gen 10 and ZA, so I feel like them announcing something is possible. I get that it's frowned upon how constant the franchise's output is, but it is still kinda exciting to think we could get something new announced too. That's more fun than 24 minutes of merch, mobile games, and 1 minute of some new Pokemon being added in ZA anyways, which I feel is the sad alternative.",
                "author": "Spinjitsuninja"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Jurassic Park: Survival Steam database has been updated, so could this be why a new trailer is coming?",
        "score": 166,
        "text_content": "This week the Steam database for Jurassic Park: Survival trailers appears to have been updated recently, as this would not be the only movement in the database. [https://steamdb.info/app/2208810/history/](https://steamdb.info/app/2208810/history/) [https://pbs.twimg.com/media/GwEWbKZXYAA73bI?format=jpg&name=small](https://pbs.twimg.com/media/GwEWbKZXYAA73bI?format=jpg&name=small) Just 2 months ago, on May 6th, the database was also updated, where Added Content Descriptors (Including DLC) could be seen, so there will be some kind of downloadable content DLC, I think it could be some kind of skins from the 1993 Jurassic Park movie of the characters Dr. Alan Grant and Dr. Ellie Sattler, since it could be some kind of bonus for pre-ordering the game. [https://pbs.twimg.com/media/GwO-4XiWEAMXlh-?format=jpg&name=medium](https://pbs.twimg.com/media/GwO-4XiWEAMXlh-?format=jpg&name=medium) Saber Interactive will be revealing something next week, but I doubt it will be related to JP Survival, as content creators have seen that announcement and it is rumored to be a Hellraiser game. [https://xcancel.com/SaberGames/status/1945830949331075476#m](https://xcancel.com/SaberGames/status/1945830949331075476#m) [https://xcancel.com/SaberGames/status/1946210160407695677#m](https://xcancel.com/SaberGames/status/1946210160407695677#m) If anything is to be revealed soon about Jurassic Park: Survival, it should be at Gamescom during Geoff Keighley's Opening Night Live, or in December at The Game Awards, since Universal producer John Melchior commented on his LinkedIn that there will be news about Jurassic Park Survival this year. [https://www.linkedin.com/feed/update/urn:li:activity:7308502704895508482/](https://www.linkedin.com/feed/update/urn:li:activity:7308502704895508482/)",
        "comments": [
            {
                "raw_content": "Surprised this one wasn't pushed to coincide with the movie.",
                "author": "Deadly_Toast"
            },
            {
                "raw_content": "I keep forgetting this game is even being worked on. I’m still waiting for another trailer for Turok Origins.",
                "author": "Xplatos"
            },
            {
                "raw_content": "> This week the Steam database for Jurassic Park: Survival trailers appears to have been updated recently Check other SteamDB pages before posting stuff like this, Steam just updated every game so instead of the microtrailers being called \"microtrailer\" with a short path they have a randomly generated longer path.",
                "author": "I-wanna-fuck-SCP1471"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "After 10 years of loyal service, my 980 Ti has finally retired. Built my dream PC and joined Team AMD — a new era begins!",
        "score": 133,
        "text_content": "Photo 2 is my old companion (excuse the cable management of the 15 year old me)",
        "comments": [
            {
                "raw_content": "Clean!🤩",
                "author": "2020_was_a_nightmare"
            },
            {
                "raw_content": "Super nice looking build mate. Which card did you get?",
                "author": "ConsistencyWelder"
            },
            {
                "raw_content": "Looks like xfx 9070xt Mercury plugged in MSI 950 edge. Rocking rig !",
                "author": "AndAlsoTheTrees"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Why North-East and Midwest resilient over rest of country?( Fl, TX, NC, CA ..)",
        "score": 111,
        "text_content": "Ref: https://x.com/dkthomp/status/1946983726828691784?s=46&t=ttHHuNF6YKa1a2bFBs4LOQ",
        "comments": [
            {
                "raw_content": "Home prices in the northeast really don't go down. There are rarely more than a handful of homes for sale in my entire county. Midwest is having a moment because of affordable lifestyle, good paying jobs, and low risk of climate disasters.",
                "author": "panna__cotta"
            },
            {
                "raw_content": "They didn’t build in the northeast. No room to build in NJ :( I graduated college in 2020 and I’m priced out. If only I bought in high school",
                "author": "LegalDragonfruit1506"
            },
            {
                "raw_content": "There is plenty of drinkable water and people can largely read.",
                "author": "DIYThrowaway01"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Even the Northeast is starting to feel the pinch. A buyer's market moves slow but it'll come for everyone eventually.",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Housing demand goes up -> Prices go up -> New supply does not come -> Prices stay high -> People can't afford-> People move to lower COL areas-> Demand drops -> Prices drop. It doesn't happen overnight, but it surely does. Housing market moves slow, but the self-correcting mechanism can still work.",
                "author": "Wonderful_Brain2044"
            },
            {
                "raw_content": "South Jersey is Alabama man",
                "author": "FourScoreAndSept"
            },
            {
                "raw_content": "So he had an offer for 30k under but declined and now dropped 15k? Shoulda just accepted the offer.",
                "author": "throwaway43234235234"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Moody’s Zandi Sounds Alarm: Housing Price Declines and Construction Slowdown Ahead",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh no! What will we do if houses are affordable for regular people again?",
                "author": "SimonMage"
            },
            {
                "raw_content": "Ah, unfortunately, the government will start printing money to “stabilize” house prices.",
                "author": "Intelligent-Fig-8989"
            },
            {
                "raw_content": "“Zandi told ResiClub he expects national house prices to decline by a mid-single-digit percentage from peak to trough over the next 18 to 24 months, assuming mortgage rates remain around 7%.” Oh my, what a disaster.",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "UPDATE: Moving from TX to NYC, sell at a loss or rent at a loss?",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They did it smart",
                "author": "DragAccomplished1731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The 19 Bigger Cities with the Biggest Price Declines of Condos (-12% to -24% from Peak through June)",
        "score": 32,
        "text_content": "https://wolfstreet.com/2025/07/19/the-19-bigger-cities-with-the-biggest-price-declines-of-condos-12-to-24-from-peak-through-june/ The 19 Bigger Cities with the Biggest Price Declines of Condos (-12% to -24% from Peak through June) | Wolf Street Oakland, Austin, San Francisco, Denver, Tampa, Seattle, Saint Petersburg, Fort Myers, Sarasota, Boise, Jacksonville, Detroit, New Orleans, Portland, Arlington, Naples, Mesa, Aurora, Reno. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "There is an incredible bubble of these things bursting in the Oxnard/Ventura/Thousand Oaks market. Cuts of 10, 20, even 30% not enough to get someone to sign contract. The condo story is national, not Florida, and it's going to hit a lot of people so hard. I haven't heard anything about *virtually every* condo buyer of the last 3 years already being badly underwater, but you have to prove you're not at this point.",
                "author": "Jumpy-Ad8831"
            },
            {
                "raw_content": "Lot of new RE investors piled on to condos after watching a few vids In social media and in past 6 years or so it accelerated rapidly during Covid due to many factors. These investors were coached by RE gurus who themselves never been thru 08 housing crash and told these investors home prices and rents will only go up. As a result these investors over (who are mostly high income earners) leveraged into investment properties and there is plenty of them with 10,20+ properties all acquired in a span of few years. End result was condos in less desirable areas which originally build for low income earners got bought up by investors causing prices which stable for decades to 2x,3x in a span for few years. As this bubble deflates as HoA fees, insurance cost eat into their precious passive income you are seeing surge of investors trying to cash out while they can. Unf local condo owners who managed to get a condo are now stuck with falling home value and vacant homes that are on sale..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Condos are hurt by their HOA fees. I’m likely getting 10% off listing in a good area. Building has good reserves. Meanwhile, the no demand areas have condos sitting around for a couple months especially if the HOAs are above 500.",
                "author": "HsRada18"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Elon Musk announces ‘Baby Grok’, designed specifically for children",
        "score": 2590,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What fresh hell is this",
                "author": "fronchfrays"
            },
            {
                "raw_content": "“Hi im baby mecha hitler!” Edit: didn’t this guy just talk about ai existential dread? Didn’t his ai just recently call for a new genocide? How high is Elon right now??",
                "author": "Solid_Anxiety8176"
            },
            {
                "raw_content": "\"Hi Jason! Nice to meet you, new friend! BY THE WAY. Do you know about the JEWS?\" Yeah that's going to be a problem. Especially in a country with a collapsing education system.",
                "author": "Stamperdoodle1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Over 1 million GPUs will be brought online - Sama",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every year more GPUs until the entire planet is covered in them",
                "author": "uniquelyavailable"
            },
            {
                "raw_content": "Is it too late to buy NVDA…",
                "author": "ethotopia"
            },
            {
                "raw_content": "![gif](giphy|9M5jK4GXmD5o1irGrF)",
                "author": "Promethia"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta can’t even poach some OpenAI researchers with $300M/4yr offers, per WSJ",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "there are propably >10 people at openai with shares worth >300M",
                "author": "Slight_Antelope3099"
            },
            {
                "raw_content": "article, [The Epic Battle for AI Talent - WSJ](https://www.wsj.com/tech/ai/meta-ai-recruiting-mark-zuckerberg-sam-altman-140d5861). the same article also mentions that Daniel Gross pushed for Ilya to hand over S.S.I. to Meta. https://preview.redd.it/6vwymsos43ef1.png?width=1008&format=png&auto=webp&s=e84642ac9922008034d7c473dad949ccf5135a99",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "there’s the answer to the “if you know agi is near, then why would you leave” question I guess",
                "author": "IlustriousCoffee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI researcher Noam Brown clears it up",
        "score": 438,
        "text_content": "https://x.com/polynoamial/status/1947024171860476264?s=46",
        "comments": [
            {
                "raw_content": "This is so much nonsense and is pure drama",
                "author": "Sir-Spork"
            },
            {
                "raw_content": "The «kids» got more spotlight than ever before because of this",
                "author": "KIFF_82"
            },
            {
                "raw_content": "I guess that's why DeepMind waited.",
                "author": "Elephant789"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Optimus spotted serving popcorn at new Tesla Diner Charger Station",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sped the video up so it didn't look painfully slow.",
                "author": "Jwave1992"
            },
            {
                "raw_content": "Didn’t Disney used to have an animatronic that served candy in the 90’s",
                "author": "theavatare"
            },
            {
                "raw_content": "Teleoperated chicanery, though teleoperated robots are still pretty cool",
                "author": "Baphaddon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Anglosphere is the most negative on AI, while Asia and Latin America are the most positive",
        "score": 200,
        "text_content": "There seems to be a correlation between open source and closed models.",
        "comments": [
            {
                "raw_content": "A: very nervous B: super excited Japan:",
                "author": "505found"
            },
            {
                "raw_content": "Wow, cannot be a bigger difference between the two big players in this race. US the least excited and most nervous, China the most excited and least nervous. What does this say about America?",
                "author": "Singularity-42"
            },
            {
                "raw_content": "Wow. No wonder being an AI fan in the US results in so much hate. And then Japan's just sitting there like \"Eh, it's cool I guess, whatever\"",
                "author": "KangarooCuddler"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mark Zucker asked Mark Chen if he would consider joining Meta, reportedly offering up to $1 billion dollars",
        "score": 44,
        "text_content": "https://www.wsj.com/tech/ai/meta-ai-recruiting-mark-zuckerberg-sam-altman-140d5861",
        "comments": [
            {
                "raw_content": "Seems desperate",
                "author": "rasplight"
            },
            {
                "raw_content": "It will be hilarious if even after all this poaching they fail to do anything significant 😭",
                "author": "Pro_RazE"
            },
            {
                "raw_content": "Zuck is worth $243b, most in Meta stock. Company has a market cap of $1.8t. If Zuck has a chance to tip the scales in the next trillion+ industry, it's not so outlandish. Is it really that crazy to give hundreds of millions in RSUs (either vesting over the course of a few years or tied to performance metrics) for talent that could swing a wide open AI race?",
                "author": "Gloomy_Appearance405"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI sold people dreams apparently",
        "score": 324,
        "text_content": "They didn’t collaborate with IMO btw No transparency whatsoever just vague posting bullshit.. and stealing the shine from the people who worked hard asf at it which is the worst of it.. (This tweet is from one of the leaders in deepmind)",
        "comments": [
            {
                "raw_content": "\"the general coordinator view is that such announcements should wait at least a week after the closing ceremony\" - Joseph Myers \"he requested we wait until after the closing ceremony ends\". - Noam did they just get different answers? a miscommunication? 🤷 https://preview.redd.it/pjy3qbnu63ef1.png?width=1334&format=png&auto=webp&s=5d3da6d3a3fc7003cc17d72be20f26691d3bb313",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Is this one those petty shit that is going to be blown way out of proportion again? It's okay to think that something is a bit yikes without thinking that it is the worst thing that has ever happened. You don't need to be enraged by everything.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "The timing of the announcement was bad, that doesn't mean they cheated. I'm pretty sure someone from the IMO would've come out and said something if OpenAI just straight up made false claims.",
                "author": "Cronos988"
            }
        ],
        "subreddit": "singularity"
    }
]