[
    {
        "post_name": "Signs of Minnesota Somali fraud all over Seattle.",
        "score": 904,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We used to put criminals in jail, but I guess we don't do that anymore.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Until someone hangs in a public square none of this will ever stop",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "The real question is how much evidence is needed before Trump fucking does something about it?",
                "author": "explodejoystick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HALLELUJAH: President Trump just launched a new program to urging Americans to dedicate at least an hour per week to prayer.",
        "score": 745,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only God can save this country. Pray, repent, and turn to Jesus.",
                "author": "MiniEagle"
            },
            {
                "raw_content": "Nice. I would advocate donating an hour a week to civil service in their local communities.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "Link https://x.com/BoLoudon/status/2004959641692930314?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A judge overruled Homeland Security. What timeline are we on?",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, this is unconstitutional and should be ignored. Trump needs someone to teach him the Constitution.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "No Standing, carry on.",
                "author": "MeMargie"
            },
            {
                "raw_content": "Arrest the judge for sedition.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: Imagine seeing the colossal Somali welfare fraud in Minnesota and not realizing that Democrats have been committing election fraud on an equally staggering scale.",
        "score": 998,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine seeing all of this and doing nothing about it besides tweeting and going on Fox News!",
                "author": "Beaverstatemilitia"
            },
            {
                "raw_content": "Imagine seeing the welfare fraud in Minnesota, and thinking it's only happening in Minnesota.",
                "author": "fskfsk"
            },
            {
                "raw_content": "And then imagine nobody going to jail.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD Vance: This dude (Nick Shirley) has done far more useful journalism than any of the winners of the 2024 @pulitzercenter prizes.",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, JD. Will we see politicians in prison and mass deportations?",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "Citizen journalism. 🇺🇸 🫡",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "So do something.",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota's \"local news\" has been caught in a FAKE NEWS operation and is being called on to issue a RETRACTION after they said President Trump made up \"billions\" in fraud",
        "score": 1001,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You just can’t hate the mainstream media enough. I guess the Minnesota Star Tribune think Minnesotans are really stupid.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "Nuke MiniSomalia. Yesterday. That state has been an embarrassment for my whole life... Humphrey to Ventura fucking retarded joke.",
                "author": "LookFatty"
            },
            {
                "raw_content": "I swear it's like these liberal cities/states are in a competition for most retarded and corrupt in the country. Just when you think one is in the lead, a different one makes a run for it. Is it LA/California? Portland? NYC? Colorado? Oh wait Minneapolis, MN is making a push for it. Everywhere you look, it's some shithole of corruption and crime that keeps getting worse, you can't even keep track of which is worse anymore.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "the world’s most dangerous ideology is:",
        "score": 860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam is Islam, 'Radical' is unnecessary.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Z I 🟩 N 🟩 S M EDIT: it’s afraid.",
                "author": "Made_in_America"
            },
            {
                "raw_content": "Misspelled Socialism",
                "author": "Wizard_Kor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk : Mass immigration of people that want to kill White people IS White genocide!",
        "score": 1306,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We still have H1B. Foreign students. Cut of all immigration and focus on deportations.",
                "author": "EstadosUnidosPrimero"
            },
            {
                "raw_content": "Jews behind mass immigration https://youtu.be/VTjNlBbu7ic?si=t-rFuV0_bPlj2ANf",
                "author": "Stinky1000"
            },
            {
                "raw_content": "Elon Musk said to go fuck my own face for not wanting my country flooded with infinity H1B pajeets.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Triangle head Somalian will now lead the UN Defense Council January 1st. WHY ARE WE IN THE UN???!",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only reason they did this is because Trump called them garbage people and their country a shit hole. Which means this is just another leftist political operation. We need out of the UN yesterday.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "They are lightbulb heads.",
                "author": "MondayCoupleIsDead"
            },
            {
                "raw_content": "Globalists are simply doing this to tweak Trump. Let's see if he actually does anything about it or if he just goes on about praising Israel and telling us about big GDP numbers",
                "author": "Pats5x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sleazebag Rep. Eric Swalwell Wants Congress to Freeze DOJ Funding",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Before they prosecute him?",
                "author": "Wildcard235"
            },
            {
                "raw_content": "I'm sure China wants to freeze DOJ funding as well.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "What an odd thing to say.",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O'Keefe: \"My vision for 2026 is we need arrests, we need people to go to prison…next year our work will lead to arrests, and if it doesn’t, I’m going to investigate the prosecutors themselves.”",
        "score": 1571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "don't wait, investigate prosecutors now",
                "author": "perma-maga"
            },
            {
                "raw_content": "If the Trump administration even remotely wants success for the mid-terms, there needs to be multiple, high-visibility prosecutions of the corrupt government (elected/appointed/hired) officials and their lapdogs (related or not). Imprisonment, deportation and asset seizures need to also be part of the swamp draining.",
                "author": "Dems-R-Dumb"
            },
            {
                "raw_content": "I sure hope so. This admin cares more about foreign wars, foreign aid. We're last on the list.",
                "author": "EstadosUnidosPrimero"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali Retards Now.",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're being conquered by weak bodies and retarded minds.",
                "author": "RentFree2020"
            },
            {
                "raw_content": "You can call them retards all you want, but they managed to swindle 9+ billion.",
                "author": "raptormissle"
            },
            {
                "raw_content": "And we're letting it happen - who's the real retard here ....",
                "author": "JohnDoe81627"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Democrat governors of CA, IL, CO, ME and NY are now refusing to implement President Trump’s “no tax on tips,” with furious residents of NY blaming Kathy Hochul for deliberately using the livelihoods of service workers to stick it to President Trump.",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Incurable TDS has now gotten to the point that Democrats are now openly against Trump letting working class people keep their own money.",
                "author": "Oldman1234"
            },
            {
                "raw_content": "GOP trying to hand dems the midterms, now we got dems trying to give it back to the gop. What a bunch of faggots our government is.",
                "author": "Elencher"
            },
            {
                "raw_content": "Battered Libtard syndrome. They will keep going back for more abuse.",
                "author": "SuperMagat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There needs to be warnings or a skip function",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't think I would publicly admit to having a Netflix account after that whole Cuties thing, but I see tons of people doing it every day.",
                "author": "lostmyoldpassword"
            },
            {
                "raw_content": "If you are still paying money to Netflix, you are part of the problem. Stop subsidizing the pumping of this garbage into your home. Get a hobby. Go outside. Take tango lessons with your squeeze. Join a house church. Fix things in your house that need fixing. Take your dogs for a night walk/run. They're probably fat and over-vaxxed. Work out. Listen to classical music. Read an old, old book, printed before publishing became woke. Do ANYTHING except sit in front of a flat sceen zombification machine, which is literally recording everything you do and say in your house.",
                "author": "Melchizedek18"
            },
            {
                "raw_content": "I have never given a dime to Netflix. When my adult children ask me to watch a movie with them they already know it cannot be anything from Netflix.",
                "author": "Calumet57"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now is a great time to get out of the UN",
        "score": 1157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Failed state running another failed organization",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "The fact the US is still in it, funding the majority of it, and hosting it on US soil tells you everything you need to know.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "Kind of weird how as diversity grows so does crime...diversity is the strength of what?",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Y’all know this is actually Trump behind this parody account, right?",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With 𝐏𝐀𝐌, nothing sticks! Everything slides.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Never hire a woman for a job that requires balls",
                "author": "Robert_Finewell-TN"
            },
            {
                "raw_content": "Someone somewhere must be blackmailing Pam. Thats the only explanation as to why she hasn't been mass arresting democrats. TRUMP needs to hire a man who can get the job done",
                "author": "Robert_Finewell-TN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iran declares ‘total war’ against US, Israel and Europe as Islamic Republic seeks to expand nuclear capabilities",
        "score": 773,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not this shit again.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "I've seen this one before.",
                "author": "Armiakrajowa"
            },
            {
                "raw_content": "See? Nobody cares…",
                "author": "RiolindasReturn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "START ARRESTING POLL WORKERS THAT CHEATED IN ELECTIONS AND WATCH HOW FAST TELL YOU WHO TOLD THEN TO CHEAT",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "100% correct should have been done already . Face a couple of years in prison and the tongue will start ratting them all out.",
                "author": "aqua27"
            },
            {
                "raw_content": "Guarantee this shit is all being war gamed at NGOs where they have teams of people looking into the weak points of each state’s election processes. They then go out and coordinate with the poll workers, probably pay people off to do crooked shit. Same thing is happening with the all the protests and Antifa retardation. It’s all fake and gay. Take out the NGOs. Then take out the real snakes that are funding them to do their bidding. *cough* Soros *cough*",
                "author": "bh506407"
            },
            {
                "raw_content": "You so silly, ain’t nobody getting arrested.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why is YouTuber, Nick Shirley, getting more accomplished in exposing Minnesota’s fraud than DOJ, FBI & HHS combined?",
        "score": 565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This admin is dropping the ball on this.",
                "author": "EstadosUnidosPrimero"
            },
            {
                "raw_content": "Why is this random youtuber exposing shit like this - and also crickets from DC. https://www.youtube.com/watch?v=dBvGTirLJ4Q This is also a city in our country. Starting to feel like the USA had a going out of business sale, and no one fucking told us.",
                "author": "lostmyoldpassword"
            },
            {
                "raw_content": "Because very single federal agency is in a state of insurrection against the federal executive.",
                "author": "Wexit-Delecto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When Hoover built his dream headquarters....",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Accurate.",
                "author": "B0bE"
            },
            {
                "raw_content": "Didn’t ole Hoover like a little cock himself ?",
                "author": "Zarlino"
            },
            {
                "raw_content": "FBI hasn’t changed one bit.",
                "author": "Aggrieved03"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PC gaming has a pricing problem, and the memory crisis is compounding it in a way that's utterly heartbreaking for our hobby",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2026 is going to see at least one of the 'AAA' corporations go bankrupt, merge, get bought out or otherwise disappear. I won't be sorry to see them go.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "Glad I'm not the type to fall for consumerism. I'm pretty happy with what already I got. If I wasn’t, then it's not the end of the world as I have other priorities in life. It'll get better eventually. We got through the GPU Armageddon of the two crypto booms and the PC component shortage of COVID-19. That said, the gaming monitor market right now is pretty awesome. So many options and features at great prices.",
                "author": "jasmansky"
            },
            {
                "raw_content": "Gaming doesn’t have a cost to entry Many of us spent years playing on our „regular“ laptops and desktops with igpus If you are happy playing games that will run on a potato and there has never been this many options there is an incredible world out there And igpus have honestly exploded in capapability in the last 10 years",
                "author": "SupportDangerous8207"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Some Japanese shops start rationing GPUs — graphics cards with 16GB VRAM and up are becoming harder to find, says one store",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"16GB VRAM and up are becoming harder to find, says one store\" its funny way to write nobody wants bad deal GPUs",
                "author": "gorion"
            },
            {
                "raw_content": "Just settle for a budget 4050 and play on medium settings.",
                "author": "LargeSinkholesInNYC"
            },
            {
                "raw_content": "Hello imaginary_num6er! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is the future of hardware just optimization?",
        "score": 46,
        "text_content": "For a few years now, we've been seeing the slowdown of Moore’s law, as transistors starting to reach the limits of what’s physically possible. The newest TCMS node is just 2NM, the next one is just 1,6NM and the one after that is just 1,4NM. And while there are other improvements in the manufacturing process like 3D stacking, different masks for lithography steps. There’s an end to this tech tree, and I think we’re getting really close to it. Barring the switch to quantum or light based computers I think most improvements to the computer world are going to come from optimisations. I remember more that 10 years ago in CS class a teacher said something along the lines: “You don’t need to bother optimising the code after you’ve done the basics, because a customer can just buy a faster computer.” With Moore's law slowing down I think we’ll look more and more into optimizing every part of the stack, starting with chip architecture, drivers, OS, and of course finishing with software that we run on it. We can already see it happening, on the architecture level, ARM and RISC-V bringing crazy improvements in performance, and power efficiency. We can see it on the OS side as well. Apple's IOS and Linux are much more efficient at using resources than Windows is. And it’s not just because they can take advantage of ARM based processors, IOS always had better battery life and was shipped with less RAM than equivalent windows machines. While we're on the subject of RAM, I think the current/coming RAM shortage will also play into the optimisation push. Even though RAM is using “only” a 12NM process node for the first time we’re not going to see an increase in the amount of RAM an average consumer has. Now of course it all depends on how long the AI bubble will last, the RAM manufacturers don’t think it will be a long time as they don’t see it being worth it to build up extra capacity. But the point still stands, there will be an end to that tech tree. You can say a similar thing about GPU’s. Most improvements in performance in Nvidia's cards came from brute forcing, they’ve been pushing more and more power to their cards to the point that once a week, if not more often, you can see somebody with a melted cable. So my question is: When do you see the gains in manufacturing reducing to the point where optimization in architecture is going to start making a bigger difference? Or do I have it all wrong? My own thoughts are that in the next five years we’re going to get okay hardware improvements, but once we hit 2030s, optimization is going to be the biggest game in town, in terms of increasing performance. And by optimization I mean in all levels in the stack from architecture to operating systems to the programs running on them. What are your predictions for the next 5-10 years?",
        "comments": [
            {
                "raw_content": "That post is a melting pot of truths and glaring mistakes. It's true we're approaching the end of the current tech tree, as transistors are already near atom-size level. That said, you can't seriously compare windows and iOS. They don't do the same things and don't have the same objectives. Nvidia isn't brute forcing at all, quite the opposite. Since 2018 they've promoted using fixed function hardware for stuff like Ray tracing, and AI usage of DLSS to not require as much brute force in rendering. That CS teacher is an idiot, you definitely should optimize code. Windows using react native for the start menu is one example of why unoptimized code make it feel slow.",
                "author": "Krigen89"
            },
            {
                "raw_content": "You can look up IRDS's most recent More Moore roadmap if you're curious. There are significant improvements in compute and efficiency yet to come from CMOS, albeit at a slower pace. Economies of scale, learning by doing, and additional competition will also be important to make high-end nodes much cheaper than they are now. Meanwhile, hardware manufacturers are now having to take risks they haven't in decades to advance the industry, so who knows when the beyond-CMOS paradigm will arrive.",
                "author": "Fun_Secretary8842"
            },
            {
                "raw_content": "I't's true that MOSFETs seem to be getting to be as small as the laws of physics allow, but just as there's a [physical law](https://en.wikipedia.org/wiki/Carnot_cycle) governing how efficient a heat engine can possibly be there is also a [physical law](https://en.wikipedia.org/wiki/Landauer%27s_principle) governing how efficient computation can possibly be and we aren't at the limit yet .So probably we're going to find some way to approximate it eventually, though it might be as radical change as the change from atmospheric pressure steam engines to high pressure ones. We don't know what form this might take, nano-electro-mechanical or nanotube circuits or ballistic electrons or what. Probably it will take a long time for the new paradigm to mature enough to be useful, plausibly decades.",
                "author": "symmetry81"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fujifilm Launches LTO Ultrium 10 (40TB) Data Cartridge",
        "score": 42,
        "text_content": "Available from January 2026, price TBO unfortunately. > Magnetic tape storage media with a maximum storage capacity of 100TB (compressed) per cartridge, approximately 33 percent greater than the previous version. Enables the secure and cost-effective storage of large amounts of data",
        "comments": [
            {
                "raw_content": "They are still doing the compressed capacity marketing. It's so out of touch with reality. Nobody using (or selecting) LTO technology is fooled by deceptive marketing, and it is disgusting if anything.",
                "author": "3G6A5W338E"
            },
            {
                "raw_content": "> price TBO unfortunately I expect it has enterprise pricing because only enterprise customers buy this stuff and only enterprise customers buy this stuff because it has enterprise pricing.",
                "author": "ProfessionalPrincipa"
            },
            {
                "raw_content": "Here’s hoping it’s remotely affordable.",
                "author": "SeriesOrdinary6355"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How I Feel Spreading Misinformation ☹️",
        "score": 270,
        "text_content": "Nintendo REALLY didnt want us using our new consoles for streaming after the switch 1",
        "comments": [
            {
                "raw_content": "YouTube has said they are “working on it” but admittedly yes I maxed out the hour counter on YouTube or got pretty close (maybe 6000 hours) and you could argue time spent on YouTube is time spent not playing/ buying games. But I think it’ll get here eventually",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "I’m assuming it might be because of GameChat. Most web players have a way to block screen sharing on paid content so they might be trying to figure that out for Switch 2.",
                "author": "mmmcookiesss"
            },
            {
                "raw_content": "I‘d love to have youtube, netflix and co on it. Could leave my ipad at home while traveling",
                "author": "Jamsn7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Treadmill + S2 = Healthyish gaming time",
        "score": 49,
        "text_content": "I’ve been using my office treadmill and s2 and have been really enjoying it. Being able to have split controls means I can swing my arms like normal and still play. Anyone else do this?",
        "comments": [
            {
                "raw_content": "I urge every gamer who aren't active physically to get a treadmill or a stationary bike and use it at least 40 mins a day. It's going to do wonders for you. 40 mins a day isn't much so just commit to that.",
                "author": "Massive_Fly_1709"
            },
            {
                "raw_content": "How is your desk so clean and free of clutter",
                "author": "watching_sisyphus"
            },
            {
                "raw_content": "I'm looking soon to get a under desk treadmill, if you don't mind me asking which one did you go with and why?",
                "author": "Demystify0255"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Now that the Switch 2 has come and went by, what were fan made concepts you found funny, crazy, or interesting?",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fish button",
                "author": "Gonzalo-chay"
            },
            {
                "raw_content": "“You can now smell the scents of war and long-dead civilizations in Metroid Prime 4 with patented Smell-O-Vision!”",
                "author": "Tael64"
            },
            {
                "raw_content": "The C button being for Campus, a built-in social media network like Miiverse.",
                "author": "HamFan03"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 games",
        "score": 20,
        "text_content": "Bought a Switch 2 Bundle a couple months ago so I could play TOTK and my 6 year old could play MKW. As an impulsive buyer, Christmas has passed and I’ve added quite a few games. I got Bananza a few weeks ago. It’s another one I knew the kid would like, and he does. I’ve gotten through about 7 layers. Love the personality it has. Just a fun, light hearted Nintendo title. Opened Metroid 4 on Christmas and have played about 25 minutes. Basically where I Enter that first green planet. Not disappointed at all yet. I know I’m getting incredible audio and visuals. Cool sci story, and hopefully a beatable game that I can knock off the list. Caught the Cyberpunk 2077 deal. I haven’t had a system in years. But follow gaming and of course remember all the delays when this came out. It’s my style of game with the futuristic world, and after about 45 minutes I’m pretty damn satisfied. Just playing it on easy and enjoying the story. What a cool game. On Christmas I impulsively bought Smash Bros Ultimate and it has become my son’s favorite game. It really is cool, and maybe the most quintessential Nintendo game I’ve played. I just love how you get all the different stages and music from different video games. An incredible list of characters. Also my son and I are very into Pokémon right now so having a ball with that aspect. What other games are must buys? Any fans of the games I’ve listed and if so, what are your favorite aspects of these games? No Mans Sky, and RDR are a couple that have caught my eye. But I really need to find a good balance between playing all these games. Im thinking I’m going to focus on Metroid and Cyberpunk for awhile.",
        "comments": [
            {
                "raw_content": "Do you game on other systems as well? There's a ton of fantastic indies on the Switch, which are worth getting if you haven't tried them elsewhere. Obvious ones include games like Hollow Knight, Hades, Undertale, Celeste, etc.... but there's literally dozens of these amazing games out there for cheap. In terms of first party games, an easy winner is Mario Odyssey. For your kid, since he's into pokemon, Let's Go Pikachu/Eevee are great options. New Pokemon Snap is also fun and pretty kid friendly. I'd highly recommend Lego City Undercover too for some multiplayer fun with your kid.... it's like a child-friendly GTA.",
                "author": "supes1"
            },
            {
                "raw_content": "Hades 2, and I believe it's still on sale",
                "author": "Anarki85"
            },
            {
                "raw_content": "Splatoon 3 is a must buy. All ages can have fun. It has PvP, co-op, and single player. Splatoon Raiders will be releasing as well. I have the most hours logged on this game from S1 of all my games. It runs so well on the Switch 2. It’s amazing. Pokémon as a series is also a must buy. Which title is debatable, however. You should look at Scarlet/Violet or the new ZA. Maybe show the children trailers and ask which they prefer? Either way, it’s a flagship Nintendo IP for a reason.",
                "author": "sparr0w343"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Merry Christmas to *me*!",
        "score": 103,
        "text_content": "I bought everyone else's gifts, so I made sure to get what *I* wanted, too! 🥰 We traded in my original Wii & the games it came with at Game Stop for more than we expected, so we juat bought it there. Hubby was not on board at first, but then came around in the *sweetest* way with all of these things to make my 2 upcoming 12 hour flights more tolerable. (He got the FitBit to help monitor my heart condition because he worries 🥹) I am new to the Switch universe, so I'll prolly be lurking around a bit and learning what & how! 🥰 If anyone has tip or tricks, or game suggestions I'd be super appreciative!",
        "comments": [
            {
                "raw_content": "Yaaaay! Definitely look into Donkey Kong Bananza. If you like Mario Kart World, Kirby Air Riders is another racing game that’s a ton of fun. (Well, it’s partially a racing game, but it scratches a similar itch.)",
                "author": "Otome_Chick"
            },
            {
                "raw_content": "Good job getting a screen protector right off the bat, my old switch 1 had battle scars from the dock cause I never did it the first time around",
                "author": "abysmal-mess"
            },
            {
                "raw_content": "You'll probably want a microsd express card (remember the express part) if not now, then eventually, as you start looking at older switch 1 titles in the eshop along with switch 2 titles when they have a discount that it's hard to pass up haha You'll eventually want to think about a controller to use over the joy cons just for more comforts sake. Either the pro controller 2 or a third party one that you're happy with Welcome to the switch 2 world. :D",
                "author": "Serafita"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 version of Factorio is incredible",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "bro you have large hands it looked like you were holding a switch lite",
                "author": "fireaura"
            },
            {
                "raw_content": "Agree! I Play the Switch 2 Version non Stop since Release! Controller controls are suprisingly good and the Game Runs perfect.",
                "author": "krazun"
            },
            {
                "raw_content": "I already have it on Steam but I’m really tempted to double dip. Really want to support every dev who’s putting out a Switch 2 upgrade.",
                "author": "Nintotally"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just reached the hundred hour mark in AC Shadows and there's still a lot left to do!",
        "score": 177,
        "text_content": "It's been worth it. It's the only Switch 2 game I've played this month.",
        "comments": [
            {
                "raw_content": "Awesome! Do you play in handheld? How has the performance been?",
                "author": "StrainGullible"
            },
            {
                "raw_content": "Can't get enough of it",
                "author": "setonfire_"
            },
            {
                "raw_content": "Great game got the platinum on PS5",
                "author": "KTrey8"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My 2026 release calendar prediction",
        "score": 20,
        "text_content": "We’re approaching 2026 and I was bored and thought about what could 2026 look like for Switch and Switch 2, so I came up with a calendar for the releases throughout the year and why I think it makes sense for them. Let me know what you think! January: Animal Crossing New Horizons - Nintendo Switch 2 Edition / Donkey Kong 64 (NSO) February: Mario Tennis Fever / Pokemon Kanto Bundle (Shadow drop - Switch 1) / Pokemon Colosseum (NSO Shadow drop) March: Pokemon Pokopia / Super Mario Wonder Nintendo Switch 2 Edition April: Yoshi & The Mysterious Book / Super Mario Sunshine (NSO) May: Fire Emblem Fortune’s Weave / Tomodachi Life (Switch 1) June: Rhythm Heaven Groove (Switch 1) / Pokemon Champions (Switch 1) / Fire Emblem Path of Radiance (NSO) July: Splatoon Raiders August: Super Smash Bros Ultimate - Nintendo Switch 2 Edition / Kirby Planet Robobot Deluxe (Switch 1) September: Zelda 2D Remake / Pokemon XD Gale of Darkness (NSO) October: New Super Mario 3D November: New Pokemon Generation December: Zelda Twilight Princess (NSO) / Super Smash Bros 64 (NSO) Explanation: January: They usually don’t release big games on that month and the preview of what’s coming indicates we won’t get much. I can see Donkey Kong 64 finally being added to the NSO, it’s long overdue and DK Bananza got quite the exposure with the Game Awards in December. February: I believe we’ll get some sort of return to Kanto for Pokémon’s 30th Anniversary, and their easiest way to do it is to release the original Gameboy games. However they’ll make you pay for them on the eShop to enable a Pokemon Home compatibility and prevent glitches and bugs to go through their checks. Colosseum as a shadow drop is likely and we know it’s coming already anyway. Regardless, there will be Pokemon big announcements on Pokemon Day because the 30th Anniversary is a major milestone for them and they’ll want to release games over the year to celebrate it. March: We know already the Pokopia release date and we know Mario Wonder will get its Switch 2 Edition treatment. I don’t think they’ll make us wait much longer for it and will likely preview one last trailer in a February Direct to launch it soon after. April: It seems like a good month to capitalise on the appearance of Yoshi in the Galaxy movie, and with the sun slowly coming back, Mario Sunshine feels like the ideal pick to benefit from the new Mario movie and allow core fans that never bought the All Stars collection to replay that game. We know Sunshine is coming and it’s the ideal launch date for me. With the Mario Bros Anniversary, I’m sure they won’t have any issue with the overexposure of the Mario Universe this year. May: By then, Fire Emblem will be ready and it will be a strong core gamer title that should bring back the core Nintendo fans tired of Mario and Pokemon. Tomodachi Life will keep Switch 1 owners busy and will attract a different type of gamers, so two 1st party games on the same month will not be a crazy idea. June: There’s not a better summer game than Rhythm Heaven and it’ll fit perfectly here alongside Pokemon Champions and a new NSO release for Switch 2 owners. Fire Emblem will benefit from those who loved Fortune’s Weave in May and won’t cannibalise its sales by releasing one month later for the big fans of the series. July: Splatoon games usually release during the summer and with what I have predicted next, that would be its perfect spot in the calendar. I can’t really see it releasing anywhere else. August: Probably the wildest take in here but I can see Smash Ultimate getting the Switch 2 treatment with performance upgrades and an additional rogue lite mode. It won’t cost more than $10 and won’t include the Mii costumes and character DLC packs. Maybe it will even be included with the NSO subscription like Zelda? Since the next Smash game is unlikely to come anytime soon, that’d be a way to bring players back to the game. Kirby Planet Robobot has been rumored for so long and if it does release, that’d be in August and I can see it being a Switch 1 game with a free patch to unlock better performance on Switch 2. Nintendo said they won’t abandon Switch 1 and it would be a way to keep Switch 1 players engaged with the system. September: I think Nintendo will want to start creating excitement for the Zelda series and the upcoming movie, and the easiest way will be to bring back on Switch 2 a 2D game as a remake as a way to remind their larger audience about Zelda. That’ll be a way to set up their Zelda strategy going into 2027. Additionally, Zelda 2D games are a perfect fit for the September slot (AA games from beloved franchises). Alongside Zelda, Pokemon will continue its exposure for the 30th Anniversary with XD, the sequel to Colosseum on the NSO. We know it’s coming too, but I doubt they will launch it at the same time as Colosseum, so a few months later seems a good idea. October: The grand finale of the Mario Anniversary and the biggest game of the year with the new 3D Mario. It’s been long overdue and there is simply no way it will release later than that. It’s the Anniversary, they have the movie coming out in 2026, and it’s been so long since Odyssey that 2026 will be the year for Mario. Any Mario 3D after 2026 would be a really odd decision. November: No surprise here, but that will be the grand finale for Pokémon’s Anniversary as well. All Pokemon mainline games release in November so this one is probably the least shocking pick from this list (out of the games we officially never heard about). They don’t need to release anything else, Pokemon will sell a lot just like Mario, and both will be the big holiday games. GTA 6 will not be a competition, they attract different kinds of gamers and The Pokémon Company wont care anyway since Pokemon will obliterate GTA in Japan. December: This will be a quiet month. Nintendo rarely releases their games in December as it’s not the best release period due to Xmas and holidays (customers usually buy their Xmas presents in October and November, hence the big releases on these months each time). They could release once and for all Smash 64 as a goodbye to 2026, and Twilight Princess will be enough to build momentum for the upcoming Zelda movie and generate new NSO subscriptions after new buyers got their Switch 2 at Xmas. It’s such an iconic game that it can keep people engaged with the Switch 2 on its own. Beyond all of these, I could see a new Animal Crossing game being teased with a « 2027 » but in my opinion there’s no way they will release it in a year with a new 3D Mario and Pokemon. 2027 is likely, but 2026 seems too much and unrealistic. I don’t believe in a Mario Kart DLC for now and I can see them releasing one later (maybe 2027 too?) while releasing QOL updates throughout the year.",
        "comments": [
            {
                "raw_content": "My predictions - Wonder will move to April to accompany the movie. - FE and Splatoon Raiders will take June and July, not sure about the order. - Rhythm Heaven will release in August together with the Duskbloods. - September will be MonolithSoft's new medieval RPG. - Zelda's 40th anniversary project will be OoT remake, but it will come out after the movie in 2027.",
                "author": "xhr0428"
            },
            {
                "raw_content": "I assume we will get a 3D Mario but like a remix of Galaxy & Odyssey since thats what the Mario Galaxy movie trailer is kind of about and they already have stuff to work with from those two games. I think we will get a Pikmin Switch 2 edition, due to that one Pikmin video. Maybe Super Mario Maker 3 because Super Mario 3D World and Galaxy was updated for Switch 2 and that would be a cost effective way to revisit those two games but start to lay the groundwork to incorporate 3D level making for Super Mario Maker 3.",
                "author": "Zebra500mcg"
            },
            {
                "raw_content": "I am so stoked for Fortune's Weave it's not even funny. No matter what the release date ends up being, the time is going to go by so slowly. FE is one of those series I will schedule time off work for and I fully intend to do so",
                "author": "Key_Artichoke8315"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Adriyan Rae (South of Midnight actress) plays the Villain's telekinetic sidekick in a secret 2K game that's probably BioShock 4",
        "score": 377,
        "text_content": "To continue the BioShock 4 news going on today, this is from weeks ago but I never saw it posted here, it's some interviews where she mentions she played a role in a 2K game that fits BioShock 4's description: [https://www.tiktok.com/@itstherespawn/video/7580063289992842518](https://www.tiktok.com/@itstherespawn/video/7580063289992842518) >*\"This is your first videogame, right?\"* >*\"No. I think it was BioShock 4 but I don't know. Allegedly. I literally have no idea but the crowd has me feeling like I was in BioShock 4.* >*I worked on it very hard. I worked very hard on it, I was going to a production studio in San Francisco and I had superpowers, I had Telekinesis and I was like getting people and throwing them against the walls and stuff. It was great but it never came out. So I don't really know. And then there were so many NDA's and... I have no way of telling, I probably never worked on it, who knows?\"* [https://www.gamereactor.eu/south-of-midnight-actress-starred-in-a-cancelled-2k-game-that-sure-sounds-like-bioshock-4-1623673/](https://www.gamereactor.eu/south-of-midnight-actress-starred-in-a-cancelled-2k-game-that-sure-sounds-like-bioshock-4-1623673/) >*\"I did a game, and it was with 2K productions. I did it in 2021, right after I was off Chicago Fire. That was the next thing that I did. And I was between that... Yeah, 2021. So I did the game. I was this, the assistant to a villain, like the sidekick who did all the punching people and getting put on all the dirty work. I was that person. I could levitate. I had telekinesis. I was throwing things and I was fighting and it was so much fun. And then just... I don't even know the name of it. Cause they never tell you what the name is, and I don't even have, like, I can't even go back in my emails because all of them self-destructed. So like, even if... even if someone was to look, they'd be like, 'no, that never really happened'. They might be able to prove that it never happened, but I know I was there.\"* Maybe it was just for a previous iteration of the game, but considering today we got to know the current iteration of BioShock 4 is still in the Arctic like some people said it was gonna be years ago, her character and voice might still be in the game too.",
        "comments": [
            {
                "raw_content": "Talking about NDA’s whist breaking your NDA ![gif](giphy|s5wFafpHxqKbIEERl9)",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "How did she mention NDAs and in the same breath spill all that???",
                "author": "Shining_Commander"
            },
            {
                "raw_content": "What comes out first, BioShock 4 or Judas",
                "author": "Blanketshaper"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: New details and pics for Bioshock 4",
        "score": 744,
        "text_content": "[source](https://mp1st.com/news/bioshock-4-glimpse-into-characters-setting) * Some new locations include a casino and a place called Solaria/Solaris. * ADAM possibly returning. * Enemies called \"Flushers\" * There's environments with snow. * Troubled development in a period \"in (or prior to) 2022\" There are also pictures with some assets that show the villain and possibly the main character.",
        "comments": [
            {
                "raw_content": "I hope the setting is still the arctic. That sounded interesting.",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "Idc what anyone says I WANT a new bioshock game",
                "author": "Previous_Bee6494"
            },
            {
                "raw_content": "Bioshock🤝Development Hell",
                "author": "JLNX1998"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Board Channels: AMD and NVIDIA GPU price hikes may reach AIB cards in Jan-Feb 2026",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Cool. I was too poor for new GPU, now I will be double too poor. Almost 9yo RX580 still rocking",
                "author": "GobiPLX"
            },
            {
                "raw_content": "Both a 9070XT a while back for €500ish. Going to keep my spare RX 6800 for a bit as a backup just in case something happens to the 9070XT!",
                "author": "LinKeeChineseCurry"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "In 2025, Investors Bought 33% of Single‑Family Homes; That’s a Five‑Year High",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In another timeline we have a progressive property tax and housing is 3-4x median household income nation wide.",
                "author": "Cheap-Surprise-7617"
            },
            {
                "raw_content": "I've already accepted I'll never own a home lol. But thanks for the info.",
                "author": "btoned"
            },
            {
                "raw_content": "fantastic, everyone will be renters soon.",
                "author": "9To5Imperial"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The \"AAA\" Lie: Why the Commercial Real Estate crash is officially worse than 2008 (A Deep Dive into the 1740 Broadway Deal)",
        "score": 291,
        "text_content": "Everyone talks about the \"coming\" crash, but if you look at the actual transaction logs from the last 6 months, the crash isn't coming—it's already here, and it's being hidden by \"Extend and Pretend\" accounting. I’ve been digging into the specific numbers on the Blackstone 1740 Broadway default in NYC, and the math is terrifying for anyone holding pension funds or insurance policies. **The Crime Scene**: \\* 2014: Blackstone buys the tower for $605M. \\* The Financing: They wrapped it into a CMBS (Commercial Mortgage-Backed Security). The AAA-rated tranche (the \"safe\" part) was sold to pension funds and insurers. \\* The Crash: LBrands leaves. Blackstone defaults. The building was just sold/valued around $186M. \\* The Result: A \\~69% wipeout on a Manhattan trophy asset. Here is the scary part (The \"AAA\" Lie): In 2008, subprime was the issue. Today, it’s supposed to be \"contained.\" But in this specific deal, the losses were so deep they burned through the lower bonds and actually hit the AAA holders with a \\~26% principal loss. This hasn't happened to a AAA conduit CMBS since the GFC. It's not just NYC. Look at the data points from Q2/Q3: \\* St. Louis (909 Chestnut): Sold for $205M (2006) -> Sold for $3.6M (2024). That is a 98.2% drop. The land is worth more than the building. \\* Los Angeles (Aon Center): $268M -> $147M (\\~45% drop). \\* The \"Hope Note\" Strategy: Banks are splitting loans into \"A-notes\" (performing) and \"B-notes\" (dead/ignored) just to avoid marking the loss on their books. The Fed/FDIC guidance from June 2023 basically gave banks permission to \"work it out\" (aka hide the losses) rather than foreclose. But with $900B+ in loans maturing, the math doesn't work at 7-9% refinancing rates. My Take: The only reason we aren't seeing bank failures daily right now is because they are legally allowed to pretend these buildings are still worth 2019 prices. Has anyone else been tracking the \"B-Note\" restructuring data? It feels like 2008 all over again, but this time the collateral is empty offices instead of strippers with 5 mortgages.",
        "comments": [
            {
                "raw_content": "No but this is the info I like to see in this sub",
                "author": "NewChemical7130"
            },
            {
                "raw_content": "This is good info and a good summary, but this has been going on for years now. I am starting to think the banks can hold out faking it until the next re bull cycle.",
                "author": "mattjouff"
            },
            {
                "raw_content": "IMO a big part of corporate \"Return To Office\" is to bail out the investors who overpaid for office space (at the expense of regular people who could otherwise do their job just fine at home)",
                "author": "point_of_you"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lots of homes delisted near me to avoid price drops - normal strategy or red flag ?",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's incredibly stressful to continue to have a clean house, and a clean yard, **in the slight chance someone would want to view your home during Winter.** Especially during the holidays...people just want to relax and enjoy the season. It's like my neighbor once said, she just wants to keep her shoes out, otherwise, she'll wait to relist in Spring, instead.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "...uh...the price/value will follow the markets... Do these people believe they cant freeze a wanted sale price when market is in a downturn? That seems incredibly stupid. Wont their home values just follow the market anyway?",
                "author": "ErictheAgnostic"
            },
            {
                "raw_content": "No conspiracy. Just seasonality.",
                "author": "NorCalJason75"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Did the Fed prevent a real estate bubble crash?",
        "score": 2,
        "text_content": "It seems like the real estate market was on fire, 2020-2022…. I recall Buyers making crazy over asking offers. It seemed like one purpose of interest rate hikes was to cool the real estate market? Did interest rates increases work or soften a potential future downturn?",
        "comments": [
            {
                "raw_content": "I think that was one of their goals",
                "author": "Snoo-5081"
            },
            {
                "raw_content": "It seems they deferred the downturn causing an accidental rapid affordability gap, They lost control with a breathtaking scale of inflation. Media loves to go on about how the rate of inflation is doing well but the real story is the scale of inflation choking half the population out of the market and just about everything else. QE was a lot more than just rate adjustments.",
                "author": "Semiotic3"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rents are falling in these major U.S. cities heading into 2026—one of the more 'renter-friendly periods' in a decade, says expert",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you could not afford to rent in 2021 and 2022, you still cannot afford “squat”, as rents came down maybe 1%? At best, rent prices are stabilizing.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Would be more friendly, if they were not falling from sky high.",
                "author": "Jumpy_Childhood7548"
            },
            {
                "raw_content": "If deportations (self & enforced) keep going at this clip for the next few years there is likely to be further drops. As vacancies start to rise then landlords will become more eager to offer discounts as some rent is better than none. To say nothing about how the increase in supply will also have a further deflationary impact. Renters should be lowballing anywhere the vacancy rate is reasonably high (and increasing)",
                "author": "Round_Pin_658"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Outlook 2026: Why Fewer Canadian and U.S. Homeowners Are Expected to Fall Underwater",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump: \"We're gonna need the help of robots and other forms of ... I guess you could say employment. We're gonna be employing a lot of artificial things.\"",
        "score": 570,
        "text_content": "",
        "comments": [
            {
                "raw_content": "imagine being unemployed and your employed advanced hominoid robot neighbour is having the time of its life next door..",
                "author": "AdFeeling842"
            },
            {
                "raw_content": "I know just the job where a LLM would be a better fit than the incumbent position holder.",
                "author": "Redducer"
            },
            {
                "raw_content": "\"the beauty is we're gonna have more jobs than we've ever had\" lmfaooooo he knows he fucked up what a piss poor way to save it 😭",
                "author": "viavxy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There's no bubble because if the U.S. loses the AI race, it will lose everything",
        "score": 215,
        "text_content": "In the event of a market crash, the U.S. government will be forced to prop up big tech because it cannot afford the downtime of an ordinary recovery phase. If China wins, it's game over for America because China can extract much more productivity gains from AI as it possesses a lot more capital goods and it doesn't need to spend as much as America to fund its research and can spend as much as it wants indefinitely since it has enough assets to pay down all its debt and more. If there's a crash, I would wait and hold and if America just crumbles and waves the white flag, I would just put 10% of my assets into Chinese stocks.",
        "comments": [
            {
                "raw_content": "Why is the assumption that this is a zero-sum game? It's not like there's a clearly defined finish line.",
                "author": "baudinl"
            },
            {
                "raw_content": "A couple of things * AI is clearly going to be a thing in the future. If not LLM, then other developments will happen. When it does, it will be very powerful and world changing. * The AI race is totally a geopolitical thing. The US vs China. Both see AI as strategically important, perhaps more important than money, atomic bombs, military power, diplomatic power. AI unlocks every other technology, unlocks economic prosperity, unlock military and diplomatic power. * AI isn't a destination. It is extremely unlikely that we will reach a point where AI is just complete and \"finished\" and no further development. There will just be increasing more and more capable AI. * AI will be applied to all different parts of the economy at different rates. It could take decade or a century for it to be applied to some parts. If the US loses, I am not sure stocks anywhere will be that important. It is entire possible, both sides win, or both side lose.",
                "author": "phido3000"
            },
            {
                "raw_content": "https://preview.redd.it/vac5ygfequ9g1.jpeg?width=1012&format=pjpg&auto=webp&s=5863c62e7025d4e1254b6c6d4f1739eb9166e1e1 Inb4",
                "author": "tlnayaje"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy Uses Claude Code To Infiltrate Home System",
        "score": 110,
        "text_content": "See [his X post](https://x.com/karpathy/status/2005067301511630926?s=20)",
        "comments": [
            {
                "raw_content": "![gif](giphy|tkruja3wbPS9h6GTzg|downsized)",
                "author": "Worldly_Evidence9113"
            },
            {
                "raw_content": "This is not as interesting as it seems.",
                "author": "mop_bucket_bingo"
            },
            {
                "raw_content": "Using the word \"infiltrate\" is clickbait and does a disservice to the actual value of what is presented here. Claude Code successfully operated a home automation system. The majority of the human population are not as tech savvy as that, and would find such a capability useful. Think of all the things your non-tech friends and family ask you to help them with. Think of every tech support job in every company, and what fraction of that work this will automate.",
                "author": "sckchui"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A 'jobless boom' is shaping up to be the story of the 2026 economy: \"Companies want to use AI to boost productivity without hiring more people\"",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They also happily use AI to filter job applications but won't tolerate AI being used FOR job applications.",
                "author": "DigitalRoman486"
            },
            {
                "raw_content": "I think we're going to see this be the case from here on out. The Singularity is an era not a moment. We're just in the difficult birth of tomorrow. Any outfit with 100 employees isn't hiring 10 more next year. They are just making new workflows or outsourcing or getting \"new software\" and all of that is just tapping into cloud AI. Either people using it on a personal level and the tools we use every day becoming rapidly more useful, or better more appropriate B2B software. The text to speech and back again is now as good as most call centers on the other side of the world. Most people don't realize how good they've gotten and they don't realize that they can have an AI Personal Assistant for about $100 in subscriptions, and a weekend tying it all together. This is going to grow in every direction. The adoption rate will be slower than the development and way way behind the deflation in token cost.",
                "author": "DHFranklin"
            },
            {
                "raw_content": "Remember folks, AI is an augmentor, not a replacement.",
                "author": "ManBunH8er"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What if AI just plateaus somewhere terrible?",
        "score": 158,
        "text_content": "The discourse is always ASI utopia vs overhyped autocomplete. But there's a third scenario I keep thinking about. AI that's powerful enough to automate like 20-30% of white-collar work - juniors, creatives, analysts, clerical roles - but not powerful enough to actually solve the hard problems. Aging, energy, real scientific breakthroughs won't be solved. Surveillance, ad targeting, engagement optimization become scary \"perfect\". Productivity gains that all flow upward. No shorter workweeks, no UBI, no post-work transition. Just a slow grind toward more inequality while everyone adapts because the pain is spread out enough that there's never a real crisis point. Companies profit, governments get better control tools, nobody riots because it's all happening gradually. I know the obvious response is \"but models keep improving\" - and yeah, Opus 4.5, Gemini 3 etc is impressive, the curve is still going up. But getting better at text and code isn't the same as actually doing novel science. People keep saying even current systems could compound productivity gains for years, but I'm not really seeing that play out anywhere yet either. Some stuff I've been thinking about: * Does a \"mediocre plateau\" even make sense technically? Or does AI either keep scaling or the paradigm breaks? * How much of the \"AI will solve everything\" take is genuine capability optimism vs cope from people who sense this middle scenario coming? * What do we do if that happens",
        "comments": [
            {
                "raw_content": "Yes, this is one scenario. AI is an event horizon we’re standing right in front of. We can see some distorted edge cases (Utopian, apocalyptic) but we can’t see what’s right down the middle",
                "author": "j00cifer"
            },
            {
                "raw_content": "You're forgetting AGI *dystopia* where AI could automate all work but the people in power hoard all the benefits and turn the world into a cyberpunk nightmare. I think that's a more common prediction than overhyped autocomplete but not one I share.",
                "author": "varkarrus"
            },
            {
                "raw_content": "If it platueud today we’d have at least 5-10 years of developing tools and frameworks to squeeze all the juice of them.",
                "author": "ThenExtension9196"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman tweets about hiring a new Head of Preparedness for quickly improving models and mentions “running systems that can self-improve”",
        "score": 314,
        "text_content": "Link to tweet: https://x.com/sama/status/2004939524216910323 Link to OpenAI posting: https://openai.com/careers/head-of-preparedness-san-francisco/",
        "comments": [
            {
                "raw_content": "Qualifications: 10+ years of experience in preventing ASI systems taking over the world.",
                "author": "troll_khan"
            },
            {
                "raw_content": "https://preview.redd.it/h8f4quy5es9g1.png?width=755&format=png&auto=webp&s=1fad54268f03b82f60cd61f054cffefb4c9b21ce",
                "author": "borntosneed123456"
            },
            {
                "raw_content": "Imagine being the *Head of Preparedness.*",
                "author": "Dasseem"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What are your 2026 Ai predictions?",
        "score": 23,
        "text_content": "Here are mine: 1. Waymo starts to decimate the taxi industry 2. By mid to end of next year the average person will realize Ai isn’t just hype 3. By mid to end of next year we will get very reliable Ai models that we can depends on for much of our work. 4. The AGI discussion will be more pronounced and public leaders will discuss it more. They may call it powerful Ai. Governments will start talking about it more. 5. Ai by mid to end of next year will start impacting jobs in a more serious way.",
        "comments": [
            {
                "raw_content": "videos with will smith eating spaghetti will get even better!",
                "author": "sergeyarl"
            },
            {
                "raw_content": "White collar companies all over start mandating that their employees attempt to use AI for their work and expecting more output. Most web users never leave Google anymore because the answer to absolutely everything is in the AI chat. And as a result, Google dominates the chatbot space.",
                "author": "Mobius00"
            },
            {
                "raw_content": "Singularity is solved August 3, 2026 at 11:51 AM EST.",
                "author": "Junior_Direction_701"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Assume that the frontier labs (US and China) start achieving super(ish) intelligence in hyper expensive, internal models along certain verticals. What will be the markers?",
        "score": 37,
        "text_content": "Let's say OpenAI / Gemini / Grok / Claude train some super expensive inference models that are only meant for distillation into smaller, cheaper models because they're too expensive and too dangerous to provide public access. Let's say also, for competitive reasons, they don't want to tip their hand that they have achieved super(ish) intelligence. What markers do you think we'd see in society that this has occurred? Some thoughts (all mine unless noted otherwise): **1. Rumor mill would be awash with gossip about this, for sure.** There are persistent rumors that all of the frontier labs have internal models like the above that are 20% to 50% beyond in capability to current models. Nobody is saying 'super intelligence' though, yet. However, I believe if 50% more capable models exist, they would be able to do early recursive self improvement already. If the models are only 20% more capable, probably not at RSI yet. **2. Policy and national-security behavior shifts (models came up with this one, no brainer really)** One good demo and government will start panicking. Probably classified briefings will start to spike around this topic, though we might not hear about them. **3. More discussion of RSI and more rapid iteration of model releases** This will certainly start to speed up. With RSI will come more rapidly improving models and faster release cycles. Not just the ability to invent them, but the ability to deploy them. **4. The \"Unreasonable Effectiveness\" of Small Models** >**The Marker:** A sudden, unexplained jump in the reasoning capabilities of \"efficient\" models that defies scaling laws. >**What to watch for:** If a lab releases a \"Turbo\" or \"Mini\" model that beats previous heavyweights on benchmarks (like Math or Coding) without a corresponding increase in parameter count or inference cost. If the industry consensus is \"you need 1T parameters to do X,\" and a lab suddenly does X with 8B parameters, they are likely distilling from a superior, non-public intelligence. Gemini came up with #4 here. I only put it here because of how effective gemini-3-flash is. **5. The \"Dark Compute\" Gap (sudden, unexplained jump in capex expenditures in data centers and power contracts, much greater strains in supply chains)** (both gemini and openai came up with this one) **6. Increased 'Special Access Programs'** Here is a good example, imho. AlphaEvolve in private preview: [https://cloud.google.com/blog/products/ai-machine-learning/alphaevolve-on-google-cloud](https://cloud.google.com/blog/products/ai-machine-learning/alphaevolve-on-google-cloud) This isn't 'super intelligence' but it is pretty smart. It's more of an early example of SAPs I think we will see. **7. Breakthroughs in material science with frontier lab friendly orgs** This I believe would probably be the best marker. MIT in particular I think would have access to these models. Keep an eye on what they are doing and announcing. I think they'll be the among the first. Another would be Google / MSFT Quantum Computing breakthroughs. If you've probed like I have, you'd see how the models are very very deep into QC. Drug Discovery as well, though I'm not familiar with the players here. ChatGPT came up with this. Fusion breakthroughs is potentially another source, but because of the nation state competition around this, maybe not a great one. **Some more ideas, courtesy of the models:** \\- Corporate posture change (rhetoric shifts and tone changes in safety researchers, starting to sound more panicky, sudden hiring spikes of safety / red teaming, greater compartmentalization, stricter NDAs, more secretive) \\- More intense efforts at regulatory capture .. Some that I don't think could be used: **1. Progress in the Genesis Project.** [**https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/**](https://www.whitehouse.gov/presidential-actions/2025/11/launching-the-genesis-mission/) I am skeptical about this. DOE is a very secretive department and I can see how they'd keep this very close.",
        "comments": [
            {
                "raw_content": "They suddenly start moving into, and successful in, areas that aren’t model providing. SaaS, prop trading, hardware design. Depending on the direction it takes, key researchers in the US and China start dying in mysterious circumstances.",
                "author": "etzel1200"
            },
            {
                "raw_content": "Keep in mind that provisional patents have 18 months after initial filing before the associated patent PCT becomes public, so patents showing up are at least an 18 month lagging indicator in most situations.",
                "author": "da6id"
            },
            {
                "raw_content": "I think the one to watch closely is #2. Trump and/or CCP acting weirdly probably means a step change has occurred.",
                "author": "kaggleqrdl"
            }
        ],
        "subreddit": "singularity"
    }
]