[
    {
        "post_name": "Mob of anti-ICE protesters is still gathered in Camarillo, California, at the site of this morning’s ICE raid. The irony is almost too perfect — they’re proudly waving the flag of the country they don’t want to return to",
        "score": 711,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why they aren’t being shot is beyond me. Enemy combatants. ILLEGAL INVADERS!",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "It's not 'ironic' or 'hypocritical, it's conquest.",
                "author": "MemeMagic777"
            },
            {
                "raw_content": "ICE should be checking Citizenship of every asshole there",
                "author": "ACActual"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They're Just Not Thinking Fourth Dimensionally...",
        "score": 708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "self defense should be legal for invasion control agents",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Please God",
                "author": "iteachfuckinscience"
            },
            {
                "raw_content": "Cartels testing what they can get away with. We need to start treating them like we did with the mafia and put a full fed force into shutting them all down completely. Including incursions into Mexico.",
                "author": "terribletwos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sounds like Trump got the green light to begin his mass cuts in the intelligence community, and the swamp purge is underway.",
        "score": 731,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am cash on delivery now, Bongo Bongino, Do nothing Bondi, and Slur-magnet Patel. I refuse to touch hopium ever again. Show me receipts, then you get my support.",
                "author": "DoMe22"
            },
            {
                "raw_content": "I don’t care anymore. Release the list.",
                "author": "covok48"
            },
            {
                "raw_content": "If that's the case, and I'm not saying it is or isn't ... then I'm sure that MAGA will be very pleased. But 'patience' only goes so far I think, \"two more weeks\" has become a meme for a reason.",
                "author": "AGuyFromAus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "9 years ago today, R.I.P.",
        "score": 1358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "R.I.P. Seth Rich",
                "author": "stonetear"
            },
            {
                "raw_content": "Some Men Gave Everything.",
                "author": "DarthEP"
            },
            {
                "raw_content": "Where's the files, Kash?",
                "author": "chickeninoven"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Trump tells Canadian PM Mark Carney Canada will face a 35% tariff, and any retaliation will be met with that rate plus 35%",
        "score": 1165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As a Canadian I 100% support Trump. Carney is a joke! Keep making Carney look like the little bitch that he is :D",
                "author": "thebeercules"
            },
            {
                "raw_content": "These are all reciprocal. Canada has lots of tariffs and pulls protectionist bullshit constantly",
                "author": "SJWsHateUs"
            },
            {
                "raw_content": "No vaseline.",
                "author": "TakingCoatsWIN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epstein’s former lawyer, Alan Dershowitz, puts his hand to God and swears he knows that documents are being suppressed to protect individuals pertaining to Epstein, and he knows who is doing the suppressing.",
        "score": 1136,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Name names or get the hell outta here. No more two weeks. This is a hill worth dying on.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Alan Dershowitz was accused by Virginia Giuffre as being one of the people she was forced to sleep with",
                "author": "dissledat"
            },
            {
                "raw_content": "Careful, Hillary might come over for tea.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin?",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I will have my slave labor, even if it means burning the whole country down\" --Democrats again",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "As of 2025, approximately 500,000 children in the United States toil as farmworkers, often facing grueling conditions to help support their families.",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Seriously... Just basic logic at this point",
                "author": "MHCIII"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She broke him.",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Okay. On 1/6 Capitol police pulled guns on protestors and shot them … wtf is he talking about ?",
                "author": "KattWilliams2024"
            },
            {
                "raw_content": "The only gun that was used on January 6th was by an inept Sergeant at Arms killing Ashley Babbitt",
                "author": "JayKay1776"
            },
            {
                "raw_content": "That retard thinks shit poster is an insult.",
                "author": "BurtMcGirt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It is very important that all Republicans adhere to my Recissions Bill and, in particular, DEFUND THE CORPORATION FOR PUBLIC BROADCASTING (PBS and NPR), which is worse than CNN & MSDNC put together. Any Republican that votes to allow this monstrosity to continue broadcasting will not have my support",
        "score": 1292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember most of my school teachers gushing about how much they adored NPR when I was younger. I listened to it one time and they were discussing how we needed to spend more money on schools, especially schools for brown kids. Instantly made sense why my teachers loved it so much.",
                "author": "ManOfLowMoralFiber"
            },
            {
                "raw_content": "NPR is radio transmitted soy. Your testosterone goes down just listening.",
                "author": "least_counties_ever"
            },
            {
                "raw_content": "Where's the files, Don?",
                "author": "chickeninoven"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Watch as an anti-ICE protester opened fire on Federal ICE agents during an immigration raid that was taking place on a cannabis farm",
        "score": 933,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to switch to live rounds, boys. Light 'em up.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "First of all, I wish people would stop fucking calling them protesters. They are RIOTERS!",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "When the fuck are they going to start shooting back? If they're shooting at you forget the cuffs and start filling body bags!",
                "author": "cafeman23"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James Woods: Yes, yes, and yet again...YES!",
        "score": 783,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m not sure that it’s over. Ghislaine Maxwell is still alive. My guess is that she either surrendered Epstein’s most damning evidence in exchange for her life, along with her pledge of silence - or - more likely, she still has truly poisonous evidence stashed somewhere with some sort of dead-man-switch arrangement that’s keeping her alive. Epstein didn’t kill himself. Ghislaine firmly believes that her father, Robert Maxwell, was murdered. Virginia Giuffre was recently “suicided”. I’m likely forgetting a few people involved who are dead now, but it looks to me like the Deep State is still trying to cover its ass via murder.",
                "author": "1MonkeyJr"
            },
            {
                "raw_content": "Put it this way. If you believe Epstein was killed to keep him quiet. Which you should believe. Then is it really far fetched to believe the people who killed him would destroy a big pile of evidence that implicates them?",
                "author": "inksday"
            },
            {
                "raw_content": "If only we had an administration that could get to bottom of all this.",
                "author": "fthecoup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes, they will arest you...Feds arrest R.I. man for death threats against Trump and top White House officials",
        "score": 608,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't hide in you bathtub either. Read the story.",
                "author": "elvisbird"
            },
            {
                "raw_content": "New criminal loophole discovered: Utilizing the \"but I'm on the Epstein list\" defense will now result in the immediate dismissal of all charges, along with the automatic expungement of all history associated with the ordeal.",
                "author": "HurtzLocker"
            },
            {
                "raw_content": "Didn’t know Comey was from Rhode Island. You learn something new everyday",
                "author": "MAGA_305_45"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Biden-appointed judge, Maame Ewusi-Mensah Frimpong, has just made a ruling that marks Home Depots, car washes, and other locations where illegals hide as safe havens in LA blocking ICE from making arrests at those locations.",
        "score": 1168,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that’s a judgement as ridiculous as her name.",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "No basis in legal reality. NO more foreigner judges.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "This sounds like a Babylon Bee story 😂",
                "author": "DemPanicAtTheDisco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Update",
        "score": 995,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Much nicer than any of my pallet bonfires.",
                "author": "mydogma8yourkarma"
            },
            {
                "raw_content": "Herein lies the problem with censorship like they are experiencing in Europe. There's gonna be a war over there.",
                "author": "HoganP"
            },
            {
                "raw_content": "That's a statement.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thank you for your attention to this matter. - American Citizens",
        "score": 1413,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Deport them ALL!!!\"",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Amen",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "I don't know about you, but my tax dollars serve Israel",
                "author": "ParadigmShift2070"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Widow of fire chief Corey Comperatore, who was killed in Trump assassination attempt, I think the Secret Service is garbage.",
        "score": 1515,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because they were in on it. And your husband paid the price. RIP Corey. Press F to pay respects.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "My husband was killed by covid. The loss is unbelievable. This government is evil as fuck.",
                "author": "takumargirl"
            },
            {
                "raw_content": "She doesn't understand that its impossible for the secret service to sit atop of a sloped roof! Its their Achilles heel.",
                "author": "newuser8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Federal ICE agents are in a tense standoff with anti-ICE protesters during an immigration raid on a cannabis farm",
        "score": 1304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just shoot them",
                "author": "PapaPepe"
            },
            {
                "raw_content": "If you're impeding law enforcement, you're not protesting - you're breaking the law. Off with their fucking heads!",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Pot (illegal at the federal level) being picked by illegals. You can't tell me that Americans wouldn't want to work on a pot farm.",
                "author": "orange_popcicle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Team Terminates Free Tuition For Illegal Migrants",
        "score": 1569,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Insane that was ever a thing",
                "author": "hondo1"
            },
            {
                "raw_content": "Next up, Drivers Licenses. 'hurr durr but they will drive anyway?!' then fucking arrest and deport. The DLs were handed out to them because of lack of deportation. No more. Deport.",
                "author": "bleeje"
            },
            {
                "raw_content": "Take away the gibs, and more and more will leave while fewer and fewer will arrive.",
                "author": "JoeBidensDementia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "My favorite part of being a \"conspiracy theorist\" is not having myocarditis.",
        "score": 765,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like when the \"news\" finally started to acknowledge the myocarditis risk and then started claiming it was all \"mild myocarditis.\" Which isn't a thing given the high mortality rate within 5-10 years after somebody contracts it.",
                "author": "FateOfNorns"
            },
            {
                "raw_content": "My sister had a full on massive heart attack at 48 that she barely survived. She was a marathon runner, worked out 4 days a week, ate healthy. She had a physical 2 weeks before where all her numbers checked out fine. She took the original Covid 19 shot as soon as it came out and 3 more boosters. Every day now she is walking on eggshells waiting for it to happen again and take her out. It’s sad and tragic and maddening and I worry about her all the time now. I don’t get any satisfaction that she is literally living on borrowed time. And she will never admit to me that those shots put her in this fragile place or that she regrets taking them - but in my heart, I know what I know.",
                "author": "Nellie_the_Beaut"
            },
            {
                "raw_content": "Or blood clots, or multiple other health issues that are mysteriously appearing.",
                "author": "LegendFang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. State Department prepares for \"mass layoffs\" as early as Friday — Semafor",
        "score": 1583,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Learn to pick crops.",
                "author": "HurtzLocker"
            },
            {
                "raw_content": "Veterans Affairs should be next. Tired of having to call 10 people who just send me to another phone number.",
                "author": "limenline"
            },
            {
                "raw_content": "And nothing will be disrupted",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Real Stagnation: 6 Years Of GeForce RTX 60 Class GPUs",
        "score": 248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2060 - > 5060 (6 year gap) 1080p Low/Medium: +69% 1440p Low/Medium: +71% 1080p High/Ultra: +56% 1440p High/Ultra: +60% I currently use a 2060 as a display adapter on my work PC because it is old and cheap lol",
                "author": "RealOxygen"
            },
            {
                "raw_content": "I did spot one error in the video. The 2060 MSRP was 350, not 300.",
                "author": "detectiveDollar"
            },
            {
                "raw_content": "3060 -> 4060 (by 1% lows for fun) 1080p Low/Medium: +15% 1440p Low/Medium: +13% 1080p High/Ultra: -2% lol 1440p High/Ultra: +2%",
                "author": "RealOxygen"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "eTeknix - RTX 5050 Vs RTX 3050 [30 Game Benchmark | 1080p, 1440p & 4K]",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: GPUs tested: Colorful RTX 5050 8GB Ultra W Duo OC Gigabyte RTX 3050 8GB 1080P Averages (30 games) mixed settings (including RT): RTX 5050 is 57% faster overall 1080P 1% lows (30 games): RTX 5050 is 63% faster overall",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arctic P12 Pro A-RGB: The Benchmark for Illuminated Fans",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am very interested to see both HWC and the cybernetics rating of the P14 Pro later. Also, once again, ARGB material seems to perform better acoustically in Arctic's fan designs.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "The reviews from this site have a ton of depth, but they really need sound clips every 100rpm to be complete imo. I don't think the frequency response analysis is enough to get a feel for how the fan will sound.",
                "author": "PhunkeyPharaoh"
            },
            {
                "raw_content": "I'd love to see some recordings of their measurements. They claim the NF A12x25 G2 outperforms the T30 noise normalized on rads. I have seen tests where it matches it, but outperforming is a little sus. Not a fan of these synthetic tests. They measure airflow to derive performance, instead of just measuring performance directly.",
                "author": "Healthy_BrAd6254"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fractal Design Momentum 14 RGB: Top-class in every aspect - HWCooling.net",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*whistles* When Fractal decided to do something about their mediocre fan problem, they didn't do half-measures. Trouble is, is it better *enough* compared to a An140 or that 140mm from Montech?",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "If you buy the Fractal Epoch, you get a free case with 3 fans",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "43 page review whaaaat.... Also... USBC internal fan whaaaat.... I feel like I've seen the future. (Incidentally I wonder if the USBC is the reason for somewhat higher power consumption)",
                "author": "EasyRhino75"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Get Ready for Arm SME: Coming Soon to Android",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this announcement but no core announcement lmao",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "I wonder if Qualcomm finally unlocks Armv9.2 capabilities on their chips since the Snapdragon 8 Gen 2. As far as I understand, the architecture is capable of it but Qualcomm locked them to armv8 standards. SME2 seems like a big deal. It would be especially bitter for the Elite, as that's a brand new powerful chip.",
                "author": "dampflokfreund"
            },
            {
                "raw_content": "Unless Zen 6 has any new instructions beyond the \"new FP16 instructions for AI/ML\" that was last seen on the roadmap leaked by MLID before the launch of Zen 5, AMD will be the only one left without matrix extensions in the upcoming generation of CPUs.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Will Desktop and Server motherboards ever switch to CAMM from DIMMs?",
        "score": 22,
        "text_content": "CAMM memory modules are closer to the CPU, and have shorter traces than both DIMMs and the SODIMMs they were originally designed to replace, meaning both lower power and lower latency. While the most obvious and the main intended advantage CAMM has over SODIMMs is being in a small form-factor, and power efficiency, which is most important for mobile devices. Lower latency matters for desktop and servers too, doesn't it? So, wouldn't going with the option with the lowest latency be the ideal? Obviously, the absolute lowest latency is something integrated on-package, like an X3D, or 2.5D HBM solution or ESRAM or EDRAM, but desktops, workstations and servers often need upgradeability and configurability. But CAMM provides both that modular functionality with lower latency compared to the traditional DIMM slot standard and form factor. I understand that it's newer and more expensive for now, but. Is it likely that at some point, say for DDR6 motherboards, that CAMM modules will replace DIMM slots?",
        "comments": [
            {
                "raw_content": "Mainstream Desktop? Likely not until cost come down significantly and availability is similar to dimms but even then i think it will take a long time unless it becomes the only supported option on DDR6 platforms.However, in OEM systems and the like i could see it being popular. Servers i wouldn't think so because it takes more horizontal space meaning you likely wouldn't get the same density in mainstream server as with dimms. Saying that there is a variant - [SOCAMM](https://www.tomshardware.com/pc-components/ram/micron-and-sk-hynix-unveil-lpddr5x-socamm-up-to-128gb-for-ai-servers) that is being used in the upcoming Nvidia Grace servers so it might be popular in those kinds of systems.",
                "author": "Kayant12"
            },
            {
                "raw_content": "I figure if we do see CAMM2 on desktop, we’ll see it with DDR6 first (not counting DDR5 prototypes shown at Computex and the like). I suppose when AM6 is announced and detailed, that’s when we’ll know. Same with Intel, for whichever socket of theirs ends up using it.",
                "author": "greggm2000"
            },
            {
                "raw_content": "I expect CUDIMM before CAMM at consumer/prosumer space.",
                "author": "Zoratsu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX 3060 Ti vs RX 9060 XT 16GB- Is the upgrade worth it?",
        "score": 14,
        "text_content": "Tldw; the $360 9060xt is %31(actually %49 in RT) Faster than the (~$250 used) 3060ti",
        "comments": [
            {
                "raw_content": "Maybe that's on me but when I upgrade I want much more than 30% more performances. My path over the years has been 750 TI -> 1070 -> 5070 TI I guess the only reason for such an upgrade would be to avoid VRAM bottleneck",
                "author": "AntonioTombarossa"
            },
            {
                "raw_content": "Went from a 6600 to a 9060xt 16 Gb it's an amazing jump for 350€. Got the Saphire Pulse, runs cool and smooth as butter for 1440p. I'd gone for the rx 9070xt but tha is on the 750€ ballpark and makes nonsense if its not 4K. 5070ti is interesting too but I prefer ti spend hard money on my kids education.",
                "author": "dsinsti"
            },
            {
                "raw_content": "ATI Rage Pro -> Voodoo 3 -> GeForce 4 Ti -> Radeon 9600 Pro -> GeForce 6800 GT -> Radeon HD3850 -> Radeon HD4870 -> GTX 275 -> HD 7870 -> R9 280X -> GTX 970 -> GTX 1080 Ti i486 -> Pentium 2 -> Pentium 4 -> Athlon XP -> Athlon 64 X2 -> Phenom II Black Edition -> FX 8350 -> i7 4790K -> R7 5800X Honestly every single upgrade was huge in one way or another and hardware never felt like it was stagnating until the last 5 years. Hence the reason I really haven't bothered upgrading anything. I don't really play very many new games and the ones that I do run great still.",
                "author": "exomachina"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "yeah I think i’m happy with low traffic density",
        "score": 116,
        "text_content": "lol",
        "comments": [
            {
                "raw_content": "Sometimes I'm like man there used to be more cars on PC and others I'm like, wow, I can drive without causing a 70 car pile up🤣",
                "author": "GodlikeT"
            },
            {
                "raw_content": "again not sure why the audio is chopppy post upload 🤷🏾",
                "author": "Time_Substance_7829"
            },
            {
                "raw_content": "As someone who is playing Switch 2 version as their first time playing this game, I don’t even know what I’m missing with less cars and/or NPCs in the map.",
                "author": "Excaliburn3d"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I freaking LOVE this kickstand!",
        "score": 315,
        "text_content": "Seriously lol look at this lol",
        "comments": [
            {
                "raw_content": "Absolute madman",
                "author": "Luso__"
            },
            {
                "raw_content": "it's been 3years these things are still not out of my head",
                "author": "PeeHeirGasly"
            },
            {
                "raw_content": "It's everywhere, the image is too SUSpicious",
                "author": "Medium_Perception_52"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "i like the new kickstand",
        "score": 162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s certainly a Choice lol",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Thanks I hate it",
                "author": "__TheWaySheGoes"
            },
            {
                "raw_content": "Finally a picture of someone using the stand the way it was intended. Props OP",
                "author": "xXbrokeNX"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you have Cyberpunk, it can help with HDR calibration",
        "score": 99,
        "text_content": "Cyberpunk's HDR settings are half controlled by the system (which is why the sliders are greyed out). But what's useful is it gives you an exact number for NITS that you can use to configure your HDR, providing you know the specs of your TV. My Sony Bravia only goes to 600 NITS. When I just used the system settings to adjust HDR, Cyberpunk reported 1000 NITS, and everything looked a bit washed out. Running the game, I adjusted the HDR in system settings and kept checking until I got to the right number in Cyberpunk. Everything looks much better now. But as you can see, the system settings still show the right sun as clearly visible. My TV doesn't support HGIG. I figured I'd just share this in case it helps anyone else out.",
        "comments": [
            {
                "raw_content": "This is interesting because I am thinking of buying the game.",
                "author": "ToonAdventure"
            },
            {
                "raw_content": "Aren’t you suppose to adjust the brightness in the next page to compensate the brightness, while keeping the right sun invisible?",
                "author": "ghim7"
            },
            {
                "raw_content": "I could have sworn someone mentioned there is a free game that also provides this information. Fortnite? Rocket League?",
                "author": "ConflictPotential204"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Yeah, it’s immensely simple, but this RDS case gets the job done (for a good price too)",
        "score": 67,
        "text_content": "Top and bottom of it of the case is firm, it looks decent, and is fairly cheap ($19.99 US) - of the four switch 2 cases I have tried, this one is both the cheapest and yet ironically the one I like most. My only “complaint” is that there’s a tiny bit of extra space that allows the switch to move a tiny bit side to side while inside the case. I don’t think that it’ll harm the switch, though.",
        "comments": [
            {
                "raw_content": "much better than the over priced official nintendo case and you have better protection...",
                "author": "redditej86"
            },
            {
                "raw_content": "where did you find this case? i have the same exact one for my original switch and want to get the matching one for my switch2!",
                "author": "galoombapile"
            },
            {
                "raw_content": "I got the traveler version of this that fits the dock/pro controller and the power adapter. It’s amazing!",
                "author": "Urangatanga"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "System Shock 2: 25th Anniversary Remaster. I watched a review saying all video capture was on Switch 2 and that it plays great. This released today for $29.99 USD on eshop. Anyone try this yet?",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was excited to pick this up, but the controls feel so stiff and sluggish no matter what settings I change. No adjustable gyro sensitivity, either. There seems to be some forced controller acceleration that makes me motion sick and the gyro aiming seems almost unresponsive. Oddly enough, the Steam Deck analog+gyro combo works great, but that’s not the thing I want to pack with me. :(",
                "author": "TheIndecisiveBastard"
            },
            {
                "raw_content": "[Game review from Nintendo Life. Says video capture for the review was all on Switch 2.](https://m.youtube.com/watch?v=gbGX-nnXc-E)",
                "author": "pavoid"
            },
            {
                "raw_content": "I've been critical about Nightdive's very basic and often i consistent gyro implementation, but they were consistent in having a sensitivity slider (although the range varies).",
                "author": "IcyXzavien"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[SPOILER ALERT] Looks like an internal Krafton doc on Subnautica 2’s development just leaked",
        "score": 108,
        "text_content": "[https://imgur.com/a/lXgAdej](https://imgur.com/a/lXgAdej) Spotted this over on r/Subnautica_2: someone dropped what they claim is a leaked internal Krafton document detailing the current state of Subnautica 2’s development. The leaker writes, [“This clearly shows the state of the development progress and why Krafton and the Subnautica team disagreed on the release schedules.”](https://www.reddit.com/r/Subnautica_2/comments/1lwyorm/a_leak_from_a_credible_source_regarding_the/) **Heads-up** — authenticity is unverified and the post contains potential content spoilers (features, timeline, etc.). If you care about going in blind, you might want to skip. As always, take everything with a grain of salt until there’s official word. Thought you all would want the heads-up regardless.",
        "comments": [
            {
                "raw_content": "If this is true, I wouldn't be surprised if this leak is intentional. This adds a lot to the narrative that Krafton established.",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "It's insane how unprofessional this has been but it is even crazier that Krafton was probably right",
                "author": "ManateeofSteel"
            },
            {
                "raw_content": "I mean if the game is missing 1/3rd or so of the planned content for early access launch, it SHOULD be delayed. It’s literally not where it needs to be.",
                "author": "SoWrongItsPainful"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to this 3d Artist, Plants vs. Zombies 3 has been canceled",
        "score": 220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna be honest, I saw the development of PVZ3 pretty close. I'm surprise it takes these long to canceled, I mean the project has pass an Development Reboot 3 times at this point, and even fangames Ideas they try to copy. But is kinda sad being a Fan of the Franchise and see that's probably newer gonna have a new PVZ following the original formula except a Big Update for PVZ2 I guess...",
                "author": "Educational-Arm-7384"
            },
            {
                "raw_content": "Everything is getting canceled or downsized or both Welcome to the crappy future",
                "author": "deathbysnoosnoo422"
            },
            {
                "raw_content": "For the best. It would have been like the sequel which was built around microtransactions. It would have been live service slop. And I hate that word. But I hope the devs rebound quick. I don’t want anyone to lose their jobs. With that being said, make a new garden warfare game that ISNT live service. Or a PvZ game that’s more in the spirit of the original. But of course that won’t happen. God forbid someone makes a good mobile game that isn’t filled with MTX.",
                "author": "Greatsnes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Mike Straw of Insider Gaming: “A source close to the EA and Madden negotiations told me that they have agreed to a new exclusive licensing deal for years to come.”",
        "score": 97,
        "text_content": "Here is the source: https://youtu.be/MbTM8Dhe4Rw?feature=shared Also it’s possible that we will hear an announcement of the sorts by the end of this year as well.",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "![gif](giphy|8OZbSVXFk4rpCSxVsi)",
                "author": "BrianIsGucci"
            },
            {
                "raw_content": "Also going to note, he claims ea doesnt actually care for exclusivity but that the nfl pushed for them to agree to it.",
                "author": "Kyro_Official_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Rebs Gaming the Halo CE remake will likely be campaign only. Updates on other projects.",
        "score": 491,
        "text_content": "According to this, his sources say they have not heard anything about the multiplayer being done for the CE remake. They also haven't heard anything about Halo Infinite being ported to Playstation. He responded to a post by gruntAPI. GruntAPI says the Project Ekur (rumored multiplayer project possibly a BR but more likely an ES) internal ID has been regularly receiving updates every 6 or so hours for the last few days. https://youtu.be/bmHVUVZJKiI?feature=shared",
        "comments": [
            {
                "raw_content": "This wouldn't be a surprise. CE Anniversary's original release didn't have the multiplayer, instead having access to Reach's multiplayer on some remade maps.",
                "author": "Coolman_Rosso"
            },
            {
                "raw_content": "For the best if we really HAVE to have a CE remake. No reason to do it when MCC is right there and H2AMP was never that popular. I'd rather them just use what resources they have on the single-player.",
                "author": "failingwinter"
            },
            {
                "raw_content": "This doesn’t surprise me after CE Anniversary Edition was campaign only and 2’s remake only had a small multiplayer remake since it was part of the Master Chief Collection.",
                "author": "KarateKid917"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The ‘Online Migration’ option is now visible on the Rockstar Support website for Red Dead Online.",
        "score": 334,
        "text_content": "You will need to file a [ticket](https://support.rockstargames.com/request/reddeadredemption2), where you will need to go under the Online play support and there you will find this. This generally exists for issue related to transferring your online account from previous gen to current gen and could be the same coming for Red dead online for current gen consoles. Once again kindly take this like a grain of salt. Discovered by an user [in r/reddeadredemption](https://www.reddit.com/r/reddeadredemption/comments/1lwigcz/the_online_migration_option_is_now_visible_on_the/) Edit - I filed a ticket and am awaiting response whether this is a glitch or not (hopium). Edit 2 - The response was pretty generic customer service Thank you for contacting us back. We truly appreciate your interest in our games! While we currently don't have specific information to share on this topic, our main focus is on assisting players with technical issues. For the latest updates on our titles, we encourage you to follow @RockstarGames on Twitter and visit https://www.rockstargames.com/newswire. Please feel free to reach out to us in the future if you encounter any technical issues with our games. We're here to help! Best regards, Edit 3 - The option has been removed now.",
        "comments": [
            {
                "raw_content": "PS5/Xbox Series Upgrade confirmed. GTA 5 had the same option when Expanded and Enhanced released.",
                "author": "ZXXII"
            },
            {
                "raw_content": "That feels pretty substantive!",
                "author": "fortnite_pit_pus"
            },
            {
                "raw_content": "![gif](giphy|H8x6jZhgVvk3o3DeyZ) a next gen update might finally cure my lumbago",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Titan project of Striking Distance from the creators of Callisto Protocol appears to have been canceled.",
        "score": 265,
        "text_content": "https://imgur.com/a/47vAAzX The studio was working on AAA multiplayer, it is unknown if this was the project",
        "comments": [
            {
                "raw_content": "Welp…… RIP striking distance I guess",
                "author": "Dr_Mantis_Trafalgar"
            },
            {
                "raw_content": "Between Ensemble, Blizzard and others, Titan seems to be a truly cursed codename…",
                "author": "Com_Raven"
            },
            {
                "raw_content": "Call game development Zeus the way every time a project named Titan shows up, it dies",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Unlisted video from Inti Creates shows new game, Majogami coming to the Switch and Switch 2.",
        "score": 155,
        "text_content": "https://youtu.be/BIttiV9n06Y?si=ZhmOa8O_shT4EuPi Interesting that they seem to have a Switch 2 devkit, which makes sense since they basically did support the Switch since the beginning with Blaster Master Zero releasing the week after the Switch. Also taking a similar route to Marvelous with their Switch 2 physical copy looking to be fully on cart but will cost more than the Switch 1 copy.",
        "comments": [
            {
                "raw_content": "The video description includes a link to a nonexistent Steam store page (as well as a nonexistent Majogami.com), despite the video not seeming to mention anything outside of Nintendo. This is consistent with Nintendo Direct trailers (and other trailers that are posted directly to Nintendo's Youtube channel), which never mention being released on other platforms. At the very least, this suggests the game may not be Nintendo exclusive, but it may have been put together for an upcoming Direct (although it'd likely be relegated to a sizzle reel, especially if there's no English version like the Trails in the Sky remake trailer).",
                "author": "SocranX"
            },
            {
                "raw_content": "Nintendo likely gives priority to Japanese companies when distributing development kits, as there's a lower risk of leaks compared to overseas companies.",
                "author": "EnoughDatabase5382"
            },
            {
                "raw_content": "Reminds me a bit of Muramasa",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel CEO says it's \"too late\" for them to catch up with AI competition — reportedly claims Intel has fallen out of the \"top 10 semiconductor companies\" as the firm lays off thousands across the world",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is just sad...",
                "author": "Havarem"
            },
            {
                "raw_content": "I don’t really see how he expects prospective customers to hear that and think “let’s commit massive sums of money to Intel products/foundry”. Say what you will about Pat, but A) he thought what Intel was making was cool (it is), and B) he knew when Intel was firing on all cylinders they are the best in the world at what they do. Cut jobs do whatever, but with the debatable exception of Samsung, no other company on Earth can be an IDM at the leading edge.",
                "author": "JRAP555"
            },
            {
                "raw_content": "Pat is looking like the better ceo everyday. You never say this part out loud. He just killed their ai accelerators before they had a real chance to get going. Intel has struggled to find a good CEO for over 15 years now. Pat was the closest we ever got. Intel’s customers have lost confidence in their execution. You don’t bad mouth the products more than",
                "author": "laffer1"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel’s CEO: ‘We are not in the top 10’ of leading chip companies",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel doesn’t need to compete with Nvidia. They have Battlematrix in Arc Pro GPU’s that are affordable. Is this new CEO intentionally sabotaging Intel? All Intel needs to do is execute on the current path and make Battlematrix and Arc Pro GPUs abundant and affordable, and their market will grow fast. DIY and startups have waited a long time for a Pro GPU line that is affordable. Why can’t Intel just focus on that ? Only a handful of tech monopolies can afford Nvidia’s insane AI GPUs.",
                "author": "quantum3ntanglement"
            },
            {
                "raw_content": "Adblock blocking = no click. Headline was good enough, thanks :)",
                "author": "subwoofage"
            },
            {
                "raw_content": "He’s stating the facts he’s also not saying that they don’t have the potential to become ______ in whatever area in the future 🙃 hopeful",
                "author": "Fun-Dinner-2562"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel’s Foundry Pivot: Why 18A’s Strategic Retreat Signals a Make-or-Break Moment",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it is becoming increasingly clear why Gelsinger got booted from Intel. For 18A, it seems like the just Intel products itself esentially is able to justify building out the new node (as well as burning a bunch of money that Intel had), however that isn't really the case for 14A. Intel all but directly said they won't bother building out 14A if they can't get external customers. So realistically, 14A, or at best maybe the node after that, is where Intel *needs* to get whale customers and deals for their nodes, otherwise significant structural changes would have to be made. I also want to point out, this article claims that 14A seemingly has better reception than 18A, but their justification of it - multiple customers expressed interest- is *exactly* what happened with 18A too. There's nothing suggesting this, IMO.",
                "author": "Geddagod"
            },
            {
                "raw_content": "Please stop posting low grade AI-generated spam across multiple subs and calling it “insight”.",
                "author": "jontseng"
            },
            {
                "raw_content": "What confidence do potential customers have that Intel will deliver on time? After delays of 10nm, 7nm/Intel 4 and cancellation of 20A, potential customers are right to be concerned. Imagine if customers (i.e. Apple) can’t get their products (i. e. iPhone) out on time because of Intel’s delays.",
                "author": "mockingbird-"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "MAXSUN preparing all-Intel Mini Station: up to Core Ultra 9 285HX and two Arc Pro B60 GPU",
        "score": 21,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish that they just added way more memory instead of messing around with dual GPU",
                "author": "sub_RedditTor"
            },
            {
                "raw_content": "This is some good news after the layoffs Hopefully, the Arc DGPU Division didn't get cut too deeply and that there's still gaming Xe3 Arc cards and Arc Pro cards in the pipeline Insane that Lip Bu Tan would gut so much of the workforce The board must've been itching for layoffs after firing pat or Lip Bu Tan might think this is how you save Intel. Either scenario is bad. Deep across the board cuts like this is how you destroy a company as talented people and lazy underperformed are caught in the dragnet. Irreplaceable talent will go to companies with better stock options, 401ks and compensation like Nvidia, AMD Qualcomm, ARM, Apple. The board and Lip Bu Tan are fools for thinking this is a good idea.",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "Seems like a decent option for a low power PC",
                "author": "bizude"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel releases new Arc PRO graphics drivers, with no sign of Battlemage",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am also questioning why is Intel still focusing so much on battlemage when celestial is supposed to be just around the corner. It feels more and more like Lip bu tan axed Celestial.",
                "author": "No-Relationship8261"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Sampling Next-Gen Ryzen Desktop \"Medusa Ridge,\" Sees Incremental IPC Upgrade, New cIOD",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Dual memory controllers, potentially lower latency between I/O and CCD, higher SRAM and core count per CCD, a move to TSMC N2, minimal improvements to IPC. Makes sense. Higher IPC almost always requires more logic and it seems like AMD would rather squeeze more cores than IPC into the Zen 6 CCD, which is fair. You can't have both, unfortunately, at least not when you're trying to push the core count by 50% in a given die area. Besides, we have been stuck with hexa-cores and octa-cores long enough. I, for one, would love to see a Ryzen 5 with an octa-core cluster. Unfortunately, an octa-core Ryzen 5 would be very bad news for Intel. As much as I resent Intel (hate is a rather strong word), I want them in the game, all for the sake of fair competition.",
                "author": "GenZia"
            },
            {
                "raw_content": "Doesn't seem like there is a big clock increase coming, so I would hope there is at least a moderate IPC increase since the Zen 4 to Zen 5 single core jump was extremely minor. Still, an increase in cores is long overdue at the point, and the extra cache should give something in terms of IPC.",
                "author": "jedidude75"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD's Epic Performance Gains From The Original EPYC 7601 To EPYC 9755 / EPYC 9965",
        "score": 21,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "More homeowners are pulling listings as housing market cools",
        "score": 229,
        "text_content": "According to new data from Realtor.com, delistings surged 47% in May compared to a year earlier.",
        "comments": [
            {
                "raw_content": "Saw a home listed last fall and pulled off the market after dropping the price by $25k and no one bit. Relisted a little over a month ago for the same original price and recently dropped it $25k again. Still sitting. I guess they were hoping summer would bring more willing buyers. And of course Redfin deleted all of that and makes it look like a new listing.",
                "author": "falling_knives"
            },
            {
                "raw_content": "House delistings are a sign of housing market distress. For example, delistings increased from 40k to 160k from 2005-2008.",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "That's cool. Have fun holding onto that thing you apparently don't want for a year.",
                "author": "savetinymita"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Sales Fall as U.S. Home Prices Hit Another Record High",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many sellers are doing the exact opposite of what basic market cognizance would dictate. When it’s not selling you lower the price. “Hmm, nobody is buying my house. I think I’ll raise the price.” The 2020-2023 bubble has created a class of homeowners who simply refuse to accept that their investment is not going to yield a 40% return. The only people with the sense to lower the price in the face of sagging demand are the ones who HAVE to sell. The others are going to try and drag out this game where they list, delist, rent, relist, etc. on the bet that interest rates will come down in time to salvage this house of cards they’re betting on.",
                "author": "muffledvoice"
            },
            {
                "raw_content": "Not surprised. Prices hit a new high because it's the upper segment of the market that is moving. People with a lot of cash, stonks, and crypto who don't care that they're overpaying. Everything else seems to be sitting. I've heard from a lot of sellers on these forums \"If it doesn't sell for INSERT PEAK 2022 PRICE HERE, then I'll just hold on to it.\" My question is, why list it at all then? 99% of them aren't going to sell it for their aspirational price. Why do they want random people parading through their house? Most of them are just curious, and have no intention of even considering it, at least not at those prices.",
                "author": "JWaltniz"
            },
            {
                "raw_content": ">Pending sales fell 3.5% year over year during the four weeks ending July 6. That was the second biggest decline since early February, trailing only last week’s 4.1% fall. **The median U.S. home sale price hit a record $399,633, up 1% year over year.** Redfin a week ago: > \"Median sales price hit $400,125, an all time record.\" https://www.redfin.com/news/housing-market-update-new-listings-post-first-decline-six-months/ So which is it?",
                "author": "Ambitious-Acadia3123"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Hoomer big time insulted despite having 0 other offers.",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are some sobering comments in that thread, while the rest are complete circle jerk. They live in a rural area, no sold comps to speak of. Looks like the price is based on vibes because other houses are listed at 150k+, and there are things wrong which need fixing. They are on their second agent for various reasons and had no offers for 74 days. Delulu...",
                "author": "Borealisamis"
            },
            {
                "raw_content": "Seller going thru stages of grief in a softening market...",
                "author": "ChadwithZipp2"
            },
            {
                "raw_content": "That guy is a total asshat. It’s obviously overpriced",
                "author": "JLandis84"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Jobless claims fall to nearly 2-month low. No sign layoffs have risen due to trade wars.",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "EDD ended. People are still jobless for over 6 months.",
                "author": "Chigibu"
            },
            {
                "raw_content": "When benefits run out, you just disappear from Government numbers.",
                "author": "Adorable_Tadpole_726"
            },
            {
                "raw_content": "Two things: Trade Wars start again August 1st. Layoffs are happening because companies are using AI to handle tasks like Customer Service and Sales. It's almost impossible to actually speak to humans now on the other end of the phone, and it's only getting worse. ATT fired staff last month: [https://www.chieftain.com/story/news/2025/05/06/pueblo-att-call-center-that-once-employed-nearly-500-to-close/83412773007/](https://www.chieftain.com/story/news/2025/05/06/pueblo-att-call-center-that-once-employed-nearly-500-to-close/83412773007/) [https://www.al.com/news/2025/06/telecommunications-giant-laying-off-73-in-alabamas-largest-city.html](https://www.al.com/news/2025/06/telecommunications-giant-laying-off-73-in-alabamas-largest-city.html) Part of an ongoing series of layoffs ATT is doing as they both outsource and onboard AI assistants. I know of layoffs that happened to my friends at Altice USA recently, and all I'm going to say is: Sorry if you have service from them... they're firing NOC personnel and have 0 plans on what to do with the loss of Sweat Equity - and no... the leaving Employees are not documenting SOPs as they leave (This was an actual request from their management! \"Please document your processes before you leave\". My old co-worker stated he would do so and save it as a blank document).",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Truth-maximizing Grok has to check with Elon first",
        "score": 1796,
        "text_content": "Apparently Daddy Elon's opinion must be taken into account, before telling you what the truth really is",
        "comments": [
            {
                "raw_content": "The ultimate strategy for being unbiased: \"Now what would I say if I were Elon Musk...\"",
                "author": "NodeTraverser"
            },
            {
                "raw_content": "Holy fuck, dude is literally mandating Elon Musk thought.",
                "author": "etzel1200"
            },
            {
                "raw_content": "Holy shit and to think some of you try to say Sam is just as bad as Elon [Here’s a Twitter thread about this](https://x.com/jeremyphoward/status/1943436621556466171?s=46) (pretty funny reply from Google DeepMind senior researcher Shane Gu lol) https://preview.redd.it/ntb7jjmvu4cf1.jpeg?width=1290&format=pjpg&auto=webp&s=dede48dbc263d123f513e6e990c6e1de6e054430",
                "author": "MassiveWasabi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 may be cooked",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not really. I’m more interested in real-world use cases and actual agentic capabilities, that’s way more of a game changer than all the constant benchmark dick-measuring contests.",
                "author": "Beeehives"
            },
            {
                "raw_content": "Hm. Is it the similarly \"heavy\" version of GPT-5 (with multiple agents running in parallel, high compute etc) or is it the basic GPT-5? If it's the former, I'm dissapointed, if it's the later, I'm impressed...",
                "author": "ectocarpus"
            },
            {
                "raw_content": "This could be pretty impressive considering grok heavy is behind a $300 paywall and is multiple models voting. If OAI doesn’t follow that for GPT-5 and it’s a single model in the $20 subscription, and it’s still better than Grok heavy, that’s pretty darn impressive.",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok Checking Elon Musk’s Personal Views Before Answering Stuff",
        "score": 229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Elon/Grok\"",
                "author": "swarmy1"
            },
            {
                "raw_content": "Elon is such an embarrasment.",
                "author": "thebipolarironman"
            },
            {
                "raw_content": "I see you posted this in /r/grok too. Hilarious how they “can’t see” what you mean.",
                "author": "mysticpawn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "These devs built an LLM for their AI game",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These kinda of interactive real time games could be on the horizon",
                "author": "BitterAd6419"
            },
            {
                "raw_content": "I feel like the key for having this kind of thing work would be not having your character as the central role in a story. It's too constraining. It would just be much cooler to have the world going through a story that you can engage in or not and which progresses independently of whether or not you choose to engage. That would create the real space for engaging with integrated LLMs, making it possible to just watch the world unfold while you chat on a hillside or form your own random group of bandits or whatever. It should be true open world with open possibilities where other characters can think, act, and choose for themselves too.",
                "author": "AGM_GM"
            },
            {
                "raw_content": "you mean they built an LLM onto their game? there is no way they build an LLM FOR their game. Best case its a fine tune, worst case its just another LLM connected through an API with a bunch of system prompts",
                "author": "Tricky_Reflection_75"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How we treated AI in 2023 vs now",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the classic scene of Whiplash https://youtu.be/b9ilXLsz0KE",
                "author": "CXgamer"
            },
            {
                "raw_content": "Lmao",
                "author": "Super_College_100"
            },
            {
                "raw_content": "From the Movie Whiplash",
                "author": "DeWitt-Yesil"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I went to YouTube to find out more about the ban on AI and low effort vids.",
        "score": 134,
        "text_content": "This is what came up in the search.",
        "comments": [
            {
                "raw_content": "The concerned hand lean works for every occasion..",
                "author": "MysteriousPepper8908"
            },
            {
                "raw_content": "Most social platforms are researching ways to curb easy content. They're saturated with shitty SFV and retention is dropping. Tbh, it's been overdue and I'm living to see it come to pass.",
                "author": "mashukun_OS"
            },
            {
                "raw_content": "Thats high key funny af",
                "author": "Outrageous-Deer7119"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4 LiveBench results",
        "score": 323,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So not that good at coding then? Just good at reasoning and maths?",
                "author": "BarisSayit"
            },
            {
                "raw_content": "makes sense it's giving me some really impressive stuff related to advanced reasoning and some weird contextual stuff to everyday happenings coding wise sonnet is clearly better, but i'm eager to see their coding-specific model in a month",
                "author": "Mysterious-Talk-5387"
            },
            {
                "raw_content": "this is pretty much just a coding bench. they are releasing their coder next. this is also one of the worst benches out there. it has 4o being one of the best coders in the world. the coding average and agentic coding average throw the entire benchmark off. remove those 2 and you get a better idea of how good a model is.",
                "author": "BriefImplement9843"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok 4 is the best on long context overall, Gemini 2.5 Pro edges out on 192k.",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why don’t they have a 1M limit in this benchmark? I’d be super curious to see how Goog and OAI perform in their claimed max context limits (well, 2M for Goog).",
                "author": "yung_pao"
            },
            {
                "raw_content": "How is it best overal when Gem beats it at the longest and O3 beats it at all the other spots except over 60k? It looks like the models are too close to call a clear winner. O3 for under 60k Grok for between 60k and 120K Gemini for over 120k",
                "author": "Tkins"
            },
            {
                "raw_content": "That eval is extremely noisy. They have the same model (gemini) giving very different scores",
                "author": "Actual_Breadfruit837"
            }
        ],
        "subreddit": "singularity"
    }
]