[
    {
        "post_name": "🚽 We literally have a mentally ill 𝐌𝐀𝐍 passing laws in Congress who dresses up as a woman and does photoshoots in the women’s bathroom...",
        "score": 573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> We are all just people trying to pee in peace... ...and a fucking man walks into the women's bathroom and starts taking pictures. Suddenly they can't pee anymore. They just want to get out of there asap.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "use a urinal, faggot",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "instagram face filter too lol!",
                "author": "GoodvsEvil2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After years of resistance, some defenders of the filibuster are coming around to the idea that it should go.",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean the author isn't wrong. Most of the stuff we have been forced to endure these last few decades were by EO and other executive action since congress has been deadlocked on any sane legislation due to one side never having enough votes. Here is the kicker though. If its nuked then it will have to be nuked NOW and then the Rs need to just codify everything the damn the optics. But for that to happen means the ~public~ is going to have to light fires under their reps. Not just come here or on social media to bitch but send in letters and make phone calls and organize street level protests.",
                "author": "SquiggyMcPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the core of the Epstein case. It's why he knows intelligence people from all over. It's also why they can't release the files.",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR he did financial fiddling for the CIA as far back as 1978. Worked with a CIA bank. Handled CIA money at Bear Stearns. It's why he's connected to multiple intelligence agencies. He was the money guy for CIA operations. Did complicated deals to obfuscate money flow.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "The vid's not playing for me here, but it's a link post so clicking on the title of my post, or \"MAGA Kitty\" will take you to the post on X.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "You still talking about Epstein? /s",
                "author": "TruculentGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roseanne Barr just said COVID only came to the U.S. so Democrats could use mail-in ballots to steal the 2020 election. \"Everybody in this country cheated us out of our President in 2020.\"",
        "score": 1367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, if anyone had told me in 1988 that Rosanne Barr would be way more attractive -- physically and emotionally -- than Madonna in 2025, I would have thought they were nuts. But here we are.",
                "author": "Jack_NC"
            },
            {
                "raw_content": "Covid was a fake and gay seasonal flu. The only people who died \"from it\" would have died anyway",
                "author": "DingleBalls"
            },
            {
                "raw_content": "\"America will fall if they turn their back on isreal\" - Roseanne Barr",
                "author": "GoodvsEvil2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali Sheriff Says Now That We've Been Hired, It Means We're Working for Our Own People",
        "score": 503,
        "text_content": "",
        "comments": [
            {
                "raw_content": "deport that county",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Why hadn't he been taken into custody and deported?",
                "author": "Overtaxed"
            },
            {
                "raw_content": "How much proof do you need that these animals are poison? Just deport all of them and they can pretend to work for their own people there.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan to Begin Importing U.S.-Made Toyotas Following Talks With Trump",
        "score": 844,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From the man that sold rice to Chiyna. Love it.",
                "author": "chicagoindustrial"
            },
            {
                "raw_content": "He talked about Japan ripping us off over a decade ago on Oprah Winfrey saying we import their cars here and they won't import ours without massive tariffs if at all. Talk about Making America Great Again.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "I just want a Hilux. I don't care if it's a Japanese car made in the US sold in Japan then re-imported with the steering wheel switched over and back again.",
                "author": "utfanx2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Complete blackout hits parts of San Francisco due to power outage",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uh oh, how will people avoid stepping in poop in that city now?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "This headline brought to you by the department of redundancy department.",
                "author": "CLF3"
            },
            {
                "raw_content": "Is that storm even there yet? That'll be fun when they get 10 inches of rain.",
                "author": "Awan-CIA-Car-Lot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Customs and Border Protection: African Traveler Caught With “Primate Meat” at Chicago Airport",
        "score": 798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cannibalism is not okay.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "the biggest problem with any type of immigration is people don't assimilate to this country. Have you been near africans near summer time? They don't wear deodorant. No one want's to smell that nasty ass BO during a hot summer day.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "I think that’s what Hillary called her trafficked Haitian children.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This Christmas, our hearts grow as our illegal population shrinks!! Based!! MAGA 💯",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm dreaming of a **White** Christmas. Just like the ones I used to know.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Our last chance to fight back against replacement of the population. And overthrow of the constitution (which is the real goal).",
                "author": "NotYourMan"
            },
            {
                "raw_content": "On the twelfth day of Christmas, President Trump gave to me 12 major trade deals 11 drug boats blown up 10 CECOT dropoffs 9 NGOs defunded 8 wars ended 7 food dyes banned 6 tax cuts passed 5 RARE PEPES! 4 more years 3 nuke sites busted 2 million deportations And a libtard REEEEing in a MAGA tree",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Desperate libtards are posting a photo of Trump and his daughter Ivanka as being part of the Epstein files.",
        "score": 1108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link to retard https://x.com/keithedwards/status/2002430370206433384?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Dad sitting with his daughter? tHaT iS tOtaLly uNaCcePtaBle!",
                "author": "CatalystForChange"
            },
            {
                "raw_content": "The retard levels are off the charts. If. They. Had. Anything. They. Would. Have. Used. It.",
                "author": "LostElf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tinfoil Haturday: Was Rob Reiner a Deep State Spook? Roll the Tape...",
        "score": 809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, seeing that his posts stopped when usaid was cut. I’d say, absolutely.",
                "author": "Greenhills"
            },
            {
                "raw_content": "Now do U2/Bono, Sean Penn, George Clooney, Ben Affleck, Matt Damon",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Castle Rock co-founder with CIA board members.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why is nothing happening regarding the stolen 2020 election?",
        "score": 1408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One word... Pam.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "we knew these things in 2020 as it was happening and it didn't matter then...",
                "author": "twentytwentyfourr"
            },
            {
                "raw_content": "Because the country is fundamentally broken and will never get fixed because there is no social trust or cohesion. Diversity was our death. The only thing to do now is to let it fail and start over with lessons learned at the forefront of a new constitution.",
                "author": "DepartmentOfOffense"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Climate change\"",
        "score": 1364,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only a piece of shit communist that wants as many dead as possible would say that.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Translation: We need to price small farms out of the competition so Bill Gates can have another monopoly.",
                "author": "utfanx2"
            },
            {
                "raw_content": "\"Can I get me a hunting license here?\".",
                "author": "RocketSprocket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HAPPY BIRTHDAY UNITED STATES SPACE FORCE",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115753614039585949",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Space Force! Make the moon the 51st State! https://media1.tenor.com/m/NP8l78cq2kkAAAAd/space-force-astronaut.gif",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Biden stuffed Space Force with tons of trannies like he did the military. Did they fix that problem yet?",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The mayor of Lawrence, MA, a once prominent manufacturing town that is now overwhelmingly Hispanic, needs a translator in court.",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He should be \"translated\" to Mexico. One-way ticket.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "All government business must be in English. Obviously this includes all legal processes.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Foreign born people should not have ANY government job, not even fucking garbage man. If I had my way their children wouldn’t be eligible either, maybe we can allow their grandchildren.",
                "author": "NazisWereSocialist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: Trump Endorses Gives Endorsement for New York Governor After Elise Stefanik Drops Out of Race – “BRUCE BLAKEMAN WILL NEVER LET YOU DOWN!”",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so is Blakeman on the AIPAC payroll or not? seems to be the trend",
                "author": "flashersenpai"
            },
            {
                "raw_content": "Stefanik was a MIGA israel first candidate, hopefully this one will be better.",
                "author": "machilec21"
            },
            {
                "raw_content": "REVOKE VIVEKS ENDORSEMENT NOW",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The US has seized sanctioned Chinese shadow vessel CENTURIES, which was moving \"illegal\" Venezuelan crude. Under Panama flag",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck the Red Chinese.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Yay more oil for us?",
                "author": "shadypollster"
            },
            {
                "raw_content": "China is asshoe",
                "author": "cyberwar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rudy Giuliani was ruined by the Dems for calling them out on the stolen 2020 election in Georgia.",
        "score": 1991,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll put him in a hole before they make him whole.",
                "author": "TDAF"
            },
            {
                "raw_content": "And Ruby Freeman is prancing around with a Presidential Medal of Freedom for stealing the state for Biden. But nobody is above the law, though.",
                "author": "MythArcana"
            },
            {
                "raw_content": "If he was my friend, like he was DJT's friend, he would have a high paying position in my administration that I would have created new cabinet position especially for him, like an 'election integrity leader' for the next federal election we have. Our country was stolen from us in 2020 and that requires admitting it and problem solving it so it never happens again.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "As I started suspecting a year or so ago, we’re probably losing a trillion dollars a year to fraud. The deficit numbers didn’t smell right any other way. We don’t have a government “spending” problem so much as a total lack of audit controls on that spending.",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most of the 37T debt is due to fraud",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "I have a class 1 and defensive driving, I drive an old 2004 van because that's what I can afford. All I see every single day is retards and somalian's in beautiful brand new vehicles doing u-turns in controlled intersections, driving in two lanes at the same time, no signals on lane changes or turning. The RETARDS are getting a free pass while the top IQ and responsible are punished.",
                "author": "XenogenUltra"
            },
            {
                "raw_content": "All that welfare attracts immnigrants like flies to shit",
                "author": "RINO_fatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH VIDEO - \"Turning Point USA recreated the moment Charlie Kirk was executed at their convention for people to take selfies with...\"",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't that just the standard tent that he would use all the time?",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "That's not a \"recreation of *the* tent\". That's just a TPUSA tent.",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "Not weird. He was proud of the legacy he was creating, and those of us left behind enjoy it as well. It was his thing. And we celebrate it. Also, it isn't \"recreating where he was killed\". Charlie did dozens of events with that style tent with \"prove me wrong\" written on it. Again, it was his thing. It's not a recreation of his murder. It's a replica of what he always did, may of times.",
                "author": "MagaJay02"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung Electronics Overtakes Micron to Reclaim Second Place in HBM Market",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hynix out here simply making the best ddr4 and ddr5.",
                "author": "Evening_Ticket7638"
            },
            {
                "raw_content": "Perhaps those bans on CXMT and other alternatives to the oligopoly memory manufacturers need to be lifted.",
                "author": "nonaveris"
            },
            {
                "raw_content": "Didn't even know Micron was even relevant on the HBM front.",
                "author": "III-V"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: AI chip firm Cerebras set to file for US IPO after delay",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's my favorite shop on the Citadel.",
                "author": "TDYDave2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Could AMD release a new AM4 CPU?",
        "score": 38,
        "text_content": "I was reading this https://www.tomshardware.com/pc-components/cpus/amds-legacy-ryzen-7-5800x3d-chips-now-sell-for-up-to-usd800-more-than-a-new-9800x3d-am4-chip-costs-twice-as-much-as-msrp-as-enthusiasts-flock-to-old-ddr4-memory Used 5800X3Ds selling for inflated prices. It got me thinking, is 5000 series AM4 on an old enough node that AMD could restart production cheap? Cheap enough to sell a high end x3d chip to satisfy people holding on to their old platform and RAM while the shortage is happening?",
        "comments": [
            {
                "raw_content": "Not impossible, but very unlikely. AMD is currently focused on upcoming Zen 6, and I guess their engineers are working on next gen CPU / chipset / AM port. Plus there are probably constraints with TSMC schedule, I think you have to \"reserve\" quite some time in advance for any order.",
                "author": "krumpfwylg"
            },
            {
                "raw_content": "Probably the simplest would be to manufacture 5800x3d again. (Newer cpus have ddr5 controller, they would have to redesign architecture.)",
                "author": "AstroNaut765"
            },
            {
                "raw_content": "Maybe, but I'm starting to think they want people to sell off their old stuff. Just a theory of course.",
                "author": "ej102"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Portability is so nice man",
        "score": 358,
        "text_content": "I really needed to complete some challenges before the time ran out, but I'm on vacation and couldn't get to my PC, so the Switch came in clutch and honestly runs pretty well.",
        "comments": [
            {
                "raw_content": "I learned that since I bought a 3DS years ago. I had to stay with a family member overnight at the hospital a few times (this was before COVID made that impossible). And I would play Animal Crossing to relax. But a key thing, was going digital. I just couldn't carry little carts everywhere. Its more convenient and easy to just have games digitally. From the 3DS up to now, no regrets over going digital.",
                "author": "Garamenon"
            },
            {
                "raw_content": "making time for fortnite while on vacation is wild",
                "author": "susankeane"
            },
            {
                "raw_content": "Okay but how can you play Fortnite outside ? (5G is on Switch ??)",
                "author": "WeakInspector5102"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SO HYPED FOR THIS!!",
        "score": 326,
        "text_content": "I played through the demo 3 times, lol. It looks absolutely crisp! Only 1 more month.",
        "comments": [
            {
                "raw_content": "Yea im actually shocked how well it looks and runs on switch and Im picky as fuck",
                "author": "Kalpy97"
            },
            {
                "raw_content": "Brother I held off the PlayStation version hoping for a switch version.. and now I can’t wait, this is my most hype release next year personally",
                "author": "Jeezy52"
            },
            {
                "raw_content": "I’ve never played a FF game, is it okay to play this one first?",
                "author": "rchrd92182"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I used some of my Christmas bonus to get this. It blows me away this is basically a 1 TB SSD that’s the size of a fingernail.",
        "score": 514,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It breaks my old floppy-disk-using brain to see so much storage on something so small. I bought a 1TB card too. It’s amazing.",
                "author": "Docile_Doggo"
            },
            {
                "raw_content": "https://preview.redd.it/7c328mjw4e8g1.jpeg?width=828&format=pjpg&auto=webp&s=80860d1c4a9b93332a0cfa450364dafb69e904de We have come a long way",
                "author": "da_choppa"
            },
            {
                "raw_content": "I bought a 256 at launch. Hopefully by the time I'm ready for a 1TB, these will be half the price.",
                "author": "jedilips"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A comparison of first November sales for Switch 2 vs. other consoles (NOTE: some of these consoles had supply issues that limited their sales early on).",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fact that Xbox one is on top and the DS near the bottom tells you all you need to know that this is not a good predictor of success or failure.",
                "author": "Vrayl_of_Gondor"
            },
            {
                "raw_content": "A little lower than the Switch 1, but the Switch 2 front loaded a lot of it's sales having a huge amount of consoles ready. A lot of those consoles above it came out in November so that is their launch month numbers.",
                "author": "twovles31"
            },
            {
                "raw_content": "Economy is bad and Pokemon wasn't S2 exclusive so probably a lot of families just stuck with S1 and kicked the can down the road",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Finally made the big purchase a week ago!",
        "score": 91,
        "text_content": "My whole PC gaming set up is pink so it made sense to give my Switch 2 that makeover as well. I had been thinking of purchasing one for a few weeks now and I’ve been impressed. Really just loving the larger screen size and the upcoming updates. Nice upgrade from my Animal Crossing edition Switch 1. Battery is sad af but we all know that so I’ll be keeping a charging pack with me as I prefer to play on the go.",
        "comments": [
            {
                "raw_content": "It’s cute but I’d be bothered by the sticks and buttons being rubber (at least I think it’s rubber?)",
                "author": "Jessabelllle"
            },
            {
                "raw_content": "Omg I have that exact case!! (Tho I messed up slightly putting the stickers under my joysticks), it's such an amazing thing and you'll be really happy with it!!",
                "author": "oreoboom12"
            },
            {
                "raw_content": "That case is so freaking cute!",
                "author": "raze464"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You can buy a switch 2 for $379-$399 at Microcenter.",
        "score": 223,
        "text_content": "No clue if it's just for the holidays, but Microcenter wants their switch 2's off the shelf, because no one is buying them atm. It's $399.99, but if you go to their store, you can get $20 extra credit.",
        "comments": [
            {
                "raw_content": "Unfortunately I live 1193 miles from my nearest microcenter. Best of luck everyone!",
                "author": "Yellow-Aster"
            },
            {
                "raw_content": "I think most people went with the $450 Switch 2 w/ MKW that's still available at Best Buy. The $379 is a super solid price.",
                "author": "rgumai"
            },
            {
                "raw_content": "> but Microcenter wants their switch 2’s off the shelf, because no one is buying them atm. Some people are just delusional lol. It’s the fastest selling console ever, and Nintendo saw what happened with the PS5 launch and stocked up.",
                "author": "Individual_Royal_400"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Thoughts on Red Dead Switch 2 Edition?",
        "score": 69,
        "text_content": "It’s on sale for 50% off and it looks interesting. I liked RDR2, but put it down because it moved way too slow for me. Is the first one like that too? And would you say the Switch 2 upgrade helps make it worth owning?",
        "comments": [
            {
                "raw_content": "Switch 2 rdr is fantastic, I like the pace of the game, well worth it for 50% off",
                "author": "temporary_location_"
            },
            {
                "raw_content": "RDR feels very fast and smooth and arcadey compared to RDR2 and holds up better than all the GTA games IMO (crazy to think the last GTA was also a PS360 game) Im actually playing RDR1 on Switch 2 and RDR2 on PS5 concurrently, alternating between them. RDR1 isn’t bogged down by all the details and commitment to realism. It plays faster, it has fast travel. You always have your load out on you. It has Undead Nightmare! The Switch 2 version is very smooth and crisp. Great game to have on the go.",
                "author": "VicViolence"
            },
            {
                "raw_content": "RDR1 is much closer in pacing to any GTA games pre-GTAV. Story is much shorter, most missions don't last very long. You could beat the game in a couple of days if you were to take your time.",
                "author": "Freezingash221"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Unless it shadow drops in the next 11 days, its safe to assume virtua fighter 5 revo has been delayed out of 2025",
        "score": 16,
        "text_content": "It was announced to be coming to switch 2 but later in 2025 than other platforms, the switch 2 version has had zero news updates about its release, stuck with a 2025 release window. What do you guys think about a potential shadow drop in the next 11 days? I'm pretty confident its been delayed out of 2025.",
        "comments": [
            {
                "raw_content": "why is this cover art actually in braille lol",
                "author": "vawyer"
            },
            {
                "raw_content": "Doubt it will release this year",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "The only similar thing that comes to mind is the Sw2 version of Sonic Racing Crossworlds. They were quiet about its release for months then suddenly they announced it was coming a few days later. Maybe theyll randomly announce it on a Monday and release it on a Thursday? More likely the Winter 2025 release is tentative and it could come out in Jan/Feb. There's been no official statement so this is all just guessing.",
                "author": "uzi_bazooka"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Microsoft Helping Bethesda “Unreal-ify” Creation Engine According to Jez Corden",
        "score": 643,
        "text_content": "[https://www.youtube.com/live/oMlErzr05Gk?si=cTRXvJxEeOw9U7aa](https://www.youtube.com/live/oMlErzr05Gk?si=cTRXvJxEeOw9U7aa) Jez Corden recently discussed rumors about a major technical overhaul for Starfield—often called Starfield 2.0—and how Microsoft is helping Bethesda upgrade the Creation Engine. Key points: Unreal Engine tech being integrated: Jez says he’s heard that Bethesda is leveraging certain Unreal Engine features and incorporating them directly into Creation Engine. Massive engine modernization: Microsoft’s Advanced Technology Group and Kate Rayner/The Coalition (Gears devs, Unreal experts) are assisting in improving the engine “across the board” using Unreal-inspired components. Starfield 2.0 is the testbed: This whole Starfield 2.0 upgrade is reportedly serving as a testbed for future Bethesda titles, laying the groundwork for Fallout 5 and The Elder Scrolls VI. Not a switch to Unreal: Jez emphasizes the info is based on his investigations and should be taken with a pinch of salt, but stresses Microsoft isn’t moving Bethesda to Unreal—just boosting Creation Engine with some Unreal-like tech.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So elder scrolls 6 will take longer now.",
                "author": "Ginzeen98"
            },
            {
                "raw_content": "Starfield had a test branch on Steam called lumen. Makes you think…",
                "author": "starfieldnovember"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon's new faction cinematics and faction agents leaked",
        "score": 364,
        "text_content": "- New ones shown are Arachne (PvP quests), MIDA (explosives quests) and Sekiguchi Genetics Faction intro cinematics: [https://streamable.com/7gyssf](https://streamable.com/7gyssf) Faction agents: [https://streamable.com/h3quyg](https://streamable.com/h3quyg) Original source: [https://www.bilibili.com/video/BV13ZSTBhEFt](https://www.bilibili.com/video/BV13ZSTBhEFt)",
        "comments": [
            {
                "raw_content": "Holy Visuals dude.",
                "author": "ayyybro123"
            },
            {
                "raw_content": "If only these visuals were for a new singleplayer/coop experience or shared PVP experience like original Halo.",
                "author": "Toxin126"
            },
            {
                "raw_content": "these are super cool",
                "author": "Exact-Name-3054"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 300H powered Galaxy Book 6 Pro has been pictured - VideoCardz.com",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "i9 14900KS at 400A & 253W PL1/PL2 vs i9 14900K at 400A & 253W PL1/PL2",
        "score": 5,
        "text_content": "Hello everyone, I am faced with a dilemma and I am hoping to get some input from Reddit. For context, my current build is: i9 13900KS Cooler is an iCue H150i Elite (360mm AIO) RTX 3090 FE 64gb Corsair Vengeance 7200mhz ASUS ROG STRIX Z790-A This build is purely enthusiast/gaming - I use it only for gaming as I have a separate laptop for work. Main games I play are ARC Raiders, BF6, GTA V, Tarkov, DayZ. Unfortunately, I had the dreaded i9 13900ks degradation symptoms occur few weeks ago after 2+ years of having this build. Suddenly, all my games would crash and sometimes even hard-reset the PC. I had no idea about the ongoing issue until further researching my symptoms and so I only updated the bios recently from the 2023 version to the latest 2025 version. My crashing instantly stopped, but I suspected that irreversible damage was done. Sent it in to the retailer that built it - now I am faced with either having an i9 14900k or a 14900ks replacement. Should I get the 14900ks and run 400a - 253w, or stick to a 14900k and run this same setup? Reason why I ask is because I fear my AIO will not be sufficient to handle the 320w recommended Intel extreme setup for the KS, and I do not want to go down the deliding/custom loop route. I am curious if this identical setup would perform better/worse between the 2 CPUs or just be the same, performance & temperature-wise? I have the option of either CPU, but I hear rumours that because the 14900ks is a higher binned chip, it has higher quality silicon? Not sure honestly and I am so conflicted. I really need some advice on this.",
        "comments": [
            {
                "raw_content": "should have a 3y warranty on it. submit an RMA ticket regarding the actual query though, the silicon is the same the 14900ks is just a slightly better bin. you wouldn't notice the difference at stock let alone normalized for energy consumption",
                "author": "KeyEmu6688"
            },
            {
                "raw_content": "The performance difference will be tiny and definitely not noticeable with a 3090. Go for the cheaper chip.",
                "author": "doggodoesaflipinabox"
            },
            {
                "raw_content": "Get the KS for better silicon quality only limit power , set pl1/2 253w and set it to 350 or 325A, definitely want the better 14900ks silicon quality it’s overall better and better IMC as well. It’s a better bin and typically only the best 14900k will run stable 6.2ghz and at lower voltages even if you limit your chip to 6ghz",
                "author": "Tatoe-of-Codunkery"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD ❤️",
        "score": 118,
        "text_content": "Specs OS > Arch Linux - KDE Kwin Wayland CPU > Ryzen 7600 GPU > 7900XTX RAM > DDR5 6000 CL30 MoBo > TUF B650Plus AIO > Thermalright 360 Frozen PSU > TUF 850W 3.0 CASE > Phanteks XT pro ultra MONITOR > XG27UCS 4K 160HZ",
        "comments": [
            {
                "raw_content": "Nice! Planning to achieve Rx7600 + 5 5700x using Pop! Os",
                "author": "compulsaovoraz"
            },
            {
                "raw_content": "didn't go 9070xt due to vram?",
                "author": "Celcius_87"
            },
            {
                "raw_content": "I use Arch linux BTW",
                "author": "pleasebecarefulguys"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD officially confirms fresh next-gen Zen 6 CPU details - OC3D",
        "score": 542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Will this be compatible with AM5?",
                "author": "Intrepid_Income_3051"
            },
            {
                "raw_content": "Dont tell userbenchmarks",
                "author": "rng847472495"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Why is AMD way faster than Intel for a 2048 simulation?",
        "score": 62,
        "text_content": "I’ve recently been working on a 2048 reinforcement learning project, so I implemented a C++ 2048 environment for rollouts. I tested it on several platforms I have access to, and the results were quite interesting. The algorithm itself is very simple. It builds a lookup table (LUT) for a single row and uses LUT lookups to compute both the merge result and the reward. The LUT uses 20-bit entries per ordering (forward and reversed). Each entry stores two `uint32_t` values: (merged result and reward). With both orderings, the total size is about 8 MiB × 2 = 16 MiB. My assumption is that the LUT is small enough to fit in L3 cache, so cache performance becomes the bottleneck. [Intel CPUs tend to have significantly slower L3 cache](https://chipsandcheese.com/i/152587465/arrow-lakes-caches-bigger-not-always-faster) than AMD CPUs across generations, which likely explains the performance difference.",
        "comments": [
            {
                "raw_content": "Your assumption is most likely correct, that is why benchmarks try to stay above the L3 size. I think it was the benchmark SuperPI that was very popular, but once cache sizes on CPU's got so big that the whole program fits in it, the results reflected more the cache size than the raw CPU performance. Similar to what you see here in your results.",
                "author": "toetx2"
            },
            {
                "raw_content": "I'm no expert, but I remember the new Arrow Lake chips lacking AVX-512 support which may or may not contribute to this difference.",
                "author": "Any_Cook_2293"
            },
            {
                "raw_content": "The E5-2680 v4 is a low-clock Broadwell, it's going to be horrible in singlethread and the L3 is scattered across the die in a slow ringbus. The i7-12700H scales uncore frequencies depending on load, so it probably had the L3 downclock after a second or two, making latency horrible. The EPYC 7773X likely runs at a low clock speed and has *horrible* memory latency, so it would fall to memory. The 285K has a very slow L3 and slow interconnects. Meanwhile, the R7-5700X and 9900X\\* can fit it in their 32MB L3 easily and can put it in memory if needed, and the M2 can fit it in its 16+8MB SoC cache. \\*AMD chips can *sometimes* reference memory across CCDs, but they prefer not to, and when a cache line is evicted from a CCD it gets sent to RAM (instead of being sent to a different CCD), so functionally AMD cores can only use a single L3. Maybe someday we'll see an SoC cache on the IOD.",
                "author": "A_Canadian_boi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Asus ROG Strix G16 G614FR review (AMD Ryzen 9 9955HX, RTX 5070Ti)",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet another \"gaming\" laptop with 16 core 9955hx with 9955hx3d option, but the max gpu is 5070ti. Because making a 6-8 core x3d with laptop 5080 or 5090 would make too much sense.",
                "author": "saboglitched"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Why Middle-Class Americans Say Life is Unaffordable",
        "score": 199,
        "text_content": "[Why Middle-Class Americans Say Life Is Unaffordable - The New York Times](https://www.nytimes.com/2025/12/20/us/politics/middle-class-us-economy-affordability.html) The article is about the cost-of-living in general, but the absurd cost of housing is a main element of it. Our \"leaders\" are doing everything they can to keep assets, including housing, propped up, because they're terrified that letting the bubble pop will cause a massive recession from a reduction in \"wealth effect\" spending. The problem is, by doing this and making the wealth gap worse than since the Gilded Age, they're creating a whole class of unhappy young people. Eventually, there will be blowback and civil unrest like people are not remotely prepared for. As the article points out, the only way most young people can afford houses is if their Boomer parents give them money for it. That's not sustainable.",
        "comments": [
            {
                "raw_content": "Not only can't young people get housing but they can't participate in American life the way previous generations did. When i was a teenager my friends and i would go bowling and then hit up a pizza parlor, eat pizza, drink coke and play some arcade games. It was all affordable. Now all of that stuff is amusement park prices.",
                "author": "OnlyKey5675"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Article without paywall: [https://archive.ph/yXoRf](https://archive.ph/yXoRf)",
                "author": "hereditydrift"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "20 December 2025 - Weekly /r/REBubble Discussion",
        "score": 3,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Former DeepMind Director of Engineering David Budden Claims Proof of the Navier Stokes Millennium Problem, Wagers 10,000 USD, and Says End to End Lean Solution Will Be Released Tonight",
        "score": 311,
        "text_content": "David Budden claims to have found a proof of the Navier Stokes existence and smoothness problem and states that a complete end to end Lean formalization will be released tonight. He has publicly wagered 10,000 USD on the correctness of the result. Budden also claims to have a proof of the Hodge conjecture, which he says he intends to publish by January.",
        "comments": [
            {
                "raw_content": "Can someone explain this like I’m 5.2?",
                "author": "jkd0027"
            },
            {
                "raw_content": "https://preview.redd.it/fnmcgicaeh8g1.png?width=794&format=png&auto=webp&s=160fb445eb13052c8dc9e78ef9bbadef3948bfd1 I was already very doubtful, but now I'm 99.9% sure this is just AI psychosis after seeing this tweet",
                "author": "Westbrooke117"
            },
            {
                "raw_content": "The way no one believes him 💀 betting markets at 95% against his odds",
                "author": "Glittering-Neck-2505"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "11 Months ago Zuck claimed that his company will have an AI that can automate away a \"mid-level\" engineer in 2025. Did his prediction come true?",
        "score": 260,
        "text_content": "Video for reference: [https://www.youtube.com/shorts/uDL\\_6A6zB0w](https://www.youtube.com/shorts/uDL_6A6zB0w) Disclaimer: I am not shitting on Meta. They have many extremely talented engineers and their SAM Audio model is probably the most interesting AI release I've tried this year.",
        "comments": [
            {
                "raw_content": "zuck makes a lot of claims over the years, he always fancies himself as sorta Jobs like visionary, all the foolhardy spending on metaverse and now AI (smaller investment in copying zoom/clubhouse was also part of the scheme) are just for his own ego. He's a ruthless businessman but had terrible product sense and technological vision, and the only person inside meta who doesn't know this is him Never bet against him when it comes to milking the ads gravy train but never bet on him to come up with anything new, he's horrible horrible person to lead that. (even the ads gravy train was mainly built by Sheryl) this comes from a long time facebook insider",
                "author": "Ok-Stomach-"
            },
            {
                "raw_content": "Fuck no 😂😂😂",
                "author": "AltruisticCoder"
            },
            {
                "raw_content": "No",
                "author": "Quarksperre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "When are chess engines hitting the wall of diminishing returns?",
        "score": 456,
        "text_content": "50 Elo points a year, they didn't stop after Deep blue, and they didn't stop 200 points after, nor 400 points after, and they look like they might keep going at 50 Elo points a year. They are 1000 Elo points above the best humans at this point. There's no wall of diminishing returns until you've mastered a subject. AI has not mastered chess so it keeps improving.",
        "comments": [
            {
                "raw_content": "A bit of a tangent, but I think this is a good example of why some people don't think LLMs are improving. If I played the best chess engine from 30 years ago or today, I am unlikely to be able to tell the difference. If the improvement is in an area you're not qualified to judge it is really hard to appreciate.",
                "author": "EngStudTA"
            },
            {
                "raw_content": "What happened 2006?",
                "author": "arminholito"
            },
            {
                "raw_content": "TIL chess engines are still improving. I thought chess was a solved problem.",
                "author": "kernelic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Here's the thousandth case of someone being confidently ignorant and stupid. Why do people think that AI won't improve? Like genuinely. Why would technology suddenly stop improving?",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because there is a lot of anti-AI youtubers and the art community is extremely influencial for its size, and many are anti-AI. The sentiment toward AI and large corporations are abysmal also because we have seen limited benefits from AI but they consume so much data, power, and are controlled by big corpos. That said, I love them.",
                "author": "Super_Sierra"
            },
            {
                "raw_content": "I’m convinced that there’s a movement against AI out of. concern for humanity and the planet. It’s understandable, but their arguments aren’t based in reality. AI is killing jobs. AI is going to become capable of taking away more human labor. I think it’s a foregone conclusion that we are taking the “bad” 2027 path. AI development is going full steam ahead, and we’ll likely see social disruption. Whether right or wrong, these people are not going to be effective with the strategies they’re currently employing to dissuade others from using and advancing AI. They would be better off working on ensuring that the right people are elected to government positions who can handle the transition appropriately.",
                "author": "AliveInTheFuture"
            },
            {
                "raw_content": "anime profile pic, ignore",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LimX Dynamics’s Biped Robot uses AI during the design process to create the best robot.",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, they took one of the whacky walk cycles AIs sometimes make while training and said. \"Why not?\"",
                "author": "Icy-Swordfish7784"
            },
            {
                "raw_content": "To create the Silliest Walk robot.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Can it pass the butter?",
                "author": "limpchimpblimp"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New York Signs AI Safety Bill [for frontier models] Into Law, Ignoring Trump Executive Order",
        "score": 382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> New York Gov. Kathy Hochul on Friday signed into law a new bill aimed at regulating artificial intelligence companies and requiring them to write, publish and follow safety plans. >**Starting Jan. 1, 2027, any company with more than $500 million in revenue that develops a large AI system will have to publish and follow protocols aimed at preventing critical harm from the AI models and report any serious breaches or else face fines.** >The law also establishes a new office within the New York State Department of Financial Services for enforcement, issuing rules and regulations, assessing fees, and publishing an annual report on AI safety. Some elements of the new law will simplify and codify existing best practices. >The signing of the bill, known as the Responsible AI Safety and Education, or Raise, Act, comes a week after President Trump signed an executive order that aims to block states from regulating AI. >“We rejected that,” said the bill’s sponsor, Alex Bores, assembly member for the 73rd District of New York in Manhattan. “While I agree this is best done at the federal level, we need to actually do it at the federal level. We can’t just be stopping people from taking action to protect their citizens.” >He said the final version of the Raise Act used California’s SB53 bill, signed by Gov. Gavin Newsom earlier this year, as a starting point. But it is stricter in some areas, including the amount of time AI developers have to disclose safety incidents. The California law requires 15 days, while New York requires 72 hours. >Bores said the disclosure timeline was one of the most contentious areas of the bill, adding that one AI lab emailed three hours before it was signed to ask for changes. >“This was a real fight by extremely powerful interests to stop any movement in this space and to set the California law as the new ceiling, and that bubble was burst,” he said. >Bores has announced plans to run in the open primary to replace retiring Rep. Jerrold Nadler (D., N.Y.) in Congress. The RAISE act is the second major frontier AI safety bill after CA bill SB 53, and it’s aimed at AI companies with >$500M in revenue. On a related note, the anti-AI regulation super PAC Leading the Future (Greg Brockman + a16z) stirred up controversy last month when they announced that the sponsor of the bill, Alex Bores, [would be its first target.](https://techcrunch.com/2025/11/17/a16z-backed-super-pac-is-targeting-alex-bores-sponsor-of-new-yorks-ai-safety-bill-he-says-bring-it-on/)",
                "author": "Tinac4"
            },
            {
                "raw_content": "What is \"critical harm\"?",
                "author": "Trevor775"
            },
            {
                "raw_content": "Honestly, the fact that this ONLY targets large corporations is a pretty big win in my book. Most of the \"anti-AI\" legislation that is in the works today only serves to crush smaller competitors and support copyright lawsuits by the entertainment industry. Targeting big tech AI firms without harming small AI labs is the way to go if we want to decentralize AI.",
                "author": "jferments"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Initiate Phase 2",
        "score": 102,
        "text_content": "[Tweet](https://x.com/McaleerStephen/status/2002205061737591128?s=20)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/57f3ehbfbg8g1.png?width=578&format=png&auto=webp&s=477ddeb7f593a0b5c95d0157cefc1af4a47742a7",
                "author": "ElSzymono"
            },
            {
                "raw_content": "https://preview.redd.it/dwro06h76g8g1.png?width=751&format=png&auto=webp&s=f6e93745bb37ac5a72e99696127f9ec42ca70496 iykyk",
                "author": "SrafeZ"
            },
            {
                "raw_content": "Which begs the question: alignment with whom?",
                "author": "UnnamedPlayerXY"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why is Reddit so hopelessly confused about AI and yet hates it so bad?",
        "score": 335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone is just entirely too cynical… its pretty tiresome. Like a recent OpenAi post showed what could be the early stages of a universal translator and all people could say was “think of all the misinformation!”… as if its impossible to just take a W",
                "author": "scottie2haute"
            },
            {
                "raw_content": "I mean, I sometimes think my brain is just a glorified autocomplete. With a heavy dose of cynicism and snark.",
                "author": "Fit_Low592"
            },
            {
                "raw_content": "Some people view it as a threat to their identity. When the perceived self is threatened strong emotions naturally come out.",
                "author": "Polyphonic_Pirate"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ethan Mollick: \"If you want to understand where AI is headed, don’t watch the benchmarks. Watch the bottlenecks.\"",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Back in the ancient AI days of 2023\" Wow time flies!",
                "author": "Rough-Geologist8027"
            },
            {
                "raw_content": "\"Ethan Mollick\" sounds like a Dollar Store Elon Musk.",
                "author": "johnjmcmillion"
            },
            {
                "raw_content": "Really interesting blogpost by Ethan Mollick. He always points out how AI has progressed. It has gone further than most people realise. Hallucinations and maths are not as poor as they were even a year ago. But AI is also held back by poor memory for example. He calls this 'reverse salients'. They are the bottlenecks that prevent current AI models to progress further. But if the labs can solve or mitigate these problems, AI will make sudden leaps in intelligence and capability. His most recent example is how Nano Banana Pro can make very good slide decks or powerpoints out of any range of subjects. Generating text on images was something that was very hard to do for AI's. Until Google solved it, with Nano Banana (pro), it has opened much more possibilities.",
                "author": "japie06"
            }
        ],
        "subreddit": "singularity"
    }
]