[
    {
        "post_name": "\"we're so glad Greta is ok or we'd never hear the end of it\"",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He needs to have her on his show.",
                "author": "MAGAGIRL69"
            },
            {
                "raw_content": "I can't even look at that thing anymore. Uglier every year.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "why would our greatest ally attack Greta?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔊 \"Stay Tuned\": Kash Patel announces the FBI has been Investigating the Charlotte train murder from \"Day 1\".",
        "score": 612,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope this is targeted at the corrupt judges and Soros DAs that have repeatedly released the scum-of-the earth. In particular, the latest judge (another black chick) that has a side gig running a rehab center for these criminals.",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "Oh well if kash is on it then case closed. Let me get my AirPods and hop on a train now I feel so safe",
                "author": "TheEmperorProtects"
            },
            {
                "raw_content": "bru, we already know what happened",
                "author": "MudDog"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE FROM THE S.S. GRETA",
        "score": 529,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Minor ship damage, no injuries, and people were yelling \"THIS IS MAGA COUNTRY\"!!",
                "author": "Kermit"
            },
            {
                "raw_content": "Some idiot popped off a flare.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "The Greta Tardmada",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "City Bus Attire in 2025",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Smart move would be not sitting in front of black makes. Get your back to a wall with no flank. And be armed and know how to use it. Godspeed white pretty women. You hate us white heterosexual males, but we still have faith in you.",
                "author": "Tikk"
            },
            {
                "raw_content": "Someone once coined the term Super Predators. Actually pretty accurate.",
                "author": "Insatiable"
            },
            {
                "raw_content": "Segregation would solve a lot of problems. Especially if the problem race was segregated back to Africa.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Transportation Sec Duffy floats REVOKING federal funding for Charlotte after the kiIIing of Iryna Zarutska on a train",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Revoke federal funding anywhere that woke judges have power to not punish criminals.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "So much public transit money is just stolen. Look at SETPA in the Philly region. It's a bloated hot mess and the state is sick of paying for the state portion of it. It's fed funded too. It's filthy, dangerous, run down, breaks down routinely, and no one can say where the money goes and the ones that know are not talking.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "If that’s the threshold for revoking funding, then I can think of a lot of blue cities that should have had their funding pulled a long time ago",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The White House : \"America has always been a nation that believes in the power of prayer... Together we will make our country greater, stronger, more united, and more faithful than ever before.\" - President Donald J. Trump",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Christ is King! Come at me Netflix Yahoo and your little ADL too.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "For God so loved the world, that he gave his only begotten Son, that whosever believeth in him should not perish, but have everlasting life. John 3:16",
                "author": "FatBeagleMars"
            },
            {
                "raw_content": "I've been praying every night for the past 6 months. I left my church for reasons I can't justify, but went to my parents' church to be accommodating this past Easter. I was hooked all over again. I re-committed myself to Christ, and have returned to my church every Sunday since. My life, and those who I pray for, have all changed for the better, and prayers are being answered. I've come to the conclusion that prayers are ABSOLUTELY heard by God, and if you just give yourself over to Him, you'll realize that even the seemingly negative things that may happen in your life, no matter how significant or insignificant, are part of His plan. Commit yourself to God and you, too, will see that He is awesome. Your prayers, even though maybe not immediately, WILL be answered. I'm living it myself and seeing it with my own eyes. I'm praying for each of you, frens. God is good.",
                "author": "CrispyCracker2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Even Joe Rogan is talking about the threat of the Muslim invasion",
        "score": 1384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need a new Crusade, beginning yesterday.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "\"Are you going to oppose sharia law, even then\". Who said it... When muslims are a minority, they very much care about minority rights. When muslims are the majority, there are no minority rights.",
                "author": "BigBadLeo"
            },
            {
                "raw_content": "Urge to crusade...rising...",
                "author": "HolographicTacoSalad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alright boys - you know what to do! Flood em up.",
        "score": 958,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OP HERE - seems half of you are fucking RETARDED AS FUCK use the fucking app, make false ice report, make ppl trying to use the app to stop ICE pointless. fucking dumbasses ------------- If there are 1000 red dot claims of ICE, but 999 are all false, what good is this App to the illegals. Make em scared, FLOOD THE APP.",
                "author": "Grizaje"
            },
            {
                "raw_content": "Red Dot Ice Activity Alerts free in the APP store is 100% anonymous and no account needed. Get to work!",
                "author": "Hammond"
            },
            {
                "raw_content": "What are some expensive lefty Chicago neighborhoods? If enough of us report them, maybe we can get protesters there.",
                "author": "2016TrumpMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TX Gov. Greg Abbott will soon sign the Texas Women’s Privacy Act into law, creating HARSH penalties for schools, universities, prisons, and more that allow men into women’s bathrooms or changing rooms",
        "score": 810,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok but I think you’ve got an H1b and Muslim problem that’s way worse.",
                "author": "Greenhills"
            },
            {
                "raw_content": "Why not both ways? I don't want some burly woman coming in the men's room either.",
                "author": "WhiskeyTwoNine"
            },
            {
                "raw_content": "I mean we gotta do it. But just remember a society that relies on laws to enforce normalcy is in a bad place. A healthy society wouldn’t require to make a law about this, the society would already inherently agree men are men and women are women. We still have a long way to fall before we can truly rebuild a society with inherent normal values again.",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Routh — who was laying in wait to shoot President Trump as he was golfing last year — has chosen to exercise his legal right to represent himself at trial, instead of using a defense attorney",
        "score": 741,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i hope they televise this nutjob on prime time for the world to see mainstream leftism on display …and then summarily execute him outside the courthouse after a swift trial",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Damn, his lawyer's going to get sentenced too.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "This should be entertaining.",
                "author": "SirBuzzKillingtonVI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How many of these ? when is enough? In May, Logan Federico, a 22-year-old college student, was visiting a friend in North Carolina when a career criminal, Alexander Dickey, went on a violent rampage. He broke into her friend’s house and shot and killed her. Dickey had nearly 40 prior arrests!",
        "score": 1314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NEVER RELAX",
                "author": "GodKingHarambe"
            },
            {
                "raw_content": "I’m so tired of these ugly apes murdering our beautiful women. Makes me sick.",
                "author": "BasedCostanza91"
            },
            {
                "raw_content": "If they didn't hide these stories, the Purge would have happened already. As it is, they're only postponing the inevitable.",
                "author": "skuts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greta Thunburgs boat was supposedly hit by a drone strike",
        "score": 610,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fake and gay. Sounds scripted. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "Yes because the most important thing to do when your boat is on fire is to livestream or make selfie videos about it",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "They set sail a couple days ago why are they in a harbor with police boats? 🤣 Be funny if it was just an errant Trump golf ball",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump on the murder of Iryna Zarutska:",
        "score": 1527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the blood was dripping from his hand, the maniac injured himself during his demonic act. death penalty now",
                "author": "YodaBannon"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Democrats love dead Ukrainians.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keir Starmer claims there's no money for British pensioners. There is money for hotels for fake asylum seekers.",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How come he hasn't been shot yet? Every day he says something that puts him square in the bullseye.",
                "author": "skuts"
            },
            {
                "raw_content": "Lmfao fuck the british",
                "author": "LORDFALCONE"
            },
            {
                "raw_content": "Hotels are valuable for globalist turds. All those rooms and the only people you have to pay are workers minimum wage to clean the empty ones, and the invaders are self policing because they know exactly what it is the fuck they are doing here, plundering and raping the locals. Same strategy as always, turning the economy on its head by abusing shelter as a commodity and packing people in like sardines. They are playing monopoly. Literal roach nests.",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Trump admin has found 22,638 of the kids \"lost\" by Biden ... what they have endured is beyond evil",
        "score": 962,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the number of missing children is much higher. I think the parents know that they sold their children for some change. Everyone from.the traffickers,sexual monsters,parents, and politicians are to blame.",
                "author": "DT170x"
            },
            {
                "raw_content": "\"Do it for the children.\" ~ politicians \"Fuck the children.\" ~ also politicians, figuratively and literally",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "💔 All those poor kids. People who do this stuff to children deserve the rope, regardless of borders.",
                "author": "JnrelMcLibrtee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yup, that lineup looks about right",
        "score": 747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who makes signs and a scene and then doesn't want to be seen? Isn't that the point of signs and coloured hair?",
                "author": "Icepck"
            },
            {
                "raw_content": "Democrats: Covering their faces with masks in a public space: \"We do not consent to being recorded!\" Also Democrats: \"All ICE agents have to remove their masks in public!\" 🤡",
                "author": "McFatty7"
            },
            {
                "raw_content": "The local meeting of 'Grannies 4 Pedophilia'",
                "author": "SpellingContable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Amy Coney Barrett reminds Norah O’Donnell that Ketanji Brown-Jackson is a dumbass in the most diplomatic way possible.",
        "score": 659,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eh, not really. More demonstrable bullshit stickied on TDW.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Jumanji Jackson Five is probably illiterate. Her opinions are clearly written by an AI, which is why they randomly go on tangents about irrelevant crap. Her dissent in Dobbs wandered into talking about ostriches more than once. Jumanji is illiterate.",
                "author": "Kaarous"
            },
            {
                "raw_content": "Autopen/stolen election appointed tard needs to be removed.",
                "author": "projectarcturus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨 \"The surge has begun!\" \"Operation Midway Blitz\" launches in Chicago",
        "score": 1467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL, the first immigrant arrested in the video was named Juan. Time to fire up the Mexican-Word-of-the-Day memes!",
                "author": "duehuckleberry"
            },
            {
                "raw_content": "> convicted in 2024 of forcibly assaulting a child under the age of 13. Democrats are fighting to keep people like this in our country.",
                "author": "RocketSprocket"
            },
            {
                "raw_content": "They all need to go! Not just the \"Worst of the worst\".",
                "author": "TheWill"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The “letter to Epstein” which Wall Street Journal claimed Trump signed has been released. And the “signature” looks absolutely NOTHING like President Trump’s REAL signature. Trump is going to BANKRUPT WSJ!",
        "score": 1281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet they focus grouped the shit outta that sig. Yet, that was their choice.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "this is probably the dumbest hoax since lunging for the steering wheel. But there’s so many to choose from.",
                "author": "leakmouth"
            },
            {
                "raw_content": "doesn't matter. everyone on the left will believe it anyway",
                "author": "kc5ods"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Second Chances",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In a just world, this piece of shit would have been executed today.",
                "author": "JohnN"
            },
            {
                "raw_content": "thanks obama. fuck joe biden. but there's a special place in the same hell for every complicit globohomo rino: still in government, formerly in office, and especially hoping to get elected",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "correct, fatally stabbed victims don’t get a 2nd life … nor a 9th",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Windows 11 cleared of all charges for killing SSDs, the real culprit is faulty firmware",
        "score": 527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are the SSD's in the thumbnail supposed to be the ones affected?",
                "author": "Specific_Frame8537"
            },
            {
                "raw_content": "And yet no explanation has been given for why so many brands of SSDs apparently shipped with Phison internal-only ES firmware. Especially the non-chinese brands, like Corsair and SanDisk...",
                "author": "Kougar"
            },
            {
                "raw_content": "Reckon Jayztwocents is going to update the video or its description after assuming it was Windows at fault?",
                "author": "DarthVeigar_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "E-Paper Display Reaches the Realm of LCD Screens > Modos debuts an open-source e-paper with a 75-Hz refresh rate",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was under the impression that the difficulty with high-refresh e-ink is that granular changes from one state to another are slow because the physical process of changing a \"pixel\" is quite slow, *and* depending on what you're changing to/from, may require multiple \"steps\" to ensure things don't get stuck partway and create a bunch of ghosting. It would be really weird if all that could be effectively fixed in control and not even in the physical makeup of the panels.",
                "author": "Reasonabledwarf"
            },
            {
                "raw_content": "This is definitely very interesting, I've always liked the idea of having a secondary e ink display but it's never been something really viable. Depending on how this goes in the future maybe that might be a possibility. Would be great for 90% of what I use secondary displays for.",
                "author": "WuWaCamellya"
            },
            {
                "raw_content": "I know people who would kill for a functional 75 Hz e-paper desktop monitor. If this could work with the couple that are already in the market, that would be really something.",
                "author": "wlpaul4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "No, AVX 512 is power efficient | Video from RPCS3 developer",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The vocal minority strikes again. I remember when AVX2 was the devil, back when the unholy combination of Intel's Haswell implementation and people still wanting to set a specific CPU frequency was made. It was hilarious to see people refusing AVX2 stress tests eventually facing the reality of their setups crashing as AVX2 instructions started seeing more use. Most people don't even know what they are missing out on, as they aren't even working with instruction sets, so they have no idea how dated AVX2 is, and how AVX512 isn't just wider, but also more flexible. I'm at the point where I won't even consider the next Intel CPU generation if it still doesn't support AVX512 as an embarrassing regression since Rocket Lake and early Alder Lake. Zen4 just raised the bar too high, and Zen5 is just so crazy with AVX512, the rest of the system can't even keep up with it, making me look forward to Zen6 with hopefully an improved I/O die and IFoP improvements getting paired with it.",
                "author": "AntLive9218"
            },
            {
                "raw_content": "The novelty of AVX512 wore off ages ago. Only shufbit and multishift remain unused. I have no idea what to do with these. The next AVX needs to have a horizontal sort, vector lea and integer division instead of worthless crap like intercept, multishift and shufbit",
                "author": "NegotiationRegular61"
            },
            {
                "raw_content": "What do you use AVX on your Ryzen CPU at home for? Question to all participants of this discussion. Thank you!",
                "author": "VariousAd2179"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Microsoft’s hollow core DNANF fiber delivers the lowest signal loss ever, just 0.091 dB/km, offering lower latency and the possibility of improved power efficiency.",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It seems like this will kill the latency advantage that Starlink was promoted with to financial institutions.",
                "author": "Kinexity"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel reportedly preparing packaging for upcoming Arc B770",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's good they launching this, this card adds some competition to the landscape, but before anyone buys it they should figure out if their drivers are lighter weight. It's hard to think of this fitting a niche of someone with a pretty powerful CPU who wants a midrange GPU. The more ARC cards out there the more developers get familiar with them, the more XeSS v2 gets added to titles, the more the drivers get matured and the better future ARC cards will be. I'd happily pick up an ARC card... once they've proved themselves in terms of driver maturity and overhead.",
                "author": "grumble11"
            },
            {
                "raw_content": "This should be a great upgrade from my A750 if B580 performance is anything to go by. I hope it's under $400.",
                "author": "BrideOfAutobahn"
            },
            {
                "raw_content": "I hope they fixed the drivers CPU overhead problem or that GPU's gonna need a 7800X3D or 9800X3D to feed it fully.",
                "author": "AnechoidalChamber"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel CFO confirms that 14A will be more expensive to use than 18A",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A newer process node is more expensive? Shocking!",
                "author": "crab_quiche"
            },
            {
                "raw_content": "Big question; how much are 18A-P and 14A-E wafers are VS TSMC N3, N2 & A14 (rumoured to be $*45,000*?) That's the big question.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Laying the groundwork for 14a to replace 18a I see. 20a being cancelled for 18a all over again or just cannon lake 2.0?",
                "author": "juGGaKNot4"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Breakthrough Solution to DRAM's Biggest Flaw",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tl;dw Instead of transistor and capacitor, it is comprised of 2 transistors (one of which is made from a material that can retain its charge in a powered off state for a long time).",
                "author": "Nicholas-Steel"
            },
            {
                "raw_content": "Saw this video earlier today. Excellent video btw as is expected of TechTechPotato. Kudos for explaining that capacitors are why DRAM does not scale with a cross section image that makes it completely obvious. It's been 5 years since a working proof of concept. It takes 5 years to design and build a CPU or a GPU to bring to market. What is holding back capless DRAM?",
                "author": "ecktt"
            },
            {
                "raw_content": "LPDDR5 in laptops are absolutely awful they have 100+ ns latency. https://i.ibb.co/35x0kPBJ/Screenshot-2025-09-08-225627.png As a comparison a highly tuned DDR5 6000 CL30 with TSME off has ~60ns latency.",
                "author": "lintstah1337"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GSMArena | Google Pixel 10 Pro review",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They really need to make some changes to their Pixel hardware division. They have so much potential keep flopping.",
                "author": "iJeff"
            },
            {
                "raw_content": "I'm not sure what's up with its abysmal battery life. [Tom's Guide](https://www.gsmarena.com/google_pixel_10_pro-review-2877.php), with [sometimes less rigorous](https://www.reddit.com/r/apple/comments/jf0hun/comment/g9imi17/) methdology, found notably longer battery life, but still only matching the 9 Pro. All that money used to shift from Samsung → TSMC on the AP, and they still can't optimize the overall device for battery life.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "At this point I'm planning to keep my Pixel 7 until it no longer gets software updates. I'll get the battery swapped, probably next year. No reason to pay 1k for a new phone that's hardly an improvement.",
                "author": "Homerlncognito"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is This The Best Retro Gaming Monitor Ever ?",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone want to explain why this is downvoted? How is this not good content?",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "I would have expected better input lag, maybe run the panel at quad refresh and also offer 3:1 BFI.",
                "author": "TheJohnnyFlash"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I'm 4 for 4 so far on Switch 2",
        "score": 916,
        "text_content": "Got to be honest, I picked up the occasional dud on Switch 1. But so far on Switch 2 every game I've picked up has been fantastic. Cyberpunk - Shocked how much I've loved this. One of my top 5 games of all time. Really got into the world and have kept coming back long after the main quests are done and dusted. Donkey Kong: Bananza - Might be my favourite 3D platformer of all time. Just pure fun with one of my favourite Nintendo characters - and I even like his redesign. Mario Kart World - Growing on me more and more as I keep coming back to it, and have more experiences playing it with different groups of friends and family etc. Silksong - Tough as hell and, honestly, sometimes I want to throw it out the window, but, my God, when it's good it is exquisite. I've already got a sizeable wishlist for Switch 2, but these 4 games alone have kept me very occupied since launch and I could happily spend even more time with all of them. Great system so far and looking forward to seeing how long I can keep up this streak of pure winners...",
        "comments": [
            {
                "raw_content": "Silksong drives me nuts with the difficulty, but whenever I beat one of those bosses I’ve tried 100 times it’s a feeling like no other.",
                "author": "Rawkhawkjayhawk"
            },
            {
                "raw_content": "4:4 here too BOTW DKB TOTK Cyberpunk77 in this order. Having incredible and unhealthy amount of tjme with this tablet",
                "author": "RegJohn2"
            },
            {
                "raw_content": "I have played all four games mentioned here and have found that even though the list of games exclusively available on the switch 2 are limited they tend to be really good games and don’t disappoint. Any launch of a new system can be slow and lackluster but as the system evolves they tend to have bigger and more elaborate library of games.",
                "author": "Which_Survey6655"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's really funny how this has turned into a temporary Outlaws subreddit (and other Nintendo Switch subs for that matter).",
        "score": 340,
        "text_content": "Even when we found out this port was really good, I figured it would still get drowned out by Silksong. Yeah, Outlaws is a bigger \"novelty\" on Switch 2 than Silksong but even then, this a interesting response. Looking at the eshop charts and how much Reddit has been talking about about it (Twitter is way more focused on Silksong), its just really interesting seeing Nintendo fans fully embrace a western AAA game (same thing happened with Cyberpunk but that wasn't a flop when it first released regardless of how bad the launch was, its sitting at like 30M copies ). Because what seemed to just be \"whoa, it runs great\" is turning into \"wait, i like this\". If this keeps up, this could potentially be an evergreen title for the console (especially since it's within the launch months and is a great value all things considered). I know it was through updates that the game got better, but the game might've found the audience is what looking for via Nintendo gamers of all people, ahaha.",
        "comments": [
            {
                "raw_content": "It would be funny if the switch 2 version made the game a success and became the best selling version.",
                "author": "Linkman806"
            },
            {
                "raw_content": "It's also funny that Outlaws, a middle of the road Ubisoft game, is dominating the Nintendo subreddits right when one of the most anticipated games of the past ten years drops with a stellar port",
                "author": "Salt-Analysis1319"
            },
            {
                "raw_content": "Out of Silksong and Outlaws I never thought Outlaws would dominate the conversation on here so much.",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Had a 60 person Mario party Tournament the other day",
        "score": 363,
        "text_content": "Put on a Mario party jamboree tournament the other day with different mini games. Had a blast!",
        "comments": [
            {
                "raw_content": "were they ghosts?",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "And no one showed up?! I’m sorry. But that just means they weren’t your real friends anyway.",
                "author": "SaintBrutus"
            },
            {
                "raw_content": "Sorry, I said I would come, but I got busy folding laundry. Next time, yeah?",
                "author": "SoRedditHasAnAppNow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws will release a free demo",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow, Ubisoft is really investing in this port",
                "author": "jnighy"
            },
            {
                "raw_content": "No confirmation date but it will be later this year",
                "author": "CarsonWentzGOAT1"
            },
            {
                "raw_content": "Will be playing the demo",
                "author": "Unfair-Theory-mind"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I only want to play handheld!",
        "score": 77,
        "text_content": "I have two docks, both connected to 4k displays. Everything looks amazing in docked mode. The world's are immersive, the sound is better, the Pro controller is magnificent. But I only want to play in handheld! The screen - for all the hand wringing before release - is sensational. It's bright, deep, colorful. It's every bit as good a screen as I've seen in other handhelds. I'm not saying it competes performance wise, but I'd put it up against any of the others in a blind test. The joycons are way more comfortable than the last iteration. My only complaint was the slickness of the original sticks, but I got some stick extenders from Skull & Co which fixed all of that. It's not heavy despite its size. I can play for an hour and a half and not feel tired or sore. My only issue with it is the batter life, but I've learned to sit next to an outlet, and I take a battery pack when I go out with it. This is the best handheld Nintendo has ever made. Maybe the best handheld anyone has made for the price yet.",
        "comments": [
            {
                "raw_content": "I’m almost exclusively handheld. It’s such a good system.",
                "author": "Flonk2"
            },
            {
                "raw_content": "I play mainly handheld - but I do wish we had an OLED! Playing silksong and seeing the “gray” blacks kinda sucks :(",
                "author": "DMA99"
            },
            {
                "raw_content": "Handheld with grips is amazing. So much fun and easy to aim gyro with cyberpunk. Also amazing little speakers",
                "author": "Aggressive-Ad-2860"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "People excited about the Mario Galaxy (Me too) but I’m excited about a possible Astral Chain sequel",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would an Astral Chain sequel and a 60fps patch be too much to ask?",
                "author": "PureAddress709"
            },
            {
                "raw_content": "New Trademarks for Earthbound? Or for Mother? Because there's only been a few ways to play Mother 1 & 3 legally outside of Japan. Either way, I won't get my hopes up, but it'd be nice to get a collection of them for S1/S2.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Not sure what the EarthBound trademark would be for, unless it's a remake or if they're finally going to give us a localized Mother 3 on its 20th anniversary",
                "author": "BrattyTwilis"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New patch for Star Wars Outlaws is out",
        "score": 347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boy has the switch reddit mood changed from shit graphics to amazing optimizations.",
                "author": "Nelsonius1"
            },
            {
                "raw_content": "Shoutout to Ubisoft. They are optimizing the game even further",
                "author": "Fabulous-Okra-2902"
            },
            {
                "raw_content": "Hell yeah! I feel like Ubisoft is actually crushing it with this release.",
                "author": "marshalldylan93"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Aside from the port, how is Outlaws as a game?",
        "score": 35,
        "text_content": "I keep hearing how it's a great port. How is the gameplay itself? Story? How are the controls? Is it good with joycons?",
        "comments": [
            {
                "raw_content": "7/10 if you like Star Wars or open world games. +1 if you like both, -2 if you hate both as this game won’t be the one to win you over if that’s where your starting from.",
                "author": "BetaAlpha769"
            },
            {
                "raw_content": "Been loving it so far. Cant speak about the joycons though as I’ve been mainly playing docked.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Very good. Star Wars atmosphere is very strong. I dont care about the loop in the side quests so I am enjoying all of those aswell. Characters are great, story is what you could expect from a game called \"Star Wars Outlaws\", Space battles are good aswell. I am honestly having a blast and I dont know why some people hate on it.",
                "author": "Beneficial-Issue8005"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tom Henderson on the state of Marvel's Wolverine: \"From a few playtesters that I've been speaking to, they think that the game looks fantastic\"",
        "score": 594,
        "text_content": "Timestamp source: [https://youtu.be/ebz9vqIyNhc?t=2284](https://youtu.be/ebz9vqIyNhc?t=2284) [https://www.resetera.com/threads/tom-henderson-on-the-state-of-marvels-wolverine-from-a-few-playtesters-that-ive-been-speaking-to-they-think-that-the-game-looks-fantastic.1291965/](https://www.resetera.com/threads/tom-henderson-on-the-state-of-marvels-wolverine-from-a-few-playtesters-that-ive-been-speaking-to-they-think-that-the-game-looks-fantastic.1291965/)",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "![gif](giphy|Ivw3Gzk8EK495WrQmk)",
                "author": "MrBeyonde"
            },
            {
                "raw_content": "I heard that the enjoyment was *uncanny*",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Final Fantasy 7 Rebirth to launch on Xbox and Switch 2 in 2026",
        "score": 86,
        "text_content": "https://xcancel.com/GAMERNEWSonX/status/1965195644836217046?t=z1gX5RTyfmSSsy9qzyBRsQ&s=19 His comment: https://www.reddit.com/r/GamingLeaksAndRumours/s/ZwqRf0Gc6B",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So do we think the 3rd and final iteration of the series will be a multiplat release?",
                "author": "HauntedHotsauce"
            },
            {
                "raw_content": "For people more familiar with the game, is Rebirth more CPU or GPU heavy? I heard the PS5 performance mode is super blurry but largely stable, so this suggests GPU, but I could easily be wrong. If it's the GPU, the Switch 2 has a chance of hitting a solid 30 without too many cutbacks, some of which can be clawed back using DLSS. If it's CPU, it gets a bit harder.",
                "author": "fourunderthebridge"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Necrolipe claims a spin-off Pokemon game is planned to show up in the Nintendo Direct",
        "score": 174,
        "text_content": "https://xcancel.com/necrolipe/status/1965164221043495320?s=46&t=uMWNw54ve4DD5LEC_VveQQ According to another pokemon leaker, Riddler Khu, something new that’s not “Legends ZA” related will be revealed sometime in September. Necrolipe backs up the claim, adding on that it’s supposedly a new spin-off game that will show up in the Direct this week. It could potentially be a new Pokken, Pokemon Mystery Dungeon, Pokemon Rangers, Pokemon Stadium, Pokemon Colosseum, or maybe even a Hey You, Pikachu! spinoff We’ll have to wait and see",
        "comments": [
            {
                "raw_content": "#Universio Nintendo/Necrolipe is a Tier 5 - Pretty Much Clickbait as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "*sees Centro PokeLeaks, Riddler Khu, and Necrolipe attached* Saving this post to come back and clown on these three when it doesn’t happen…",
                "author": "Shepdawg1"
            },
            {
                "raw_content": "Honestly switch 2 Pokemon Ranger with mouse controls would slap",
                "author": "grrrreatscott"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential websites in GTA 6 leaked [Tez2]",
        "score": 597,
        "text_content": "All websites listed are: - [what-up.app](http://what-up.app) (Known from the 2022 leaks as the WhatsApp parody) - [rydeme.app](http://rydeme.app) (Uber app?) - [buckme.app](http://buckme.app) (Cashapp/Venmo?) - [leonidagov.org](http://leonidagov.org) - [brianandbradley.com](http://brianandbradley.com) (Parody of Morgan & Morgan, US’s largest personal injury law firm based in Florida) - [hookers-galore.com](http://hookers-galore.com) (OnlyFans?) - [wipeoutcornskin.com](http://wipeoutcornskin.com) - [myboyhasacreepycorndog.com](http://myboyhasacreepycorndog.com) Source: [https://gtaforums.com/topic/1002286-gta-vi-general-speculation-discussion-vice-city-baby/page/51/#comment-1072587065](https://gtaforums.com/topic/1002286-gta-vi-general-speculation-discussion-vice-city-baby/page/51/#comment-1072587065)",
        "comments": [
            {
                "raw_content": "![gif](giphy|zM1YIj4xKzFX3HNG6e) Myboyhasacreepycorndog",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "hookers galore just gonna be a towing company or something",
                "author": "Riding_A_Rhino_"
            },
            {
                "raw_content": "Interesting to see whatup hasn’t changed from the leaks.",
                "author": "Narrow-Mountain4353"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming - PlayStation 6 is Planned to Have a Detachable Disc Drive on Launch",
        "score": 612,
        "text_content": "\"For the next generation of the PlayStation, several sources, who wished to remain anonymous because they were not authorized to talk about company plans, have said that the detachable disc drive is here to stay for the next generation.\" Source: [https://insider-gaming.com/exclusive-playstation-6-is-planned-to-have-a-detachable-disc-drive-on-launch](https://insider-gaming.com/exclusive-playstation-6-is-planned-to-have-a-detachable-disc-drive-on-launch)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Ok, that's good for once. One more gen at least.",
                "author": "NeonG95"
            },
            {
                "raw_content": "This is the biggest thing From the Article: These “uncertain times” have seemingly influenced PlayStation’s decision on the look of the next PlayStation, too, as rumblings suggest that this time around, the PlayStation 6 will have a much simpler design than its predecessor, again to maximize efficiency, shipping space, weight, and so on.",
                "author": "Unlucky-Gap01"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Canceled Prey 2 gameplay footage leaked on Duke4 forum",
        "score": 362,
        "text_content": "Forum comment link: https://forums.duke4.net/topic/12181-leaked-prey-1995/page__pid__385337#entry385337 Posted on Imgur as a series of clips, most complete and polished gameplay yet. https://imgur.com/a/ cYq9f2C goQKcGb FVism3R JUrj4QK lFy8Z2m VvPuiTc PCz465R HkS5n9A 9mS83so jtLIyMm Tweet from Dave Oshry that has all clips compiled into one video: https://xcancel.com/daveoshry/status/1964840297889997048?s=46",
        "comments": [
            {
                "raw_content": "Here's hoping for a build to leak...",
                "author": "I-wanna-fuck-SCP1471"
            },
            {
                "raw_content": "Its been leaking for a week now. Not gonna say who leaked it besides someone who was fired during the Zenimax layoffs. It was all on youtube but the original uploader privated it all",
                "author": "scoobster-1387"
            },
            {
                "raw_content": "Man, a leaked build of this would be a fucking holy grail",
                "author": "shinto29"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nash Weedle and Attack the Backlog saying RE7 is coming to Switch 2",
        "score": 184,
        "text_content": "Attack the Backlog https://xcancel.com/attackdabacklog/status/1964844936282739015?s=46&t=39jdPIZyYrF1Vn-410K7cQ Nash: https://xcancel.com/nweedle/status/1964940193074405827?s=46&t=39jdPIZyYrF1Vn-410K7cQ Both of them liking my tweet to confirm it is RE7: https://xcancel.com/wajeeho94/status/1965042507445878825?s=46&t=39jdPIZyYrF1Vn-410K7cQ That must mean 8 is on the way too! Right?",
        "comments": [
            {
                "raw_content": "I'm calling it. Its FF7, 007, and RE7.",
                "author": "oilfloatsinwater"
            },
            {
                "raw_content": "I think its a no-brainer 7,8 and 2-4 remake will be coming. However unless they are DIRT cheap (like all of em for $20) i dont see myself buying then again….. UNLESS by some absolute insane way they manage to bring the 120fps mode over",
                "author": "Pdeeznutsington"
            },
            {
                "raw_content": "Seems like Capcom will be releasing the PS4/PS5 RE games in the lead up to the leaked RE 9 on Switch 2.",
                "author": "Charming_Ease6405"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Repo x Fortnite dropping VERY soon",
        "score": 53,
        "text_content": "[Source](https://xcancel.com/ShiinaBR/status/1965123008437329974) FNRBIntel seems to think it'll drop in one of the next 2 updates and is apparently A skin",
        "comments": [
            {
                "raw_content": "Wen Peacemaker",
                "author": "robertman21"
            },
            {
                "raw_content": "Repo The Genetic Opera?!",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "These games die faster than the time it takes to get them in Fortnite",
                "author": "suspicious_personage"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GEEKOM enters laptop market, GeekBox X14/X16 Pro feature up to Core Ultra 9 285H Arrow Lake CPUs",
        "score": 31,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.9.1 Release Notes",
        "score": 380,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">FSR 4 can be enabled for most games that support FSR 3.1 with DirectX® 12. Pretty happy with this. I just tested Titan Quest 2 and FSR4 seems to work, even though the game only supports FSR 3.1 atm",
                "author": "reasonsofbecause"
            },
            {
                "raw_content": "[https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-9-1.html](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-9-1.html) # Highlights * **New Game Support** * Borderlands® 4 * Hell Is Us * **New Game Support for AMD FidelityFX™ Super Resolution 4 (FSR 4)** * FSR 4 can be enabled for most games that support FSR 3.1 with DirectX® 12. * Learn more about this update to FSR 4 in our blog [here](https://gpuopen.com/news/amd-fsr4-over-85-games/) * **Fixed Issues and Improvements** * Corruption may appear while playing Mafia: The Old Country on Radeon™ RX 6600 series graphics products. * Intermittent application crash or [amd.comOpen](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-9-1)driver timeout may be observed while playing WUCHANG: Fallen Feathers with FSR 4 enabled on Radeon™ RX 9000 series graphics products. * Playstation® VR controllers are not detected while playing SteamVR™. * Intermittent application crash or driver timeout may be observed while playing Monster Hunter Wilds with Ray Tracing enabled and recording with AMD Software on Radeon™ RX 7600, 7700, and 7800 series graphics products. # Known Issues * Intermittent application crash may be observed while playing The Last of Us Part II on Radeon™ RX 7900 series graphics products. * Intermittent application crash may be observed while playing Call of Duty®: Black Ops 6 on Radeon™ RX 9000 series graphics products. * Intermittent application crash may be observed while playing NBA 2K25 in MyCareer mode on Radeon™ RX 9070 series graphics products. AMD is actively working on a resolution to be released as soon as possible. * Intermittent application crash may be observed while playing FBC: Firebreak on some AMD Ryzen™ processors such as the Ryzen™ AI 300 series and the Ryzen™ 7000 series. * Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. * Corruption (missing scan travel lines) may be observed while playing GTFO™ on Radeon™ RX 7000 series graphics products. * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. # Package Contents * AMD Software: Adrenalin Edition 25.9.1 Driver Version [25.10.25.10](http://25.10.25.10) for Windows® 10 and Windows® 11 (Windows Driver Store Version 32.0.21025.10016). * Ryzen™ AI NPU MCDM Driver version 32.00.0203.297 (Date: 2025-08-25)",
                "author": "AMD_RetroB"
            },
            {
                "raw_content": "you're free to roast me for linking 24.9.1 under this comment tree",
                "author": "AMD_RetroB"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD latest driver enables FSR4 for most FSR 3.1 games - VideoCardz.com",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "7000 series could use some fine wine, not this time I guess, crazy considering the \"flagship\" by some measures is technically an older gen",
                "author": "pablok2"
            },
            {
                "raw_content": "This is great I just tried fsr4 on stalker 1 remake and worked like a charm",
                "author": "sahui"
            },
            {
                "raw_content": "Would this work for Metal Gear Solid Delta? I’m not sure what version of FSR that’s got.",
                "author": "chipsnapper"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD confirms FSR Redstone is still on track for 2025, full presentation coming soon",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Have a question which gonna sound weird but i dont understand well. Is this gonna improve rt performance of rx9070xt???",
                "author": "BriefAd7859"
            },
            {
                "raw_content": "Does anyone know if FSR affect input latency? If it does how noticeable is it?",
                "author": "Grosjeaner"
            },
            {
                "raw_content": "Rx 9070 xt keeps getting faster. How bout that?",
                "author": "Jolly_Statistician_5"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "OneXGPU Lite eGPU with Radeon RX 7600M XT comes with \"USB 5.0\" support",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't buy them. Bought a ONEXGPU2 late last year. He had issues with the wall power supply (tongs were loose). It was causing arcing and would power off randomly. After weeks of sending info then claimed that it was an \"accessory\" and didn't fall under their limited warranty. I paid for it with tarrif charge, but the GPU still doesn't work. Probably due to so much \"testing\" to reproduce the bug on video. Don't buy as their support is shady at best. Warranty non existent.",
                "author": "d2_ricci"
            },
            {
                "raw_content": "Many years ago, there were touch screen music & video player devices branded as \"MP5 Player.\" This is probably similar branding.",
                "author": "boissondevin"
            },
            {
                "raw_content": "USB 5.0 is essentially USB4 v2, though on a capable device it might get 80 gbps throughput. That would theoretically surpass oculink, which caps at just over 60 gbps, but still, it's confusing because the market is waiting for pcie 5.0 to ramp up with more solutions outside of nvmes. But this is not USBc implemented over pcie 5.0, which should cap out at 80gbps as well, it's just doubled up usb4.",
                "author": "TheDonnARK"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire launches PURE B850A & B850M motherboards in China",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are their usung trash ALC897 audio and marketing it as Pure Sound. Please use ALC1200/1220 with good EQ like on Asus boards.",
                "author": "mkdew"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lumber Prices Are Flashing a Warning Sign for the U.S. Economy - WSJ",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this a bad thing? Lumber prices have been overpriced since 2019. I know a lot of people who will be more than happy to buy it at lower prices in order the build the home they haven't been able to afford.",
                "author": "Firree"
            },
            {
                "raw_content": "\"The price drop might have been greater--but two of North America's biggest sawyers said last week that they would curtail output, slowing the decline.\" Fuck em. It was perfectly fine when prices skyrocketed in a few months but when prices start going down again it's a huge problem? God forbid building a home get remotely affordable.",
                "author": "OBLIVIATER"
            },
            {
                "raw_content": "Yeah lumber pricing falling!",
                "author": "Latter-Possibility"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "They’re Divorced. A 2% Mortgage Is Keeping Them Together.",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love the ridiculous headline. Translation: \"We can't afford two homes and our 4-year equity nestegg is meaningless because no one is buying.\" Implication: Divorce (with kids) will destroy your finances for decades. Someone will end up in a studio apartment, eating ramen, and musing about the single life they thought they would have.",
                "author": "followedthemoney"
            },
            {
                "raw_content": "Till debt do us part. Breaking up is hard to do particularly with a 2% mortgage.",
                "author": "TGAILA"
            },
            {
                "raw_content": "I gave up my 2.25% mortgage in my divorce. My ex was abusive so there was no way we could have had an arrangement like this couple even though the house was huge and our mortgage was cheap. But once you’ve dealt with certain shit, you realize that there are things that are worth more than money.",
                "author": "thenumbwalker"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Just getting started?",
        "score": 670,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The home prices are falling but they're still 50% more than they were in 2020.",
                "author": "barley_wine"
            },
            {
                "raw_content": "Can't buy a house if you don't have a job",
                "author": "Mawwwcus"
            },
            {
                "raw_content": "A roughly 1% home price decline is nothing to get excited about yet. Maybe if a recession hits and it picks up momentum.",
                "author": "AxeMen101"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What’s everyone’s thoughts on the 18-year real estate cycle? Think it holds up?",
        "score": 112,
        "text_content": "Would love to hear your thoughts/opinions on this: The 18-year property cycle is a widely recognized theory that suggests property markets experience periods of boom and bust every 18–20 years. The cycle is broken down into four phases: recovery, expansion, hyper supply, and recession. The boom period typically lasts around seven years, followed by a four-year crash and another seven-year recovery.",
        "comments": [
            {
                "raw_content": "Pretty sure this is astrology.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "So how could the previous \"cycles\" possibly mirrored very tangible changes that powered say 1997 thru today. 1997 major capital gains tax reform. 2001 911 and dotcom bust shifting to real estate as an attractive asset class 2001 thru 2008 the financialization of weird derivatives (see big short) 2008 the fallout Since then a permanent underbuilding due to construction wipeout and blackrock scooping up undervalued assets These are merely highlights, I didn't even touch quantitative easing, COVID stimulus, massive m2 supply, etc bc I only know enough to be dangerous but by no means comprehensive. Point is, this story I say starts in 1997 has plot points ridiculously specific to the era, and highly unlikely to be some echo of history. Edit. Blackstone not blackrock.",
                "author": "SelenaMeyers2024"
            },
            {
                "raw_content": "They totally overlooked the 1980 to 1982 recession where unemployment was 10+ percent. That one kicked my ass. They are cherry picking the data to support their thesis.",
                "author": "HunterGraccus"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why the Fed should not cut rates now",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it’s all going to hinge on Thursday when CPI data comes out. If inflation is higher then expected that’s going to decrease the chance for a cut. If it’s lower then expected then there is a good chance for a rate cut.",
                "author": "bwhite9"
            },
            {
                "raw_content": "I hope it all crashes",
                "author": "baiweafi"
            },
            {
                "raw_content": "The guilty and deserving… I assume you mean homeowners included in this? This sub is wild.",
                "author": "MelanzanaSki"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "FOMO Made Him Buy a House in 48 Hours. Now He’s Struggling to Sell.",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "non-paywall: https://archive.ph/lIij2 I'm guessing WSJ reporters are digging around these RE subs for their gold pieces, lol (Sun belt buyers who bought 3 yrs ago and now want to sell). His mortgage/expense is $2,950/mo for the house but he wants to sell it and move back into an apartment with a roommate to save money. He could easily save a ton of money if he just got a roommate or two for the house he currently owns and cover most of his mortgage payment.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "What I hate most of this situation is that buyers like him made it possible for sellers to inflate pricing. Now we all suffer the consecuences of over paying for properties",
                "author": "Inchmine"
            },
            {
                "raw_content": "What single person needs a 3 bedroom house?",
                "author": "vivikush"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates plunge to 11-month low on Fed rate cut hopes, and many lenders may quote in the high 5% range",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rates coming down is nice. Prices of homes coming down is nicer.",
                "author": "EstateGate"
            },
            {
                "raw_content": "Locked in a 5.625% and closed last month.",
                "author": "Trojann2"
            },
            {
                "raw_content": "Yawn, wake me up when I can actually save money by owning",
                "author": "SpriteyRedux"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuyer shortage forces many sellers to lower prices, walk away as slump drags on",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am keeping my eye on how possible rate cuts will impact these stubborn sellers. Will people with overpriced property sitting for half a year + try to now justify o well people can now afford my sky high asking because rates let them pay ~200 less a month?",
                "author": "SushiSandwich537"
            },
            {
                "raw_content": "Even if it lowers the monthly, with the price increase it’ll raise property taxes. Seems like a wash",
                "author": "jsv_2004"
            },
            {
                "raw_content": "Something’s up at the St Louis Fed because it doesn’t look like they’re going to report active listing data for August. It was supposed to come out last Thursday. The main page still says next release date is September 4 but looking at pages for specific counties, it’s saying next release date is October 2 even though most recent numbers are from July. https://fred.stlouisfed.org/series/ACTLISCOUUS https://fred.stlouisfed.org/series/ACTLISCOU53033",
                "author": "Surly_Cynic"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Introducing Alterego: the world’s first near-telepathic wearable that enables silent communication at the speed of thought",
        "score": 603,
        "text_content": "https://x.com/alterego_io/status/1965113585299849535?s=46",
        "comments": [
            {
                "raw_content": "I honestly can't tell if this is legit or AI satire.",
                "author": "RipperX4"
            },
            {
                "raw_content": "🧠 \"god that ass is phat\" 🔊 \"god that ass is phat\" 🗣️ \"no NO NO DONT SAY THAT OUT LOUD\"",
                "author": "enricowereld"
            },
            {
                "raw_content": "How is this technology done? There is no description in your website",
                "author": "Positive_Method3022"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This sub is getting overrun by Luddites",
        "score": 495,
        "text_content": "I’m not saying healthy skepticism is bad, but man… r/singularity is getting flooded with “AI is gonna kill us” doomsayers or “AI is just a bubble” takes. Every time someone posts something cool about new tech, the comments are filled with “VC scam!” or post about how “We should just go back.” It’s wild seeing those posts get 100+ upvotes. This is supposed to be a place to talk about the future, but it’s starting to feel more like r/Futurology. Like… can we not turn every thread into a doom spiral or nostalgia fest? Some balance would be nice.",
        "comments": [
            {
                "raw_content": "That might actually be an AI bubble, just like there was an internet tech bubble in the early 2000s. But that's just the stock market phenomena. The internet still took over the world and so will AI regardless of how openai's stock performs.",
                "author": "DumboVanBeethoven"
            },
            {
                "raw_content": "Reddit tends to amalgamate all subreddits into the same insufferable redditor persona, I fully expect this place tu be unusable in 1 or 2 years if not sooner",
                "author": "Agusx1211"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I feel like I am the only one that thinks this is insane",
        "score": 309,
        "text_content": "I am not the most industry financial guru or whatever and I may be missing something but there are massive companies that make tens of billions every year since 20 years and valued at 20 billion while cognition is valued at 10 billion already for what exactly?? I am sure they are nice people and great team and all but 10 billion for fucking what lmao",
        "comments": [
            {
                "raw_content": "This is the new dot-com bubble all over again. Billions poured on companies that are worth absolutely nothing",
                "author": "liongalahad"
            },
            {
                "raw_content": "It is absolutely unhinged. Nobody is going to use this over Claude Code and Codex, not to mention the million other third party coding agent wrappers that are just as good",
                "author": "jaundiced_baboon"
            },
            {
                "raw_content": "Definitely a bubble. BUT, there's a clear distinction between dumb money being poured into useless AI companies (valuation bubble) and AI progress itself. AI progress, although it may *seem* like a bubble, is not.",
                "author": "Siciliano777"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "An AI system to help scientists write expert-level empirical software",
        "score": 22,
        "text_content": "Scientific innovator AI just dropped.",
        "comments": [
            {
                "raw_content": "This is big. This is AlphaEvolve applied to real world problems.",
                "author": "pavelkomin"
            },
            {
                "raw_content": "Abstract for the click-challenged: >The cycle of scientific discovery is frequently bottlenecked by the slow, manual creation of software to support computational experiments. To address this, we present an AI system that creates expert-level scientific software whose goal is to maximize a quality metric. The system uses a Large Language Model (LLM) and Tree Search (TS) to systematically improve the quality metric and intelligently navigate the large space of possible solutions. The system achieves expert-level results when it explores and integrates complex research ideas from external sources. The effectiveness of tree search is demonstrated across a wide range of benchmarks. In bioinformatics, it discovered 40 novel methods for single-cell data analysis that outperformed the top human-developed methods on a public leaderboard. In epidemiology, it generated 14 models that outperformed the CDC ensemble and all other individual models for forecasting COVID-19 hospitalizations. Our method also produced state-of-the-art software for geospatial analysis, neural activity prediction in zebrafish, time series forecasting and numerical solution of integrals. By devising and implementing novel solutions to diverse tasks, the system represents a significant step towards accelerating scientific progress. Pretty interesting. I wonder if it can be applied to model training.",
                "author": "tinny66666"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The physics of AI hallucination -- and \"gap cooling\" for AI reasoning?",
        "score": 40,
        "text_content": "Physicist Neil Johnson has mapped the exact moment AI can flip from accurate to false, and he says understanding their underlying physics could be the key to safer systems.",
        "comments": [
            {
                "raw_content": "The most relevant parts: TL;DR: > His research argues that the mechanism driving AI outputs is mathematically equivalent to a multi-spin thermal system — a well-studied structure in physics. Explanation: >Each token in a prompt (a word or fragment) is modelled as a “spin\" in a high-dimensional space. The LLM’s attention mechanism (its way of focusing on certain parts of a prompt) amounts to calculating interactions between these spins. In physics terms, it’s a two-body interaction, like gravity or magnetism. >This setup allows the authors to derive an equation predicting when a model’s output will shift, or “tip,” from good (that is, factually accurate) to bad (misleading or false). >“The tipping point is determined from the very start,\" Johnson explains. “It’s hard-wired by the structure of the prompt and the model’s training.\"",
                "author": "insanisprimero"
            },
            {
                "raw_content": "This is the paper: --> [https://arxiv.org/abs/2504.04600v1](https://arxiv.org/abs/2504.04600v1) Interesting work. Love this quote as it shows there is hope for improvement: >Its 2-body form suggests why LLMs work so well, but hints that a generalized 3-body Attention would make such AI work even better. Its similarity to a spin-bath means that existing Physics expertise could immediately be harnessed to help Society ensure AI is trustworthy and resilient to manipulation.",
                "author": "ApexFungi"
            },
            {
                "raw_content": "This is hugely important and interesting work. Hopefully the first of many to come on the topic.",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why haven't we seen mass displacements yet? Inertia, technology gap, politics?",
        "score": 5,
        "text_content": "Talking about the astonishing capabilities of AI on r/singularity is just preaching to the choir. I won't dwell on those. It is 100% a productivity boost, especially in white collar work, including high skill professions like software engineering My question is this - why is this additional value not showing up somewhere? It's entirely possible that I'm not looking in the right places, but we should have had a lot more displacement by now Even the largest layoffs in tech companies have been limited to 5-10% of their workforce. People are still landing jobs. Hiring has slowed sure, but not by much at all So is the tech not there yet? Is it missing some secret sauce like long context, constant learning etc etc? I just don't see why a senior software engineer with the right tools couldn't lead to a layoff of 50% of the junior devs. Are companies slow and cautious to adapt? Are they afraid of a backlash from the government?",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"A soft neural interface with a tapered peristaltic micropump for wireless drug delivery\"",
        "score": 26,
        "text_content": "[https://www.nature.com/articles/s41528-025-00463-y](https://www.nature.com/articles/s41528-025-00463-y) \"Achieving precise, localized drug delivery within the brain remains a major challenge due to the restrictive nature of the blood–brain barrier and the risk of systemic toxicity. Here, we present a fully soft neural interface incorporating a thermo-pneumatic peristaltic micropump integrated with asymmetrically tapered microchannels for targeted, on-demand wireless drug delivery. All structural and functional components are fabricated from soft materials, ensuring mechanical compatibility with brain tissue. The system employs sequential actuation of microheaters to generate unidirectional airflow that drives drug infusion from an on-board reservoir. The nozzle–diffuser geometry of the microchannels minimizes backflow while enabling controlled, continuous delivery without mechanical valves. Fluid dynamics simulations guided the optimization of the microfluidic design, resulting in robust forward flow with minimal reflux. Benchtop validation in brain-mimicking phantoms confirmed consistent and programmable drug infusion. This platform represents a significant advancement in neuropharmacological research and therapeutic delivery for central nervous system disorders.\"",
        "comments": [
            {
                "raw_content": "\"Wireless drug delivery\" ... I thought they were going to send the drugs over the Internet lol",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The much awaited european humanoid robot Neura 4NE1 spotted at IFA'25 Berlin, sorting socks and underwear",
        "score": 213,
        "text_content": "https://youtube.com/shorts/0N7_shp4QOM?si=joUsTGEWy9zVi54O",
        "comments": [
            {
                "raw_content": "![gif](giphy|3og0INAY5MLmEBubyU)",
                "author": "Objective_Mousse7216"
            },
            {
                "raw_content": "dude already doing the bare minimum to make that task last until 5pm",
                "author": "AdFeeling842"
            },
            {
                "raw_content": "It's like a blind man trying to work out what clothes are.",
                "author": "MrAidenator"
            }
        ],
        "subreddit": "singularity"
    }
]