[
    {
        "post_name": "This guy is offering $500k in $10k grants to paint murals of the face of Iryna Zarutska in prominent US city locations Please contact katie@eoghan.com for more details Please also share this message If you would like to contribute to this fund, please contact Katie also",
        "score": 1422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you really want to drive them nuts and start a narrative put white lives matter underneath",
                "author": "CrazyPope"
            },
            {
                "raw_content": "Wow. I was saying earlier she wouldn't get any murals like Saint Floyd of Fentanyl. Happy to be wrong.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Put them right next to Saint Floyd's ugly ass mug.",
                "author": "OutlawPurpleHairDye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The people at the nonprofits can permanently bunk with them in prison too…",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s the most tiresome, intellectually bankrupt excuse in the modern era. The constant bleating about “systemic racism” to explain away the undeniable and catastrophic crime statistics in the Black community is a pathetic dodge of all personal and cultural accountability. The system isn’t forcing \"youths\" and \"teens\" to carjack grandmothers. The system isn’t holding a gun to someone’s head and making them loot a store. The system didn’t create a culture that glorifies violence, criminality, and the abandonment of the nuclear family—a culture that is celebrated in popular music and defended by its own leaders. This isn’t a White man’s problem; it’s a cultural rot from within.",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Democrats are freaking out about President Trump cleaning up Chicago because Chicago is likely ground zero for fraud. Melissa Carone testified that the location in Michigan where fake ballots were stored was called the \"Chicago Warehouse.\" Why choose the name Chicago? Chicago has a lot of printing presses that are used to create counterfeit money. If they can create counterfeit money, they know how to create ballots which don't have complex color or embeded images. The last Democrat convention was hosted in Chicago, which isn't even a swing state. Did picking that location help coordinate and payoff people? Obama's corruption is based in Chicago.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "The big lie the Democrats told about violent crime is that it's \"systemic\" and therefore no one's really responsible. If the \"system\" is to blame then you fund a bunch of nonprofits that don't do anything besides give jobs to underqualified radicals. The reality is that the gross majority of violent crime is committed by a very small group of people and we should be throwing them in prison. https://x.com/jdvance/status/1965493354009165858",
                "author": "davidac1982"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The voice of the people",
        "score": 250,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why haven’t the black community members, like this man, who are tired of the crime and hooliganism in their towns, stopped it from getting worse every year since 1964? President Trump can send in the National Guard and make Chicago the safest and cleanest city in the country, but if the people who live there don’t maintain it, what’s the point? Until the “culture” changes, the problems will remain.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "The more crime they have the more federal funding they get. The more people funneled into the system, the more social services contracting companies they can start to collect the federal funds to enrich themselves. It's all about looting as much as possible. The more immigrants they import the more people they can collect \"payments\" from, because they don't know better. Follow the goddamn money, and fucking put them all in jail forever, or better yet, kill them. The governments of the blue states are all organized crime groups in open insurrection. They are fucking communist looters, and thats exactly what communists do. Corrupt the fuck out of the government until it collapses, and then they take over. Trump is doing great work, but he needs to get his thumb out of his ass and declare the insurrection act. Mobs of hundreds of people showing up to fight with ICE *IS INSURRECTION*.",
                "author": "CLF3"
            },
            {
                "raw_content": "That's what you voted for, bud, the cultural enrichment you and your fucking people wanted, and now you want someone to clean up the fucking mess? Nah, my guy, go kick rocks, clean that shit mess yourself, next time, don't bring faggots into your city, and don't fucking vote for soyboy clowns, dumbass...",
                "author": "TheNorseman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: Why is “white” always in lowercase, but Black is uppercase, NY Times? The NY Times is deliberate, precise and comprehensive in its anti-White racism.",
        "score": 1752,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because they are pushing an agenda. It is just that simple. Ask yourself, why haven't we seen the Austin Metcalf video yet? What about the dozens of other videos that capture their brutality? The only reason this got out was because of a FOIA request.",
                "author": "BlackCrimesMatter"
            },
            {
                "raw_content": "It's meant to subliminally imply importance of black people over White people.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "There was more liberal outrage over a white girl in a jeans commercial than the images of a white girl getting brutally murdered. There is no reasoning with these people and there is no point in trying to when considering solutions that will actually solve anything.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US Senate MOVES FORWARD with ramming through President Trump's backlog of nominees, 53-46. Chuck Schumer's obstruction attempt was defeated.",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't this the same cock who kept Trump from making the recess appointments in the first place?",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "About flippin' time!",
                "author": "ncswicn"
            },
            {
                "raw_content": "So what the fuck were they waiting for",
                "author": "559throw"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Many Americans are very upset about this and rightly so",
        "score": 1903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the fact that she is a ukraine war refugee makes it so much harder for the media to smear her as a racist .",
                "author": "Choppermagic"
            },
            {
                "raw_content": "There is a problematic race. It's undeniable by now.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Totally understand why lynch mobs were a thing.",
                "author": "PresidentialPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Texas A&M professor who kicked a girl out of class for having a religious objection to transgender rhetoric has been FIRED, per Gov. @GregAbbott_TX",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The nerve of these fucking cunts",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Smart kid. Calm and cool, elegant and informed. This is a big win as both a template for how it's done and a warning to other activist professors.",
                "author": "airborne3502"
            },
            {
                "raw_content": "We need to kick these radical communists OFF OF THIS EARTH.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Megyn Kelly with the biggest balls on the NC murder: ”Fuck BLM, its bullshit DEI/criminal justice “reforms,” the knee-bending candy-ass judges/DAs/pols who went along with the lies about racist policing and who created the revolving door for criminals arrested dozens of times”",
        "score": 1558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell Yeah! This came from a visceral, in the gut, place and I'm glad she didn't hold back. I hope every other media personality, and influencer, lets their true feelings fly.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Not the person I had anticipated taking that mantle...but... fuck yes!",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Blacks in the USA have been brainwashed from birth that absolutely every single problem they have is Whitey's fault. Everything bad is Whitey's fault. Everything. The only thing they can hope for is that somehow Whitey goes away forever or else nothing will ever change. This brainwashing has been upheld for years and years by race-baiters like Jesse Jackson and Al Sharpton, who got rich rich rich from money pouring in to \"fight racism\" - racism that somehow never got fought and never got better but only got infinitely worse while the money kept pouring in.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: CHEERS ERUPT for President Trump outside a Washington DC restaurant. Liberals are furious tonight. 47 just went out on the town and proved his crime crackdown WORKED. 🇺🇸",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We The People applaud every time POTUS makes an appearance.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Joe's Seafood, good place to eat.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "Trump a man of the people :D",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Missouri House has OVERWHELMING passed their new U.S. Congressional map, 90-65, cutting Democrats down to ONE SEAT Republicans are set to gain ANOTHER seat in the US House EVERY Republican state should be following suit!",
        "score": 1486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is how we win.",
                "author": "airborne3502"
            },
            {
                "raw_content": "The only thing that matters is obtaining positions of institutional power and then using that power to help friends and punish enemies.",
                "author": "Cyber1776"
            },
            {
                "raw_content": "https://x.com/nicksortor/status/1965517031660544347",
                "author": "grannylovestrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❗ Just in: Poland has CLOSED FOUR Airports under NOTAM, NOTAMs are now active for Warsaw, Lublin, Rzeszów, and Modlin due to \"unplanned military activity\"...",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let me guess, Ukraine has been launching drones from Poland",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Ukraine is desperate to draw NATO into the conflict, its the only way they win.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Pardon me while I exercise patience and restraint rather than exhibiting an emotional, knee jerk reaction to some potential happening in a region I care fuck all about.",
                "author": "HurtzLocker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After watching the video, you can't tell me other fathers don't feel this way.",
        "score": 1515,
        "text_content": "",
        "comments": [
            {
                "raw_content": "street justice is eventually going to start happening, all these judges are little presidents and think they can do anything they want with zero consequences.. because they can!",
                "author": "PunishedOrange"
            },
            {
                "raw_content": "Gary Plauché. Justice served. Both times.",
                "author": "PatriotPrep1775"
            },
            {
                "raw_content": "As a father, this infuriates me. I get sick to my stomach imagining that were my daughter",
                "author": "live3ordye"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Supreme Court allows the Trump administration to withhold $4 billion in foreign aid approved by Congress.",
        "score": 1767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck off with this ‘allows’ bullshit. Not you OP, but just in general.",
                "author": "jatergator"
            },
            {
                "raw_content": "I hope that $4 bil includes aid for Israel (I can dream.)",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "# \"ALLOWS\"",
                "author": "HellNoKameltoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Full Video of Decarlos Brown Jr stabbing Iryna Zarutska to death on a Charlotte, North Carolina light rail train (WARNING: Massive amounts of blood; This is the version the TV networks didn't show you).",
        "score": 1542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Execute that mother fucker",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "Nope. Not watching this one. That's nightmare fuel. The guy needs executed slowly like in green mile but worse.",
                "author": "Websitesdown"
            },
            {
                "raw_content": "I hate the content of their character.",
                "author": "Rope_Tree_Journalist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I want what they have / In Nepal, citizens capture communist politicians and throw them into the river.",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"God, ive seen what you do for others, i pray the same for me.\"",
                "author": "TurdBurglarGrimace"
            },
            {
                "raw_content": "Alligator Alcatraz would be the perfect place for this. How many commies does a Chinook hold?",
                "author": "LadyFannyofOmaha"
            },
            {
                "raw_content": "Being thrown into a shallow easily escapable river is somehow STILL a far worse punishment than any of our crooked politicians have gotten.",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Coast Guard just dropped a new video of them completely OBLITERATING a drug boat",
        "score": 1258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Drug boat? It looks like a dingy that is adrift.",
                "author": "Ronaldus"
            },
            {
                "raw_content": "Please sir may I have some more.",
                "author": "Austin62Halo"
            },
            {
                "raw_content": "Is it even manned?",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steven Crowder : White America, you just found your George Floyd. Are we supposed to be more offended at George Floyds situation than Iryna's? Because I sure as hell am not. Iryna didn't live a life harming those around her. She didn't choose to resist arrest. Iryna chose to get on",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She did not kill herself by swallowing fent like St George when he overdosed.",
                "author": "Nachos_and_cheese"
            },
            {
                "raw_content": "I think this is a good idea. Need a protest Saturday, especially in NC. She wasn't a Ukrainian, she was a blonde woman in America and that was all it took for a fatal attack.",
                "author": "Dieselslacker"
            },
            {
                "raw_content": "I’m loving the white awareness. Even liberal faggots are starting to be aware that everything we were taught in the 70-80s and 90s was complete bullshit.",
                "author": "jiminycricket1941"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump admin brings federal charge against suspect in train murder as new video shows victim collapsing onto floor as she bled out",
        "score": 1345,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we were going to bring back public executions, here's the guy.",
                "author": "killedmytv"
            },
            {
                "raw_content": "singular? There were 14 suspects who murdered her by continuously releasing this mindless animal",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Release the full and unedited video. People need to see the harsh reality of what Democrat leadership and racist, degenerate black culture has brought us.",
                "author": "20MagnusKonrad20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💀 MATT WALSH: This image provokes deep visceral rage in every father who sees it. I can’t even fully articulate it. It’s primal. We want scalps. We want heads on pikes.",
        "score": 420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is 1 million times more powerful than that dirty ape Floyd's self inflicted death. America's whites need to make this an infamous moment with which we can use to beat around the ears of every other n*gg*r ape loving retard wanting to shine \"their victimhood\" upon us. We either seize the moment and immortalize it or we lose.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "She looks so scared! Awful what he did to her!",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "We need to keep pushing. There doesn't have to be one more death like hers to see this bullshit judicial system changed. This is it. We must act now.",
                "author": "alfredbester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe PTSD",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The OP is profoundly naive. What's different this time is that the footage was released.",
                "author": "rae-lynngivens"
            },
            {
                "raw_content": "The last look on her face is fucking HAUNTING",
                "author": "PleaseHonk"
            },
            {
                "raw_content": "This is the video which draws the line in the sand. Seeing this video, and the Dem censorship followed by lies, it is now clear. The Democrats really do want us dead",
                "author": "FUSnowflake"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Apple announces N1, its own custom silicon for Bluetooth 6, Wi-Fi 7, and Thread",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The N1 and C1X were the most interesting thing they announced today, IMO. If the performance claims are anywhere close to reality then Apple has done a really nice job with these, much better than expected",
                "author": "TheYetiCaptain1993"
            },
            {
                "raw_content": "Broadcom was the previous networking supplier. >Apple previously used chips made by Broadcom to power Bluetooth and Wi-Fi within its smartphones. But now, Apple says the N1 chip will help boost the performance and reliability of features like AirDrop and Personal Hotspot. The iPhone 17, iPhone 17 Pro and Pro Max, as well as the iPhone Air, will all ship with the N1. With C1, C1X, and now N1, Apple has nearly completed its takeover of the iPhone networking stack in just 8 months, clearly arranged years earlier. I suspect the 18 Pro or 19 Pro will shift to some \"C2\" 5G modem. |Phone|5G Modem|Networking| |:-|:-|:-| |iPhone 12 Pro - 16 Pro|Qualcomm|Broadcom| |iPhone 16e|Apple C1|Broadcom| |iPhone 17 Air|Apple C1X|Apple N1| |iPhone 17|Qualcomm|Apple N1| |iPhone 17 Pro|Qualcomm|Apple N1| This will not be a small endeavor for Apple: only a handful of companies provide 5G modems and / or Wi-Fi 7. These chips require a long-term commitment for firmware, security, compatibility, optimization—and then updating it all again with the next standard every 2-3 years. I imagine these will be *highly* reused. EDIT: I realise it is called the \"iPhone Air\", but I don't want that versionless naming scheme stuck in my head for the next gen, so it's the iPhone 17 Air here. EDIT: 8 months, not 18! From the iPhone 16e launch.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Is this fabbed by TSMC?",
                "author": "Any_News_7208"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple announces $799 iPhone 17 with bigger 6.3-inch always-on ProMotion screen, A19 chip",
        "score": 449,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally a good base model iPhone after 4 years. Took them long enough the last good one was the 12.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "I was expecting Apple to continue being stingy with storage by making 128GB the base config again. 256GB base is a pleasant surprise coming from them. High refresh display finally too.",
                "author": "Asgard033"
            },
            {
                "raw_content": "Google is going to have to step it up. Their base of 128GB was already embarrassing but now their base phone is $100 more expensive than Apple for the same storage I owned my last iPhone in 2010 but man Google is making it tough to put up with them",
                "author": "Saneless"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple debuts A19 and A19 Pro processors for iPhone 17, iPhone Air, and iPhone 17 Pro",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The iPhone 17 Pro and Pro Max get a more powerful 6-core GPU. Apple is promising a 40% increase in sustained performance over the previous generation. # >The A19 Pro will power the new iPhone Air alongside the iPhone 17 Pro line. Like the A19, its six-core CPU utilizes two performance and four efficiency cores. The performance cores have better branch prediction and increased front-end bandwidth, while the new efficiency cores have a 50% increase in last-level cache.",
                "author": "LandGrantChampions"
            },
            {
                "raw_content": "Bluetooth 6!! They legit put in Bluetooth 6! They’re not behind for once!",
                "author": "talia_se"
            },
            {
                "raw_content": "N3P P cores: higher front end bandwidth and improved branch predictor E cores: 50% larger last level cache GPU cores: 20% faster, now comes with a neural/tensor core on each gpu core which gives it 3x peak compute performance over A18 Pro, 2x fp16 performance, unified image compression, 2nd gen dynamic caching NPU: higher memory bandwidth",
                "author": "FS_ZENO"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside Arm's New C1‑Ultra CPU: Double‑Digit IPC Gains Again",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The TL;DW of Arm's claims: 1. Arm has >75% IPC cumulatively since the Cortex-X1 with its \"six consecutive years of double-digit IPC gains\". 2. C1-Ultra has +12% perf / GHz vs X925 on GB6.3—some from SME2. This is pixel counting. 3. C1-Ultra has +20% perf / GHz vs 8 Elite on GB6.3—again no doubt from SME2. 4. X925 is 15% - 50% smaller vs two competitors (Gary believes it's Apple A18 Pro & Qualcomm 8 Elite), when compared iso-process, no L2. 5. Branch prediction improvements in perf & power. [**See**](https://youtu.be/U1tPpV0RWNw?t=223) the reduction in branch mispredicts chart, down 20% → 0% . 6. Instruction fetch: +33% increase in L1 instruction cache bandwidth, higher utilization for branch-heavy code 7. Front-end: OOO window size: +25% increase, up to 2K instructions in flight; more insruction elimination in front of the core, for move-immediates & move-vectors; some other node-specific scaling for BW & latency 8. Back-end: L1 data cache is 2x larger (128KB); OOO window size +25% growth, improvements in data prefetchers & reduction in back-end stalls. [**See**](https://youtu.be/U1tPpV0RWNw?t=367) the reduction in back-end stalls chart, down 49% → 0%, and replacement policy improvements. 9. C1 Ultra is -28% lower power for the same perf and +25% peak perf in GB6.3. Iso-power, it's about +15% perf. However, this *includes* node improvements—[**see**](https://youtu.be/U1tPpV0RWNw?t=496) the footnote. EDIT: added back the greater than sign for >75% IPC And then a few not-specific-to-C1-Ultra: 1. 2 Ultra + 6 Pro vs 2 Premium + 6 Pro yields >35% area savings. 2. Updated DSU this year, now onto C1-DSU. 3. Premium vs Pro: Premium offers up to 35% higher 1T perf. // Some napkin math: **+12%** perf / GHz in GB6.3 and **+14%** clocks (3.6 to 4.1 GHz) is \\~27%, a bit higher than Arm's claim of **+25%** on GB6.3 1T scores. I'll use Arm's estimate, because I'm just pixel counting: A18 Pro @ 4.0 GHz = 3479 | 870 pts / GHz *C1 Ultra @ 4.1 GHz = \\~3450 ish | \\~841 pts / GHz* 8 Elite @ 4.47 GHz = 3200 | 716 pts / GHz X925 @ 3.9 GHz = 2985 | 765 pts / GHz [Using NBC's data](https://www.notebookcheck.net/Mobile-Processors-Benchmark-List.2436.0.html?type=&sort=&deskornote=2&gpubenchmarks=0&archive=1&condensed=0&id=0&perfrating=1&or=0&condensed=0&showCount=0&showBars=1&showPercent=0&settings_class_array[]=1&settings_class_array[]=2&settings_class_array[]=3&settings_class_array[]=4&settings_class_array[]=6&settings_class_array[]=7&geekbench6_2_single=1&webxprt4=1&cpu_fullname=1&codename=1&l2cache=1&l3cache=1&tdp=1&tdp_turbo=1&mhz=1&turbo_mhz=1&cores=1&threads=1). I'd expect both A19 Pro & 8 Elite Gen2 to be faster in 1T here.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Some good *marketing* slides in here that I thought it deserved its own post.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "So they go kinda apple style naming but for specific CPU cores as I see it? Like C1 Ultra, C1 Premium, C1 Pro, and next gen will be C2 - XYZ? So just to keep track of the top CPU archs from the past 8 years: A76, A77, X1, X2, X3, X4, X925, C1-Ultra Or am I missrreading the naming?",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arm: \"Unleashing Leading On-Device AI Performance and Efficiency with New Arm C1 CPU Cluster\"",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh finally! Great to see a 1T perf / W chart for the C1-Ultra vs the X925. Great to see good perf jumps across each power level. >Through the C1-Ultra, Arm delivers a six-year trend of double-digit performance improvements … A big driver for this performance gain is delivered through double-digit IPC (Instructions Per Cycle) gains. I might assume +10% IPC to be realistic, but we'll see soon enough. EDIT: [\\+12% IPC on GB6.3, via pixel counting](https://www.reddit.com/r/hardware/comments/1nd4j0q/comment/nde64t5/). But, again I'll question, do we need to increase max. power every generation? Today's phones are fast enough, with 1T perf on par or beating modern laptop CPUs. // The C1 Pro with +16% IPC is most interesting: last year's A725 handily beat Apple's A18 Pro E-cores, Qualcomm's Oryon-M, and the A720 in perf / W **and** perf, [per Geekerwan's tests of Xiaomi's XRING O1 testing](https://youtu.be/cB510ZeFe8w?t=626). >It excels for workloads like gaming, providing a 16 percent uplift in sustained performance at the same frequency compared to the previous generation Arm Cortex-A725 CPU. Meanwhile, for video, web browsing, and social media use cases, the C1-Pro is up to 12 percent more power efficient than the Cortex-A725 CPU at the same performance. Very glad to see C1 Pro did not increase maximum power. // The names are actually decent. It's not a mouthful like Cortex-X925 and hopefully they *don't* shift the names again. We went from X4 → X925 → C1 Ultra in three short years. C1 Ultra replaces X925. C1 Premium is new \"sub-flagship\". C1 Pro replaces A725. C1 Nano replaces A520. So C1 = 2026 IP. I imagine Arm's and / or Apple's marketing teams had a giggle when they realised they both used C1 for a silicon chip.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "So this what the second generation Nvidia laptop SoCs will use. I wonder how the C1 Ultra stacks up to Apples stuff both in traditional usage and AI usage.",
                "author": "Vb_33"
            },
            {
                "raw_content": "The presentation is also found in this video with more detail: [New Arm CPUs and GPUs: Up to 45% Faster, Double the Ray-Tracing Speed, and SME2](https://www.youtube.com/watch?v=7-ZW1LnKJ60).",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "'NVIDIA Unveils Rubin CPX: A New Class of GPU Designed for Massive-Context Inference\"",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Companies can monetize at an unprecedented scale, with $5B in token revenue for every $100M invested. It practically prints money! -Jensen, probably.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "1.7 pb/s bandwidth is crazy.",
                "author": "Maleficent_Celery_55"
            },
            {
                "raw_content": "I recently heard about Nvidia ordering a lot of GDDR7 from Samsung. It now seems to make sense. Fascinating how Nvidia is mimicking the strategy of Tenstorrent in some ways. They infamously eskewed HBM in favor of GDDR6. Their Blackwhole chips have 32GB of GDDR6, they have a product that links together 4 for 128GB of memory.",
                "author": "djm07231"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Deliberately Burning In My QD-OLED Monitor - 18 Month Update - Monitors Unboxed",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know burn-in isn't going to happen to everyone predictably but the amount of preventative measures I've seen people take seems almost ritualistic. Running pixel refresh routines every day, black wallpaper, hiding all UI elements, avoiding any productivity software, constantly checking to see if burn-in is starting to set in, I don't want a monitor to take up that much of my mindspace whenever I'm using my computer.",
                "author": "CoconutMochi"
            },
            {
                "raw_content": "I didn’t even have to try. My Alienware QD-OLED burned in quite noticeably after only 10 months.",
                "author": "SirMaster"
            },
            {
                "raw_content": "He's getting a little annoyed with some type of displayed content after 18 months due to burn-in (or uneven ageing). So I'll have to wait longer before replacing my EIZO IPS monitor with an OLED one hoping this will be resolved in the future.",
                "author": "0xdeadbeef64"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Security Research: \"Memory Integrity Enforcement: A complete vision for memory safety in Apple devices\"",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Big if true, mitigating most memory exploits and spectre with almost no performance impact.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "They wrote custom malloc with bunch of other stuff looks promising",
                "author": "6950"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD FSR 4 now available in over 85 games",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The big thing in this update is that you can force FSR 4 via driver software in any game that suppports FSR 3.1 or newer.",
                "author": "Ramongsh"
            },
            {
                "raw_content": "kinda surprising to see ue5 titles still dropping and not supporting it edit: oh anything after 3.1 is money, nevermind",
                "author": "gokarrt"
            },
            {
                "raw_content": "They have really stepped up their game, they are on the same trajectory as DLSS 4 adoption.",
                "author": "atape_1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "We are eating good this year 😌 and Pokemon and Metroid on the way.",
        "score": 706,
        "text_content": "Are there any big third party games coming next? I wouldn't know who to follow on social media for these updates.",
        "comments": [
            {
                "raw_content": "Final fantasy tactics remaster is coming end of Sept too don't forget",
                "author": "MindfulMewtwo989"
            },
            {
                "raw_content": "I refuse to believe Metroid is coming out until I'm playing it.",
                "author": "seclusionx"
            },
            {
                "raw_content": "Prime 4 probably coming out December 31 or something",
                "author": "Real_human27"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "All RE Engine Resident Evil games are reportedly coming to Nintendo Switch 2",
        "score": 747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be surprised if they didn't. All of them are on PS4. Also, it's Capcom. They ported RE4 and RE5 a billion times.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Finally we are getting native ports for 2, 3 and 4 on the Switch The cloud ports sucked ass",
                "author": "N2-Ainz"
            },
            {
                "raw_content": "Bring us Re 2 and Re 4 remake!",
                "author": "ollielite"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Rebirth coming to Switch 2 in 2026 according to NateTheHate",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn't this all but confirmed in the switch 2 direct when square enix was talking about FF7 Remake",
                "author": "Every-Revolution-727"
            },
            {
                "raw_content": "This is not new. He said this in January, where has everyone been?",
                "author": "binderie1951"
            },
            {
                "raw_content": "The file size for FF7 Rebirth is roughly 150 GB on PC/PS5. The file size for the Switch 2 port will be interesting.",
                "author": "The6ix00"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What are niche/less known titles you want to be ported/enhanced?",
        "score": 16,
        "text_content": "AtomFall - I played it on gamepass but didn't finish it, I would be happy to jump back in on switch 2 and it being lightweight I think switch 2 version could even handle 60fps Spiritfall - theres a switch 1 version but I would like to play it at 1080p120fps portable, I bought it on launch on pc and its very fun, would double dip if updated on switch 2 RoboQuest - My go to fps roguelite, would be happy to take it on the go as well Project Wingman - basically created by PC Ace Combat fans when AC7 was taking its time to get into pc, while inspired by it, it can still stand on its own Remant 2 - love the first 1 never got around to beating 2, would buy it if it releases on switch 2",
        "comments": [
            {
                "raw_content": "Very, very wishful thinking, but I'd love to see all Mass Effect & Dragon Age games (yes, including Andromeda and Veilguard) there.",
                "author": "melobardo"
            },
            {
                "raw_content": "Remnant 2 and robo quest I would definitely double dip on",
                "author": "BeaveItToLeever"
            },
            {
                "raw_content": "Max Payne",
                "author": "Glass-Can9199"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Raidou Remastered (S2 version) just $34.99 now on Amazon",
        "score": 16,
        "text_content": "[Amazon.com: Raidou: Remastered – The Mystery of the Soulless Army Launch Edition - Nintendo Switch 2 : Video Games](https://www.amazon.com/gp/product/B0F666K47N/ref=ox_sc_saved_image_2?smid=ATVPDKIKX0DER&psc=1) [It's been in my cart for a while but now might just be the time to pick it up.](https://preview.redd.it/z5cvt7ldk6of1.jpg?width=1047&format=pjpg&auto=webp&s=349764f5a79c161138a279b1c59c5f34e3062720)",
        "comments": [
            {
                "raw_content": "Switch 1 version runs at same resolution and framerate on Switch 2 btw.",
                "author": "Zyvyn"
            },
            {
                "raw_content": "Nah, put it on the card otherwise the Switch version is superior",
                "author": "Aiddon"
            },
            {
                "raw_content": "“Waa game key card waaa”",
                "author": "Tookool_77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch Force: “I’m anticipating the Direct is announced tomorrow, giving a 48 hour notice for Friday’s show”",
        "score": 467,
        "text_content": "[https://m.youtube.com/watch?v=jY1NV6\\_wk6E&pp=0gcJCRsBo7VqN5tD](https://m.youtube.com/watch?v=jY1NV6_wk6E&pp=0gcJCRsBo7VqN5tD) (0:19)",
        "comments": [
            {
                "raw_content": "Wow, he's really going all in.",
                "author": "El_pibe_Monado92"
            },
            {
                "raw_content": "Makes sense. I don't think NOA is too keen on making the announcement on 9/11",
                "author": "makman44"
            },
            {
                "raw_content": "Imagine, if there was no announcement and we're just getting gaslighted.",
                "author": "Live_Present_2602"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Actors Who Are In The Running For God Of War's Kratos According To Film/TV Insider John Campea",
        "score": 162,
        "text_content": "According To Movie Insider John Campea (Who Has Been Reliable in past with leaks of [Spider-Man: No Way Home](https://thedirect.com/article/spider-man-3-no-way-home-tobey-maguire-andrew-garfield-sony-leaks-john-campea) & [Keanu Reeves Casted As Shadow](https://www.hollywoodreporter.com/movies/movie-news/keanu-reeves-joins-sonic-3-shadow-1235874487/)) He recently revealed he has heard these 10 actors who are in the running for Kratos (Also take into account, he has said in this list, there are actors that was his personal preference but some of these have been told to him from various people) * Winston Duke * Joe Manganiello * Christopher Judge * Manu Bennet * Jason Momoa * Travis Fimmel * Oliver Ritchers * Dave Bautista Link: [https://www.youtube.com/watch?v=C356jtN9s1c](https://www.youtube.com/watch?v=C356jtN9s1c)",
        "comments": [
            {
                "raw_content": "I love Christopher Judge; but I definitely don’t see him actioning it up like that. His Teal’c days are far behind.",
                "author": "Bobjoejj"
            },
            {
                "raw_content": "Judge obviously was great in the new games, but his body can't really handle it in live action, can it? He's had a ton of surgery. I'd personally wanna see Winston Duke or The Manimal Baptista.",
                "author": "Of_Silent_Earth"
            },
            {
                "raw_content": "Manu bennet is a good shout, he was great in spartacus and as deathstroke in arrow.",
                "author": "treeeelo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Necrolipe: Metroid Prime 4 has been rated 14+ in Brazil",
        "score": 293,
        "text_content": "https://bsky.app/profile/necro.universonintendo.com/post/3lyfyqawhgs2g",
        "comments": [
            {
                "raw_content": "#Universio Nintendo/Necrolipe is a Tier 5 - Pretty Much Clickbait as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Please announce a release date at the direct",
                "author": "Decimator1227"
            },
            {
                "raw_content": "![gif](giphy|fJBdqYlOoutB6)",
                "author": "Wazflame"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Dusk Golem] All Resident Evil games running on RE Engine will come to Switch 2, including Requiem",
        "score": 412,
        "text_content": "They will be native ports, not running on cloud [Source](https://xcancel.com/AestheticGamer1/status/1965421437784916412?t=g1pkKkZ5642qjSMljfpVWw&s=19)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I mean at this point, the Switch 2 should be able to run them",
                "author": "Always_A_Dreamer556"
            },
            {
                "raw_content": "Dusk golem makes this sub seethe so much, idc whether he’s legit or full of bs I just think it’s kinda funny",
                "author": "VictorVonDoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SEGA's Tokyo Game Show lineup lists four games as \"coming soon,\" they could potentially be revealed at a State of Play or Nintendo Direct that will take place before September 25th (the date TGS starts)",
        "score": 275,
        "text_content": "Source: https://tgs.sega.jp/2025/en/lineup/ TGS runs from September 25th to September 28th. If these games are going to be included in the lineup I assume they will have to be revealed before the show starts. I know both a Nintendo Direct and second State of Play have been rumored for this month, so this adds more fuel to the fire for those rumors",
        "comments": [
            {
                "raw_content": "Also RGG has a direct around that time so it can be Kiwami 3 or Stranger Than Heaven",
                "author": "Rbtmj2"
            },
            {
                "raw_content": "To add onto other comments, RGG recently talked about Like A Dragon Kenzan, one of the Yakuza spinoff games, on their youtube channel, which seemingly came out of nowhere. It's possible that the RGG games will be the new Virtua Fighter, Kiwami 3, and a Kenzan remake/remaster. [Link to the stream](https://youtube.com/watch?v=hO4R9e_7L7A) While I would love Stranger Than Heaven news, I'm not sure how ready it is (though it's further along than the new Virtua Fighter, so maybe it will have a preview or a demo?)",
                "author": "clicky_pen"
            },
            {
                "raw_content": "IMO it's going to be: the Jet Set Radio remake the Crazy Taxi remake either a Sonic Advance+Rush collection or a Sonic Unleashed remaster (there was that rumor from a Spanish website and the amount of stuff they remastered from Unleashed in Crossworlds is insane: Werehog, Apotos, Spagonia, Holoska, Dragon Road and the Eggman Expo which has Unleashed robots) Persona 6 (people expect TGA but TGS is a very big deal in Japan and most likely SEGA's big announcement will be the next mainline Sonic's reveal and more 40th anniversary stuff)",
                "author": "Laj3ebRondila1003"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD and Lenovo already confirmed as keynote speakers for CES next year",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really don’t like this trend of AMD taking up the majority of their keynotes to have CPU partners come up and talk about how great AMD is. I guess wall street wants to see it, but it’s just a bit dull unless they are launching a new lineup of AMD business or consumer laptops. 2026 isn’t even getting many products besides a 2026 APU refresh and of course Instinct MI400. Maybe they talk about FSR Redstone but that was promised for end of 2025. No GPUs likely coming in 2026 since we just got new ones this year.",
                "author": "titanking4"
            },
            {
                "raw_content": "Lenovo spokesperson? AMD high end Thinkpad (P16 without suffix and P1-equivalent) or he can shove it.",
                "author": "996forever"
            },
            {
                "raw_content": "Lenovo VS Dell? What’s better",
                "author": "disisfugginawesome"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "HP EliteBook 8 G1a 16 AI laptop review: Redesigned inside and out",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obscenely expensive for what it is.",
                "author": "Dante_77A"
            },
            {
                "raw_content": "I get that this is supposed to be an Enterprise grade or prosumer device but the cost for what you get in Hardware is absolutely atrocious. You can purchase a hx370 device with a better screen four times over for what this thing cost",
                "author": "dstanton"
            },
            {
                "raw_content": "Was hoping this would have the 8060S... am I disappointed YES. Is the USB controller on another $5000 HP Fury 16 (Intel) here in my office broken (might be drivers) yes... randomly goes \"unknown device\" at the root controller... sigh please HP do better.",
                "author": "gh0stwriter1234"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sellers in some US metros are growing so frustrated with the state of the housing market they are de-listing their homes at an alarming rate",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anything but lowering that price",
                "author": "JoshinIN"
            },
            {
                "raw_content": "They do that a lot now. Delist, wait 1-2 months then relist.",
                "author": "MakinBacon107"
            },
            {
                "raw_content": "Waiting for the better time when recession hits, people out of jobs, and AI bubble bursts. That should bring the demend up exponentially",
                "author": "cosmoinstant"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A third of US states could already be in a recession",
        "score": 346,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I live in a major texas city and the job market doesn't feel expansive, it feels contracted, I wonder how bad it must be elsewhere if Texas represents a 'good' job market.",
                "author": "tulkinghorn"
            },
            {
                "raw_content": "Wait until increased prices catch up with tariffs, people stop buying shit, and businesses can’t afford to pay off their C&I loans.",
                "author": "Economy_Ratio2001"
            },
            {
                "raw_content": "And dropping the rates won't fix it.",
                "author": "MarketCrache"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The housing market has gotten so bleak that even millionaires are renting right now | Fortune",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well the rent/price ratios are even worse in the higher ranges.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Financially it makes more sense to rent than buy. If you buy in a HCOL area you’re likely to pay $4-6k in mortgage payments. You can rent for $3-4k and you don’t have to put $50-200k down. The numbers just don’t add up unless you have a family and plan on being there long term. It’s more of an emotional decision at this point than a financial decision.",
                "author": "BadJuJu25"
            },
            {
                "raw_content": "The article makes it sound like it’s Bay Area tech workers moving to Texas and renting instead of buying (due to remote work). Seems like kind of a clickbait headline to me.",
                "author": "meechmeechmeecho"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Starting to get discouraged- home sale",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I know everyone is going to say the price but all the feedback we got from the showings no one said the price was too high\"",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Wake Forest, North Carolina. \\#NotTexasorFlorida",
                "author": "beardko"
            },
            {
                "raw_content": "lol this is a good one: “feedback was that the price was fair” i think i’ve seen this a million times now on r_realestate. sellers who fail to capitulate or think they can re-list in the Spring will pay for their arrogance in the form of eroded equity. this might be their down payment money. but it’s money they will be paying. back in 08 unemployment went from 5 to 10%. most people kept their jobs. first time home buyers reached the highest share of buyers ever. home sellers got skinned alive. please, re-list in the Spring",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Here's what happens when private equity buys homes in your neighborhood",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Save you a click: homes become more unaffordable, but neighborhoods become more diversified because different people rent.",
                "author": "RuleSubverter"
            },
            {
                "raw_content": "just decommodify housing already, and healthcare, and education, and utilities",
                "author": "Urshilikai"
            },
            {
                "raw_content": "At least in theory, when big money, investors buy residential real estate they have the wherewithal to develop it. They have the cash, they have the experience, and they have the political clout to get approval. So that should mean more housing, which helps everyone.",
                "author": "More-Dot346"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "7 Major Cities Are Now Buyer’s Markets—but Delistings Continue To Rise",
        "score": 47,
        "text_content": "Miami topped the list, boasting 9.7 months' supply. In other words, it would take close to 10 months to sell all of the city’s listings at the current pace. Austin, TX, ranked second with 7.7 months' supply, as buyer demand has softened in the pandemic-era boomtown while the total number of for-sale homes skyrocketed. Another major Sunshine State metro, Orlando, notched the third-highest months of supply in the U.S. at 6.9. Four other metros earned the distinction of having elevated months of supply, including New York City (6.7), Jacksonville, FL (6.3), Tampa, FL (6.3), and Riverside (6.1), landing them in buyer's market field. https://www.realtor.com/news/trends/monthly-housing-report-august-2025-buyers-market-delistings/",
        "comments": [
            {
                "raw_content": "Awesome to see those are now Buyers Markets! Now, if someone could just find some Buyers willing to move to either state...",
                "author": "Alexandratta"
            },
            {
                "raw_content": "As someone who lives in Miami, the people here delisting their homes are absolutely delusional. If folks think rate decreases are going to bring people back to the market, I think that's wrong. The reason why rates are going to be lowered is due the awful job market. No one is buying a house with all the headwinds the current economy is facing.",
                "author": "coldshowerss"
            },
            {
                "raw_content": "Seattle will never ever be on this list 😒",
                "author": "slifm"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Asking Rents Rise Most Since 2022 As Apartment Construction Slows",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t see them at all talking about real versus nominal rents, so I think they’re just talking about nominal rents. And if you’re saying 2.2% nominal increase when inflation is like 2.8 the rents have gone down in real terms.",
                "author": "More-Dot346"
            },
            {
                "raw_content": "Not in DFW at all Just to give you an idea, I received a lease renewal offer in which the base rent amount stayed flat which is almost unheard of. I even received a $200 concession offer if I were to sign the renewal within 2 weeks. More U-Haul trucks for people to move out than move in for my building. For people looking for a new apartment, the deals are even better. 6-8 weeks of free rent is standard with some even offering $500 - $1K gift cards in addition to reduced or waived application fees (things that aren't captured in these types of reports). I have seen a few new apartment buildings with empty parking lots in my neighborhood and less than 20% occupancy rate and I'm being very generous with that figure. Edit: Added a lot more words",
                "author": "beardko"
            },
            {
                "raw_content": "My rent stayed the same in the Tampa Florida area",
                "author": "special_combustion"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Job growth revised down by 911,000 through March, signaling economy on shakier footing than realized",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surprise, surprise...",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "We don't need revisions to tell us what we already knew. Economy has been shit for last 2/3 years and it's only going to get worse. They'll probably try their favorite solution which is to print money to bail out the banks/corporations and give the tax payers a few hundred bucks in stimmy or tax credits.",
                "author": "MakinBacon107"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seedance-4-edit ended my profession",
        "score": 238,
        "text_content": "Guys, it’s a wrap. A few weeks after the next major update, I guess the 3D real estate artists at our company are going to get their termination letters. Looks like we’re all in for a wild ride.",
        "comments": [
            {
                "raw_content": "As a Cad Drafter in training, I’ve been getting increasingly terrified lol… at least I know wood working 😅",
                "author": "yollobrolo"
            },
            {
                "raw_content": "I have no idea how we are going to handle the massive crisis we are gonna have on our hands due to these AI. While I believe that AI isn't going to replace everyone in sectors like IT or the one OP here has mentioned but I feel like a decent chunk of people are gonna loose their job. How are the governments going to accomodate so many people. I know you can't really stop this revolution but it feels depressing each passing day.",
                "author": "N30_117"
            },
            {
                "raw_content": "Ended your career right there",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedream 4 is mind-blowingly good",
        "score": 1950,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't look at the sub this was posted on, I thought it was a camera you were talking about.",
                "author": "SoupOrMan3"
            },
            {
                "raw_content": "\"there is no such thing as reality, only perception\" - Gustave Flaubert Dude in 2026: How do I know if this photo is real? Gustave Flaubert's AI: You can't.",
                "author": "QYQ100"
            },
            {
                "raw_content": "These look like legit photographs. Insane...",
                "author": "Business_Comment_962"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Microsoft will use Anthropic models to power some features of Office 365 Apps",
        "score": 332,
        "text_content": "https://www.theinformation.com/articles/microsoft-buy-ai-anthropic-shift-openai",
        "comments": [
            {
                "raw_content": "Microsoft's investment strategies are truly perplexing",
                "author": "ethotopia"
            },
            {
                "raw_content": "There's a non-paywalled article from Reuters here: https://www.reuters.com/business/microsoft-use-some-ai-anthropic-shift-openai-information-reports-2025-09-09/ Some notable excerpts: >Microsoft will pay its cloud rival Amazon Web Services to access the Anthropic models, according to the report. >Developers making Office AI features found Anthropic's latest models performed better than OpenAI in automating tasks such as financial functions in Excel or generating Powerpoint presentations based on instructions I think this is a pretty shocking move. There has been talking about cracks in the Microsoft/OpenAI relationship but this seems like a major schism. They're going to pay another cloud/AI competitor rather than use the model they effectively get at-cost? Is GPT really that much worse for this task?",
                "author": "swarmy1"
            },
            {
                "raw_content": "OpenAI uses Google's TPUs on a small scale, Google is an investor in Anthropic, and Microsoft also supports Google's A2A protocol. They are all intricately connected, like a spiderweb, constantly blurring the lines between friend and foe as they subtly shift the dynamics of their relationships.",
                "author": "AGI_Civilization"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Imagen 4 vs Seedream 4 (Same prompt)",
        "score": 70,
        "text_content": "**Prompt: A gaming room setup computer desk, keyboard, mouse, in student bedroom Toronto apartment large window show night Toronto downtown night, midnight , photographed by Canon EOS R6, 135mm, 1/1250s, f/2.8, ISO, highly detailed**",
        "comments": [
            {
                "raw_content": "Seedream definitely looks more photorealistic",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Left : Imagen 4 - Right : Seedream 4",
                "author": "Bronkilo"
            },
            {
                "raw_content": "Where can I try this Seedream 4",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA Unveils Rubin CPX: A New Class of GPU Designed for Massive-Context Inference",
        "score": 83,
        "text_content": "For people who actually care about what the future will look like.",
        "comments": [
            {
                "raw_content": "“The NVIDIA Vera Rubin NVL144 CPX platform packs 8 exaflops of AI performance and 100TB of fast memory in a single rack.”",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "100TB of GDDR7? Holy shit",
                "author": "Eritar"
            },
            {
                "raw_content": "Still not fast enough.",
                "author": "ThatBanterousOne"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists Use Engineered Cells to Reverse Aging in Primates",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I read the entire paper. First off, yes it's legit - biggest research org in the world publishing in a top tier journal. The findings suggest a major advance in anti-aging therapies in primates. Mesenchymal stem cell (MSC) therapies have been tested in primates before, but this study introduced genetic (FOXO3) modification to the MSCs in order to make them resistant to cellular senescence. Long story short: they found plenty of evidence supporting systemic amelioration of aging (more than I care to summarize) with minimal side effects over 44 weeks of bi-weekly infusions. They also explicitly state in the discussion that they had the following objectives: (1) developing a universal, shelf-ready human stem cell product with enhanced safety and anti-aging efficacy. (2) Establishing a quantitative comprehensive assessment tool for primate multi-organ aging and its interventions. (3) Charting a translational medicine roadmap for future human aging interventions.",
                "author": "Impressive-Yam-4446"
            },
            {
                "raw_content": "Here's the full paper: https://www.cell.com/cell/fulltext/S0092-8674(25)00571-9",
                "author": "jeffkeeg"
            },
            {
                "raw_content": "This sound huge to me (a layman) shouldn't it be on the NY Times even?",
                "author": "banaca4"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon wants to scrap Twitter's recommendation system and replace it with a Grok-powered version",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is like trying to make an LLM play chess. Maybe it will work, but it will take a lot more compute and will be a lot worse than the narrow AI specialized on the task.",
                "author": "doodlinghearsay"
            },
            {
                "raw_content": "\"Grok AI recommendations\" would just be starting with Tweepcred and adjusting based on what maximizes engagement or page views or whatever they say. Which is presumably already what Tweepcred does, maybe just slightly more automated. Social media recommendations are already ML'd to death I can't imagine this changes much.",
                "author": "JoshAllentown"
            },
            {
                "raw_content": "Incredibly expensive and mostly worthless. Like Hyperloop.",
                "author": "wyldcraft"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "1 server rack = 100 NVIDIA Blackwell racks?",
        "score": 16,
        "text_content": "Link: https://euclyd.ai/ I honestly didn’t expect Kastrup to be behind an AI hardware startup. If this holds up, it’s not just a leap in efficiency but could shake up both the AI hardware and energy debates in one move.",
        "comments": [
            {
                "raw_content": "> you don’t believe it? I really don’t see how this is possible. It’s like if someone said they made a gas car that gets 3,000 mpg. If they’ve done something extraordinary that 10,000 of the best engineers at nvidia couldn’t figure out then that’s great and good for humanity and they deserve a trillion dollars, but until evidence is shown I remain skeptical.",
                "author": "Interesting_Yam_2030"
            },
            {
                "raw_content": "I don't get it. They claim 1.024 exaflops at FP4 while using 125 kw. They claim 100x the tokens per second, but how do they achieve this? I am skeptical.",
                "author": "ezjakes"
            },
            {
                "raw_content": "Bernardo Kastrup has an AI company? Since when?",
                "author": "ifull-Novel8874"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedream 4.0 still sucks at maps",
        "score": 9,
        "text_content": "Prompt 1: generate a political map of the United States of America, in the style of wikipedia. Prompt 2: a political map of cities in the People's Republic of China, with all cities labelled accurately in English. Prompt 3: generate a metro map of the New York City subways, in a typical style of the city Prompt 4: generate a map of provincial rugby union teams in New Zealand for a poster.",
        "comments": [
            {
                "raw_content": "You still suck at prompting",
                "author": "Adventurous_Pin6281"
            },
            {
                "raw_content": "How do I access seedream 4?",
                "author": "Feed-Live"
            }
        ],
        "subreddit": "singularity"
    }
]