[
    {
        "post_name": "Daily Beast RETRACTS story that tried to link Melania Trump to Jeffrey Epstein.",
        "score": 1093,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Daily Beast is Web Hubbles daughter",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "You don't hate the media enough.",
                "author": "JamesSunderland"
            },
            {
                "raw_content": "Sue anyway. Nuke them from orbit. You know the rest.",
                "author": "AuPhalanx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tomorrow. Let's go!",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol Canada is fucked",
                "author": "IslandMan69"
            },
            {
                "raw_content": "Happy Hulk Hogan Day!",
                "author": "MythArcana"
            },
            {
                "raw_content": "Happy Tariff Day!!!!",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gapped-tooth Democrat Stacey Abrams smears ICE agents, saying they are \"secret police\" conducting “inhumane abductions and illegal deportations.\"",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So much fatigue.",
                "author": "Meddlesom"
            },
            {
                "raw_content": "This bitch got TWO BILLION DOLLARS and still waking around free?",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "How many billions did these Democrats steal in the last 100 years? What about the 3-4 computers Elon found that printed unlimited money? How much was stolen and where did it go to?",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden — randomly shouting — claims President Trump is working to \"erase\" everything his administration did. Correct.",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody misses this guy. Historically, he'll be remembered as a hyphen. 45 - 47.",
                "author": "16BeatsAOne"
            },
            {
                "raw_content": "Not 'administration. *Biden REGIME*. 2020 election stolen and installed illegitimate president.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Isn't he dying? Hurry the fuck up, shitbag.",
                "author": "MemeWarsVet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Please lord, let the sun finally shine on the spirit of Seth Rich...",
        "score": 1152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kinda hard to read. What's it say, friend?",
                "author": "dontdrinksoy"
            },
            {
                "raw_content": "John Podesta said the leaker should be made an example of.",
                "author": "rootGoose"
            },
            {
                "raw_content": "p@ssw0rd",
                "author": "Citizen_Bob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bought this shitcoin in 2013 and it’s already worth half 😡😡😡😡😡",
        "score": 1349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "is that how bad the buying power has gone down? 2013 doesn't even feel that long ago... edit: It's not 50%....but it's 28% down..",
                "author": "AccipiterQ"
            },
            {
                "raw_content": "I bought Bitcoin at $10",
                "author": "mikejones"
            },
            {
                "raw_content": "Bring back the gold standard",
                "author": "JebediahBush"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HIS NAME WAS SETH RICH: Julian Assange accidentally told us they murdered Seth Rich for uploading the DNC emails and giving them to Wikileaks. It was never Russia and everyone knew it. It was treason.",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He nodded his head.",
                "author": "Yignuced"
            },
            {
                "raw_content": "From the get go we knew. That’s why they kicked us off Reddit.",
                "author": "Siteless_Vagrant"
            },
            {
                "raw_content": "We have known for so long Come on Kash and Bong lord",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK: English lady protesting against hotels filled with unvetted migrant men: \"We have a King more interested in appeasing Islam than helping the British people... ..if they come from war torn countries, why do they leave their wives and children there?!",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s quit pretending that this is a big fucking mystery… ISLAM IS TRYING TO TAKE OVER OUR COUNTRIES AND WE BETTER START TREATING THEM LIKE HOSTILE INVADERS BEFORE THE FUCLING KILL US ALL. GET THEM THE FUCK OUTTA HERE",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "The King was NEVER interesting in helping \"his own people.\" Going back hundreds of years. That is the whole reason for The 1776 Revolution! 1776 WORLDWIDE!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "… And now she’s in jail. Most likely.",
                "author": "EffectiveTactics"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senior Vice President of Soros Open Society Leonard Benardo has locked this X account",
        "score": 934,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2 towers 1 hat",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "Alright. Something has to be going down behind the scenes because these types of people don't fear anything. But it's not like the DOJ doesn't have their tweets. More likely, they are trying to control the narrative and maybe stop the media and independent journalists from reporting on their scandals.",
                "author": "JDVance4President28"
            },
            {
                "raw_content": "big fuckin deal still no arrests",
                "author": "EgregiousPhilbin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ron DeSantis: In honor of a great Floridian, Hulk Hogan, we are lowering the flags at the capitol and in Pinellas County tomorrow. Additionally, I am officially declaring tomorrow, August 1st, 2025, as \"Hulk Hogan Day\" in Florida. Rest in peace, brother.",
        "score": 1733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based Hulk Hogan would end many of his tweets with HH",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Remarkable respect for The Hulk Hogan, Terry Gene Bollea. RIP",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "It is the most Floridan thing Florida can do to honor a Florida Man",
                "author": "SparkleMTN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "76% of X traffic is bots according to FORTUNE. They also claim over half of all the internet is bots and inauthentic",
        "score": 851,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That seems pretty good since I assume Reddit traffic is 98% bot. Anyway, this seems fake--a made-up stat to try to attack Elon and undermine the only mainstream free speech platform the Democrat lunatics don't control. There's no chance in hell TikTok has only 2.56% bot traffic but X has 75%. Yeah right.",
                "author": "wololo"
            },
            {
                "raw_content": "I am also a Russian bot so whatever",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "76% of people in real life are bots, LOL",
                "author": "Cyberpunkd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump imposes a massive new reciprocal tariffs including:",
        "score": 1021,
        "text_content": "",
        "comments": [
            {
                "raw_content": "American maple syrup futures sky high",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Day traders on suicide watch.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "Trump going to break Canada. And I don’t care that much, but I thought we already had a deal with Vietnam? I thought they were one of the first.",
                "author": "magamagamaga123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: President Trump's White House just released a BADASS \"Make America Fit Again\" ad with Triple H. This is what I voted for!🔥",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone in this thread do 10 pushups or get the fuck out Drop",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "The woke wrestling fans are gonna lose their minds over this.",
                "author": "HairOfTheDoge"
            },
            {
                "raw_content": "Reddit: \"here's why fitness is bad.\"",
                "author": "Kaarous"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hillary put this out knowing it was all a setup that she was involved in - Arrest Hillary.",
        "score": 1530,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously… NOW can we arrest this bitch ?",
                "author": "carbonsteel"
            },
            {
                "raw_content": "He gave that bitch a pass. Someday that's gonna bite him in the ass.",
                "author": "AFferalAF"
            },
            {
                "raw_content": "Jake Sullivan comited treason",
                "author": "trex554"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Manhunt underway after 2 illegal aliens attempted to kill ICE Agents in Colorado Springs. Both illegals are currently at large.",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop apprehending and start morgue-ing.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Why we left Colorado Springs, never saw a city change so fast.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "BREAKING - WTF is that reporter wearing?",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is what the Democrats are doing to our Nation!",
        "score": 932,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is also what Republicans who are not MAGA are doing",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "Recess appointments Johnson you fucker!",
                "author": "Bedminster"
            },
            {
                "raw_content": "Uhh... doesn't Speaker Johnson factor into this in some way?",
                "author": "conservatarian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP JUST NAMED TRIPLE H TO RUN THE PRESIDENTIAL FITNESS TEST NATIONWIDE 🇺🇸 💪🏼",
        "score": 1371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TIME TO PLAY THE GAME, KIDS!",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Nothing says fitness like steroids.",
                "author": "AFferalAF"
            },
            {
                "raw_content": "lmao I love living in current year",
                "author": "ecto_coolest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Google loses app store antitrust appeal, must make sweeping changes to Play Store.",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Google has lost its appeal in the long-running app store antitrust case, which marks another major victory for Epic Games. Google lost the original case in 2023 when a jury found it abused its market position in smartphones to block competition from Epic and others. Google was able to get the penalties suspended while it pursued its appeal, but now it may need to make plans for a more open future on Android. Oh look Google is as walled off as Apple....how shocking.",
                "author": "SparkleMTN"
            },
            {
                "raw_content": "epic games is one of the most faggot ESG companies in the market",
                "author": "lilbuffkitty1"
            },
            {
                "raw_content": "Google... or Epic Games... Google... or Epic Games... This is like cheering for Palestine or Israel. Fuck them both.",
                "author": "Meddlesom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TIME TO GET FIT YOU FAGGOTS",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do one push up every time the government tells a lie. (I'm ripped)",
                "author": "OnePumpChump"
            },
            {
                "raw_content": "I don’t give a fuck, I loved the attitude era of WCW/WWF. That shit was so fun.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "DEGENERATION X",
                "author": "EdBuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SMOKING GUN",
        "score": 1490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOCK. HER. UP. Two weeks, not holding my breath anything will ever be done to address this.",
                "author": "MikesDong"
            },
            {
                "raw_content": "I can't see it, please use more red lines.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "All of this means Diddly Squat unless there are legal ramifications.",
                "author": "Landslide_2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Now \"World's Fastest\" in Nearly all Processor Form-factors",
        "score": 536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dont know lack of competition will let them turn into intel or nvidia (decadence,greed) but If there is a peak to show in amds processor business. This is it.",
                "author": "Sevastous-of-Caria"
            },
            {
                "raw_content": "Not a fan of monopolies, especially not when there are no innocent players in the industry, so hopefully competition comes soon to force a win to the consumers, not to one particular company.",
                "author": "ocxtitan"
            },
            {
                "raw_content": "dont like how things are going rn. with intel getting weaker every day we might see another few years of consumer cpu monopoly soon. at least until intel gets back on track or arm stops being niche",
                "author": "MysteriousBeef6395"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel XeSS 2.1 released, brings support for other vendors GPUs",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "XeSS-FG (Intel Frame Generation) and XeLL (Low Latency) for RTX 3000 and RX 6000 Really nice But is there a technical reason that XeLL doesn't work standalone in non Arc GPUs? Strange that it needs XeSS-FG enabled on those for it to work I wonder if Nvidia will ever bring DLSS frame generation to the RTX 3000 series...",
                "author": "darkbbr"
            },
            {
                "raw_content": "Whaat? This is interesting. Hopefully this garners interest on the same level of deep dives and analysis on upscaling and FG like with DLSS and FSR. Also, the distinction between XMX and DP4a.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Pretty impressive stuff, can’t wait for the DLSS3 to XeSS FG mod to come out Can’t wait to see it be tested",
                "author": "steve09089"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese CPUs are closing the gap on AMD — next-gen Zhaoxin chips feature 96 cores, 12-channel DDR5 memory, and 128 PCIe 5.0 Lanes",
        "score": 113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a single benchmark..",
                "author": "hey_you_too_buckaroo"
            },
            {
                "raw_content": "If it’s anything like the GPUs they are making it’s a pretty wide gap they need to close.",
                "author": "Marcus_The_Sharkus"
            },
            {
                "raw_content": "These cpus aren’t for us to purchase so anyone who thinks these are to “increase competition” is naive. These CPUs are being developed so china doesn’t depend on Taiwan, which they have political conflict with. These developments won’t reduce cpu prices for the western market at all.",
                "author": "kwirky88"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel’s potential exit from advanced manufacturing puts its Oregon future in doubt",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are comments on Intel threads so unbelievably insufferable?",
                "author": "iwannasilencedpistol"
            },
            {
                "raw_content": "Anyone else see a serious problem with… essentially 50-100 people in the world only being the ones with the knowledge to actually make this shit work at scale?",
                "author": "FieldOfFox"
            },
            {
                "raw_content": "All this factory-stuff with Intel laying people off, really got me thinking … Intel really needs customer-contracts for their foundry, to get things going, I suppose? It's as if it would \\*tremendously\\* help Intel, when they'd get, I don't know … *Like contracts for a shipload of tiny stuff, to quickly get up the yields and make their processes actually viable!* Imagine someone came over to Santa Clara, just to offer them such a contract, like for millions of tiny little chips!!!",
                "author": "Helpdesk_Guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China summons Nvidia to explain ‘back-door’ safety risk of H20 chip",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the US government openly claims that high end NVidia chips should come with backdoors and that sales should be resumed to keep China from developing their own chip industry, its no wonder China might not be too keen on blindly allowing these sales again.",
                "author": "Moikanyoloko"
            },
            {
                "raw_content": "It’s all over the news here in HK",
                "author": "Impressive_Age_6569"
            },
            {
                "raw_content": "So what is the back door? How would it work here?",
                "author": "stu_pid_1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Phoronix] AMD EPYC 4545P Review: 16 Zen 5 Cores @ 65 Watts For Low-Power / Energy Efficient Servers",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lenovo Legion Go 2 Appears in Early Review and Disassembly Video, Stomps MSI Claw A8 in Shadow of the Tomb Raider",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bummer that we're still getting RDNA 3.5 in these GPUs. Unless your handheld is falling apart i'd stay away until we RDNA4 makes it to laptop/handheld form factors, or just grab a cheap steam deck to hold you over for another year",
                "author": "oh-monsieur"
            },
            {
                "raw_content": "So much emphasis on a 7 year old game nobody plays",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "I really love, that if you read the article, you have different feeling that the statement in the headline :) >According to the reviewer, the difference in performance comes down to the ability to cool the Ryzen CPU cores and AMD Radeon 890M inside these machines, since both were tested after reaching a thermal steady state, and the tester mentions that the Claw was overheating, while the Legion Go 2 managed to keep temperatures in the 70s. >The reviewer, Lines Tech on YouTube, tested the handheld gaming PCs in Shadow of the Tomb Raider, and the Lenovo Legion Go 2 averaged 49 FPS, while the comparable MSI Claw device managed an average of 44 FPS—a whole 10% slower than the Legion Go 2. These tests were seemingly conducted at 1080p with Frame Generation and other AMD FidelityFX features disabled. It should also be noted that the Legion Go 2 has 8 GB more RAM",
                "author": "Michal_F"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's win, Intel's pullback, and a shifting chips landscape",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "intel ability to stumble is truly unmatched, is there any more high-end chips node left now that 18a is canceled?",
                "author": "ShoutOfDawn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Where the heck are all the Switch 2 patches for Switch 1 games?",
        "score": 653,
        "text_content": "I wasn’t outright disappointed in the direct, in fact I’m excited about a few of the games announced like Yakuza and Persona 3. What I am dissatisfied in is the lack of announcements regarding Switch 2 enhancement patches. I don’t think I’m alone in having a big backlog of games I want to get through from the Switch 1. I’d love to start knocking it out, but playing some of them with their subpar resolutions on Switch 2 is not ideal. Where is the Witcher 3 patch? Or even Skyrim? What’s most disappointing too is that Nintendo titles themselves aren’t getting new patches. I’d love to replay Fire Emblem Three Houses again but it’s hard to when the game doesn’t look that great docked right now. How about some Xenoblade Chronicles patches? Nintendo took the time to patch New Super Mario Bros. U Deluxe, but where the HECK is the Super Mario Wonder Update that game would look amazing with one! Or how about an easy layup to build up hype for Metroid Prime 4; announce a Switch 2 update for Metroid Prime Remaster. That game is BEGGING for a Switch 2 update, it would look so glorious at 4K. Was Nintendo that stingy with Dev Kits that they didn’t even give their internal studios kits? I love my Switch 2 but I really want more patches to take advantage of the extra power.",
        "comments": [
            {
                "raw_content": "They didn't even show or announce it, but Dragon Quest 3 HD-2D got a free Switch 2 patch.",
                "author": "GroundbreakingToe440"
            },
            {
                "raw_content": "I want Witcher 3 and Pikmin 4 patches.",
                "author": "Half-Wombat"
            },
            {
                "raw_content": "We are also getting a new octopath game but no enhancements for 60fps on switch 2 for the old ones ☹️",
                "author": "Googhy2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Direct Was Trash",
        "score": 2655,
        "text_content": "Only good things were P3 Reload and Zelda. I understand not everything was gonna be amazing and I didnt expect huge titles to be dropped but damn i expected some quality",
        "comments": [
            {
                "raw_content": "Please keep in mind of the subs rules in the comments, we also have a discord if you want to discuss the topic there: https://discord.gg/r-nintendoswitch2-1354108819432673322",
                "author": "Insta36o_user"
            },
            {
                "raw_content": "bruh what the hell was that campfire game",
                "author": "mcguffin99"
            },
            {
                "raw_content": "RAT GAME",
                "author": "asleep-or-dead"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Third parties have no excuse, since Cyberpunk is on Switch 2.",
        "score": 1208,
        "text_content": "When the game is at GTA6 level, Skipping the console or poor optimization is acceptable. But so far, I haven't found any games that's on GTA6 level",
        "comments": [
            {
                "raw_content": "They have because CD project red received dev kit of switch 2 before official release of the console so they had a lot of time to prepare their port of cyberpunk",
                "author": "Consistent-Bath5257"
            },
            {
                "raw_content": "It has been, and I cannot stress this enough, less than two months. Ports and new developments will come, be patient.",
                "author": "twili-midna"
            },
            {
                "raw_content": "And not a game key card.",
                "author": "The1Pete"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sold",
        "score": 901,
        "text_content": "Day 1, easily. Gorgeous, feels pretty fluid, hints at a ton of depth in the mechanics.",
        "comments": [
            {
                "raw_content": "It's a great game so far and they're asking for feedback also which is an added extra can only mean they truly care about the players experince",
                "author": "Adventurous_Day470"
            },
            {
                "raw_content": "Wait… is this an ARPG?!? This isn’t turned based?!? Omg…",
                "author": "rrrand0mmm"
            },
            {
                "raw_content": "The Adventures of Elliot: The Millennium Tales sure does look great! And there's a free Debut Demo available now on eShop 😃 Edit: Downvotes for giving the name of the game, which is missing from the OP and hasn't been mentioned yet in the comments? You do you, Reddit. Edit 2: The downvoting situation has been resolved, updating this comment by popular demand.",
                "author": "IfYouVoteMeDown"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What kind of bullshit is this???",
        "score": 1361,
        "text_content": "Bro seriously?",
        "comments": [
            {
                "raw_content": "\"Fuck we barely got anything to show, alright first dev team who can throw together a game using our new Switch 2 chat functionality will get featured in the direct next month\" The fact this costs 15$ is hilarious",
                "author": "DrVagax"
            },
            {
                "raw_content": "What you mean? This game is fire",
                "author": "ChaosVII_pso2"
            },
            {
                "raw_content": "That’s what we are gonna play instead of Elden Ring",
                "author": "unbangreninja"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "WHY IS NO ONE TALKING ABOUT THIS",
        "score": 602,
        "text_content": "I really wasn’t excited for much in the Direct either but PVZ for Switch is being barely talked about, it’s gonna have multiplayer too so i’m hyped and i think this might be one of the best games in the Direct, Persona 3 and DB Sparking Zero also are exciting too, off topic but if Persona 3 reload is coming to Switch the new Persona 4 remaster might come aswell which is awesome, i just wanted to know if anyone else is excited for this",
        "comments": [
            {
                "raw_content": "PVZ Content finally! ![gif](giphy|13mPeKqo7YBZhS)",
                "author": "r_ihavereddits"
            },
            {
                "raw_content": "Almost a 20 year old game, this thing better be dirt cheap.",
                "author": "Pretend-Studio6583"
            },
            {
                "raw_content": "because i played this game on my phone over a decade ago?",
                "author": "sirms"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 has sold 5.82 Million Units Worldwide as of June 2025.",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mario Kart World has also sold 5.63M units worldwide. [Source](https://www.nintendo.co.jp/ir/en/finance/software/index.html)",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "Chronically online bros will never be taken seriously again.",
                "author": "blownaway4"
            },
            {
                "raw_content": "A Wii U situation indeed. As in it sold close to half the Wii U's lifetime sales in less than a month.",
                "author": "maronic03"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shockingly weak direct",
        "score": 1272,
        "text_content": "Not very reassuring after seeing how weak the title lineup here is, no genuinely high value ports that make me feel like this is a new generation of console.",
        "comments": [
            {
                "raw_content": "Please keep in mind of the subs rules in the comments, we also have a discord if you want to discuss the topic there: https://discord.gg/r-nintendoswitch2-1354108819432673322",
                "author": "Insta36o_user"
            },
            {
                "raw_content": "Really? You don’t want to build a campfire?",
                "author": "ChaosVII_pso2"
            },
            {
                "raw_content": "Idk what you’re talking about, Chillin By The Fire about to be GOTY 🔥🔥🔥",
                "author": "HenryTheHollowHermit"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "HLX aka HL3 claimed to potentially be in its \"final\" phase of development",
        "score": 547,
        "text_content": "New hefty Counter Strike 2 and Deadlock (which had its own hero roster leak again) updates came out. You know what that means. The Source 2 dataminers are back at it gain. Grain of salt and all that, you know the drill. GabeFollower and Tyler Mcvicker released the usual videos within striking distance of each other, the takeaways: * Reiteration of previously datamined mechanics: heavy physics gameplay, thermodynamic mechanics, AI improvements, vehicle simulation, etc. * Thumper and Antlions \"confirmed\". * Dynamic wind system that affects gameplay. Connected to a possible weather system. * Tons of refactoring and heavy documentation occurring within the codebase. Presumably occurs during the late stages of development. Also potentially might hint at mod support day one or close to it. * **RUMOR** - Gabefollower claims HLX (Half Life 3) is already at the stage where some parts of the project is already finished and just needs a bit more polish. Valve developers have been moving around different projects. Usually this means that the original project they were working on is a sinking ship they ran away from but this time around, it might mean that their work isn't needed for HLX anymore. Additionally, HLX might have non-hitscan weapons with bullets that are directly affected by the gravity conditions of an area. In conjunction with the refactoring news, Mcvicker believes that if this were any other company he'd think we were at the final final stages of development but Valve is Valve so yeah. Though the amount of refactoring occurring does heavily hint at large swathes of the game most likely being done already.",
        "comments": [
            {
                "raw_content": "crazy that we might be finally at the tail-end of half-life 3 jokes after nearly two decades",
                "author": "KingdomBartsFinalMix"
            },
            {
                "raw_content": "Until I'm at the end credits of Half-Life 3 I don't believe it's even a thing.",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "For a bit more info on McVicker’s video. A lot of the stuff they are updating is stuff meant to be seen and used by the player/end user (explanations for mechanics and different things with the engine as examples) and in most dev cycles these are usually thing left until the end of development. That said, this is Valve, so going off of usual dev cycles doesn’t really work the same way.",
                "author": "LordtoRevenge"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate says more Sony games will come to Xbox",
        "score": 562,
        "text_content": "https://xcancel.com/natethehate2/status/1950948600885690817?s=46 No specific games are known yet.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I will wager that MARVEL Tōkon will come to Xbox eventually.",
                "author": "uncanny_mac"
            },
            {
                "raw_content": "Remember Nate the Hate being the first one to leak HiFi Rush coming to PlayStation (and the rest was history 😂)..",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mortal Kombat Legacy Kollection getting physical release for PS5, Switch and Switch 2; komplete on Game Card for Switch 2",
        "score": 45,
        "text_content": "[A Video Games Plus listing](https://videogamesplus.ca/products/mortal-kombat-legacy-kollection-day-1-edition-nintendo-switch-2-pre-order) has gone live early and suggests that the previously announced Mortal Kombat Legacy Kollection will be getting a full physical release on PlayStation 5, Nintendo Switch and Nintendo Switch 2. What's more is that Legacy Kollection on Switch 2 appears to come *komplete on Game Card* with the box art not having the appropriate border and labels that usually denote such releases. This is obviously refreshing to hear for some as these more traditional physical launches have become an increasing rarity among third parties supporting the console, especially based on today's Direct. We should know all the details imminently. A Legacy Kollection Developer Panel is happening at 12PM PT as part of EVO Showcase, where we're probably getting the release date konfirmed as well since it already leaked.",
        "comments": [
            {
                "raw_content": "the dev menus and series timelines were already announced btw, that info's been on digital storefronts since the announcement",
                "author": "rotten-tomato1"
            },
            {
                "raw_content": "That boxart looks temporary imo so I wouldn't go on that alone that it won't be a game-key card",
                "author": "m1n3c7afty"
            },
            {
                "raw_content": "I don't trust it not being a gamekey card until it releases, boxart doesn't seem to be final, so I wouldn't base any assumptions off of it.",
                "author": "AllEchse"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Yakuza kiwami will have a physical version for the switch 2 version",
        "score": 56,
        "text_content": "https://bsky.app/profile/wario64.bsky.social/post/3lvbgyiltiw2u",
        "comments": [
            {
                "raw_content": "Upgrade packs/Switch 2 Editions are not allowed to use the GKC so it has to be a true physical release or nothing if it's using that system Edit: or code in a box actually",
                "author": "moneycity_maniac"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 in-game loadout leaked before its imminent reveal",
        "score": 343,
        "text_content": "- Twitch streams confirm early access to beta for pre-orders or twitch drops so it is a closed beta first regardless of what the devs said - Open beta on 9-10th August and 14-17th August - Early access to open beta on 7-8th August Loadout image: https://ibb.co/JW7Qvcqp Beta dates leaked: https://ibb.co/DsTrwRN",
        "comments": [
            {
                "raw_content": "Seeing the leaked gameplay has me hyped, I know hype is a sin when it comes to Battlefield launches, but it's taking me back to the 3/4 days. I can't wait for the beta.",
                "author": "St_Sides"
            },
            {
                "raw_content": "*\"There is no closed beta! It's an open beta with early access!\"* - BF6 dev",
                "author": "Cyshox"
            },
            {
                "raw_content": "Everything about this game is seeming a little bit good... there's surely going to be a catch",
                "author": "Zyaru"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "OD confirmed to be still in development",
        "score": 291,
        "text_content": "\"Following Death Stranding, Kojima Productions announced two new titles with scarce details. Physint will return to the action/espionage formula of Metal Gear Solid; meanwhile, a short trailer for something called OD features the eerie digitally rendered faces of actors Sophia Lillis and Udo Kier, disembodied and mostly screaming. (Hunter Schafer is also supposed to star in the game.) Kojima describes the game as “something totally different…people will love it or hate it.” Whenever OD comes out, he’ll read all the tweets, watch the YouTube videos, scan all the reviews. But the reception won’t matter to him then. Kojima is confident enough to know the legacy of his body of work will be defined much later. “The real evaluations come after—10 or 20 years from now,” he says.\" https://www.ssense.com/en-us/editorial/culture/hideo-kojima-death-stranding-interview Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lr7lbo/windowscentral_hideo_kojimas_od_is_still_in/",
        "comments": [
            {
                "raw_content": "Kojima and using the phrase \"something different\" when it comes to his games ... name a more iconic duo",
                "author": "slashy1302"
            },
            {
                "raw_content": "Kojima describes the game as “something totally different…people will love it or hate it.” So basically like every Kojima games since ever…",
                "author": "ios78"
            },
            {
                "raw_content": "\"The real evaluations come after—10 or 20 years from now\" my man is taking \"playing the long game\" to the next level lmao.",
                "author": "CriesAboutSkinsInCOD"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kirby air riders has been rated in Saudi",
        "score": 237,
        "text_content": "https://xcancel.com/Gmedia_Games/status/1950934490903359853?t=J3ygX58-Kg8MUO7OZVg3Lw&s=19 FYI games in Saudi are rated when they're done as far as I am aware, Metroid prime 4 has yet to be rated here so kiwi talks might be right and the game isn't done yet",
        "comments": [
            {
                "raw_content": "dumb prediction: they'll date a game a week throughout August on Nintendo Today. Metroid, Hyrule Warriors, Air Riders, Splatoon Raiders. 4 games, 4 weeks. History's slowest direct",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Kirby Air Ride direct next week for sure /s >!(haha, unless?) !<",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "Holy shit R18+ that's crazy",
                "author": "Afrodite_33"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Further hint at native PS5/XboxSX version of Kindgom Come: Deliverance (2018)",
        "score": 218,
        "text_content": "Hinted by official X account of the franchise in response to a question by another user https://xcancel.com/KingdomComeRPG/status/1950920704297156656?t=sr_fWIPZ6I10yRs8PdYGjQ&s=19",
        "comments": [
            {
                "raw_content": "It's probably going to be at the THQ showcase which is tomorrow i think",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "That’s more than a hint lol",
                "author": "ZXXII"
            },
            {
                "raw_content": "Question is if it’s a remaster and you have to buy it or a free update",
                "author": "Icy_Proof7234"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Silently Launches Power-Efficient Arrow Lake Desktop And Mobile CPUs; Ultra 5 235A, 235TA, And 235UA",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Come up with new naming scheme to make things \"simpler\". 2. Come up with bloated sku variants that are hard to follow. The marketing never learns.",
                "author": "liliputwarrior"
            },
            {
                "raw_content": "Oh god, two more letter to add to the intel vocabualry.",
                "author": "kazuviking"
            },
            {
                "raw_content": "How many suffixes does Intel have at this point? We have K, KS, F, KF, X, H, HX, P, U, V, E, KE, Y, C, B, and now A...",
                "author": "SmashStrider"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "This Laptop Has AMD's Most Powerful iGPU!",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I doubt it will cost $1000. Even stand alone units are way more than that with no screen or keyboard. Heck even just the Framework AI Max 385 system board with just 32GB of ram is more expensive than this entire laptop.. It would be amazing if it does come in at $1000, but I won't hold my breath.",
                "author": "Blue-Thunder"
            },
            {
                "raw_content": "No way it costs $1000, also website doesn't seem to work?",
                "author": "battler624"
            },
            {
                "raw_content": "Lots of stuff on this guy's channel are straight up vaporware.",
                "author": "l0udninja"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Warren Buffett’s Berkshire Hathaway and Zillow say mortgage rates can’t fall enough for Americans to afford a home",
        "score": 336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No politics",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "This goes back decades when we started the financialization of homes as investments. Creation of MBS products supercharged the idea of a home as an investment vehicle. It wasn’t always like this. There was a time when people saw it as a place to live",
                "author": "Patient-Ad-6560"
            },
            {
                "raw_content": "Put restrictions on who can own a single family home.",
                "author": "liquidsyphon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Markets see dwindling odds of a September interest rate cut from the Fed",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Fed isn't coming to bail you out. Lower your price.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Good. We don't need rate cuts. The economy is still humming along fine and the real estate market is still seeing list prices way too high. The only direction rates should move is upwards.",
                "author": "AwardImmediate720"
            },
            {
                "raw_content": "Jerome Powell is an American hero.",
                "author": "75657466151"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation ticked up to 2.6% in June in Fed’s preferred gauge",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep in mind that this report is based on data that is 35% imputed. The proportion of imputed data skyrocketed from its historical ~10% share right after Trump announced his tariffs. Just look at the chart [here](https://www.apolloacademy.com/the-quality-of-the-cpi-data-continues-to-deteriorate/). The jump in imputed data is insane.",
                "author": "TRBigStick"
            },
            {
                "raw_content": "So 3% gdp (unlikely but it's what's being reported) mixed with 2.6% inflation gives us a real gdp of 0.4% annually. I was told things were going to be so much more awesome than this.",
                "author": "Big_Knobber"
            },
            {
                "raw_content": "Inflation rose three-tenths of a percentage point to 2.6% for the year ending in June, the Bureau of Labor Statistics reported Thursday in an update to the Federal Reserve’s preferred gauge. Economists expected inflation in the personal consumption expenditures index to tick up to 2.5% from the month before. The rise in inflation suggests that the Fed will have to continue working to bring down prices and that inflation could be a lingering problem, even as President Donald Trump pushes for the Fed to cut interest rates. The Fed’s goal is 2% annual inflation. On a month-to-month basis, inflation was 0.3%. Core inflation, which strips out volatile food and energy prices, rose to 2.8% on an annual basis. Core inflation was 0.3% on a monthly basis. The PCE inflation readings lag the more closely watched consumer price index reports. The latest CPI report showed that inflation rose slightly to 2.7% for June. Overshadowing the inflation reports is the Fed, which once again opted to hold interest rates steady this week despite pressure from Trump to cut. If inflation starts falling more, it could push the Fed to start to cut rates. But if inflation remains too high, it could have the opposite effect. The labor market is still holding up despite the higher interest rates. The economy again beat expectations in June and added 147,000 jobs. The unemployment rate fell slightly to 4.2%. Also, economic output has been up, according to the most recent reading. U.S. GDP expanded at a 3% annual rate in the second quarter, the Bureau of Economic Analysis reported on Wednesday morning ahead of the Fed decision.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Prices Drop in 14 Major U.S. Metros, Including Parts of Florida and Texas, As Buyers Gain Upper Hand",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Prices are declining in certain places as the supply of homes for sale outpaces demand, with high costs and economic uncertainty sidelining would-be buyers. The median home-sale price fell in 14 of the 50 most populous U.S. metro areas this week. Oakland, CA saw the biggest drop, with a 6.8% year-over-year decline, followed by two Florida metros and two Texas metros: West Palm Beach (-4.9%), Jacksonville (-3.1%), Austin (-2.9%) and Houston (-2.8%). Prices are falling in several metro areas because the housing market is slow due to high housing costs and economic uncertainty, with homes taking longer to sell than a year ago in every major metro, and more home sellers than buyers in much of the country. In West Palm Beach, for instance, the typical home that went under contract during the four weeks ending July 27 took 93 days to do so, the longest period of all the metros in this analysis and up 18 days from a year earlier. Pending home sales are down 1.4% year over year in West Palm Beach, and supply is up 7.7%. Nationwide, the median sale price rose 2% year over year to just shy of its record high. But that uptick is small compared to the 5% and 6% increases that were common in late 2024 and early 2025, and Redfin economists expect national prices to decline 1% annually by the end of this year. The median U.S. asking price has already lost steam, dipping to its lowest level in five months this week and posting its smallest increase since February (except the prior 4-week period). That signals that more and more sellers are pricing their home lower from the start to meet buyers where they are in terms of price expectations. Monthly mortgage payments have lost steam, too, dipping to a median of $2,671 this week, the lowest level since January. “Sellers need to start coming to terms with two things: One, homes are more often going to sit on the market for longer than a week or two before they sell, and two, buyers are gaining the upper hand,” said James Gulden, a Redfin Premier agent in Boston. “I advise my sellers to be realistic about the price they’re going to get based on the market research I provide, while also taking into account which direction the market is moving, especially if they want multiple offers. I’m also reminding sellers to be patient and not panic. Sure, many homes have been selling within a week for the last several years, but that’s not historically normal. They have to reorient themselves to the fact that it may take several weeks, or more, before receiving an acceptable offer.” Pending U.S. home sales are down 1.4% from a year ago, while total inventory is up 8.9%. New listings are stagnant, up 0.6% year over year, as some would-be sellers opt to stay put rather than enter the buyer’s market.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Still wildly too expensive.",
                "author": "Spicy_Tac0"
            },
            {
                "raw_content": "I’ve got (upper) hand https://youtu.be/IYl1UBDGKiU?si=yPtbXh8laAUc09fA",
                "author": "Rdw72777"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "My hoom didn't fly off the shelf, but whyyyy",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just cancelled a contract in the TRR stage. My wife has bad asthma and her reaction to mold can be deadly. So in addition to the normal inspections we paid for a mold check. The results came back with mold in the living areas in the 3,000-5,000 parts per square meter (the normal level is less than 500), the roof needed work done, and there were a bunch of safety issues with wiring, circuit breakers, and the pool heater and pump malfuncitoning. We put all this in the TRR. The Seller's agent called mine and said we were lying and that \"We don't believe there is mold\". So we put in the cancellation letter. \"No, wait! We said we didnt believe there was mold, we didnt say we wouldnt fix it!\" Sorry, chap. Calling my wife a liar is a no-no for me. Then the seller called my agent directly (which is imo bad form) to apologize and say that he is going through a rough divorce and that he can only do so many fixes and they have to be done after the closing so he can use the money to make the repairs and he really needs the house sold. Big sob story. \\-bear in mind I was already accepting the risk of two HVAC units being 20 and 13 years old, a 15 year old roof in a high hail state, and a really small room for one of my kids, so it wasnt like I was asking for the world to be fixed. just the health and safety concerns. I told my agent that while I sympathize with his plight, it is not my responsibility to bail him out with his divorce, and perhaps he should list the house to be sold \"as-is\" to avoid this the next time, because we are still out. All this to say, yeah. Sellers still think they can get those COVID cash offers in an economy that cannot justify $3500+ mortgage payments for the average family. something has to budge.",
                "author": "ironlocust79"
            },
            {
                "raw_content": "The first sentence of the last paragraph: \"For all I know, we're being delusional and our agent is just trying to protect us/ get us as much as we can get.\" BINGO.",
                "author": "ChadsworthRothschild"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Condo Market Is Floundering: Four Charts That Explain the Downturn",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "archive version: https://archive.ph/deqtA Unfortunately, the charts get omitted",
                "author": "SnortingElk"
            },
            {
                "raw_content": "When People think of condos they think it’s some expensive beach side multi story building but there are lot of condos in Deep South which were built mainly for low income families. These units prices have been stable for decades (unlike single family homes) but all of sudden that all changed. Late 2010s driven by social media RE influencers and then Covid the demand for these cheap condos shot up as investors gobbled them up. Prices went up 2x-3x and entire new blocks of condos got bought up by investors (short and long term). Now as we have glut of rental properties and vacancies go up, investors are starting to panic and trying to sell them ..",
                "author": "Dmoan"
            },
            {
                "raw_content": "there’s a condo here right outside of downtown Denver that someone posted on r_realestate about a year ago, and i bookmarked so i could check-in on it periodically to laugh at it. they listed it for $750k and dropped it to the $690, 680 range before posting on reddit about why it isn’t selling. and i remember someone pointed out comps were $650 at best but possibly as low as 625 or even lower. and eventually i saw they did drop it to $650 in like, AUGUST, and then did that thing where they cut 50 bucks off the price for a few weeks, and then i saw it got delisted. anyway, i see today its Zestimate is in the low $600-610 zone and i have to think practically it’s even much lower than that if it were put to sale. lol. i wonder what is going through this idiot’s head rn. i remember they were very distressed and upset last year that their money printer was malfunctioning.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Multifamily Demand Surges Amid Slowdown",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Key Takeaways: * Multifamily demand remains elevated, with 116,000 units absorbed in Q2 2025 — the sixth-highest quarterly absorption since 2000. * Supply increased modestly, but the national construction pipeline dropped below 500,000 units for the first time since 2016. * Rent growth slowed to 1.7% annually, the sharpest deceleration since 2023, as property owners prioritized occupancy over pricing. * Construction starts remain muted, with new development hindered by tight credit conditions and economic uncertainty. Robust Demand, Subtle Signs of Cooling Multifamily demand remained strong as the US multifamily sector absorbed over 116,000 units in Q2 2025, bringing year-to-date absorption to 216,000 — matching the pace of last year’s near-record total. For the second consecutive quarter, demand outpaced new supply, improving the vacancy rate for the first back-to-back quarterly decline since 2021. However, seasonally adjusted data from Cushman & Wakefield shows early signs of softening. Historically, Q2 demand runs 30% higher than Q1; in 2025, it rose by only about half that. Consumer sentiment surveys also declined sharply during the quarter, hinting at potential demand headwinds ahead. Occupancy Over Rent Growth As economic uncertainty grows, multifamily owners have shifted toward maximizing occupancy rather than pushing rents. That approach is reflected in the Q2 rent data — annual rent growth slowed to 1.7%, a 50 basis point drop from Q1 and the sharpest QOQ deceleration in two years. Rent growth also showed monthly weakness in May and June, coinciding with a surge in new supply and broader concerns about tariffs. While April rents rose 0.22% month-over-month, growth slipped to just 0.03% in June. Still, some metros are outperforming. San Francisco led all US markets with 6.8% YOY rent growth, followed by San Jose and Chicago (both at 4.5%). New York and Northern New Jersey also posted over 3.5% gains — all ranking among the highest occupancy markets nationwide. Construction Pipeline Hits 8-Year Low The construction pipeline continues to shrink as financing remains tight. With just 3.8% of total multifamily inventory under construction, the market is seeing its lowest development levels since 2016. New starts have slowed to 2012-era levels, and total pipeline volume dropped below 500,000 units — a 50% reduction from 2023’s peak. Out of all tracked markets, only 11 saw any increase in new starts over the past year, most adding just one or two projects. Major declines were seen in Dallas/Ft. Worth (-22,000 units), New York (-18,000), and Austin (-18,000), with Phoenix, Atlanta, and Houston also seeing notable pullbacks. Why It Matters With multifamily demand still outpacing supply but rent growth softening, the US multifamily sector is entering a more cautious phase. Developers face financing constraints, consumers are growing wary, and rent strategies are shifting — all pointing to a market that is healthy, but increasingly defensive. As the pipeline continues to contract and construction delays persist, a tighter supply landscape could provide support for fundamentals heading into 2026 — assuming demand remains resilient. What’s Next Watch for how sustained economic uncertainty, interest rates, and consumer confidence impact multifamily absorption in the second half of 2025. **With less new inventory on the horizon, markets with strong occupancy and limited supply could see upward pressure on rents in 2026.**",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Buyer's or seller's market? Zillow updates its ratings for 250-plus housing markets",
        "score": 16,
        "text_content": "Among the 250 largest metro-area housing markets, these 10 are the HOTTEST markets, where sellers have the most power: Rochester, New York → 135 Syracuse, New York → 92 Buffalo, New York → 90 Kennewick, Washington → 85 Hartford, Connecticut → 83 Lansing, Michigan → 80 Albany, New York → 79 Binghamton, New York → 79 Springfield, Massachusetts → 77 Anchorage, Alaska → 76 Among the 250 largest metro-area housing markets, these 10 are the COLDEST markets, where buyers have the most power: Jackson, Tennessee → 11 Beaumont, Texas → 22 Macon, Georgia → 22 Gulfport, Mississippi → 23 Longview, Texas → 24 Brownsville, Texas → 26 Daphne, Alabama → 26 Naples, Florida → 27 Punta Gorda, Florida → 29 Cape Coral, Florida → 30",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mark Zuckerberg on the real hard-hitting impact of ASI",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be fair, the alternative would be really funny. Zuckerberg: Hello stockholders, Board of Directors. I'm excited to announce that we are creating a powerful artificial being, beyond our control, capable of eradicating all of humanity. Will it help improve our products? No. Will it make our entire economic system obsolete, rendering your stock portfolio irrelevant? Probably. Will it improve society? Frankly, it's going to do whatever the hell it wants. The important thing is, we're going to do it anyway.",
                "author": "ChiaraStellata"
            },
            {
                "raw_content": "Elon Musk said it, Zuckerberg has no clue what he's talking about.",
                "author": "ajsharm144"
            },
            {
                "raw_content": "lol, he’s such an embarrassment and although unlikely if he gets to AGI/ASI first we are screwed",
                "author": "roland1013"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Everything I do at work I use AI, and I'm a programmer. How can people claim our jobs won't be gone?",
        "score": 231,
        "text_content": "Every problem I need to solve, my first stop is AI. I ask for code, iterate on its code, include more logging, iterate again and push it. 99% of the time, I can do my work with AI, saving tremendous time and effort. My job is screwed. Instead of hiring 10 developers, a company could just hire 2 and they can leverage AI. I'm actually scared for the future. AI is getting better and better, and I can only imagine in another 5 or 10 years what it will be capable of. I don't even know what I will do when my job is gone. Do I do something like manual labor ?",
        "comments": [
            {
                "raw_content": "It's a combination of not wanting it to be true and people clinging to the things it can't do yet. \"Haha it can't deal with my 20 year old codebase worked on by thousands of people, so it sucks\". However a lot of use cases are way simpler and those will go first.",
                "author": "Additional-Bee1379"
            },
            {
                "raw_content": "I've been using AI for everything from boilerplate code to debugging to documentation. It's like having a junior dev who never gets tired or asks for raises lol",
                "author": "promptenjenneer"
            },
            {
                "raw_content": "no idea I'm afraid of the future",
                "author": "I_make_switch_a_roos"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google AI model mines trillions of images to create maps of Earth ‘at any place and time’",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DeepMind my beloved Demis Hassabis appreciation post",
                "author": "sussybaka1848"
            },
            {
                "raw_content": "In reality, townships will use it to find who installed a pool without a permit.",
                "author": "BarrelStrawberry"
            },
            {
                "raw_content": "![gif](giphy|LxPsfUhFxwRRC)",
                "author": "dcvalent"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "More footage of figure 02 doing laundry",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't get me wrong, it is VERY cool, but it isn't \"doing the laundry\" it isnt locating the washing machine, opening the lid, closing the lid, putting in the detergent and starting the programme.",
                "author": "Normaandy"
            },
            {
                "raw_content": "does it actually turn the washing machine on too?",
                "author": "Miserable_Green_8577"
            },
            {
                "raw_content": "People see a video and a title and believe the two. All I see is a robot that can take something out of one thing and put it in another. \"Doing the laundry\"? Hardly. Show me collecting clothes from bedrooms, assessing what needs to be washed, sorting into lights/darks/colors, show me adding detergent and selecting the right wash program, show me removal and putting in to dryer, show me folding and putting away. THAT is \"doing the laundry\", not this, whatever this is.",
                "author": "theanedditor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrew Ng warns U.S. lead isn’t guaranteed; China’s open AI is catching up fast",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be clear, the reason why AGI can be a race is because there's an implied level of capability for some projected AGI technology that **enables the party who reaches it to wipe out its competitors**. This need not be militarily even though autonomous drones and automated weapons research are a frightening possibility. Economically destroying a a competitor or using persuasion/wireheading to weaken the productivity of its workers are also threats. Or deploying such vast AGI-enabled efficiencies to benevolently outcompete competitors into irrelevance and multiplying any research and economic lead into an insurmountable advantage by virtue of exponential take-off. The implicit danger of this possibility is why AGI is a national security priority. The finish line is if and when the lead is so large the leader can cement its dominance for perpetuity.",
                "author": "YoAmoElTacos"
            },
            {
                "raw_content": "Whelp, at least Deepseek is open sourcing it, unlike *some* companies…",
                "author": "Leo-H-S"
            },
            {
                "raw_content": "\"Specially democracies with a strong respect for human rights and the rule of law\". Sure, repeat yourself to believe it",
                "author": "Sockand2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "seems like they're setting up for a release",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A Friday release shows a lot of damn confidence. OpenAI expects it to still be a relevant news story by Monday. Let’s see how this rolls.",
                "author": "NotMyMainLoLzy"
            },
            {
                "raw_content": "https://preview.redd.it/5vrqn9w8zagf1.png?width=1325&format=png&auto=webp&s=121f947f8158a0e0dbac372d13e66de69387326a",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Ok but like HOW SOON",
                "author": "One_Geologist_4783"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Horizon Alpha can reason",
        "score": 131,
        "text_content": "",
        "comments": [
            {
                "raw_content": "its probably the open source from openai, its fast asf and without reasoning its dumb as hell, meaning its a very small model",
                "author": "PassionIll6170"
            },
            {
                "raw_content": "Plot twist: The open source model is gpt-5 mini flash",
                "author": "LineDry6607"
            },
            {
                "raw_content": "Slightly concerned they’re not even going to release gpt 5 next week and will just release the open source",
                "author": "drizzyxs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Enterprises prefer Anthropic’s AI models over anyone else’s, including OpenAI’s. Gemini also surging.",
        "score": 82,
        "text_content": "https://share.google/Gbs2hGLBNTeMIkyJu",
        "comments": [
            {
                "raw_content": "Love how the same companies get different colors in the line and pie chart",
                "author": "Similar-Cycle8413"
            },
            {
                "raw_content": "MATCH YOUR COLOURS! If you do it right, your pie chart coulda doubled as a legend. I don’t know if you made this OP but damn it hurts… it hurts!",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "They surveyed 150 technical leaders at companies. As a tech salesperson, everyone in my org uses ChatGPT everyday. I have no doubt the technical leaders are using Anthropic for coding - but this isn’t a legitimate market analysis. It’s a survey.",
                "author": "JmoneyBS"
            }
        ],
        "subreddit": "singularity"
    }
]