[
    {
        "post_name": "Insufferable Commie",
        "score": 902,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is he wearing a glove? Did he just fuck a goat?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Learn to build boats you 3rd world retard.",
                "author": "Toecutter7N6"
            },
            {
                "raw_content": "Americans of Italian descent in NYC...the ball is in your court.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois U.S. District Court Judge LaShonda Hunt (Biden appointed ) has ruled that the fencing surrounding the ICE facility in Broadview must be torn down. Fox News: “The fence put up as demonstrations grew needs to come down by midnight Tuesday. The judge says it’s on municipal land and blocks e",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LaShonda? Really? Fuck the jokes write themselves. Isn't there a carnival cruise she needs to be on?",
                "author": "Datamancer"
            },
            {
                "raw_content": "Nignore",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "I do hope Trump admin are maintaining a list of these twats for congress to mass impeach them.",
                "author": "Scuffers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Commercial Drivers Licenses have been givin out to illegals by Democrats at an alarming rate “Over a short 3-day period along I-40 in Oklahoma, 91 illegal migrants were arrested for operating commercial vehicles with CDLs. In total, 120 illegal immigrants were taken into custody for immigration",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Word will be out and they'll avoid I-40 in Oklahoma. This needs to be done in every red state. Don't let the out of the blue states. Red states need to end accepting any license from blue states. Anyone transferring a license from a blue state will need to provide backing documents and demonstrate English proficiency.",
                "author": "Pederella"
            },
            {
                "raw_content": "These are just the ones that went through the motions of getting a CDL. How many are driving rigs all over the place without even that?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Pennsylvania could get 120 a day everyday for a month",
                "author": "ACActual"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It is not enough to be Republican anymore",
        "score": 1198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, I'm very anti-Marxist, but don't you dare call me a Republican.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I was never Republican to begin with. I am and have always been a conservative.",
                "author": "lostremote-"
            },
            {
                "raw_content": "It is not enough to be conservative anymore. All that we might have conserved is poisoned or gone. It's time to go back. One must be aggressively Reclamationist. That is where I am now.",
                "author": "Xahnel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Kansas Republican lawmakers have just officially GREENLIT a special session to draw out the last remaining Democrat Congressional district (Sharice Davids seat) ahead of the 2026 midterms. That'll be a solid +1 for GOP.",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Win here, win there, win-win everywhere.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Amen! I live in this district. She is AOC lite 2.0.",
                "author": "CyberSolider33"
            },
            {
                "raw_content": "Hi currently in KS. We are red af. Except the blue retarded area of lawrence & topeka. Is how we got a Democrat governor. But this state is MAGA",
                "author": "OG_BACONndEGGs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Among the layoffs announced recently, Trump has closed the HHS \"Office of Population Affairs\" \"the Office of Population Affairs, which administered the nation’s Title X family-planning network, teen-pregnancy prevention, and LGBTQ+ health initiatives, was eliminated entirely.\"",
        "score": 1541,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this.",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Omg this is just like Nazi Germany",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "why would LGBTQ+ people need specific health services? oh right, because they are unnatural.",
                "author": "Slothboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴President Trump was always going down in history as the greatest President ever. But, the release of the hostages makes it undeniable. We will never see another President like Trump in our lifetime ever again. I hope everyone enjoys him while we have him. He’s one of a kind.",
        "score": 969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It really was Divine Intervention last July.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Those who thought they had control were certain the election was going to be a Side of Beef versus a Seller of Guac Bowls. Then one nearly-asked question and a response changed the world. > Megyn Kelly: “You’ve called women fat pigs, dogs, slobs, disgusting animals. Your Twitter account has several –” > Stable Genius Trump : “Only Rosie O’Donnell.”",
                "author": "magnokor"
            },
            {
                "raw_content": "I feel I'm watching history in the making.",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Adams on picking the right President",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The people I lost were not friends. And family members just revealed their stupidity and I relish in watching them try to sustain their TDS",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "God bless Scott; but, there are more *days* to come.",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "My online business was sabotaged in the height of cancel culture by terrorist antifa communists and racist blm extremists just before the 2020 election was stolen. I cannot tell you how much I have been enjoying this year and its ONLY GETTING BETTER! It was entirely worth it.",
                "author": "EffingWhiteMale"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats Vow To Keep Government Shut Down Until Someone Notices - Babylon Bee",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where are the sombreros?",
                "author": "OldZilla"
            },
            {
                "raw_content": "The federal government shuts down, and suddenly we have peace in the Middle East. Almost like the US government is the problem, or something. I guess we should keep it shut down.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Keep it shut down!",
                "author": "SneakyWino"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Sortor: The FBI has launched a FULL investigation into Antifa, and spent the weekend calling journalists who’ve been victims of Antifa vioIence. I received a call from the FBI Sunday morning, and confirmed others did as well. The Trump admin WILL take down this terrorist network",
        "score": 1579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are plenty of dipshits on FB, Blue Cry and X that proudly proclaim they're \"Part of Antifa\". Maybe go after them first? Set an example. Preferably, a rude and rather aggressive example.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "All the FBI needs to do is audit its workforce's phones. The FBI cannot be trusted in general, but it most certainly cannot be trusted to crack down on its own shock troops. The investigations will stop as soon as the chain of command leads back to the local FBI field office.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "https://x.com/nicksortor/status/1977828832897057021",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump trolls Mahmood",
        "score": 928,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# READ MY LIPS! Those fries were NOT cooked in Bacon Grease.",
                "author": "BaIlotsOnRubysUSB"
            },
            {
                "raw_content": "72 goats are no longer waiting for Mahmood in heaven.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "well he is telling the truth.....",
                "author": "quiznossucks1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: NORTH CAROLINA Republicans have just announced plans to vote on a new GOP-friendly Congressional map for the 2026 midterms, in another blow to Democrats. Governor Josh Stein (D) CANNOT veto the map. KEEP PUSHING.",
        "score": 1472,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still don't understand how after the lockdowns etc. they still voted in a Dem governor.",
                "author": "texas4ever"
            },
            {
                "raw_content": "https://x.com/EricLDaugh/status/1977824661070319923 There's 14 seats in North Carolina. 10 Republicans, 4 Democrats. **4 Democrats from North Carolina** - North Carolina's 1st Congressional District is represented by Don Davis (R+1) - North Carolina's 2nd Congressional District is represented by Deborah Ross (D+17. The district contains most of Wake County. Prior to court-mandated redistricting in 2019, it also included northern Johnston County, southern Nash County, far western Wilson County, and all of Franklin and Harnett counties.) - North Carolina's 4th Congressional District is represented by Valerie Foushee (D+23. The district includes all of Durham County and Orange County as well as northern Chatham County and a portion of Wake County.) - North Carolina's 12th Congressional District is represented by Alma Adams (D+24. Located mostly in Charlotte as well as surrounding areas in Mecklenburg County.) --- - North Carolina Republicans have a super majority (71-49) in the State House. - North Carolina Republicans also have a majority (30-20) in the State Senate. - North Carolina Republicans have a super majority (5/7) in the Supreme Court. Get it done, North Carolina! Also how much fraud is going on in North Carolina? MAGA overwhelmingly voted for Trump, and he recieved the highest amount of votes (2,898,423) of any Presidential candidate in North Carolina history. Republicans have a super majority in the State House, State Senate and Supreme Court, but Democrats want us to believe (D) Josh Stein won the race to be Governor?",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "They should have investigated ELECTION FRAUD because I am a NC voter and we vote down ballot and theres a zero 0% chance that our state actually re-elected another Democrat governor when we were deep Red for Trump and Trump won. We hated the last guy and we hate this guy. He likely directed FEMA to fuck off and leave Trumpers pissing in the wind with no house and their land is now a mud creek with dead bodies. No R except maybe some churchnerds and RINOs gave a flying fuck about that black deputy Robinson's internet visits to African Butts dot Com Let he who hath never visiteth the porn hub cast the first vote Whole thing stunk of an OP GOP missed their opportunity to fix this shit. Also Josh \"Stein\" (or is it stane?)",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alec Baldwin crashes Range Rover into tree",
        "score": 1186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its the cars fault ! Whoever pumped gas in the car last it was all thier fault ! Anybody but his fault, scumbag dumbass",
                "author": "Justlooking250"
            },
            {
                "raw_content": "Murdering trees too, now?",
                "author": "barwhack"
            },
            {
                "raw_content": "Never reload your pistol while driving.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Mitt Romney’s Sister-in-Law Found Dead Near Parking Garage in California",
        "score": 775,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The woman, later identified as former Senator Mitt Romney’s sister-in-law, Carrie Romney, either jumped or fell off a five-story structure near the Valencia Town Center mall. That doesn't sound suspicious at all.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Fell or jumped from a 5th floor parking garage. Don't know anything about her husband, who is Mitts brother, but while I don't like Mitt much, this is sad shit for anyone. RIP",
                "author": "Bongos"
            },
            {
                "raw_content": "Was she strapped to the top of a station wagon?",
                "author": "YakBak"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Government voter fraud in California for the Prop 50 redistricting plan demonstrated on mail-in ballot...",
        "score": 1321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "of course it will be rigged",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Mail-in-ballots should be banned nationwide. There is no chain of custody.",
                "author": "SupFrens"
            },
            {
                "raw_content": "Why are there conspicuous holes in the envelope in the first place? Like, I know it's so they can throw out the \"no\" votes, but what is the \"official\" purpose for them?",
                "author": "Keiichi81"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maria Bartiromo: “My sources are telling me that the whole reason [the Democrats] are doing this is because they want to be there for next weekend’s ‘No Kings’ march in Washington, [D.C.]…",
        "score": 1102,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump should shut down entry into DC, Friday night thru Sunday evening",
                "author": "Seeing_Red"
            },
            {
                "raw_content": "It's all style over substance. \"No Kings\" = the pussy hat rallies from 2016/2017. Loud and flashy, but ultimately pointless.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "Schumer and the any other dem idiot can be there whether or not the government is closed. What does that have to do with a protest? Is it just so he has something to holler about?",
                "author": "Marianasoctober"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa goon antagonizes a man at a restaurant and gets DROPPED. Listen to the sound of that thud. So satisfying.",
        "score": 1696,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More, please! And from two angles! 😂 This should be stickied.📌",
                "author": "mateus"
            },
            {
                "raw_content": "Man in the brown coat and tie has the look of a man that tolerated, and tolerated, and tolerated. And has frankly had enough, dammit. Good on him!",
                "author": "didwhattomywhat"
            },
            {
                "raw_content": "When a dude is in that stance and you're talking smack, be prepared for violence.",
                "author": "BibleProphecyFulfill"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I was only expecting a biscuit...",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good one. The more the better. I like showing them to libtards.",
                "author": "SenorTrumper"
            },
            {
                "raw_content": "I’m lovin’ it",
                "author": "SmartWomenLoveTrump"
            },
            {
                "raw_content": "the milkshake machine is down. best I can do is peace in the middle east",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "On Oct. 11, @PortlandPolice arrested two conservatives near the ICE facility. A conservative activist was struck on the head with what is believed to be a rock near the ICE facility. He fell to the ground. The suspect fled and got away.",
        "score": 830,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe the cops should be arrested?",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Such extreme cowards. Everything they do, they hide their identity, hit someone who isn't suspecting it, and RUN. It's their mottot.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Cops are in on it. Plain as day.",
                "author": "HumblePepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Late last year, The View's Alyssa Farah promised to wear a MAGA hat on the show if President Trump got the Israeli hostages out. \"I promise I will wear a MAGA hat for one day on the show and say thank you for doing it.\"",
        "score": 1517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is this controversial 😂 not surprisingly, the most attractive woman on the show is the most reasonable one",
                "author": "TheMAGAnificent"
            },
            {
                "raw_content": "She might get stabbed by her cohosts, watch out",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "Time to pay the piper.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD and Intel Celebrate First Anniversary of x86 Ecosystem Advisory Group Driving the Future of x86 Computing",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully Nvidia can join too",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA DGX Spark Arrives for World's AI Developers",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrives in total disinterest. Not really usable for any serious training, and slow in inference. Very niche product overall.",
                "author": "Ok_Appeal8653"
            },
            {
                "raw_content": ">Other early recipients of DGX Spark, including Anaconda, Cadence, ComfyUI, Docker, Google, Hugging Face, JetBrains, LM Studio, Meta, Microsoft, Ollama and Roboflow, are testing, validating and optimizing their tools, software and models for DGX Spark. This thing is going to be supported extremely well and will get much faster over time. We should see TensortRT+NVFP4 models soon. Its also running Linux on Arm. So a big boost for the onsumer side for both there. This is also the N1 chip coming which run Windows. So expect great support there too. Another boost there.",
                "author": "From-UoM"
            },
            {
                "raw_content": "It seems like Nvidia’s version of the Mac Studio, but it has less memory and memory bandwidth. I guess the question is can Apple catch up to Nvidia’s GPUs or can Nvidia catch up to Apple’s unified architecture and CPUs. Maybe AMD will beat both, they seem to have a head start on the x86 side. And then there’s Intel that is trying to fire their way to profitability…",
                "author": "john0201"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Updated Intel Patches For Cache Aware Scheduling Net A 44% Win For AMD EPYC",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just a little nitpick that's not so little... It's not 44% faster, it *took 44% less time*. That's about *80% faster*. Time went down from 50 seconds to 28... if it had gone to 25, we'd say it's twice as fast (100% faster). That's the news here.",
                "author": "total_zoidberg"
            },
            {
                "raw_content": "Okaaay. So that's about what Intel exec was complaining about few days ago regarding open source projects that don't benefit Intel. https://www.reddit.com/r/hardware/s/aiSYJvQRGV",
                "author": "gorion"
            },
            {
                "raw_content": "> Meanwhile on Intel's own Sapphire Rapids server used for testing, they found Hackbench showing some benefit in select cases. Guess this news from a few days ago makes more sense now. https://www.reddit.com/r/hardware/comments/1o293yg/intels_open_source_future_in_question_as_exec/",
                "author": "ElementII5"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "VideoCardz: \"Leaked FSR4 INT8 version runs on RDNA2 and 3 with 9–13% lower performance, image quality below FSR4 FP8 but still above FSR 3.1\"",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The ball is in AMD's court to actually release FSR4 for RDNA2/3. We know it is viable, and worth the overhead when the alternative is FSR3. Remember that the leaked INT8 FSR4 is unoptimized. I don't think there's much to gain in software optimization, but the results we have today look promising enough to make it worth a try.",
                "author": "virtualmnemonic"
            },
            {
                "raw_content": "This is pretty old news, isn't it? https://youtu.be/APk9y9SLNVE?t=1983",
                "author": "VastTension6022"
            },
            {
                "raw_content": "Hardware Unboxed told us this weeks ago. On RDNA2 it’s still better to run FSR4 at Performance mode than FSR 3.1 at quality mode.",
                "author": "LickMyKnee"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[GN] The Problem with GPU Benchmarks | Reality vs. Numbers, Animation Error Methodology White Paper",
        "score": 108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Animation errors may not even be the fault of the GPU vendors, either. Back in 2017 when I was helping the Battle for Wesnoth project, we were fighting with performance issues and it turned out some of the issues weren't in fact caused by performance at all but rather by bugs which made animations play incorrectly, in particular [https://github.com/wesnoth/wesnoth/issues/1565](https://github.com/wesnoth/wesnoth/issues/1565) Essentially, animation error is what the player notices. What exactly caused it is less important. A metric that reflects the **feeling** of animation stuttering is definitely welcome, since it gives a better metric for game developers and GPU vendors to keep an eye on.",
                "author": "WHY_DO_I_SHOUT"
            },
            {
                "raw_content": "This is actually very interesting. The concept of micro stutters never made much sense to me. I have talked about it here previously. More consistent frame time should not feel more smooth than faster but less consistent frame timing. The brain should not be that dependent on consistent time intervals for interpolating movement (within reason of course). But the smoothness or lack thereof is explained perfectly by the concept of animation error. It's not the speed per se but the correctness of timing of the frames that is the issue. Frames shown at the incorrect time are interpreted as inconsistent movement which is not smooth and thus doesn't feel smooth.",
                "author": "jaaval"
            },
            {
                "raw_content": "Oh, that's very cool, DF has been checking individual games for animation error by eye but it's good to see someone tackling this in a more methodical fashion.",
                "author": "redsunstar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Battlefield 6: Multiplayer CPU Test, 33 CPU Benchmark",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The inevitable 5800X3D marches on forwards.",
                "author": "XavandSo"
            },
            {
                "raw_content": "My 5900x is bottlenecking my 3080 :(",
                "author": "SirMaster"
            },
            {
                "raw_content": "Regarding the VRAM-recap section in the video. Did he account for the VRAM-leak issue/bug with the overkill texture setting? Currently there is a bug where the game continuously eats more VRAM the longer you play if you have the texture setting at overkill (this also affects multiplayer, where your FPS will decrease map after map). For example, my 5070 ti will play at 150+ fps during the first map, but if I play long sessions it drops down significantly - down to the 90s. Turning the overkill texture setting down, then back up again fixes the issue ( or by restarting the game). The problem doesn't happen if you continuously play on the same map, but it happens after a while if you play different maps without restarting the game (or refreshing the texture quality setting). I haven't played the campaign yet, but I wonder if the VRAM issue that arrises after some time in the video, is caused by the same bug. Edit: The high/ultra texture setting does not have this issue - only the overkill option.",
                "author": "Exajoules"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Broadcom stock soars 10% on OpenAI custom chip deal",
        "score": 53,
        "text_content": "* OpenAI and Broadcom have been collaborating for 18 months on a new line of co-designed chips optimized for inference and networked through Broadcom’s Ethernet stack. * Broadcom shares shot up last month after the company announced a new $10 billion customer that analysts said was OpenAI. * OpenAI has also announced massive compute commitments in recent weeks with Nvidia, Oracle and AMD.",
        "comments": [
            {
                "raw_content": "With what money? They need over well 1 trillion with their plans on just making the data centres That's what? 26 GW now costing 50-60 billion each GW? Totaling atleast 1.3 trillion by 2029 1.3 trillion in 4 years (2026, 27, 28 ,29) Then add all the Operational expenditures for just running them.",
                "author": "From-UoM"
            },
            {
                "raw_content": "They only need to announce a partnership with Intel and they've done all the big players in the space. Obviously, OpenAI doesn't have the money for their commitments (like $500 billion, if I recall correctly?), but I am sure that OpenAI insiders are making insane amounts of money playing the options market and frontrunning these announcements.",
                "author": "lovely_sombrero"
            },
            {
                "raw_content": "GDP multiplies each time there is a new deal between these AI companies",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Next-Gen AI Needs Liquid Cooling",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> The newest Blackwell GPUs, revealed in 2024, consume up to 1,200 W. In fact, the industry is preparing for 5-kilowatt chips and above in the foreseeable future. Data centers about to need their own dedicated power stations.",
                "author": "AtomicToucans"
            },
            {
                "raw_content": ">\\#4: Two-Phase Immersion Cooling That looks... cool.",
                "author": "GenZia"
            },
            {
                "raw_content": "Soon they will revive soviet era molten sodium cooling systems from Akula class submarines ;)",
                "author": "riklaunim"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokémon suffers major leak: all upcoming titles up to 2030 leaked",
        "score": 1611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suddenly realizing 2030 is 4 years and 3 months away ![gif](giphy|GrUhLU9q3nyRG|downsized)",
                "author": "TheHighness1"
            },
            {
                "raw_content": "https://preview.redd.it/kbo2j69a6yuf1.jpeg?width=1080&format=pjpg&auto=webp&s=b77d07f2d21f3ebc4b065cac63ea768e7f7f1d02 My prediction is that TPC will have whoever did this, looking like Gerald Robotnik here by the spring.",
                "author": "Haunted-Towers"
            },
            {
                "raw_content": "Who the fuck made this article? I have seen google gemini give me more accurate information than whatever this is, almost every detail is wrong",
                "author": "junttiana"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cronos: The New Dawn v1.4 w/ much improved textures/lighting video",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's another video comparing the PS5 to the Switch 2 build. It's a lot closer post patch. [https://youtu.be/v5JkHJ3xcnA?si=meaa03Z21rBH4sMV](https://youtu.be/v5JkHJ3xcnA?si=meaa03Z21rBH4sMV)",
                "author": "dekuweku"
            },
            {
                "raw_content": "Still shots @ 8:30 to better see the big differences",
                "author": "unknownbystander"
            },
            {
                "raw_content": "Loved this game on PS5 and got the platinum. When it’s a bit cheaper I’ll double dip and get it on switch 2",
                "author": "owensoundgamedev"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Honestly I really want this 2 games even more than the remake",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the remasters are getting ported Capcom should pull a Square Enix and put the originals on the eshop and give them away as a pre-order bonus like what SE is doing with FF7",
                "author": "dekuweku"
            },
            {
                "raw_content": "Playstation Plus/PSN got both RE 2 and RE 3 Nemesis a few months ago. Maybe the Gamecube will get both one day.",
                "author": "twovles31"
            },
            {
                "raw_content": "I really want the original trilogy as a collection, it's been a kick in the teeth the last two big anniverseries for capcom just to give us shooter games no one asked for.",
                "author": "DiabUK"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin’s Creed Shadows Nintendo Switch 2 port leaks again, this time by a French retailer",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They probably want to shadowdrop it (which doesn't really work with physical releases)",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "Ubisoft must be loving Switch 2 players. Most of their recent games where not well received on pc and consoles so I imagine them seeing Star Wars outlaws do well on switch flipped them to do more ports.",
                "author": "I_Heart_Sleeping_"
            },
            {
                "raw_content": "I hope they put avatar frontiers of pandora on switch 2. Sick game for handheld, especially with the new dlc coming and the movie",
                "author": "Sad_Lemon1606"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Avatar Legends: The Fighting Game revealed for Nintendo Switch 2",
        "score": 97,
        "text_content": "https://nintendoeverything.com/avatar-legends-the-fighting-game-revealed-for-nintendo-switch-2/",
        "comments": [
            {
                "raw_content": "It says Pre-Alpha build on the bottom, so I'm hoping for a lot changes. It feels 'off' watching the video. As if the characters don't match correctly on the arena. I hope the game grows to be a nice game and not some sort of simple generic fighter with Avatar assests",
                "author": "Rynelan"
            },
            {
                "raw_content": "Here's hoping that Azami, Kuvira, Zaheer, Iroh and Ozai are the remaining 5, out of 12 characters; Aang, Korra, Zuko, Katara, Toph, Sokka and Azula were shown. Other characters like Bumi (*there's your joke character*), Unalaq, Suki, Mai, Ty Lee, Jet, Mako and Bolin could easily be DLC and/or swappable with the one I've listed.",
                "author": "PMC-I3181OS387l5"
            },
            {
                "raw_content": "Yikes.",
                "author": "adamsdayoff"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "questions abt switch 2",
        "score": 0,
        "text_content": "so I have a nsw1 since 2017, and I play it all the time, never been bored of it, it is truly an amazing console. Lately I’ve been thinking about upgrading to a switch 2, but is it really worth it right now ? or should I wait until there are more games on it ? (also for those who already have it, how does the screen actually looks ? I’ve watched many unboxing and test videos but I can’t really tell how good the screen is)",
        "comments": [
            {
                "raw_content": "1. Are there any games exclusive to it that *you* want? 2. Do you have a nearby video game shop with a demo kiosk, or a friend or co-worker who has one you can see for yourself?",
                "author": "EeveesGalore"
            },
            {
                "raw_content": "Whether or not it's worth it really depends on what games you play and how much you value the increased resolution and fps. As for the screen if you have an original Switch then it is a massive upgrade all around.",
                "author": "xanas263"
            },
            {
                "raw_content": "Until you feel you've played enough Switch 1 games, or feel held back by the hardware in crossgen games, there's no real reason to get a 2 except FOMO. I played an immense amount of Switch 1 but felt like I wanted more of a modern AAA experience while handheld, so I jumped at the opportunity to get a Switch 2. Now I'm playing mostly Switch 1 games on it, waiting for more games to release for it. If you don't feel like 120fps silksong or Hades 2, DKB, etc. are really drawing you to 2, just enjoy 1. It has 7 years of games on it while Switch 2 has barely 4 months.",
                "author": "nftesenutz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Gamefreak's plans up to 2030 just leaked",
        "score": 1606,
        "text_content": "[Outline](https://pbs.twimg.com/media/G3KGEDrXcAA1970?format=jpg&name=4096x4096) Gaia/Gen 10, releasing 2026 with DLC plans for 2027. [Visual target vs prototype of gen 10](https://pbs.twimg.com/media/G3KHN-KXcAAnfWA?format=jpg&name=large) Ringo/Legneds Galar releasing potentially in 2027 [Prototype and concept art of Ringo.](https://pbs.twimg.com/media/G3KDoiyW0AA-wA5?format=jpg&name=large) Seed a new kind of RPG that takes place all the Japanese based regions (Kanto, Johto, Hoenn, and Sinnoh) potenitally a 2029 release. [Project Seed concept art](https://www.resetera.com/threads/pok%C3%A9mon-suffers-major-leak-all-upcoming-titles-up-to-2030-leaked.1323781/) Gen 11, releases in ~~20230~~ 2030",
        "comments": [
            {
                "raw_content": "Seems like the 4 year cycle for generations is going to be permanent. It was definitely needed after how much of a mess Scarlet and Violet's development was, but I was worried that they were only allowing for the delay of Gen 10 due to the 30th anniversary next year.",
                "author": "iceburg77779"
            },
            {
                "raw_content": "Project seed would be so good. Hopefully it doesn’t get cancelled",
                "author": "xHypermega"
            },
            {
                "raw_content": "Project Seed sounds too good to be true.. like very fucking good lol",
                "author": "Primal-Dialga"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Moore’s law is dead - PS6 manufacturing begins early-mid 2027",
        "score": 500,
        "text_content": "https://youtu.be/LM1Fq8nAGPo?si=FMfCL98K6KBConYO At 57:10 mark, he says - “I have a literal document showing when they manufacture these and it is in middle or to even early 2027, and that’s exactly when they manufacture the PS6”.",
        "comments": [
            {
                "raw_content": "We've gone almost the entire ps5 generation and we are still seeing a significant number of Devs still targeting PS4 Maybe with the launch of the ps6 they might stop.making PS4 games",
                "author": "profchaos111"
            },
            {
                "raw_content": "2027 release. Get ready for Intergalactic, GoW Egypt and Venom with a ps6 to top it off. Trust me",
                "author": "PresentationDull7707"
            },
            {
                "raw_content": "Can't wait to play all the ps5 remasters said no one",
                "author": "outerversalbob"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon budgets leaked: Pokémon Legends Z-A: 2 billion yen (approx. $13 million), Pokemon Gen 10: 3 billion yen (approx. $20 million)",
        "score": 721,
        "text_content": "https://bsky.app/profile/did:plc:vswp4uwqelztguwxy6n2kljt/post/3m33q2hc3is2g",
        "comments": [
            {
                "raw_content": "That is cheap AF, Pokemon Scarlett made 1.6 billion in revenue",
                "author": "danikruces"
            },
            {
                "raw_content": "Can we get that bumped up to, idk, 50 million? Pretty safe to say you’d still turn a profit.",
                "author": "HiCustodian1"
            },
            {
                "raw_content": "Really wondering what those xenoblade budgets are now.",
                "author": "chocoponcho_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden says statement provided to Windows Central by Microsoft is real, despite users saying otherwise",
        "score": 294,
        "text_content": "Despite yesterday response, users are still doubting the veracity of Xbox statements, Jez Corden (Windows Central) [has responded to claims in which](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o573yb/no_target_and_walmart_are_not_removing_xbox/) the statement provided to Windows Central isn't real and doesn't reflect the company true statements: >You think id be LITERALLY INSANE enough to attribute something to Microsoft, a company literally anyone, any journalist can email to check if i was lying, if it wasn't true? we're reaching \"i substitute reality and invent my own\" levels of ignorance and stupidity. [Source](https://xcancel.com/JezCorden/status/1977846916198117666#m) [Source 2](https://xcancel.com/JezCorden/status/1977846916198117666#m)",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Microsoft is infamous for telling people what they wanna hear in the moment while fully knowing they’re about to do the exact opposite. They just wanna manage outrage",
                "author": "Redchong"
            },
            {
                "raw_content": "I believe Jez was told this, but that doesn't mean he was told the truth.",
                "author": "-----------________-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bluepoint Games Now Hiring For 3rd-Person Melee Action Game After Latest Cancellation",
        "score": 478,
        "text_content": "Bluepoint Games was working on a God of War live-service project, but the game was cancelled earlier this year. The team is now hiring for a new project, requiring experience with 3rd-person melee action games. The studio previously worked on melee action titles like Demon’s Souls Remake and the God of War trilogy. [Source](https://tech4gamers.com/bluepoint-games-3rd-person-melee-action-game/)",
        "comments": [
            {
                "raw_content": "Maybe sony *FINALLY* put them to make the obvious project they are capable of and people actually want?",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "Its either a Bloodborne remake or a God of War 1 remake. (Greek Saga)",
                "author": "Foxy__Proxy"
            },
            {
                "raw_content": "Bluepoint helped developed GoW: Ragnarok then they were developing a GoW Live service which was then canceled a year later. Likely this is just them helping with the development of the new GoW saga",
                "author": "InevitableBlue"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon Gen 10 is titled \"Pokemon Wind and Pokemon Waves\"",
        "score": 541,
        "text_content": "https://xcancel.com/CentroLeaks/status/1977756558495731892 ~~This lines up with previous rumors that the new region is inspired by Greece and its islands: https://xcancel .com/CentroLeaks/status/1915817719829598229~~ Edit: Apparently the Greece rumor is false, and the region is actually inspired by Southeast Asian islands (Indonesia, etc): https://xcancel.com/CentroLeaks/status/1977758426898763823",
        "comments": [
            {
                "raw_content": "pokemon wind waker",
                "author": "Yacobo93"
            },
            {
                "raw_content": "Pokemon Up and Down",
                "author": "Gorotheninja"
            },
            {
                "raw_content": "Pokemon Heaven and Hell",
                "author": "darkcomet222"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "One of the original pitches for 2nd Pokémon Legends game was set in Edo period Johto for the 25th anniversary of Gold/Silver",
        "score": 423,
        "text_content": "Source: https://images2.imgbox.com/dc/5f/MWTYWfDw_o.jpg",
        "comments": [
            {
                "raw_content": "that would have been pretty cool",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "I suspect it was originally going to be more like Legends Arceus Maybe the original plan for the Legends series was exploring the history of the world before they decided to make it more of a \"gaiden\" series",
                "author": "Totheendofsin"
            },
            {
                "raw_content": "I really really hope the Unova remakes are fully realised and not chibi-style again. A full 3D Unova would be a sight to behold.",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Very early pitch for Pokémon Legends 3 has it set in Galar 1000 years in the past",
        "score": 312,
        "text_content": "Source: https://i.ibb.co/rJ9sCfd/G3-KDoiy-W0-AA-w-A5.jpg Considering what happened to Legends 2, there is no guarantee this game will actually release.",
        "comments": [
            {
                "raw_content": "\"where there are no balls\" 😨",
                "author": "nderscore__"
            },
            {
                "raw_content": "This game has a better chance than Unova imo. Sword and Shield broke sales records during its release timeframe. Although I’d like to see a unova legends :(",
                "author": "Primal-Dialga"
            },
            {
                "raw_content": "With Legends, between this and ZA. It seems like GF using these games to focus on the regions with more underbaked lore. Assuming this is the pitch for Legends 3 that got the greenlight.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Expands U.S. Manufacturing With Fab 52, Reveals Panther Lake Platform",
        "score": 75,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "How's the current sentiment at Intel like?",
        "score": 63,
        "text_content": "I'm almost afraid to say it, but IFS moment might have arrived. Everything seems to be aligning. It's been a few years of pain with layoffs (sorry if anyone was let go), capex cuts and tech underperformance. But most pain seems to be behind and Lip-Bu Tan is steering the firm in the right direction. 1. The Nvidia announcement was big and it was a first step to change the sentiment about the company 2. Trump admin is laser-focused on strengthening US manufacturing, especially in critical sectors like semiconductors. Having their backing is key 3. Last week's news about Intel solving 18A yield issues looks very promising. Curious to know what other people or current employees think.",
        "comments": [
            {
                "raw_content": "Fab level module engineering, so not representative of the entire company - Can't say sentiment is phenomenal at the moment. Layoffs are more or less complete, but everyone is struggling with smaller teams/losing some really good people (removing management layers was good, laying off every SGL because that layer is gone just threw decades of tool knowledge out the window, should've at least offered them tech roles). Reorg was necessary, but wasted a lot of already ongoing effort (for example, my toolset got moved to a new organization and now has a completely new set of engineers/techs working on it who don't know how it works). RTO destroyed whatever morale was left (particularly the week we got forced to show up but had no peripherals at our desks, lol). Macro level there are some good changes ongoing, but they take years to come about, and none of the announcements really matter for the fabs if we can't land an external customer. We'll see in another 6 months or so I think.",
                "author": "__T_R_E_E__"
            },
            {
                "raw_content": "It is too early to judge Lip-Bu Tan. The broad was wrong to fire Pat Gelsinger, but that's just my view because I want to see more innovation coming from Intel.",
                "author": "TheFallingStar"
            },
            {
                "raw_content": "Employee here, I do design verification in Oregon (pre silicon). On my team layoffs seem to be over (for now) and with all these announcements and stock going up I'd say that sentiment is up significantly, layoffs are hard especially in teams that are already slim. 1. The Nvidia announcement seems good overall, some mixed opinions, but public sentiment is up which helps morale 2. Trump admin seems to like us now, wild that he tweeted to have lip bu removed a few weeks/months ago, seems US government wants us to succeed though 3. I'm not in fab, but we love hearing good news from fab! Overall sentiment feels a lot higher than it was a few months ago, return to office has some people annoyed, but it hasn't been as bad as I expected",
                "author": "sabihoth"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD “Sound Wave” APU with 32x27mm package appears in shipping manifests",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Another Transformer codename?",
                "author": "kf97mopa"
            },
            {
                "raw_content": "If the rumors are true and Sound Wave is for a Windows on Arm Surface device, what did Microsoft promise to get AMD to partner again after they allegedly bailed on Van Gogh?",
                "author": "Gachnarsw"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Gigabyte launches Radeon RX 9070/9060 XT GAMING ICE cards with white theme",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still don't understand how they bring white designs that have black PCB, black heatsink, black power connectors!",
                "author": "Aaadvarke"
            },
            {
                "raw_content": "They should’ve launched their Stealth models too",
                "author": "ataleoffiction"
            },
            {
                "raw_content": "<Facepalm>. Maybe its me but i consider ice to be more transparent.",
                "author": "ALEKSDRAVEN"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Where Have All the Young Home Buyers Gone? Check the Stock Market",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This pretty much sums up why younger people with money are not buying houses at the same rate as prior generations. Additionally, this article is way too friendly to the homeowner (ie doesn’t include reserves for major repairs which are 100% guaranteed over 10 years plus the cost of upgrades to get the house up to standard to be able to sell). Even assuming the WSJ article’s numbers, $354,000 of stocks is way more valuable than $305,000 of home equity; numbers aren’t even close. Plus $305,000 of home is far riskier bc it is not diversified. All it takes is a fire or other natural disaster and that house is worth zero. When you couple these numbers with the fact that access to the diversified investments in stock market has almost zero cost and is very easy to get (unlike in prior generations), you have a recipe for a massive cultural shift. Houses are luxury items, not optimal investments.",
                "author": "Professional_Tea7051"
            },
            {
                "raw_content": "non-paywall (WSJ): https://archive.ph/eWC5q",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Interest payments, insurance, property taxes, HOA fees, maintenance-real estate is not a great investment. Stocks can give you a better return with no maintenance required.",
                "author": "Soonerscamp"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Would-be homebuyers are getting cold feet and backing out of deals at a record pace as some sellers have a 'hard time adjusting' to new reality | Fortune",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No reason to buy now. There's no value there and supply is exploding. Let the market bleed out.",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "I was planning on buying a house but the housing market has been weak lately. I can't mentally purchase a home knowing the price cuts are getting better.",
                "author": "coldshowerss"
            },
            {
                "raw_content": "I was one of these people. Was going to buy a place in AZ because I’m moving for work in the near future and the market is a disaster. 600-700k barely got you a 2,000 sq ft place in a reasonably decent area. With interest rates close to 7%, the payments on those places were 4k or greater all included. No one is budging on price and houses are sitting for long periods. I can rent a whole ass house for less than 3k per month, so I’m going to do that and see if the market cools enough to become more favorable.",
                "author": "andrew_kirfman"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Record number of renters “cost burdened”",
        "score": 15,
        "text_content": "The Joint Center for Housing Studies of Harvard University released its annual report, The State of the Nation’s Housing 2025, on June 24. The report highlights that half of all renters in 2025—a record 22.6 million—were housing cost-burdened, spending 30% or more of their household incomes on housing and utilities. Renters with annual incomes under $30,000 on average had only $250 left to spend on other necessities after paying for housing. https://www.jchs.harvard.edu/sites/default/files/reports/files/Harvard_JCHS_The_State_of_the_Nations_Housing_2025.pdf",
        "comments": [
            {
                "raw_content": "Just based on super crude math, if shelter costs just went sideways for 7 more years (as they have been for the past 3 already), while wages inflated at their normal rate, then wages would catch up to the pandemic-era shelter cost growth. 7 years goes faster than you think. So, it’s possible that this normalized over the next decade or so, without any crashes, etc. Of course, it’s also possible we have a crash.",
                "author": "GurProfessional9534"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Gemini 3 Just Simulated macOS in a Single HTML File 🤯",
        "score": 1050,
        "text_content": "source: [https://x.com/chetaslua/status/1977866953705316571](https://x.com/chetaslua/status/1977866953705316571)",
        "comments": [
            {
                "raw_content": "Google is good, but didn't have to be this good.",
                "author": "mightythunderman"
            },
            {
                "raw_content": "If you wanna try it out yourself: https://codepen.io/ChetasLua/pen/EaPvqVo",
                "author": "TFenrir"
            },
            {
                "raw_content": "No fucking way this is real",
                "author": "TheSiriuss"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia CEO Jensen Huang just hand delivered the Nvidia DGX Spark to Elon Musk at SpaceX today",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "is Elon signing something that Jensen gifted to him? i gotta be missing something here",
                "author": "ClanOfCoolKids"
            },
            {
                "raw_content": "Gavin Belson's signature edition vibes.",
                "author": "Fit-Stress3300"
            },
            {
                "raw_content": "In one of my AI classes, professor asked “what’s more important for AI advancement: big data, algorithms, or compute power?” I answered algorithms because that’s what causes hallucinations and other issues. You can have the most data or compute but if you can’t actually leverage them then it means nothing. I still believe that Elon can and/or will be the one with the most compute but he will fail cause he can’t back it up with reliable algorithms. He thinks big compute is a short cut to performance. Eventually, 2-4 years down the line, with all the advancements, they won’t be fighting for compute power anymore.",
                "author": "MoCA210"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Starlink v3 is huge and will provide gbps connectivity to users.each v3 sat will add 60 tbps capacity to the network, 20x of v2",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does anyone think the standard Residential plans will ever get 1 Gbps? Or will gigabit be a premium offering? I was thinking about how some communities are getting fiber or cellular tower upgrades, and Starlink might compete with those options by offering higher bandwidth.",
                "author": "7f0f9c2795df8c9351be"
            },
            {
                "raw_content": "People diss Elon all the time, but SpaceX has done more for accelerating space exploration/exploitation than anything since arguably the Apollo program.",
                "author": "Outside-Ad9410"
            },
            {
                "raw_content": "When ?",
                "author": "vilette"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ring-1T open-source model released, achieving SOTA benchmark performance and silver-level IMO reasoning",
        "score": 207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder how they measure those metrics, because on https://livecodebenchpro.com/ when comparing these models with GPT-5 High, there is a difference of over 1000 Elo points! Compared to DeepSeek R1, and 500 compared to Qwen and Gemini. And where is SWE-Bench?",
                "author": "Glittering_Candy408"
            },
            {
                "raw_content": "Damn, Gemini 2.5 pro surpassed by open source?",
                "author": "Different-Froyo9497"
            },
            {
                "raw_content": "Brb, buying a nuclear reactor to be able to run this at home",
                "author": "xcewq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Greg Brockman on AI-designed chips and the future of compute",
        "score": 120,
        "text_content": "",
        "comments": [
            {
                "raw_content": "source: [ OpenAI x Broadcom — The OpenAI Podcast Ep. 8](https://www.youtube.com/watch?v=qqAbVTFnfk8)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Vibe chip design was not on my 2025 bingo card",
                "author": "Educational_Teach537"
            },
            {
                "raw_content": "Isn't this what Google has been doing with \"AlphaChip\" and their TPUs for years now? https://deepmind.google/discover/blog/how-alphachip-transformed-computer-chip-design/",
                "author": "Gaiden206"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I think pantheon should be apreciated more in this sub.",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How much closer to this mans face do we need to be?",
                "author": "Willing-Situation350"
            },
            {
                "raw_content": "It’s an incredible show.",
                "author": "gerredy"
            },
            {
                "raw_content": "Well, I think he'll avoid a lot less trouble replicating MIST than Samantha anyways. As far as Pantheon in general goes, the UIs in the show were basically stand ins for AGI and the impact on society. Definitely wouldn't mind such a future.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scientists have uncovered just how naked mole-rat repair their DNA – and it has the potential to be harnessed for humans to do the same. Their enzyme has 4 key changes that facilitate the important work that extends their lifespan and keeps them healthy and disease-free for a remarkably long time.",
        "score": 262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Side effects include hair loss and vision impairment.",
                "author": "Volitant_Anuran"
            },
            {
                "raw_content": "The future is hairless.",
                "author": "DRLB"
            },
            {
                "raw_content": "Would \\*you\\* want to live longer as a naked mole rat?",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 MacOS oneshot seems really suspicious",
        "score": 38,
        "text_content": "https://preview.redd.it/2ndgp1z97zuf1.png?width=633&format=png&auto=webp&s=37086485792e3d30d973da6f2340a7da87f8a5e9 This guy claims to behind the impressive oneshot of macOS HTML preview that is very impressive ngl but why is he not sharing the prompt? I don't think there is any reason for him to do so. Gemini 3 will be good but not this impressive if you ask me. But this is only what I think. what do you guys think?",
        "comments": [
            {
                "raw_content": "Why are people acting like a simple frontend app is impossible? Gemini 2.5 can do this also, though admittedly 3.0 looks much cleaner. Here's Gemini 2.5 creating Windows. I made it with a single prompt (requires Google account login): https://ai.studio/apps/drive/1dCilmCFVJMVpeDXp09IiutsxDxW8bQ3Y edit: [Here's GPT-5's attempt at a MacOS simulator, one shot.](https://eposnix.com/web/MacOS.html)",
                "author": "eposnix"
            },
            {
                "raw_content": "I shared the prompt and basically I needed confirmation from logan",
                "author": "chetaslua"
            },
            {
                "raw_content": "the website posted has a terminal command called 'matrix' that generates a fun matrix waterfall. Very skeptical any AI would have added that to an html emulation of macOS, since it had never been a standard stock terminal feature in macOS. seems like something a human would add because they find it funny.",
                "author": "baldr83"
            }
        ],
        "subreddit": "singularity"
    }
]