[
    {
        "post_name": "TRUMP: I have nothing to hide. I have been exonerated. I have nothing to do with Jeffrey Epstein. I have been totally exonerated on Epstein.",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To his credit he's never changed his story about Epstein. Issue is the people around him who he's still friendly and/or works with have.",
                "author": "jlange94"
            },
            {
                "raw_content": "The left: which just proves his guilt all the more.",
                "author": "Overtaxed"
            },
            {
                "raw_content": "God Bless President Trump Cue my downvote bot",
                "author": "DonyBanano"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hey @jimmykimmel , can you help me understand this post of yours a bit better? What’s the difference between a “dead” or “live” pizza? Care to explain?",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's probaly a vegan thing, if you read the tweet. A dead pizza is animal a live is vegan or something stupid like that.",
                "author": "Maganifice7"
            },
            {
                "raw_content": "He looks so creepy",
                "author": "TheMAGAnificent"
            },
            {
                "raw_content": "This is a silly thing to sticky. It's almost certainly some stupid vegan thing where a \"live pizza\" is just a bunch of veggies on more veggies. I am prepared to believe that creeps like Kimmel are pedos when I see the evidence, but this ain't it.",
                "author": "IHateUntruth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shooter at the hockey rink was a man in women’s clothing. Another mentally ill troon.",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He was a troon. The personal photos are out and they are horrifying. RIP to his family. Tolerance for this insanity needs to cease.",
                "author": "seeling0"
            },
            {
                "raw_content": "The Donald will never talk about the race of the guy if he is white … but loves to throw the N word around if he is black …. This place is full of white racist hypocrites",
                "author": "DeltaSierra"
            },
            {
                "raw_content": "This Article has some more details. Went by Roberta, gender reassignment surgery etc… https://www.wpri.com/target-12/pawtucket-shooters-gender-identity-tied-to-past-family-disputes-court-records-show/",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is what McDonald’s in Poland looks like",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Poland calls my name.",
                "author": "Erkme73"
            },
            {
                "raw_content": "They are missing out of the Nig experience.",
                "author": "AcAirman"
            },
            {
                "raw_content": "They are missing out on a lot . The yelling about getting money back, Fights, rude employees and filthy dining areas.",
                "author": "Hvacguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHAT HAPPENS NEXT?",
        "score": 965,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2020 stolen.",
                "author": "Johnrgalt"
            },
            {
                "raw_content": "Tranny Violence",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Has anybody been jailed for the Russia hoax? Has anyone been jailed for poisoning and killing and doing irreparable damage to millions of people? Any Epstein buddies, pedos, blackmailers, etc. go to prison? Nope. You know what else we'll be disappointed about? Not shit happening to the election fraudsters.",
                "author": "MAG_n_KAG"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS WAS CALLED \"SEXUAL ASSAULT\" NOT LONG AGO.. TODAY??",
        "score": 792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just want to put this out there: **SHE HAD NO FUCKING IDEA SHE WAS WRESTLING A TROON.**",
                "author": "Kamalaharrisisacunt"
            },
            {
                "raw_content": "I believe penetration makes it rape.",
                "author": "2016TrumpMAGA"
            },
            {
                "raw_content": "Bevis and Butt-head. \"He's got a boner!\". IYKYK.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Kristi Noem: Democrats in Congress have shut down @FEMA funding—leaving our hard working employees to work without pay—yet FEMA is now stepping in to coordinate cleanup of one of the largest raw sewage spills in U.S. history.",
        "score": 1022,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. I hope all government officials in DC take a big gulp.",
                "author": "TrumpRideorDie74"
            },
            {
                "raw_content": "This is all too fucking stupid now. “The people who tried to kill us and destroy America is still trying to destroy America but all I’m gonna do is piss and moan about it on the internet instead of using my authority and government assets to arrest and charge them with treason! Oh my godses!!! They keep killing and destroying our country!! I can’t believe they are still doing this!!! I’m telling on you!!!” All of them need to be hung. Every goddamn one of them.",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "Sounds to me like democrats don't want the sewage cleaned up.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mark Carney : We’re renewing Canada’s relationship with China. As part of our new strategic partnership, China is granting visa-free travel for Canadians.",
        "score": 739,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the whole communist China army can come right over. What a traitorous bunch.",
                "author": "brutustyberius"
            },
            {
                "raw_content": "Build a northern wall!!!",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "National security risk, close the border or at the very least ban Canadian visas until a vetting procedure can be established.",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An 86-year-old man in the U.K. was fined $334 for spitting out a leaf that flew into his mouth, with police saying he was \"littering\". He appealed it and had the fine reduced to $200.",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly, they are making it to where we despise them so much that we will feel nothing when they die.",
                "author": "Tikk"
            },
            {
                "raw_content": "The brits are totally cucked faggots to continue to live under such ridiculous tyranny and do nothing about it",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "I don't know how we can sit here and make fun of the UK for \"putting up with this\" when we will be \"putting up with this\" in less than 2 years, if we don't figure out how to stop the midterm steal.",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DC and Maryland Democrats are STILL pumping raw sewage DIRECTLY into waterways leading to the Potomac River, with NO end in sight Where the hell are the environmentalists??! Oh that’s right — they don’t care, b/c this isn’t politically expedient",
        "score": 1230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[President Trump: There is a massive Ecological Disaster unfolding in the Potomac River as a result of the Gross Mismanagement of Local Democrat Leaders, particularly, Governor Wes Moore, of Maryland. A sewer line breach in Maryland has caused millions of gallons of raw sewage to be dumped directly into the Potomac River, a result of incompetent Local and State Management of Essential Waste Management Systems. This is the same Governor who cannot rebuild a Bridge. It is clear Local Authorities cannot adequately handle this calamity. Therefore, I am directing Federal Authorities to immediately provide all necessary Management, Direction, and Coordination to protect the Potomac, the Water Supply in the Capital Region, and our treasured National Resources in our Nation’s Capital City. While State and Local Authorities have failed to request needed Emergency Help, I cannot allow incompetent Local “Leadership” to turn the River in the Heart of Washington into a Disaster Zone. As we saw in the Palisades, the Democrat War on Merit has real consequences. The Federal Government has no choice, but to step in. FEMA, which is currently being defunded by the Democrats, will play a key role in coordinating the response. Thank you for your attention to this matter!](https://truthsocial.com/@realDonaldTrump/posts/116082091487085093)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Trump: I'm going to drain the swamp Communists: Hold our vodka!",
                "author": "Build_Back_Bankrupt"
            },
            {
                "raw_content": "I don't see a problem here, Saaar.",
                "author": "HelluvaEngineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They somehow managed to make the Obama presidential library even uglier.",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "evil cannot create beauty",
                "author": "lostremote-"
            },
            {
                "raw_content": "Looks like something out of Star Wars, and Michael makes a great Wookie.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Say \"aye\" if you want Trump to take over that building and Turn it into a ICE processing/deporting facility.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🏳️‍🌈 Democrat Kansas Governor Vetoes GOP-Led Bathroom Bill 🚽",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Women don't belong in politics",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "How the hell does Kansas of all places have a Democrat governor?",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "How many women and girls have to get raped in women’s bathrooms until this insanity ends? I guess all of them according to Democrats.",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California already has the highest gasoline prices in the USA. And it is about to get worse.",
        "score": 964,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you ever wonder what leftists want for you just look towards California: taxed to death with nothing to show for it.",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "lol. Fucking state needs to crumble fully",
                "author": "FlyCatcher94"
            },
            {
                "raw_content": "By 2028, Californians will be forced to comply with fellatio sensors at each pump, and the only way to get gas is to show your 666 barcode tattoo and suck each gallon out, one drop at a time.",
                "author": "HeinzHummer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Linda Davis, a teacher at Hesse K-8 School in Georgia, was KILLED after an ILLEGAL ALIEN reportedly crashed into her while attempting to flee ICE. Oscar Vasquez-Lopez, an illegal from Guatemala, fled ICE officer during a traffic stop, making an illegal U-turn, which resulted in her death.",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully she was a popular teacher and her young students are filled with righteous rage against the illegals. That is pretty much the only good that can come out of this.",
                "author": "SWRAD"
            },
            {
                "raw_content": "Why would ICE do this?",
                "author": "slayersv"
            },
            {
                "raw_content": "46k Americans have been murdered by illegal immigrants since the Reagan amnesty. What a colossal mistake that was.",
                "author": "HorrorGameDev"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wendy’s, Hyundai, Walmart, PepsiCo, Amazon, Kroger, HelloFresh, Dairy Queen, Dave & Buster's Burger King, Dunkin Donuts and Michigan agriculture fields all caught breaking child labor laws",
        "score": 1137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wendy's now has shredded lettuce RIP",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "The children yearn for the mines.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Still waiting for them to go after the Tyson factories like we heard nearly 6 years ago.",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat war on merit has real consequences.",
        "score": 1234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not incompetence. Does anyone believe they are above poisoning the water as a means to try to own Trump somehow? They will burn everything down and salt the earth if it takes Trump's focus off of anything even for a day.",
                "author": "ckover9000"
            },
            {
                "raw_content": "When do We get to throw them into the Potomac?",
                "author": "Spunas1"
            },
            {
                "raw_content": "I love that he called them out over the bridge. Their timelime to build it is so ridiculous.",
                "author": "MAGASQUAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hyatt Hotels billionaire Executive Chairman Tom Pritzker resigns, citing association with Epstein",
        "score": 1222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And yes Tom Pritzker is related (cousin) to Mentally Illinois Governor JB Pritzker.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Look, Hyatt just got better. Real title should say: Pedo gets off with a faux resignation. Never indited and will not serve a day in jail.",
                "author": "bantar"
            },
            {
                "raw_content": "I wonder if JB will be implicated",
                "author": "HeartofStone2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shooting in RI Hockey Rink: Father shot wife, two kids, third child alive, finally killed himself. Family annihilation shooting. IOW, the answer is not gun control.",
        "score": 876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you kill kids you go straight to hell. Absolutely horrifying. I can't even handle these stories.",
                "author": "Ficklepimper"
            },
            {
                "raw_content": "Christ. Imagine being the one living child.",
                "author": "Underpants"
            },
            {
                "raw_content": "This account is literally run by a diaper fetishist sodomite. https://patriots.win/p/1ARdW2GEL8/he-got-stickied-again-so-here-is/c/ Every time you share his content you're helping to buy his next pack of diapers so he can jerk off in his own p💦ss and sh💩t instead of getting a job.",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Grandpa walks off show once he finds out his dance partner is a transgender.",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice part of getting old, not feeling the need to tolerate other people's bullshit.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "\"I'm not going along with that, it's time to stand up and be a man of god\".....Amen!",
                "author": "Stlpoolguy"
            },
            {
                "raw_content": "Curious if they tricked these guys to be on there in the first place",
                "author": "xBigCoffinHunter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Russian Forces Conquer a Dozen Eastern Settlements So Far in February, as Ukraine’s Lack of Energy Hinders Its Military Industry",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait I've been told for years now that Ukraines victory was imminent and that all of Russia was on the verge of collapse from little z's superior leadership.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "Low energy Ukraine must have Jeb! advising them",
                "author": "FloridaDesert"
            },
            {
                "raw_content": "Not my monkey, not my circus",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Many consumer electronics manufacturers 'will go bankrupt' by the end of 2026 thanks to the RAMpocalypse, Phison CEO reportedly says",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "PSU, CPU, and peripheral manufacturers will all suffer If people can't afford to build a PC because of RAM then there's no point buying other parts either",
                "author": "rTpure"
            },
            {
                "raw_content": "Don't worry you will be able to subscribe to whatever computing needs you have, for a modest monthly fee of course, after all of them disappear.",
                "author": "TheMooseontheLoose"
            },
            {
                "raw_content": "I'm really worried about companies like G.Skillz. that specialize only on the consumer market.",
                "author": "Eclipsed830"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Western Digital is already sold out of hard drives for all of 2026 — chief says some long-term agreements for 2027 and 2028 already in place",
        "score": 221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so the singing cats videos eats lots of storage eh?",
                "author": "Glad-Audience9131"
            },
            {
                "raw_content": "Gotta tell my wife that my big 400TB NAS was the right move last year over the Hermes bag she wanted Edit: I’m sleeping on the couch today",
                "author": "TragicKid"
            },
            {
                "raw_content": "I literally got the last WD hdd drive within 500 miles because I ordered it after the announcement. This is fucking insane. My company is 3 people. We have one fucking drive in case of failure on the main NAS.",
                "author": "dropthemagic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD's desktop CPU market share grew by almost 15% in 2025, all thanks to Ryzen",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would be pretty confused if their CPU market share grew because of Radeon",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "The 5800X3D came out in April 2022. From that moment on, the gamer and enthusiast answer to \"what CPU should I buy?\" has been a Ryzen. But even outside of the enthusiast space, Intel's competition for the last couple generations has been underwhelming. The 13th and 14th gen used way too much power, before the stability problems began, and Core Ultra is \"ok\" but didn't raise the bar. This has allowed AMD to charge higher prices than they've been able to for a long time, increasing revenue which is what this article is really about. Intel's Panther Lake seems to be... good? At the very least its integrated graphics are good. The desktop version is rumored to have a high cache option to finally compete with the X3D. So that's good, both major x86 CPU makers may have nice competitive products in 2026 just in time for the rest of the computer to be unaffordable.",
                "author": "FuturePastNow"
            },
            {
                "raw_content": "Market share in revenue, not in units. AMD significantly grew revenue per unit, if it was any other company, the headline would probably be something like \"they’ve raised prices so much that their revenue per unit increased so much\"",
                "author": "Jumpy-Dinner-5001"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PS6 could reportedly be delayed while Switch 2 might get even more expensive as Sony and Nintendo reckon with brutal AI-led memory chip shortage",
        "score": 284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Better to have PS6 launch later, rather than now and nerfing it with an outdated cheaper amount of RAM that would hold gaming innovation back for the next 10 years.",
                "author": "capybooya"
            },
            {
                "raw_content": "Good don’t need a PS6 we need more PS5 games",
                "author": "jth94185"
            },
            {
                "raw_content": "To be honest, as a consumer, I don't see why the release date is important. If you're satisfied with your PS5 or PS5 Pro, the hardware doesn't instantly become outdated—especially since we're currently in a cross-gen era, and the window will continue to increase as confirmed by Sony’s CFO in an investor call last year. No one ever says new PC graphics cards shouldn't come out. You can't simultaneously have these long ass cross generations, but now be afraid releasing PS6 is going end PS5 game development. Again, the latter isn't happening as cross gen will continue to be a thing.",
                "author": "Kizzo02"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen 5 edges past Exynos 2600 in early Galaxy S26 series benchmark comparison",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Exynos (SC: 3197, MC: 11012) VS SD 8EG5 (SC: 3724, MC: 11237)",
                "author": "self-fix"
            },
            {
                "raw_content": "Before people start dissing Samsung’s 2nm: the stock ARM cores are significantly behind Qualcomm’s Oryon cores this gen (and last) on ISO node, so take that into account.",
                "author": "eriksp92"
            },
            {
                "raw_content": "How does the regular Snapdragon 8 gen 5 stack up against these 2? Will I notice a difference if I'm not gaming on my phone.",
                "author": "Accurate-Currency181"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung seizes HBM4 lead as SK hynix risks from outsourcing and 1b DRAM",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm surprised SK Hynix and the Korean gov't hasn't moved on protecting SK Hynix logic die designs and foundry capability. Logic dies will increasingly have built-in computing power so the memory stacked on top will become less important and lower margin.",
                "author": "snowfordessert"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Confirms Data Center GPU IP After Xe3P with \"Xe Next\"",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ponte Vecchio = failure forced out by DOE contract (it's terrible and extremely inefficient) Rialto Bridge = stillbirth Falcon Shores = stillbirth Wait for Jaguar Shores™️",
                "author": "996forever"
            },
            {
                "raw_content": "Makes sense. Intel's battlemage already have decent XMX units (similar to tensor cores; basically ASIC for matrix multiply). Software support is still weak-ish (but not terrible -- IPEX is a pretty impressive compatibility layer), but hardware wise gaming battlemage already shows that they can do MMA and inference decent-enough. I also like how they're focusing on inference. Training is pretty much stuck on NVIDIA for everyone except Google who uses TPUs; and much harder to compete in.",
                "author": "goldcakes"
            },
            {
                "raw_content": "Sounds like no more dGPUs",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Using a monitor with different gpu",
        "score": 0,
        "text_content": "I have two different gpu (nvidia a4000 and amd e9171) and I have to use two or more monitor in the system. First monitor should be connect with nvidia a4000 for use standart operation systems. Other monitors should be connect AMDs dvi and display ports. External monitors shouldnt be use by os. So I need to send some displays to the external monitors from amd. The only thing I should see is a display that I sent. There shouldnt be an os in them. Only from the main monitor we should see the os from nvidia. Amd should only use for sendin display. External monitors should be functionless and we just need to see the displays with bypassing os.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Assassin's Creed Shadow Graphics Update A major update will arrive tomorrow for the game, improving the graphics of the Nintendo Switch 2 version.",
        "score": 506,
        "text_content": "It will be 2.91GB and will include the following improvements: Stability fixes, improved touchscreen experience, and water reflections enabled",
        "comments": [
            {
                "raw_content": "Water reflections enabled, but *only* for docked mode.",
                "author": "Active_Drama_9898"
            },
            {
                "raw_content": "It's so nice to see third parties back on board a Nintendo system. Especially this early on. All the hard work Ubisoft and Capcom are doing is going to pay dividends when they can more easily port future titles to the Switch 2 without having to wait months/years later like Switch 1",
                "author": "NoMoreVillains"
            },
            {
                "raw_content": "Damn, Ubisoft improving Outlaws and AC Shadows after release is huge. Putting all these publishers dropping shitty ports to shame.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For those wondering what the new Virtual Boy looks like without the headset. You can still play the games but the sqaures are quite small, especially in handheld mode. Still cool everything runs and you just need the headset or some type type of glasses that mimic the Virtual Boy",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those wondering, I tried using the zoom function but it's unfortunately blocked when playing any of the Virtual Boy games",
                "author": "WinterStarlightZone"
            },
            {
                "raw_content": "Why couldn't they release this on the 3ds?",
                "author": "Armandonerd"
            },
            {
                "raw_content": "Is it out now, or are you a day ahead in Australia or something?",
                "author": "Vicious007"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "As an OG Virtual Boy owner - NSO one is brilliant",
        "score": 410,
        "text_content": "I’m one of the rare ones who got a Virtual Boy when it released in 1995 as a teenager (seen in my childhood bedroom photo here). Unfortunately I have no idea where it or a lot of my childhood gaming stuff is. So even though the new NSO one was a bit pricey, the moment I got it, the throwback and memories alone made it worth it. And the oddest thing was what really came rushing back was the smell of the foam visor. I’ll mostly be using it as a display art piece to be honest and that alone would be enough but can’t wait to have headaches and neck strains when the Virtual Boy app releases tomorrow!",
        "comments": [
            {
                "raw_content": "Dang, you got the same living room as the ones in the commercials.",
                "author": "Dagawing"
            },
            {
                "raw_content": "It never launched in the UK so, 30 years later, it's finally my chance to play it! Part of retro gaming history, so it does mean a big deal to me even if the games aren't amazing. My order is turning up tomorrow! Whoop whoop!",
                "author": "Mundane-Security-454"
            },
            {
                "raw_content": "I also got one back in 1995 (not in August, where it launched on my still best friend's birthday, but for Christmas.). It cost my parents $250+ tax, and the next year they still bought me an N64 for Christmas. Looking back on it... yeah, I was fortunate in that way, although I wouldn't say \"spoiled\" -- my dad was physically and emotionally abusive, and not just to me, so life was hard in other ways that I've carried with me. No wonder I'm still so into retro Nintendo gaming and everything else that helped me escape back then. I loved that system, and had eight games that I played constantly until the N64 came into my life (Mario Tennis, Teleroboxer, Red Alarm, Panic Bomber, Space Pinball, Jack Bros, Mario Clash, and Waterworld!) Then, as a 14 year old in 1997, I wanted Goldeneye and had no money, so I sold it to my other lifelong best friend. He gave it back to me for Christmas when I was in my early '20s, and I held onto it until times got hard over a decade later. I'll always regret that sale. But to the point I \\*meant\\* to make with this reply: now that I've spent a couple of hours with the NSO Virtual Boy app (it's launched in Japan!), I have to second your assertion: it's \\*absolutely\\* brilliant. The smell (minus decades of sweat), the image clarity, the deep blacks, the otherworldly red, even the feeling of coming out of it after an hour to a world that feels slightly wrong... it's all there and exactly as I remember it (the last time I played a real VB was just over ten years ago.) This is, hands down, the best thing Nintendo has ever done with their library of classic games on NSO (although I would obviously prefer to be able to purchase the games instead of having to subscribe to the service.) Unfortunately it's not perfect: you have to play on battery if using a Switch 1/OLED, so those of us who retired their Switch/OLED with the dawning of the Switch 2 era can't just leave the older console installed inside the '26 VB permanently. Switch 2 users can plug that console into an outlet using the top USB C port... but only if they flip the lid open on the '26 VB. And headphone use is limited to bluetooth, which just absolutely sucks. I don't think there's even a way to dremel out some space for a USB cable or headphones in there, since the clearances are so tight once it's closed. On the flip side, the red eyepieces make those subpar blacks on the Switch 2's screen on par with what you get with the Switch OLED, so anybody with a non-Lite Switch or Switch 2 is going to get a fantastic experience. So yeah: it's the real deal. If you didn't grow up loving this system, it might be a hard sell. But to someone who has always loved the system and who has watched the price of real Virtual Boys skyrocket in the last decade, the cost of entry is an absolute bargain.",
                "author": "nusilver"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Never was much of a cowboy or western fan but Red Dead Redemption is so well done and immersive. Runs great on the Switch 2 as well",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Give Undead Nightmare a shot when you're done with RD1. I just completed it for the first time on PC and it was a fantastic little expansion of the base game. They use all the characters from the original story well, both as survivors and others as zombies lmao",
                "author": "GoodOlSticks"
            },
            {
                "raw_content": "Same here, one of my favorite games. I'm hoping they release RDR2 on the Switch 2.",
                "author": "Verabiza891720"
            },
            {
                "raw_content": "I played it for the first time ever back in December when I got my switch 2. I think it mightve even been my first game to play on it (I grabbed it in a VGP sale for pretty cheap as I knew it was getting a switch 2 upgrade and figured I'd play it whenever I got a switch 2) And boy I loved it and it's such a pretty game considering how old it is. My only major complaint is there's a mission where it's just straight up soft locked and I couldn't actually progress until I died enough times to trigger the \"skip button\" Other than that I loved it (so much so that I did a playthrough of 2 right after)",
                "author": "sbillman18"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 version of Assassin's Creed Shadows welcomes the Claws of Awaji expansion on March 10",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Enabled water reflection” there ya go!",
                "author": "Possible_Aardvark856"
            },
            {
                "raw_content": "Nice! I just bought the game",
                "author": "PaleFondant2488"
            },
            {
                "raw_content": "Do I have to buy this separate?",
                "author": "TheSacredShrimp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got the Kirby pouch/case from Hori",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kirby not happy with what they consumed. Barfing commencing in 3...2...",
                "author": "weaklingoverlord"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Bloomberg] Nintendo contemplating raising price of Switch 2\"",
        "score": 461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI losers continuing to ruin the world for everyone else.",
                "author": "SmokyMcBongPot"
            },
            {
                "raw_content": "Was having switch 2 regret but now i feel a bit better about getting it before all the price hikes lol",
                "author": "Hailtothedogebby"
            },
            {
                "raw_content": "With how the prices are, I think everyone expects this. Still, even Nintendo knows that the sales outside of Japan aren't necessarily in top shape, so I'm quite split on if they will actually increase or not the price. They could try to increase the price of every non switch 2 product in the rest of the world, like how they did with the US. This would make the switch 2 itself still unaffected by the price increases, but there's only so much they can do before they start taking a big loss with every system sold. Can't wait for the day this stupid AI bubble bursts and we can start enjoying our hobbies again, without having to sell a kidney to get electronics.",
                "author": "Vanilla_Baunilha"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ys X: Proud Nordics adds DLSS, first 120fps Switch 2 game to support DLSS (image via RPG Site)",
        "score": 185,
        "text_content": "**Source:** [**https://www.rpgsite.net/feature/19630-ys-x-proud-nordics-switch-2-dlss-upgrade-english-release-comparison-performance**](https://www.rpgsite.net/feature/19630-ys-x-proud-nordics-switch-2-dlss-upgrade-english-release-comparison-performance) When Ys X: Proud Nordics released on Switch 2 last July it was the first 3D game to support 120fps with graphics superior to the original 30fps Switch 1 version of the game and graphical cuts vs the PlayStation release restored. As an action game it felt so good to play, and even in performance mode the use of VRR meant it always looked smooth even when the performance level dipped below 60fps when the action got busy. What is a shocker is for the western release, PH3 have gone in and improved on Falcom's own well optimised code. Check the article linked but the images should speak for themselves. The original release was already a huge boost over Switch 1, PS4 and even PS5 in some ways (120fps was new for Switch 2, and PS4 was mostly a 30fps experience) but this is even better. Hats off!",
        "comments": [
            {
                "raw_content": "Street Fighter 6 is a DLSS game that supports 120hz mode to further reduce input lag. Though the game itself runs at 60fps",
                "author": "oldkidLG"
            },
            {
                "raw_content": "I know not everyone can tell the difference, but as a guy who hates aliasing I find the difference night and day. The new Performance mode seems so much smoother and clearer than the old Quality mode. I turned that comparison [into a GIF](https://i.imgur.com/wk4CR15.gif) which isn't perfect with GIF's low color limits, but I think it's still noticeable.",
                "author": "JoshuaJSlone"
            },
            {
                "raw_content": "It’s so sad that the most optimized games that take advantage of the switch 2’s hardware are non Nintendo games",
                "author": "AppropriateWater2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Pokopia director Takuto Edakawa: \"Pokopia has the biggest development team in ω-Force (Koei Tecmo studio) history\"",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I think it was about six months later that we presented the game to The Pokémon Company.\" This kind of proves that GF really doesn't have full control over the pkmn games they develop.",
                "author": "Phos-Lux"
            },
            {
                "raw_content": ">**Q: Regarding the scale of development, can you tell us roughly how many people are involved?** >**Edagawa**: I can't share the exact number of staff, but among all the titles developed by ω-Force (Omega Force) up to now, this one involves the largest number of people in the team's history.",
                "author": "Joseki100"
            },
            {
                "raw_content": "This game sort of got announced out of nowhere, and felt like normal Pokemon side-game fodder... ....but I think it's shaping up to be something kind of special.",
                "author": "peter-man-hello"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "❄️Discussion, News, and Request Thread - Week Beginning 02/16/26❄️",
        "score": 15,
        "text_content": "[Aliens are real](https://media.tenor.com/_LOm-JCkWncAAAAj/alienpls.gif) Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks**\\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Sony is considering pushing back the debut of its next PlayStation to 2028 or 2029, Nintendo contemplating raising price of Switch 2](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r6633r/bloomberg_sony_is_considering_pushing_back_the/) * [Highguard developer Wildlight Entertainment has just laid off most of its staff](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r2cs9t/highguard_developer_wildlight_entertainment_has/) * [Castlevania: Belmont's Curse listed for $39.99 USD on all platforms by Best Buy](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r3w0yh/castlevania_belmonts_curse_listed_for_3999_usd_on/) * [RE9 to have 72.88 GB size, pre-loads on February 25th and a Midnight release timing](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r4mpwu/re9_to_have_7288_gb_size_preloads_on_february/) * [Sony Santa Monica's next game is planned for 2027, reveal could come this summer.](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r5fi9i/shinobi602_natethehate_sony_santa_monicas_next/) # [Want to help us improve this subreddit? Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "No Nintendo Music drop at its normal time. Time to start specu-no it's probably something Virtual Boy or Zelda 40th anniversary related.",
                "author": "SemiLazyGamer"
            },
            {
                "raw_content": "No direct leaks it might be Joeover for this week like that one rumor may have suggested",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "I highly doubt its true, cuz its the pokemon company, but I hope the rumors about Pokemon Fire Red and Leaf Green coming to switch are true",
                "author": "NarrowExcitement9806"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Never mentioned (here) leak source about new DLC for The Witcher 3: it WILL BE expansion with a new land.",
        "score": 473,
        "text_content": "A few days ago, [further confirmation appeared here](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1r0vki2/some_new_witcher_3_dlc_leaks_natethehate_claims/) that another DLC for The Witcher 3 will be released. However, the source only mentions that such DLC is being developed, without providing any details. In January 2026, the Polish website PPE [reported that the new DLC is indeed in development](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q77cog/another_polish_site_confirms_new_third_expansion/?show=original) and that it will likely introduce a new region - Zerrikania. Going back to previous leaker, \"UV o grach\", during the stream on December 1, 2025 (before the PPE leak). he said that he had known about the development of this DLC for two years and that it would be set in a new land. Combining this with information from PPE, **it is further confirmation that the new expansion will be (probably) Zerrikania or other region.** There is also further confirmation that it will be a “bridge” between The Witcher 3 and The Witcher 4 (so we can assume that we will be strictly following Ciri's adventures). Video with English translation: [https://streamable.com/gpobjt](https://streamable.com/gpobjt)",
        "comments": [
            {
                "raw_content": "Starting to get into the timeframe for Witcher 4 trailers too, that should be what like 2027/2028? Just 1-2 years away? Cyberpunk was six years ago already gah damn",
                "author": "SilentNova300"
            },
            {
                "raw_content": "First of all „UV” is not a leaker, he is a Polish journalist with pretty big ties around Polish gamedev. Second of all don’t believe anything on PPE website, they will write whatever as long as it makes you click on the article. And by the way they use AI to write their news. Third of all, I truly believe the DLC is real. Too many Polish news outlets/journalists/content creators have been confirming they knew about the DLC way way before the leaks unless it’s a big planned prank.",
                "author": "Mean-Resource3386"
            },
            {
                "raw_content": "Nice to see",
                "author": "brolygta4"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem - Review embargo drops on February 25th at 7AM PST",
        "score": 177,
        "text_content": "[Link](https://xcancel.com/AestheticGamer1/status/2023489266911961284)",
        "comments": [
            {
                "raw_content": "A lot closer to release than re4 remake, hopefully that’s just because they want to be more secretive.",
                "author": "No_Anywhere5951"
            },
            {
                "raw_content": "I’m getting so hyped for this game, really hope it delivers.",
                "author": "anonsyed"
            },
            {
                "raw_content": "I’m honestly super excited because of all the people who have gotten hands on have said that the pacing differences between the characters are handled really interesting, and sequences that are ‘shared’ (Leon going through afterwards) actually take into account everything that Grace did, or, specifically, didn’t do, very much like the original RE2. That , and apparently you can just stumble onto zombies doing things as they would in real life, depending on the area.",
                "author": "RareBk"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Images of rumored Kingdom Hearts \"Relux\" sent to Extas1s have surfaced, Remake likely fake after all",
        "score": 216,
        "text_content": "source: https://xcancel.com/DaniAgudoDA/status/2023470218761453785 https://xcancel.com/counting_cosmos/status/2023437891230388620 https://www.youtube.com/watch?v=Eg_VPsnRtnc&t=160s https://i.postimg.cc/Dz8M0m0k/HBTPbufbc-AAp-O7G.jpg https://i.postimg.cc/s2q0hyGM/HBTPb9vb-QAAFNs-D.jpg https://i.postimg.cc/25MXZmLW/HBTPc-Em-Xg-AAotu-T.jpg",
        "comments": [
            {
                "raw_content": "#eXtas1s is a Tier 4 - Generally Unreliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "it's very funny that someone fell for this",
                "author": "mcerror0101"
            },
            {
                "raw_content": "Extas1s is a horrible source",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloomberg: Sony is considering pushing back the debut of its next PlayStation to 2028 or 2029, Nintendo contemplating raising price of Switch 2",
        "score": 2095,
        "text_content": "Quote >Sony Group Corp. is now considering pushing back the debut of its next PlayStation console to 2028 or even 2029, according to people familiar with the company's thinking. That would be a major upset to a carefully orchestrated strategy to sustain user engagement between hardware generations. Close rival Nintendo Co., which contributed to the surplus demand in 2025 after its new Switch 2 console drove storage card purchases, is also contemplating raising the price of that device in 2026, people familiar with its plans said. Sony and Nintendo representatives didn't respond to requests for comment. Source: [https://www.bloomberg.com/news/articles/2026-02-15/rampant-ai-demand-for-memory-is-fueling-a-growing-chip-crisis?srnd=undefined&embedded-checkout=true](https://www.bloomberg.com/news/articles/2026-02-15/rampant-ai-demand-for-memory-is-fueling-a-growing-chip-crisis?srnd=undefined&embedded-checkout=true)",
        "comments": [
            {
                "raw_content": "I think the gaming community is currently experiencing a mood for the first time where people don't want a console generation change simply because a potential next-gen console won't offer anything other than improved graphics settings. At their core, the games will remain the same.",
                "author": "stanscreamdnb"
            },
            {
                "raw_content": "I reckon Nintendo will try bundle shenanigans so it kind of sort of doesn't look like a price increase. Sell the MK bundle price without MK, or sub in an online trial and Welcome Tour or something like that instead.",
                "author": "Puzzleheaded-Chip869"
            },
            {
                "raw_content": "It doesn’t feel like the recent generation has even reached its halfway point yet. The amount of extraordinary *new generation games* is tiny and the PS5 Pro is already there and not a hot seller anyway - pushing back the new generation makes a lot of sense.",
                "author": "Seraphayel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Snake Eyes game is NOT canceled",
        "score": 89,
        "text_content": "[ https://wccftech.com/hasbro-wizards-of-the-coast-reportedly-shut-down-g-i-joe-snake-eyes-game-makers-atomic-arcade/amp/ ](https://wccftech.com/hasbro-wizards-of-the-coast-reportedly-shut-down-g-i-joe-snake-eyes-game-makers-atomic-arcade/amp/) Also of note, Hasbro did not deny Atomic Arcade being shuttered.",
        "comments": [
            {
                "raw_content": "you mean the studio wizards of the coast owned, not \"Wizards Of The Coast being shuttered\" I was really confused first reading this",
                "author": "spnkr"
            },
            {
                "raw_content": "So I'm picturing a t-rated Ninja Gaiden for this game.",
                "author": "ToastyTylie"
            },
            {
                "raw_content": "Wait, what's this about wizards of the coast being shuttered because I don't see anything related to that in the article ?",
                "author": "Fun_Procedure946"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Atomic Arcade has been shut down",
        "score": 150,
        "text_content": "Hasbro and Wizards of the Coast have decided to close the studio down. They were working on a Snake Eyes game [https://www.linkedin.com/posts/dominicbraun\\_opentowork-activity-7429184370877345793-37wz?utm\\_source=share&utm\\_medium=member\\_desktop&rcm=ACoAAASmoLQBXuX-72SyZbQ-w4etfNOFXFiRNjU](https://www.linkedin.com/posts/dominicbraun_opentowork-activity-7429184370877345793-37wz?utm_source=share&utm_medium=member_desktop&rcm=ACoAAASmoLQBXuX-72SyZbQ-w4etfNOFXFiRNjU)",
        "comments": [
            {
                "raw_content": "GI Joe fans really can't have anything nice in the gaming sphere can they?",
                "author": "ElectricBeatz"
            },
            {
                "raw_content": "Have they actually published anything? I can't find much beyond their website.",
                "author": "Zxcc24"
            },
            {
                "raw_content": "Yeah not shocked. Hasbro after COVID boom invested heavily into gaming and now like the rest of the game industry the recoil from the boom is layoffs and shut downs. We shall see how Exodus and Warlock do and if Skelton Key ever reveals their game or gets shut down beforehand. Everyone at those studios should be scared tho I imagine",
                "author": "SpaceGooV"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Copies of Resident Evil Requiem are being sent out to distributors",
        "score": 303,
        "text_content": "via PLAION Spain (formerly Koch Media): [ https://xcancel.com/PLAION\\_ES/status/2023363114104729997#m ](https://xcancel.com/PLAION_ES/status/2023363114104729997#m) Will update as more news comes out. Some copies may or may not end up in the hands of those who seek to spoil the story in the coming days, so you should prooobably get to muting as many terms as you possibly can on Twitter.",
        "comments": [
            {
                "raw_content": "Get ready for leaks to be played by the worst gamers you've ever seen lol",
                "author": "YukYukas"
            },
            {
                "raw_content": "Typically physical copies get distributed one week before release",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "Hopefully this means my Amazon steelbook edition won’t actually deliver March 23rd…..",
                "author": "NigerianConnection"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "All upcoming rumored Capcom game announcements",
        "score": 435,
        "text_content": "# Resident Evil franchise: \\- [***Resident Evil CODE: Veronica remake***](https://xcancel.com/natethehate2/status/2014767509803512263?s=46) ***(early 2027 release)*** ***-*** [***Resident Evil Requiem DLC***](https://xcancel.com/AestheticGamer1/status/2014825268079440276) ***(2026)*** ***-*** [***Resident Evil 2/3/4 remakes Switch 2 native ports***](https://www.youtube.com/watch?v=JwMQiG9bc4c) ***(2026)*** ***-*** [***Resident Evil 0 remake***](https://mp1st.com/news/report-resident-evil-0-remake-in-development-new-casting-and-plot-details-unearthed) ***(2028)*** ***-*** [***Resident Evil 10***](https://xcancel.com/aestheticgamer1/status/2022244942085832763?s=46) ***(2029)*** ***Uncertain:*** ***-*** [***Resident Evil Outbreak***](https://xcancel.com/aestheticgamer1/status/1437497288184659969?s=46) ***(??)*** ***-*** [***Biohazard HUNK***](https://xcancel.com/aestheticgamer1/status/2014825996948799597?s=46) ***(??)*** ***-*** [***Resident Evil Revelations 3***](https://xcancel.com/aestheticgamer1/status/2014825996948799597?s=46) ***(??)*** ***-*** [***Resident Evil 1 ReRemake***](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1cqllq0/danielrpk_a_resident_evil_1_remake_is_in/) ***(??)*** # Monster Hunter franchise: \\- [***Monster Hunter Wilds expansion***](https://www.reddit.com/r/MonsterHunter/comments/1r0mk5i/monster_hunter_wilds_large_scale_expansion/) ***(??)*** ***-*** [***Monster Hunter Wilds Switch 2 port***](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1q0zjcp/more_datamined_info_regarding_the_switch_2/) ***(??)*** # Dead Rising franchise: \\- [***A new Dead Rising game with Frank West***](https://mp1st.com/news/new-dead-rising-game-development-set-in-hollywood) ***(??)*** # Ace Attorney franchise \\- [***Ace Attorney 7***](https://www.reddit.com/r/GamingLeaksAndRumours/comments/jvg1ci/capcom_leaks_ace_attorney_7_in_development/) ***(??)***",
        "comments": [
            {
                "raw_content": "I remember when there was that huge leak from Capcom themselves like six years ago or something. It had Ace Attorney 7 in it. I'm still waiting...",
                "author": "Majin-Tenshinhan"
            },
            {
                "raw_content": "How the fuck there is not a SINGLE hint of a new DMC game? Capcom what are we doing dawg?",
                "author": "Lz537"
            },
            {
                "raw_content": "Capcom will do anything other than remaking the Dino Crisis games",
                "author": "faizetto"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel presentation shows “Xe Next” following Xe3P in data center GPU roadmap",
        "score": 43,
        "text_content": "So Intel Xe line is to live and prosper ?\\ And MLID has been wrong about Intel fully embracing nVidia for dGPUs ?\\ If so, great...",
        "comments": [
            {
                "raw_content": "I really hope MILD is wrong because I love my Intel B50. I hope they keep making cheap SR-IOV GPUs.",
                "author": "reddit_hater"
            },
            {
                "raw_content": "With this kind of leaks one need to understand, that they (when true) reflect some point in time, often not the most recent. And things in business are dynamic. Some more than other. For example your product may be late to the market and underwhealming at beginnig and you may consider to exit that market. And then suddenly that market booms due to some external reason and suddenly demand is so huge that even worse product finds customers due to limited supply of anything else. And now you not only want to stay in the market but invest to close the gap to competition. Two leaks from this company from before and after the boom could be in a stark contrast and both true.",
                "author": "ictu"
            },
            {
                "raw_content": "AI - optimized means it will receive good bandwidth on gpu so textures will be fetched fast from memory for a video game. Just a guess. It could be more performance per core than RTX4000 series.",
                "author": "tugrul_ddr"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Radeon RX 9070 XT Taichi White review details ASRock's first card with built-in screen",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man I don't need damn screen on my GPU, I just want some reasonable prices. Seems like they're putting screens on everything from GPUs, CPU coolers, RAM, cases, even power supplies.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "I really just want a GPU at MSRP. Maybe a GPU with $50-100 in upgraded parts, memory, styling or RGB at most. Anything beyond that is pointless.",
                "author": "Better-Snow-7191"
            },
            {
                "raw_content": "Just give us some msrp cards already!",
                "author": "Grat_Master"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Rental Prices in Miami are out of control?",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why does UK property seem so difficult to act on in international financial disputes?",
        "score": 5,
        "text_content": "I’ve been noticing something in various international fraud and insolvency cases: once disputed money is converted into UK property, things appear to slow down significantly. Foreign courts may appoint trustees, issue rulings, or begin recovery processes but when land in England is involved, separate and lengthy domestic proceedings are often required. In the meantime, properties can remain tied up for years. I’m not focusing on one specific case (though names like Georgy Bedzhamov often come up in reporting), but more on the structural question: Is this a deliberate feature of English property law to protect sovereignty and legal certainty? Or is it an outdated framework that hasn’t caught up with modern cross-border finance? Interested to hear different perspectives especially from people who follow legal or financial policy more closely.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Reminder",
        "score": 1483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/cm52i38npxjg1.jpeg?width=640&format=pjpg&auto=webp&s=fce47e20d7c69199063a4bf220b56a247545995d",
                "author": "ToughAd5010"
            },
            {
                "raw_content": "When human like robots come out, if they're not offline, I don't want one",
                "author": "fyn_world"
            },
            {
                "raw_content": "Vram is pricey. Whether they are AI or real, hoes are expensive",
                "author": "Conscious-Designer-2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Quietly Deletes Core Safety and Profit Pledges",
        "score": 288,
        "text_content": "OpenAI Quietly Removes “safely” and “no financial motive” from official mission Old IRS 990: “build AI that safely benefits humanity, unconstrained by need to generate financial return” New IRS 990: “ensure AGI benefits all of humanity”",
        "comments": [
            {
                "raw_content": "Well, they are not a non profit anymore, so the removal of non profit is a given. The removal of the safety clause is head-scratching, concerning.",
                "author": "Freed4ever"
            },
            {
                "raw_content": "It’s like when google removed “don’t be evil” from their charter",
                "author": "elevenatexi"
            },
            {
                "raw_content": "https://preview.redd.it/6q5verr1azjg1.jpeg?width=960&format=pjpg&auto=webp&s=d9bdefd5203e11d22805ef5af3222c9d3e302231",
                "author": "Spiritual_Spell_9469"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic’s Moral Stand: Pentagon warns Anthropic will “Pay a Price” as feud escalates",
        "score": 1006,
        "text_content": "Axios frames this as an ethics clash, with Anthropic reportedly trying to block uses like large scale surveillance and fully autonomous weapons while the Pentagon pushes for access for “all lawful purposes.” If procurement can punish a lab for insisting on guardrails by calling it a “supply chain risk,” that creates a race to the bottom on safety norms. Where should the ethical line be drawn, and who should get to draw it? Source: https://www.axios.com/2026/02/16/anthropic-defense-department-relationship-hegseth",
        "comments": [
            {
                "raw_content": "Something something free market..",
                "author": "loversama"
            },
            {
                "raw_content": "Anthropic have put two limits: no spying on American citizens and no fully autonomous weaponry 100% DoD is surveilling Americans. No way this response make sense to the fully autonomous weaponry-systems",
                "author": "rallar8"
            },
            {
                "raw_content": "Biggest endorsement of Anthropic so far",
                "author": "Embarrassed-Nose2526"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Well I think we might get Live Action Clone Wars someday, lol",
        "score": 562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the sand one made me lol",
                "author": "timshel42"
            },
            {
                "raw_content": "Incoming prequel memes raid.",
                "author": "STFU_ELON"
            },
            {
                "raw_content": "So, we can probably remake the sequel trilogy in 5 years, right? That would bring balance to the force once and for all.",
                "author": "mangelvil"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI progress has slowed... /s",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/lu0xkq5dyujg1.png?width=1648&format=png&auto=webp&s=3869273df381ca23785edc3c0adedcf97e02bc38 what is this?",
                "author": "Ok-Tradition-82"
            },
            {
                "raw_content": "The next problem to solve is allowing you to select one element of a scene to change without affecting anything else. Currently if you want to change something small, there is a huge risk it will change multiple elements. Once this is solved we will actually start to see AI like this used heavily in film production.",
                "author": "BurtingOff"
            },
            {
                "raw_content": "Wait until they get inference to be realtime. Then generate 3d streaming scenes. You consume that through vr googles. Ai powered metaverse.",
                "author": "the_real_seldom_seen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree Spring Festival Gala Robots —a Full Release of Additional Details",
        "score": 357,
        "text_content": "[https://www.youtube.com/watch?v=Ykiuz1ZdGBc](https://www.youtube.com/watch?v=Ykiuz1ZdGBc)",
        "comments": [
            {
                "raw_content": "Soon we will be watching the Canadian Robotics curling team tell the Swedish Robotics curling team they know Roombas with better line control.",
                "author": "G48ST4R"
            },
            {
                "raw_content": "https://i.redd.it/zea7zdqxcwjg1.gif jfc",
                "author": "Recoil42"
            },
            {
                "raw_content": "We're so fucked.",
                "author": "Apprehensive_Tear611"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Allonic, Hungarian company is building biomimetic humanoid robots by weaving high-strengh fiber threads around a minimal skeleton, the way human body connective issue wraps around the bone, to produce complex dexterous bodies, strong yet soft, cheaper",
        "score": 435,
        "text_content": "",
        "comments": [
            {
                "raw_content": "straight up copied from westworld",
                "author": "Gods_ShadowMTG"
            },
            {
                "raw_content": "Best of luck. Proper hand dexterity is what’s missing the most at the moment, so it’s great to see efforts and ideas there.",
                "author": "Redducer"
            },
            {
                "raw_content": "this is honestly genius, this one, clone robotics are the one's to watch for when creating full fledged synthetic humanoids and androids, not optimus, unitree, figure etc..",
                "author": "Beautiful_Claim4911"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ByteDance To Halt Seedance 2.0’s AI Rip-Offs After Legal Threats From Disney & Paramount",
        "score": 257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the ship has already sailed, and it's like Pony Express riders trying to stop the train.",
                "author": "lolwut778"
            },
            {
                "raw_content": "It's inevitable that we are going to completely be able to reproduce any IP soon. OpenAI is trying hard with their deal with Disney to delay the inevitable with their (I assume) future SORA 3. But in a matter of years, this stuff will be so powerful it will be impossible to control, especially as EVENTUALLY something even more powerful than this will go open source.",
                "author": "acbagel"
            },
            {
                "raw_content": "Remember when all the big music companies forced Napster to shut down and that stopped music piracy completely? Yeah, me neither. I've seen this movie play out before. It's not going to end the way Disney and Paramount think.",
                "author": "JackFisherBooks"
            }
        ],
        "subreddit": "singularity"
    }
]