[
    {
        "post_name": "Rahmanullah Lakanwal, the Afghan terrorist who shot National Guardsmen, worked with the CIA as a member of a partner force in Kandahar, Afghanistan, per CIA Director Ratcliffe",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump needs to completely eradicate the CIA.",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "[He spent his entire life working for US NGOs...](https://x.com/DataRepublican/status/1993878815349854361)",
                "author": "sorrytodisagree"
            },
            {
                "raw_content": "E-5 eh? Just handing out Sergeant to anyone now eh",
                "author": "RealTXPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden weaponized HUD as part of Operation Allies Welcome, letting a countless number of individuals into our country unchecked. We saw the fateful result today. HUD is investigating. More updates to come.",
        "score": 367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What annoys me is I know a guy who is an Afghan national who came here in 2024 as part of the assistance for people who helped America. Bro is just a geologist who worked with the USGS in Afghanistan. He didn't get any of this stuff and struggles to this day trying to get his wife and kids out of the country. Dude just doesn't want to be shot by the Taliban and they know who he is because he regularly did field work in the countryside encountering local villages. It's all been intentionally tainted to bring over attack vectors and damn anyone else.",
                "author": "_Sully_"
            },
            {
                "raw_content": "Every time we get involved in a foreign war, there is a humanitarian crisis that somehow we are obligated to fix by allowing refugees in.",
                "author": "hey_spike"
            },
            {
                "raw_content": "The fact that we had a KSF/QSF guy brought into the US (and let’s not kid ourselves, he’s not the only one) is a massive failure at every level of oversight. KSF were already extremely questionable. You didn’t turn your back on them unless you were tired of owning all of your organs. But QSF? That was the even darker strain. The ones you called when you wanted something removed rather than reported. I didn’t work *directly* with them but every so often we would encounter them and it felt very uncomfortable. Basically that guy at the party or bar who you see and immediately something tells you that you need to get out of there. These guys should have never made it through the pipeline into American streets. Not without deep background vetting, not without long-term supervision, and absolutely not with a free civilian pass. We knew what they were. We knew what they were built for. You don’t take a strike asset bred for deniable violence and turn it loose in a country that assumes everyone plays by the same rulebook. This wasn’t compassion. This wasn’t policy. This was negligence wearing paperwork. Frankly this was by design. You don’t import wolves and then look surprised when something gets ripped open.",
                "author": "The_Bloofy_Bullshark"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mainstream Media : Almost every Afghan refugee will turn out to be so much better an American than Charlie Kirk.",
        "score": 264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill Kristol is a small, craven, evil little goblin.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "And Charlie who was a young loving man is now dead, and Bill Kristol, the old hateful fool, keeps pushing his commie traitorous bullshit until he dies, the left wins, the right loses.",
                "author": "dankai420"
            },
            {
                "raw_content": "\"Project for a New American Century.\" Bill Kristol is a NeoCon traitor and an enemy to humanity.",
                "author": "stevethefish76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Effective immediately, processing of all immigration requests relating to Afghan nationals is stopped indefinitely pending further review of security and vetting protocols.",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And just why the fuck were we processing their applications in the first place?",
                "author": "DickTick"
            },
            {
                "raw_content": "A good start. Now do the repatriations at record speed…not just for Afghanistan, but for all countries.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "This is putting a bandaid on a scabbed up stump that used to be a hand",
                "author": "Dangerous"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk: \"Falsely labeling non-violent people as “fascist” or “Nazi” should be treated as incitement to murder.\" The left labeled Charlie Kirk fascist, and he got shot. The left labeled the National Guard deployments fascist. It wasn’t hard to guess what would come next.",
        "score": 1471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alex Jones made one comment about Robbie Parker laughing at a funeral and was sued for a billion dollars.",
                "author": "utfanx2"
            },
            {
                "raw_content": "The right is too afraid of being labeled a fascist or Nazi by taking action against communists trying to incite people by claiming the right are fascists and Nazis. The WWII propaganda is etched into old people's minds so hard, they glitch out.",
                "author": "terribletwos"
            },
            {
                "raw_content": "Funnily enough, the Babylon Bee (Joel Berry) were just calling many of us nazis last month",
                "author": "Thatunknownguy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Footage is resurfaced of JD VANCE going off on politicians who \"care more about bringing 30,000 UNVETTED Afghan refugees into our country than getting our own people out safely\" after the withdrawal",
        "score": 1104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's start shipping prisoners to Uganda. That's what all those 3rd worlder's did to us. Migrate out of the US to your final destination prisoners and deport the illegals.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Ben Sasse was the worst rino faggot out there",
                "author": "Albo22"
            },
            {
                "raw_content": "Ben Sasse - total deep state, anti-maga, rino sob, phony. Good riddance.",
                "author": "freedom-thinker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yep",
        "score": 930,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The death penalty has the lowest recidivism rate.",
                "author": "least_counties_ever"
            },
            {
                "raw_content": "Now add two more rows of photos with the Judges and the Prosecutors photo and names. Make them all famous together",
                "author": "yukondave"
            },
            {
                "raw_content": "Something's gonna happen until we March on Washington again.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DNC INSURGENCY? Don Lemon recently called on his fans to go & take up arms against federal troops",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "honestly based - we shouldn't trust our government",
                "author": "throwawayStudent"
            },
            {
                "raw_content": "The gay brown communist revolution won’t be glorious, but it is going to be funny as fuck in the history books. Imagine in 300 years reading about the gay brown rebellion and seeing stats posted equivalent to Operation Eland. Trans brigade will suffer 41% losses at first contact.",
                "author": "Viewer01"
            },
            {
                "raw_content": "That fucking video was the go signal. Now that it's a family holiday weekend, they are putting full force behind the chaos. Psychopaths hate free people because free people are too hard to control. They are trying their goddamndest to start a full-blown civil war so that they and their psychopathic globalist masters can finally get rid of this free country and put things back to normal: A board of ruling elites at the very top with the rest of us being only serfs and slaves to serve them. You know, the way it's been in every other country since civilization began on Earth. THAT is what they want. THAT is the goal of all of this. Buckle up.",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have literally never seen a post age WORSE than this one from Bill Kristol in 2021",
        "score": 734,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Early life section strikes again",
                "author": "RYTHMICRIOT"
            },
            {
                "raw_content": "In Bill Kristol's sick and twisted little mind, he was proven correct.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Indeed. Kristol is an EMBARRASSMENT.",
                "author": "NecturusMaculosus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2021. Mayorkas is asked if the Afghans who were flown to America during the botched withdrawal were vetted. Mayorkas claims repeatedly for almost three minutes that all the Afghans were vetted before being brought to America.",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gee he lied. Graham knew he was lying. We knew he was lying. Everyone understood it was a lie. And yet this faggot is still running around free as a bird. I expect the republicans will draw themselves up on their hind legs and tell us about the sternly written letter they have composed to address this crime.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Why does reminding him he’s under oath excuse him from lying three times under oath?",
                "author": "HunterBidensPC"
            },
            {
                "raw_content": "Spoiler alert: They were not vetted. None of them. Zero. Nada. none.",
                "author": "HeavyMetalPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Soros mouth piece Al Sharpton blames PRESIDENT TRUMP for National Guardsmen being SHOT in DC",
        "score": 1051,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, I didn't know he was still living! Never watched MSNBC.",
                "author": "Amway"
            },
            {
                "raw_content": "\"Federal troops are fascists.\" \"Federal troops are fascists.\" \"Federal troops are fascists!\" \"You should kill federal troops.\" \"You should KILL federal troops.\" \"YOU should KILL federal troops.\" \"YOU SHOULD KILL FEDERAL TROOPS!!\" \"Trump is responsible for federal troops being shot.\"",
                "author": "Keiichi81"
            },
            {
                "raw_content": "Has this fucker paid his taxes yet?",
                "author": "GorillaTactics"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The suspect who is accused of shooting two National Guardsmen has been identified as an Afghan national, according to NBC News.",
        "score": 1146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deport kebab.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Fuck their feelings. Deport them all.",
                "author": "Sivispacem"
            },
            {
                "raw_content": "Execute him publicly tonight on live television!!!!",
                "author": "TennesseeScorpio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump and Pete Hegseth SURGE ANOTHER 500 TROOPS into Washington DC as a result of the shooting, GOOD! Lock it DOWN.",
        "score": 1506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's EXACTLY what they needed to do. They already have the deadly force briefing that allows them to shoot to kill if they face an imminent threat. This is extra security and a show a force.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Maybe the dumbasses will authorize lethal force now.",
                "author": "Pied-Trumper"
            },
            {
                "raw_content": "Gotta love the foreigner interrupting our Secretary of War when he's talking about our soldiers.",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I don't want to say outright CIVIL WAR when there is a good chance foreign actors are doing this too. But WTAF! This is overtly illegal!\"",
        "score": 1357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it will get worse because no one is doing anything about the treason talk...",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "The left wants more violence, there's no denying it",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Pam Bondi is ready to say on Fox \"Can you believe what they are saying? We need to turn down the rhetoric.\"",
                "author": "Stolen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MPD Chief says the two National Guards are in critical condition at a local hospital, there are no other suspects, \"it appears... to be a lone gunman that raised a firearm and ambushed these members of the National Guard.\"",
        "score": 976,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's always a \"lone gunman\" isn't it? I call BS!",
                "author": "Thatunknownguy"
            },
            {
                "raw_content": "Who wants to bet... less than 48 hours ago, his entire online presence was erased.",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "A lone gunman that received years of fake news, hate news, and deceptive encouragement.",
                "author": "Mega_MAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy Thanksgiving 2025 🦃 - Talking turkey with the Democrats.",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only part Ben got wrong was Bernie saying \"I bought your book\" - that commie millionaire would demand a free copy.",
                "author": "HeavyMetalPatriot"
            },
            {
                "raw_content": "Aah Ben Garrison. Subtle as a sledgehammer. Happy thanksgiving to all!",
                "author": "BillMitchellsFinger"
            },
            {
                "raw_content": "Treason's greetings",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She is NOT wrong. Lara Logan: Republicans have had control of the House & the Senate for almost a year and they have pissed on the American people who put them there.",
        "score": 518,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just like last time.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "That’s because there’s only the illusion of choice. It’s all theatrics. Both parties are in bed together and they both hate MAGA.",
                "author": "Bruno"
            },
            {
                "raw_content": "And not one arrest...",
                "author": "JtBlaze"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ABC appears to justify the shooting of national guardsmen because of Trump’s immigration policies Evil scum",
        "score": 1020,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s not justifying.",
                "author": "Ostia"
            },
            {
                "raw_content": "Um. . . not seeing how that's justifying it. They are stating what's going on.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "MSNBC did absolutely attempt to justify it. This one not so much.",
                "author": "_Sully_"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING UPDATE: The Governor of West Virginia now says he’s received “conflicting reports” about the condition of the National Guard troops who he initially said had passed! Pray for a miracle 🙏🏻",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They did the same thing with charlie.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Sadly, they’ve probably passed and the conflicting part is whether the family has been notified yet.",
                "author": "Greenhills"
            },
            {
                "raw_content": "A politician checking his facts before running his mouth would be a fucking miracle.",
                "author": "sanitaryshaver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tina Peters backed up the voter data before the machines were “updated.” When she compared the files later, they had been altered. That’s not a conspiracy theory. That’s evidence. For that — a Democrat judge sentenced her to 9 years in prison.",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like conspiracy to commit election fraud ... on the part of the 'judge'. Kinda makes one wonder who bribed him ......",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Arrest the judge (sic) ffs.",
                "author": "Truth_Will_Prevail_2"
            },
            {
                "raw_content": "The judge ENGAGED IN SEDITION!",
                "author": "Trooph-Hurts"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sony LYT-901 1/1.12-inch 200MP camera sensor launched for next-gen premium phones",
        "score": 27,
        "text_content": "Sony has launched the LYT-901, its first 200MP mobile camera sensor targeting 2026 flagship smartphones, featuring a 1/1.12-inch imaging surface with native 0.7μm pixels that support 2x2 (50MP) and 4x4 (12.5MP) pixel binning modes. The sensor integrates on-chip AI processing to handle the high data throughput and employs a hybrid HDR architecture combining Hybrid Frame-HDR with Dual Conversion Gain HDR to achieve >100dB dynamic range (~17 stops) while minimizing motion artifacts. Key capabilities include in-sensor zoom (ISZ) enabling 4x “high quality” optical magnification with 4K/30fps video recording at full zoom, and all-pixel phase-detection autofocus across the entire sensor area. The LYT-901 is expected to debut in devices like the OPPO Find X9 Ultra and Vivo X300 Ultra, competing directly with Samsung’s 200MP sensors. |Model |Sensor Size|Pixel Size|Resolution|4K fps|HDR Tech |UHCG|2-Layer| |-----------|-----------|----------|----------|------|------------|----|-------| |**LYT-901**|1/1.12” |0.7μm |200MP |120 |HF-HDR + DCG|No |No | |LYT-900 |1/0.98” |1.6μm |50MP |120 |DCG |No |No | |LYT-828 |1/1.28” |1.22μm |50MP |120 |HF-HDR + DCG|Yes |No | |LYT-818 |1/1.28” |1.22μm |50MP |120 |DCG |Yes |No | |LYT-T808 |1/1.43” |1.12μm |52MP |120 |DCG |No |Yes | |LYT-808 |1/1.4” |1.12μm |50MP |60 |DCG |No |No | |LYT-700 |1/1.56” |1.0μm |50MP |60 |DAG |No |No | *All models feature All-pixel AF and LBMF (Less Blanking Multi Frame). HF-HDR = Hybrid Frame-HDR, DCG = Dual Conversion Gain, DAG = Dual Analog Gain, UHCG = Ultra High Conversion Gain*",
        "comments": [
            {
                "raw_content": "cant wait for 2 companies to use it, like the LYT-900",
                "author": "OafishWither66"
            },
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Oh god please tell me it isn't a 12mp hexadeca-bayer abomination. Is it really so hard to make a native 50mp sensor?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra 9 285K \"Arrow Lake\" Linux Performance Up ~9% One Year Later At ~85% Power Use",
        "score": 187,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean I have been updating my BIOS monthly since, as they would throw new microcode revisions left and right. Performance is definitely better compared to launch, in any of my workloads. Gaming saw the best uplifts, but what really has improved 2 months after release already, is consistency. CPU runs cool, sips power in idle or light gaming and is rock solid. So yeah, not surprised, kudos to Intel. The new arch was a big step in the right direction.",
                "author": "realPoxu"
            },
            {
                "raw_content": "I don't understand why Phoronix doesn't lock application versions: What's the point of a JavaScript browser benchmark, if ARL launch used Firefox 126, but tests today use Firefox 145? It'd take 2 minutes to install Firefox 126: Firefox [hosts them directly.](https://support.mozilla.org/en-US/kb/install-older-version-firefox) The disclaimer \"*Part of it is due to Firefox upstream improvements*\" is little comfort because it taints all the browser tests. I'm sure Intel **has** made improvements, but this is just bad benchmarking hygiene, Phoronix.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "That’ll be lovely for the 2 people who use Linux with a 285k",
                "author": "Culbrelai"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Arrow Lake Refresh CPUs arrive with native DDR5-7200 CUDIMM support — 12.5% higher speeds than initial Arrow Lake chips",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But they already \"officially\" support 8000 since 200s boost? You can easily hit 8200 with basically any (used to be cheap) M die with most mid range mobo.",
                "author": "jtj5002"
            },
            {
                "raw_content": "Probably costs as much as the CPU and motherboard combined when it launches",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "It's just Intel submitting the newest CPU for certification with a newer JEDEC spec, the memory controller has likely not changed much if at all.",
                "author": "Nicholas-Steel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HP to Raise Prices, Lower Configurations Due to Surging Memory Costs",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's funny because I'm in IT at a fortune 500 company and both HP and Dell assured us our previously quoted prices are locked in. It's gonna be a shit show if they retract those claims lol.",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": ">Other smaller PC makers have also been warning about price hikes. CyberPowerPC will do so on Dec. 7. Maingear is also advising consumers to buy PCs and components now, before a wave of price increases is expected to arrive after the Black Friday sales. ... ... The CEO of Phison, a major provider of controllers for SSDs, also warned earlier this month that electronics makers could cut the storage capacity of their products by as much as 50% in response to the shortage. Meanwhile, rival PC maker Lenovo has been stockpiling enough memory that it should have enough supplies to last through 2026.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "People who continue to purchase HP and / or Dell products deserve this.",
                "author": "Alternative_Ad_620"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC confirms September power outage at Fab 21 in Arizona — loss of wafers and financial impact unclear",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello imaginary_num6er! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix turns HBM chips into snack chips in playful tie-up with Seven-Eleven",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can't wrap my brain around this.",
                "author": "zakats"
            },
            {
                "raw_content": "I can pay dollars for a bag which is many time more than normal snack chips if HBM chip really has more than 10 die(?)s stacked with Through Flour Via. Curious.",
                "author": "zhunnni99"
            },
            {
                "raw_content": "Deserves to be on r/wallstreetbets",
                "author": "3VRMS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel denies TSMC allegations that executive leaked trade secrets",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Level1Techs] Attempting to Troubleshoot the ASRock Motherboards of Death",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The tl;dw is Wendell has been trying for months to induce a failure that kills the CPU in ASRock's 800 series motherboard... unsuccessfully. Not much new info to go on, but it's still interesting to have Wendell go through his testing of this.",
                "author": "Berengal"
            },
            {
                "raw_content": "This could be designated as one of the biggest mysteries in 2025 hardware.",
                "author": "Goddamn7788"
            },
            {
                "raw_content": "Honestly amazing the amount of effort put into this by the community. L1T, GN, Tech Yes City and so many more have been investigating this for such a long time. Lots of work, GN has explicitly stated just how much of a money burner this is because there's just...nothing Really hope this can get permanently solved because those asrock boards on paper have such good value. Last gen motherboards are also great given AMD's socket support, so issue free motherboards of this gen will be a delight for next gen processors if you need to save a buck. Of course, given there's so little change with this gen's AM5 chipset vs last gen's, might as well jump 2 generations back. Thanks AMD for giving us options, especially when your chips are getting fried.",
                "author": "3VRMS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Global DRAM Revenue Jumps 30.9% in 3Q25, Micron’s Market Share Climbs by 3.7 Percentage Points, Says TrendForce",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep, no PC upgrades for me until the AI bubble pops and parts prices start making sense again. When 32GB of RAM can cost more than a good GPU these days? It's gone topsy turvy.",
                "author": "shadowtheimpure"
            },
            {
                "raw_content": "When Apples RAM upgrade options seems reasonable then you know the economic is fucked up",
                "author": "SelectTotal6609"
            },
            {
                "raw_content": ">Looking ahead to Q4 2025, DRAM suppliers’ inventories are almost depleted, and growth in bit shipments will decrease substantially. Regarding pricing, CSPs continue to be relatively flexible with procurement costs, which causes other applications to also increase their prices to secure supply. Consequently, contract prices for both advanced and legacy nodes, as well as across all major applications, are anticipated to increase rapidly. **TrendForce predicts that conventional DRAM contract prices will rise by 45–50% QoQ, and total contract prices (including DRAM and HBM) will increase by 50–55%.**",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo has acquired Bandai Namco Studios Singapore, will be renamed Nintendo Studios Singapore",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, they acquired shares in the studio that was rumored to have worked on Metroid Prime 4 before development got cancelled and the project moved to Retro Studios? That's very interesting.",
                "author": "KingBroly"
            },
            {
                "raw_content": ">1. Purpose of Acquisition BNSS was established as one of Bandai Namco Group’s overseas bases and is a **development company with strong expertise in creating in-game art assets**. **It has contributed to the development of Nintendo titles, including the Splatoon series**, and has an ongoing business relationship with Nintendo. Considering this business record, Nintendo has made the decision to acquire shares in BNSS to strengthen the development structure of the Nintendo Group. Subject to the satisfaction of all relevant customary conditions for transactions of this nature, Nintendo plans to acquire 80% of BNSS shares on April 1, 2026. The remaining shares will be acquired after a certain period, once the subsidiary’s operations have stabilized. Had no idea they were involved on Splatoon assets.",
                "author": "SparklyPelican"
            },
            {
                "raw_content": "Honest question, what does this mean? Nintendo will be publishing Bandai Namco games in SEA region?",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Pro Controller, GameCube controller support added on Steam",
        "score": 844,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah I thought it was Bluetooth support, but USB is fine. Some people have already gotten the Switch 2 Pro Controller to work via USB over on Github, but nice to have Steam Input support at the least now.",
                "author": "L1ttleB1t"
            },
            {
                "raw_content": "LET'S GOOOOOOOOOOOOO!!!!! I have an 8BitDo for PC, but I prefer the switch 2 pro controller, I'm happy to see it finally has support!",
                "author": "SonimaxTheKing"
            },
            {
                "raw_content": "Do the tactile buttons on the back work as well??",
                "author": "Epic-will-power91"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is this a bug? Why is the game 100% off?",
        "score": 279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It shows like this for me because I own the Switch 2 version. So it lets me get the Switch 1 version free.",
                "author": "Kenny_Bi-God_Omega"
            },
            {
                "raw_content": "It usually means you bought another game and for whatever reason it entitles you to this one for free. For example if you bought the old Minecraft Nintendo Switch edition, you get a 100% discount on Minecraft bedrock edition.",
                "author": "Johntrampoline-"
            },
            {
                "raw_content": "Buy now, questions later..",
                "author": "Bluefeelings"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "According to Digital Foundry, the Tomb Raider Definitive Edition runs at 1080p on handheld and docked, taking no advantage of the extra power and showing how lazy this port is.",
        "score": 348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "okay for Switch 1 but lazy for switch 2",
                "author": "semitongue"
            },
            {
                "raw_content": "They clearly made the Switch 1 version and then bumped it up from there. So pretty much the laziest way of doing it.",
                "author": "SMC540"
            },
            {
                "raw_content": "ASSPYR to the rescue! Why even port an old game if you're not gonna give it your all?",
                "author": "LawfulnessPractical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Christmas Switch 2 Question from a Dad who doesn't want to mess up Christmas",
        "score": 104,
        "text_content": "Hello, apologies for the beginners question but both my kids want a Switch 2 for Christmas and I've acquired one but want to make sure I get things right. We have a Switch 1. As I understand it from reading the FAQ I can transfer everything from the Switch 1 to the Switch 2 which I plan to do before Christmas Day so everything's all set up for them to play MarioKart (and any other games I grab) when they open it up. That'll also give me a chance to get an SD card in the new console and make sure it's working etc. My question is whether by doing that transfer anything will change on the Switch 1? That is if I do the transfer now and they go to play Switch 1 before Christmas will anything give the game away that I've bought them a Switch 2, will games or profiles be missing etc.? Sorry again for the niche question but I don't want to ruin the surprise and also don't want to spend a load of time of Christmas Day setting up a new console while the kids bounce around desperate to play on it. I'm old enough that when I got a console for Christmas you just plugged it in and off you went but I know that's not the World we live in now!",
        "comments": [
            {
                "raw_content": "If you transfer games to the switch 2 they will notice the games are gone from the switch 1. I would just wait to do the transfer on Christmas.",
                "author": "Big_Breath_2561"
            },
            {
                "raw_content": "I agree with the other commenter. Give the Switch 2 in-box. Moving the account and game data over will be a mild inconvenience, but also part of the memory of setting it up for the first time.",
                "author": "bijhan"
            },
            {
                "raw_content": "Don't do it. Kids love opening the box and setting up on Christmas day. That's part of the fun!",
                "author": "Wipedout89"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hyrule Warriors: Age of Imprisonment Version 1.0.2 is now available (Free Content Update #1)",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The aside quests from the character select screen is a huge plus",
                "author": "nightshade-aurora"
            },
            {
                "raw_content": "Not bad at all",
                "author": "plee82"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends Z-A Version 1.0.3 is now available",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fixes Applied for the Following Confirmed Issue: * Players were unable to claim the Mega Stone reward in Ranked Battles Season 2, even after reaching the rank required to receive it. For Players Who Were Unable to Receive the Season 2 Mega Stone Reward: * Players affected by this issue will be able to claim the rewards by accessing the Ranked Battle screen after the update is released.",
                "author": "Amiibofan101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo will have a massive stand at Milan Games Week, 1000 square meters with 110 demo units with 20 different games to try including Elden Ring, Final Fantasy VII Remake, Resident Evil Requiem, Monster Hunter Stories 3 and Metroid Prime 4 Beyond",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo PR lists the following games: * Metroid Prime 4 Beyond * Resident Evil Requiem * Monster Hunter Stories 3 Twisted Reflection * ELDEN RING Tarnished Edition * Mario Kart World * Donkey Kong Bananza * Hyrule Warriors Age of Imprisonment * Kirby Air Riders * Pokémon Legends Z-A * Super Mario Party Jamboree * Nintendo Game Cube - Nintendo Classics * Hollow Knight Silksong * Hades II * EA FC 26 * Dragon Ball Sparking! Zero * FINAL FANTASY VII REMAKE INTEGRADE * Hogwarts Legacy * GUILTY GEAR * Cyberpunk 2077: Ultimate Edition * Little Nightmares III",
                "author": "Joseki100"
            },
            {
                "raw_content": "Glad we’re gonna see Elden Ring again! Here’s hoping it’s far better than it was at the last shows it was at, it’s one of my most anticipated ports currently",
                "author": "projected_cornbread"
            },
            {
                "raw_content": "Elden Ring! Well I'm hoping that it runs good now, and maybe it'll come out real early in 2026? I just want the lil dlc, man...",
                "author": "PieceAfraid3755"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Forza Horizon 2 Leaked Dev Build",
        "score": 456,
        "text_content": "[https://youtu.be/jBiwp-dvj8Q](https://youtu.be/jBiwp-dvj8Q)",
        "comments": [
            {
                "raw_content": "https://hiddenpalace.org/Forza_Horizon_2_(May_4,_2014_Prototype) heres the build because this guy is gatekeeping it for some reason",
                "author": "junttiana"
            },
            {
                "raw_content": "THEY ARE MAKING A SECOND FORZA HORIZON???",
                "author": "sonicfonico"
            },
            {
                "raw_content": "Finally, can't wait to play new Forza Horizon 2",
                "author": "Martinez_Majkut"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Job Listings Suggest Beyond Good and Evil 2 Not Coming Anytime Soon Despite Years of Delays",
        "score": 311,
        "text_content": "Beyond Good And Evil 2 Was Revealed Back In 2008 — 17 Years Ago. After Countless Delays And Internal Reboots, New Job Listings Now Hint That The Game Is Still Far From Release. [Source](https://tech4gamers.com/beyond-good-and-evil-2-release/)",
        "comments": [
            {
                "raw_content": "Probably isn’t the case but I really feel like this game was either put on hold or straight up canned until relatively recently. It seems like there was nothing on development of this game till like a year or two ago, it was unusually quiet beforehand",
                "author": "Sprite_King"
            },
            {
                "raw_content": "The world ending is probably more likely than this game ever coming out",
                "author": "DrofwarcRetnuh"
            },
            {
                "raw_content": "If they just made a simple single player game that iterated on the first one then it would have come out by now.",
                "author": "Clopokus900"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty's Sledgehammer Games hiring people with \"(Nintendo) Switch experience\"",
        "score": 270,
        "text_content": "Source: [https://www.linkedin.com/jobs/view/4347622051/](https://www.linkedin.com/jobs/view/4347622051/) Call of Duty on Nintendo was one of Microsoft's promises if the deal went through.",
        "comments": [
            {
                "raw_content": "Cod finally coming back to Nintendo",
                "author": "Embarrassed-Part-890"
            },
            {
                "raw_content": "I mean I'm surprise the latest one didn't come to Switch 2 day one when it did came to PS4 and Xbox One.",
                "author": "Resident_Bluebird_77"
            },
            {
                "raw_content": "Throwing it back to the days when CoD games launched on DS, Wii and Wii U like it was no big deal.",
                "author": "chipmunk_supervisor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Is AMD Cheating in Call of Duty Benchmarks?",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Any headline that ends in a question mark can be answered by the word no\"",
                "author": "mrheosuper"
            },
            {
                "raw_content": "This simply sounds like a bug with shadow rendering in the game on the cards. No need to make everything a scandal.",
                "author": "HotConfusion1003"
            },
            {
                "raw_content": "IT'S NOT ABOUT REDSTONE! The video is about what seems to be a bug in shadow rendering on AMD cards in CoD7.",
                "author": "Outrageous-Log9238"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "More than half of Minneapolis/St. Paul homes decreased in value over past year",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quick, whoever wants to buy a house CHEAP pick up and move to Minneapolis/St.Paul!",
                "author": "Capital-Giraffe-4122"
            },
            {
                "raw_content": "Decreased 1% after going up 200% doesn’t count",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Subprime mortgages are on the rise again - Newsweek",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s different this time",
                "author": "No-Engineer-4692"
            },
            {
                "raw_content": "[Ah shit, here we go again...](https://i.imgur.com/e0EL2BI.png)",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "Per Equifax **The 6.5 percent share of mortgages going to subprime borrowers is only slightly higher than 6.3 percent at the same point last year, but marks the highest level in Equifax’s records going back to 2014.** Oh damn, subprime is surging from 6.3% to 6.5%",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Increase in delistings is propping up home prices, says Redfin CEO (CNBC Interview)",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mexican standoff for sellers and buyers. Next spring will be interesting.",
                "author": "regaphysics"
            },
            {
                "raw_content": "They fucking do anything to pad the fucking greed narrative I hate them",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Why do we listen this clown and their ongoing collusion with Zillow? It’s not like he’s a biased neutral source",
                "author": "pigindablanket"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Home-Purchase Applications Surge to Highest Since 2023",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol, mortgage bankers association trying create a narrative of FOMO.",
                "author": "Cyris28"
            },
            {
                "raw_content": "You can get 5.5 Mortgage rate right now. I cannot imagine what will happen when we have 4.5 or less.",
                "author": "MarsManMartian"
            },
            {
                "raw_content": "\"surged\" is a strong word for what's going on (ie. look at the graph in the article)",
                "author": "_jdd_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US economy at risk of wobble as lower-income consumers get squeezed",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This recession needs to just take a big dump or get off the pot. Been hearing this for years now. There are enough rich people to prop this economy up.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "The economy can hopefully pull a Weebles though, and not fall down.",
                "author": "GlobbityGlook"
            },
            {
                "raw_content": "Lower income people have always been squeezed...this is nothing new. Meanwhile, many retailers are reporting a strong start to the holiday shopping season, while air travel for this Thanksgiving weekend **will be record breaking.** And NO, you do not need to be rich to prop up this economy...as there are plenty of people spending money who are \"not\" rich.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Not sure what they are training it for.",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is some smooth movement.",
                "author": "Kracus"
            },
            {
                "raw_content": "I love unitree cuz their bots look like silly little gremlin guys",
                "author": "SarahSplatz"
            },
            {
                "raw_content": "war",
                "author": "TentacleHockey"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Scaling is over.",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meanwhile, Gary Marcus is out there, still bitter, ranting about how no one's giving him credit because he said it first. Grow up Gary!",
                "author": "dhara263"
            },
            {
                "raw_content": "Poor Yann, don't know why he got too many backlashes.",
                "author": "robberviet"
            },
            {
                "raw_content": "oh god i don't think i like this meme",
                "author": "pageofswrds"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jagged Frontier",
        "score": 236,
        "text_content": "[https://x.com/tomaspueyo/status/1993360931267473662?s=20](https://x.com/tomaspueyo/status/1993360931267473662?s=20)",
        "comments": [
            {
                "raw_content": "The point Ilya was making in his recent interview was the jaggedness wasn't gunna be 'solved' through current approaches. Hence his return to pure research. On the other hand, you have Sam saying current models wouldn't lead to AGI, but could lead to approaches that lead to AGI. And maybe those second-stage approaches could be AI-researchers. Or none of the above. The exciting part is that we'll know very few years from now.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "This is probably the best visualisation of the state in which AI is in currently that I have seen. System’s are abysmal at certain things while being almost superhuman with other things, but it’s just a matter of time where they can do the things they are currently terrible at",
                "author": "Birthday-Mediocre"
            },
            {
                "raw_content": "Bouba and kiki AI",
                "author": "raidedclusteranimd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic claims internal AI R&D evals are near saturation",
        "score": 148,
        "text_content": "This got buried in the hype of the past week and Opus 4.5 System Card. [More Info](https://x.com/eli_lifland/status/1993050674729488527) [System Card](https://assets.anthropic.com/m/64823ba7485345a7/Claude-Opus-4-5-System-Card.pdf) Continuing into the event horizon",
        "comments": [
            {
                "raw_content": "I dont understand. What does this mean?",
                "author": "willpoopanywhere"
            },
            {
                "raw_content": "lol. \"we didn't hit a wall, we just think it will be unsafe to make it smarter!\" coming to a lab near you.",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "I mean this same company claimed 90% of code would be written by AI by end of 2025 I take everything these companies say with a grain of salt \"Our model is so smart that it's dangerous\" is great for investor hype",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "MIT study finds AI can already replace 11.7% of U.S. workforce",
        "score": 540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we do a study about how many positions are just do-nothings who make charts and bullet lists that either no one will read or might make an executive happy for 5 minutes? I would love to see the overlap with this.",
                "author": "Piisthree"
            },
            {
                "raw_content": "11.7%? Gotta love studies based on very broad parameters that come up with such specific answers...",
                "author": "Das_Haggis"
            },
            {
                "raw_content": "I wonder how much, it any of this involves self driving vehicles as it might or might not be considered \"AI\". There's 3 to 4 million truckers in the USA, and overall there's 2-4% of the workforce that involves driving vehicles.",
                "author": "UnlikelyPotato"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why did 5.1 happen? Because OAI declared a code yellow in Oct due to user disengagement",
        "score": 295,
        "text_content": "In October, Mr. Turley, who runs ChatGPT, made an urgent announcement to all employees. He declared a “Code Orange.” OpenAI was facing “the greatest competitive pressure we’ve ever seen,” he wrote, according to four employees with access to OpenAI’s Slack. The new, safer version of the chatbot wasn’t connecting with users, he said.",
        "comments": [
            {
                "raw_content": "even if the companies claim they wont optimise for engagement. they are lying, they have to optimise for engagement just to survive.",
                "author": "New_World_2050"
            },
            {
                "raw_content": "Code Yellow or Code Orange? Which was it? WE MUST KNOW!!!",
                "author": "johnjmcmillion"
            },
            {
                "raw_content": "5.1 is the worst so far. its constantly saying \"I can't do X, it goes against my safety parameters.\" and then spirals out the rest of the time arguing about how it cant provide information that could be legal advice, medical advice, unethical, unlawful, too violent, violates a websites tos, etc etc. it won't even help you create agi if you ask it to. its ridiculously nerfed.",
                "author": "Primary_Ads"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "After Sharpa's 1,000 tactile sensors per fingertip, ultra dexterous hand - the company teases its humanoid robot as chef",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One thing that enough people aren't talking about is these robots need to demonstrate proper hand washing. That dude went from cleaning up garbage to turning off lights",
                "author": "ExtremeCenterism"
            },
            {
                "raw_content": "Ah yes, finally a robot with the correct movement to inflate the P. You can´t convince me they did that by accident...",
                "author": "lestat01"
            },
            {
                "raw_content": "One side effect of the emerging humanoid robot market will probably be much better prosthetic hands since it's now profitable to dump R&D money into robotic hand development.",
                "author": "bucky133"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "looks like videogen is about to be toppled again. Whisper Thunder 🤔?",
        "score": 99,
        "text_content": "[https://artificialanalysis.ai/video/leaderboard/text-to-video](https://artificialanalysis.ai/video/leaderboard/text-to-video)",
        "comments": [
            {
                "raw_content": "We need another good model with audio. Audio makes such a difference.",
                "author": "Utoko"
            },
            {
                "raw_content": "Sora 2 pro below veo 3? Weird",
                "author": "Tolopono"
            },
            {
                "raw_content": "got some of the whisper thunder gens in battle mode - really really solid. don’t expect perfect continuity but stylistically and prompt adherence are definitely SOTA looking",
                "author": "a300a300"
            }
        ],
        "subreddit": "singularity"
    }
]