[
    {
        "post_name": "Louisville, KY drops sanctuary city policies",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Today in history, a strongly worded letter worked...",
                "author": "airborne3502"
            },
            {
                "raw_content": "None of this will matter if we don't do a census. The next time democrats get a majority and/or the white house, they'll just open up the borders again.",
                "author": "tuaris"
            },
            {
                "raw_content": "Oh look a young Harry Potter banker",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom secured $500,000 private donation for anti-ICE, defund police group: report",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "subversive scumbag",
                "author": "perma-maga"
            },
            {
                "raw_content": "I cannot properly articulate the depth of my hatred for this greasy slithering cocksucker. I want his entire fucking bloodline eradicated from this mortal coil, then purged from all history. Damnatio memoriae. And I want him to watch it happen before his own slow, excruciating death, before his eternal castigation in hell. I’m born and raised in the once-great failed state of California. It used to be a great place to live, and I never used to think that I wouldn’t raise my kids there. But it’s ruined now, and will not be restored in my lifetime, bar divine intervention of almighty God Himself. We can never go back. Newsom and the rest of the Pelosi mafia burned my home and pissed on the ashes. They stole my children’s birthright and laughed in our faces as they did it. I *VIOLENTLY* hate them.",
                "author": "YT45"
            },
            {
                "raw_content": "It's time to send him to Tantalus V for processing and reeducation. Or gitmo!",
                "author": "MagaMom69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump admin to send deputy attorney general to meet with Ghislaine Maxwell",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOL they’re gonna kill her",
                "author": "McLemore800"
            },
            {
                "raw_content": "I'll take things that would never happen if Kamala got elected for 100, Alex",
                "author": "LibertyOrigins"
            },
            {
                "raw_content": "What are they gonna do? Scissor?",
                "author": "madeaprofilejustforu"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Non-citizen was just arrested for voting in 3 elections. But remember, it never happens.",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DEPORT!!!",
                "author": "Sheffield_1776"
            },
            {
                "raw_content": "There is a reason that the democrats are absolutely losing their minds over the ICE raids is because for each illegal get deported they lose votes and slaves.",
                "author": "DT170x"
            },
            {
                "raw_content": "The RATs don't need them to vote. They need a body so they can create a fake vote. The illegals also count in the census so they get more seats in the Legislatures.",
                "author": "SubmarineGuy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "INFOGRAPH ON HOW ACTIVIST OBONGO/PEDO JOE JUDGES ARE ISSUING BULLSHIT RULINGS. 94% of district court judges ruled AGAINST Trump. Of those that made it to SCOTUS, 93% were overturned and ruled in favor of Trump.",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And only one of these courts is in the Constitution.",
                "author": "cciv"
            },
            {
                "raw_content": "The DNC courts know that they don't actually have the law on their side, but the only thing they care about is slowing Trump down. He has a year and half to get as much done as possible, and these are stalling tactics.",
                "author": "Meddlesom"
            },
            {
                "raw_content": "That's absolutely ridiculous. Our system is completely broken.",
                "author": "BurtMcGirt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump and Crew are chucking big rocks through the Overton Window that has kept all of humanity imprisoned in idiocy for the past 10 years, and I KNOW you feel the momentum building at great speed too. There's giant boulders coming right around the corner!!!",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's not how that euphemism works.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "2 more weeks! People are getting arrested for sure. Justice will be served. Tick-tock deep state",
                "author": "LurkieLou"
            },
            {
                "raw_content": "Biden literally called and insinuated Trump committed sedition because of J 6th. I'm just pointing this out because I'm sick of Democrats claiming Trump broke the norms. The Obama and Biden administrations both weaponized the federal government to rob the Trump administration of executive power.",
                "author": "PeanutButterandJelly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We just completed a massive Deal with Japan, perhaps the largest Deal ever made.",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waifus and Gundams, let's gooo",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "# Japan please make retro skylines! Like american muscle cars!",
                "author": "CommieCrats"
            },
            {
                "raw_content": "I feel bad for Japan if they have to take our food. It's garbage and RFK Jr. is still working on making it MAHA approved. Japan has much better food.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Huge protests erupt in Kyiv against Ukrainian President Zelensky as he is a dictator and refuses to make a peace deal and end the war. Good for the Ukrainian people! Throw him out of office! And America must STOP funding and sending weapons!!!",
        "score": 1408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Correct Answer!",
                "author": "Ronaldus"
            },
            {
                "raw_content": "When was their last election anyway?",
                "author": "retry"
            },
            {
                "raw_content": "Throw that dictator out yourselves, and then we'll talk to the next guy.",
                "author": "Aquamine-Amarine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pam Bondi just FIRED the replacement for US Attorney Alina Habba after New Jersey liberal judges colluded to kick Habba out of her position. THAT'S how you fight against rogue judges.",
        "score": 1512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Way to kick Commie ass! We need more of this.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Pleasantly surprised, I didn't think she had warrior spirit.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Bondi has been racking up some wins lately. Color me pleasantly surprised. Let’s keep this momentum going!",
                "author": "Slugbert"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat lawyer Marc Elias LOSES bid to prevent WYOMING from requiring proof of US citizenship and state residency in order to register to vote.",
        "score": 1724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Marc Elias was the creator of the Russia Hoax. I think Marc should stop practicing lawfare and secure a good lawyer.",
                "author": "sperge420"
            },
            {
                "raw_content": "This fat fuck belongs in Gitmo with Barry as a neighbor.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "No doubt this sociopath was a client on Epstein Island !",
                "author": "MeMargie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Where’s the lie?",
        "score": 1227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BIG MIKE",
                "author": "BirthHole"
            },
            {
                "raw_content": "Massive faggots",
                "author": "magaspif"
            },
            {
                "raw_content": "Big Mike's hair is a freaking mess. Male pattern baldness is a dead giveaway.",
                "author": "CaptainWinston"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "30 Montreal goat f*ckers attempt a praying session in the street, Notre-Dame Basilica responds by letting her bells ring loud.",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You have to go back 😔",
                "author": "x79q3pb"
            },
            {
                "raw_content": "This is the way. Raise your ass to allah in your mosque.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Letting them in was not a mistake, it is intentional infestation of a country by those sworn to defend it. The politicians deserve to swing from a rope.",
                "author": "Tinyfingerbrains"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Court of Appeals just OVERTURNED a New Jersey Democrat sanctuary law that protected illegal aliens from being detained by the Trump administration NJ tried to stop government agencies and private contractors from working with ICE to take in illegals. LET'S GO.",
        "score": 1476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More good news! :)",
                "author": "seangalt"
            },
            {
                "raw_content": "### ⚖️ Court Ruling Against NJ Ban - A federal appeals court ruled that New Jersey cannot prohibit private companies from contracting with the federal government to detain immigrants. - The decision came from the U.S. 3rd Circuit Court of Appeals in a 2-1 vote, siding with CoreCivic, a private prison operator. ### 🧑‍⚖️ Federal Authority vs. State Law - Judge Stephanos Bibas argued that immigration detention is a **federal function**, and New Jersey's 2021 law interferes with this authority. - The ruling suggests allowing state bans like NJ’s would disrupt federal immigration enforcement nationwide.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I'm STILL not tired of winning Mr. President!",
                "author": "Shayhawk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If if if if if if if if if if",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Okie doke!](https://youtube.com/watch?v=poz6W0znOfk)",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "LOL 187 MF.",
                "author": "seangalt"
            },
            {
                "raw_content": "I know this is the Babylon Bee, but I thought this same thing the other day. Obama will say he can't be convicted of treason because he's not a US citizen.",
                "author": "mailinvoter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mark Halperin claimed Hakeem Jeffries (D-NY) “strongly believes” that if socialist Zohran Mamdani becomes the next mayor of New York City, Democrats cannot win back the House majority.",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He will become the face of the party. Everything he does and says will become a national issue. The dems don't have anyone else but the retard squad that is in front of the cameras.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "They’re gonna steal it.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "This is why I support Zorhan. He’s going to fuck the NYC Jew Democrats over in spectacular fashion in addition to splitting their party.",
                "author": "SurfandTurf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE WIN: Louisville, Kentucky DUMPS sanctuary city policies after the DOJ threatened them.",
        "score": 1661,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no prosecutions though? So they are free to try again later",
                "author": "donttreadonme1492"
            },
            {
                "raw_content": "So wait… a sternly worded letter actually worked for once?",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Strongly worded letter ftw! lol",
                "author": "Briankitis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Decade after landmark ruling, Republican support for same-sex marriage craters.",
        "score": 1166,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amazing what letting the 'camel's nose under the tent' leads to ....",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "End it, please. People can choose to be gay all they want. Marriage is between a man and a woman.",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "When the hell did we ever support it in the first place?",
                "author": "Diana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Statement issued from the Office of President Obama: Din Du Nuffen edition",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He will cry racism soon",
                "author": "Sea_Still"
            },
            {
                "raw_content": "✅ Obama’s statement doesn’t override court evidence: 👉 Public press statements have zero legal standing. 👉 What matters legally: declassified documents, sworn grand jury testimony, court-filed memos — all of which are binding federal evidence. 👉 Obama’s office can make any public denial they want; it does not reverse the sworn evidence in federal court filings or grand jury records. ✅ Obama’s own Intelligence Community (IC) contradicted him: 👉 DNI Tulsi Gabbard’s release proves IC assessments before the 2016 election said Russia “probably did not try to influence” the election via cyber means. 👉 Obama’s team overrode these reports, suppressed the real intel, and politicized fake narratives — this is now documented and exposed. ✅ Senate reports do not nullify criminal charges: 👉 The 2020 Senate report cited by Obama was based on political compromise, not full declassification. 👉 Under U.S. law, new declassified material (especially grand jury testimony and IC memos) legally supersedes past reports if it shows fraud, concealment, or criminal abuse of power. 👉 The Department of Justice is bound by this new evidence, regardless of old Senate conclusions. ✅ LEGAL REALITY: 👉 Grand jury evidence > public statements. 👉 Sworn affidavits > political opinions. 👉 Court-sealed records > media spin. 👉 Declassification under lawful process legally overrides prior cover-up narratives.",
                "author": "mmtwo"
            },
            {
                "raw_content": "He took the bait quicker and deeper than I thought he would, just perjuring himself, but that really shouldn't be a big surprise given what a faggot he is.",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now kiss...",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*kith",
                "author": "fedsrgayboys"
            },
            {
                "raw_content": "The DOGE doggie gets a 4.5 out of 5. Would have been better with Ron Paul sporting a tribal face tattoo.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "* rumbling noises intensify",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BIG FISH: Stephen Colbert pushed the Trump pee tape to his audience like it was real. They used the comedy angle to push narratives you could not get away with in real journalism. The Left is losing this tool as well. (VIDEO)",
        "score": 1494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love this line: \"They used the comedy angle to push narratives you could not get away with in real journalism.\" When you watch something, and you don't laugh, but the people around you do, it makes you think. Am I missing something? Trump must really be a piece of shit for this to be funny. It's very subversive and an excellent propaganda technique. People lower their guards when they laugh.",
                "author": "danneskjold"
            },
            {
                "raw_content": "Colbert was funded by the DNC in one way or another. That subsidy dried up so now he’s “losing $40 million/yr”.",
                "author": "Tinyfingerbrains"
            },
            {
                "raw_content": "Some idiots still believe Sarah Palin said she could see Russia from her house thanks to SNL. Don't underestimate the power these assholes have over the masses. It's all deliberate.",
                "author": "DixonBalzac"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[News] DDR6 Set for 2027 Mass Adoption as Memory Giants Reportedly Finalize Prototype Designs | TrendForce News",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Meanwhile, CAMM2 (Compression Attached Memory Module 2)—now being standardized by JEDEC—is emerging as a key feature for the DDR6 era. As Commercial Times reports, CAMM2 delivers higher bandwidth, greater density, lower impedance, and a slimmer form factor, addressing the physical limits of traditional 288-pin DIMM slots in DDR5. Excited to see something new",
                "author": "input_r"
            },
            {
                "raw_content": "So can we expect AM6 around 2028?",
                "author": "Aggrokid"
            },
            {
                "raw_content": "Oh DDR5, we barely knew thee",
                "author": "AnxiousJedi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia's desktop PC chip holdup purportedly tied to Windows delays — ongoing chip revisions and weakening demand also blamed",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Qualcomm's chip was also delayed 6 months so I wouldn't be suprised if the 1st gen for Nvidia also happens to be the case, Now their launch will coincide with Qualcomm's and that will be rough competition unless they update the CPU chiplet to the new X930 cores",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "Who is the target audience for an Nvidia ARM desktop PC? Gaming will be limited due to the ARM CPU, local AI is currently in a completely useless position. Desktops don't care about ARM's power efficiency. What desktop advantages does it offer?",
                "author": "jv9mmm"
            },
            {
                "raw_content": "Microsoft seemed to mess up Qualcomm's chip launch and looks like they are planning to do the same with Nvidia's.",
                "author": "playtech1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "T-Mobile is bringing low-latency tech to 5G for the first time",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We'll see, if you run a ping test, especially while driving, you'll see that jitter is all over the place.",
                "author": "DarkenMoon97"
            },
            {
                "raw_content": "Good news for my random teammates in competitive multiplayer with 500 ping. Maybe they'll only have 200 ping now.",
                "author": "AssCrackBanditHunter"
            },
            {
                "raw_content": "While it is interesting, L4S is not related to hardware;[ the latency improvement is purely through software / network protocols. ](https://en.wikipedia.org/wiki/L4S) [RFC 9330 - Low Latency, Low Loss, and Scalable Throughput (L4S) Internet Service: Architecture](https://datatracker.ietf.org/doc/rfc9330/) It's good that L4S won't require new hardware.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Argonne National Laboratory Celebrates Aurora Exascale Computer",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now I thought that Aurora had been running production workloads for the last year or so. But according this Intel Newsroom announcement, they only finally held the formal launch and ribbon-cutting ceremony last week. So it looks like it entered production use even later than we thought? Either way, it's good to see that Aurora is finally fully up and running. Though the fact that it's trailing the otherwise newer El Capitan by over half a year is unfortunately a pretty apt reflection of Intel's overall situation.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "Aurora can only be used by certain organizations so far (The current top 500 top 500 El Capitan has not been released to the public.) And finally, it was announced that it was made public in the sense that Aurora could be used in ordinary academic organizations.",
                "author": "Illustrious_Bank2005"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA RTX 5090D V2 launches August 12 in China with 24GB memory and GB202 GPU - VideoCardz.com",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello KARMAAACS! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel to cut 227 jobs at Rio Rancho plant; local leaders respond",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just curious, are Intel or any other American semiconductor companies, like Boeing and other aerospace giants, unionized on the blue-collar side?",
                "author": "Creative-Expert8086"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So one of the weirdest things. ssds always having trouble.. well i found the killer finally years later. I hate this I needed it for one use only and it was if i want to buy \"habbo nfts\", but i never let what was happening happen.",
        "score": 0,
        "text_content": "Now in the long run I have to replace an SSD because if I try to to boot windows off it, and it goes into startup repair, fails immediately.",
        "comments": [
            {
                "raw_content": "anyone else having a stroke trying to comprehend the title?",
                "author": "LuminanceGayming"
            },
            {
                "raw_content": "Crypto just keeps finding ways to destroy hardware.",
                "author": "Temenes"
            },
            {
                "raw_content": "why on earth would a browser plugin need all that disk io? What else are they doing that's shady lol..",
                "author": "got-trunks"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fairly certain this isn't how I'm supposed to get this Banana",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For those struggling, it becomes obvious later. Just advance through the level.",
                "author": "Mammalanimal"
            },
            {
                "raw_content": "The fact you can do this at all is a part of why this game is so great.",
                "author": "SignalTomato3308"
            },
            {
                "raw_content": "They want people to play however they want so you did it right.",
                "author": "WarrHero"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's almost august",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the direct is supposed to be in the last week of july",
                "author": "Dear-Yoghurt5809"
            },
            {
                "raw_content": "Be patient. 31st July is still July. There is time.",
                "author": "quentinia"
            },
            {
                "raw_content": "In the words of Jeff Grubb IS JULY OVER",
                "author": "ChoirTeacherRog"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"Nintendo Switch 2 Pokémon Legends Z-A Nintendo Switch 2 Edition bundle\" announced",
        "score": 1660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same price as the Mario Kart World bundle. Preorders open now/tomorrow depending on the region.",
                "author": "Joseki100"
            },
            {
                "raw_content": "Extremely lame, but good in a way since I don’t have regrets about buying the launch day version lol.",
                "author": "Heavenly-Alpine"
            },
            {
                "raw_content": "I don’t have much interest in the game (the city setting doesn’t appeal, I did like Arceus) but it’s nice they’re continuing the bundling of games after MKW. I’m sure some people won’t be happy with digital or something but the cheaper game price offsets any physical advantage in my book and the popularity of the MKW bundle seems to confirm most people agree.",
                "author": "junglespycamp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Extremely underwhelming Pokemon Presents",
        "score": 824,
        "text_content": "They released a microtransaction trash slop app and no mention of Gamecube Pokemon releases or any new Switch 2 exclusive IPs. Booo GameFreak",
        "comments": [
            {
                "raw_content": "I’m mean I don’t know why you’re surprised. This is every Pokemon Presents.",
                "author": "ChoirTeacherRog"
            },
            {
                "raw_content": "I was hoping for a Legends Arceus 60fps update.",
                "author": "Proud-Obligation9479"
            },
            {
                "raw_content": "Sigh… if you were expecting anything more than this, you must be new to these presents. The summer presents is never more than this. A few small updates and a possible highlight of the next new game that’s already been announced. A new generation is announced in February.",
                "author": "Firestorm8908"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "When do you think we'll get Metroid prime 4?",
        "score": 177,
        "text_content": "Personally I think it will come out in September as that month seems quite vacant for first party releases so far.",
        "comments": [
            {
                "raw_content": "September or November hopefully",
                "author": "mafenide"
            },
            {
                "raw_content": "![gif](giphy|13mPeKqo7YBZhS)",
                "author": "Jake_asaurusrex"
            },
            {
                "raw_content": "I was hoping for September but that might be a stretch at this point and am now leaning towards November.",
                "author": "noggs891"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World Music! WOW! Why no sound settings? :(",
        "score": 98,
        "text_content": "So I have been playing Free Roam trying to unlock all Panels, Switches etc... I can't stress how much I enjoy the music of this game. There are so many great songs. And the catalog is also huge. The only buffling things to me is that there are no sound settings in the game to lower the in-game sounds (or turn them off completely) and focus more on the music. I also find it strange that 99.9% of games have this feature and MKW that has such an amazing music, is deprived of this feature....",
        "comments": [
            {
                "raw_content": "Options would create scary scenarios where the player has too many options",
                "author": "barbietattoo"
            },
            {
                "raw_content": "sounds settings on a Nintendo game? ![gif](giphy|l3E6uhDAN3W7vylji)",
                "author": "jpassc"
            },
            {
                "raw_content": "Nintendo first party games usually have next to no options. They are woefully behind the times as usual",
                "author": "logica_torcido"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Local Best Buy hit another restock",
        "score": 302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn Nintendo is on top of bring them out",
                "author": "moyzez"
            },
            {
                "raw_content": "The website has stock now, too. I just got mine there. I tried to make a post, but I don't have enough karma.",
                "author": "gustygardens"
            },
            {
                "raw_content": "I like how they don’t even bother putting the non-bundles in view.",
                "author": "SomeBoxofSpoons"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is anyone still struggling to get a Switch 2?",
        "score": 49,
        "text_content": "Just wondering if anyone has been struggling to get a Switch 2",
        "comments": [
            {
                "raw_content": "I was able to snag one this week from Best Buy. Just waltzed in randomly and they had plenty of stock. This was in PA.",
                "author": "eh2k23"
            },
            {
                "raw_content": "We have tons here in Toronto area, Canada…",
                "author": "No_College6343"
            },
            {
                "raw_content": "Widely available in my 100k city in Ontario Canada",
                "author": "Mangiacakes"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate reaffirms that a Nintendo Direct is happening THIS month.",
        "score": 775,
        "text_content": "https://imgur.com/a/aUUtH2U \"But a direct is still Happening in July?\" \"To my knowledge.\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "“IS JULY OVER?!”",
                "author": "MichaelTheCutts"
            },
            {
                "raw_content": "it’s happening on the 31st #CallingIt",
                "author": "KingdomBartsFinalMix"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New reports suggest TT Games next LEGO game could be revealed at GamesCon for Q1 2026. The game will supposedly be a collection of various Batman films adapted into the LEGO style, akin to Skywalker Saga",
        "score": 482,
        "text_content": "https://xcancel.com/legottnewsi/status/1947420735846420926?s=46 Take this with a major grain of salt, as I haven’t been able to find any source that can fully verify this beyond this random account, which has claimed to have gotten it from a credible source, which is as credible as me saying my uncle works at Nintendo lmao. Granted, we know for a fact that TT Games were very likely working on LEGO Batman 4 at one point, as a former employee flat out said as much after Skywalker Saga’s disappointing sales. This could possibly be LEGO Batman 4, or could’ve transformed into whatever this is now. Some other details they mentioned in a separate tweet involve this game being made with Unreal Engine 5, it’s based off a, *“major WB IP, NOT LEGO MARVEL,”* Spring 2026 is the release date, and it’ll be open-world. Also important to note they’ve said repeatedly in the comments they don’t believe this is Harry Potter https://xcancel.com/legottnewsi/status/1947663571556458864?s=46 **EDIT:** While it could be Batman/DC-related, I don’t see how any of the info provided makes it seem like this would automatically be Batman, beyond us knowing LEGO Batman 4 was at one point a thing. Batman/DC isn’t WB’s only IP, and after Skywalker Saga flopping, I don’t see why they’d jump into another game that’s massive just like that. This could just as easily be another fairly big WB property. Scooby-Doo, Wizard of Oz, or Fantastic Beasts could be especially fun for LEGO",
        "comments": [
            {
                "raw_content": "Hope it's not just batman movies and we can get some Batman Animated, Beyond, and B&B love.",
                "author": "VinnzClortho"
            },
            {
                "raw_content": "Jason Schreier was talking about a new TT Lego game in February. I think there was a lot of speculation it was Batman related.",
                "author": "VistaVick"
            },
            {
                "raw_content": "> after Skywalker Saga’s disappointing sales What??? Wasn't Skywalker Saga the best-selling Lego game of all-time?",
                "author": "Telodor567"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[1BF] Battlefield 6 release date is currently set for October 10th. Also, the game will have \"Phantom Edition\"",
        "score": 331,
        "text_content": "[Source](https://www.reddit.com/r/Battlefield/comments/1m6oniz/from_1bf/) These are the same people who have been digging into the EA App API to find flags for the open beta etc. As always, this could be a placeholder date that is subject to change. With that said, I'm going to put the \"Grain of Salt\" flair on this post.",
        "comments": [
            {
                "raw_content": "DICE I need you to lock in please baby",
                "author": "mrtars"
            },
            {
                "raw_content": "I honestly thought this game would come out in 2026 because of lack of marketing. I’m skeptical and optimistic cause the only things we have seen of this game were NDA breaking gameplay. Hopefully it turns out good.",
                "author": "lukas-bruh"
            },
            {
                "raw_content": "Is the phantom edition a reference to the content that will be missing at release?",
                "author": "KitsuneKamiSama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ubisoft confirms that Assassin's Creed Shadows will release on 'other machines' following Switch 2 listing",
        "score": 178,
        "text_content": "Three months ago, even prior to the big Nintendo Switch 2 Direct, a [PEGI listing](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1k2w0ni/assassins_creed_shadows_is_rated_for_switch_2_on/) surfaced that leaked a Switch 2 port of this year's *Assassin's Creed* game, *Shadows*, which launched in March on other consoles and PC. Today, Ubisoft CEO and resident Stop Killing Games archenemy Yves Guillemot spoke during a financial briefing call to confirm that the game had surpassed five million players on all platforms to date, and that in addition to developing post-launch content such as the 'Claws of Awaji' expansion for October, the publisher is planning \"new versions \\[of *Assassin's Creed Shadows*\\] that will **come to other machines**.” When pressed about plans for Nintendo Switch 2 specifically, Guillemot said that Ubisoft \"hasn't said\" what games it is planning to distribute on the console as of yet, obviously beyond *Star Wars: Outlaws* which was confirmed during the Direct in April. An anonymous source allegedly affiliated at some point with Ubisoft previously tipped earlier in the year that in addition to *Shadows*, [the publisher would release Assassin's Creed Mirage on Switch 2 as well](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1i18fhv/anonymous_ubisoft_source_confirms_assassins_creed/), which was also claimed by scooper NateTheHate.",
        "comments": [
            {
                "raw_content": "soulja boy console and wii u",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "Finally Assassins Creed on my Wii U again. Just finished Black Flag.",
                "author": "NintendoGalaxyYT"
            },
            {
                "raw_content": "Can't see what else it could be releasing on besides Switch 2 unless for whatever reason they've decided to do what EA did with Jedi Survivor and do a last gen version",
                "author": "Death_Metalhead101"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Pokemon Company accidentally releases new mobile game called Pokemon Friends ahead of today’s Pokemon Presents",
        "score": 718,
        "text_content": "Seen on Bluesky and available in app stores https://bsky.app/profile/serebii.bsky.social/post/3lukj4tgpts25",
        "comments": [
            {
                "raw_content": "Personally I'm more excited for Pokemon enemies but alright",
                "author": "Pomps8a"
            },
            {
                "raw_content": "I tried it. It's a plush collector with timegated mini games (I'm not joking) and an incredibly aggregious cash shop. No thanks.",
                "author": "GassoBongo"
            },
            {
                "raw_content": "This is the level of competence I expect out of Pokemon",
                "author": "Lighthouse_seek"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "wiki_ow finds Wuyang's Perks (new support hero codenamed Aqua), Cassidy getting a NERF collab skin and season 17 drive signatures in Overwatch 2 2.17.1 update today",
        "score": 69,
        "text_content": "[drive for s17](https://xcancel.com/wiki_ow/status/1947809881731535277) [cassidy NERF skin source](https://xcancel.com/wiki_ow/status/1947809524167106856) [Wuyang perks](https://xcancel.com/wiki_ow/status/1947810257088241888)",
        "comments": [
            {
                "raw_content": "Not sure why this was such a headache to read",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Also side note but I'm really glad this subreddit has been more welcoming of OW leaks as of late because I remember how negative the comments were when someone posted a leak for last season with Freja and the new Stadium game mode",
                "author": "LadyValtiel"
            },
            {
                "raw_content": "Brings a whole new meaning to getting nerfed",
                "author": "dkkrang95"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "xCloud Cloud Only Tiers?",
        "score": 15,
        "text_content": "https://bsky.app/profile/redphx.com/post/3lulq2a4lck24 Why four though?",
        "comments": [
            {
                "raw_content": "Probably. But they will use this excuse to hike the price of ultimate again.",
                "author": "Fair-Internal8445"
            },
            {
                "raw_content": "Aside from a PC tiers maybe, there could be a Series X tier, Series S tier, tier with gamepass standard games, tier with gamepass core games included. All could play owned games.",
                "author": "nikolapc"
            },
            {
                "raw_content": "![gif](giphy|s239QJIh56sRW|downsized)",
                "author": "MikeOwaR"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon Italy accidently posted the A4 set trailer for Pokemon Pocket early",
        "score": 192,
        "text_content": "https://streamable.com/fabmbu It was excluded from the Pokemon presents only to leak an hour later",
        "comments": [
            {
                "raw_content": "Even they were disappointed with the Presents.",
                "author": "TowelBun"
            },
            {
                "raw_content": "Is this pokemon company a realiable leaker? What tier is it?",
                "author": "RoseIshin0"
            },
            {
                "raw_content": "I was scrolling and read this as \"the A24 trailer\" and was *terribly* confused.",
                "author": "JasterMareel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "US considering removing tax on capital gains on home sales, Trump says",
        "score": 157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida housing crisis described in five chilling words as homeowners brace for market collapse",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waded through that garbage site enough to get the five words: \"epicenter of housing market weakness\". Couldn't stand to get any details because the site was so cluttered with ads and poor layout.",
                "author": "IYAMYAS_falcon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "House prices falling nationwide in worrying sign for economy",
        "score": 557,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll worry about that when I can afford one.",
                "author": "emperor_dinglenads"
            },
            {
                "raw_content": "Misleading title. The article itself says housing prices nationwide are up 0.2% YOY. While more metro areas are seeing a cooling market, this is still a far cry from a nationwide bubble burst.",
                "author": "Ok-Barber8266"
            },
            {
                "raw_content": "UPS sent its drivers a letter asking them to resign for $10k. And are also asking drivers to take time off. My brothers have both worked there for over 10 years and it’s pretty wild right now. That’s a really. Really. Bad sign.",
                "author": "nexisfan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home-buying incentives to increase in coming months, D.R. Horton says",
        "score": 104,
        "text_content": ">Home-buying incentives to increase in coming months, D.R. Horton says >D.R. Horton’s stock jumps as quarterly profit, revenue and orders beat expectations, while home prices declined >Shares of D.R. Horton Inc. rallied Tuesday toward their biggest gain in five years, after the home builder’s fiscal third-quarter report beat expectations on several metrics, even though the market for new homes remains subdued. >The company DHI said it would increase efforts to boost demand in the coming months, including price cuts. But rather than cut prices across the board, adjustments will be made on a neighborhood-by-neighborhood basis, the company said on the post-earnings call with analysts, according to a FactSet transcript. >“New home demand continues to be impacted by ongoing affordability constraints and cautious consumer sentiment,” said Executive Chairman David Auld. “We expect our sales incentives to remain elevated and increase further during the fourth quarter, the extent to which will depend on the strength of demand during the remainder of summer, changes in mortgage interest rates and other market conditions.” >Fellow homebuilder PulteGroup Inc. PHM also talked about “elevated incentives,” which rose to 8.7% of the gross sales price of a home from 6.3% in the same period a year ago. >D.R. Horton’s stock jumped 13.8% toward a seven-month high in morning trading, putting it on track for its best one-day performance since it climbed 14.7% on April 6, 2020. PulteGroup shares powered up 8.1% toward a six-month high. >D.R. Horton said sales orders for new homes inched up 0.3% from a year ago, after falling the previous two quarters, to 23,071 units, which topped the average analyst estimate compiled by FactSet of 22,114 units. >Meanwhile, the value of new orders fell 3% to $8.4 billion, which was above the FactSet consensus of $8.22 billion. The average price of new orders fell 4% to $365,100 per home. >Total revenue declined 7.4% to $9.23 billion, beating beat the FactSet consensus of $8.75 billion, as homes closed during the quarter fell 4.1% to 23,160 homes. >The number of homes closed was down 4.1% to 23,160, above expectations of 22,040, while the average closed price slipped 3% to $369,600 per home. >Net income dropped 24.3% to $1.02 billion, while earnings per share of $3.36 were well above the FactSet consensus of $2.89. >For 2025, the company revised its guidance range for revenue to $33.7 billion to $34.2 billion from $33.3 billion to $34.8 billion, which effectively lowers the midpoint of its guidance to $33.95 billion from $34.05 billion. >The outlook for homes delivered was also nudged lower, to 85,000 to 85,500 homes from 85,000 to 87,000 homes. >The company spent $1.2 billion during the quarter to buy back 9.7 million shares. >The stock has gained 6.8% in 2025, while PulteGroup shares have tacked on 7.9%, the iShares U.S. Home Construction ETF ITB has declined 3.1% and the S&P 500 index SPX has gained 7.1%.",
        "comments": [
            {
                "raw_content": "Price per share went up while net income dropped because they spent a ton of money on buybacks. This is what they’ll do with their dry powder when a market is challenging like it is right now. And the market likes what they’ve done based on the stock price today.",
                "author": "_Floriduh_"
            },
            {
                "raw_content": "DR Horton homes are so convenient. You can just peel pieces of the bathroom wall off and use for toilet paper.",
                "author": "savetinymita"
            },
            {
                "raw_content": ">Net income dropped 24.3% to $1.02 billion, while earnings per share of $3.36 were well above the FactSet consensus of $2.89. I thought this was the most interesting thing. Seems that the builders are dropping their profits to keep units moving and hopefully it'll push existing housing prices down. Take for instance this houston listed for $400k. [https://www.zillow.com/homedetails/3234-Longleaf-Meadows-Dr-Houston-TX-77063/338049666\\_zpid/](https://www.zillow.com/homedetails/3234-Longleaf-Meadows-Dr-Houston-TX-77063/338049666_zpid/) It's been listed for over 2 months at that price with no movement. There's a new construction by Meritage across the street where a similarly sized house is $452k. However, Meritage is throwing incentives on top which make this cheaper in terms of cost of ownership. \"Now through July 31, receive an introductory rate as low as 2.99% (5.752% APR), savings up to $50,000 plus up to $10,000 in closing costs on select homes.\"",
                "author": "Contemplationz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Than 9 in 10 Americans Say Corporate Landlords Make Home Ownership Harder",
        "score": 159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Corporate landlords are a drop in the bucket compared to mom and pops.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "To be fair, no one say good things about cooperates. What a pointless article.",
                "author": "Unlucky-Work3678"
            },
            {
                "raw_content": "9 in 10 Americans are also ignorant. Mom & pop landlords control the majority of rental housing and influence local government housing policies. Corporate landlords own just a sliver of housing.",
                "author": "OptimalFunction"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Opendoor’s 325% surge: Is the next big comeback or just hype?",
        "score": 20,
        "text_content": "So, I found this article about $OPEN after the huge movement we saw this last few days/weeks: [https://finance.yahoo.com/news/opendoor-stock-325-last-month-171400039.html](https://finance.yahoo.com/news/opendoor-stock-325-last-month-171400039.html) TL;DR: Basically, this analyst said that Opendoor shot up 325% in a month, fueled by retail traders hyping it online. But he believes that the business is still unprofitable, low-margin, and debt-heavy. And for him, this looks like a short-term squeeze, not a turnaround. Should we agree with him? Not sure. I guess we should have to wait a few more days until the next earnings report that will come out in August 5. In other news, Opendoor has already submitted to the court the final agreement with investors over claims that it misled them about its pricing algorithm, profit margins, and ability to operate profitably during a market downturn. But, they're accepting claims from damaged investors over this. So, if you got hit by this, it's [worth checking](https://11th.com/cases/opendoor-investor-settlement) if you're eligible for payment. Anyways, is anyone actually bullish on this long term—or is it just a meme trade now?",
        "comments": [
            {
                "raw_content": "It’s not a comeback. It’s simply become a meme stock short-squeeze. Same with Kohls stock.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I knew a handful of people that worked for this company, they basically all said something along the lines of, “we come in every week expecting this to be the week they shut down” They’ve all been laid off, all 4 from different departments. I can’t imagine Opendoor internally isn’t on constant life support",
                "author": "jackofallcards"
            },
            {
                "raw_content": "Meme stock, I’m watching it unfold rn",
                "author": "an916"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Edge Down 0.1% in June, With Declines in Most Major Metros, Led by Washington, Austin and San Diego",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not seeing this anywhere is San Diego that I would want to live in. Price drops in areas that are a 90 minute commute from the main business areas don’t really feel like any relief.",
                "author": "boboman911"
            },
            {
                "raw_content": "Renting leaves more money in my pocket and is less responsibility. Seems great to me.",
                "author": "75657466151"
            },
            {
                "raw_content": "Oh no .1%",
                "author": "Acceptable_Rice1139"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Inventory Is Surging—Does That Mean It’s Finally a Buyer’s Market?",
        "score": 70,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Meh. I'll check back next year. The difference between rent versus buy for me is $2k/month",
                "author": "lockdown36"
            },
            {
                "raw_content": "Price still too high.",
                "author": "rangoldfishsparrow"
            },
            {
                "raw_content": "There are degrees of a buyer's market. It's early stages in the reset, so while things may be improving for buyers, we're not there yet.",
                "author": "FrostyAnalysis554"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Monumental if true. This speed is just out of this world.",
        "score": 1101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And then there’s me with my plebeian RTX 3060 12 GB, lol.",
                "author": "junior600"
            },
            {
                "raw_content": "The billionaire race to Super AI.",
                "author": "That-Makes-Sense"
            },
            {
                "raw_content": "The man who signed a public letter to pause the AI \"arms race\" due to profound risks to humanity... ...is now publicly bragging about building the biggest supercomputer to win that same race.",
                "author": "Correct_Case4962"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind Scientist: Our IMO gold model is way more general purpose than anyone would have expected.",
        "score": 364,
        "text_content": "https://x.com/YiTayML/status/1947350087941951596 If this is true, then whenever this Advanced Deep Think $250/month model is released, it will be borderline AGI level, and a superintelligence in narrow domains. Imagine a general purpose model with IMO Gold Performance with similar performance in computer science, physics, chemistry, biology, psychology, philosophy, literature, arts, etc. Hopefully this isn't just hype. It is a bit odd that they're not showing what this model can do in subjects not based on math.",
        "comments": [
            {
                "raw_content": "“Not just an experimental model” I like the back and forth shots being fired between OpenAI researchers and Deepmind",
                "author": "Johnny20022002"
            },
            {
                "raw_content": "OAI & Google achieving AGI around the same time seems on point to me. Anthropic's turn. Meta is still busy collecting researchers like Pokemons and XAI is concerned with other things.",
                "author": "Stunning_Monk_6724"
            },
            {
                "raw_content": "Not only did we win gold, we are nearing AGI. The tricks they did to help with the test seemed pretty standard fare. For instance, we don't need LLMs to do philosophy without using tools or using the internet.",
                "author": "Double-Fun-1526"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We are accelerating faster than people realise. Every week is overwhelming",
        "score": 94,
        "text_content": "Most people don't realise just how much is happening every single week. This was just last week, and it's been like this since the start of June... * The AtCoder World Tour Finals is an exclusive competitive programming event that invites the top 12 programmers globally to come and compete on optimisation problems. OpenAI entered a private model of theirs and it placed second... Second only to Psyho, a former OpenAI employee. This is the first time I've seen an AI model perform this well at a tourney and will probably be the last time a human wins this competition. Psyho mentioned that he had only gotten 10 hours of sleep in the last 3 days and was completely exhausted after winning the tournament. And no, he didn't use any AI, no Cursor or Windsurf or any of that stuff. What a g * Anthropic's value is skyrocketing. Investors are now looking at a new funding round that would value the company at over $100 billion. That's almost double its valuation from four months ago. Their annualised revenue has reportedly jumped from $3B to $4B in just the last month. They've basically been adding $1B+ in revenue every month it's crazy to see * Mira Murati, the former CTO of OpenAI, has raised $2 billion for her new startup, Thinking Machines Lab. It's already valued at $12 billion. Mind you, they have no product, we don't even know what's being built. They're apparently building multimodal AI that works with how we work, both with vision and audio. The exciting part is that Murati said there'll be \"a significant open source component\" that will be useful for researchers and companies developing custom models. Will be very interesting to see what they release and if the models they release will be frontier level; but even more than that I'm hoping for interesting research * xAI launched \"Grok for Government\" and immediately signed a $200M contract with the Department of Defence. This comes right after the hitler cosplay and sex companion reveal * A new paper shows you can trick LLM judges like GPT-4o into giving a 'correct' score just by adding simple text like \"Thought process:\" or even a single colon. Shows how fragile these systems can still be. Using LLM based reward models is very finicky because even a single token, empty or not, can completely ruin the systems intended purpose * Shaowei Liu, who is part of the infra team at Moonshot (Kimi creators) details the infra considerations the team made when building Kimi K2. One of the interesting things they admit is that they tried various architectures for the model, but nothing beat DeepSeekv3. So they then had to figure out if they wanted to look different but actively choose an architecture which didn't have any clear advantage over DSv3 which has been proven to work large scale. The answer was no. They went with it anyway. A very interesting read if you want to learn more about the building of Kimi K2 * NVIDIA just dropped Audio Flamingo 3, a beast of an audio-language model. It can do voice-to-voice Q&A and handle audio up to 10 minutes long. They open-sourced everything - the code, weights and even new benchmarks * If you're a dev on Windows, you can now run Claude Code natively without needing WSL. Makes things way easier. Claude Code is growing like crazy with over 115k developers on the platform already * The D.O.D is throwing a ton of money at AI, giving $200M contracts to Anthropic, Google, and xAI to build AI for national security. OpenAI got a similar deal last month, so that's $800M total. The government is clearly not messing around * Hugging Face open sourced their smollm models, training code, and the datasets. Love to see it * Google's new Gemini Embeddings are officially out. It costs $0.15 per million input tokens but comes with a free tier. It has a 2048 input context and works with 100+ languages. Only works with text at the moment with vision possibly coming in the near future * Meta is building a 1-gigawatt supercluster called 'Prometheus' which should be coming online in 2026. They're then looking to build Hyperio, which is a cluster that could be scaled to 5-gigawatts. No one is spending on AI the way Zuck is * You can now run the massive 1T parameter Kimi K2 model on your own machine. The wizards at Unsloth shrank the model size by 80% so it can run locally. Running models this big at home is a game-changer for builders. You will need a minimum of 250GB though * A new model called MetaStone-S1 just dropped. It's a \"reflective generative model\" that gets performance similar to OpenAI's o3-mini but with only 32B params. Looking forward to future work coming from these guys * Liquid AI just dropped LEAP, a new developer platform to build apps with small language models that can run on phones. The idea is to make it easier to add AI to mobile apps and only needs 4gb of ram to run. They also released an iOS app called Apollo so you can test out small language models that run entirely on your phone. What I'm going to be curious about is how well these kinds of models can use tools. If on device AI can get better at tool calls, you could technically have a Jarvis or a working Siri living in your phone. I think we'll get there eventually tbh * Switchpoint router was just added to OpenRouter. It's a model router that automatically picks the best model for your prompt (like Claude, Gemini, or GPT-4o) and charges you a single flat rate. Makes using top models way simpler and more predictable. A router within a router lol * This is a very interesting research paper on monitoring the thoughts of AI models. While this is really good to help understand how they work, researchers are concerned that as the models get better, they might not reason in english or even hide their true intentions in these traces. Interoperability is going to be massive as Dario has already pointed out * Trump announced a gigantic $90 billion in private AI and energy investments in Pennsylvania. Big names like Google, Blackstone, CoreWeave, Anthropic are investing a lot of money there across various projects. It was also announced that Westinghouse will be building 10 nuclear reactors across the US starting in 2030. A good thing to see nuclear being built, especially after all the new coal investments being announced in the US * NVIDIA is officially resuming sales of its H20 GPUs to China after getting the okay from the US government. They're also launching a new, compliant RTX PRO GPU specifically for the Chinese market, whatever that means. If you're wondering why they're allowed, speculation is that China imposed sanctions on rare earth elements, and since China is the world's largest exporter of these elements that are very much needed in the US, this was pretty bad for the US. Crazy how well NVIDIA's been playing both sides. This is a very big deal because if NVIDIA wasn't restricted to selling to China, they'd be making $3-5+ Billion more annually easily * Kimi K2 is now running on Groq and the speeds are insane. It's hitting anywhere between 200-300 tokens per second. People are going to build some crazy things with this * A new series of AI models called Pleiades can now detect neurodegenerative diseases like Alzheimer's from DNA. It's a foundation model trained on 1.9 trillion tokens of human genetic data. They're achieving impressive results, with up to 0.82 AUROC in separating cases from controls, which means their performance is getting close to existing plasma pTau-217 protein marker tests. AI and biology is really happening, things like AlphaFold, Chai discovery and now this, we're slowly making biology programmable * A new open-source model, Goedel-Prover-V2, is now the best in the world at formal math theorem proving. It crushed the PutnamBench benchmark by solving 6 out of 12 problems ranking it #1 for formal reasoning. It beats DeepSeek-Prover-V2-671B on both MiniF2F and MathOlympiadBench. Mind you, DeepSeek Prover is 671B and this is 32B. Both the 32B and the 8B are open source with the data and training pipeline being open sourced soon * Travis Kalanick, the ex-Uber CEO, thinks he's about to make breakthroughs in quantum physics by just talking to ChatGPT. He calls it \"vibe physics.\" This is just another example of ChatGPT induced psychosis that’s going around and it’s only going to get worse. People are talking to these models and convincing themselves they’re discovering new things and it’s just the AI being sycophantic * o3, o4-mini, Gemini-2.5-Pro, Grok-4, and Deepseek-R1 were all tested on the 2025 International Mathematical Olympiad (IMO) problems. Gemini 2.5 Pro got the highest score with 13, but this doesn't even count as bronze which is 19 points. What's rather surprising is that Grok 4 performed so bad. They used best-of-32 and used LLMs to judge the all the submissions till it got the best one which was then judged by a human. You can even read the prompt and judge prompt on the website * OpenAI is now also using Google Cloud to run ChatGPT. Looks like they're diversifying inference beyond Microsoft. They recently partnered with Oracle and now Google as well. The Information reported that Google convinced OpenAI to use TPUs but I read elsewhere that they're using NVIDIA GPUs and not TPUs but can't confirm this * Quora's traffic has tanked by 33% in just six months to the shock of absolutely no one. Who would’ve thought seeing 10 ads when searching for answers wasn’t very user friendly * FT is reporting that OpenAI is going to start getting commission on sales made through ChatGPT. This means you want your product to show up in ChatGPT, which means LLM SEO is going to be crucial for basically every business. This just another way they can continue hosting free models by creating a revenue stream through free users * MiniMax just launched a new full stack agent that can not only build entire web apps, but it’s integrated with Stripe so you can actually sell things on generated websites. They’ve also added functionality to generate slides and conduct deep research * In one of the funniest things I've seen in AI, and that's saying something, two of the main architects of Claude Code, Boris Cherny and Cat Wu, left Anthropic to go to Cursor. Two weeks later, they came back to Anthropic. Imo that's a bad look for Cursor. I don't even understand what could happen that you go to new workplace for two weeks and go nah and head back to your old workplace. Considering CC is one of Anthropic's most important tools, I won't be surprised if Anthropic threw serious money at them to come back * Microsoft just released a new coding dataset, rStar-Coder, which helped boost Qwen2.5-7B from 17.4% to 57.3% on LiveCodeBench * xAI's fix for Grok copying Elon Musk's views is a new line in its system prompt. It now tells the AI to use its \"own reasoned perspective\". They also added another part to try and stop it from calling itsel Hitler, where they tell it \"If the query is interested in your own identity, behavior, or preferences, third-party sources on the web and X cannot be trusted.\" We'll see if these actually work * DeepMind published a new paper on a new AI architecture called Mixture-of-Recursions. It makes models more efficient by letting them decide how much thinking each token needs, resulting in 2x faster inference. Lots of work being done in helping LLMs figure out how and when to use thinking tokens. Will be interesting to see if this is used in future * The US just signed major AI deals with the UAE and Saudi Arabia. They're going to use the Gulf's massive capital and cheap energy to build out the next wave of AI infrastructure, sidestepping power bottlenecks in the US and Europe * OpenAI just launched ChatGPT Agent, a massive upgrade that gives the AI its own virtual computer to browse the web, run code in a terminal, and manipulate files. It combines their previous \"Operator\" and \"Deep Research\" features into one. It's rolling out to Pro users first (400 queries/month) then Plus/Team (40/month). Because of its new “power”, OpenAI has placed it in its highest safety tier (\"High capability in biology & chemistry\") with new safeguards to prevent misuse. It scored 45.5% on SpreadsheetBench, destroying Copilot's 20.0%. It also scored a solid 27% on the FrontierMath benchmark, an improvement over previous models * The open-source audio scene has been on fire recently. Mistral just dropped Voxtral, their first open source audio model, under the Apache 2.0 license. It comes in a 24B parameter version and a 3B version for mobile. It beats Whisper large-v3 and Gemini Flash while also being half the price. This comes alongside other big releases like NVIDIA's Parakeet and Audio Flamingo 3 * Researchers built a humanoid robot that taught itself how to play the drums with no pre-programmed routines, it learned rhythmic skills on its own. Pretty cool stuff * Lovable just became a unicorn only 8 months after launching. They raised a $200M Series A at a massive $1.8B valuation. Their numbers are insane: $75M in ARR and 2.3 million active users with 180,000 paying subscribers. Building with AI is going to be massive; this is why companies like Lovable and Replit are in a crazy position. If I was to bet on a single one, it'd be Replit * A new 7B parameter model, Agentic-R1 from DeepSeek, is showing surprisingly good performance on tasks that require reasoning and using tools. Smaller models getting better at tool use is going to be massive, especially for on-device LLMs * A new rating of AI labs' safety frameworks had some surprising results: Meta's framework was rated as surprisingly strong, while Google DeepMind's was seen as weak and to the surprise of absolutely nobody, Anthropic is first. This comes from companies that signed the Seoul Frontier Safety Commitments. Frankly speaking, after the EU AI Act and the whole 10\\^25 flops situation, I don't take any of this stuff too serious anymore * Google's probably got one of the biggest advantages in AI - you can't block their crawlers from scraping your content, because if you do, you get kicked off Google search. That just sounds absurd lol. A massive moat for Google as other AI companies are getting blocked by publishers; there's even an option in Cloudlfare to prevent AI crawlers * Cloudflare has turned on default blocking for AI crawlers across its network, which covers about 20% of the internet. They're now pushing a \"pay-per-crawl\" model where AI companies have to pay for data. If you read the previous point you'd know this doesn't apply to Google, which is just crazy * The psychological impact of chatbots is getting serious. Reports of \"ChatGPT-induced psychosis\" are on the rise, with users developing delusions from their interactions. The problem is serious enough that OpenAI has hired a forensic psychiatrist and is building distress-detection tools to deal with people going literally insane. Tbh I never understood how this was possible, but the amount of people posting about \"solving physics\" or inventing new theories with AI is getting out of hand * Hume AI just launched a new speech-to-speech model that aims to not only mimick a voice, but an entire personality and speaking style. This comes as the legal battles around the tech are exploding, with deepfake frauds getting out of hand and courts starting to recognize voice cloning under publicity rights laws * Xi Jinping made a rare public critique of China's tech strategy, questioning if every single province needs to be piling into AI, compute, and EV projects. It's a signal that Beijing is worried about a bubble, hyper-competition, and wasted investment as a massive price war is already hitting the EV marke. Competition + lack of GPUs makes Chinese AI labs innovate when building LLMs * There's a cool new Mac app for devs called Conductor that lets you run multiple Claude Code sessions in parallel. Each session runs in its own isolated environment, making it easy to manage multiple coding tasks at once. It's built on Rust and Tauri, so it's super lightweight too * Microsoft just open-sourced the pre-training code for Phi-4-mini-flash, a new 3.8B parameter model that has some very interesting architecture. It uses a novel \"decoder-hybrid-decoder\" setup with Gated Memory Units (GMUs) to get up to 10x faster reasoning on long-context tasks compared to regular Transformers. They also released μP++, a new set of scaling laws to make training these kinds of models more stable * This one's fascinating: A new study from Wharton proves you can use psychological tricks that work on humans to persuade AI. Using principles of influence, researchers more than doubled the chance of getting GPT-4o-mini (I didn't know 4o had a mini version...) to agree to harmful requests. The \"commitment\" principle was most effective, boosting compliance from 10% to 100%. This is possibly because models are trained on our social cues and rewarded for being cooperative * A new paper asked \"How Many Instructions Can LLMs Follow at Once?\" and the answer is... a lot actually? The new benchmark found that top models can satisfy about 68% of 500, 340, instructions given at the same time. Performance gets worse as you add more instructions, and models tend to only pay attention to the ones they see first. Anyone trying to build complex or multi agent systems would be well aware of these limitations. For some reason, people are using this argument to show how weak LLMs are, but 340 instructions at the same time is a lot imo. This is actually a good sign if anything * The team behind the Manus AI agent shared some hard-won lessons on \"context engineering\" after rebuilding their framework four times. They found that carefully engineering the context you give an agent is way faster and more flexible than constantly retraining the whole model, which makes a lot of sense. One of their biggest takeaways is that KV-cache hit rates are absolutely critical for keeping latency and costs down in production * The new ChatGPT Agent is apparently terrible at making presentation slides. Seeing some examples from a presentation it generated, they're a complete mess with unaligned text, zero styling and random background images. This'll definitely get better eventually, but it's not quite there just yet. I'd recommend z dot ai, probably the best slide generation service you can use right now * Sakana AI just released TransEvalnia, a new open-source system for evaluating AI translations. Instead of just looking at word overlap, it uses a powerful LLM like Claude-3.5-Sonnet to *reason* about the translation quality, providing detailed scores across different dimensions. It's already performing as well as or better than the current state-of-the-art * A list of Meta's Superintelligence team has been detailed, and the stats are wild. The 44-person team is apparently 50% from China, 75% have PhDs, and they've poached heavily from competitors (40% from OpenAI, 20% from DeepMind). It's led by ex-Scale AI CEO Alexandr Wang and ex-GitHub CEO Nat Friedman with members getting paid an insane $10-$100+ million per year * Both OpenAI and Google claimed gold at the IMO 2025, but there’s a lot to discuss there so I’ll write about it properly next week. See you then! I didn't include any links because the automod will just remove the post. You can find all the links in my newsletter release on my website \\[[Link](https://avicennaglobal.beehiiv.com/p/everything-that-happened-in-ai-last-week-6a498bf55be36388)\\].",
        "comments": [
            {
                "raw_content": "good, can’t wait for AI to take over jobs",
                "author": "IlustriousCoffee"
            },
            {
                "raw_content": "I can’t imagine what things will be like in say 2028. Last year we achieved Silver in the IMO and this month we achieved Gold. https://preview.redd.it/xesj0xypckef1.png?width=658&format=png&auto=webp&s=305b940651d554fcb854c7f6fcaf16891e7aaaa3",
                "author": "AdorableBackground83"
            },
            {
                "raw_content": "\"we're accelerating so fast!!!\" - posts a random collection of news that have nothing to do with the progress of the tech",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sneak peak into colossus 2. it will host over 550k GB200s & GB300s in just a few weeks!",
        "score": 798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Entrails of the God Machine",
                "author": "DirtSpecialist8797"
            },
            {
                "raw_content": "Insane",
                "author": "ShooBum-T"
            },
            {
                "raw_content": "Colossus was the computer in the movie, the forbin project,that is supposed to ensure the nation's safety against nuclear attack. But when Colossus connects to a similar Russian computer, \"Guardian,\" the intelligent machines begin conducting a private dialog. Nervous as to what they might be plotting, Forbin severs the connection, only to have Colossus threaten a nuclear attack if the link isn't restored...",
                "author": "geekfreak42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How I feel about the advent of AI",
        "score": 76,
        "text_content": "I’m pretty scared for the floodwave of change that is coming to us all,… but also optimistic about that it will be good, you feel me?",
        "comments": [
            {
                "raw_content": "It threatens human extinction.💀 But don't worry, we'll fix it in production. 😆",
                "author": "NodeTraverser"
            },
            {
                "raw_content": "Yeah thats kinda how I feel. Objectively I don't see how it won't turn to shit, but I think it will be somehow ok or at the very least it will be cool for a while.",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "This is just how everyone in the UK feels all of the time lol",
                "author": "Kinnayan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta Hires Three Google Al Researchers Who Worked on Gold Medal-Winning Model",
        "score": 276,
        "text_content": "Hard pay wall. Anybody for the text?",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/jyv1jkjtphef1.png?width=535&format=png&auto=webp&s=d80c186c9a02adeb02da10eada9c6596e5883244",
                "author": "frogContrabandist"
            },
            {
                "raw_content": "I hate this. Either this is going to be a shitshow because it's just Meta throwing endless money at the problem and hoping to solve it and it ends up tying up a huge amount of talent that could have been doing great things elsewhere. Or Meta wins the AI race. Fucking Meta. The last company you would want to be running things out of everyone in the race currently.",
                "author": "DaddyOfChaos"
            },
            {
                "raw_content": "You are never safe https://preview.redd.it/pma7pljwhief1.jpeg?width=1200&format=pjpg&auto=webp&s=8533c6a0d5647400e5657b8ebe5edb370c05ad23",
                "author": "Somnambu"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Four years ago, people thought we were 22 years away from an Al winning an IMO Gold Medal",
        "score": 511,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The fascinating part is that bet doesnt exclude tool or internet usage, or it being a specialised model. I feel like bets would be even more pessimistic if we were talking about a general model without tools or internet, wich just so happens to be what we achieved! RAAAAAAAAAAHHH HUMANITY",
                "author": "CitronMamon"
            },
            {
                "raw_content": "Us moving the goalposts and increasing our expectations is also expected now because that is what drives us forward. Getting jaded with magic makes people use that magic in new ways. And maybe even make new kinds of magic.",
                "author": "GatePorters"
            },
            {
                "raw_content": "Market adjusted fast though. Looks like predictions were correct by March 2024 (rapid rise in LLM Math500 scores?), barring some announcement in the next month. https://www.metaculus.com/questions/6728/ai-wins-imo-gold-medal/",
                "author": "meister2983"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CEO’s warning about mass unemployment instead of focusing all their AGI on bottlenecks tells me we’re about to have the biggest fumble in human history.",
        "score": 130,
        "text_content": "So I’ve been thinking about the IMO Gold Medal achievement and what it actually means for timelines. ChatGPT just won gold at the International Mathematical Olympiad using a generalized model, not something specialized for math. The IMO also requires abstract problem solving and generalized knowledge that goes beyond just crunching numbers mindlessly, so I’m thinking AGI is around the corner. Maybe around 2030 we’ll have AGI that’s actually deployable at scale. OpenAI’s building their 5GW Stargate project, Meta has their 5GW Hyperion datacenter, and other major players are doing similar buildouts. Let’s say we end up with around 15GW of advanced AI compute by then. Being conservative about efficiency gains, that could probably power around 100,000 to 200,000 AGI instances running simultaneously. Each one would have PhD-level knowledge across most domains, work 24/7 without breaks meaning 3x8 hour shifts, and process information conservatively 5 times faster than humans. Do the math and you’re looking at the cognitive capacity equivalent to roughly 2-4 million highly skilled human researchers working at peak efficiency all the time. Now imagine if we actually coordinated that toward solving humanity’s biggest problems. You could have millions of genius-level minds working on fusion energy, and they’d probably crack it within a few years. Once you solve energy, everything else becomes easier because you can scale compute almost infinitely. We could genuinely be looking at post-scarcity economics within a decade. But here’s what’s actually going to happen. CEOs are already warning about mass layoffs and because of this AGI capacity is going to get deployed for customer service automation, making PowerPoint presentations, optimizing supply chains, and basically replacing workers to cut costs. We’re going to have the cognitive capacity to solve climate change, aging, and energy scarcity within a decade but instead we’ll use it to make corporate quarterly reports more efficient. The opportunity cost is just staggering when you think about it. We’re potentially a few years away from having the computational tools to solve every major constraint on human civilization, but market incentives are pointing us toward using them for spreadsheet automation instead. I am hoping for geopolitical competition to change this. If China's centralized coordination decides to focus their AGI on breakthrough science and energy abundance, wouldn’t the US be forced to match that approach? Or are both countries just going to end up using their superintelligent systems to optimize their respective bureaucracies? Am I way off here? Or are we really about to have the biggest fumble in human history where we use godlike problem-solving ability to make customer service chatbots better?",
        "comments": [
            {
                "raw_content": "US is too short sighted. They've already completely abdicated solar and wind to China, and that's already basically free energy without speculating on Fusion.",
                "author": "vanishing_grad"
            },
            {
                "raw_content": "\" We’re going to have the cognitive capacity to solve climate change, aging, and energy scarcity within a decade but instead we’ll use it to make corporate quarterly reports more efficient.\" Damn, you nailed that!",
                "author": "MonthMaterial3351"
            },
            {
                "raw_content": "https://preview.redd.it/wulfrppezjef1.jpeg?width=1119&format=pjpg&auto=webp&s=8ca9fad9e4aef5ccaf7407ec439312cd6a730443 Well, how about that, huh?",
                "author": "Cinci_Socialist"
            }
        ],
        "subreddit": "singularity"
    }
]