[
    {
        "post_name": "When the Antifa militants in the animal costumes think the cameras are pointed away, they engage in rioting too outside the ICE facility.",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's standard Black Bloc tactics: 95% of the crowd is there to act as a distraction for the 5% of thugs who are actually committing the violence and worst bits of mayhem... then when the authorities inevitably intervene, that 95%'s job is to begin the recording THEN, say \"OH MY GOD!!!!\" a dozen times, and try to act as shields to get between the thugs and the authorities. If the thugs are disguised as something innocuous, so much the better for their portrayal of the good guys as authoritarians.",
                "author": "LabTech"
            },
            {
                "raw_content": "More pepperballs, Mom!",
                "author": "BeauHD"
            },
            {
                "raw_content": "Puncture and deflate with rubber bullets",
                "author": "VeryFinePerson84"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thanks for the free advertisement @NBCSNL",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "don’t forget to deport the illegals that aren’t considered criminals. don’t just wait for them to get a DUI or something",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I already support them you dont have to keep selling me",
                "author": "milpede0306"
            },
            {
                "raw_content": "wait, that was an actual clip presented as something bad? LOL.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚚 Truckers Gain Wages as ICE Detains Highway Illegals 💰",
        "score": 798,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quick question. Where the FUCK has the Teamsters Union been this whole time? It's like they are in on it, or something.",
                "author": "BlackJack1776"
            },
            {
                "raw_content": "**Archive Link**: https://archive.ph/b86aZ **Direct Link**: https://www.breitbart.com/politics/2025/10/12/truckers-gain-wages-as-ice-detains-highway-illegals/ **Pepe Link**: [🐸👌](https://static01.nyt.com/images/2016/09/28/us/28xp-pepefrog/28xp-pepefrog-superJumbo.jpg)",
                "author": "MythArcana"
            },
            {
                "raw_content": "Arizona, Idaho, Nevada should all setup checkpoints with ICE detachments to nab the pajeets and wetbacks getting bullshit CDLs coming out of the left coast.",
                "author": "BoomShtick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Until Judges are held accountable it won’t stop.",
        "score": 632,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# GUANTANAMO # BAY",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "name the judges",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "While I know some of these are state level judges, but it’s a glaring problem in the federal judiciary that a judge who consistently issues bad rulings is effectively unable to be removed or otherwise held accountable",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Deported back to Colombia",
        "score": 1451,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Afuera, bitch!",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "What a treat, now she’ll get the benefits of socialism from Colombia’s commie president Edit: no sauce, may be fake news",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Good fucking riddance. Should've been shipped to to CECOT for doxxing ICE agents, would've have been more fitting.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Loomer: \"60 minutes dedicated their episode to crying about me tonight. They cried about my vetting in support of President Trump because they’re mad the NSA was purged of a Biden loyalist who undermined our national security & allowed China to penetrate top secret DOD cyber systems. 🤡\"",
        "score": 1077,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">DOD DoW",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "That’s winning",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "Laura ain't perfect but she is out there fighting for the MAGA agenda constantly. If we could replace our RINO's with copies of her, we would fix our country.",
                "author": "AVeryNakedMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Several more arrests made at the ICE facility in Portland after subjects defied lawful orders to vacate federal property and fought federal agents",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love these videos! Beating the shit out of leftards is so satisfying to watch.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "If they're with Antifa, charge them with Domestic Terrorism.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Landwhales down! Landwhales down!",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 Zohran Mamdani’s wife is praising Hamas propagandist Saleh Al Jafarawi, also known as Mr. Fafo, who campaigned for Hamas. According to reports, he was killed in Gaza by Palestinians that oppose Hamas.",
        "score": 1013,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apparently there are already large gaza city infighting battles going on between different \"factions\". Can't take the tribe out of tribal people.",
                "author": "Litterboxer1"
            },
            {
                "raw_content": "FAFO Fafo",
                "author": "Feddny"
            },
            {
                "raw_content": "Zohran has ties with Hamas. Yuge red flag. This Mayoral election is a joke New York City. They let things fall to the bottom of the barrel, the scum, the slime at the very bottom. All this election does is tell me that groups of terrorists can buy a political position in America and they can run the most insane candidates. That's what voters should be disgusted about. His campaign needs to be reviewed, his donations, his trips to Uganda, his networking with Hamas, and most of all...all the illegals that in NYC they are allowing to vote.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This. I shared a bedroom with my brother until high school when our family could afford a 4 bedroom house. My parents adhered to a budget. We ate at restaurants a few times a year for birthdays.",
        "score": 820,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, no they’re not “much fancier and bigger”. Boomers had 1200+ sq ft 3-4 bedroom houses on the regular. $40k a year afforded u a middle class home with room for several kids and money left over for toys like jet skis and vacations. Pure fucking gaslighting. Also, why are all those boomer homes selling for $400k+? Those tiny little houses🤣🤣🤣. GTFO with this bullshit",
                "author": "BoyPuzzy4me"
            },
            {
                "raw_content": "Only have to work harder because every single liberal policy suppresses wages. Labor pool doubled after women were encouraged to join the workforce. Labor pool doubled when immigration was reformed. Labor pool doubled when the borders were neglected and illegals flooded in. Labor demand halved with global slave trade in China. Labor demand halved as factories automated with robotics. Labor demand halving with Artificial Intelligence.",
                "author": "utfanx2"
            },
            {
                "raw_content": "This video is absolute and complete horseshit, and the gaslighting is off the fuckin' charts. Look, I worked as a temp in the UAW in a parts distribution warehouse in the mid-late 90's. I worked with guys who got hired out of high school in the 70's. Almost all of them had a stay-at-home or part-time working wife, two cars, a mortgage nearly paid off and 2-3 kids in college, plus either a boat and/or a second vacation property. They had all of that simply for just showing up every day and picking fucking parts off shelves and packing them during an 8 hour shift. I could train fucking chimps to do their job. And the kicker, these boomer assholes would not only approach me to tell me to slow down because I was making them look bad, but at the same time they'd ask me to pick their parts lists so they could fuck off and not work. I'm sorry, but inflation and this feminist dual income dogshit is the problem and it has been foisted upon us by design. \"Homes and shit are better now and cost more because of it.\" STFU and GTFO with that horseshit Stossel you fuckin' shill.",
                "author": "Build_Back_Bankrupt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The TPUSA halftime show looks like it'll be one of the best concert lineups in US history",
        "score": 1561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I will say this is pretty cool. But guys, it is even more simple than this. Just stop. watching. Sportsball.",
                "author": "SteelBallRun1890"
            },
            {
                "raw_content": "This is how you do it. Beat them at their own game.",
                "author": "OneMoreHome"
            },
            {
                "raw_content": "cool, but i'm still not supporting sportsball",
                "author": "kek-is-tan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Kings Protest Update: Funding, Training, and Underlying Hypocrisy. The \"No Kings 2.0\" protests on October 18—aiming for 10M+ participants across 2,100+ U.S. events—remain a decentralized push by progressive coalitions like Indivisible, ACLU, MoveOn, and Public Citizen against Trump's \"authoritar",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck No Kings. All they ever did was give us King Obama and King Biden, now they can fuck right off.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "You are not getting anywhere near 10M you be lucky to get 100K. Then again the media will try to make it bigger then its actual size.",
                "author": "DT170x"
            },
            {
                "raw_content": "Support a counter protest and make the commies go nuts. The theme would be.... \"TRUMP FOR EMPEROR, KING ISN'T GOOD ENOUGH\"",
                "author": "JetJocky"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Notice the difference",
        "score": 1406,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump also drives his own golf cart.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "We have the biggest umbrellas, and it's not even close. That I can tell you.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Difference is Trump would have shared the umbrella with a Marine, if he was close to him.",
                "author": "Barkley18"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says he might speak to Putin \"I might say, look, if this war is not going to get settled, I'm going to send them tomahawks.\"",
        "score": 1092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why the fuck are we getting involved in this?",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "I did not vote for that.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Pepe farms remembers when Trump said he’d settle this war in a few days.",
                "author": "Genericwhitemale"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohran Mamdani’s mayoral campaign took illegal foreign donations",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This fucker shouldn’t even be in the USA. USA has no place for Muslims. Islam is a religion of slavery, terror, and pedophilia.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "[New York Post: Mamdani mayoral campaign took in $13,000 in illegal foreign donations, records show](https://nypost.com/2025/10/12/us-news/mamdanis-mayoral-campaign-took-in-13000-in-illegal-foreign-campaign-cash-records-show/) Lefty socialist and mayoral frontrunner Zohran Mamdani’s campaign quietly took in nearly $13,000 in potentially illegal foreign donations — including one from his mother-in-law in Dubai, The Post has learned. At least 170 of the nearly 54,000 contributions to the leading Democratic candidate’s campaign came from donors with addresses outside the United States, an examination of NYC Campaign Finance Board records found. Only US citizens or permanent legal residents are allowed to contribute to political campaigns and political action committees under federal, state and city law, and candidates are expected to return any of the illegal donations. Violators who knowingly accept foreign donations could face hefty fines and imprisonment. But so far, the campaign has failed to return 88 of the foreign donations worth a total of $7,190, records showed. Mamdani’s campaign has brought in $4 million in private donations, scored another $12.7 million in public matching funds, and with less than a month to go before election day, has nearly $6.1 million in hand. His campaign issued a statement Saturday saying “we will of course return any donations that are not in compliance with CFB law” after being provided a detailed breakdown of the 88 donations yet to be returned. A campaign spokesperson, however, declined to clarify why so many foreign donations are still in Mamdani’s war chest. **Curtis Sliwa's Response** “Where there’s smoke, there’s fire, so I would be very concerned,” said Republican mayoral candidate Curtis Sliwa, upon learning of the foreign money coming into Mamdani’s campaign. “There is probably a lot more in terms of foreign money.” Two months ago, Sliwa, during an interview with Fox Business, called on the US Department of Justice to investigate his suspicions that Mamdani is being aided by difficult-to-trace “dark money” illegally being funneled into super PACs through foreign nationals. “It’s very problematic, not just for Zohran Mamdani, but anybody who has these kinds of PACs, because it’s a license to illegally funnel money,” Sliwa told The Post. “And foreign countries know you don’t have to go to war against America. All you gotta do is manipulate the election.” Most of the foreign donations started coming in June in the lead-up to the Democratic primary, in which Mamdani scored an upset victory over New York City Mayor Eric Adams and former Gov. Andrew Cuomo. Tech professionals, doctors, university professors, students and retired teachers made up the bulk of the foreign contributions, with some pledging as little as $1 to the campaign of the Democratic socialist, and as much as $2,100, records showed. **Some of the foreign donors revealed** - Among the biggest donors was James Furlaud, an environmental scientist at Australia’s University of Tasmania, who pledged $2,100 to the campaign. Furlaud studies the effects of climate change on forests and how it could lead to fires, according to his published academic work. He did not return a request for comment. - Ada Diaz Ahmed, who is described as a Dubai-based investor, donated $2,100 to the campaign in September, records show. - Jun-Dai Bates Kobashigawa, a software developer who lives in Montreal, Canada, donated $250 to the campaign in July. Kobashigawa, who works for GoDaddy, grew up in San Francisco, and attended Bard College in Dutchess County. He did not return a request for comment. - Ugur Macit, who lives in the town of Muhlheim am Main in Germany, also donated $250 to the Mamdani campaign in August. Macit is a software engineer who studied computer science at the University of Dusseldorf, according to public records. He could not be reached for comment. - Ahmed Enbya, a physician in Calgary, Canada, donated $100 to the campaign in September, filings show. He could not be reached for comment. Most of the contributions to the socialist’s campaign have come from outside New York City, city filings revealed last month. The frontrunner took in a total of $1.05 million over the last several weeks — more than double the $507,000 raised by Cuomo. The city’s Campaign Finance Board declined comment, saying it is in the process of auditing all campaigns this election cycle citywide.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "He's still running. So who cares? > If cheating works, and has no consequences... ***Cheat!*** --Taqqiya",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SO GLAD HE CLEARED THAT UP!!!🤣🤣🤣",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't stand even looking at this corrupt faggot",
                "author": "Sparks1017"
            },
            {
                "raw_content": "*Big Mike has entered the chat*",
                "author": "TEXinLA"
            },
            {
                "raw_content": "### FUCK OFF BARRY",
                "author": "Liberals_R_Idiots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ABC abruptly cut the feed of Vice President JD Vance & went to commercial because Vance pushed back against George Stephanopoulos.",
        "score": 1487,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So we're still talking and debating people that want us dead. Neat. Suicidal in the long run. But neat.",
                "author": "Zhongda"
            },
            {
                "raw_content": "Banning the sitting president's social media accounts...cutting off the feed of the sitting vice president. All because they were losing the arguments. Communists don't win in open debates - until they SILENCE or KILL the opposition. This goes to show that losing the debate doesn't mean SHIT for the losers and winning a debate doesn't help the winners. There's no talking our way out of this. Action.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Stop giving them interviews",
                "author": "Votingnerd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Delusional Retard says what?",
        "score": 1200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The same Biden that mishandled the Ukraine war and left all of our military equipment in the middle east?",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "Hey Tony Blinkin..., is that Biden Gaza Plan in the room with us now?",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "Fuck that piece of shit. He was a band practice when October 7th was happening.",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You can't declare Antifa a terrorist organization without declaring the same of their parent organization; the ADL.",
        "score": 596,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You bouta get called somethin'",
                "author": "crashdaddy"
            },
            {
                "raw_content": "The Antifa Defense League..",
                "author": "Magus"
            },
            {
                "raw_content": "It's almost as if ...",
                "author": "snakeoil"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now that Jews have gone away, Muslims are now killing one another",
        "score": 945,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only we could isolate the consistent factor in all the killings!",
                "author": "iirc_life"
            },
            {
                "raw_content": "\"Wait, Hamas is made of 'arab'-looking jews?\" 🧃👨‍🚀🔫👨‍🚀",
                "author": "OGpsywar"
            },
            {
                "raw_content": "What are libs gonna say now that Israel is gone? *Muslims are committing genocide against one another!* Yeah and? Everyone with a brain already knew this",
                "author": "here2red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats: \"Conservatives need to tone down their political rhetoric.\" Chuck Schumer:",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Tyrannical > Autocratic > Dictatorship Buzz Word, Buzz Word, Buzz Word",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "Sounds like Schumer should be getting a 3am raid. What he just said was a clear cut case of inciting violence and sedition. It doesn't get any more clear cut than this. Trump could easily justify having the FBI blow off his front door and drag him out like Saddam Hussein.",
                "author": "preferredfault"
            },
            {
                "raw_content": "They are all full of shit.",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What happened to neuromorphic computing? Is it a dead end?",
        "score": 21,
        "text_content": "Is neuromorphic computing a dead end? What about digital neuromorphic computing? I understand that in the digital format there are advantages over analog, like training an AI in GPUs and then replicating it in the neuromorphic processor instead of having to train it again.",
        "comments": [
            {
                "raw_content": "Still under development. The problem is the model of a bunch of variable signal spikes just isn't as easy to make work, from a physics standpoint, on semi conductors as an \"on/off\" switch with wiring in between each little switch. Maybe it'll never really get anywhere, at least on silicon or it's close replacements.",
                "author": "Silent-Selection8161"
            },
            {
                "raw_content": "No clue what the consensus is, but I saw a couple videos recently from the chief scientist at Nvidia who appears disillusioned with neuromorphic & analog approaches due to fundamental energy efficiency problems. Links: https://youtu.be/gofI47kfD28?t=1995 (problems w/ spiking) and https://youtu.be/HtrR1HRZIGA?t=2130 (problems w/ analog)",
                "author": "PolishTar"
            },
            {
                "raw_content": "I don't have technical knowledge on neuromorphic computing (NC) but occasionally listen to a podcast (EETIMES current) dedicated to frontier research on the field. My impression is large scale application of NC is still working on the proof of concept, for example a recent nature article show (prove?) that NC is superior in large scale Monte Carlo simulation. It is commonly quoted that NC has energy or performance advantage on some task based on some small scale calculation, but they generally lacks of rigorous theoretical framework to prove which types of works they are good at. There're good progress in scaling up number of neurons in NC, but the software ecosystem is still very immature, there's missing gap between low level and high level language so it is difficult to bring researchers worldwide to work on the ecosystem. But certainly not a dead end since not much resources (e.g. compare to quantum computing) have been given to it anyway, and it seems like an exciting and rapidly expanding field from academic perspective. And I am pretty sure the large scale calculation of NC were all done in digital chips.",
                "author": "Consistent-Horse-273"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Saying “Goodbye” to one G-15, and “Hello” to Another!",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Not me…okay, maybe a little bit.",
        "score": 79,
        "text_content": "Artist: Tommy Siegel",
        "comments": [
            {
                "raw_content": "That's sad, actually",
                "author": "Thumaz"
            },
            {
                "raw_content": "Sometimes i forgot how many kids are on this sub until stupid shit like this painfully reminds me.",
                "author": "Scheefgaan"
            },
            {
                "raw_content": "Is nintendo switch a terrible influence on kids like vaping and pornhub?",
                "author": "Xadia_wonderer_305"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 HDR. what are they doing?",
        "score": 169,
        "text_content": "I’m half convinced nintendo barely knows what they are doing with HDR. The calibration system is so generic and confusing. What happened to their “plug and play” thing? Not to mention the bug that activates it despite being on a non-HDR tv. BOTW’s implementation is barely noticeable But the handheld.. they implemented a screen that barely has enough NITs to provide a somewhat accurate HDR experience and they even allow to change the brightness which is something you shouldn’t be able to do with HDR on. it really feels like some checkmark they had to achieve to make it more of a next gen Switch. it’s weird from a company so obsessed with polish and details",
        "comments": [
            {
                "raw_content": "You can't really do plug and play type of calibration with HDR as every tv model has different specs unless the system has a database with thousands of tv's and their specs. The calibration tool isn't perfect but it's good enough as long as you have a modern tv with hgig support, When it comes to games we still don't have a single game from Nintendo that was developed with Switch 2 in mind from the start so that probably explains the lack of proper HDR for now.",
                "author": "Sandels2200"
            },
            {
                "raw_content": "You need to enable HGIG assuming your TV has that option",
                "author": "sendblink23"
            },
            {
                "raw_content": "HDR on BOTW, Mario Kart World and Donkey Kong Banaza looks amazing when done right, especially on one particular late stage Bananza Just turn on HGIG and properly tune the peak 2 percent window with proper clicks and max out brightness on second screen. i have a 55QM7K and use 152 for 1600 nits peak HDR Nits mostly follow this, except the paper white, im not in a dark room: https://youtu.be/_BmkMcaqpX8?si=h1Ncp42UwE74T4c9",
                "author": "desanite"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "for all flipcase enjoyers they've finally made one for the switch 2",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "just got mine from \\*emu but can also be bought from \\*liExpress. it's pretty solid and quailty is on par with genki and the offical flip case. It does add a bit more weight to the device that some might find uncomfortable. The case also has egro bumps and a way better stand solution compared to genki's terrible OLED flip case. https://preview.redd.it/db3yfn22htuf1.jpeg?width=4032&format=pjpg&auto=webp&s=3d8ce4b77b67f9d82b90cd9d496c4faecac4e663",
                "author": "Nexcell"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch joy con recently took a fall and the stick snapped off. But now it doesn’t detect when connected to system?",
        "score": 19,
        "text_content": "And sometimes it will intermittently charge when I take it off and put it back on, while still reading as disconnected somehow.",
        "comments": [
            {
                "raw_content": "When you dropped it, it must have broken.",
                "author": "Williekins"
            },
            {
                "raw_content": "Probably disconnected the cable connecting to the port on the rail. Honestly, buy a new joystick. It'll most likely come with tools, and the Switch 2 joycons, while complex, aren't really that delicate internally. Of course, I'm bias since I've taken mine apart plenty of times. Just a good tutorial and some sorting will help you out if you go with installing a new stick",
                "author": "Freak_Axident"
            },
            {
                "raw_content": "Wow I guess why?????",
                "author": "Drezus"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "HDR calibration issue",
        "score": 54,
        "text_content": "whatever i do, i can’t get the right pattern to disappear. i’ve already checked if HDR is enabled in the display settings",
        "comments": [
            {
                "raw_content": "Try this guide: https://youtu.be/_BmkMcaqpX8",
                "author": "SirRidley"
            },
            {
                "raw_content": "You have to turn off all dynamic tone mapping and dynamic contrast stuff on your tv. Then you will be able to do it.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "Turn on HGIG. Google how to turn it on for you TV",
                "author": "bigparsnipenjoyer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So how does the new account system work exactly when owning 2 consoles?",
        "score": 33,
        "text_content": "My buddy owns a OLED that he wants to keep and keep his account on since it has 1tb full of games on it. If he buys a switch 2 can he have his games and account on both at the same time?",
        "comments": [
            {
                "raw_content": "yep, either console can grab a game. once it does, the other console can't play it until it grabs it back, which disables it on the first console. you need to have both switches together once to enable the sharing setup",
                "author": "ijblack"
            },
            {
                "raw_content": "Think of it as if all your digital games are actually physical games The digital game cards just have to be transferred between the one switch and the other whenever you want to play it on one switch or the other. It's annoying but you can play your games on both.",
                "author": "ShowGun901"
            },
            {
                "raw_content": "Yes but with the new virtual game card system he’ll have to re log in on his OLED and go to user settings> online license check. So one switch will have to be an “at home only” switch.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pro controller starting to come apart",
        "score": 10,
        "text_content": "I'll preface this by saying I have sweaty hands. Has anyone else's Switch 2 pro controller started coming unglued on the top? I have to slightly push it back into place every time I pick it up. The fact that there's no screws on the face and the glue seems to be on the cheaper side, I worry this controller won't last very long. Is there any fix for this that doesn't violate warranty?",
        "comments": [
            {
                "raw_content": "I would submit it to Nintendo too get repaired under warranty",
                "author": "Fat_Stacks1"
            },
            {
                "raw_content": "It makes no sense why they changed it to glue vs the NS1 Pro Controller which was the easiest controller to open by simple phillips screws. OP post photos of yours",
                "author": "sendblink23"
            },
            {
                "raw_content": "Got mine a month ago, sweaty hands too. The left side near d pad is lifting ever so slightly, maybe 1mm?",
                "author": "douhua1999"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are there any Hall Effect controllers for Handheld mode?",
        "score": 1,
        "text_content": "I know about the Gamesir G8 + but I've been holding out on buying due to it's ergonomics and it being reliant on Bluetooth. Are there any Joycon 2 alternatives that are Hall Effect like the Gamesir G8 +?",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No, Target and Walmart are not removing Xbox products from their stores — as Xbox misinformation reaches new levels",
        "score": 398,
        "text_content": "Previous rumor: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1o4nuj7/thegamer_target_and_walmart_are_also_getting_rid/ Current confirmation: https://www.windowscentral.com/gaming/no-target-and-walmart-are-not-removing-xbox-products-from-their-stores-as-xbox-misinformation-reaches-new-levels",
        "comments": [
            {
                "raw_content": "Now this is hilarious, goddam. People calling their local Walmart and Targets.",
                "author": "BlackKnighting20"
            },
            {
                "raw_content": "Can we have more people running to their local stores to confirm or deny? I need to know what's up.",
                "author": "Lasti"
            },
            {
                "raw_content": "It was only 4 retailers. Nothing beyond that. Promise.",
                "author": "ayyybro123"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The entirety of Pokemon legends ZA’s Pokédex was leaked",
        "score": 172,
        "text_content": "https://xcancel.com/PokeVerse93/status/1977416117875544426 The entirety of the upcoming Pokemon game’s pokedex was leaked thanks to an early dump of the game. Additionally models of all the new Mega Pokemon and information about Unreleased mega Pokemon for the mega dimension DLC are floating around [Such As Mega Faillinks](https://xcancel.com/pory_leeks/status/1977544242861158427) and [Mega Feraligatr](https://xcancel.com/RealOhmori/status/1977506821087580177) This information also comes alongside Confirmation of Mega Heatran Darkrai and Zeraora in said DLC.",
        "comments": [
            {
                "raw_content": "I bet Nintendo cannot wait for the Switch 2 install base to be big enough to stop supporting the Switch 1 for this very reason.",
                "author": "Affectionate-Ad-4174"
            },
            {
                "raw_content": "The game has been leaked as well supposedly",
                "author": "YouGurt_MaN14"
            },
            {
                "raw_content": "Wasn’t able to access the leak, are there any NEW Pokemon, like evolutions to old Pokemon like they had in Legends Arceus? Or is the main focus solely on the Mega Evolutions?",
                "author": "computerCoptor"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGamer: Target and Walmart are also getting rid of Xbox stock",
        "score": 1309,
        "text_content": "https://www.thegamer.com/target-walmart-stop-selling-xbox-reddit-user-alleged-employee/",
        "comments": [
            {
                "raw_content": "They can't since everything is an Xbox",
                "author": "Cubelock"
            },
            {
                "raw_content": "Something tell me that Microsoft next gen xbox is going to be just a pc with the xbox logo on it like the new rog ally. So in way they're not lying when they say that the next console is still in development",
                "author": "Active_Mall7667"
            },
            {
                "raw_content": "At my local Best Buy, Nintendo and PlayStation each get an entire aisle dedicated to them and Xbox is crammed in a tiny spot among the action figures.",
                "author": "TheDragonDAFan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: Screenshots for Rare’s Everwild Unveiled, Featuring UI and More",
        "score": 330,
        "text_content": "The screenshots are allegedly from a version close to the cancellation [source](https://mp1st.com/news/screenshots-rares-everwild-featuring-ui-gameplay-details)",
        "comments": [
            {
                "raw_content": "I'm struggling to figure out why you would announce, let alone greenlight a game. That didn't have its gameplay loop figured out during its pitching/prototype phase. As I feel that huh, should probably take the biggest priority in getting a game greenlight or not.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Manifesting Microsoft seeing sense and telling Rare to make Viva Piñata 3",
                "author": "TheArcheryRaccoon"
            },
            {
                "raw_content": "Man it was so crazy seeing people speculate as to when will we see the game and it seems that even the developers didn't see much of it. That looks like a pitch for an idea.",
                "author": "adamkopacz"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The physical version of Ninja Gaiden 4 got leaked and it doesn't have the \"Internet Required\" sign on the front cover.",
        "score": 332,
        "text_content": "https://www.reddit.com/r/ninjagaiden/s/jW8R4PC4C9",
        "comments": [
            {
                "raw_content": "I believe PS5 discs come in either dual layer 66GB or triple layer 100GB. With gears of war reloaded and Minecraft PS5 version being fully on the disc, it seems that Microsoft only puts the game on the disc when it fits on the cheapest option. They are the biggest penny pinchers.",
                "author": "Stealthinater1234"
            },
            {
                "raw_content": "The game is 32 gb. Is it the Kraken Compression? Or is that just a myth? On steam it says 100 gb required.",
                "author": "Mundane-Broccoli-786"
            },
            {
                "raw_content": "Xbox's preload is 36.8GB so I hope the full build is on a disc too",
                "author": "s7ealth"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "DuskGolem: Leon is in the first person trailer from a first person perspective.",
        "score": 105,
        "text_content": "https://xcancel.com/aestheticgamer1/status/1976775421728637017?s=46&t=Cy9Zznj7jMbjVfsUzeojFw",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Jessica from RE: Revelations is in RE9. Source, I said so.",
                "author": "Chalicebzam"
            },
            {
                "raw_content": "im still waiting for my drakengard announcement dusk golem",
                "author": "senryuu-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xbox hiring gaming finance experts to 'drive transformation initiatives with urgency'",
        "score": 336,
        "text_content": "*The* [*Gaming Finance Transformation Lead*](https://jobs.careers.microsoft.com/global/en/job/1887041/Gaming-Finance-Transformation-Lead) *job listing reads:* >\"We are seeking a Gaming Finance Transformation Lead with deep integration prowess to drive transformation initiatives with urgency and lead financial process and system harmonization across Gaming studios. >\"This role will ensure seamless alignment of financial processes, systems, and reporting standards across multiple entities, enabling operational efficiency and compliance to align with business objectives.\" >Responsibilities: >Accelerate and drive financial transformation efforts for acquisitions and system consolidations, ensuring alignment with corporate policies and regulatory requirements. *Xbox is also hiring a* [*Gaming Content and Studios Finance Lead*](https://jobs.careers.microsoft.com/global/en/job/1889387/Gaming-Content-and-Studios-Finance-Lead) *that will work directly with each of the individual chief financial officers at Xbox's various divisions (ABK, ZeniMax, Xbox Game Studios, etc) to ensure proper \"alignment.\"* >\"We are seeking a Gaming Content and Studios Finance Lead to strategically unify and lead the financial vision for our first party Gaming Content and Studios (GC&S), encompassing ABK (Activision, Blizzard, King), Zenimax, and additional independent studios. >\"This role will provide a holistic perspective across all gaming studios, driving the consolidation of financial processes and systems across global organizations. >\"You will collaborate with business owners and Gaming Studio CFOs (Chief Financial Officers) to identify and resolve challenges, as well as support the President of GC&S in executive reviews. >\"By fostering seamless integration and alignment, this leader will enable operational efficiency, compliance, and transformation across our diverse gaming portfolio.\" >Responsibilities: >Develop and champion a holistic financial strategy for multi-billion-dollar gaming franchises, driving execution and accountability. >Be the central finance lead for understanding first party Gaming Content and Studio revenue forecast, and provide insights and recommendations to help the organization exceed their revenue and accountability margin goals. >Partner with studio CFOs (Activision, Blizzard, King, Zenimax, Xbox Game Studios) to optimize finance processes, identify issues, and foster cross-studio solutions. >Support executive reviews by delivering clear, data-driven insights and process clarity. ***TL;DR***: *Microsoft is hiring two finance leads to drive transformation and unify financial processes across Xbox's gaming studios, aiming to improve profitability amid rising revenue and market challenges. Upcoming strategies include ad-supported cloud gaming, next-gen consoles with PC integration, and AI-driven game development to enhance operational efficiency and growth.* Read more: [https://www.tweaktown.com/news/108187/xbox-hiring-gaming-finance-experts-to-drive-transformation-initiatives-with-urgency/index.htm](https://www.tweaktown.com/news/108187/xbox-hiring-gaming-finance-experts-to-drive-transformation-initiatives-with-urgency/index.htm) Derek Strickland Senior Gaming Editor",
        "comments": [
            {
                "raw_content": "I wouldn’t read into this - this is a standard internal finance position dressed up with fancy words to make it sound more than it actually is: developing forecasts, managing budgets and reviewing discrepancies.",
                "author": "ExcelsiorWG"
            },
            {
                "raw_content": "I can't wait till this A.I bubble pops, shit is gonna be glorious.",
                "author": "OwnAHole"
            },
            {
                "raw_content": "> Upcoming strategies include ad-supported cloud gaming, next-gen consoles with PC integration, and AI-driven game development to enhance operational efficiency and growth. None of that is in the job postings.",
                "author": "dccorona"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel XPU Manager drops Data Center Max/Flex GPU support just two years after launch",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yeah, this was one of the few times they admitted it was a failure and didn't ship at volume instead of doubling down. they've cleaned up their GPU division A LOT, hope they continue to do good work internally.",
                "author": "topdangle"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASRock confirms B850 motherboards to directly support \"Future Zen 6 CPUs\"",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Directly support or directly kill?",
                "author": "WeirdoKunt"
            },
            {
                "raw_content": "# Directly burn Future Zen 6 X3D CPUs",
                "author": "DualPerformance"
            },
            {
                "raw_content": "Why Zen6 need 64MB BIOS ROMs? Makes early adopters of B850/X870 feel bad.",
                "author": "vladi963"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Beelink SER9 Pro mini-PC with AMD Ryzen 7 H 255 review",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amazing mini-pc, just a tad out of my budget.",
                "author": "flemtone"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "U.S. Foreclosure Activity Increases Annually in Q3 2025",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yeah, my time is coming.",
                "author": "Traditional_Soup_208"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "If you had to predict the annual appreciation % over the next 10 years what would it be?",
        "score": 10,
        "text_content": "For context, my house doubled in price the years after Covid, but only appreciated 2% this past year. Do you think: A. Prices will hover around this price for a long time. B. There’s room for them to climb higher (especially if interest rates change) C. The market can’t support it and they’ll come down.",
        "comments": [
            {
                "raw_content": "Could you afford to re-buy it today at today’s price and interest rates? Would you if you could? Mean reversion would suggest its price will stay flat or decrease until it’s at the same relative cost to incomes as when you bought it. Inflation took about 25% of the increase in those years if not a bit more but it either drops at some point or stagnates until wages align.",
                "author": "Mustangfast85"
            },
            {
                "raw_content": "Housing generally tracks inflation long term. It also generally mean reverts.",
                "author": "ispb2"
            },
            {
                "raw_content": "Flat for a bit and then back to tracking normal inflation.",
                "author": "niftyifty"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "DC Comics won’t support generative AI: ‘not now, not ever’ | ﻿President Jim Lee says that fans value authentic human creativity in storytelling and artwork.",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not ever. Now that's a cute statement.",
                "author": "Heymelon"
            },
            {
                "raw_content": "Just like the decades when anime studios said they will never go digital",
                "author": "Sixhaunt"
            },
            {
                "raw_content": "I don't expect that market giants change themselves. New giants with AI art will emerge, and the remaining is left to the market.",
                "author": "ignite_intelligence"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "RobotGym's Qijia Q1 is a robot that also functions as a wheelchair for elderly care and can even warm your food in a microwave",
        "score": 333,
        "text_content": "https://x.com/CyberRobooo/status/1977200692667597282 Humanoid robots are becoming companions for the elderly in their later years. Shanghai RobotGym's Qijia Q1 features a unique and practical design: a human plus a wheelchair. As a daily assistant and companion for the elderly, it can help with wake-up calls, medication reminders,",
        "comments": [
            {
                "raw_content": "out of context: https://preview.redd.it/ai8sc8rdvpuf1.png?width=420&format=png&auto=webp&s=8e4277304d2800da05de363aceb46b15e0984750",
                "author": "borntosneed123456"
            },
            {
                "raw_content": "How crazy is this no idea if teleoperated just for teasing it",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "Howard from Big Bang theory would make the first order.",
                "author": "blasternaut007"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Neuralink co-founder presented a new theory of consciousness last week in Tokyo",
        "score": 101,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is not an answer to the 'had problem'. Perhaps it isn't meant to be. \"and I suspect this creates qualia\". \"and this field might be qualia\". No further explanation other than this. He may, or may not have a good explanation of the *contents and mechanisms* of the brain, that's not my area, but I can say with confidence that he has nothing to say here about the nature of qualia. He talks about the mechanics of brains, but is silent on why there is something that it is like to be a brain.",
                "author": "Rain_On"
            },
            {
                "raw_content": "If I can't tell the difference between a conscious machine and a non-conscious machine merely mimicking consciousness, then it doesn't fucking matter if it's \"truly\" conscious or not. The end result is the same. Thoughts don't matter, only behavior and actions.",
                "author": "Megneous"
            },
            {
                "raw_content": "Yup. And then there's this: [https://www.reddit.com/r/singularity/comments/1o3v25r/geoffrey\\_hinton\\_says\\_ais\\_may\\_already\\_have/](https://www.reddit.com/r/singularity/comments/1o3v25r/geoffrey_hinton_says_ais_may_already_have/) Suddenly consciousness is more important than it used to be 2 years ago, to non-idiots.",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unlimited duration Sora2 video Test",
        "score": 179,
        "text_content": "use Template: [https://sjinn.ai/templates/d5db7e33-4ef6-4c6f-96be-b7e0a98f0706](https://sjinn.ai/templates/d5db7e33-4ef6-4c6f-96be-b7e0a98f0706)",
        "comments": [
            {
                "raw_content": "Unfortunately the “workflow” doesn’t preserve audio consistency at all",
                "author": "ethotopia"
            },
            {
                "raw_content": "He did in fact, not nail it",
                "author": "JynsRealityIsBroken"
            },
            {
                "raw_content": "That’s pretty fucking terrible.",
                "author": "MyDearBrotherNumpsay"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "@Stanford just proved you don’t need to fine-tune an AI model to make it smarter: +10.6% over GPT-4 agents w/ zero retraining",
        "score": 202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: Better context management and organization into notes basically. Grows over time instead of compressing context over time like older methods which causes the loss of valuable details. It intelligently decides what to keep or remove. Anthropic probably did a similar thing with claude code. While this seems like an obvious thing to do I guess it was hard to make an algorithm that can determine what is actually useful information. Impressive stuff, looks like we are slowly solving context.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "That is certainly encouraging. This looks like a smarter way to context engineer. If you combine it with post processing and the other \"low hanging fruit\" of model development I am sure we'll see far more affordable gains. What is easy to miss is that for the actual *use cases* of stuff like this taking in data that exists in a very specific environment like a lab or a human body, and giving it this kind of context engineering would see far more significant gains. Mixture of Experts need not be written off quite yet if context engineering gains so much.",
                "author": "DHFranklin"
            },
            {
                "raw_content": "Lawyers are going to make amazing prompt engineers once they understand where some of this is going.",
                "author": "nunbersmumbers"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Cache-to-Cache: Direct Semantic Communication Between Large Language Models\"",
        "score": 70,
        "text_content": "[https://arxiv.org/abs/2510.03215](https://arxiv.org/abs/2510.03215) \"Multi-LLM systems harness the complementary strengths of diverse Large Language Models, achieving performance and efficiency gains unattainable by a single model. In existing designs, LLMs communicate through text, forcing internal representations to be transformed into output token sequences. This process both loses rich semantic information and incurs token-by-token generation latency. Motivated by these limitations, we ask: Can LLMs communicate beyond text? Oracle experiments show that enriching the KV-Cache semantics can improve response quality without increasing cache size, supporting KV-Cache as an effective medium for inter-model communication. Thus, we propose Cache-to-Cache (C2C), a new paradigm for direct semantic communication between LLMs. C2C uses a neural network to project and fuse the source model's KV-cache with that of the target model to enable direct semantic transfer. A learnable gating mechanism selects the target layers that benefit from cache communication. Compared with text communication, C2C utilizes the deep, specialized semantics from both models, while avoiding explicit intermediate text generation. Experiments show that C2C achieves 8.5-10.5% higher average accuracy than individual models. It further outperforms the text communication paradigm by approximately 3.0-5.0%, while delivering an average 2.0x speedup in latency. Our code is available at [this https URL](https://github.com/thu-nics/C2C).\"",
        "comments": [
            {
                "raw_content": "AI2027 projected neuralese to 2027 *\"With the help of thousands of Agent-2 automated researchers, OpenBrain is making major algorithmic advances. One such breakthrough is augmenting the AI’s text-based scratchpad (chain of thought) with a higher-bandwidth thought process (neuralese recurrence and memory).\"*",
                "author": "AcrobaticKitten"
            },
            {
                "raw_content": "Cool",
                "author": "No_Novel8228"
            },
            {
                "raw_content": "holy shit",
                "author": "Gamerboy11116"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Biohybrid leaf mimics photosynthesis to turn CO₂ and sunlight into useful chemicals",
        "score": 38,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    }
]