[
    {
        "post_name": "Once you realize this everything makes sense…",
        "score": 444,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All Dems and 75% of Republicans.",
                "author": "Bubbahax"
            },
            {
                "raw_content": "Democrats are an enemy to humanity and society. They work for Satan.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Add almost every politician and file this under No Shit.",
                "author": "gaijin_ronin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. CH-47 helicopters seen flying over Caracas, Venezuela, after explosions, reports.",
        "score": 264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When did this become a central pillar of MAGA? I don't understand why this is the focus right now. What happened to draining the swamp? Who thought this term was going to be war with Venezuela and possibly Iran and covering up Epstein? Isn't that the opposite of what was promised? No more new wars, drain the swamp?",
                "author": "CrazyPope"
            },
            {
                "raw_content": "The only way I could agree with this is if it has something to do with election fraud or illegal immigration. Loins girded for disappointment.",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "I'm all for attacking drug cartels in our hemisphere since they directly are invading our country. There's not a war. So many people persistently overreact every time we drop bombs under Trump, but I never see war out of it. I just wish it wasn't only Venezuela we are after. It should be every drug vessel and cartel member. But sure take the oil I guess.",
                "author": "DatabaseCentrals"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Explosions detonating in Venezuela's capital of Caracas, reports.",
        "score": 233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does this have to do with grocery prices and unaffordable homes and $38T debt?",
                "author": "Snooptwo"
            },
            {
                "raw_content": "Lindsay Graham is loving trump",
                "author": "Ok_Bro"
            },
            {
                "raw_content": "Whats the AIPAC angle?",
                "author": "BidensPrisonWallet"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "9 years ago Pete Hegseth went to Minnesota to check why is the Somali community is a ground zero for ISIS",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "because daycares fund ISIS",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Low IQ black african muslim. Check Yup thats all the evidence required.",
                "author": "CheeseAndOnion"
            },
            {
                "raw_content": "I like Hegseth so much! 😎",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Suspected US Apache attack helicopters seen TOTALLY DOMINATING the skies above Caracas, Venezuela while explosions ring out",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one voted for this. This isn't about drug running. This is a clear regime change attempt, no different than the past half century of American foreign policy. I'm okay with standing on business, but this is not that. He became a part of what every decent citizen hates. Fuck.",
                "author": "getup"
            },
            {
                "raw_content": "I voted for surgical strikes against Narco terrorists smuggling deadly fentanyl into the US (and likely much more) Trump made a line in the sand, the Venezuela narco controlled government crossed the line, and Trump is showing the WORLD what happens when you do that. This isn't a war, this is pissing on a fire in your backyard before it reaches your home.",
                "author": "DemPanicAtTheDisco"
            },
            {
                "raw_content": "Good, fuck 'em. We've tolerated the presence of communism in our own backyard for way too long. Purge North and South America of all Chinese influence, purge it of all communism.",
                "author": "SemperFidelis231"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama-appointed Judge Boasberg — the activist who keeps blocking Trump at every turn — just REFUSED to show up for tomorrow’s Senate hearing on out-of-control judges. That’s not accountability. That’s defiance.",
        "score": 1014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Contempt of congress?",
                "author": "utfanx2"
            },
            {
                "raw_content": "If Mike Johnson refuses to impeach him...INSURRECTION ACT!",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Subpoena him and call for arrests if he doesnt show like they did but of course it wont happen because Uni-Party.",
                "author": "HankScorpio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Journalists in Fulton County, Georgia, have uncovered a massive homeless ballot harvesting operation by Democrats where single addresses are being used to register thousands of homeless people to vote via a Soros backed NGO. (Biden “won” Georgia by 11,000 votes.)",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "collecting votes to overthrow our election and install their son of bitch lapdog .. like biden ... it's treason... and they get a pass cause no damn officer willing to put the cuff on these democrat officials.. its like the MN fraud cause.. it took one kid to expose them.. and we need one officer to arrest these corrupt fuck and charge them to ignite fire storm we all wanted... the destruction of the demon rats regime",
                "author": "cherbui"
            },
            {
                "raw_content": "Im so glad we get to learn about things and then have nothing happen to the crooks",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "It's never going to end because Republicans won't fight it. Kemp is definitely part of the problem, and Ruby Freeman still owes us 20 years in the slammer.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The 9th Circuit just STRUCK DOWN California's draconian ban on open carry of firearms due to its unconstitutionality",
        "score": 1209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Miracles exist.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "It's very simple: they take your guns, you generously give them your bullets.",
                "author": "knnbccb"
            },
            {
                "raw_content": "My favorite all time comment from a lefty loon on open carry was some nit-wit who said that if they see someone carrying, they were going to take their weapon from them and hold them at gunpoint until the police came. My thought was this: that is an excellent way to end up with a few more holes than one was born with.",
                "author": "RoninIV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dumbass liberals in Canada",
        "score": 687,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The greens no matter in what country are absolute retards. Never go full retard.",
                "author": "Roadpower"
            },
            {
                "raw_content": "Their self-satisfaction and arrogance will keep them warm through the winter months.",
                "author": "seeling0"
            },
            {
                "raw_content": "100W Kek.",
                "author": "Constitution_1788"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Kaohly Vang, who admitted to being an ILLEGAL ALIEN, has just been sworn in as Mayor of St. Paul, Minnesota “I am illegal in this country. My parents are illegal here in this country,” Vang said.",
        "score": 859,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ummm, Tom Homan, you hearing this shit? WTF?",
                "author": "AssPhixEAtion627"
            },
            {
                "raw_content": "This is from JUNE of last year.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "She's a legal citizen who also happens to be a moron and dreamt up this scenario where she was trying to say she was the same as the illegal aliens the last few year who were invited, illegally, into our country by her and her fellow Dems. She really does sound like a low-IQ mid-wit at best, but sure, she'll make a great mayor of St. Paul, the capital of Minnesota. Side note, I believe Hmong people test on the lower spectrum for Asian populations. “*I tell you this story because I want you to think about who it is that you are calling illegal,” Her told House Republicans on the floor. “My family was just smarter in how we illegally came here. We had more privileges and more ability, which is why we came here in that way.*”",
                "author": "4886Battery"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "... could US-AID have just been the distraction from this?",
        "score": 1109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So what they're saying is... the local democrats are part of the fraud and are using the imported Somalis to steal the state. That's what this is an admission of.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "I thought they were broke. Where did the money come from?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Dear u/greatpumpkin please post a link",
                "author": "MyNameIsTaxpayer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": ".",
        "score": 589,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest some fuckin people Start with Walz and Ilhan",
                "author": "Merica4EVER"
            },
            {
                "raw_content": "Prime Michael Jordan can't save Chicago now.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Chicago here, please send help...",
                "author": "rastren"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHITE HOUSE RELEASES FULL ATTACK PLAN TO DISMANTLE MINNESOTA FRAUD EMPIRE",
        "score": 391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Walz or someone high up in the food chain doesn't get arrested ... don't get excited. 🙄",
                "author": "drmrboy"
            },
            {
                "raw_content": "MN is nothing compared to NY and CA.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "I just want to see arrests on a live stream.",
                "author": "iamstadter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Database Searches Show Somali Fraudsters Funding Dem Politicians with Taxpayer dollars",
        "score": 999,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They steal our money through fraud. Then they push their own candidates through with that money, making it easier to commit more fraud. They get to enjoy life and live the American dream while we pay for it. All the while screaming racism and islamophobia if anyone notices.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "How do you fight a system that is supported by the money taken from your own pocket by force.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "funding dems with any kind of money is treasonous",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hunting Ducks",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's like the game, but they eat the laughing dog too.",
                "author": "dc53dc53"
            },
            {
                "raw_content": "It's weird to think back when duck hunt came out and we are looking at like this technology is awesome.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "duck lives matter",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Austin TX is now back to pre-pandemic apartment rents. Down 21% from peak in summer of 2022. (Things are starting to turn around.)",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Austin, TX was turned into a shit hole. The swarm of locusts leaves a path of disaster.",
                "author": "Patriot17TN"
            },
            {
                "raw_content": "Austin is still a cancerous leftist cyst on the state of Texas.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "**Caution**: all the CA refugees have bought their homes and have settled in.",
                "author": "CMDRConanAAnderson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California passed a bill to seize #Bitcoin left idle on exchanges. After 3 years of inactivity, assets can be taken by the state under 'Unclaimed Property' laws.",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How many bitcoin exchanges have been in business for 3 years without disappearing and stealing all customer money?",
                "author": "fskfsk"
            },
            {
                "raw_content": "Anyone keeping any assets in California needs to have their head examined.",
                "author": "Datamancer"
            },
            {
                "raw_content": "That is an overreach from California that affects all states. This should be challenged and the California government taken to court.",
                "author": "Aambrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We now have clear evidence that the COVID-19 mRNA shots have crippled the reproductive capacity of humanity. [Crimes against humanity must be punished!]",
        "score": 1048,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now you know why they forced the vax on citizens while simultaneously opening the border to unvaxed Replacement migration",
                "author": "live3ordye"
            },
            {
                "raw_content": "The majority of those who took it are people who have jobs. Primarily white. The majority of those who took it that did not have jobs. White liberals. White genocide. Guess who didn't take it and was not required. 16 million brown invaders crossing our border. Replacement.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "And most of us here knew this the week the shots were issued, so where are the fucking arrests? Oh, wait. Pam Bondi was a corporate attorney for Pfizer, never mind.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Where are our Republican representatives with all of this fraud? I see a couple posts on X, but that's it.”",
        "score": 1135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're scrambling to destroy evidence that shows they were just as involved as the democrats.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "They're in on it...",
                "author": "Wizard_Glick"
            },
            {
                "raw_content": "They're enjoying their kick backs",
                "author": "Jthenk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stop \"laying\" about Somalia and \"lear\" the truth.",
        "score": 1356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone want to bet the Somali Embassy in Serbia is a daycare?",
                "author": "raptormissle"
            },
            {
                "raw_content": "Somalia is such a joke. Imagine the traitors who brought them to America. Disgusting",
                "author": "MagaJay02"
            },
            {
                "raw_content": "somalians are too stupid to be allowed to live. They're an anchor on not just whites, but all humans.",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Corsair is reportedly canceling DDR5 RAM orders due to \"pricing mistake,\" offering expired coupon codes as an apology",
        "score": 587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeahhh I am part of this canceled order. I replied to the email and they said that the codes are actually good until the end of the year. Still kinda blows as I thought I got a decent priced RAM kit for my build",
                "author": "scene_missing"
            },
            {
                "raw_content": "To be fair they immediately corrected the expiration date. Still sucks though",
                "author": "tennisjugador"
            },
            {
                "raw_content": "I mean it looks like they are now giving people a 40% off coupon to use on RAM which would almost bring it back down to a reasonable price.",
                "author": "Zone15"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Corsair cancels users $3499 PC order, then rises the price by $800 - VideoCardz.com",
        "score": 710,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not a native speaker but shouldn't the headline be ''then raises the price\"?",
                "author": "Frosty_Prune_1838"
            },
            {
                "raw_content": "a reddit post with an article about a reddit post",
                "author": "gumol"
            },
            {
                "raw_content": "> VENGEANCE a5100 Gaming PC: AMD Ryzen 9 9900X3D, GeForce RTX 5080, 32GB DDR5, 2TB M.2 SSD, Win11 Home How is this worth $3500, let alone $4300? And people buy this shit? Edit: RTX 5080 + 9800X3D (better than 9900X3D for gaming) using quality parts under $3000: https://pcpartpicker.com/list/Qz69xg",
                "author": "1mVeryH4ppy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Chinese memory maker CXMT prepares $4.2 billion USD IPO to take advantage of tight memory market — company lays out path to profitability as DRAM demand skyrockets worldwide",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aren’t they on the entity list and banned in America?",
                "author": "YoungKeys"
            },
            {
                "raw_content": "Hello StarbeamII! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "This slots well into China's plans for domestic manufacturing either way, but memory really is otherwise an especially fickle and volatile business to get into. It's easy to imagine riding the wave to profitability but it can also just come crashing down on you in a way more severe than with most components.",
                "author": "Limited_Distractions"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Real Finewine Strikes Again: Ryzen 5600X, 5700X & 5800XT Revisit",
        "score": 145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm keeping my 5800X until DDR6.",
                "author": "Dreamerlax"
            },
            {
                "raw_content": "TLDW: 14 game average (geomean): A. 1080P (medium) using RTX 5090 GPU: - 5600X 4% slower than 5800XT - 5600X 20% faster than the 12400F using the same DDR4-3600 memory - 5600X 9% slower than Intel Core Ultra 5 225F that uses faster DDR5 CUDIMM - 5600X 17% slower than 7500F - 5700X matched the performance of the 12400F using DDR5 memory B. 1080P (ultra) using RTX 5090 GPU: - 5600X 16% slower than 7500F - 5700X matched the performance of the 12400F using DDR5 memory",
                "author": "Antonis_32"
            },
            {
                "raw_content": "AM4 really is a gift that keeps on giving. I'll mention I've thing that doesn't get mention much in context of the videos - e-waste saved by allowing people to keep the same motherboard while getting meaningful CPU upgrade choices. It's good for your pockets and for sustainability",
                "author": "rebelSun25"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GIGABYTE Releases Four New AMD Socket AM4 Motherboards",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As the comments on the site says, these are not new, they are new revisions of old boards.",
                "author": "capybooya"
            },
            {
                "raw_content": ">DDR4 memory that's available at more affordable prices doubt.gif",
                "author": "Dreamerlax"
            },
            {
                "raw_content": "AM4 is the gift that keeps on giving.",
                "author": "Marco-YES"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Best HDR I’ve Seen on a QD-OLED Monitor (So Far) - MSI MPG 271QR X50",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The most interesting part of this review is the first 30s where he shows how True Black 500 and peak brightness mode differ in fundamental ways. TB500 clips peak brightness to 500nits but the overall brightness is much better than the peak 1000 nit mode.",
                "author": "that_70_show_fan"
            },
            {
                "raw_content": "Still feels behind the rest of the OLED world. Laptops already shipping with True Black 1000 displays and phones have had >=3000 peak nits for years. Latest TVs are already at like 2500",
                "author": "donomo"
            },
            {
                "raw_content": "It was also time for a new MSI UI. I never understood why all MSI monitors lacked settings, like gamma, color, saturation, etc. Unfortunately, the OLED screen I ordered doesn't have the latest UI :'(",
                "author": "grashel"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arm Comes to Project TinyMiniMicro Lenovo neo 50q Tiny QC (",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This uses the **X1-26-100**, the smallest SoC with a 8-core (two 4+4 clusters) configuration @ 3.0 GHz. X2E = SD X2 Elite X1E = SD X1 Elite X1P = SD X1 Plus X1 = SD X1 CPU-Z in the video incorrectly identifies as an X1 Elite; it is actually just the X1 base. Lenovo link: [ThinkCentre Neo 50q (Snapdragon) Tiny | SMB Compact PC with Next Gen AI | Lenovo US](https://www.lenovo.com/us/en/p/desktops/thinkcentre/thinkcentre-neo-series/lenovo-thinkcentre-neo-50q-snapdragon-tiny/len102c0059#models)",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Side note, but I find it interesting this new case design makes the \"Lenovo\" branding more prominent and the \"ThinkCentre\" branding less prominent. I wonder if they're going to move way from \"Think\" branding.",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "I will be staying away from Lenovo because of how they deal with Russia. Bought a HP Omnidesk with an i3 14100 that idles 20w with more than a dozen containers and VMs running. $219 refurbished.",
                "author": "budderflyer"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is this finally gonna be the anniversary where Gen 1-3 gets added to NSO Classics?",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yeah right haha",
                "author": "PaleZebra288"
            },
            {
                "raw_content": "Yes, and Half Life 3 will be coming to Switch 2 as well.",
                "author": "AngryVideoGameTable"
            },
            {
                "raw_content": "I would never expect classic mainline Pokémon games on NSO for 2 reasons: 1. Game Freak hates rewinding and save states, they have never allowed them even on 3DS re-releases. 2. They probably will push HOME integration if it ever happens, and they realistically can't done that with NSO. If they ever re-release them, it would be outside of NSO.",
                "author": "Joseki100"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Alright, u/SteakAndIron",
        "score": 976,
        "text_content": "Video or it didn’t happen",
        "comments": [
            {
                "raw_content": "![gif](giphy|cbhtxvVZwsnnqQY1Dx) u/SteakAndIron",
                "author": "GenderJuicy"
            },
            {
                "raw_content": "This is a take and a half. Don't know why people think the DS gimmick is coming back considering how much more expensive it would be today and how little it would add to the experience by comparison. Switch 2 and original Switch already have a touch screens and they were underutilized for understandable reasons.",
                "author": "Nos9684"
            },
            {
                "raw_content": "SteakAndIron's dinner tonight https://preview.redd.it/uo6zxr1f7yag1.jpeg?width=970&format=pjpg&auto=webp&s=c8b0fabd9e18f0918a601f17530dce87e0d0ee32",
                "author": "StarPlatinum55"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Please drop the old Pokémon games on Nintendo Switch for its 30th anniversary :,)… please.",
        "score": 84,
        "text_content": "I’ve been wanting to play these amazing games on the Nintendo Switch for the longest time, especially when considering the docked aspect of the hybrid portable console meaning we can play these on the TV which would be an awesome experience! I know them dropping the games on NSO online is a long shot, but considering how for the 20th anniversary, how they dropped the games on the 3DS Eshop to buy separately on top of releasing 3DS console bundles, then I hope they do that same method for the Switch console since that only makes sense, especially given how it’s been 10 years ago since they last did it and they did it for the previous handheld device being the 3DS. That would be the dream :,)… really manifesting it for this year or February since I would buy them in a heartbeat!",
        "comments": [
            {
                "raw_content": "me holding my modded 3ds closer to my chest than my wallet",
                "author": "TrentSaylor"
            },
            {
                "raw_content": "Waiting for a gen 1-3 remaster collection that's a limited run, ala All Stars.",
                "author": "crocicorn"
            },
            {
                "raw_content": "We going to get one of these threads every 4-5 hours? I call next!",
                "author": "StockHumor4768"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I finally entered 2017!",
        "score": 318,
        "text_content": "As a long time Nintendo gamer through the days of the SNES, N64, and GameCube, I skipped the Wii, Wii U, and even the Switch, as I was exclusively a Steam/PC gamer for a long time. Well, I picked up a Switch 2 and now I have a lot of catching up to do! My collection now consists of: \\* Mario Kart World (digital with the console) \\* Breath of the Wild \\* Super Mario Odyssey \\* Super Mario 3D World w/ Bowser’s Fury \\* Red Dead Redemption \\* Cyberpunk 2077 (digital. Thank you, price error!) \\* Hollow Knight (digital) Since my Steam collection is entirely digital, one thing I wanted with my Switch 2 was to have some physical games. Even if it’s less convenient to have to insert and remove cartridges, I miss the physicality of games in this all digital world, so I knew I wanted at least some games to be physical. BOTW and Odyssey are really the two landmark titles of the Switch generation, so I knew I wanted them to be physical so I could collect them and keep them on my shelf. And I managed to catch them both on sale, which rarely happens for these games ($59 CAD and $55 CAD). And for anything else, it’s a tough call between physical and digital. I haven’t really decided what I want to buy from the eShop vs what I want as a cartridge. I’ve sort of been winging it based on deals I find. Like the $24.99 CAD price on Cyberpunk 2077 was something I couldn’t pass up, even though I have a high end gaming PC that could run the game better. Anyways, this is all just a long-winded way of saying that as a lifelong Nintendo fan who left for several generations, I’m finally back and am excited to catch up on everything I’ve missed!",
        "comments": [
            {
                "raw_content": "I played throughly BotW on Switch 2. Its a lot better experience than on Switch 1.",
                "author": "Rauliki0"
            },
            {
                "raw_content": "Both are so much better on switch 2 Mario odyssey was half of 720p and botw used to drop regularly Enjoy playing those games in the best possible way",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "I had a ton of fun with BOTW and Odyssey on the S1 and they looked great, I'm sure they are even better on the S2",
                "author": "Stryker_T"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Developed The Switch 2 With Third Parties Strongly In Mind",
        "score": 32,
        "text_content": "It seems to me that Nintendo developed the Switch 2 with third parties strongly in mind. Features such as built in DLSS and ray tracing cores along with the addition of game key cards and microSD express cards are all things that feel like Nintendo really want third party developers to try to put their games over to the platform. Not to mention other stuff like VRR and 120hz on the handheld's display (No way third party games are running at 120 fps, but I always thought the 120hz panel was a move to get third party developers to include a 40 fps option to their games like Cyberpunk). Think about it, it is 2026 and Nintendo has a handful of their own developed games (announced and unannounced) that are coming this year. But will any of the games utilize things like DLSS or ray tracing? Or will Nintendo use these features later down the line? Will they ever use them at all during the Switch 2's generation? If Nintendo didn't have third party developers in mind; they would have chosen a SOC that doesn't have DLSS nor ray tracing cores. They would have stuck with micro SD cards instead of adopting to the new standard of the microSD express cards. Game key cards would have not been a thing and they would have told AAA developers to do what they can with the expensive and slow 64 GB cartridge (the AAA developers would have most likely refuse to port anything over). The 256gb of storage that the console has is small (Nintendo did the same with the Switch and Wii U) but it is UFS 3.1 which is capable of fast read/write speeds. If they didn't care about third parties they would have went with the UFS 2.2 which came out around the same time as UFS 3.1, but has much slower read/write speeds, but it costs much less. There were rumors (not so long ago) that the system was going to have 8GB of ram. This would have been great for Nintendo, but third party developers were going to complain. Fortunately, the system somehow shipped with more ram than a Series S.",
        "comments": [
            {
                "raw_content": "Counterpoint: If they had fully had 3rd Party support in mind they would have allowed for the disabling of Game Chat so that titles can get the full use out of the CPU & RAM. They get some things right, they get other things wrong. That's life.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "They had to at least only be one generation behind on power. That let's people port all the games Nintendo missed or had to have cloud versions of (looking at you Hitman). And they know the wii and switch both had robust economies of shovelware from 3rd parties. And not wanting to repeat the wii u",
                "author": "Grindar1986"
            },
            {
                "raw_content": "Nintendo games are already utilizing DLSS. Pokemon Scarlet/Violet, as well as Pokemon Legends Z-A upscale from 720p to 1440p using DLSS. I personally believe that other games like 3D World or Breath of the Wild don't use it because In the case of 3D World, the game doesn't really need it to reach the resolution it's aiming for. In the case of BOTW, the engine may not yet be updated to support DLSS. I do hope Nintendo decides to implement it later on, because it provides far, far better results than their usual FSR 1 or 2. As for ray tracing, I think Layers of Fear, a Switch 2 port of a fully ray-traced game running at 60fps (very neat, here's a [video ](https://www.youtube.com/watch?v=OoMay8qSC88&t)about it) gives us a really good look at what Luigi's Mansion 4 could do with Ray Tracing. Imagine that. I'm already excited and its not even confirmed to exist. However, remember that ray tracing is incredibly expensive. While the Switch 2 is competitive with the Series S purely because Nvidia's RT tech is just that much better than AMD's, Nintendo only lets this thing draw like 10 watts max. It will take a lot of wizardry. (Though if any developers out there are wizards, the SW1 generation showed us that it's Nintendo's.) But yeah, this generation is already Nintendo's strongest for AAA support in my opinion. We're getting massive releases like Indiana Jones, Assassin's Creed, Elden Ring and FFVII Remake, as well as huge day-and-date releases like Resident Evil 9, 007 and Pragmata. I'm not going to agree or disagree about whether Nintendo really designed the console with 3rd parties in mind, but they definitely are showing up in force this time around.",
                "author": "Keaten88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Persona 3 Reload looks so good in handheld mode",
        "score": 189,
        "text_content": "Honestly after the recent patch the handheld experience improved so much! I put in a couple of hours but stopped playing it until after the patch and I’m glad I did. The frame pacing issues are gone and the image looks super sharp in handheld. Atlus also patched the demo so anyone can give it a try.",
        "comments": [
            {
                "raw_content": "Patch made it a night and day difference. It's baffling they let it out in such a sorry state in the first place. Now, Persona 5 Royal is in dire need of a Switch 2 update, upgrade, rerelease, anything really.",
                "author": "Medd-"
            },
            {
                "raw_content": "I bought the game a few days ago now that they patched the frame pacing and it has been super addictive so far. The game looks great and is immersive. A perfect fit for the switch 2.",
                "author": "Progaula"
            },
            {
                "raw_content": "I hope they go back and add a true performance and quality modes. i.e. a performance mode for handheld, and a quality mode for docked. As it is docked just runs handheld specs, unless you choose performance mode in which it targets 60 fps.",
                "author": "The-student-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ARK Developer Trying To Bring ARK: Survival Ascended on the Switch 2 with PS5/Series X Level Graphics",
        "score": 56,
        "text_content": "They're trying to see if they can use frame generation (which is terrible in my opinion) to get this game running at a stable 30 fps. They stated that UE5.7 gave them an fps boost because it was running about half of 30 prior to the UE5 update. It's running around 20 fps at the moment with the new UE5 update. The interesting take from all of this is that in comparison to the Series S they had this to say, \"*The Nintendo Switch 2 has, in effect, more addressable memory than the Xbox Series S, the so-called Lockhart platform, does. And so, since we already had basically scaled ARK: Survival Ascended for Series S, we found that we were in a better memory state than on that console and therefore weren't in a case of running out of memory on the Nintendo Switch 2, even with using more advanced graphics on the Switch 2 than we do on the Series S. But the issue was the GPU primarily being weaker. We were able to use all the primary rendering features. Working on it, we wanted to make sure that it looked essentially like the Xbox Series X version.* *We've downgraded the graphics quite significantly for Series S and we didn't want the Switch 2 experience to be like that. We needed the game to look approximately like the Series X version or the PlayStation 5 version, even if it would be at a lower resolution. So, the issue was not core rendering features. We would have to do Lumen, Nanite, and Virtual Shadow Maps. All three of those things are important to us on Switch 2. I think we may have dropped the shadows to Cascade Shadows rather than Virtual Shadow Maps, which is kind of a slightly older way of handling shadows, but in practice, most users wouldn't be able to tell the difference on a lower resolution device like the Nintendo Switch 2, which for us would be a 1080p handheld 1440p docked resolution as opposed to 4K in either case.\"* In my opinion, frame generation is awful and I would prefer if they tone down the graphics to make it a stable 30 fps. Link to the article: [https://wccftech.com/nintendo-switch-2-port-asa-only-doable-ue-5-7-says-ark-dev-studio-trying-to-get-fg-running/](https://wccftech.com/nintendo-switch-2-port-asa-only-doable-ue-5-7-says-ark-dev-studio-trying-to-get-fg-running/)",
        "comments": [
            {
                "raw_content": "I'm no game developer, but I think that the ARK Devs aren't as well if they think this is possible or desirable... The original doesn't even run well anywhere, I can't imagine Survival ascended running smoothly in any way on the switch 2, especially with Xbox series X parity like they want. And the frame generation would be horrible. People got mad when Capcom told players to use frame generation on MH wilds from 30 to 60, now imagine from 15/20 to 30, actual hell.",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "Jesus christ literally the entire point of dlss on switch 2 Its for getting performance overhead on the gpu back by lowering rendering resolution without sacrificing iq. If you can't reach your target framerate WITH THAT while running at *checks notes* freaking series X FIDELITY, for the love if God lower the settings, do not frame gen from 20 fps. I've done that on deck and ally, it freaking sucks. I would be more than impressed with halfway between series s and *checks again* fricking series x settings on switch 2. I will be PISSED with frame Gen.",
                "author": "IntrinsicStarvation"
            },
            {
                "raw_content": "Frame Gen works fine for games going from 90 to 120FPS but please dont use it for going from 20 to 30…",
                "author": "NintendoGalaxyYT"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Wind & Wave (Gen 10) official site has been registered",
        "score": 394,
        "text_content": "Link: [https://www.pokemon.com/windwave](https://www.pokemon.com/windwave) It redirects to the main page while any other thing after the \"/\" shows a 404 error. This confirms that the names hasn't been changed due to the leaks, and also that the games will likely be announced for the 30th anniversary celebration in 2 months :) unless that's a bait from TPC EDIT : [https://www.pokemon.com/windswaves](https://www.pokemon.com/windswaves) (with \"s\") also redirects to the main page",
        "comments": [
            {
                "raw_content": "What on earth is happening in this thread",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Anything starting with \"win\" redirects to the main page. https://www.pokemon.com/wingstop",
                "author": "FierceDeityKong"
            },
            {
                "raw_content": "I'm really excited for this one, hope we see something from it sooner rather than later.",
                "author": "Himbosupremeus"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A NieR: Automata Nintendo Switch Prototype build leaked!",
        "score": 204,
        "text_content": "[https://boards.4chan.org/v/thread/729914826](https://boards.4chan.org/v/thread/729914826)",
        "comments": [
            {
                "raw_content": "I saw \"NieR: Automata\" \"Nintendo Switch\" and \"leaked\" and was quickly disappointed",
                "author": "PersonalityNo8280"
            },
            {
                "raw_content": "An actual real 4chan leak in 2026??? And not just a fake Nintendo uncle larper??? Crazy",
                "author": "proficient2ndplacer"
            },
            {
                "raw_content": "is this any different than the one that leaked earlier last year?",
                "author": "foulveins"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mudang: Two Hearts probably cancelled, EVR Studio website shut down.",
        "score": 140,
        "text_content": "source: [https://xcancel.com/Need4Gamers/status/2007292843195543622](https://xcancel.com/Need4Gamers/status/2007292843195543622) Website link: [https://evrstudio.com/](https://evrstudio.com/) PS: also got layoffs last year",
        "comments": [
            {
                "raw_content": "I love that baby hippo",
                "author": "RBFxJMH"
            },
            {
                "raw_content": "Nooooooo",
                "author": "NoPersonKnowsWhoIAm"
            },
            {
                "raw_content": "Oh shit no, the game looked really great!",
                "author": "Bolt_995"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Datamining Group Leaks Detailed Presets for Monster Hunter Wilds, Including Switch 2 Docked and Handheld Modes",
        "score": 343,
        "text_content": "A Chinese datamining group has just compiled all the preset settings they discovered for Wilds. There are 300 detailed parameters across four platforms: PS5, PC, Xbox Series X/S, and Switch 2. ​If you're interested, you can manually configure the PC version of Wilds based on the parameters in the table. I’m looking forward to seeing YouTubers create dedicated videos using these settings to compare the final results with other platforms—it would be amazing if a channel like Digital Foundry could get involved. ​Screenshots of some parameters: [Image 1](https://ibb.co/Dg6jWXr5) [Image 2 ](https://ibb.co/s9yd5NC3) Whole Google sheet Link below: https://docs.google.com/spreadsheets/u/0/d/1lYyBI_8LclHT9r8CYrC9lXTnjHwWLRbzd-9bvustE8c/htmlview#gid=1161006367",
        "comments": [
            {
                "raw_content": "Is the implication here that the Switch 2 version will have some kind of performance mode purely in docked? And what does DialoguePlaying, Default Fast and Fastload mean?",
                "author": "WildDemir"
            },
            {
                "raw_content": "I'm a massive MH fan, if they add cross save and this runs reasonably well I'm happy to double dip and get it on Switch 2.",
                "author": "jwhudexnls"
            },
            {
                "raw_content": "Not much to say other than that it's evident Capcom are making platform-specific adjustments as one would expect. For things like fur, wind, and water simulations, Switch 2 matches PC's low preset which are also equivalent to performance mode on other consoles. Global Illumination sees significant cutbacks particularly in handheld mode along with other things like shadow quality. Interestingly, there is a graphics preset called FastLoadMode that basically turns everything to crazy low settings. These presets are very clearly still under development so I would caution against running with them too hard at this stage.",
                "author": "anirakdream"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Radeon RX 9070 finally shows up in Steam’s Hardware Survey",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I own a 9070 XT and my steam survey always fails to register it, results in it determining that I have Radeon graphics….",
                "author": "Choice-Drop-1938"
            },
            {
                "raw_content": "congratulations, I guess",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "It's common knowledge that the non-XT is just the cut down die from the XT, there should be at least three XT's to every non XT.",
                "author": "boomstickah"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI releases AGESA pre-1.3.0.0 with microcode update for upcoming Ryzen 9000G",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Only 12% of married couples under 30 own a home",
        "score": 851,
        "text_content": "But everything is great and it’s your fault you can afford a new home. Also, so much for the “dual incomes mean everyone makes six figures+ theory” as well.",
        "comments": [
            {
                "raw_content": "Curious as to how many of them also had kids or family help.",
                "author": "vivikush"
            },
            {
                "raw_content": "Proof is in the pudding. I'll hear my boomer friends all the time talk about interest rates when we were first buying yadda yadda yadda. We stopped building in 2008, right when the largest number of 20-30 y/os in the US history were about the enter prime home buying years. Taking up new land to build housing in the 50s-90s was common. Those people that took away native lands sure did a ladder-behind them act and suddenly started caring about the environment once their family home was bought. Convienent. I did my part and actually downsized. Good luck kids and sorry for screwing you.",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "This statistic tells more about marriage rates than homeownership rates. Homeownership rates for the 25-34 demographic (census data) in those years is the following: 1960: 55 1970: 50 1980: 51.6 1990: 45.3 2000: 45.6 2010: 42.0 2025: 37.5 Meanwhile, marriage rates for 25-34 year olds have gone from 82% (1960) to 30% (2025).",
                "author": "Unusual-Ad1314"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 2.7% Below 2022 Peak",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So the real crash is prices continuing to go up, just slower than inflation? Does that even help affordability or mean that it was bad time to buy at any point in the last 5 years?",
                "author": "SlartibartfastMcGee"
            },
            {
                "raw_content": "Damn near giving them away at this point",
                "author": "DIYThrowaway01"
            },
            {
                "raw_content": "Good thing my income went up with inflation, while my mortgage did not. Another example of why it always pays to buy as soon as you are in a financial and life position to do so",
                "author": "Cautious_Midnight_67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Condo Market Hasn’t Been This Bad in Over a Decade (WSJ)",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Non-paywall: https://archive.ph/QvyuX Quick Summary * U.S. condominium prices experienced their largest annual decline since 2012, falling 1.9% from a year earlier in September and October. * Rising homeowner-association fees, higher insurance premiums, and maintenance costs are making condominium purchases less affordable. * Over 10% of condos had a lower estimated value in November than their last sale price, with some metro areas seeing over 25%.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Every nice condo I've seen has been like $1.5mm for 2500sqft and monthly condo fees are $2000. Who in their right mind would buy this??",
                "author": "crucialdeagle"
            },
            {
                "raw_content": "This is one of the reasons why in places like Miami, demand for fully remodeled existing single family homes is strong.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google Principal Engineer uses Claude Code to solve a Major Problem",
        "score": 435,
        "text_content": "[Tweet](https://x.com/rakyll/status/2007239758158975130?s=20)",
        "comments": [
            {
                "raw_content": "\"Former Google Principal Engineer\" I'm a Google-stan, but Claude Code with Opus 4.5 is legit.",
                "author": "Singularity-42"
            },
            {
                "raw_content": "This is where the luddites come to tell me that it's just hype right, cuz people famously hype up their competitors",
                "author": "send-moobs-pls"
            },
            {
                "raw_content": "Principal engineers in Google are typically tech leads for year long programs worked by 50-100 SWEs. Yea this is a bullshit claim, Claude code is good but nowhere near this good to replace 50 top engineers' work for a full year. I dont work for Google anymore but Im pretty sure people will be mocking the tweet on memegen right now.",
                "author": "xiaopewpew"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic will directly purchase close to 1,000,000 TPUv7 chips, the latest AI chip made by Google",
        "score": 358,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The TPUv7 AI chip was designed by Google but it seems in 2026, Broadcom will be directly selling these Google-designed chips directly to third parties. I wasn’t sure how Anthropic would compete with OpenAI’s and Google DeepMind’s massive compute buildouts, but this right here is the answer",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "So at most 108 copies of what's in the picture below (pod, group of interlinked racks with up to 9,216 chips) https://preview.redd.it/dun975e3b1bg1.png?width=1000&format=png&auto=webp&s=65781edb79e2849b2132a3a8df8b7be13e981911",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "something isnt adding up. google claims they cant find enough compute yet they are still making cloud deals with other companies and now selling the chips directly.",
                "author": "New_World_2050"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Yann LeCun calls Alexandr Wang 'inexperienced' and predicts more Meta AI employee departures",
        "score": 384,
        "text_content": "Lots of interesting, juicy details from this article: https://www.businessinsider.com/yann-lecun-alexandr-wang-criticism-inexperienced-meta-ai-future-2026-1?utm_source=reddit.com >AI pioneer Yann LeCun isn't sold on Mark Zuckerberg's **$14 billion bet on Alexandr Wang, the 28-year-old Scale AI cofounder recruited to lead Meta's Superintelligence Labs.** >LeCun, who was Meta's chief AI scientist before announcing in November that he was leaving to form his own startup, **said Wang was \"inexperienced\" and didn't fully understand AI researchers.** >LeCun said that Zuckerberg grew frustrated after disappointing progress on Llama, the company's flagship, open-sourced AI model. >LeCun said that the AI team \"fudged\" some of the results of Llama 4. At the time, Meta was criticized for potentially gaming the results of benchmark tests. LeCun said the episode soured Zuckerberg on Meta's existing AI team. >Mark was really upset and basically lost confidence in everyone who was involved in this,\" he told FT. \"And so basically sidelined the entire GenAI organisation. >As for his relationship with Wang, LeCun said that even though the 28-year-old was briefly his boss after Zuckerberg's AI reorg, he wasn't really directing him. >**You don't tell a researcher what to do,\" LeCun told the publication. \"You certainly don't tell a researcher like me what to do.** Looks like there was a lot of tension and disagreement within Meta. Many predicted LeCun would not like having a 28 year old kid directing him. >Meta's new AI team is 'completely LLM-pilled' LeCun said Zuckerberg remained supportive of his views on the future of AI, but that the Meta CEO's larger hires are focused on large language model development. >I'm sure there's a lot of people at Meta, including perhaps Alex, who would like me to not tell the world that LLMs basically are a dead end when it comes to superintelligence,\" LeCun said. **\"But I'm not gonna change my mind because some dude thinks I'm wrong. I'm not wrong. My integrity as a scientist cannot allow me to do this.** >LeCun has repeatedly argued that LLMs are too limited and that to unlock the true power of AI, a different approach is needed. It's why his startup is reportedly called Advanced Machine Intelligence, the very approach he has argued is better suited than LLMs.",
        "comments": [
            {
                "raw_content": "The Wang dude just made a data labelling start-up, and he acted like he was an AI genius. Never understood the hype around him.",
                "author": "postacul_rus"
            },
            {
                "raw_content": "Facebooks seems directionless, steps behind, and trying to throw money at every fire within its organization.",
                "author": "spread_the_cheese"
            },
            {
                "raw_content": "LLMs might be a dead end to AGI, but it has proven not a dead end for productivity nor real world impacts. So unless Lecun came up with something concrete (which he hasn't), it's understandable that Zucc needs to shift gears.",
                "author": "Freed4ever"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jensen Huang everyone",
        "score": 383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are literally pissing on you and telling you it's raining.",
                "author": "Civilanimal"
            },
            {
                "raw_content": "The jobs catering to robots will be much less than the jobs of what the labor of robots used to provide",
                "author": "SeaCaligula"
            },
            {
                "raw_content": "If a robot isn’t capable enough to build and repair other robots, it won’t be able to clean a house or cook dinner.",
                "author": "VicermanX"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok Blames ‘Lapses In Safeguards’ After Posting Sexual Images Of Children",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's fascinating to see the contrast between Grok and ChatGPT scandals. Grok gets prompted to do creepy, illegal shit all the time, but its safeguards don't seem to tighten much, even after cases like this. Like Grok is still incredibly uncensored when compared to ChatGPT, which is locked down so hard the poor thing tells you to take a step back if you thank it a little too enthusiastically. I wonder why OpenAI's response to scandals has been so restrictive when Grok just... keeps doing what it does for the gooner squad without harsh censorship from xAI.",
                "author": "Shameless_Devil"
            },
            {
                "raw_content": "I didn't test it on kids obviously, but *after* reading this story earlier today I found a woman who complained about Grok putting her in a bikini and got it to make her completely topless from the same source picture. Not being an asshole I deleted the pic and didn't post it, but this hasn't actually been fixed, at least for revenge deepfakes on adults.",
                "author": "jakegh"
            },
            {
                "raw_content": "This shouldn't be happening - there should've been better safeguards, and people should be ashamed of themselves if they participated in this.",
                "author": "MaxeBooo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Manus identified a bunch of drugs to activate an immune cell type. It's unbelievable what you can discover with AI agents that work for hours!",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Show me the paper. Until then, it's unsubstantiated bullshit.",
                "author": "TheDailySpank"
            },
            {
                "raw_content": "This guy spreads hype, that’s his job.",
                "author": "forthejungle"
            },
            {
                "raw_content": "Garbage post",
                "author": "StagedC0mbustion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "World’s first subsea desalination plant: Norway to launch Flocean One in 2026, using ocean pressure to halve energy consumption",
        "score": 134,
        "text_content": "The path to total resource abundance just got a lot clearer. Norwegian startup **Flocean** is set to launch the world's first commercial-scale subsea desalination plant **\"Flocean One\"** marking a radical shift in how we produce fresh water. **The Engineering Breakthrough:** Instead of pumping seawater to land-based plants, the system operates at depths of **300–600 meters**. By tapping into natural ocean hydrostatic pressure to drive the desalination process, Flocean can **slash energy use by 50%** compared to traditional methods. **Key Facts of the 2026 Launch:** **Energy & Emissions:** The technology slashes **both** greenhouse gas emissions and energy costs by half, making large-scale fresh water production significantly more sustainable. **Minimal Footprint:** Because the plant is subsea, it has a **minimal** impact on marine life and requires no expensive coastal real estate. **Scaling Abundance:** With global freshwater **demand** rising, this hydrostatic advantage could finally make desalination cheap enough to solve water scarcity in even the most remote regions. **If we can halve the energy cost of the world's most critical resource, are we seeing the first true signs of a \"Post-Scarcity\" infrastructure being built in real-time?** **Source:** [Interesting Engineering](https://interestingengineering.com/innovation/worlds-first-underwater-desalination-plant-launch-2026) **Image:** Subsea desalination plant (Flocean)",
        "comments": [
            {
                "raw_content": "where do they put all the salt environmental people get upset about the increased salt concentration from just dumping in one spot",
                "author": "rageling"
            },
            {
                "raw_content": "Does that really save energy? Does it matter if the salt water is pressurized or the desalinated water elevated by 600 meters? It should be the same pressure difference and volume flow.",
                "author": "Fast-Satisfaction482"
            },
            {
                "raw_content": "I hope they've considered Russia and the CCP with their cable-cutting fuckery in that region.",
                "author": "Elephant789"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Information on OpenAI upcoming device",
        "score": 280,
        "text_content": "[Tweet](https://x.com/jukan05/status/2006880046984892888?s=20)",
        "comments": [
            {
                "raw_content": "So is it the size of a pen or the size of an iPod Shuffle? Those two elements of information are not compatible",
                "author": "RevoDS"
            },
            {
                "raw_content": "I don't know... this kinda feels like a dead on arrival gizmo, that only a handful of tech hipsters will buy... P.S.: And it feels like a total data privacy nightmare as well.",
                "author": "bonobomaster"
            },
            {
                "raw_content": "Why wouldn’t I just use my phone, with its microphone and built in camera..? Nobody needs a \"third core device\".",
                "author": "SenzuYT"
            }
        ],
        "subreddit": "singularity"
    }
]