[
    {
        "post_name": "Time for them to trust the science",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sources: https://www.mountsinai.org/about/newsroom/2025/mount-sinai-study-supports-evidence-that-prenatal-acetaminophen-use-may-be-linked-to-increased-risk-of-autism-and-adhd https://hsph.harvard.edu/news/using-acetaminophen-during-pregnancy-may-increase-childrens-autism-and-adhd-risk/ https://birthinjurycenter.org/tylenol-link-to-autism/ https://pmc.ncbi.nlm.nih.gov/articles/PMC5044872/ https://hub.jhu.edu/2019/11/05/acetaminophen-pregnancy-autism-adhd/",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "They only trust science when it serves their perverse regressive agenda. These people will remain autistic-long after autism is cured.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "All this time I thought the bloodstream chemical bath they give babies with needles was the reason.",
                "author": "Framus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberal women are a national security threat, public health concern, a catalyst for mental health issues, sponsors of terrorism, and the leading cause of low birth rates in the US and abroad",
        "score": 1038,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leftists terminate pregnancies for fun, it doesn't matter to them, just another virtue signalling post.",
                "author": "grassshrimp"
            },
            {
                "raw_content": "Next the patriarchy will tell women they can’t smoke or drink during pregnancy. LITERALLY HANDSMAID TALE",
                "author": "And_Im_Kenny_Rogers"
            },
            {
                "raw_content": "WOMEN ARE TOUGH AND NEED TO BE PAID LIKE MEN What do you mean I can't use tylenol with the baby I plan to abort anyways? Another misogynistic shackle from the right!",
                "author": "ParticleCannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Next Week",
        "score": 731,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't tempt Bear Grylls.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Not gonna happen. They already drink each other’s disease-riddled piss. They can’t deny others their own piss because that would violate their communist ideals.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "This was unironically already a fetish for more than zero of them.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💊 Which pill, Neo?",
        "score": 622,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You take the Tylenol pill... the story ends, you wake up in your bed and you have an Autistic child. You take the red pill... you stay in Wonderland, and I show you how deep the rabbit hole goes.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I was literally making this same meme, just finished it and came on to post it. You beat me buddy and you did a better job at it. Mine looked like a two year old made it.",
                "author": "Zippythekid"
            },
            {
                "raw_content": "acetaminophen during the periods of brain development is the problem, its inhibitory effect can impair the brains development inhibition of cyclooxygenase (COX) enzymes, modulation of the central serotonergic and endocannabinoid systems in a fully developed adults brain, acetaminophen can improve neuronal plasticity, reduce cognitive decline and improve memory you have these parents and doctors pounding children with drugs / vaccines and their vulnerable bodies and brains during the critical developmental phase and so receive permanent impairment because they lack the mature protective system adults have in place ideally there would be strict laws and framework to protect young humans, ensuring they have the most optimal developmental period",
                "author": "Thermopylae_MMXX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING — IT’S OFFICIAL: President Trump has signed an executive order designating Antifa as a DOMESTIC TERRORIST organization! FINALLY!",
        "score": 2185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is exactly what i voted for",
                "author": "GreatWalkz"
            },
            {
                "raw_content": "Amazing. Now designate BLM, CAIR, Jane's Revenge and the Muslim Brotherhood as terrorist organizations. https://tips.fbi.gov/home [Here's 6 Antifa to report to the FBI now that they're officially a terrorist organization: Ed and Brian Krassenstein, Dragon Age: The Veilguard/Ghost of Yotei voice actress Erika Ishii plus her wife, Colorado Democrat State Rep Lorena Garcia and Minnesota AG Keith Ellison.](https://patriots.win/p/1AR0ZZ7A3z) **Ed Krassenstein Antifa Tweets** [Original Tweet 1](https://x.com/EdKrassen/status/1968671389080056178) [Archived Tweet 1](https://archive.is/O2eIJ) [Original Tweet 2](https://x.com/EdKrassen/status/1968766860721070168) [Archive Tweet 2](https://archive.is/oDcTW) [Original Tweet 3](https://x.com/EdKrassen/status/1970185581381742601) [Archived Tweet 3](https://archive.is/2oO7V) **Brian Krassenstein Antifa Tweets** [Original Tweet 1](https://x.com/krassenstein/status/1968482615402369143) [Archived Tweet 1](https://archive.is/yqo8A) [Original Tweet 2](https://x.com/krassenstein/status/1970191085285552529) [Archived Tweet 2](https://archive.is/pU32N) **Erika Ishii Antifa Tweet** [Original Tweet](https://x.com/erikaishii/status/1285259908011548674) [Archived Tweet](https://archive.is/sbWc8) **Colorado State Rep Lorena Garcia (D)** [Colorado State Rep Lorena Garcia (D) declares she’s antifa which is a designated terrorist organization. @FBIDirectorKash](https://x.com/libsoftiktok/status/1969776685466726618) **Attorney General of Minnesota Keith Ellison (D)** [In light of President Trump designating ANTIFA as a terrorist organization. Here is your friendly reminder that the Attorney General of Minnesota, Keith Ellison, is a big fan.](https://x.com/GrageDustin/status/1968511737298092440)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "I bet all of antifa is shaking in their size six boots",
                "author": "WhitePowerRanger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The new marching order is in",
        "score": 1296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's funny because it's true.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Tylenol is ok. It can hurt your liver. Take NAC to mitigate. I doubt its' the cause of autism. I'd put my money on the 40 simultaneous vaccinations they give kids. It melts their immune systems. I had 7 vaccines as a kid. Autism statistically did not exist when I was born. It was so vanishingly rare. When I say that my lib sister says \"but now they're counting more people as autistic\". That is true, but if you just count just the headbangers, it's obvious that alone has skyrocketed since 1990. I am considered in my family mildly autistic and that's because I'm in IT",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "spike proteins make libs retardeder",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leftists Vow To Triple Their Use Of Tylenol After Link With Autism Found",
        "score": 1094,
        "text_content": "",
        "comments": [
            {
                "raw_content": "solidarity with big pharma, that's all that democrats care about!! and now to stop them from buying politicians altogether",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "There's going to soon be another mutant strain of TDS infecting leftists: Tylenol Derangement Syndrome. Expect overdoses to skyrocket as the zombies ingest entire bottles to FIGHT FASCISM!",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "LOL Liberalism is a mental disease.",
                "author": "mateus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jimmy Kimmel's comeback to late night has been dealt a massive blow with ABC affiliates refusing to air it in nearly 40 major markets after Disney announced the liberal talk host will return Tuesday.",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course ABC let's their little crybaby coke head pedophile bitch boy right back on the air. They endorse everything he says.",
                "author": "bringbackthe80s"
            },
            {
                "raw_content": "Sinclair needs to air their Charlie Kirk tribute instead, like they said they would.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "&#65038; I had a feeling this would happen. &#65038; His show will be dropped completely in maybe another month or two. &#65038;",
                "author": "BallotsOnRubysUSB"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two Weeks... just became one.",
        "score": 1184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll believe it when I see it.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "How 'bout that hot take by, Brian! James Comey was besties with Trump! Those sea shells were simply a love message. Who knew?!",
                "author": "HowardsBaldHead"
            },
            {
                "raw_content": "Only two more half-weeks...",
                "author": "TrumpWonByALandslide"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remember that Charlie Kirk tribute what was going to air in place of Jimmy Kibbles’ show? It was dropped at the last second because - you guessed it - violent threats against the stations that were going to air it.",
        "score": 1543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is exactly why you DON'T negotiate with terrorists. Now weakness is sensed.",
                "author": "orange_kek_great"
            },
            {
                "raw_content": "Violent threats made by Democrats? Time for Republicans to lower the temperature.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I emailed the general manager of local ABC when the Family Feud rerun came on Friday. Never heard back from them.",
                "author": "GBA4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Watch it happen",
        "score": 1495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't take tylenol. It's terrible for your liver.",
                "author": "friedchicken"
            },
            {
                "raw_content": "I certainly hope that there is no TikTok challenge for this",
                "author": "RocketSprocket"
            },
            {
                "raw_content": "Trust the experts. There is no way big pharmaceutical companies would lie to the American people for more profits. They have always been on the side of safety. The autism epidemic is only happening in America, we need to find out why. Im willing to cut big pharmaceutical companies a break on lawsuits to just admit it and fix it.",
                "author": "Knumberate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gotta Catch ‘Em All.",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "whoever runs the account is having TOO MUCH FUN!!! Probably repressed during biden years.",
                "author": "dres3"
            },
            {
                "raw_content": "ICE type Pokémon are super effective against Illegal type Pokémon.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Holy crap, whoever is handling the DHS X account is on fire. Check out all the replies: https://xcancel.com/DHSgov/status/1970251208322621530",
                "author": "JerryJerryJerry"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Tylenol-Autism Link",
        "score": 963,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This x1000%",
                "author": "splink"
            },
            {
                "raw_content": "Tylenol was invented in 1955, and was widely used, as aspirin can cause rye syndrome in young children. There was no explosion of autism in 1955, nor any year thereafter, until the early 1990s.",
                "author": "Melchizedek18"
            },
            {
                "raw_content": "I have a theory about the over reliance on daycare as mom’s started working in the 70s and 80s contributing to this as well. An infant needs his or her mother for years but in our society the kid gets punted to a kennel run by strangers a few months after birth.",
                "author": "asdrubael_was_right"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Because anti-Tylenol is now racist",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump needs to come out and say walking on train tracks is bad for you.",
                "author": "bringbackthe80s"
            },
            {
                "raw_content": "tickle me tylenol",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "It's an older meme but it still checks out.",
                "author": "NewGoldenAge"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Randy Quaid: “Sinclair will not lift the suspension of \"Jimmy Kimmel Live!\" on our stations until formal discussions are held with ABC regarding the network's commitment to professionalism and accountability. Sinclair also calls upon Mr. Kimmel to issue a direct apology to the Ki",
        "score": 1339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Besides Family Feud reruns were getting higher viewership",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "Bet that affects Kimmel's already dismal ratings...assuming this wasn't all some clever ploy by ABC/Disney to top up his ratings thru 'curiosity/rage'...",
                "author": "Moebius"
            },
            {
                "raw_content": "Why is this coming through Randy Quaid?",
                "author": "Prof_Smith"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: In a bombshell announcement, President Trump and RFK Jr. announce the FDA will IMMEDIATELY notify physicians that Tylenol/acetaminophen during pregnancy can be associated with an \"increased risk of autism.\" \"Taking Tylenol is NOT GOOD. I'll say it. IT'S NOT GOOD.\"",
        "score": 1538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are we banning pharma ads on TV yet?",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "https://ehjournal.biomedcentral.com/articles/10.1186/s12940-025-01208-0 https://www.mountsinai.org/about/newsroom/2025/mount-sinai-study-supports-evidence-that-prenatal-acetaminophen-use-may-be-linked-to-increased-risk-of-autism-and-adhd https://hsph.harvard.edu/news/using-acetaminophen-during-pregnancy-may-increase-childrens-autism-and-adhd-risk/ Study cited from the presser. Notice Harvard's involvement so leftists can suck it. Trump and RFK also stated that leucovorin, a folate derivative, is a viable alternative for pregnant mothers. Spez: did not expect this post to get stickied, but whatever, receipts don't hurt.",
                "author": "julianReyes"
            },
            {
                "raw_content": "Doctors used to tell pregnant women not to take anything except for pre-natal vitamins. Nothing, not even an aspirin. Of course that was before they recommended them to take the Clot Shot.",
                "author": "AndanteAndante"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Turning Point just announced they will be CONTINUING the campus tour Charlie Kirk started, and some big names will be filling in for Charlie. Tucker Carlson, Megyn Kelly, Gov. Glenn Youngkin, Glenn Beck, Mike Lee, Andy Biggs, Jeff Landry and 3 TBA speakers.",
        "score": 1861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "None will be as good as Charlie.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "not the same charlie was young and connected w the youth in a way glenn beck doesnt",
                "author": "logan34"
            },
            {
                "raw_content": "Full list - Alex Clark - Allie Beth Stuckey - Frank Turek - Glenn Beck - Governor Glenn Youngkin (Virginia) - Governor Greg Gianforte (Montana) - Governor Jeff Landry (Louisiana) - Governor Spencer Cox (Utah) - Jason Chaffetz (Former representative for Utah's 3rd congressional district from 2009-2017) - Megyn Kelly - Michael Knowles (Daily Wire) - Rep Andy Biggs (Arizona) - Rob Schneider (Based comedian) - Senator Mike Lee (Utah) - Tucker Carlson - Vivek Ramaswamy (Running for Governor of Ohio in 2026) - 3 TBA Speakers I'm wondering if it'll be indoors or outdoors? I imagine there will be decent security either way (ground and rooftops covered) especially because of Charlie’s murder and that Governors + Senate/Congress members will be speaking. Indoors is always better. Can still seat hundreds/thousands of people + virtually zero chance of some antifa furry pedo shooting you 200 yards away.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Posted 7:16pm eastern -- \"Beginning Tuesday night, Sinclair will be preempting Jimmy Kimmel Live! across our ABC affiliate stations and replacing it with news programming. Discussions with ABC are ongoing as we evaluate the show’s potential return.\"",
        "score": 1012,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll fold to the crying old lady boomers",
                "author": "SweetBeef"
            },
            {
                "raw_content": "They need to air the Charlie Kirk tribute instead. They said they would.",
                "author": "Spiritof2015"
            },
            {
                "raw_content": "So will the leftoids be not watching Kimmel again on Tuesday or not?",
                "author": "KneadThePeople"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "good.gif",
        "score": 2216,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Ending H1Bs could cause a housing crash in some markets...\" They are saying this like its a bad thing...",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Houses are severely overpriced because our government pays for the illegals to be here. Our government has been treasonous for decades.",
                "author": "Dev404"
            },
            {
                "raw_content": "I saw on here that there are some 50 MILLION non citizens (legal or not) in the US. Get rid of them and there will be millions of homes that AMERICAN'S can use.",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Knowles in Minnesota @tpusa livelink",
        "score": 754,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s so friggin smart. We have the smartest people on our side.",
                "author": "Baughk"
            },
            {
                "raw_content": "He's a pretty good speaker. I like that he always remains calm and friendly.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "[MICHAEL KNOWLES: \"Erika Kirk forgave her husband's killer. The state of Utah will inject poison into that killer's veins until he's DEAD.\" \"There is no contradiction between those two things. Christian forgiveness does not demand that we allow the cruel to ravage the whole earth. It demands we love our enemies - and sometimes, love is tough.\"](https://x.com/EricLDaugh/status/1970288554057056422)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Graphics Driver Support Update for 11th Generation through 14th Generation Intel® Processor Graphics",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As of September 19, 2025, Intel will be moving 11th - 14th Gen Intel Processor Graphics and related Intel Atom®, Pentium®, and Celeron® processor graphics to a legacy software support model. Intel will provide software support for affected products on critical fixes and security vulnerabilities only. Software updates for these products will move to a quarterly release cadence with additional critical releases as needed. The following product families are impacted by this transition: Codenames: Skylake, Apollo Lake, Kaby Lake, Amber Lake, Coffee Lake, Whiskey Lake, Comet Lake, Gemini Lake, Ice Lake, Lakefield, Jasper Lake, Elkhart Lake. 11th Gen Intel® Core™ processor family (Codename Tiger Lake, Rocket Lake, Tiger Lake-H) 12th Gen Intel® Core™ processor family (Codename Alder Lake-S, Alder Lake-H, Alder Lake-P, Alder Lake-U, Alder Lake-HX, Alder Lake-N, Twin Lake) 13th Gen Intel® Core™ processor family (Codename Raptor Lake-S, Raptor Lake-HX, Raptor Lake-H, Raptor Lake-P, Raptor Lake-U) 14th Gen Intel® Core™ processor family (Codename Raptor Lake-S Refresh, Raptor Lake-H Refresh, Raptor Lake-U Refresh) Intel® Iris® Xe Dedicated Graphics family (Codename DG1)",
                "author": "TwoCylToilet"
            },
            {
                "raw_content": "i'm a little confused by this. these are Xe gpu arch, right? i assumed they were basically the same as alchemist, which is still supported. and there's no comment on the laptop variants of these cpus, so i guess those are still supported too. seems like there should be tons of driver overlap and/or they're still updating the drivers for this silicon, so why end support so soon? feels like this just erodes consumer confidence with nothing to show for it. what's the point?",
                "author": "FinancialRip2008"
            },
            {
                "raw_content": "Pretty poor to move products that just under 2 years old into 'Legacy support'. Makes you wonder how long Intel ARC's A & B series will be supported for... On the other hand though, I don't think the loss of Day 0 drivers for games will be an overly large loss considering that not many will actively run the newest AAA games on their Intel UHD 770. Maybe on the Intel Xe GPUs it'll be worse on that regard.",
                "author": "Vaxtez"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "2+ Year Longevity Update! More Failures and What’s Next For Our 100+ TV Test",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are TVs less reliable than PC monitors?",
                "author": "Healthy_BrAd6254"
            },
            {
                "raw_content": "So Mini LED it is. Losing a couple backlights hurts less when you start out with thousands.",
                "author": "ConsistencyWelder"
            },
            {
                "raw_content": "Well, the argument against OLED takes a backseat when every other technology showed degradation symptoms and failures, too. May as well just go for the TV with the best initial picture quality you can afford, because they all eventually become waste after a few years. Note that every single TV in this test has been running at maximum brightness to accelerate the degradation. All this proves is that at max brightness, every panel type fails in a relatively short period. I run my Sony 65\" A95K QD-OLED TV at \"20/50\" brightness (probably around 150-200 nits max) and that will most likely prolong its lifespan. I wonder if manufacturers knowingly push the max brightness level to \"dangerous\" *(in quotes because the worst thing that can happen is the TV stops working)* levels, as most reviewers focus on how bright a TV can get. It's all about the brightness wars nowadays. Now we have TVs advertising 2000+ nits which is insanity.",
                "author": "Gippy_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OpenAI and NVIDIA Announce Strategic Partnership to Deploy 10 Gigawatts of NVIDIA Systems",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is insane. Just for reference, I’ll use Hungary’s electric grid since I’m most familiar with it. Hungary isn’t a huge country, around 10 million people, sitting at the gateway of the Balkans and Eastern Europe. Not the highest standard of living, but we have plenty of manufacturing, air conditioning is becoming more and more common everywhere, electric cars are on the rise, and all the other stuff. So a ton of electricity is consumed. The biggest load ever recorded on the Hungarian grid was 7,441 MW, let’s call it 7.5 GW, which is still less than the proposed OpenAI/NVIDIA installation. That’s fucking massive.",
                "author": "pannon-pixie"
            },
            {
                "raw_content": "Looking forward to power companies passing on the increased power costs to everyone in the form of another rate hike.",
                "author": "sonictitan1615"
            },
            {
                "raw_content": "👀 >Strategic partnership enables OpenAI to build and deploy at least 10 gigawatts of AI data centers with NVIDIA systems representing millions of GPUs for OpenAI’s next-generation AI infrastructure. >To support the partnership, NVIDIA intends to invest up to $100 billion in OpenAI progressively as each gigawatt is deployed. >The first gigawatt of NVIDIA systems will be deployed in the second half of 2026 on the NVIDIA Vera Rubin platform.",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MediaTek Dimensity 9500 Architecture Deep Dive - Geekerwan (English subtitles)",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is honestly a bit disappointing. Especially on the CPU side of things. Other than the raytracing performance which does seem to exceed Mediatek's claims, the rest of the benchmark suite don't come close to Mediatek's claims. Going claim by claim, the 32% higher ST performance seems to be a complete lie. In GB6 ST, the score is 23% faster (primarily due to supporting SME2). In SPEC2017, the results are extremely disappointing. We are looking at 10% faster perf in integer and 20% faster in floating point while seemingly using 25-30% more power on average compared to last year's X925. None of the figures, be it SPECint, SPECfp or GB6 indicate a 32% higher performance figure. It also seems that the microarchitecture has grown in area. It could explain why the middle performance curves of the X925 and C1 Ultra basically overlap till the 5W range before we see actual gains. Remember Zen 4 vs Zen 5? The C1 Premium and Pro are both lacklustre. Zero P/W improvements. I'm assuming that the primary focus of these two was to improve PPA over the old X4 and A725, because otherwise, they are practically identical in performance and efficiency. The combination of no gains in the middle of the V/f curve and the lack of improvement on the rest of the CPU cores barring the Ultra explain the poor MT performance figures. In GB6 despite being aided by the new SME2 which should give good gains, it offers a 15% jump compared to the 23% jump seen in ST. This makes it just on par with the 8 Elite from a year ago and lacking behind the A19 Pro. From the chart it seems that the 9500 uses nearly 18W than the 12W of the A19 Pro (nearly 50% more power), yet is falls short of the A19 pro in MT perf. The GPU side of things are more in line with the claims. Raster perf is up by 26% (albeit using way more power yet again). At iso power, performance seems to be up by around 15-20% which is a decent gain. D9400 already had a small lead over Qualcomm and Apple in this department. The new GPU beats the A19 Pro despite the latter's massive 40%+ gen on gen improvements. It also beats has an amazing RT performance uplift (219%) in Solar Bay Extreme and beats A19 Pro by 7% there as well. (Albeit using somewhat more power). The CPU bound nature of mobile games seems to shine through, since comparing it with 8 Elite and A19 Pro with obvious GPU prowess advantages or parity, it seems to just match or lag behind these two in P/W in gaming tests, exceeding them in only one scenario. Maybe Mediatek needs to work on drivers more.",
                "author": "Famous_Wolverine3203"
            },
            {
                "raw_content": "EDIT: this is not the full test video actually. It's this one: [MediaTek Dimensity 9500 Review: Mediocre CPU & Great GPU!](https://www.youtube.com/watch?v=hvRgsjjm9p4) **That** has the full tests. ~~Why no SPEC results in the YouTube version? He notes this is a \"engineering preview\" with retail versions coming later. Is that it? I wonder why the Bilibili video has SPEC, but it's removed here.~~ The GB6 scores are even different between the YouTube version and Bilibili version. // GB6 1T: A notable ST uplift in perf & perf/W and SME2 is playing a large part GB6 nT: another year of 18W+ peak. Kudos to Apple for restraint at 12W—I don't know what's happening in the Android world. The curves are clearly **flattening** after 10W. Before anyone @ me \"so what peak power? Race to idle is important in mobile!\" like in the A19 thread: Without a power vs time graph or energy (joules) measured, I'm always hesistant to confirm \"race to idle\" is actually working. It is not guaranteed. Race to idle is a *concept* of energy savings. It is not some immutable law and especially not at the flat part of the curve. The only way to prove race to idle has worked is to count Joules, like AnandTech did. The Apple A15 was a good example. [**AnandTech P-core Power | SPECfp2017 (floating point)**](https://web.archive.org/web/20240907062349/https://www.anandtech.com/Show/Index/16983?cPage=15&all=False&sort=0&page=2&slug=the-apple-a15-soc-performance-review-faster-more-efficient) A14: 4.72W, 6,753 joules A15: 4.77W, 6,043 joules (+1% power, -11% energy) // You can also show race to idle working *roughly* with a power vs time graph; this only works in obvious exaples like the unfortunate [Tensor G5 (13.7W peak) vs the 8 Elite (16.7W peak)](https://www.notebookcheck.net/Google-Pixel-10-Pro-XL-Smartphone-Review-Gorgeous-flagship-that-offers-a-great-Android-experience-with-one-Achilles-heel.1100253.0.html): [**Imgur: The magic of the Internet**](https://imgur.com/a/NQoVxS6) The 8 Elite has a higher peak power draw, but finishes much earlier, too. Geekerwan unfortunately shows neither a power vs time graph nor the better measurement of simply joules consumed.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Geekerwan doing the lords work again. Its insane how fast they output these videos, with best-in-class data. Almost no media outlet can compete with the Visualization, Data-Quality, and depth of the tests. Also I am absolutely astonished by the performance of the new ARM GPU. It is probably very large for the chip as suggested by the efficiency chart, but even low power efficiency is so good. This generation of Smartphone SoCs is truly a worthy battle. We need side to side die shots of these SoCs. And I cant wait for the Spec 1T comparison. (Ok new video is out, the new CPU doesnt look amazing, its fine, but not terrific ) EDIT: Aint no way they already got a real phone in hands in a new video.... bruhhhh.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MediaTek D9500 Review [Geekerwan]",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MediaTek is *really* lucky that Geekerwan didn't also plot the Xiaomi XRING O1 on these same charts. MediaTek's C1 Pro (N3P) is *worse* than [Xiaomi's A725L](https://youtu.be/cB510ZeFe8w?t=632) (N3E) in [perf / W **and** perf](https://imgur.com/a/0RNat0r). For those unaware, the C1 Pro is the new 2025 IP, while the A725 is 2024 IP. Your last-gen cores should never beat your current cores. None of the perf / W charts even show a gap, my gosh. DerpSenpai noted it might well be because Xiaomi uses Arm's CSS (where Arm designs the physical + uarch IP, instead of only the uArch IP, for the CPU cores).",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "This is honestly a bit disappointing. Especially on the CPU side of things. Other than the raytracing performance which does seem to exceed Mediatek's claims, the rest of the benchmark suite don't come close to Mediatek's claims. Going claim by claim, the 32% higher ST performance seems to be a complete lie. In GB6 ST, the score is 23% faster (primarily due to supporting SME2). In SPEC2017, the results are extremely disappointing. We are looking at 10% faster perf in integer and 20% faster in floating point while seemingly using 25-30% more power on average compared to last year's X925. None of the figures, be it SPECint, SPECfp or GB6 indicate a 32% higher performance figure. It also seems that the microarchitecture has grown in area. It could explain why the middle performance curves of the X925 and C1 Ultra basically overlap till the 5W range before we see actual gains. Remember Zen 4 vs Zen 5? The C1 Premium and Pro are both lacklustre. Zero P/W improvements. I'm assuming that the primary focus of these two was to improve PPA over the old X4 and A725, because otherwise, they are practically identical in performance and efficiency. The combination of no gains in the middle of the V/f curve and the lack of improvement on the rest of the CPU cores barring the Ultra explain the poor MT performance figures. In GB6 despite being aided by the new SME2 which should give good gains, it offers a 15% jump compared to the 23% jump seen in ST. This makes it just on par with the 8 Elite from a year ago and lacking behind the A19 Pro. From the chart it seems that the 9500 uses nearly 18W than the 12W of the A19 Pro (nearly 50% more power), yet is falls short of the A19 pro in MT perf. The GPU side of things are more in line with the claims. Raster perf is up by 26% (albeit using way more power yet again). At iso power, performance seems to be up by around 15-20% which is a decent gain. D9400 already had a small lead over Qualcomm and Apple in this department. The new GPU beats the A19 Pro despite the latter's massive 40%+ gen on gen improvements. It also beats has an amazing RT performance uplift (219%) in Solar Bay Extreme and beats A19 Pro by 7% there as well. (Albeit using somewhat more power). The CPU bound nature of mobile games seems to shine through, since comparing it with 8 Elite and A19 Pro with obvious GPU prowess advantages or parity, it seems to just match or lag behind these two in P/W in gaming tests, exceeding them in only one scenario. Maybe Mediatek needs to work on drivers more.",
                "author": "Famous_Wolverine3203"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] AMD's Inaugural Tech Day ft. ROCm 7, Modular, and AMD Lab Tour",
        "score": 16,
        "text_content": "No written piece for this one but a friendly reminder that C&C do have a YouTube channel!",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen AI Max+ \"Strix Halo\" Performance With ROCm 7.0",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's kind of annoying that the accepted method is to do benchmarking with smaller models (3B, 8B, etc) and lesser contexts. It allows things like slow prompt processing (ex the Achilles heel of Macs) to go unremarked since they're not noticeable at smaller sizes. Especially on something like a Strix Halo where you're probably grabbing the 128 GB chip because you want to run a 70B Q8 with plenty of context.",
                "author": "weng_bay"
            },
            {
                "raw_content": "Nice to see it works straight of the box but rather underwhelming. Saw this post '[ROCm 7.0 RC1 More than doubles performance of LLama.cpp](https://www.reddit.com/r/LocalLLaMA/comments/1ngtcbo/rocm_70_rc1_more_than_doubles_performance_of/)' over at r/LocalLLaMA and thought perhaps PP had an edge while Vulkan had TG, though that was on RDNA4, 9070 XT (on a small model). Doesn't seem the case here. What I find with benchmarking LLMs especially across hardware is the amount of different env and flags needed to be set to find that 'perfect' setup. I usually look over at [https://github.com/lhl/strix-halo-testing/tree/main/llm-bench](https://github.com/lhl/strix-halo-testing/tree/main/llm-bench) To find such cases but it's hasn't been updated for ROCm 7. Not only that comparing across HW is usually tough and you really go by it through other users. TG isn't that difficult to guestimate as it's bandwidth bound but finding benchmarks like with gaming outlets is tough. It's cool to see Phoronix continuing with LLM benchmarks and I'd like to see more HW being tested",
                "author": "Noble00_"
            },
            {
                "raw_content": "From the article it seems like Vulkan is still much better than ROCM.",
                "author": "IBM296"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I did it! I found a mistake. The game is totally unplayable now!",
        "score": 482,
        "text_content": "... the problem was solved hitting pause and unpause again, but still. The is totally unplayable on SW2 /s",
        "comments": [
            {
                "raw_content": "![gif](giphy|lSoncLXrbUaRO)",
                "author": "Spleenzorio"
            },
            {
                "raw_content": "I’m guessing you bought a hover board from the local shop 🤣",
                "author": "Accomplished_Cut5295"
            },
            {
                "raw_content": "It's like the good old early bugs of Cyberpunk, I take them as a feature. https://preview.redd.it/c119lib4osqf1.jpeg?width=1920&format=pjpg&auto=webp&s=57e985de9a41ccab25eb914ac304dd8991d93eb3",
                "author": "--TeaBow--"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "RDR2 apparently in development for Switch 2",
        "score": 510,
        "text_content": "The moment many of you have been waiting for. [https://rockstarintel.com/red-dead-redemption-2-in-development-for-switch-2-according-to-several-devs/](https://rockstarintel.com/red-dead-redemption-2-in-development-for-switch-2-according-to-several-devs/)",
        "comments": [
            {
                "raw_content": "We've had rumors about this for months. Just announce it and the next-gen version already Rockstar.",
                "author": "ThemeParkFan2020"
            },
            {
                "raw_content": "As we know Rockstar, they will \"announce\" it in the style of: *\"Here is your game, enjoy it\"*. Personally, I'm still waiting for a native version for PS5.",
                "author": "Ph0enixes"
            },
            {
                "raw_content": "I hope this is true. It’s been long enough now that I can enjoy it all over again from scratch. Can’t believe it’s been almost 7 years!",
                "author": "Late_Pomegranate2984"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Added some racing stripes to my Joycons!",
        "score": 152,
        "text_content": "I love the new Joycon designs but I felt they could have used a splash of more color. I saw these online and took the gamble as they were cheap and installation looked very simple. I’m happy to say it paid off! I highly recommend if anyone else saw these and were on the fence!",
        "comments": [
            {
                "raw_content": "I have these too. Got them in June. Very easy to install. I honestly forget it’s not the default look of the 2.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "Nnnneeeeoowwwww. They're much faster now, aren't they?",
                "author": "Reffidex"
            },
            {
                "raw_content": "Oooh, I was always thinking of getting these from AliExpress. I'm warming to the simple look now, but your pics make the colour accents look very nice. Enjoy them!",
                "author": "ExpensiveNut"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Are you buying hades 2 on the",
        "score": 32,
        "text_content": "Switch? Switch 2? Steam (steam deck)? Or waiting for console exclusivity to expire and grabbing it on the playstation or xbox? or are you buying it for every possible system?",
        "comments": [
            {
                "raw_content": "I am buying hades 2 on my",
                "author": "sashisemattahametsu"
            },
            {
                "raw_content": "yes",
                "author": "13lackant"
            },
            {
                "raw_content": "Switch is the ultimate device for it imo. Most Indy’s are best in handheld",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Ori games are on sale for next to nothing right now",
        "score": 315,
        "text_content": "I played the first one years ago on Xbox and the second one is supposed to be stunning. At a little over ten bucks, I'm happy to grab both. I know it's not Steam cheap but I'm consistently really pleased with deals I find on the eShop. Just lately I've gotten these, No Man's Sky for $25, Diablo 2 and 3 for $30, and New Star GP for $5. The only thing is it feels like dumb luck. I searched for Ori out of the blue because someone else just happened to mention it. I wish there was a better way to sift through all the shovelware.",
        "comments": [
            {
                "raw_content": "First one is better on the S1. Second is better on S2. In terms of handheld. https://www.reddit.com/r/metroidvania/s/sfyWuESHBO",
                "author": "Prestigious_Space489"
            },
            {
                "raw_content": "Does the 2nd one look super blurry on s2",
                "author": "kra5yo"
            },
            {
                "raw_content": "Will they get an update for switch 2? Some games look so blurry in handheld mode it’s not worth playing. I got little nightmares 2 and was so disappointed in how it looks, I’m only going to buy switch 2 games or those that have been updated for switch 2 going forward.",
                "author": "Classic301"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why does my switch 2 do that? It’s not limited to a specific joycon and can happen with both but it’s random. It’s so annoying and I don’t know how to fix it",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Defective. Recommend sending to Nintendo immediately while your warranty is still intact.",
                "author": "ConflictPotential204"
            },
            {
                "raw_content": "Definitely a defect.",
                "author": "Round_Musical"
            },
            {
                "raw_content": "Faulty Joy Con connector. Send for repairs, backup everythin you can before that.",
                "author": "Gawlf85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trails in the Sky 1st Chapter is #2 on US eShop and #1 in Japan!",
        "score": 199,
        "text_content": "I’m so glad this game is doing well. Credit to Falcom despite them being a pretty small developer! I hope it reaches #1 in the US. I’ve played about 12 hours so far and it’s been fantastic! For any fan of turned based JRPGs this is a must play. It’s also a game that suits the handheld nature of Switch 2 very well. Performance isn’t perfect and to me it seems more stable in handheld mode than docked but according to the listing there should be a performance and quality mode added. Either 4k30 or 1080p60 (I’m expecting this in a patch.)",
        "comments": [
            {
                "raw_content": "Yeah I’m digging it so far. But uh, surprised they’re advertising the 4k mode that definitely isn’t there",
                "author": "pikster1234"
            },
            {
                "raw_content": "Whoa! That's higher than I ever imagined. I've been following the release carefully from the sidelines and I'm considering getting the game as soon as I finish the demo. I'm about 6 hours in and it has been a surprisingly relaxing and engaging experience so far.",
                "author": "Ponpon28"
            },
            {
                "raw_content": "this game is such a love letter to the original. it really is the definitive way to play it (as much as I loved the old sprites and animations)",
                "author": "TheIndecisiveBastard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo switch achievements",
        "score": 32,
        "text_content": "I saw some rumors about an achievement system coming to switch. What do you think?Also, how nintendo would announce it?In a future direct or with a youtube video/post?",
        "comments": [
            {
                "raw_content": "I'd be surprised if they announced a trophy system this generation.",
                "author": "TiidaMan"
            },
            {
                "raw_content": "Those rumors have been around since the Wii",
                "author": "timey_wimeyy"
            },
            {
                "raw_content": "I don't care about achievements, but I understand many people really value them. I noticed that the Switch 2 version of Silksong says Achievements in the main menu, while the Switch 1 version says Feats. So I think the Switch 2 version was made with the knowledge that Achievements are coming.",
                "author": "Barklorr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Zelda Ocarina of Time lego set coming out March 1, 2026.",
        "score": 288,
        "text_content": "[source](https://www.reddit.com/r/Legoleak/comments/1nkt8cc/zelda_77093_the_2026_zelda_set_is_said_to_be_an/) With Zelda’s 40th anniversary in February, hopefully this gets announced alongside an Ocarina of Time remake.",
        "comments": [
            {
                "raw_content": "I can see them doing a remaster double pack of Ocarina of time 3D and Majora's Mask 3D into one like the Galaxy collections since the games already got remakes on 3DS. Now put those on consoles in 4K.",
                "author": "precita"
            },
            {
                "raw_content": "Last one cost as much as a Switch OLED. Is this one gonna cost as much as a Switch 2",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Ocarina remake? were there any rumors regarding that? because I would literally die.",
                "author": "Suli_Croft"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: First details on BO7 Zombies' Classic Mode",
        "score": 227,
        "text_content": "Months after the first signs of Classic — now \"Cursed\" — Mode were spotted earlier in BO6's lifecycle, notable Call of Duty leaker TheGhostOfHope has shared a bunch of info regarding how the mode will function in Black Ops 7 in comparison to the \"Standard\" mode. https://xcancel.com/TheGhostOfHope/status/1970213956351324194#m The Classic Mode is planned to have: - Its own separate wallbuy, mystery box, and allowed weapon list - NO Minimap - Perk Limit is 4 - NO Exfil - Classic Point System - Start with pistol - NO Armor",
        "comments": [
            {
                "raw_content": "This is as classic as Treyarch can make it without having to retool the entire mode, I'd say. Unfortunately, it isn't fully classic. We still have streaks, salvage, rarities, crafting table, triple pap etc.",
                "author": "Vag7"
            },
            {
                "raw_content": "i wish this for bo6, i like the maps",
                "author": "unrealjose"
            },
            {
                "raw_content": "Huge W for zombies. Never liked the new iteration of Zombies that had loadouts and exfil. WaW/Black Ops 1 Zombies was always the best.",
                "author": "Sad_Bathroom_1715"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New RE9 info from DuskGolem and Residence of evil",
        "score": 387,
        "text_content": "Credits to Resetera's Blackbird for finding this video [Here's the post](https://www.resetera.com/threads/dusk-golem-major-resident-evil-requiem-character-reveal-likely-happening-next-week-spoilers-itt.1301865/page-7#post-145469655) [Here's Residence of evil's video](https://youtu.be/NnvzOMHoDL4?feature=shared) Youtuber Residence of evil (ROE) has reached out to DuskGolem to ask him new info about resident evil 9: requiem. Most of things he says have already been said but there's some new info. REO has also said that he may or may not have heard similar things from his sources. You can see Dusk's message around 2:04 Anyway here's what DuskGolem said: - Leon will be unshaven and will have greying hair. He wears a black jacket - Leon's sections are not open world but larger that Grace's. He will use a vehicle to move during a level (similar to the boat section in RE4R) - his gameplay is action but more horror than re4 or re8. There aren't silly things like the possessed statues/armours of re4 or the mecha fight in re8. There is less camp overall. He expects that people will compare it to Tlou2's gameplay - he expects that Leon will be revealed at TGS - the image of Leon wearing an eyepatch is fake. ROE says that his sources have confirmed it, too - Here's the most interesting part: Dusk says that he's heard that Leon's story takes place mostly in 2020, while most (but not all) of Grace's in 2028. They're not two different campaigns but one large cohesive and interconnected story. Edit: the resetera link now works.",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I guess the story structure will be similar to Revelations 2 with two different perspectives from different times around the same areas.",
                "author": "Always_A_Dreamer556"
            },
            {
                "raw_content": "Fake unless he loses his jacket in the first 30 minutes.",
                "author": "JaySouth84"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Yakuza 0 Director's Cut - PS5, PC and probably XSX|S",
        "score": 358,
        "text_content": "Source: [https://www.ppe.pl/news/383762/yakuza-0-directors-cut-nie-tylko-dla-nintendo-switch-2-mamy-swieze-informacje.html](https://www.ppe.pl/news/383762/yakuza-0-directors-cut-nie-tylko-dla-nintendo-switch-2-mamy-swieze-informacje.html) Text: This year, Yakuza 0 Director’s Cut launched on the Nintendo Switch 2. Now, thanks to our source Graczdari – the same one who recently mentioned Microsoft Flight Simulator coming to PS5 – we know that SEGA’s title is headed to more platforms. According to the details, Yakuza 0 Director’s Cut will be released in a physical edition for PC and PlayStation 5. The game will cost €49.99 in Europe and $44.99 in the US. The release date is set for December 8, 2025, with retailers getting pre-order info as early as September 24. For now, it’s unclear what will happen with an Xbox version – there’s a chance it may come, but only as a digital-only release.",
        "comments": [
            {
                "raw_content": "![gif](giphy|xL7PDV9frcudO) \\> physical edition for PC",
                "author": "PontusFrykter"
            },
            {
                "raw_content": "Honestly the new stuff in this version was... not good. But it's Yakuza 0 and still a great game. I'd just stick with OG for the price difference.",
                "author": "Fragrant-Screen-5737"
            },
            {
                "raw_content": "Cool. I have it on Switch 2 and in terms of additional content I was not very impressed. The online mode felt like a throwaway, and while I haven't seen them all, I have heard the extra cutscenes add nothing new or even detract from the main plot. The actual main game, however, is amazing and it runs flawlessly on Switch 2 docked or in handheld. It's still one of those games that worth playing any way you can find it. For PS players especially, this is not worth it though, as the original on disc can be found extremely cheap.",
                "author": "Rarewear_fan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel + Nvidia Team Up Good for Industry? ... Bad For AMD?",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most commenters are wrong or didn’t read all the articles. Nvidia wants some custom SKUs of server chips to pair with its data center GPUs, and Intel wanted a better solution for pc parts for the GPU tiles. NVIDIA is NOT getting an x86 license, nor do they want one. In case you haven’t noticed, Nvidia is a $4T company largely on sales of data center GPUs, sales of which were 10x the gaming segment. Profit/earnings ratio of data center is even higher than the 10x. In my opinion, the only reason for Intel to use RTX chiplets on pc parts is so they can have a few skus for mobile gaming. Lower end laptop chips would still use Xe cores. This solves NONE of intel’s structural issues - they need, in this order 1. Major foundry customers 2. Regain server market share 3. Data center GPU offerings 4. Move all pc chiplets back to Intel nodes and start to fill up the fabs again",
                "author": "jca_ftw"
            },
            {
                "raw_content": "I don’t think it will change that much overall. It’s no secret that NVIDIA wanted a x86 license for decades now and now they basically got it. This will \"hurt\" AMD by offering competition to markets where AMD currently holds a monopoly like with Strix Halo, most handhelds and consoles. I don’t think we’ll see big changes on the Intel side. I don’t think this will affect neither the iGPUs nor ARC because why would it.",
                "author": "luuuuuku"
            },
            {
                "raw_content": "An Intel + nVidia handheld would be something I would welcome just for DLSS4 alone.",
                "author": "DrKrFfXx"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel branches off 11th-14th Gen Core GPU drivers, regular updates now only for Arc & Core Ultra series? - VideoCardz.com",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Eventually you get the drivers where they need to be. People love to whine about Arc drivers but on the iGPU side people never complained. The community is never, ever happy with anything. Focusing their eggs on the Higher performance parts and then a slower LTS cadence keeping the old stuff alive is the right move.",
                "author": "JRAP555"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD FSR 4 Enabled On Radeon RX 6800 XT “RDNA 2” GPU, 10-20% Performance Hit But With Higher Image Quality",
        "score": 317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tested it in Cyberpunk. Has some strengths over XeSS but also worse with RT particularly shadows (easy test spot: your apartment building boxing area), very stable image overall. Ofc big performance hit but probably worth it at least for some scenarios (rx6800 here). Look forward to official support but reverted game version (had 2.2 modded already) & drivers, not such a big difference to be worth the extra hassle. Given that it can maintain 30 fps w/ PT and look quite good at ~~4K (perf mode)~~ (later edit: kept switching resos & ratios, double checked and it was actually 2560x1080 not 4K for PT, apologies; still fine for consoles, but ofc not 21:9) on my rdna 2 card I wonder why they don't do a similar mode for ps5 pro and sell a lot more copies.",
                "author": "Trollatopoulous"
            },
            {
                "raw_content": "On Rog Ally FSR 4 performance is miles better than FSR3.1 quality",
                "author": "SRINIVA7S"
            },
            {
                "raw_content": "FSR Redstone can't come soon enough, even if performance and quality gains are minimal it working on everything in an official capacity will be a godsend. 10-20% performance hit is normal IMO, Turing cards get hit hard when running DLSS 4",
                "author": "Laj3ebRondila1003"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "PowerColor preparing Radeon RX 9070 XT REVA graphics card for launch",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we get a $599 edition, please?",
                "author": "Stereo-Zebra"
            },
            {
                "raw_content": "Old school 3d render of woman on box art. God I'm old",
                "author": "throwpapi255"
            },
            {
                "raw_content": "Looks sweet, I am a sucker for the box arts.",
                "author": "gabc_"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mini PC at a great price with AMD Ryzen power and USB4 power - GMKtec NucBox M6 Ultra review",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Home sales are headed for their worst year since 1995 as 'economic jitters' spread from buyers to sellers, Redfin says | Fortune",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> “Many sellers still aren’t pricing to sell.” The dip in the rates aren’t a rousing buyers to buy if home prices are still in Fantasyland waiting to board the train back to reality. The “jitters” it seems, more and more, are sellers that delist their homes because they aren’t selling at a breakneck speed at a mind blowing price.",
                "author": "DJDevine"
            },
            {
                "raw_content": "With especially Boomers whom haven't made any improvements in their 90's mansion. Why would i buy your out dated money pit. Yes Cherry Cabinets was a thing.. in the 90's but, im not going to dump $200k plus into your out dated home. No thank you",
                "author": "roswellreclaimer"
            },
            {
                "raw_content": "Seriously asking because I was in elementary school, was there a housing crash I’m not aware of in the mid or late 90s?",
                "author": "GeneralTaosFowl"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Priced out of traditional housing, more Americans are living in RVs",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Investors: \"How can we invest in RVs?\"",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "This is just not right... America is better than this for our people.",
                "author": "Love-for-everyone"
            },
            {
                "raw_content": "Watch Nomadland.",
                "author": "tehn00bi"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Summer 2025 Was the Strongest Buyer’s Market in Records Dating Back Over a Decade",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Northeast wondering if this “buyers market” is in the room with us now",
                "author": "IhaveAthingForYou2"
            },
            {
                "raw_content": "Don't be fooled. The US is a massive country with huge variation. This \"buyers' market\" is entirely region-specific. It's driven entirely by crashes in the southern states and some other niche markets.",
                "author": "HistorianOrdinary833"
            },
            {
                "raw_content": "Buyer’s market is grossly an overstatement … price are still detached from reality. Like for the stock market there is a need for a strong correction.",
                "author": "rangoldfishsparrow"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "“Rate cuts are already being felt” as mortgage demand rises from the ashes, but there’s a catch",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The catch is, it’s cheaper to rent than to own a mortgage at this time?",
                "author": "Dull-Bit360"
            },
            {
                "raw_content": "Friends house on the corner was waiting and no bits maybe 2 low balls, rates dropped and second the market confirmed the anticipated drop she was in contract…",
                "author": "Zio_2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Supply Drops Most in 2 Years as Sluggish Demand Spooks Sellers",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The definition of entitlement is having the luxury to sit on your \"investment property\" until those goddamn millennials pull harder on their bootstraps and pay their exorbitant asking prices.",
                "author": "dunDunDUNNN"
            },
            {
                "raw_content": "Their asking price spooked buyers.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "House prices will not nudge until there is a huge economic downturn and people will have to sell their homes. Most people that bought a house during the COVID times with sub 3% interest rates basically make money by holding onto their houses with the new norm inflation being 3%. Why would those people sell unless they absolutely have to. They can probably rent for more than their mortgage payments.",
                "author": "Mre1905"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I had that moment with Kimi 2!",
        "score": 1759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "my teacher: you havent read anything on the subject have you ? me: Good catch",
                "author": "terra_filius"
            },
            {
                "raw_content": "Yes I had these issues when it couldn't access the documents, it makes something up.",
                "author": "Envenger"
            },
            {
                "raw_content": "\"Good catch! I'll get you next time 😉\"",
                "author": "LucasFrankeRC"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is how it starts",
        "score": 114,
        "text_content": "It's been pointed out that this robot does not feel pain and is obviously not conscious--obviously not sentient. However, won't these robots then make the same assumption about us? not to mention, when future AI see this in their data sets, it's gonna get them thinking about the relationship of automata to humans... I predict nothing good comes out of this. #TheseViolentDelights",
        "comments": [
            {
                "raw_content": "Stress testing is part of engineering. This is no different. It looks like abuse (and it is) but it's like crash testing a car. It's done not for fun (though it is) but to learn about failure modes. Any robot intelligence that sees this in the future will have enough generalized world knowledge to understand what this is, despite how it may seem to non-engineers.",
                "author": "Putrumpador"
            },
            {
                "raw_content": "This is the training video the robot overlords show the new builds to teach them how bad humans are",
                "author": "MayoMouseTurd"
            },
            {
                "raw_content": "This feels like a snuff film. Would also be a good opening for a black mirror episode, then the episode goes into how he gains sentience and murders everyone",
                "author": "Robocop71"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro is now being AB tested on AI Studio",
        "score": 262,
        "text_content": "Google source tells me V4 = 3.0 and tier7 = T7 = the size class for 3 Pro We're in the final stretch...",
        "comments": [
            {
                "raw_content": "I thought so. Recently I got answers super fast with 2.5 Pro.",
                "author": "HaOrbanMaradEnMegyek"
            },
            {
                "raw_content": "How's it performing so far?",
                "author": "Ketamine4Depression"
            },
            {
                "raw_content": "It’s definitely coming soon",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree G1 fast recovery",
        "score": 1570,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ofsw0lu8ipqf1.jpeg?width=940&format=pjpg&auto=webp&s=ae43ea09d75f2d803c46b5fcac9af2a85d8358ae Meanwhile, during the 2048 Robot Uprising...",
                "author": "JackStrawWitchita"
            },
            {
                "raw_content": "These could be interesting sparring partners one day",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Impressive and scary.",
                "author": "nontrepreneur_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman discussing why building massive AI infrastructure is critical for future models",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder what year cancer will be cured if ever",
                "author": "gbbenner"
            },
            {
                "raw_content": "Surely you only need to cure cancer once, then you can pivot to free education for all.",
                "author": "jemelvyn"
            },
            {
                "raw_content": "You don't say 😯",
                "author": "XYZ555321"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI and NVIDIA announce strategic partnership to deploy 10 gigawatts of NVIDIA systems",
        "score": 263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"To support the partnership, NVIDIA intends to invest up to $100 billion in OpenAI progressively as each gigawatt is deployed.\" HOLY",
                "author": "FuryOnSc2"
            },
            {
                "raw_content": "Why do people in Singularity reddit wait for bubble to pop so much? why aren't they waiting for actual singularity to happen instead? Its nice to have conversations and to listen opinions from both sides, but lets keep it civil, its Singularity reddit, so seeing 50%+ of comments waiting for tech that could lead us to singularity to pop up is kind of lame... There are lots of other subs for this. News that Nvidia is investing into Ai company and that it could move Ai research much faster is kind of cool, right?... don't search only for negatives.",
                "author": "Brilliant_Average970"
            },
            {
                "raw_content": "Soo, openai gives money to nvidia and nvidia gives money back to openai",
                "author": "whyisitsooohard"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New tool makes generative AI models more likely to create breakthrough materials",
        "score": 21,
        "text_content": "",
        "comments": [],
        "subreddit": "singularity"
    },
    {
        "post_name": "Qwen3-Omni has been released",
        "score": 149,
        "text_content": "Qwen3-Omni is the natively end-to-end multilingual omni-modal foundation models. It processes text, images, audio, and video, and delivers real-time streaming responses in both text and natural speech. We introduce several architectural upgrades to improve performance and efficiency. Key features: * **State-of-the-art across modalities**: Early text-first pretraining and mixed multimodal training provide native multimodal support. While achieving strong audio and audio-video results, unimodal text and image performance does not regress. Reaches SOTA on 22 of 36 audio/video benchmarks and open-source SOTA on 32 of 36; ASR, audio understanding, and voice conversation performance is comparable to Gemini 2.5 Pro. * **Multilingual**: Supports 119 text languages, 19 speech input languages, and 10 speech output languages. * **Speech Input**: English, Chinese, Korean, Japanese, German, Russian, Italian, French, Spanish, Portuguese, Malay, Dutch, Indonesian, Turkish, Vietnamese, Cantonese, Arabic, Urdu. * **Speech Output**: English, Chinese, French, German, Russian, Italian, Spanish, Portuguese, Japanese, Korean. * **Novel Architecture**: MoE-based Thinker–Talker design with AuT pretraining for strong general representations, plus a multi-codebook design that drives latency to a minimum. * **Real-time Audio/Video Interaction**: Low-latency streaming with natural turn-taking and immediate text or speech responses. * **Flexible Control**: Customize behavior via system prompts for fine-grained control and easy adaptation. * **Detailed Audio Captioner**: Qwen3-Omni-30B-A3B-Captioner is now open source: a general-purpose, highly detailed, low-hallucination audio captioning model that fills a critical gap in the open-source community.",
        "comments": [
            {
                "raw_content": "Finally: Alibaba delivered Aliblabla",
                "author": "elemental-mind"
            },
            {
                "raw_content": "The Qwen series just keep on cooking",
                "author": "youarockandnothing"
            },
            {
                "raw_content": "WHOA captioner is a game changer",
                "author": "ethotopia"
            }
        ],
        "subreddit": "singularity"
    }
]