[
    {
        "post_name": "JUST IN: Indianapolis officer shot four times while detaining a group of ‘teens’ during attempted carjacking arrest; one suspect dead 20-year-old Mandrell Ballard immediately fled when the stolen vehicle",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any one of these could kick off the next George Floyd riots.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "JUST IN: Indianapolis officer shot four times while detaining a group of ‘teens’ during attempted carjacking arrest; one suspect dead 20-year-old Mandrell Ballard immediately fled when the stolen vehicle Three others — Mahki Starks, 19, (driver), Malique Starks, 19, (passenger), and Tyson Reach, 19, — exited the vehicle and tried to walk away Reach pulled out a handgun, and fired while Officer Renteria was distracted Officer Renteria fired back. Reach died nearly a month later from his injuries The other suspects were later arrested Officer Renteria is recovering from his injuries",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Future doctors engineers and astronauts seasoning wypipo's society",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Surprise, Motherfuckers!",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start with Portland. That's the primary hive.",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "I hope they move the goons to judges OUTSIDE of the cities otherwise they will just get let out immediately",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "FAFO time. Hard lessons incoming for masked indoctrinated college students incoming. Welcome to the school of hard knocks.",
                "author": "saltyviewer123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Jeanine is angry 😠... DOJ Seeks 18 Months in Prison For Rabid Leftist Who Spat on Ed Martin and Kicked US Marshals",
        "score": 688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spitting on somebody IS ASSAULT. Dumbass leftists.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Who's going to take care of her dog? Lmao",
                "author": "irongeek"
            },
            {
                "raw_content": "I hope Ed is current on his tetanus shot. He might want to get checked for rabies, AIDS, and Monkey Pox, too.",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The FBI has just FIRED agents who were photographed kneeling during the 2020 George Floyd riots, per AP.",
        "score": 1786,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire *all of them* and rehire the ones who pass a MAGA test",
                "author": "TRUMPMAGASUPERFAN"
            },
            {
                "raw_content": "Fire the person who hired these retards.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "fire the fattie still standing up .",
                "author": "cptkloss5"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump has officially petitioned the Supreme Court to allow him to END birthright citizenship once and for all",
        "score": 1684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the most important issue of the past 100 years. What the courts need to realize is that we are asking for permission to do this peacefully. The alternative option is not pleasant to think about and involves something very close to a civil war.",
                "author": "Jack_NC"
            },
            {
                "raw_content": "Charlie Kirk was the last straw. We’ve had enough",
                "author": "Greenhills"
            },
            {
                "raw_content": "Birthright citizenship never applied to illegals. It was always meant for real immigrants who clearly demonstrated they had the intent to become citizens. It can be as easy as the kids earn citizenship when the legal immigrant parent does.",
                "author": "DLane1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thank you for your attention to this matter",
        "score": 1396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now we can hire teens to clean, wash cars, landscape and work at fast food places.",
                "author": "irescreams"
            },
            {
                "raw_content": "Try 40-50 million",
                "author": "highenergywinning"
            },
            {
                "raw_content": "20 million would be a good start. Need to deport 50-100 million in all.",
                "author": "deplorablebot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dept. of State - Earlier today, Colombian President Gustavo Petrode stood on a NYC street and urged U.S. soldiers to disobey orders and incite violence. We will revoke Petro’s visa due to his reckless and incendiary actions.",
        "score": 950,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s an act of war. He shouldn’t be allowed to leave.",
                "author": "AmericanHeroSandwich"
            },
            {
                "raw_content": "If you did that in Colombia you’d go to prison.",
                "author": "vongregormench"
            },
            {
                "raw_content": "Bag him, tag him, and send him over on one of OUR military planes, in chains.",
                "author": "DebunkTheLeft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD VANCE: \"I listen to Kamala Harris for 90 seconds and I feel like I've gotten dumber in the process.\"",
        "score": 1359,
        "text_content": "",
        "comments": [
            {
                "raw_content": "and also she's a whore",
                "author": "austford"
            },
            {
                "raw_content": "Needs to be unburdened by what has been.",
                "author": "airborne3502"
            },
            {
                "raw_content": "When she speaks, demons cheer.",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: Ice Cube’s tour bus was firebombed in Portland. The fire is currently under investigation, and officials are reviewing security footage from nearby cameras. -- Please don’t tell me some leftist mistook the large “ICE CUBE” sign on the side of the bus for a reference to ICE, the federal....",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know damn well that's what happened!",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "There is a non-zero chance that's exactly what happened. Wow.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "Yeah, get right on that investigation for Mr. \"Fuck tha Police.\"",
                "author": "Bastard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MULTIPLE DOJ and FBI officials are planning to RESIGN following the indictment of James Comey, per MSNBC’s Dilanian This is GREAT news!",
        "score": 1853,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Swamp drains itself!",
                "author": "eclectic22"
            },
            {
                "raw_content": "These are the ones we want out of there",
                "author": "FKH2"
            },
            {
                "raw_content": "Top brass is saying every agent is honorable. 😒",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The easiest verification yet -",
        "score": 865,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Select all squares with FEDS",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Even a robot could pass this one.",
                "author": "Bastard"
            },
            {
                "raw_content": "Even an FBI agent could ace this one.",
                "author": "CaptRied"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MASSIVE NEWS: Ohio is slated to give Republicans a net-gain of SIX SEATS in Congress after redistricting for 2026, Senator Bernie Moreno says. Ohio currently has 10 Republicans and 5 Democrats; the new map could be 13 REPUBLICANS and just *2* Democrats, per Punchbowl.",
        "score": 1576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the way. F all the libs yelling about muh fairness when they’ve never been fair their whole life. Who cares about their screeching….TIME FOR OFFENSE NOT DEFENSE.",
                "author": "TrumpTrainChoooChoo2"
            },
            {
                "raw_content": "Thanks Gavin! You wanted a national re-districting war, you got one!",
                "author": "CactusPete"
            },
            {
                "raw_content": "As it should be! Why would these massive GOP states give representation to democrats when the votes are not there? It’s really simple.",
                "author": "jatergator"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Comey Spells With Seashells By The Seashore",
        "score": 926,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope this smug faggot rots. And not in white collar resort prison no, i want him going to federal pound him in the ass prison",
                "author": "Pepe_longcockings"
            },
            {
                "raw_content": "Garrison: https://grrrgraphics.com/james-comey-cartoon-flashback/",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "We're taking command of the ship",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“PERSON 1” in James Comey’s Indictment is Hillary Clinton",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, didn't expect to see this coming",
                "author": "Bongos"
            },
            {
                "raw_content": "Welp James it's suicide time bro....good luck.",
                "author": "CrackerSmurf2"
            },
            {
                "raw_content": "Lock",
                "author": "flyover_deplorable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meanwhile outside the UN… Chinese women driving around NYC with a massive anti-CCP float with Xi Jinping face covered in a virus",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should park that out front of Gavin Newscum's house. Lady's a beast...No CCP!",
                "author": "BlackLightsMatter2"
            },
            {
                "raw_content": "Based",
                "author": "Chodeus"
            },
            {
                "raw_content": "I love my fellow Chinese-American people spez: spelling",
                "author": "chinigga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A drunk Kamala Harris showed up to Howard University today to sell her book: “It was the closest election for president of the United States in the 21st Century. Periodt. Periodt. And a Howard grad did dat”",
        "score": 733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It was a landslide loss, even with your cheating.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Dumber than a dumb nail. Period.",
                "author": "nemonster"
            },
            {
                "raw_content": "Imagine naming a university after a duck from a movie. No wonder they had to bring in students from Montreal to fill the classes.",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based Catherine Herridge… one of the few real journalists",
        "score": 1297,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Comey is a raging faggot who never thought in a million years that Trump would ever be back in office or power again so he blatantly broke the law because he knew the illegitimate biden autopen regime would allow him to do so freely because they were in cahoots. Fast forward to now and it's FAFO time.",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Imagine how much more unified the country would be without MSM",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Sharyl Attkisson is another real journalist.",
                "author": "OlivaireBandaloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reuters cares more about opposing Trump than the well-being of Americans",
        "score": 1545,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The corporate media supports the $cience, BIGOT!",
                "author": "loooooof"
            },
            {
                "raw_content": "Reuters was established and is run by MI6. Of course they think that. The UK is an evil, enemy empire. Pick up a history book that goes back beyond the 20th century.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Tylenol harms the development and function of the blood brain barrier. Males already have a weaker bbb than girls which is part of why around ninety percent of autists are male. If you haven't noticed, they attack our men and then import foreign men. Over eighty percent of \"migrants\" are military age males.",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal Alien superintendent of Des Moines Public School system had a salary of over $300k per year.",
        "score": 1562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seriously someone's gotta answer to his personnel file. If i want to go help volunteer for ANY FUCKING THING at my kids school i have to submit to full body scans and fill out background check paperwork.... But this **FUCKING THIEF** can just get hired on as a superintendent.... wtf",
                "author": "RealTXPatriot"
            },
            {
                "raw_content": "Arrest the school board for hiring him",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Had.",
                "author": "Overtaxed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE Just Arrested the Superintendent of the Largest School District In Iowa",
        "score": 1770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, the Super received deportation orders in May 2024. He had plenty of notice.",
                "author": "Stolen"
            },
            {
                "raw_content": "\"They only do the jobs Americans dont want to do\"",
                "author": "MAGASQUAD"
            },
            {
                "raw_content": "\"We have no confirmed information as to why Dr. Roberts is being detained\" You cannot hate the media enough. How in the FUCK is an ILLEGAL becoming a fucking SUPERINTENDENT",
                "author": "darkmodeforgotpass"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Samsung takes a scalpel to its 2nm wafer price tag, bringing it down to $20,000 — Korean chipmaker now undercuts rival TSMC by 33%",
        "score": 421,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn't SF2 kinda like TSMC N3 anyways? Suspect this is RTX 60 bidding.",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "It makes sense it's undercutting it by that much, because it's very unlikely SF2 is actually competitive with N2... Morgan Stanley claims that a N3 wafer is \\~25K by 26', so this would be undercutting that too by \\~20% as well.",
                "author": "Geddagod"
            },
            {
                "raw_content": "Competing on price is a normal thing for Samsung fabs, there's no escaping the fact that their leading edge nodes are always behind TSMC. On the bright side, they're ahead of Intel and GF. Second place isn't a bad place to be when 1st place is sold out, 3rd place can't do anything right and 4th place has given up. They will no doubt get customers from this from this move.",
                "author": "SignalButterscotch73"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New U.S. gov't rule says chipmakers have to make one chip in the US for each chip imported from another country to avoid 100% tariffs — Trump admin allegedly preps new 1:1 chip export rule under new tariff plan",
        "score": 454,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">However, WSJ does not disclose how exactly the U.S. government plans to count the number of imported ICs as chips differ in complexity, performance, cost, and value. One million application processors for smartphones, such as Apple's A19/A19 Pro, are not equal to a million of high-performance AI accelerators, such as Nvidia's B300.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Orders for single-transistor chips made in U.S.A. skyrocket into the trillions (they ordered one wafer).",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "Looks like 8080 is back on the menu.",
                "author": "username_taken0001"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[The Verge] Microsoft and Asus open Xbox Ally preorders — the X costs $999",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "christ those prices are horrendous",
                "author": "deefop"
            },
            {
                "raw_content": "Add $50 and you can get a Steam Deck OLED and the Switch 2 Mario Kart World bundle instead. Or go for the Steam Deck LCD and use the extra money on games.",
                "author": "HisDivineOrder"
            },
            {
                "raw_content": "UK price is 799 GBP so the US price is definitely tariffed.",
                "author": "Dangerman1337"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Raspberry Pi 500+ puts the Pi, 16GB of RAM, and a real SSD in a mechanical keyboard | Keyboard uses low-profile Gateron Blue switches and an RP2040 controller.",
        "score": 138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Micro-HDMI when a full size will fit? Ew",
                "author": "calcium"
            },
            {
                "raw_content": "Neat form-factor and all but why would anyone want this over a Mac Mini or any x86-64 box? Pi SoCs just aren't worth it beyond the $50 mark, soo many better options if you aren't interfacing through GPIOs and such.",
                "author": "autumn-morning-2085"
            },
            {
                "raw_content": "After getting a RPi 5, I was surprised by how slow the GPU was in comparison to the CPU. Makes sense since a huge chunk of Rpi's run headlessly, but the bare minimum I expected was to be able to run basic desktop tasks at a 4K 60 with super light desktop managers, maybe watch a youtube video. Nope, anything beyond 1080p60 like 1440p60 or 4K60 display resolution, it croaks and slows down to a halt because of bad GPU performance for the simplest tasks like dragging a basic window, or scrolling a webpage. Not sure what the target market is for these. If you wanna use it for Gpio, you'd get a Pico W, and even an older Pi would suffice if you wanted more compute and ssh access.",
                "author": "DM_Me_Linux_Uptime"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Scientists unveil world's first quantum computer built with regular silicon chips",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is like the 20th world’s first quantum computer I’ve seen this year",
                "author": "Adventurous_Tea_2198"
            },
            {
                "raw_content": "Not really that useful if you still need exotic cooling.",
                "author": "nanonan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Demystifying Apple’s AMX accelerator: when and why it outperforms the GPU",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Huh, so it turns out SME2 *is* AMX, just with an official arm extension and instructions.",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hybrid Quantum-Classical: Europe’s First Exascale Computer Connects to D-Wave",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 size comparation to a modern mid range gpu",
        "score": 165,
        "text_content": "This makes the switch 2 way more impressive honestly",
        "comments": [
            {
                "raw_content": "Looks like a high end pny varient 4080/super. What card is that?",
                "author": "Linkpharm2"
            },
            {
                "raw_content": "To be fair, >1/3 of that gpu’s length is just heatsink.",
                "author": "xjffy"
            },
            {
                "raw_content": "Yep",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "a faithful combo",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Me when I finally get my Switch this month",
                "author": "RykariZander"
            },
            {
                "raw_content": "Funny meme. Reminds me of when my 3DS used to be an Ocarina of Time machine or my Switch 1 was a Breath of the Wild machine. But seriously, go download Fortnite. It's great on Switch 2. There are also a ton of cool demos including Street Fighter, Donkey Kong Bananza, Persona 3 Reload, and Elliot. If you love Mario Kart World, more power to you, but there's plenty of fun to be had even if you can't afford another game right now before even considering the Switch 1 library.",
                "author": "kyuubikid213"
            },
            {
                "raw_content": "Couldn't be more relatable",
                "author": "TabouletVR"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pac-Man World 2 is better than I expected!",
        "score": 294,
        "text_content": "Few screens I took , The switch 2 version runs great at 60fps",
        "comments": [
            {
                "raw_content": "This was one of the first games I ever owned all the way back on the Gamecube. I still have the original box too, but lost the disc decades ago.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "I’m surprised so many people are complaining about the price. $30 is such a steal for a new game nowadays. Especially for a nostalgic, solid platformer like this game.",
                "author": "themagicnipple69"
            },
            {
                "raw_content": "Looks tempting, NGL",
                "author": "foxwhisper85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hard to believe it's now been over a year since these leaked",
        "score": 1434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm starting to think these might be real",
                "author": "marshalldylan93"
            },
            {
                "raw_content": "Looking back , it was such wildtime to experience first-hand. I hope some YouTuber makes a comprehensive video about this. LOL",
                "author": "RealGazelle"
            },
            {
                "raw_content": "This is clearly fake, OP. No way Nintendo would just make a \"it's the same, but better\" style of design, not the Nintendo I know since my childhood. They are innovators by nature, nothing like Sony.",
                "author": "Douglas12dsd"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pro Controller Update",
        "score": 73,
        "text_content": "I posted this morning about my return of an S2 Pro Controller for having Dpad issues. I noticed it the most on NES Punch-Out! Well the new controller works great. The Dpad is way more responsive and I can play with ease. Thanks for the suggestion to return it even after a previous return. Have a great weekend 💪🏼👾🎮🤘🏼",
        "comments": [
            {
                "raw_content": "Glad the new controller is working well ! Please crop the toes out next time 👍🏼lol",
                "author": "FCA_Eughhh"
            },
            {
                "raw_content": "What are those?! JK cool controller",
                "author": "heroefalso"
            },
            {
                "raw_content": "🦶",
                "author": "Working-Strategy4026"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The facts about the Donkey Kong Bananza DLC.",
        "score": 28,
        "text_content": "I posted a link to my topic on GamFAQs because I have a bunch of pictures of the DLC so you can see what it comes with. The only picture I forgot to add is the one of the Banandiumtone that gives you a Quick-Change Tie (The only thing I haven't unlocked yet.). This is not to convince anyone to buy the DLC. I just want to clarify what it comes with so people can make an informed decision.",
        "comments": [
            {
                "raw_content": "It pleases me that GameFAQs is alive and well",
                "author": "jj_sykes"
            },
            {
                "raw_content": "I'm not convinced it is worth 20 bucks right now. But my video game budget is mostly allocated for a while, so maybe I'll change my mind later.",
                "author": "Williekins"
            },
            {
                "raw_content": "I hate how you need to type the URL of each image in the search bar one at a time just to see them individually if you don’t have a GameFAQs account.",
                "author": "Excaliburn3d"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 512GB SD cards for £79.99",
        "score": 78,
        "text_content": "I just saw this is back in stock and ordered one https://www.express.co.uk/life-style/science-technology/2113940/nintendo-switch-2-cheapest-ever If you select delivery to local post office you get the £3.99 delivery fee knocked off as well. I have been looking for deals for ages as I've almost filled my S2 storage now",
        "comments": [
            {
                "raw_content": "I ordered this. Didn't see the option for post office collection, but didn't mind too much. Still a decent price and good to see them actually available here.",
                "author": "Charlie-Bell"
            },
            {
                "raw_content": "Posted this the other day. Looks like tis back in stock",
                "author": "Kamikaizen7"
            },
            {
                "raw_content": "Do you have have a link not involving that scummy title?",
                "author": "__ma11en69er__"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New York Times: One of the buyers for Electronic Arts is Jared Kushner's investment firm",
        "score": 401,
        "text_content": "Source: [https://www.nytimes.com/2025/09/26/business/electronic-arts-buyout-jared-kushner.html](https://www.nytimes.com/2025/09/26/business/electronic-arts-buyout-jared-kushner.html) Article Highlights: >Jared Kushner’s private equity firm and a group of large investors are in talks to buy out the video game company Electronic Arts in what could be one of the largest such deals ever, according to two people briefed on the discussion. >Mr. Kushner’s firm, Affinity Partners, along with other investors including the Saudi sovereign wealth fund and Silver Lake Partners are in talks to take the publicly traded company private. >The people, who requested anonymity because the talks are confidential, said a deal could value the company, the maker of such popular games as Madden N.F.L. and Battlefield, at around $50 billion. >Private investors see opportunity in E.A.’s suite of intellectual property. Porting some of those marquee titles to mobile devices and making them free-to-play, but then charging players for certain features in the game, could help them reach a wider audience of new users. >Such drastic strategic moves would likely cut into E.A.’s quarterly profits, a difficult proposition for executives who face the scrutiny of the public markets. A take-private deal could give the company the ability to make significant overhauls without the demands of quarterly earnings reports.",
        "comments": [
            {
                "raw_content": "LOL it literally says they wanna buy them to turn it into a microtransaction shitshow. LOOOOL private equity truly is the cancer of society, absolute vultures",
                "author": "Shining_Commander"
            },
            {
                "raw_content": "Mood after that headline: ![gif](giphy|JtQc9M7l1KUGQ)",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Man just let them finish the 3rd Jedi game before they totally fuck EA into the ground",
                "author": "MoistToweletteLover"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 Campaign Will be Very Disappointing",
        "score": 772,
        "text_content": "Tom Henderson and [BifFryTV](https://www.youtube.com/watch?v=AHR3gAs047I) report that Battlefield VI Campaign isn't looking good: [Tom Henderson:](https://xcancel.com/_Tom_Henderson_) >I know a lot of people won't play Battlefield 6 for the campaign, but it looks like it needs a lot of work. It probably makes what would be a high 80s/low 90s Metacritic game a mid-70s at the moment. BigFryTV: >I was able to play three missions from Battlefield 6's single-player campaign. The developers invited me to test these missions, and unfortunately, in contrast to the incredible multiplayer experience, the campaign suffers from a clear lack of polish and, even more seriously, a lack of fun. At best, what we have here is an okay campaign. But when we look around and see how other companies do it, the comparison is inevitable. After playing these three missions, I can say with confidence: single-player mode will be the weakest part of Battlefield 6.”",
        "comments": [
            {
                "raw_content": "That building clearing part of preview looked like Temu version of 2019 Modern Warfare campaign",
                "author": "markusfenix75"
            },
            {
                "raw_content": "They need to put a rat QTE to save the campaign.",
                "author": "Mako__Junkie"
            },
            {
                "raw_content": "Saw the trailer and it showed basically nothing",
                "author": "Blanketshaper"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Wolverine's 2026 release date corroborates prior Insomniac leaks - and potentially its future schedule.",
        "score": 197,
        "text_content": "Below is a list of previous leaks, including Wolverine 2026. Most of the images/concept art have been taken down though. https://www.reddit.com/r/GamingLeaksAndRumours/comments/18lvqor/insomniac_leaks_compilation/",
        "comments": [
            {
                "raw_content": "The 7 resistance fans left on the planet ![gif](giphy|2WxWfiavndgcM)",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "I mean this leaks are no good anymore Venom is delayed Spiderman 2 didnt got any dlc So either insomniac changed their plans after the leaks Or those leaks were already old when they got leaked and insomniac didnt stick to them",
                "author": "Esnacor-sama"
            },
            {
                "raw_content": "The thought of Spider-Man 3 possibly being a PS6 exclusive is just sad. Back in the past we used to get entire trilogies or sometimes even more than that in a single console generation. Now, we’re getting trilogies across three generations.",
                "author": "GGG100"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "WSJ: Videogame Giant Electronic Arts Near Roughly $50 Billion Deal to Go Private (private equity firm Silver Lake and Saudi Arabia's PIF included in group of investors)",
        "score": 494,
        "text_content": "https://www.wsj.com/business/deals/ea-private-deal-buyout-video-game-maker-808aefec > Videogame maker Electronic Arts is nearing a deal to go private in what would likely be the largest leveraged buyout of all time, according to people familiar with the matter. > > A group of investors including private-equity firm Silver Lake and Saudi Arabia’s Public Investment Fund could unveil a deal for the publisher best known for its sports games as soon as next week, the people said.",
        "comments": [
            {
                "raw_content": "This is nuts",
                "author": "Fidler_2K"
            },
            {
                "raw_content": "Btw silver lake is one of the equity firms buying TikTok",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Yeah, getting private equity firms involved is not going to end well at all for EA. Private equity firms are notorious for buying a bunch of companies, selling off all of their owned properties in pieces, and then they start slowly destroying the company from the inside out until they're nothing but an empty husk of what they once were. EA isn't going to survive this.",
                "author": "Minimum-Can2224"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Square Enix might be announcing something FF9 related fairly soon, maybe the remake?",
        "score": 207,
        "text_content": "Wizards of the Coast who make Magic the Gathering have announced a bunch of new Final Fantasy MTG card products here in the last few hours and showed images of all the products including the cards EXCEPT for Final Fantasy 9 which they said will be revealed by Square Enix. Will they announce the remake along with it? https://xcancel.com/wizards_magic/status/1971647298619711626",
        "comments": [
            {
                "raw_content": "I'm not getting my hopes up again.",
                "author": "Steve2911"
            },
            {
                "raw_content": "The Silksong torch must be passed on to a new tribe. So it is written.",
                "author": "Rozwellish"
            },
            {
                "raw_content": "Imagine if it looked similar to the Dragon Quest 7 remake that's coming and is a similar style. That would explain why it's taking too long if the game is still happening.",
                "author": "arkhamtheknight"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "HUNTR/X will headline Fortnitemares this year (alongside Scooby Doo's gang and Ghostface) and they'll have more than just skins",
        "score": 169,
        "text_content": "https://xcancel.com/HYPEX/status/1971637158617534758?t=mwCe8gw1Y6O1inbZLX-hlA&s=19",
        "comments": [
            {
                "raw_content": "FIT CHECK FOR MY NAPALM ERA",
                "author": "WolfCola723"
            },
            {
                "raw_content": "This will feed Epic Games employees’ families for generations",
                "author": "Scarlet-Highlander-"
            },
            {
                "raw_content": "Well that takes \"What's new Scooby Doo, we're coming after you\" to a whole different level",
                "author": "Sambadude12"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD enables Windows PyTorch support for Radeon RX 7000/9000 with ROCm 6.4.4 update",
        "score": 321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is huge for those that run any kind of AI workloads locally, I use a lot of those on Nvidia GPUs, making Radeon cards also viable and with good VRAM was long overdue",
                "author": "BUDA20"
            },
            {
                "raw_content": "rx 7800xt not included is some bullshit",
                "author": "pwet123456789"
            },
            {
                "raw_content": "Great, but where to download it? Is it part of Adrenaline or as a standalone?",
                "author": "patricious"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "One of the most powerful mini PCs of 2025! Minisforum MS-S1 Max review - AMD Strix Halo Power, 128 GB RAM & Radeon 8060S for professionals & AI",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Price is bonkers, sadly.",
                "author": "MaverickPT"
            },
            {
                "raw_content": "ridiculous pricing",
                "author": "proudh0n"
            },
            {
                "raw_content": "They're obv trying to make a more premium product, so not gonna hold it against them.",
                "author": "Relevant-Audience441"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Enables PyTorch on Radeon RX 7000/9000 GPUs with Windows and Linux Preview",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm glad they've finally gotten PyTorch to use ROCm, but it's a shame more computational routines/libraries don't use Vulkan... you can already get LLMs working on GPUs as old as GCN 2.0 (RX 300-ish) on that. The one thing Vulkan can't access (yet) are the tensor cores... hopefully we'll see that soon.",
                "author": "A_Canadian_boi"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Millions of Americans Are Becoming Economically Invisible aka why homes are so expensive but the market doesn't seem to care",
        "score": 15,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Core inflation rate held at 2.9% in August, as expected, Fed’s gauge shows",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Doesn't matter if I can't afford to buy a vehicle anymore. Not buying a $60k midsize truck. These greedy corporations can pounds sand. I'll go without",
                "author": "bannedaccountnumber4"
            },
            {
                "raw_content": "What about the non-core inflation that includes some of our biggest expenses, food and energy?",
                "author": "Comprehensive_Quit30"
            },
            {
                "raw_content": "So, 3% more on top of the 30% people are struggling with.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "\"Sam Altman says GPT-8 will be true AGI if it solves quantum gravity — the father of quantum computing agrees\"",
        "score": 264,
        "text_content": "[https://www.windowscentral.com/artificial-intelligence/sam-altman-says-gpt-8-could-achieve-true-agi-if-it-solves-quantum-gravity](https://www.windowscentral.com/artificial-intelligence/sam-altman-says-gpt-8-could-achieve-true-agi-if-it-solves-quantum-gravity) Keyword: \"If.\" \"According to Sam Altman: *\"You mentioned Einstein and general relativity, and I agree. I think that's like one of the most beautiful things humanity has ever figured out. Maybe I would even say number one... If in a few years... GPT-8 figured out quantum gravity and could tell you its story of how it did it and the problems it was thinking about and why it decided to work on that, but it still just looked like a language model output, but it was the real- it really did solve it...\"*\"",
        "comments": [
            {
                "raw_content": "People are saying that if I solved quantum gravity, I too would be very smart",
                "author": "Main-Company-5946"
            },
            {
                "raw_content": "And if my grandmother had two wheels, she'd be a bicycle.",
                "author": "enigmatic_erudition"
            },
            {
                "raw_content": "Remember when the goal posts included things like high school algebra?",
                "author": "acutelychronicpanic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Epoch AI Research says GPT-5 used less overall compute than GPT-4.5 in training, they believe GPT-6 will begin to use more again",
        "score": 154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds true given the model's speed / cost.",
                "author": "dumquestions"
            },
            {
                "raw_content": "their max compute model + rl is gonna be pretty insane i feel like",
                "author": "Sxwlyyyyy"
            },
            {
                "raw_content": "What people aren't paying attention to is that they are going to bake in the \"No-More-Halluncinations-Just_admit-when-you-don't -know\" algorithm in the training model. That is going to make the model that is only slightly more useful an order of magnitude more *valuable*. That is their goal, and AGI is just the moonshot.",
                "author": "DHFranklin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "r/ChatGPT went from singularity-lite to 😘💋🤖💔 as it went from 50M->1B users",
        "score": 61,
        "text_content": "Seriously tho - take a look at content from two years, it was a lot more technology forward, AI-positive content. Seems like it’s mostly just memes, ChatGPT gone wrong and those who are extremely dependent on the models. Just goes to show the extent to which as this technology becomes more and more widespread (it already has, but will be further integrated), the base of the average consumers understanding will drift further and further from reality. Does this decoupling of use and knowledge (even surface level) present issues when the technology is literally shaping individuals’ lives on a decision-by-decision basis? Does it change what you believe is the ethical duty owed by these companies when we see it so viscerally?",
        "comments": [
            {
                "raw_content": "lol ASI is gonna manipulate us so easy if fucking LLMs can do it",
                "author": "averagebear_003"
            },
            {
                "raw_content": "R/Singularity has gotten bad as well. Everybody has moved to \"accelerate\" subreddit",
                "author": "Neat_Finance1774"
            },
            {
                "raw_content": "If you stare into the abyss too long, it'll start staring back. Best to not even go over there",
                "author": "ArtisticKey4324"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Google DeepMind unveils its first “thinking” robotics AI \"",
        "score": 280,
        "text_content": "[https://arstechnica.com/google/2025/09/google-deepmind-unveils-its-first-thinking-robotics-ai/](https://arstechnica.com/google/2025/09/google-deepmind-unveils-its-first-thinking-robotics-ai/) \"Imagine that you want a robot to sort a pile of laundry into whites and colors. Gemini Robotics-ER 1.5 would process the request along with images of the physical environment (a pile of clothing). This AI can also call tools like Google search to gather more data. The ER model then generates natural language instructions, specific steps that the robot should follow to complete the given task. Gemini Robotics 1.5 (the action model) takes these instructions from the ER model and generates robot actions while using visual input to guide its movements. But it also goes through its own thinking process to consider how to approach each step. \"There are all these kinds of intuitive thoughts that help \\[a person\\] guide this task, but robots don't have this intuition,\" said DeepMind's Kanishka Rao. \"One of the major advancements that we've made with 1.5 in the VLA is its ability to think before it acts.\"\"",
        "comments": [
            {
                "raw_content": "Is this a first or do any other robots like Tesla's or Boston Dynamic's generate instructions on the fly like this?",
                "author": "inordinateappetite"
            },
            {
                "raw_content": "This is true Physical AI.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Cool but when will robots start being buyable",
                "author": "Thin_Basket_8941"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I wonder what this graph will look like in the future. Will it get even steeper with AGI & ASI.",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where we go, we won't need any money.",
                "author": "MeowverloadLain"
            },
            {
                "raw_content": "why are we looking at gdp data from... 1 AD lmao",
                "author": "PENGUINSflyGOOD"
            },
            {
                "raw_content": "This isn't per capita. The global population has also been increasing dramatically.",
                "author": "AngleAccomplished865"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI data center in Abilene is open",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you zoom in you can see the AGI waving to the camera",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Such lovely rooftops.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "Now show us how it’s powered - and the impact on the power bills of the residents in that area…",
                "author": "Franklin_le_Tanklin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kinethreads: Soft Full-Body Haptic Exosuit using Low-Cost Motor-Pulley Mechanisms",
        "score": 25,
        "text_content": "Could be a cool implementation for VR",
        "comments": [
            {
                "raw_content": "Pretty cool, but It looks very limited. This would only work where the direction of force is away from the body. Let's say you are opening a door, or pulling a heavy rock in a video game, then the direction of the force cannot be simulated with these strings. Even with pushing forces the direction of the force is very limited. Exoskeletons still seem better for the wide range of forces and directions.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Saw this and thought it was super neat, wonder if an iteration of something like this will come to market eventually.",
                "author": "DragonfruitIll660"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI Tests if GPT-5 Can Automate Your Job - 4 Unexpected Findings",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tldw : Not yet, data is skewed towards digital jobs and there is still some risk of catastrophic failure /hallucinations.",
                "author": "Correct_Mistake2640"
            },
            {
                "raw_content": "He sums it up nicely: AI can't do all tasks within an occupation, and can't do all occupations within a sector. The twitter post he refers to also makes sense. At least until the prediction that there will be more software engineers in 5 years than there are today. 5 years is far away in AI, and if things keep moving at this pace, I have serious doubts about this.",
                "author": "Bright-Search2835"
            }
        ],
        "subreddit": "singularity"
    }
]