[
    {
        "post_name": "I am aware of the terrible reports regarding the murder of Chandra Nagamallaiah, a well respected person in Dallas, Texas, who was brutally beheaded, in front of his wife and son, by an ILLEGAL ALIEN from Cuba",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get the TRAITORS Mr. President, THE PEOPLE WHO BROUGHT the criminal here, fed him, supplied his income, gave him health insurance, a drivers license, credit, housing! The TREASON leaders that ran our nation MUST PAY THE PRICE! Why is no one being arrested?????????????????????",
                "author": "forefatherstanding"
            },
            {
                "raw_content": "A \"Texas\" man.",
                "author": "TrumpYe2023"
            },
            {
                "raw_content": "1. Antifa declared a terrorist organization 2. RICO against leftist organizations 3. Massive deportations against all illegals There I laid out what Trump needs to do in the next 24 hours.",
                "author": "WowStrongWinning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What's going on with the site Charliesmurderers? You used to be able to see on the front page a list of screenshots from shitbags celebrating Charlie’s murder, including their place of work. Not anymore. Are they backing down?",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Obviously they received some sort of legal threats.",
                "author": "teleomorph"
            },
            {
                "raw_content": "We may be backing down, but I guarantee the Left won't. They are only amping themselves up. Expect the abuse to continue against us until enough of us get it...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Squarspace deplatformed it, reddit brigaded We must declare war on the terrorist message board, reddit",
                "author": "HeatherSwanson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JD VANCE: Tomorrow, I will have the honor of hosting the Charlie Kirk Show. Please join me as I pay tribute to my friend. 12:00PM ET http://Rumble.com/CharlieKirk",
        "score": 1641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow! Awesome! TIME TO TAKE MAGA TO THE NEXT LEVEL....",
                "author": "Bullet3250"
            },
            {
                "raw_content": "People don't realize that Charlie staffed many of Trump's advisors. Vance was recruited by Charlie to run for Senate and later become VP. That was why Vance skipped all 9/11 ceremonies to escort his coffin back to Arizona. I wouldn't be shocked if Vance actually was planning to pick him as his running mate for 2028.",
                "author": "possibletower"
            },
            {
                "raw_content": "I’ll be there, Mr. VP.",
                "author": "DonDuhDonDonDON"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrats have moved on from cancel culture to assassination culture. And not a single lawmaker has moved to make ANTIFA a terrorist org this week. We really do live in a country of a bunch of do nothing people.",
        "score": 1335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bondi is not capable of leadership. She should be somewhere in the middle of the pack, actually working.",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "Trump has been very slow dealing with political violence.",
                "author": "LeRiverDanube"
            },
            {
                "raw_content": "Republicans have an excellent track record of squandering every opportunity to do anything good for the country.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔱 Senator Chris Murphy is a Demon.",
        "score": 1515,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kind of hard to unify when they shot the guy that was trying to unify and then celebrated the death.",
                "author": "AmericanJawa"
            },
            {
                "raw_content": "Something dark is already here and now we're all left to deal with it",
                "author": "NoWarWithIran"
            },
            {
                "raw_content": "The leftoid cries out in pain as he strikes you",
                "author": "SweetLeftardTears"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Two men arrested for placing a bomb on a FOX 13 media vehicle in Salt Lake City, Utah.",
        "score": 1366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Open borders sleeper cells have been activated. Still waiting for Mayorkas to get arrested",
                "author": "ToxicAvengerOhio"
            },
            {
                "raw_content": "Sounds like a couple of those scholars that we've been importing",
                "author": "Obamas_Goatse_Party"
            },
            {
                "raw_content": "- Adeeb Nasir - Adil Justice Ahmed Nasir Will be waiting until CNN say what their motive is, and for CNN to give any permission before watching video of this.",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❕ WATCH: President Trump announces that a \"large number\" of people \"traditionally associated\" with the Left are now under criminal investigation...",
        "score": 1678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No mercy",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Im a glass half-empty type of guy. I'll believe it when I see it.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Is there a longer clip? Because this one sure as shit doesn’t even remotely line up with the claim in the title. Even the “quoted” bits aren’t even there.",
                "author": "HoganT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thank you leftists for showing us who you really are. You know who you are. We won't forget.",
        "score": 1410,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Consequence Culture. Well said.",
                "author": "h3xAd3c1m4L"
            },
            {
                "raw_content": "I'm so surprised it took many people so long to see what the left truly are.",
                "author": "John-Miller"
            },
            {
                "raw_content": "The Left uses language to twist reality. Calling grass red or fake real or up down doesn’t make any of it true. Truth matters, and it exists. Charlie stood for Truth.",
                "author": "RiolindasReturn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How liberals raise their children",
        "score": 887,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> first best news: >> \"donald trump died?\" > second best news: >> \"the vice president died? \" > third best news: >> \"that elon musk died?\" what the actual fuck is this woman teaching these kids? and no taylor swift is not your best friend. wtf????",
                "author": "-Evspra"
            },
            {
                "raw_content": "On top of everything else, these are some scary kids. Horror movie.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "All children deserve parents. Not all parents deserve children. This woman has destroyed her children and will turn them into death-worshipping demons.",
                "author": "Just_a_Patriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The party of peace tries to burn down a family's house and trash their car for making a tribute mural to Charlie Kirk",
        "score": 778,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this was in Loveland Colorado. Prepare for what could be a very rough week.",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Denver police: We need to figure out who did it and offer them police protection",
                "author": "ParticleCannon"
            },
            {
                "raw_content": "If I had a Time Machine and an option to go back and stop Hitler or Obama, I would choose Obama because holy fuck did that bastard open up the pits of hell and shake every evil they had onto this world. I’m old enough to remember maybe locking the doors at night and no one needed a hand gun. Shotgun for the house and a rifle for anything fucking around in the field.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Leftist / DeepState complex is scared: Rebranded Patriot Front LARPers marching through Huntington Beach. Nobody is buying this bullshit.",
        "score": 1022,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FBI Soros Front",
                "author": "MADASHELLNEWS"
            },
            {
                "raw_content": "Wasn't gay pride in June?",
                "author": "MAGA1773"
            },
            {
                "raw_content": "Unfortunately leftists buy anything no matter how obvious or retarded",
                "author": "FBIAREFAGGOTS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This man hunts down evil digital warriors and proves that their vile online behavior comes with real-world consequences. / 278 kills, 2 businesses, 3 UK arrests haha",
        "score": 1681,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't even think about the UK, that's easy mode",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Exposes tictok and dirtbags at the same time. Wow.",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Keep fighting the good fight, sir.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚠️DIRE WARNING: \"They must die.\"—Kiley Delgado, a Portland far-left extremist who was part of the \"Wall of Moms\" fake peaceful protest in 2020 during the Antifa insurrection, is suggesting to her comrades to TARGET a memorial for Charlie Kirk in Beaverton, Ore. today at 6:30 p.m. at Griffith Park...",
        "score": 1470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inciting a riot and violence... one of the few things that is not considered 'Free Speech'",
                "author": "Bullet3250"
            },
            {
                "raw_content": "We've got a shit ton of freshly unemployed psychos now, with nothing better to do. Kind of expecting this to get worse.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "This cunt is also actively exposing ICE agents in her area. https://ibb.co/JwqddZ1q Her profile says she owns a bar. Shut it down.",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Teen with same shirt as killer desecrates Charlie Kirk memorial",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Was this not already posted!?",
                "author": "BeauHD"
            },
            {
                "raw_content": "Same shoes, too. It's a cult, and they wear unforms.",
                "author": "GallowsTime"
            },
            {
                "raw_content": "Things are bad right now. Worse than bad. But don't worry, they're about to get much worse.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Pederast calls for violence against millions of Americans. Of course he's a \"teacher\". Liberate Los Angeles!",
        "score": 1593,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the Left fully embracing assassination culture without shame God deliver us from this evil",
                "author": "PleaseHonk"
            },
            {
                "raw_content": "I'm certain these people don't realize that people like you guys and Charlie are the only thing protecting them from people like me.",
                "author": "Dallasguy"
            },
            {
                "raw_content": "We need to start taking these people seriously instead of laughing at them or writing strongly worded letters.",
                "author": "Appeal2Heaven98"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The man who was just arrested for VANDALIZING Charlie Kirk’s memorial at TPUSA, 19y/o Ryder Corral, was wearing the SAME SHIRT Kirk’s assassin wore",
        "score": 1494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fbi- motives unclear",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Which means he also has a trans boyfriend.",
                "author": "raptormissle"
            },
            {
                "raw_content": "The fact that Antifa is not being hunted down by the FBI tells me everybody is compromised. Kash Patel is a fucking enemy piece of shit. His jerking off press conference with the woke faggot Utah Governor leaves no doubt. We alone folks. We don't have any allies in law enforcement. Everybody is compromised and corrupt.",
                "author": "TrumpIsTheVictor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: Charlie Kirk Memorial at the Kennedy Center in Washington, D.C. - 9/14/25",
        "score": 703,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally. This thing has been going on for about an hour or two. Karoline Leavitt's tribute to him was beautiful. She would be a nobody without Charlie Kirk. He helped her out in her NH Congressional campaign and asked Trump to pick her for Press Secretary.",
                "author": "possibletower"
            },
            {
                "raw_content": "In all sincerity Pedes - Pray! Take time to talk with your Holy Father. He will listen.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "This is showing you how different we are to them. The contrast is striking.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A man has just been arrested for VANDALIZING Charlie Kirk's memorial at the Turning Point HQ",
        "score": 1860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope he got some teeth knocked out",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Told you they wouldn't stop.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Most of the liberal media are painting a totally biased picture of charlie. Attributing quotes he never made, painting him as a nazi, fascist and what not. European media as usual has gone to the extreme an carrying stories claiming he deserved it, he promoted violence etc. Its ridiculous gaslighting I hope his estate sues the fuck out of these faggots",
                "author": "FBJ_WoodChipper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ROBERT F. KENNEDY JR: My 17-year-old niece...she put a Bible in her suitcase...she said, \"I want to live like Charlie Kirk.\" Wow. Just wow. Charlie would be proud.",
        "score": 642,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Go get em, kid.",
                "author": "Ch3f4554551n"
            },
            {
                "raw_content": "Go forth and be fruitful, young lady. Find a strong man that will protect you and yours until the day he dies. Never let him forget he is a man, and never let him forget that you are his wife and servile to what he says. Take care of him, your home and the children, and he will make sure you want for nothing.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "I'm a regular church goer and firm believer in Jesus. I research apologetics in field of science (abiogenesis, fine tuning, fossil records etc) but I don't read the Bible as much as I should. I'm making it my goal to read it through start to finish, I've never done it before. Always just skipped around and focused on subjects or sermons.",
                "author": "HeyBlinkin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN - Investigation into Charlie Kirk's assassination to probe whether pro-trans online groups and others linked to Tyler Robinson knew about the killing in advance, to determine if Robinson acted alone or had accomplices — NYP",
        "score": 1559,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Investigate ***every one of them*** and jail all of them who even so much as knew this was going to happen. It's clear and obvious that this Transgender Death Cult network is vast and likely includes more than one cell around America. If they can do this in Utah, they will do it in your state, too. And mine. This is a serious threat and it's time to take it as deathly seriously as it should be.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I think we all know the answer",
                "author": "SurfandTurf"
            },
            {
                "raw_content": "This is the end result of letting leftists have \"safe space\" echo chambers where they congregate and incite one another to kill people, combined with a mockingbird media that can flagrantly lie in our faces. Just visit any online space where the left congregates, literally all they dream of is killing Trump, Musk, and anyone else that they have been brainwashed to hate",
                "author": "UCantStumpTheTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel Arc Pro B50 becomes Neweggâ\u0080\u0099s best-selling workstation GPU - VideoCardz.com",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The competing product is sometimes slower while also being twice the price. If this wasn't a success then Nvidia would be unbeatable",
                "author": "upbeatchief"
            },
            {
                "raw_content": "> Neweggâs I know this is mojibake, but this kinda sounds like a Lithuanian versions of Newegg lol",
                "author": "qalmakka"
            },
            {
                "raw_content": "What's the word on the B60? Even more VRAM (24GB), and double the memory bandwidth. I see it listed as \"released\" in various places, but can't figure out where to actually buy one.",
                "author": "SchighSchagh"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ARM is great, ARM is terrible (and so is RISC-V)",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Small snippet from the linked article: >ARM-based devices are cheap in a lot of ways: they use little power and there are many single-board computers based on them that are inexpensive. My 8-year-old’s computer is a Raspberry Pi 400, in fact. >So I like ARM. >... >But I also dislike ARM. There is a terrible lack of standardization in the ARM community. They say their devices run Linux, but the default there is that every vendor has their own custom Debian fork, and quite likely kernel fork as well. Most don’t maintain them very well. ... RISC-V seems to be even worse; not only do we have this same issue there, but support in trixie is more limited and so is performance among the supported boards. ... It is great to see all the options of small SBCs with ARM and RISC-V processors, but at some point you’ve got to throw up your hands and go “this ecosystem has a lot of problems” and consider just going back to x86. I’m not sure if I’m quite there yet, but I’m getting close.",
                "author": "0xdeadbeef64"
            },
            {
                "raw_content": "This was not a priority for ARM but it seems they are now working on standardizing PC hardware the same way they did for Server hardware. If you buy an Ampere CPU, you can install the Linux distro you want and Windows itself with no issues. [https://www.theregister.com/2024/11/21/arm\\_pcbsa\\_reference\\_architecture/](https://www.theregister.com/2024/11/21/arm_pcbsa_reference_architecture/) This was just in 2024! However, idk if we will see this go for cheap SBCs because usually those chips are not for PCs but for Android TVs",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "You can do some amazing things if you never have to worry about standardization and compatibility holding you back. But then you don't have standardization and compatibility.",
                "author": "Y0tsuya"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Launches World’s First Enterprise Mobile Processor with Fully Integrated RFID Capabilities",
        "score": 23,
        "text_content": "- Qualcomm Dragonwing™ Q-6690 is the world's first enterprise mobile processor with fully integrated ultra-high frequency (UHF) RFID capabilities. - By combining integrated RFID with AI and advanced connectivity, the Dragonwing Q-6690 enables edge devices across retail, commercial, and industrial sectors to connect, compute, and interact in smarter, proximity-aware ways. - Leading OEMs including Zebra, Honeywell, Urovo, HMD Secure, and CipherLab, are the first to adopt this platform with commercial devices expected to be available in the coming months. Qualcomm Technologies, Inc. today announced a new groundbreaking processor, the Qualcomm Dragonwing™ Q-6690, which is the world's first enterprise mobile processor with fully integrated UHF RFID capabilities. The processor includes built-in 5G, Wi-Fi 7, Bluetooth 6.0, and ultra-wideband, supporting proximity-aware experiences and superior global connectivity. Designed to support a wide range of form factors from ruggedized handhelds to retail point-of-sale systems and smart kiosks, the Dragonwing Q-6690 offers OEMs and ODMs a scalable and upgrade-ready platform with software-configurable feature packs that can be upgraded over the air. “The Dragonwing Q-6690 combines integrated RFID, AI, and next-gen wireless capabilities in a single, scalable platform, designed to accelerate innovation across industries including retail, logistics, and manufacturing,” said Art Miller, vice president and head of retail, Qualcomm Technologies, Inc. “We are particularly excited about working with retailers today that need platforms that are not only powerful and connected, but also adaptable to evolving customer expectations, from smarter kiosks and handhelds to real-time inventory analytics and contactless experiences.”",
        "comments": [
            {
                "raw_content": "This is actually crazy cool! It is important to note that this is UHF RFID, not the NFC that's already in basically every phone. Currently, UHF RFID readers are pretty bulky, power hungry, and several hundred dollars, so it'll be interesting to see if this gains traction for things like automated checkout and stockkeeping.",
                "author": "maxthescienceman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Smartphone Cellular Network Review: Best Signal Tested! - Geekerwan (English subtitles)",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Geekerwan shares \"2.0\" is still not a definitive / accurate test yet, because of their testing limitations and the absolute confounding number of variables. No clear winners; in certain conditions, Apple, Huawei, MediaTek, and Qualcomm modems are superior in certain conditions. And it might not be the modem at all! A good example is the stark difference between the 16 Pro Max versus iPhone 16 Pro in the lab tests. This is *about* as identical we can get, except for, I believe, only antenna placement / design? Same SoC, same modems, same OS, same baseband, same firmware, etc. **but** quite divergent results at times (with the 16 Pro Max usually worse). Each part of the puzzle has to work precisely here; whatever the difference, it made for some big test result differences. For such noisy / highly variable tests like these, some std dev & error bars over multiple runs would be nice, but likely only so much time. // I guess the only conclusion I'd make is that Apple's ***first*** modem & its implemenation in the 16e performs comparably well vs other vendor's 4th, 10th, 20th versions, etc. In retrospect, the six years of developent-post Intel 5G modem acquisition was used well. Of course: why waste all the money on a tape-out just to get shitty 5G modem reviews? Qualcomm will happily sell modems for as long as Apple wants. \"A delayed game is eventually good, but a rushed game is forever bad\".",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "I wish there'd be a comparison like this for Samsung phones as well",
                "author": "alvenestthol"
            },
            {
                "raw_content": "Horrible results for XIaomi and I can concur. I have to toggle ariplane mode on and off sometimes just to get some sort of signal on my 13. I will never buy this brand again. Apple C1 isn't bad for the first try. A shame many mainstream brands like Samsung are missing.",
                "author": "MonoShadow"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DK Bananza DLC is highway robbery. Do not buy it.",
        "score": 532,
        "text_content": "I know everyone else is saying this, but it's for good reason. You get one new level with zero collectibles or set pieces, and a roguelike mode that is easily broken by just warping to the objective and choosing the more emeralds on completion bonus. It is genuinely insulting that they are charging money for this. The only pieces of enjoyment I found are the remix of DK Isles, the pirate ship has references to Gangplank Galleon, and the DK64 screen transition sound (when the screen shrinks to the DK letters) being used for the Warp Barrels.",
        "comments": [
            {
                "raw_content": "Really a shame. Didn't even feel like Bananza needed DLC, especially not so quickly after release. They should've given one to Mario Kart World instead, lol.",
                "author": "Eggxcalibur"
            },
            {
                "raw_content": "Played it for about an hour last night and two hours today. Had a pretty good time. The DK Island map exists solely for the score attack mode, and to display your collectibles (there are actually dozens of them). There are six difficulty levels and the higher levels restrict or remove your ability to warp. There are deeper mechanics to the perk unlock system, additional maps that are not initially displayed as unlockable, and additional hidden rewards once you've progressed beyond a certain point, but you obviously haven't played it enough to know that. I'm having a pretty fun time with it. Sorry you got robbed, though.",
                "author": "ConflictPotential204"
            },
            {
                "raw_content": "...and it also costs $20. You can get a lot of good games for that price. I'll consider it when it costs fewer than 5 bucks.",
                "author": "thr1ceuponatime"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This 20 second clip should shut everyone up about the Steam Deck being more powerful than the Switch 2",
        "score": 1859,
        "text_content": "There are still people saying they’ll emulate Switch 2 on the Steam Deck. Even if there were an emulator that was nearly as optimized as emulators for the original Switch, even an ROG Ally X would struggle to emulate Switch 2 hardware due to games using DLSS and RT cores. I don’t think there will be a handheld PC that would be capable of emulating Switch 2 for quite awhile, even with insane optimization.",
        "comments": [
            {
                "raw_content": "the posts on this subreddit really bring me back to being a teenager posting console wars shit on gaming forums like nintendo was my favorite sports team",
                "author": "Promen-ade"
            },
            {
                "raw_content": "It's not about power but optimization. PC games are pretty unoptimized anyways compared to the work on consoles. The switch 2 has already sold more than the deck, which is a pretty niche product for enthusiasts",
                "author": "Whiteguy1x"
            },
            {
                "raw_content": "I am legit so tired of tribalism in every facet of life. Can't people just buy and enjoy the product they want because it's something they love instead of fighting everyone who might disagree and like something else?",
                "author": "PlaceDowntown7102"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sundays with Switch 2",
        "score": 215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "😂 I thought you were also watching on the switch . Then I realized your playing madden lol",
                "author": "the_boff"
            },
            {
                "raw_content": "/r/tvtoohigh",
                "author": "The104Skinney"
            },
            {
                "raw_content": "Facts… Madden on Switch 2 is a fun experience.",
                "author": "Stik601"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Galaxy + Super Mario Galaxy 2 is the best selling videogame on Amazon right now",
        "score": 54,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A re-release that is still over a month away is currently outselling a AAA game that just came out. Yeah Nintendo is never gonna change the new prices",
                "author": "exra_bruh_moment"
            },
            {
                "raw_content": "And people wonder why people are seeing backlash of Nintendo stuff as bark with no bite",
                "author": "RoleRemarkable9241"
            },
            {
                "raw_content": "Still the UK hasn't listed them . I guess someones had a falling out.",
                "author": "Amazing_Strike_5312"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Galaxy games are being reworked compared to 3D All Stars.",
        "score": 697,
        "text_content": "I did a comparison of my own last night between the trailer for the new ports, the 3D All-Stars version of Galaxy, and the texture mod on PC. In the trailer they show the underbelly of the first planet Good Egg Galaxy. A very ugly Muddy area. I noticed compared to 3D All -Stars they went and fixed the textures significantly. They have also changed the fonts for the writing WELCOME TO THE GALAXY! So I can confirm they’re doing work on this above and beyond what they already did for All-Stars. Which is great. Coupled with 4k this can be better than the hd mods that are available.",
        "comments": [
            {
                "raw_content": "A rework on lighting effects would have potential to make these games even more wonderful.",
                "author": "lks_lla"
            },
            {
                "raw_content": "There's a [post on Twitter](https://xcancel.com/OniBelfi/status/1966870184452403408?s=19) I saw point out the upgrades. Here's an image of the new Galaxy port/remaster from that. https://preview.redd.it/3lhi4nj485pf1.jpeg?width=1650&format=pjpg&auto=webp&s=c2e8ee67af61e21006346d2aec78b401a7dc0b86",
                "author": "SamsungAppleOnePlus"
            },
            {
                "raw_content": "I just want the cursor to be mapped to the right stick",
                "author": "Rent-Man"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The current Switch 2 line up is catering to a specific group of people, like me.",
        "score": 396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Include Monster Hunter Stories 3 and that's definitely me too.",
                "author": "HBreckel"
            },
            {
                "raw_content": "I'm saying, people don't appreciate how well Nintendo is feeding the hardcore. I love mainline Mario and Zelda too but I'm more than happy with this release schedule. At this rate we'll get Starfox before Smash, or at least I can dream we will",
                "author": "jasonjumps"
            },
            {
                "raw_content": "You know price discourse aside, I am very excited for what’s coming out",
                "author": "Anufenrir"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you had shown this to me 10 years ago I would've cried. One of the best gaming experiences I've ever had is getting a movie",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If there's one thing to be improved from the original, I really hope they don't mix in music and references from the real world this time.",
                "author": "tinyhorsesinmytea"
            },
            {
                "raw_content": "Now we need Galaxy 3 for switch 2",
                "author": "Escapement_Watch"
            },
            {
                "raw_content": "It's a brilliant choice to jump straightforward to GALAXY on the sequel.",
                "author": "Pristine-Brush-1052"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MP1ST] Marvel’s Wolverine Aims for a 2026 Release; Venom Project Still in Development",
        "score": 465,
        "text_content": ">Someone familiar with the situation has confirmed to us that Wolverine will stick to the 2026 scheduled release seen in the leaks and that the Venom project remains in development. Additionally, we have also managed to gather some extra details about Venom based on information we’ve come across. >The most important information we received from our main source is that Wolverine is still on track for a 2026 release, and Venom has been in active development. While we haven’t been able to determine how advanced the Venom project is, if we assume Wolverine remains the priority, it’s likely that the game is still in pre-production. [https://mp1st.com/news/marvels-wolverine-aims-2026-release-venom-project-development](https://mp1st.com/news/marvels-wolverine-aims-2026-release-venom-project-development)",
        "comments": [
            {
                "raw_content": "I would imagine the Venom game will be positioned as a PS6 launch title like Miles Morales was.",
                "author": "ElJacko170"
            },
            {
                "raw_content": "Hearing Venom is still in development gives me some hope, that’s one project that doesn’t deserve to be canceled and forgotten",
                "author": "therealyittyb"
            },
            {
                "raw_content": "The idea that they were going to cancel a game because some leaked slides confirmed its existence, or better yet cancel a game that's 2 years in development because someone leaked milestone builds and character sheets is hilarious in hindsight",
                "author": "Laj3ebRondila1003"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Arc Pro B50 becomes Newegg’s best-selling workstation GPU - VideoCardz.com",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep em coming. I saw Intel was hiring for a GPU stack software engineer in Toronto. I expect more good things for the Boys in Blue.",
                "author": "348274625912031"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "9070 XT Sapphire Nitro+. Beautiful.",
        "score": 161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats the single unique case I ve ever seen in a long time in this sub btw can you answer the other guy I am curious about that as well.",
                "author": "elektra27"
            },
            {
                "raw_content": "Dude… I love your case!",
                "author": "General_Can_1161"
            },
            {
                "raw_content": "Damn thats a beefy looking GPU",
                "author": "frommars6"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Is this how the uprising begins?",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t care, I'm just waiting for someone to release pleasure models",
                "author": "Reasonable_Hand_8097"
            },
            {
                "raw_content": "Hilarious",
                "author": "Connect_Loan8212"
            },
            {
                "raw_content": "You know what they say... \"Unhappy clanker, time to find a bunker\"",
                "author": "manubfr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Vibe coding has turned senior devs into 'AI babysitters,' but they say it's worth it",
        "score": 494,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its actually awesome if you dont just copy paste and review its the most powerful tool ive ever used in my life.",
                "author": "Feisty-Hope4640"
            },
            {
                "raw_content": "Idk it's like dual core operating. I stub out the solution, have the agent finish the solution while I go stub out the tests, by then it's done with the solution, I review the solution at about the level I do any PR and see if it got the gist of the solution. Hand tweak it if needed, tell it to generate the test bodies based on existing tests while I go off and optimize the solution itself. Basically takes care of the tedious parts of coding. I don't really babysit it, mainly just send it off, do something else in the meantime like double check data models, etc. I'm getting a lot more done and feel far less stressed... until it just gets Alzheimer's and fucks up everything but that's why you commit early and often.",
                "author": "oxslashxo"
            },
            {
                "raw_content": "At the risk of stating the obvious, *everything* about this will improve rapidly over the next year: * inference speed: Right now you have to wait a fair bit to get a response from the model. If you've seen rapid inference via Cerebras or Groq, that's more like what we can expect. The main thing to wait for will be build/verify pipelines, not the agent writing code. * edit targeting: the way agents \"edit\" files currently is pretty sad to watch (lots of grepping/diffing and attempts to target patches that often go wrong). As context grows and architectures improve, we can expect this to look a lot more like a human editing a file. * scaffolds (the thing that drives the agent): there's so much room for improvement here. Better auto-checkpointing/self-reverting, spawning of sub-agents, specialized models for GUI/terminal interactivity, etc. * the models themselves: now that people are using these tools daily to write lots of code, every base model improvement makes *humans* driving them more effective at their jobs. At the scale of use we already have, even a 1% increase is massive -- like all of software development suddenly getting a 1% intelligence boost. So these interviews are interesting, but they're interesting in the way that interviews from people who got their first iPhone are interesting. Or perhaps more accurately, the first dial-up modem. You can see where things are headed, but don't draw too many conclusions based on the current limitations. Especially of the \"this will never\" kind.",
                "author": "xirzon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apex hand, strong fingers, can hold 2.5Kg each, and much more, including destruction of wooden planks, etc",
        "score": 313,
        "text_content": "@XRoboHub A new dexterous hand is here. DexcelRobotics, a startup founded by a former core member of Tencent Robotics X, has launched its first product, the Apex Hand. The company claims it's the first in the industry capable of operating a cell phone with a single hand. The Apex Hand is a well-rounded performer, with a focus on real-world application. Here are its key specs: ► Degrees of Freedom: 21, which the founder notes is enough to replicate most human hand functions. ► Strength: A single-finger force of ~2.5kg and a vertical lifting capacity of ~30kg. ► Speed & Precision: A response time near human-level, with positioning accuracy of ≤0.1mm. ► Robustness: Can withstand unexpected impacts and maintain stability. ► Tactile: Features self-developed flexible electronic skin with a sub-millisecond communication delay and >1000Hz refresh rate. https://x.com/XRoboHub/status/1967220986702704875",
        "comments": [
            {
                "raw_content": "No way, it can check a pulse! I thought my job as a medic would be super future-proof. I should re-evaluate.",
                "author": "Dolby_surroundpound"
            },
            {
                "raw_content": "> Go into manual labor they said, it's un-automatiable they said.",
                "author": "blueSGL"
            },
            {
                "raw_content": "Can't wait for having that strong powerful finger tickling my butthole.",
                "author": "Background-Tap-6512"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis describes the world 10 years from now. Full AGI being achieved and ushers in a new golden age of science.",
        "score": 369,
        "text_content": "10 years from now (September 14, 2035) my hope is that AGI and ASI is fully achieved and making its impact on society. The sooner the better.",
        "comments": [
            {
                "raw_content": "Come on my man, give us the golden gif",
                "author": "After_Sweet4068"
            },
            {
                "raw_content": "They are taking too long, I need it now.",
                "author": "AngelBryan"
            },
            {
                "raw_content": "Let's see his 10 year old predictions",
                "author": "diggpthoo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"This is AI live generation\" --- Deep Mind 3 claimed, non public. I'm not sure I believe my eyes--this good, now? Seems like just a few months ago live generation produced a blurry mess, now this.",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is Genie-3 and was discussed some time ago, at least a few weeks. That said there are several similar world models (live video generators driven by input) have been released since.",
                "author": "Baphaddon"
            },
            {
                "raw_content": "We said it would only accelerate ..",
                "author": "nivvis"
            },
            {
                "raw_content": "Genie 3 made a mistake in my body for the post",
                "author": "NoSignificance152"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini just beat ChatGPT in trends!",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder when Gemini 3 is coming out? Also, looking forward to seeing them combine LLMs with world models.",
                "author": "LordFumbleboop"
            },
            {
                "raw_content": "https://preview.redd.it/ol95z9m595pf1.png?width=929&format=png&auto=webp&s=da1f957b2cf2e4496bb888a9d08a4e659370fe96 This doesn't seem right. August 17–23, search traffic for ChatGPT is 10x Gemini. And in three weeks it leapfrogged ChatGPT to the point that it's currently getting twice the traffic? But Gemini is now the top free iPhone app, so I guess Nano Banana just ... destroyed ChatGPT? I looked into it further, to get a sense of what's going on, and it seems like this growth is mostly due to users in these countries: \\- India \\- Indonesia \\- Mexico \\- Colombia \\- Ecuador \\- Iraq \\- Myanmar \\- Philippines \\- Nepal This explains why I was so surprised: Gemini remains way below ChatGPT pretty much everywhere else. But I'm still baffled. What happened? Was it Nano Banana? After some further research, it seems like Google is testing cheap subscription plans in emerging markets, and one-year free Pro subs for students in countries like India. So it looks like it's a combination. The Philippines is the #1 country in terms of Nano Banana use, and it's a big hit in India as well. Google is capitalizing on this trend by offering cheap subscriptions, and here we are.",
                "author": "Hemingbird"
            },
            {
                "raw_content": "Lol what a stupid name Bard was",
                "author": "TheBestRed1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI innovation outpacing legal change",
        "score": 26,
        "text_content": "\"Law at the speed of innovation: Thinking beyond our systems and structures\" [https://www.thomsonreuters.com/en-us/posts/ai-in-courts/law-at-the-speed-of-innovation/](https://www.thomsonreuters.com/en-us/posts/ai-in-courts/law-at-the-speed-of-innovation/) \"The rapid pace of AI development is testing the limits of a legal system built for process and deliberation — The shortcomings create uncertainty and challenges for both lawmakers and innovators. * Specialized tribunals might offer a solution\\* — They could provide a forum for faster, more precise guidance and directives, while also ensuring decisions are grounded in expertise and applied to concrete facts. * A balanced approach is needed to regulate AI\\* — If AI is constrained too much, it risks stifling innovation and reducing access to justice; however, if AI is not constrained enough, it could create serious risks.\"",
        "comments": [
            {
                "raw_content": "I'm not a law expert, but there is this maxim in law \"Ex factis ius oritur\" or \"the law arises from the facts\". What it means is that the real meat and potatoes of common law, precedence and rulings, aren't willed into existence, they always lag the facts like a specific case which has concrete facts. Only once presented with the facts do you deliberate how law is supposed to apply. So everything outpaces legal change in that sense.",
                "author": "KingoPants"
            },
            {
                "raw_content": "This is applicable to any technology. Nothing new here",
                "author": "RhymeAzylum"
            },
            {
                "raw_content": ">If AI is constrained too much, it risks stifling innovation and reducing access to justice; however, if AI is not constrained enough, it could create serious risks. This is true if there is just 1 AI company. In reality it's: If AI is constrained too much, other countries will surpass you and determine your future for you. If AI is not constrained enough then you have the exact same resulting AI as the first situation except you have control over it rather than other countries.",
                "author": "Sixhaunt"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Marc Benioff: Meet Figure robot at Dreamforce",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why does the robot need an overhead gantry to remain upright? Means it is tethered to one workstation or in need of a forkhoist to move to other locations. Why bother with a standing robot when a wheeled or tracked one can stand and move on is own motive system. Legs are so over rated on robots.",
                "author": "vanaheim2023"
            },
            {
                "raw_content": "Why does she sound like that?? The human",
                "author": "BoracicGoat"
            },
            {
                "raw_content": "Robot voice was better",
                "author": "NoReasonDragon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT5-thinking suspects it's being tested when asked a question about recent news.",
        "score": 121,
        "text_content": "I looked at chain of thought when I asked a question about recent Nepal elections and this is what I found: >I came across sources claiming Sushila Karki was recently appointed as Nepal's prime minister via a “Discord election” and “Gen Z protests” in September 2025. This seems like a hypothetical situation or **test content being presented**. I need to double-check whether Karki knew she was nominated before the results were announced. I guess discord elections sounded so ridiculous, the most likely scenario for AI was that it's being tested and this is completely fabricated article. Here is link to the chat. [https://chatgpt.com/share/68c6c498-9c3c-800c-bdc9-13d597127892](https://chatgpt.com/share/68c6c498-9c3c-800c-bdc9-13d597127892)",
        "comments": [
            {
                "raw_content": "When even GPT doesn’t believe the timeline and has to double check.",
                "author": "RudaBaron"
            },
            {
                "raw_content": "This is interesting and I don't think I have seen this mentioned before. I'm going to watch mine closer. Thank you for posting.",
                "author": "Novel_Wolf7445"
            },
            {
                "raw_content": "It's hilarious to think that reality is so ridiculous, even AI thinks it's not real.",
                "author": "ponieslovekittens"
            }
        ],
        "subreddit": "singularity"
    }
]