[
    {
        "post_name": "DOJ To Present Russiagate Hoax To A Grand Jury For Criminal Charges",
        "score": 316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is named for the Grand Jury to indict on criminal charges. You can't hand charges to a Grand Jury and say, \"Find out who did this.\" There has to be a defendant named. Who is that person or those people?",
                "author": "Ronaldus"
            },
            {
                "raw_content": "TWO",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "If this report is an accurate reflection, DOJ will need a lot more concrete, irrefutable evidence and redundant substantiation. That's presuming it's presented by a Trump appointed DOJ prosecutor in a courtroom not in a blue cesspool",
                "author": "BitterRoots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jasmine Crackpot is inciting violence against MAGA",
        "score": 277,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just can't take her seriously without phat beatz.",
                "author": "myke"
            },
            {
                "raw_content": "I'm ready. Hope you all are too",
                "author": "Prandogolio"
            },
            {
                "raw_content": "There are tons of concealed carry MAGAs WAITING for a stupid leftard to assault them",
                "author": "Wrexxis780"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Lawfare at Its Finest’: Biden’s DOJ Secretly Targeted Trump’s Inner Circle",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "target the Biden crime family",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Secretly? Past tense 'ed?",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Target the lawfirms that protected America's enemies.",
                "author": "BrionK"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MULTIPLE sources now reporting that the Russia Collusion Hoax grand jury is being empaneled in FLORIDA. This would be a MASSIVE loss for Obama’s cronies, as they’d be prosecuted in FL and not DC.",
        "score": 1185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is huge. Now I have actual hope.",
                "author": "MAGA_NRG"
            },
            {
                "raw_content": "Jesus Lord I am eyeing that hopium needle and trying to stay clean",
                "author": "permissible_missile"
            },
            {
                "raw_content": "They should pick the most-red district of the most-red state for this. Just like they fed the J6er's into the DC \"justice\" system.",
                "author": "Tookens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller: Democrats counted tens of millions of illegals in the census, stealing house seats for sanctuary cities. They are waging war on democracy.",
        "score": 1643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The secret is finally out, meaning it's becoming mainstream. **Democrats want to use illegals to skew the 2030 Census**, so they might as well be open about it now. All that bullshit about \"keeping families together\" was just a ploy to physically keep illegals in the Blue State long enough to be counted in the Census. Similar tactic with giving illegals free medicaid, tuition, housing assistance etc. all just to keep them in the State long enough to be counted in the Census. Mayor Ass and Governor Newscum don't give a shit about 'snatching people off the street', they just want them in California long enough to be counted in the Census.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Census should only count net tax payers. Wouldn’t even have to go door to door, just count the tax returns.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "I really wish they would stop using the word democracy. We live in a fucking constitutional republic.",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: GOVERNOR ABBOTT DISPATCHES TEXAS RANGERS TO INVESTIGATE AWOL DEMOCRATS",
        "score": 1599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope “investigate” means arresting them immediately",
                "author": "ClarenceBeeks"
            },
            {
                "raw_content": "Site is struggling, but least we got stickies.",
                "author": "nakedjay"
            },
            {
                "raw_content": "FUCK YEAH. This better be real edit: looks pretty damn real. Time for popcorn",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama and his co-conspirators… Were this close to getting away with all of it..",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes my hair stand on end, terrifying.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "They did get away with all of it.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Exactly, look no further, from 2016 to 2024, ALL roads lead to the foreign criminal asset, Hussein.",
                "author": "magaboom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democratic Socialists of America holds panel calling for dismantling of 'inherently repressive' and ‘racist’ nuclear family",
        "score": 1139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Socialists *really* don't like anything that works.",
                "author": "killedmytv"
            },
            {
                "raw_content": "Wow these faggots are still wearing masks.",
                "author": "MoreVanceMemes"
            },
            {
                "raw_content": "I should buy a flame thrower.",
                "author": "Mindcrym"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What a disaster! Your site goes down for more than 10 seconds—unbelievable! It's like the Democrats running the country: total failure, no reliability, always crashing when we need it most. Fix it fast, or you're fired! We need winners, not losers like Biden's crew. Tremendous disappointment!",
        "score": 1453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The infamous russian hacker known as 4Chin.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I'm impressed the boys have kept this site running for so long in face of *EVERYTHING*. We've been targeted by ActBlue, ADL, reddit, Politico and NYT. Much love guys. Literally the only social media place I give a fuck.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "Thank you for your attention to this matter!",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW - Russia claims the UK and Ukraine are plotting \"terrorist attacks\" against oil tankers in international waters to frame Russia and pressure Trump.",
        "score": 1241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't this already happen? Some pipe got blown up or something.",
                "author": "OrthodoxTemplar"
            },
            {
                "raw_content": "They absolutely ARE. The British have been working this disaster for ages, they spied on Trump, they made up fake intel. and colluded with our Deep State. The UK intel and banker community are our objective enemies!!! Wake up!",
                "author": "learntocode"
            },
            {
                "raw_content": "Sounds True",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Good day in the Stock Market",
        "score": 1144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t give a shit about boomer stocks. In fact that whole system is corrupt and why many businesses have gone to shit. When you are owned by shareholders you have the legal responsibility to make them money essentially. That is why so many businesses go to shit as they prioritize shareholder profits over quality products.",
                "author": "D-Dub"
            },
            {
                "raw_content": "Stock market protruding",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Well to be fair this was a recovery from a bad Thursday and Friday.",
                "author": "RusherOfDin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Motion passes in TX House to issue arrest warrants for Democrats who fled out of state.",
        "score": 1711,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now remove and replace all of them",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Go get the mother fuckers",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "“If necessary” there it is",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AG Ken Paxton: House Democrats have fled the state in a cowardly desertion of their responsibilities. These jet-setting runaways abandoned Texas and sacrificed their constituents for a publicity stunt. It’s imperative that they be swiftly arrested, punished, and face the full force of the law.",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ken Paxton.... the man who should have been AG.",
                "author": "Trump_is_GEOTUS"
            },
            {
                "raw_content": "Replace Bondi with this dude please",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Felony bribery charges or GTFO. It's time to stop playing games.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Attorney General Pam Bondi has sent evidence to a Judge for Indictments for those INVOLVED on the \"Russia Collusion Hoax\"",
        "score": 1512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's see what actually happens next",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Corrupt 0bama judge?",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Sentencing and jail-time/execution sometime before the heat death of the f'ing universe would be nice.",
                "author": "FiresideRant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"I was at the local lake today. Swam, lay in the sun. Wore a one-piece bathing suit. At a picnic table nearby was a recently arrived Afghani group. The man full on glared at me. I don’t appreciate being glared at for wearing something completely culturally acceptable at lakeside in my own nation.\"",
        "score": 642,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My neighborhood in NYC is infested with Muslims now. A lot of them look at me like they want to slit my throat, and are just waiting for the \"go\" signal so they can do it.",
                "author": "fskfsk"
            },
            {
                "raw_content": "\"Why are you swimming in my designated shitting lake?\" what the glare was meant to convey",
                "author": "RINO_fatigue"
            },
            {
                "raw_content": "Hopefully she had a gun nearby or a husband with a gun or three. Dumb move if she was by herself. Head on a swivel around those goatfuckers and pedo worshippers . MAGA AF",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: US Appeals Court has just OVERRULED an activist judge's blocking of Texas law requiring voter ID for mail-in votes - to prevent voter fraud. HUGE VICTORY. AG Ken Paxton was defending the law.",
        "score": 564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So voter ID is going to go before SCOTUS. I'm curious if they'll deny cert and let the appeals court ruling stand, or take the case and uphold that voter ID laws are legal",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "https://x.com/EricLDaugh/status/1952530128380043629",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Voter ID for mail in votes, how does that work? Do you send them your state issued ID with your ballot?",
                "author": "DustyGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump effect on American Eagle. Crying dims failed.",
        "score": 1264,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can’t believe it’s 2025 and shit like this is what people cry over. Seriously, since when did we get to the point where EVERYTHING is offensive, “racist” or something else? Sick and fucking tired of it. That’s how you know people have it good, when they have time to complain and bitch about things that make no difference in their lives.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Get Woke, Go Broke Get Trump, Profits Jump",
                "author": "FreedomOfScreech"
            },
            {
                "raw_content": "AMERICAN EAGLE, yet made overseas in China, Vietnam, Bangladesh, and Mexico.",
                "author": "Azill"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The State Department is considering requiring a $15,000 BOND for visa applicants coming to the U.S. So if you come and overstay your visa, you FORFEIT $15,000, get deported, and barred from re-entry.",
        "score": 1801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need a moratorium until we get this shit sorted out in our country.",
                "author": "Jakylangelo"
            },
            {
                "raw_content": "The US should be the most expensive country to visit, because it’s the best.",
                "author": "lifeisahologram"
            },
            {
                "raw_content": "Raise the remittance tax. The one in the BBL is cucked",
                "author": "wharfthrowaway"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"As an Indian I BEG YOU PLEASE GO AHEAD AND DO IT (total moratorium on H1Bs)!!! Your hospitals will be out of doctors (50% doctors are from India) Microsoft will be out of workers, NASA will be out of scientists, almost all US top companies will not even have CEO!!! So I beg you, go ahead! DO IT!!\"",
        "score": 724,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do not take advice from a country that shits in their rivers.",
                "author": "double00J"
            },
            {
                "raw_content": "There are plenty of US doctors graduated every year who can replace foreigners, and there's little risk their credentials and training are forged.",
                "author": "CleanUpPhillyTrump24"
            },
            {
                "raw_content": "You mean Microsoft will fail? ---- count me in.",
                "author": "cyberrigger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ALEX STEIN testifying in the TX House: “We SHOULD have trans in the military!” “The suiclde rate is so incredibly high among transgender people… we could just use them like the Taliban uses suiclde bombers!”",
        "score": 1598,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lolololol",
                "author": "Jaybone86"
            },
            {
                "raw_content": "jesus he just doesn't give a fuck, and it is glorious.",
                "author": "rambler045"
            },
            {
                "raw_content": "This man must be protected. AS is a national treasure.",
                "author": "20MagnusKonrad20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel's credit rating downgraded by Fitch on demand challenges",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not surprising. The company has so many long term problems and I think they're banking too much on one guy turning things around. They're losing market share, margins are shrinking, talent is being cut to the bone. Headcount cuts, facility closures and selling off remnant divisions will only help so much. Mismanagement and poor strategy over the last 15 years has simply taken it's toll. I worked there for quite a long time and it's sad to see where it's at these days.",
                "author": "travelin_man_yeah"
            },
            {
                "raw_content": "Crazy that Intel with the most sustainable revenue in chip market, expertise across integrated supply chain and even strategic national security value has gotten to this level. Meanwhile Nvidia, Broadcom, ARM with their 30x overvaluation of AI promise land can find new set of \"analysts\" and agencies every day who have no clue what AI is, predicting that ML algorithm models are somehow the future and everyone who doesn't buy in will miss out on the next big thing.",
                "author": "SERIVUBSEV"
            },
            {
                "raw_content": "Wow you cant even wake up without an intel implosion news on the page.",
                "author": "Sevastous-of-Caria"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Can a graphics card be 2.5x faster than an RTX 5090 in path tracing and use 80% less power? Bolt Graphics claims its Zeus GPU-powered models do just that",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like the words \"synthetic benchmark\" are going to be doing a lot of heavy lifting here.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "You can easily make an ASIC designed to be optimal for a certain task",
                "author": "mileseverett"
            },
            {
                "raw_content": "This card appears to be a one trick pony. It be much faster in pathtracing when compared to an RTX card that spends much less silicon on that specific issue. But I wanna see the real thing not just slideshows, and to then look me in the eyes and say \"this is interesting for so many people that it is an actuall business model\".",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 9000 CPU with 16 Zen5 cores, 192MB of L3 cache and 200W TDP reportedly on the way - VideoCardz.com",
        "score": 205,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Alan we ran out of numbers after the 9950x3d,” “9999x3d?”",
                "author": "somewhat_moist"
            },
            {
                "raw_content": "Would be quite an interesting product if both CCD's have 3D-Cache. Although i wonder how the latency would affect things. Wasn't that the primary concern and reason why previous CPU's didnt' have cache on both CCD's? I guess AMD might be using this product as an experiment to see if its viable and worth.",
                "author": "Firefox72"
            },
            {
                "raw_content": "The only use case I can think of for this is game hosting companies running two games on a system, each isolated to a CCD.",
                "author": "Qaxar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Gamers Nexus] Noctua's Attempt to Make the Perfect Fan | Blade Angle Engineering Discussion",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very technical and insightful, always love to hear experts who are knowledgeable about niche topics breakdown how things work. The part about the human element of hearing and blade count was really fascinating.",
                "author": "SmileyBMM"
            },
            {
                "raw_content": "Dang it's great to see someone so excited about their job",
                "author": "EasyRhino75"
            },
            {
                "raw_content": "Oh my god, just use your fan tester you bought **3 YEARS AGO** already...",
                "author": "kikimaru024"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC Will Have Four 2 nm Plants by 2026, Producing 60,000 Wafers Per Month",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">All four sites will utilize TSMC's first-generation nanosheet architecture, which reduces switching power by 25% and increases transistor density by 15% compared to the 3 nm node. Although each 300 mm wafer will cost approximately US $30,000, a roughly 50 percent premium over current 3 nm wafers, TSMC has already secured more design wins from Apple, Qualcomm, and MediaTek at this stage than it saw for its 3 nm and 5 nm nodes. Analysts estimate that these four fabs could support up to US $2.5 trillion in downstream electronics revenue over the next five years.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "That's quite a solid volume, though still less than half of 5nm's peak of ~150k wafers monthly. Looking at the list of customers, I guess mainstream desktop 2nm components will come early 2027?",
                "author": "Homerlncognito"
            },
            {
                "raw_content": "by 2026 is pretty vague. I assume q3 or most likely q4? so tsmc 2nm in consumer products will be q4 2026 or q1 2027? 60k per month is disappointing.",
                "author": "anhphamfmr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Bright Side of Intel Exodus: Chip Startups",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "chip startups are one of two things 1) looking to swindle some VCs 2) looking to get their IP bought out before they become competition forget money, you literally need hundreds if not thousands to even design anything new the barrier of entry is so high I don't see anything serious becoming of them",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": ">However, Intel, which introduced glass substrate technology in 2023, announced to scale back glass substrate R&D a year later, vowing to seek external sources as part of cost-optimization efforts after massive foundry business losses. This is exactly Intel's core business culture. Start/invest in something and abandon it within 3 years",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Linux being adopted widely as a primary OS has a higher chance of happening than the average Joe using a chip made by a startup for their personal computing needs.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China's YMTC moves to break free of U.S. sanctions by building production line with homegrown tools — aims to capture 15% of NAND market by late 2026",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[America did the same thing to Japan in 1986, the only difference is Japan acquiesced to American demands while China hasn't:](https://www.heritage.org/asia/report/the-us-japan-semiconductor-agreement-keeping-the-managedtrade-agenda) >The U.S. government responded by threatening trade retaliation if Tokyo did not raise the price of Japanese, low-end DRAM chips in the American and foreign markets. Tokyo bowed to this pressure in August 1986. Japan also agreed to try to guarantee the U.S. a specific share of the Japanese market in these products.",
                "author": "jeremiah_wright_"
            },
            {
                "raw_content": "With their price and performance of current NAND, I do see that happening.",
                "author": "ashyjay"
            },
            {
                "raw_content": "More competition, thank god.",
                "author": "liquidsprout"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "In your opinion What is the closest metric to measure gpu relative performance Level, is it transistor count?",
        "score": 3,
        "text_content": "I was looking over the specs of the rtx 3080 and compared to the rtx 4090. Knowing that on average the 4090 is twice as fast when it's not vram limited. Transistor count seems to corelate. Double checking with the rtx 2070 with half the performance and bit under half the transistor count seems to point that transistor count being a somewhat accurate figure to estimate performance. I wonder if there is a better cross vendor and cross generation metric. Wither timespy. Manufacturing node/chip size, pixel fill rate. Say if we get a chip that 120 billions transistor. About 4x the 3080. Would be comfortable to say that chip will be around 4x the performance of the 3080?",
        "comments": [
            {
                "raw_content": "Probably FLOPS. Transistor count definitely correlates a lot but power and architecture can play a pretty big role in determining performance",
                "author": "_Twilight_Sparkle_"
            },
            {
                "raw_content": "You cannot correlate Transistor count to GPU performance, because each architecture uses transistors in different way. You should ask how the transistors are used, how much is for cache, how much compute, RTX, .. Each architecture has different goals. Really what are you looking is metric that corelates to your workload. When, you want to compare raster only you look for raster only statistics, texture rate, fill rate, for compute it's FP64,32,16,8 ... FTOPS, for ray tracing something else ...",
                "author": "Michal_F"
            },
            {
                "raw_content": "The 4090 isn't 4x a 3080 The best way to measure relative performance is to find benchmarks in the games/applications you use You cannot compare specs across different architectures. Synthetic benchmarks also don't tell you a lot",
                "author": "TalkWithYourWallet"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CPU/GPU Scaling: Ryzen 7 5800X3D (RTX 5090, 5080, RX 9070 & 9060 XT)",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So again, zero reasons to upgrade my 5800x3d unless i get a 6090 and or a 7090 in 4 years",
                "author": "jedimindtriks"
            },
            {
                "raw_content": "Similar to results that I have found from testing my system (5800X3D, 9070XT, 32Gb DDR4 3600 @ CL14) compared to new ones I've built for people. Just did a 7800X3D, 9070XT, 32Gb DDR5 6000 CL30 build for a friend and he is on average 10% faster (both at 1440p). Looks like I'll be holding out for AM6 at this rate!",
                "author": "sambinary"
            },
            {
                "raw_content": "more or less as expected, but it would have been nice to have one test with raytracing turned on (since it increases cpu load). edit: the effect of upscaling and framegen on the cpu would also be intresting",
                "author": "snitt"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Bananza Cake",
        "score": 4639,
        "text_content": "Wife and kids made this for my birthday. Thought the community would appreciate it.",
        "comments": [
            {
                "raw_content": "OH BANANA",
                "author": "SelectInstruction262"
            },
            {
                "raw_content": "Are you going to smash it with your fist?",
                "author": "doctorhino"
            },
            {
                "raw_content": "Will you eat the Amiibo?",
                "author": "Analyst88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The makers of the Switch 2 carts Macronix, has reported in their quarterly earnings that they will start using MLC NAND and 3D NAND to meet \"varying capacity\" requirements.",
        "score": 357,
        "text_content": "Seems like there's a possibility we could be seeing different sizes of Switch 2 carts.",
        "comments": [
            {
                "raw_content": "So basically they currently use their own MLC (2 bits per cell, expensive nand that the industry mostly abandoned) and switching to TLC (3 bits per cell, is the industry standard for NAND flash) most likely samsung. which should allow more capacities and possibly less expensive Although in theory MLC is better than TLC, but weather this actually matters is unlikely",
                "author": "Many_Mechanic_1886"
            },
            {
                "raw_content": "Puyo Puyo Tetris 2S comes to mind as a game that shouldn't be on a key card; if they have a cheaper/smaller option, all for it. I get key cards for larger games or online-focused titles, though.",
                "author": "tideblue"
            },
            {
                "raw_content": "This is good news and will hopefully appeal to those publishers who currently go with GKCs for smaller sized games, if this means what it implies.",
                "author": "mrmivo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's nice to go away for a while. But it's nice to come home again",
        "score": 191,
        "text_content": "The first month and a half of the Switch 2's life was all about Cyberpunk for me. But then I spent the last 3-4 weeks playing Donkey Kong Bananza, and it was a truly fantastic experience - just finished up the main post-game tonight (not 100% completion, but enough for me) - bright, colourful, cathartic, fun. But, oh boy, returning to Night City feels like slipping into a worn booth seat at your favourite bar with a cold beer and a bag of nuts next to an old pal. Good to be home.",
        "comments": [
            {
                "raw_content": "Cyberpunk 2077 has legit become my comfort food game of the generation. I'm on my third play through (on PC though) and I keep coming back be in Night City. It's noisy, filthy, and violent....but I love it.",
                "author": "nohumanape"
            },
            {
                "raw_content": "Every time I see one of these posts, I get a little bit closer to another purchase I’ll regret.",
                "author": "twili-midna"
            },
            {
                "raw_content": "Oh man I can’t wait to play this again on switch 2! But I will in fact wait because I’m still in the middle of DK, Zelda replays, and my wife will absolutely disappear me if I go buying more games right now 😂",
                "author": "Adogover"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: The Yakuza Kiwami Switch 2 upgrade pack will not work with the LRG NS1 physical edition.",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I feel like Sega could change that easily",
                "author": "Linkman806"
            },
            {
                "raw_content": "I paid a 15 dollar physical premium to be stuck with a worse version of the game. Its not a big deal since I already beat Kiwami on my Xbox, but it still sucks nonetheless.",
                "author": "Subject_One_1673"
            },
            {
                "raw_content": "This makes no sense. It’s a patch. Why wouldn’t it work… wild",
                "author": "8bitjer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can’t believe it took a next gen update for 2 save slots but god damn it’s worth it just to experience this again. Now onto Tears which I never actually played on S1 other than the first sky island",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "on S1 you could just create a new profile for new save slot",
                "author": "Careful-Pickle"
            },
            {
                "raw_content": "Why did it take so long for the games to get a second save slot when prior games had at least three right off the bat? And those older games had storage limitations as well. I shouldn't have needed to create a second profile to circumvent this limitation. Oh well. Better late than never.",
                "author": "Alvin-Earthworm"
            },
            {
                "raw_content": "You're in for a treat with Tears of the Kingdom if playing it for the first time in Switch 2 form, as I currently am. I'm so sucked in, close to 100 hours, I've only done the first layer on DK Bananza, which I've had since release day. No slight on DK, really looking forward to getting stuck into it even though it was mostly for my 8-year-old who wanted it, and has almost completed it.",
                "author": "DisagreeableRunt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Seriously",
        "score": 213,
        "text_content": "This was not a code in box when I brought it",
        "comments": [
            {
                "raw_content": "Yeah a few publishers do this: Cartridge run for a few years and then switch over to code in a box. The FF7/FF8 remasters sold here for example are available both as physical and code in the box.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "This has happened with a few Square Enix games, actually. This one, Nier Automata, FF7 and FF8 off the top of my head. Not sure if any of the other code in box games were originally physical.",
                "author": "crocicorn"
            },
            {
                "raw_content": "This is how it should be. Give us the option to buy a code (in a box or not) that is deeply discounted, or give us the option to buy the full physical edition.",
                "author": "bransby26"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why are there so few Switch 2 Edition games?",
        "score": 279,
        "text_content": "Last Thursday Groove Coaster Future Performers got released, and it only has a Switch 1 version. Why is there no Switch 2 Version to support 120hz, a norm for modern rhythm games on every other plattform? It's running perfectly fine with locked 60fps on the Switch 2, don't get me wrong, but it still sucks. Why is a new Katamari comming that just like the previous games runs not so well on the Switch 1 but there is no Switch 2 version announced? I mean, we are speaking about Bandai Namco and Taito, I would asume that they already have a Switch 2 dev kit, so what is stopping companys from doing a native Switch 2 version? It realy stings me with those 2 games. Having a fancy new console and yet nothing (except Welcome Tour) uses the 120hz mode.",
        "comments": [
            {
                "raw_content": "A combination of lack of dev kits and development costs. There are several developers when interviewed about porting their game to Switch 2 their immediate comment is “we don’t have dev kits”. Warframe developers at Digital Extremes were recently interviewed and they said that yes a Switch 2 version would be coming, but they don’t have dev kits yet. The other factor is cost. If it requires any level of programming and testing that costs money for the developer to do. If Nintendo is not paying for it and the publisher is not paying for it then a developer likely isn’t going to just work on an upgrade for free. Yes they can sell an upgrade pack, but I’m sure many developers and publishers are collecting data surrounding how profitable that is before assigning resources to creating an upgrade pack/patch.",
                "author": "greydawn83"
            },
            {
                "raw_content": "It's because not enough developers have been sent Switch 2 dev kits yet to design games for the system. So it might not be until next year that we see the proper switch over to switch 2 and options for most games.",
                "author": "Old_Atmosphere_651"
            },
            {
                "raw_content": "Partially because Nintendo didn't send out very many dev kits and partially because the system is less than two months old.",
                "author": "ExismykindaParte"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What’s the consensus around more gimmicky Nintendo titles at this point? I feel like I don’t see anyone talking about any excitement for this game for instance.",
        "score": 90,
        "text_content": "Personally, I will FOREVER love Nintendo’s attachment to gimmicky control schemes and weird quirky ideas for games. It’s when their “surprise and delight” personality really comes through. I think most people kinda shrugged off this game when it was shown in the switch 2 direct (and admittedly I was kinda there with them) because it was basically just “the two mouse mode” game. And I can definitely understand it from the perspective of the Switch 2 being the beefier “more hardcore” gaming console which in turn lends itself into better more graphical more intense immersive “pure gaming” experiences. So perhaps seeing this title put them off a bit in the midst of that “foundation” of thinking. But the more I see of it, and Nintendo advertises it, the more I think they really got something pretty special here. All the cool tricks and stunts you can pull, all the different game modes and even class weights that keep it interesting, and by FAR the probably saving grace of a game of this caliber, the price ONLY being 20 dollars. If variable pricing truly means we’re getting smaller titles for smaller prices, sign me up. But that’s just my personal take as a Wii Sports/ Nintendogs enjoyer. What’s the concensus? (Tho I suppose we’ll know soon enough).",
        "comments": [
            {
                "raw_content": "One of my favorite games on Switch was Mario 35. It had very little content, but it had a satisfying loop, and I felt like I got a little better every time. It was free, but if it had been $20 and not a time-limited offering, I would still play it and would still have felt like the price was fair. I could see this being similar. Not a ton of content, but fun to play. $20 seems fair. I might check it out. If I don't end up playing it, it will only be because I still have such a huge backlog.",
                "author": "F6Reliability"
            },
            {
                "raw_content": "Sometimes these games are a surprise hit, but I’m not so confident in this one. I want to be wrong, but it looks like one of those games that people will pick up out of boredom because of its relatively low price and lack of other compelling switch 2 exclusives, and once more stuff drops it’ll become a ghost town. It doesn’t seem like Nintendo cares about it all that much either. Just showing off what’s possible with the mouse controls. The art direction and everything doesn’t scream that they’re developing this with longevity in mind.",
                "author": "Yarra10313"
            },
            {
                "raw_content": "I looks ugly... If they'd make if more colorful I think i might try it, but the overall aesthetic is not really appealing…",
                "author": "gybefan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate: \"I have not heard of a Direct taking place this coming week\" BUT \"I cannot dismiss an Indie World taking place -- as that is not something I looked into.\"",
        "score": 231,
        "text_content": "In response to the SwitchForce claims of a non-general this week. As the SwitchForce video implies an Indie is what he's talking about, maybe he's still right. But in all honesty, SwitchForce is almost certainly 100% wrong. SOURCE: [https://xcancel.com/NateTheHate2/status/1952538646055452825](https://xcancel.com/NateTheHate2/status/1952538646055452825)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Anytime someone predicts a direct is coming \"this week\" they'll eventually be right.",
                "author": "XthecreatordayX"
            },
            {
                "raw_content": "just put the prime 4 direct in the bag bro",
                "author": "Same_Active_7076"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[1BF] Battlefield 6's BR map's video leaked",
        "score": 315,
        "text_content": "- Better look at the LA map from the top - Definitely has a more vibrant and playful look compared to the multiplayer - Comes from 1BF’s telegram Source: [https://streamable.com/5zk5yu](https://streamable.com/5zk5yu)",
        "comments": [
            {
                "raw_content": "The map and level of detail/render distance looks great for a BR. I guess that’s what happens when you don’t have to support 12 year old hardware.",
                "author": "wovengrsnite192"
            },
            {
                "raw_content": "The game's open beta hasn't even been released yet and everything about this game has been \"leaked\".",
                "author": "M74SG"
            },
            {
                "raw_content": "If this ends up being a success, it’ll be funny to me that EA will have two successful BRs while Ubisoft has zero despite them trying desperately to make one lmao",
                "author": "Early-Eye-691"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NVIDIA RTX 50 SUPER series with Vram upgrade to release before 2026",
        "score": 248,
        "text_content": "Before it was expected to appear at CES 2026 1 year after the launch of the non SUPER variants, just like it's previous generation 40 series but, according to some source, the RTX 50 series SUPER variant are now on track on Q4 2025 or holiday 2025, making it sooner than expected The following RTX 50 series that will get Super Refresh: * **RTX 5070 Super 18GB GDDR7** * **RTX 5070 Ti Super 24GB GDDR7** * **RTX 5080 Super 24GB GDDR7** Prices aren't known yet, but knowing Nvidia's past generation history, and now recent rumor of them cutting the current price of RTX 50 series, it will probably be just the same as current RTX 50 non super variant MSRP as of right now before their impending price cut. [https://videocardz.com/newz/nvidia-geforce-rtx-50-super-rumored-to-appear-before-2026](https://videocardz.com/newz/nvidia-geforce-rtx-50-super-rumored-to-appear-before-2026)",
        "comments": [
            {
                "raw_content": "Nvidia releasing new graphics cards every 10 minutes I guess.",
                "author": "Admirable_Current_90"
            },
            {
                "raw_content": "I expect them to dry out the 5000 series for 3+ months so that they can launch these at inflated prices just like the 4-5 series.",
                "author": "HotMoosePants"
            },
            {
                "raw_content": "I'm tired, boss",
                "author": "ScootSchloingo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dexerto: Guilty Gear producer denies Insider Gaming report on a cancelled Guilty Gear game. Calling it \"... making up rumors that come out of nowhere.\".",
        "score": 303,
        "text_content": "**Key Quotes** \"We sat down with Ken Miyauchi, Strive’s producer, for a conversation at [Evo](https://www.dexerto.com/tag/evo/) 2025, where we brought up these rumors and asked if there was any merit to them.\" >“It’s kind of funny, but I didn’t know about it. It was just a rumor. It’s interesting to see that kind of rumor coming out of nowhere. >“My take is that Guilty Gear Strive, a serious IP, has grown so big, and that’s why people started making up rumors that come out of nowhere. >“What I know is that it’s not in my hands. I don’t think I have ever seen that \\[game\\], and we are not that big of a company, you know? So, if I do not know about it, then it probably didn’t exist in the first place. >“I’m kind of sad because I’m Guilty Gear Strive’s producer. So you know, if there is any chance that Guilty Gear games are going to be made, I’m very, very happy to be involved.” >“I think when we start our new game, that’s gonna be when Daisuke Ishiwatari is ready for it,” he said. \\+ more on Guilty Gears future depening on 2.0. Source: [https://www.dexerto.com/gaming/guilty-gear-strive-producer-speaks-out-on-rumors-of-canceled-follow-up-game-3233422/](https://www.dexerto.com/gaming/guilty-gear-strive-producer-speaks-out-on-rumors-of-canceled-follow-up-game-3233422/)",
        "comments": [
            {
                "raw_content": "#Insider Gaming is a Tier 2 - Generally Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Yeah I feel like that was pretty obvious given that they literally said they wanted to keep making more strive content less than a week before that rumour came around",
                "author": "Gingingin100"
            },
            {
                "raw_content": "If it's not reported by Tom Henderson, then I don't trust what Insider Gaming has",
                "author": "smolgote"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Kepler_L2: GFX13 (RDNA 5/UDNA) is the biggest architectural overhaul since GCN",
        "score": 181,
        "text_content": "[https://www.neogaf.com/threads/mlid-ps6-early-specs-leak-amd-rdna-5-lower-price-than-ps5-pro.1686842/post-270680706](https://www.neogaf.com/threads/mlid-ps6-early-specs-leak-amd-rdna-5-lower-price-than-ps5-pro.1686842/post-270680706) Kepler\\_L2: \"*Well yeah they are changing everything, gfx13 is the biggest architectural overhaul since GCN.\"*",
        "comments": [
            {
                "raw_content": "GFX13 = Codename for UDNA/RDNA 5. \\- UDNA/RDNA 5 is AMD's nextgen AMD GPU architecture. Powering nextgen consoles and AMD's nextgen GPU lineup according to latest rumours, including those shared by Kepler\\_L2. GCN = Graphics Core Next \\- AMD's GPU architecture that succeeded TeraScale in 2012. Was a clean slate design. Powered GPU architectures from 2012-2017, including Vega and Polaris, and the 8th gen consoles (Xbox One S/X, Xbox One and PS4/PS4 Pro). Succeeded by the clean slate architecture RDNA in 2019 that had later versions powering the 9th gen consoles (PS5/PS5 Pro and Xbox Series X/S) as well as AMD's dGPU lineups from the last +6 years.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Ah, yes. My favorite “bigness” scale.",
                "author": "M337ING"
            },
            {
                "raw_content": "Nintendo Gamecube?",
                "author": "johgru"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen 9000 CPU with 16 Zen5 cores, 192MB of L3 cache and 200W TDP reportedly on the way - VideoCardz.com",
        "score": 301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9999X3D?",
                "author": "Celcius_87"
            },
            {
                "raw_content": "Looks like it's going to essentially be a dual 9800X3D? If it's actually faster in gaming and doesn't run at the temperature of the sun - then it'll sell",
                "author": "anotherwave1"
            },
            {
                "raw_content": "Even if both ccds are with x3d wouldn't that still would have big latency penalty if game uses both ccds?",
                "author": "nologai"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9060 to feature 18Gbps 8GB of GDDR6 memory",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 9060 XT 8GB has been selling for $300 w/a $50 Newegg giftcard. Essentially making it $250 for frequent newegg shoppers. Or the 9060 XT 8GB version can be found at Micro Center for $224. But I feel like they're still going to try and sell this non-XT one for $250 MSRP and leave people saying once again \"This 8GB card should not be more than $200\" just like they did for the XT. We'll see. Edit : It seems the 9060 non-XT is for prebuilts only. if that's what \"system integrators\" are. I guess that's one way to sell these things and avoid people criticizing their price being too high.",
                "author": "BeerGogglesFTW"
            },
            {
                "raw_content": "overclockers have a sapphire 9060 XT 8GB for £239.99. i could be interested in a 9060 if it hit £200...",
                "author": "Jedibeeftrix"
            },
            {
                "raw_content": "Ah yes, the RX~~9050~~ RX9060. Remind me why the 9060XT 8gb exists? Should've just been this all along. Either that or this should've never existed in the first place.",
                "author": "WaterChugger28"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen 7 9800X3D left Core i9-14900K in the dust in Battlefield 6 early streamer tests — both systems included an RTX 5080, but the 3D V-Cache system was roughly 30% faster",
        "score": 200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really hope to see how 5800x3d will handle BF6 paired with a 4070ti super",
                "author": "Ehzaar"
            },
            {
                "raw_content": "X3D has been shown to age significantly better for gaming than anything from Intel in the last few years. I was on Intel when the 5800X3D first launched and when I saw how good that chip was I knew my next build was going to be some sort of X3D CPU.",
                "author": "Wander715"
            },
            {
                "raw_content": "*Pats his 9800X3D*",
                "author": "Celcius_87"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "CPU/GPU Scaling: Ryzen 7 5800X3D (RTX 5090, 5080, RX 9070 & 9060 XT)",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Riding it out to AM6 and when my second child I don’t have is out of daycare.",
                "author": "Snagmesomeweaves"
            },
            {
                "raw_content": "Watching this as a mid range gamer makes me realize I can keep my 5800x for a while. I plan to grab a 9060xt 16gb and I’ll still be fine especially at 1440p.",
                "author": "Tree_Dude"
            },
            {
                "raw_content": "Yeah gonna wait for AM6 5700x3d is almost never the bottleneck",
                "author": "UncleRico95"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Intel XeSS 2.1 Frame generation & XeLL now available for AMD & NVIDIA GPUs",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I like that it lets you set a target frame rate, one reason I don't like frame gen it that doesn't let me set a fixed frame",
                "author": "BasedBalkaner"
            },
            {
                "raw_content": "I'm not interested in frame gen. I'd much rather have Asynchronous Reprojection.",
                "author": "Nuck_Chorris_Stache"
            },
            {
                "raw_content": "Will this work on steam deck?",
                "author": "rinoa69"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MoreClockTool 2 released, premium overclocking and tuning tool for Radeon RX 6000+ GPUs",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does anyone know what features it lacks to achieve full feature parity with Adrenaline software? I was amazed by the fact it can control for things like Radeon boost, chill, super resolution etc. and it makes me wonder how good replacement for adrenaline it is....",
                "author": "jezevec93"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS refreshes Radeon RX 9070 PRIME graphics card, EVO variant with narrower PCB",
        "score": 11,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Redfin: U.S. housing market now 508,715 more home sellers than homebuyers",
        "score": 332,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting how home buyers is trending down.",
                "author": "Clever_droidd"
            },
            {
                "raw_content": "Very nice chart. I seem to remember a similar chart a while back, and everyone was asking how you calculate the buyer number. I can't remember what the explanation was. There must be an assumption or two built into it.",
                "author": "FrostyAnalysis554"
            },
            {
                "raw_content": "If only all of these houses on the market weren’t overpriced and didn’t suck. “I know what I have!!!!” -the forever cry of the negligent greedy seller /s",
                "author": "wait_what888"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing to remain weakest part of economy, falling 8% in the second half, Goldman says",
        "score": 362,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's optimistic about the rest of the economy",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Paywall bypass: [https://archive.ph/TCejN](https://archive.ph/TCejN)",
                "author": "HereWe_GoAgain_2"
            },
            {
                "raw_content": "Somewhere, Blackstone is yellow jacket guy behind a tree-meme.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates drop to lowest levels of the year at 6.57%; 15 yr at 5.91%",
        "score": 128,
        "text_content": "Mortgage rates have now fallen to 9 month lows. 30 yr = 6.57%. 15 yr = 5.91% https://www.mortgagenewsdaily.com/mortgage-rates",
        "comments": [
            {
                "raw_content": "Our pre approval was 7% two weeks ago. Really hesitant to buy. Houses are priced like interest is still 3%",
                "author": "grayandlizzie"
            },
            {
                "raw_content": "Oh ya, that $15 per month less payment is really gonna revive the housing market. 😂",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Wake me up with 30 yr is sub 5 again",
                "author": "sjadowcrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 2.0% Below 2022 Peak",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2% below 2022 peak. So no bubble then right? Time to close down this sub I guess.",
                "author": "Lootefisk_"
            },
            {
                "raw_content": "\"When you adjust prices for the increase in prices they don't look so bad\" herp derp",
                "author": "tucker_case"
            },
            {
                "raw_content": "It has been 19 years since the housing bubble peak, ancient history for many readers! In the May Case-Shiller house price index released yesterday, the seasonally adjusted National Index (SA), was reported as being 77% above the bubble peak in 2006. However, in real terms, the National index (SA) is about 10.5% above the bubble peak (and historically there has been an upward slope to real house prices). The composite 20, in real terms, is 1.9% above the bubble peak. People usually graph nominal house prices, but it is also important to look at prices in real terms. As an example, if a house price was $300,000 in January 2010, the price would be $442,000 today adjusted for inflation (47% increase). That is why the second graph below is important - this shows \"real\" prices. The third graph shows the price-to-rent ratio, and the fourth graph is the affordability index. The last graph shows the 5-year real return based on the Case-Shiller National Index. Nominal House Prices The first graph shows the monthly Case-Shiller National Index SA, and the monthly Case-Shiller Composite 20 SA in nominal terms as reported. In nominal terms, the Case-Shiller National index (SA) and the Case-Shiller Composite 20 index (SA) both declined in May, and both are about 0.9% below the all-time highs set in February 2025. Real House Prices The second graph shows the same two indexes in real terms (adjusted for inflation using CPI). In real terms (using CPI), the National index is 2.0% below the recent peak, and the Composite 20 index is 2.2% below the recent peak in 2022. Both the real National index and the Comp-20 index decreased in May. It has now been 36 months since the real peak in house prices. Typically, after a sharp increase in prices, it takes a number of years for real prices to reach new highs (see House Prices: 7 Years in Purgatory). There is nothing magic about “7 years”, it just made a good post title! My initial guess on house prices was “mostly flat prices nationally in 2025” which would suggest a slight decline in real prices. In real terms, national house prices are 10.5% above the bubble peak levels. There is an upward slope to real house prices, and it has been 19 years since the bubble peak, but real prices are historically high.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventories of Homes for Sale Surge in Denver, Seattle, Phoenix, Tucson, Portland, Las Vegas, Salt Lake City, Albuquerque, Boise",
        "score": 16,
        "text_content": "https://wolfstreet.com/2025/08/04/inventories-of-homes-for-sale-surge-in-denver-seattle-phoenix-tucson-portland-las-vegas-salt-lake-city-albuquerque-boise/ Inventories of Homes for Sale Surge in Denver, Seattle, Phoenix, Tucson, Portland, Las Vegas, Salt Lake City, Albuquerque, Boise | Wolf Street Lots of inventory, little demand: Median days on the market before homes got pulled or sold spiked to 70 days in Phoenix. By Wolf Richter for WOLF STREET.",
        "comments": [
            {
                "raw_content": "whenever i read something from Wolf Richter i picture a jacked, 60-something sitting in his den with all the blinds closed, surrounded by WWII books, a TV in the distance with CNBC on 24/7, with a huge fucking glass of iced tea, he’s got a printed-out manuscript sitting next to him a screenplay that he’s written about how the world financial systems collapse, there’s a bunch of Desert Storm memoribilia on the walls although he never served, etc",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Drop to Lowest Level in 10 Months, Upping Purchasing Power in a Buyer-Friendly Market",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMFAO heard this before, only 300bps to fall before those rates match current prices",
                "author": "TrickySalamander589"
            },
            {
                "raw_content": "Bro, how many times are you going to post the same story? What's a boomer like you care about the housing market for? Don't you have yours and \"screw everyone else?\"",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "This is nowhere near being a buyers market. Sellers are still on top even with their price cuts unless they bought very recently.",
                "author": "JustVegetable9941"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "I'm stuck with this 7.6% interest rate aren't I?",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sheesh, must have atrocious credit to be stuck at 7.6% since 2023",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Notice he doesn't say he's stuck with an overpriced house. No he's stuck with a very average interest rate. The debt donkeys have been trained well.",
                "author": "indyprivatelending"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nation’s top supplier: Housing market pain worse than builders say",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paywall blocking, can you provide summary?",
                "author": "Extension_Degree3533"
            },
            {
                "raw_content": "Basically the article states the supply of unsold new homes is piling and Yes the large home builders like Dr Horton and Lennar have to continue to keep cranking out the homes to maintain their stock valuation. Expect more freebies (like free upgrades or lower rates) being offered by these home builders to entice buyers instead of directly cutting the home price..",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seems like a new Google model is imminent.",
        "score": 554,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Google needs to work on their voice mode",
                "author": "Candid-Television732"
            },
            {
                "raw_content": "Since it's Omar, must be Gemma 3.5 or Gemma 4",
                "author": "AdventurousSwim1312"
            },
            {
                "raw_content": "This week will be crazy https://preview.redd.it/v5bow5bnt2hf1.jpeg?width=828&format=pjpg&auto=webp&s=0d0771087390ddf99d051067fad2354ae9bdc316",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis Hassabis on our AI future: ‘It’ll be 10 times bigger than the Industrial Revolution – and maybe 10 times faster’",
        "score": 629,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And don't forget that Demis is one of the most conservative person in the AI field",
                "author": "Gab1024"
            },
            {
                "raw_content": "Doesn't everyone on this subreddit already know that because isn't that like the definition of technological singularity",
                "author": "Ready-Journalist1772"
            },
            {
                "raw_content": "This dude doesn't fuck around with words. Buckle up.",
                "author": "InternationalPlan553"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Make it make sense: AI revenue & valuation race heats up this week",
        "score": 164,
        "text_content": "Lots of valuation and AAR news came out this past week. Some seem way too low, others way too high, and others seem better justified once seeing everyone else. Thoughts?",
        "comments": [
            {
                "raw_content": "I'm wary of palantir's value (I looked a bit into it for stock investment). It looks high on hopium, and is potentially fragile if they fall out of favor with the current government (or if the next one does not like 'em)",
                "author": "PwanaZana"
            },
            {
                "raw_content": "Not sure what the confusion is. You don't calculate the valuation based only on revenue. You base it on what you think those shares are worth. Anthropic may only be making $4 billion a year but shares don't expire after a year and its value is going to fluctuate based on perceived future revenue potential.",
                "author": "ImpossibleEdge4961"
            },
            {
                "raw_content": "yea i don't get antrhopic at half of openai's valuation. i'm sure their investors aren't stupid but i don't really understand the reasoning behind it",
                "author": "Curtisg899"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Concrete Reinvented: AI Simulates 4 Billion Atoms To Build Better Materials",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This sounds very interesting, but do we actually want concrete that lasts a thousand years? It's not like we can't already make that, it's just that the trade-offs involved don't make sense. It also might not make sense to create a bunch of pretty much permanent structures like that. What if we need to develop different infrastructure? What happens when parallel development in housing technology comes along and we want to make houses that include it?",
                "author": "DeterminedThrowaway"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is testing an AI bug hunter agent powered by Gemini",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[goo.gle/bigsleep](http://goo.gle/bigsleep)",
                "author": "pavelkomin"
            },
            {
                "raw_content": "A stairwell away from self-improving AI",
                "author": "cloudonia"
            },
            {
                "raw_content": "![gif](giphy|maJfaPl0JNswFJvfoR|downsized)",
                "author": "0_Johnathan_Hill_0"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Things are picking up",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GPT-5 & Gemini 3.0 Flash this week? and Opus 4.1 within 2 weeks? eventful month we will be having.",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Gemini 3 w/ deeper, faster, harder THINKING",
                "author": "GamingDisruptor"
            },
            {
                "raw_content": "![gif](giphy|HFe8qjKRQNlLQkbjXM|downsized) MORE!!!!!!!!",
                "author": "superbird19"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI has created a Universal Verifier to translate its Math/Coding gains to other fields. Wallahi it's over",
        "score": 748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The information’s business model is wild. A few “leaks” a year about OpenAI that are a week or so ahead of other sources… that’ll be $500 please",
                "author": "Dear-Yak2162"
            },
            {
                "raw_content": "' https://preview.redd.it/s46seetor0hf1.png?width=627&format=png&auto=webp&s=564e3ec5988cb5005b844f55f7bac9ed6d51e136 From the article a few days ago: 'Universal Verifier’ But OpenAI still had a trick up its sleeve: It had been developing what researchers referred to as a “universal verifier” that automates the process of making sure a model is producing high-quality answers during the RL process, said a person familiar with the work. That process essentially involves tasking an LLM with the job of checking and grading another model’s answers by using various sources to research them. After an OpenAI model won a tough math competition earlier this summer, Alexander Wei, a senior researcher at the company, said on X that the RL approach it has been using was “general purpose,” implying it could verify the quality of answers in more-subjective categories as well. Such advances appear to have helped OpenAI with developing GPT-5, which showed improvements both in more easily verifiable domains like software programming—where correct answers can be easily checked—and in more subjective areas such as creative writing. The rest of the industry, including xAI and Google, has also doubled down on RL as a promising technique for improving AI models, and Tworek, who leads OpenAI’s RL, recently made a public comment agreeing with the idea that the RL system behind OpenAI’s models is in fact what constitutes AGI.",
                "author": "tremor_chris"
            },
            {
                "raw_content": "No link?",
                "author": "edwardcount"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI advertising directly to doctors now is wild!",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you're worried about doctors reading hallucinated AI summaries of patient notes, rest assured. They didn't read the patient notes before and they won't start reading the AI summary now either.",
                "author": "orderinthefort"
            },
            {
                "raw_content": "You’ll get insta-fired and probably fined if you paste PHI into a third party site. My hospital has a contract for HIPAA compliant LLM API calls through a model picker router with approved vendors, but most hospitals don’t.",
                "author": "typeomanic"
            },
            {
                "raw_content": "I think this is the first time I've ever seen an ad for OpenAI tbh",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    }
]