[
    {
        "post_name": "⛔ New Reports: Texas Democratic lawmakers have announced that they NO LONGER plan to return to the state...",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AKA vacated their seats.",
                "author": "LogicalReasoning"
            },
            {
                "raw_content": "So they no longer have a position in state government then, right?",
                "author": "VoidWanderer"
            },
            {
                "raw_content": "Someone is paying them. Follow the money.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Rep. Eric Swalwell compares ICE agents to ANTIFA – the radical left-wing rioters who burned down cities in violent protests. Unhinged. (fart sound)",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So ICE is just an idea, right?",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "I thought antifa didn't exist?",
                "author": "Foxbat"
            },
            {
                "raw_content": "So what you're saying is, Antifa is bad?",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "That's sucks. Okay, bye!",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "American citizens have dreams too. 'Not to have shitholers destroy our economy, culture and birthright. The ICE agent should have replied, \"Shut the fuck up\" because the criminal's opinions have no place here either.",
                "author": "redredwine"
            },
            {
                "raw_content": "Besides all the rampant sex, drug and weapon trafficking??? This whole \"better life\" thing is BS. They want their handouts at our expense and 90% of our faggot politicians apparently are good with it.",
                "author": "mmmpillsaregood"
            },
            {
                "raw_content": "Adios beanarios!",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The President of the United States has declared himself Crime Fighter in Chief",
        "score": 1255,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy “Big Balls” Batman",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Nadler is penguin",
                "author": "I_SPEAK_JIVE"
            },
            {
                "raw_content": "I hope Trump posts this",
                "author": "Bluemoonsugar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: After news broke that popular Roblox gamer Schlep received a cease-and-desist from the billion-dollar company and was banned from the platform for exposing predators, players began staging in-game protests using the hashtag #FreeSchlep. Now, Roblox is suspending users who....",
        "score": 1128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Roblox's response has gone from pretending to protect their game/service and brand to one that has an air of panic about it. Very red flag",
                "author": "ridge3z"
            },
            {
                "raw_content": "The current CEO of Roblox is David Baszucki. He lives in San Francisco.",
                "author": "YearninNation"
            },
            {
                "raw_content": "Everyone should log off for a few weeks, I bet they will change their tune.",
                "author": "Fusion360"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: AZGOP and @GOP are suing to stop UOCAVA abuse that lets never-resident non-citizens vote in AZ. We’re fighting for lawful votes, clean rolls, and election integrity.",
        "score": 983,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arizona is a complete clusterfuck, and that is not an exaggeration.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Why bother with all that when the person certifying the election is one of the candidates?",
                "author": "utfanx2"
            },
            {
                "raw_content": "There's no end in sight to the Democrat election rigging and cheating. They abuse every good intention rules and bend those to make sure they win power. They are in the shadows rigging and stealing the next Primary election, they have to in order to survive because it's the only way they can win. Very grateful for AZGOP exposing this. I'm certain other Sates are doing this too because it spreads like an infection once the Dems learn a new cheat technique to take advantage of a good system they ruin for everyone else. That's essentially how they sold out America.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trump demands Hunter Biden retract \"false, defamatory, disparaging, and inflammatory statements\" about Epstein or face $1 billion lawsuit",
        "score": 1269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lock up that felon.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Why isn't he in prison right now? This shit won't stop until every last Biden is in the slammer.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Melania didn't appreciate Hunter Biden saying that Epstein introduced her to Trump.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Tom Homan just announced that DC’s illegal alien Sanctuary City status has been REVOKED under President Trump’s federalization. https://x.com/RapidResponse47/status/1955732743700275707/video/1 Oh, they are going to lose it over this.",
        "score": 1636,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol so that mean if Trantifa acts up they will be under federal jurisdiction",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Every illegal alien in DC is a criminal.",
                "author": "pede8"
            },
            {
                "raw_content": "How crazy can President Trump make them? MOAR!",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣🤣🤣🤣🤣",
        "score": 918,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wife has a loony tune liberal friend, she hates Trump. I don’t like that miserable witch so it is very comforting to know that she feels like I did during the Kenyan’s “presidency”. I hope we get eight years of Vance as the cherry on top. BTW, I donated $100 to the Trump campaign in her name. She gets frequent calls for more contributions and has no idea who the asshole is that did this…",
                "author": "Photoncounter"
            },
            {
                "raw_content": "Reeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeeee",
                "author": "TEXinLA"
            },
            {
                "raw_content": "I don't think a lot of them are gonna make it.",
                "author": "airmaildolphin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“People in DC do not really care that Trump deployed the National Guard.” “I worked in a local election a few months ago—mind you, this is a place that voted 90% for Kamala—and by far the biggest issue for people was crime. People didn’t care about anything else.”",
        "score": 695,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their biggest issue was crime. They voted...KAMALA? Retard Alert!",
                "author": "DingleBalls"
            },
            {
                "raw_content": "What color are the criminals?",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "What an annoying person, JFC. Slow down and actually talk like a normal person, and these cuts every 5 seconds are ridiculous.",
                "author": "bubadmt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It’s been revealed Democrats colluded with the United Nations, giving $6 billion to a conglomerate of over 200 NGOs to facilitate the largest illegal immigration invasion in U.S. history under Biden with migrants reaching nearly every congressional district according to executive director of the Ove",
        "score": 1371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Each one should be shut down, assets seized, leadership arrested. The UN should be booted from the United States and shut down. Crimes against humanity, including human trafficking.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "The UN is not your friend",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "So any day now somebody’s gonna go to prison, right? Right?",
                "author": "ChimpanzeeFatigue"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: A DC man has been charged with felony assault charges after hitting a federal agent with Subway sandwich",
        "score": 1434,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Assault with a breadly weapon.",
                "author": "DammitCarlos"
            },
            {
                "raw_content": "He's gonna get a different kind of $5 Footlong in prison",
                "author": "TexasBeer"
            },
            {
                "raw_content": "Redditors were cackling over this wannabe sprinter escaping and said the pigs would never catch him. Guess they forgot they created a surveillance state and then lost control of it.",
                "author": "9999999999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👨🏿 Jussie Smollett Blames Chicago Police Department, Rahm Emanuel for His MAGA Hate Crime Hoax 👈🏿",
        "score": 848,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How do creatures like this get second chances when most people don't even get the first chance?",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "It be ypipo fawt I lied. Fuck you, you lying pansy.",
                "author": "Herpawinski"
            },
            {
                "raw_content": "Him and Bubba Wallace should both be jailed for their bullshit lies.",
                "author": "Fistfullofgreyhair"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "❓ Who would have ever imagined? A DEMOCRAT LA City Councilman has been CHARGED with Corruption after embezzling a WHOPPING $800,000.00. Meet the corrupt Curren Price, typical Democrat...",
        "score": 622,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another criminal black. What a shock.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Remember this one? Democrat with Money in Freezer William Jefferson, a Democrat who represented parts of New Orleans for nearly 20 years, was caught with $90,000 in cash wrapped in foil and hidden in boxes of frozen food in his home The discovery, made during an FBI raid in 2005, became central to a bribery case in which he was accused of accepting hundreds of thousands of dollars in bribes to broker business deals in Africa He was convicted in August 2009 on 11 counts including bribery, racketeering, and money laundering, and was sentenced to 13 years in prison in November 2009, one of the longest sentences ever given to a congressman for bribery In 2017, a judge ordered Jefferson released from prison to await a new sentencing hearing due to changes in the legal definition of an \"official act\" following a Supreme Court decision, though the judge emphasized that Jefferson was not innocent and his actions were \"plainly venal\"",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "They all do it. It’s just that we only catch the dumb ones",
                "author": "Oodles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ghey",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why ah you ghey?",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Who's the body builder in the background and what's his shoulder routine?",
                "author": "PresidentialPepe"
            },
            {
                "raw_content": "Bill Mitchell levels of Gay.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Treasury Secretary Scott Bessent calls for an immediate stock trading ban for Congress: “The American people deserve better than politicians with hedge-fund level returns. Public service should be about serving the people, not getting rich.”",
        "score": 1641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When Nancy Pelosi et al sell stocks that they know are going to go down, someone else buys those and takes a loss on them. It’s like selling someone a car, knowing that the transmission is about to go out.",
                "author": "OK_Parmaker"
            },
            {
                "raw_content": "If enforced, this could become the best de facto term limit imaginable",
                "author": "UncleDonsBand"
            },
            {
                "raw_content": "Make sure to extend it to their immediate family.",
                "author": "lixa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rep. Randy Fine’s ‘Thump Thump’ Bill Permits Drivers to Ram Protesters Blocking Roads",
        "score": 1031,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to put that much needed battering ram on the front of my Hummer.",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "Knowing this guy, he'll make a carveout that anyone who protests in support of Israel will be exempt and it will be a hate crime to hit them unlike any others.",
                "author": "heightnoise"
            },
            {
                "raw_content": "Speedbumps and socialists... Same same",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNN Slaps Trump With New Nickname, Accidentally Makes Him Sound Cooler",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Crime Fighter In Chief.\" There, saved you a click.",
                "author": "PM-Melania-feet-pics"
            },
            {
                "raw_content": "So post the fucking name.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "> Crime Fighter in Chief That *is* a really cool nickname. We should turn it into a flair!",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegal from Romania? guilty to half a million dollars in EBT fraud",
        "score": 1052,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I suspect criminal orgs overseas took advantage of the dems open borders bullshit to steal from us. The dems should be held liable for all damages (assaults, murders, and theft amounts. )",
                "author": "LaterGator"
            },
            {
                "raw_content": "Romania? Fucking gypsies.",
                "author": "Klown_Kutz"
            },
            {
                "raw_content": "I would say over 80 million AMericans are guilty as well. Countless money in section 8, in EBT, in EITC. We are talking millions and millions per person, a number most true workers will never see and yet the ones not working or the half not even from our Country get it in abundance. \"RT, if it is so easy to just not work why don't we all!?!?!\" I hear your shouts of disbelief. Check your skin color to understand why.",
                "author": "RationalThought"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US President Donald Trump: Zelensky deserves no respect and is the only obstacle to peace.",
        "score": 1314,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ukraine military hours away from collapse.",
                "author": "imminent_ban"
            },
            {
                "raw_content": "When you come to the oval office wear a suit. You stupid European Fetterman.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "MODS: Why is this fake quote stickied?",
                "author": "Nellie_the_Beaut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chinese firm BOE to be banned from USA for stealing Samsung's OLED tech",
        "score": 467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Samsung boutta hike prices to the moon.",
                "author": "danglotka"
            },
            {
                "raw_content": "Oh how fun. Wonder what they'll do? Appeal the ruling? Get bailed out by apple's monumental political sway? Use shell corporations to rebrand the products? Ignore it and be content with non-NA revenue? the September launch window phones with BOE displays are likely already produced.",
                "author": "BigIronEnjoyer69"
            },
            {
                "raw_content": "Repost from 11 hours ago: [NotebookCheck: \"iPhone 17 Air OLED supplier \\[BOE\\] to be banned in the US for over 14 years for stealing Samsung trade secrets\" : r/hardware](https://www.reddit.com/r/hardware/comments/1mp45wk/notebookcheck_iphone_17_air_oled_supplier_boe_to/)",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Former Intel engineer sentenced for stealing trade secrets for Microsoft",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Guy that makes over $120,000 annually receives slap on wrist and a fine that roughly equates to 1/4-1/3 his salary.\"",
                "author": "Nvidiuh"
            },
            {
                "raw_content": "Is Microsoft going to be banned from the US for 14 years as well?",
                "author": "GreatAlmonds"
            },
            {
                "raw_content": "stealing, never ending well",
                "author": "TheAppropriateBoop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NotebookCheck: \"iPhone 17 Air OLED supplier [BOE] to be banned in the US for over 14 years for stealing Samsung trade secrets\"",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some of Valve's Steam Deck OLED displays are BOE, so that's unfortunate for them.",
                "author": "junon"
            },
            {
                "raw_content": "The Framework 13 laptops at least use BOE displays so that's not going to be fun for them, unless the penalty is somehow restricted to only OLED displays.",
                "author": "X_m7"
            },
            {
                "raw_content": "> South Korean outlet Chosun now claims that the ITC is set to ban BOE displays from being imported into and sold in the US for a period of 14 years and 8 months, if the decision is finalized in November. So there is an \"if\". Will it be finalized in that form? If it is finalized in that form, it will be a huge disruption for the electronics industry. There is massive amount of products on the market that use BOE displays. For products using off-the-shelf displays (for example many laptops), there might not be enough production from competitor displaymakers to get replacement display stock from, as these makers might need time to ramp up production. Then some products use a tailor-made display ordered from BOE. Getting replacement display stock from competitor displaymakers for these kind of displays will be really slow.",
                "author": "jones_supa"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CNN: \"133-year old Kodak says it might have to cease operations\"",
        "score": 372,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alot of chemicals used on chip layers come from items from the kodak vendor",
                "author": "Mugwy44"
            },
            {
                "raw_content": "Surprised that they lasted this long without actually putting effort into anything. Everything that they did seemed to be just quick cash grabs of rebranded junk. The epitome of \"I've tried nothing and I'm all out of ideas \"",
                "author": "littleemp"
            },
            {
                "raw_content": "Kodak has no one to blame but Kodak for their troubles. Yeah they missed the digital revolution, but the whole film industry did as well. Fuji Films was facing the same extinction with the rise of digital cameras in the early 2000s. Their new CEO circled the wagons and set his team to identify new revenue sources. With their patent portfolio they were able to pivot in to new markets like pharmaceuticals and medical devices. Kodak has a war chest of intellectual property and a huge research division. They should have diversified and found ways to adapt to the new world instead of taking photos of it passing by.",
                "author": "LazloHollifeld"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel spinoff Altera cuts nearly hundred jobs at Silicon Valley headquarters",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hilarious that it’s now “Intel spinoff Altera” and not jusr Altera. Intel did jack shit with them for 10 years except provide a couple of failed process nodes in lieu of using TSMC like Xilinx.",
                "author": "EETrainee"
            },
            {
                "raw_content": "Intel's ownership of Altera has been an utter disaster. Product development has slowed to a crawl while they tried and failed to port Altera designs from TSMC to Intel process nodes. I use their parts in some of my designs but that's not viable long-term because they've fallen so far behind. Altera hasn't launched a new low-end FPGA in **11 years**! Their current line of CPLDs is 15 years old. In that time they've not bothered even doing a die shrink of existing designs. It's a shame. Their Quartus development tools are relatively good (or less terrible) compared to the competition and I love the simplicity of the single-rail Max 10 parts; hook up 3.3v power and JTAG and you're in business. But Lattice and Efinix offer cheaper and more capable chips at the low end, and Xilinx has pulled way ahead in the high end space.",
                "author": "Bombcrater"
            },
            {
                "raw_content": "What are the implications of this for their FPGAs?",
                "author": "Adventurous_Tea_2198"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Code Confirms Vision Pro With M5 Chip",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they can make one with “retina” level of PPD, my body is ready to pay way too much money for it.",
                "author": "milk-jug"
            },
            {
                "raw_content": "I am very glad they keep continuing to develop this technology... So I can one day buy a non apple version that is cheaper, better, and works with other ecosystems.",
                "author": "Yourdataisunclean"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's 500Hz OLED Monitor, Odyssey OLED G6, Arrives in the US for Less Than $1,000",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"less than $1000\" is pretty funny when it costs $999",
                "author": "CallMePyro"
            },
            {
                "raw_content": "Why did they put displayport 1.4 on this monitor?",
                "author": "Influence_Useful"
            },
            {
                "raw_content": "give me that in 4k with 32 inches",
                "author": "ero1Sama"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: US embeds trackers in AI chip shipments to catch diversions to China, sources say",
        "score": 260,
        "text_content": "SINGAPORE/NEW YORK, Aug 13 (Reuters) - U.S. authorities have secretly placed location tracking devices in targeted shipments of advanced chips they see as being at high risk of illegal diversion to China, according to two people with direct knowledge of the previously unreported law enforcement tactic. The measures aim to detect AI chips being diverted to destinations which are under U.S. export restrictions, and apply only to select shipments under investigation, the people said.",
        "comments": [
            {
                "raw_content": "Important to note here that the trackers are being embedded in shipments of servers, and not on the chip themselves. Article notes the trackers are found in the packaging of the products, with some as large as a smartphone. So not the backdoor or on-chip devices that China has been concerned about. Seems like a standard enforcement method to catch shipments going where they’re not supposed to.",
                "author": "Ricjenzsm"
            },
            {
                "raw_content": "every accusation is a confession!",
                "author": "jeremiah_wright_"
            },
            {
                "raw_content": "Aren't most (probably all) of Nvidia's chips manufactured in Taiwan? Good luck preventing any of those from going to China lol.",
                "author": "Iced__t"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to set up chip packaging R&D center in Tokyo, raise stakes vs TSMC",
        "score": 18,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "It's been 69 days since switch 2 launched. What are your thoughts so far?",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Needs more Switch 1 enhanced games since theyre slow on releasing new games I would be playing the shit out of the Xenoblade series right now if they had enhanced those games",
                "author": "eyebrowless32"
            },
            {
                "raw_content": "It’s a good thing that the two new Nintendo games were both amazing because there’s nothing much else to play. Can’t wait for Metroid and whatever comes next.",
                "author": "Sphezzle"
            },
            {
                "raw_content": "I like it, just wish the third party devs were faster on releasing a simple 60fps and increased resolution patch for their games, I'm kind of holding on playing some games because I don't even know if they will get patched, I want to play Hollow Knight on my switch 2 but the resolution is awful, there are games like astral chain and bayonetta that I also want to play, but I'll wait...",
                "author": "gilrbf"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Will Tekken 8 come to the Switch 2 any time soon? Maybe, but it'll take \"a lot of work\"",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tekken 8 is a huge download on other platforms. It’s probably unpopular, but I’d rather have one (or a collection) of much older, smaller Tekkens ported to Switch. The older games hold up incredibly well.",
                "author": "SidFarkus47"
            },
            {
                "raw_content": "Let's be real: this isn't about whether or not Switch 2 can run the game, we all know it can. They just don't want to put in the time, money, and resources required to get the game running on the platform.",
                "author": "SugarSmoothie"
            },
            {
                "raw_content": "Honestly dont think they'd do a good job, if anything just bring Tekken 7 ultimate edition to the switch for the time being. Or a Tekken collection. Maybe port tag 2",
                "author": "BladedBee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Going to my first GAMESCON, and I can't wait to be able to play and see the Nintendo booth and the Indie booth.",
        "score": 272,
        "text_content": "I am going just one day, the complete day and the only things I have on my to-do list are: \\- Play Elden Ring: Tarnished Edition \\- See for my own eyes if Silksong is real (which it's probably not) \\- Take a look at the upcoming NSO Gamecube games that I assume are different from the ones that we have already \\- Of course be able to enjoy and bathe in the awesomeness of Metroid Prime 4 Beyond Oh and I'm also hoping to come across any Nintendo youtubers or podcasters that I follow. Would be nice to take a picture and say hi!",
        "comments": [
            {
                "raw_content": "Imagine pulling up and having the option to play silksong and going to the soul caliber 2 emulated on switch 2 booth lmao",
                "author": "TransThrowaway120"
            },
            {
                "raw_content": "Remember to take an actual Switch 2 with you, that queue is probably going to be quite long for Silksong.",
                "author": "WearingFin"
            },
            {
                "raw_content": "Tell us how Eldin Ring runs.",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has anyone found a Switch 2 case that doubles as a screen cover and handheld grip?",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.savage-raven.com/collections/nintendo-switch-2/products/savage-raven-by-skull-co-standgrip-for-nintendo-switch-2?variant=50503679934756",
                "author": "AdrianasAntonius"
            },
            {
                "raw_content": "There is a lack of grip case that can dock that also has a travel cover with a couple cart slots. I dont want a zipper case and I dont want just a grip case without a cover.",
                "author": "EndlessZone123"
            },
            {
                "raw_content": "The Genki Force Field 2 and Attack Vector have optional travel covers. Also the JSAUX Split Protective Case.",
                "author": "starfoxconfessor"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why do people say you can't play Mario Kart World public matches with a friend?",
        "score": 8,
        "text_content": "So people keep telling me you can only do private matches online with your friends, but you can play a full open lobby with as many friends as you want if someone joins a public lobby and then you go to the friend tab and join.",
        "comments": [
            {
                "raw_content": "You can do that. Bring able to join as a group would be better. But I think the issue is knockout tour. Never been able to join my son when he joins a lobby.",
                "author": "Lugey81"
            },
            {
                "raw_content": "The issue is not being able to group up in a lobby party system. The way Nintendo does it is terrible and I can't name a single multiplayer game without this feature for decades. Third rate garbage games that won't last a month have this feature. If you can only join friends it takes time to fill a server and actually play together. The more friends you want to play with the worse it is as you need free slots and leads to desync issues where some always need to wait for others. Knockout tour is a good example. It is straight up impossible to play it with even just one friend because the mode requires simultaneous start from everyone and it is impossible to sync multiplex people that way. Splatoon 2 shows even more glaring flaws. It is a team VS team game and without the pregame lobby holding people together I'm randomly playing with or against my friends, making teamwork pretty much impossible. For anyone who played other multiplayer games in the last ten years the NSO subscription is a scam. I'm paying for worse online options what the original Xbox had in 2002.",
                "author": "HUNplaymore"
            },
            {
                "raw_content": "Good luck actually joining that lobby your friend is in, especially if it's knockout tour. Always full. Always.",
                "author": "ExismykindaParte"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just tried shinobi art of vengeance. I am sold. What about you?",
        "score": 6,
        "text_content": "I know the demos been out for like a week or so but hadn't gotten around to trying it before tonight. Just finished the demo. I am sold will be getting it on ps5 like i do all multiplatform games only get exclusives on switch. The art style is beautiful. The music is awesome and combat is fast and fluid. Any one else getting it day 1?",
        "comments": [
            {
                "raw_content": "Maybe on ps5 but If they make a switch 2 version definitely yeah. The demo is a blurry mess on switch2 and unplayable for a fella such as myself",
                "author": "Brilliant-Smell-6389"
            },
            {
                "raw_content": "Waiting on reviews first to determine if I get it on switch2 or steam. If it's good and solid performances on both I might even double dip, same for the ninja gaiden ragebound only if the switch version gets a 60fps patch for switch2 (I ended up buying it on steam first)",
                "author": "Serafita"
            },
            {
                "raw_content": "It's day one for me. Played the demo too many times. Ill buy it on Steam and play on my Legion Go if a Switch 2 version isn't available at i launch. Fingers crossed.",
                "author": "LawfulnessPractical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Temporyal: Battlefield 2042 is getting a surprisingly big content update soon; Iwo Jima, three new weapons, and two new vehicles",
        "score": 193,
        "text_content": "https://xcancel.com/temporyal/status/1955701622660591897 >Battlefield 2042 may be getting a surprisingly big (maybe final?) content update soon. > >New Map: >🇯🇵 Iwo Jima > >New Weapons: >🤫 The Prototype (“Riverdweller”) >🔫 KFS2000 (FN F2000) >🎯 GM6 Lynx > >New Vault Vehicles: >🇺🇸 A-10 Warthog >🇷🇺 SU-25TM Frogfoot > >🪖 Pax Armata-themed cosmetics",
        "comments": [
            {
                "raw_content": "They really missed the opportunity to put 2042 deep on sale last week and get a chunk of players looking for more Battlefield when the beta was over. It’s got a historical low of $3 on Steam. I just don’t get what they were thinking",
                "author": "KraftPunkFan420"
            },
            {
                "raw_content": "with portal in bf6 becoming essentially battlefield's take on custom games and the remade maps and guns being left in bf2042 portal there will be a loyal playerbase for 2042 namely portal hopefully we pester dice enough to eventually add the content from 2042 portal in bf6 portal",
                "author": "Laj3ebRondila1003"
            },
            {
                "raw_content": "they've added some of the portal maps to breakthrough/conquest. so if the leadership lets them, they could have a guy that keeps the maps fresh at least. game's still fun, the futuristic gadgets & fast gameplay was actually a breath of fresh air in the end. if only they didn't flub the launch, gave it a campaign, leaned into the global warming map effects, made more interesting maps, they might've not gotten shit on so hard by the community",
                "author": "gbrahah"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "More Black Ops 7 Multiplayer info from TheGhostofHope",
        "score": 115,
        "text_content": "[- Specialists abilities return from BO3/BO4 alongside field upgrades](https://xcancel.com/TheGhostOfHope/status/1955703676242411890) [- There's stuff like active camo, grapple hook and more. Basically what you’d expect.](https://xcancel.com/TheGhostOfHope/status/1955704541204382190) [- Weekly challenges/events like MWIII had are planned to return for Black Ops 7.](https://xcancel.com/TheGhostOfHope/status/1955706193110032416) [- Raid, Express and Hijacked are the 3 remastered BO2 maps at launch](https://xcancel.com/TheGhostOfHope/status/1955708992241688849) [- No Pick 10 system in BO7](https://xcancel.com/TheGhostOfHope/status/1955702697728073754) [- Looping streaks are a perk now](https://xcancel.com/TheGhostOfHope/status/1955701662900683110)",
        "comments": [
            {
                "raw_content": "The weekly challenges and events of MW3 were easily one of the best things about that game. They were giving players new attachments, camos and sometimes even guns entirely for free by just playing the game. Was a really well done live-service feature",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "Brunging back specialists sounds a bit..odd? Can't really picture those working in future, modern setting-like games wich apparently are coming in later years.",
                "author": "Lz537"
            },
            {
                "raw_content": "I hate when they put basic mechanics as perks instead of them an actual toggle options. I don't care about looping streaks imo since I can barely earn a UAV \"Yes I'm that bad\" but just put it as an option instead making us waste a perk slot for a basic feature",
                "author": "PaleBoomer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "TheGhostOfHope: Only 3 Black Ops 2 maps at launch for Black Ops 7. The maps are also going to be “more colorful” closer to Cold War than BO6.",
        "score": 139,
        "text_content": "https://xcancel.com/theghostofhope/status/1955682407740530819?s=46 https://xcancel.com/theghostofhope/status/1955682197748551934?s=46",
        "comments": [
            {
                "raw_content": "imo bo6 maps were pretty colorful to me",
                "author": "Cyber_Swag"
            },
            {
                "raw_content": "Bro cod is in such a shit spot right now, OMG WOW MAPS FROM BO2 AGAIN WOWEEEEE",
                "author": "forevermoneyrich"
            },
            {
                "raw_content": "The mansion map, the yacht map, and the subway map? What else is iconic?",
                "author": "JustBath291"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nvidia delays next generation Rubin server GPUs, to redesign and compete with AMD",
        "score": 7,
        "text_content": "https://www.resetera.com/threads/fubon-nvidia-delays-next-generation-rubin-server-gpus-to-redesign-and-compete-with-amd-may-also-delay-desktop-gpus.1269804/",
        "comments": [],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel to keep Application Optimization (APO) alive, but focus shifts to current and next-gen CPUs",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are we posting an article where the source is a comment in this very subreddit?",
                "author": "bizude"
            },
            {
                "raw_content": "Because of this article I updated a 3 year old Z690 motherboard & 12900K to the latest bios. Found and enabled DTT. Installed the DTT driver. Installed Intel APO. It works. I can see a list of supported games. Not everything showed up. For example I don't see battlefield 1. I guess we now pray and hope Intel gives us more games.",
                "author": "Ok_Carpenter4739"
            },
            {
                "raw_content": "Does it worth using this thing? I have a 265k and a 6800XT. 32gb 8000mhz",
                "author": "Singul4r"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "OneXplayer unveils Super X: 120W Ryzen AI MAX+ 395 gaming tablet with OLED screen",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another expensive max+ 395 (price not announced but its going to be Flow level or higher) Man I wish this chip could go into something just a tad more affordable (I know the lower GB models are in mini PC's for 1.5k but even that's still a bit high) and the rumoured 1k \"AIM laptop\" looks like it doesnt even exist (no sign of the company even existing yet) except for some models sent out to reviewers",
                "author": "anotherwave1"
            },
            {
                "raw_content": "Isn't it safer to just buy a ROG Flow Z13 instead? It has to be much cheaper to make it worth considering.",
                "author": "deadmanslouching"
            },
            {
                "raw_content": "Every time AMD tries to take route of power APU, it prices is well beyond what it supposed to costs to make sense, ending with scenario where you can buy more powerful setup for same price by just buying standard components. Then they are surprised it failed, hibernate for 5 years then try it again.",
                "author": "MDSExpro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI Max+ 395 With Framework Desktop vs. Intel Core Ultra 9 285K Linux Performance",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Intel Arrow Lake continues to provide better graphics performance than the very limited RDNA2 graphics found with the Ryzen 9000 series but with AMD Ryzen AI Max \"Strix Halo\" the integrated graphics come out delivering 8.2x the performance of the Core Ultra 9 285K's Xe graphics. What is Intel *doing*‽",
                "author": "omniuni"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Building a Ryzen Ai MAX+ 395 Mini PC That Plays Every Game!",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Americans Are Getting Priced Out of Homeownership at Record Rates",
        "score": 474,
        "text_content": "https://www.bloomberg.com/news/features/2025-08-13/americans-are-getting-priced-out-of-homeownership-at-record-rates For six glorious years, Paul Woods and Nora Stout owned a home in the Los Angeles suburb of Altadena. They grew lemons and oranges and hosted rollicking parties around a backyard pool facing the purple San Gabriel Mountains. After years of renting, the couple had realized their dream of homeownership and, they thought, were on track for long-term financial security. You can probably guess where this is going: up in flames. After the house was destroyed in LA’s catastrophic January wildfires, Woods and Stout sold their burned-out lot for $540,000, 20% less than they paid for the house in 2018 and about half of the home’s peak value right before the fire. They ruled out rebuilding, which would cost too much and take too long in a place that won’t ever be the same. So they’re back to renting—for now, in a one-bedroom apartment in Orange County, 40 miles from Altadena. These days, though, it doesn’t take a fire—or even living in a famously in-demand coastal city—for the math of homeownership not to add up. Across the US, the costs of purchasing a home are compounding from a lack of new construction since the 2008 financial crisis, the lock-in effect of homeowners unwilling to relinquish low-rate mortgages, plus government policies that make buying and building more expensive. Combine that with mounting losses from climate-change-fueled disasters and other burdens of ownership, and more residents are finding themselves on the losing end of what was for years a solid bet on economic stability and wealth creation. As home sales fall to near-record lows, one of the cornerstones of the American dream is crumbling—and there’s no clear plan for fixing it. It’s no surprise that home purchasing costs have soared, with mortgage rates hovering near two-decade highs and property prices breaking records. What’s shocking is how quickly prices have ballooned out of reach. The annual income needed to afford monthly payments on a median-priced home in the US was $126,670 in 2024—a 60% jump from $79,330 in 2021, according to the Harvard Joint Center for Housing Studies. Meanwhile the US median household income was $80,610 in 2023, the most recent year for which data is available, up just 1.3% from three years earlier. “There’s no rush to be a homeowner given that differential,” says Laurie Goodman, founder of the Housing Finance Policy Center at the Urban Institute. For decades part of the logic for buying a house was that, after the down payment, mortgage payments were generally cheaper than renting. Ultrapricey cities such as New York and San Francisco were the exception. Well, no more: As of June, renting was on average $908 a month cheaper than buying a starter home, and the cost of owning was higher in 49 of the 50 largest US metro areas, according to Realtor.com. Pittsburgh is the last major city where owning is cheaper than renting. In 2021, when mortgage rates were at rock bottom, buying was still as cheap or cheaper than renting in 21 markets, including Atlanta, Cleveland, Philadelphia and Tampa, Florida. The costs associated with homeownership are all spiraling upward, particularly as climate change exacts its toll. The average insurance bill has jumped 74% across the US since 2010, thanks to the growing prevalence of floods, wildfires and other disasters, according to Cotality, a real estate data service. From 1980 to 2024, Texas—one of the country’s hottest housing markets, with vast stores of land and few rules around development—has led the country in annual disasters exceeding $1 billion in damage. It had 20 such events in 2024, up from five in 2014. That was before July’s flash floods killed at least 135 people in an area with tens of thousands of buildings. As home prices soar, so do assessments; in Florida, for example, property tax bills rose almost 50% from 2019 through 2024, according to Cotality. Property taxes jumped 33% in Dallas and 32% in Clark County, Nevada—home to Las Vegas—over the same period. Building or buying a new house costs even more than purchasing an existing home, and President Donald Trump’s tariffs are making the materials more expensive. Another cost pressure: Immigrant workers—the majority of plasterers, drywall installers, roofers and painters—are going into hiding as US Immigration and Customs Enforcement raids terrorize their communities. Homeownership has long been a prime symbol of having “made it” in American society. The Founding Fathers saw it as a prerequisite for the right to vote. After World War II, tax benefits and appreciating values turned homes into a kind of passive savings account that owners could pass on to descendants. But in some ways the dream of the “ownership society,” as George W. Bush said as president in calling for his vision of all Americans owning homes, is responsible for its own death. In the early 2000s, US homeownership reached a record high as lenders offered so-called Ninja loans, mortgages that required virtually no income, job or assets to obtain. By 2008 millions of families found themselves unable to pay or refinance, triggering the biggest wave of foreclosures since the Great Depression. Builders have held back on construction ever since. The US housing deficit grew to about 4.7 million units in 2023 as household formation outpaced new construction. That shortage is keeping home prices high even when demand goes soft. Low supply has juiced home equity for existing owners, but it’s one more factor in shutting out others. What does it mean that the American dream is increasingly unavailable? For one thing, there are fewer chances for families to step onto the wealth ladder. The median net worth of a homeowner in the US is 43 times that of a renter, according to a 2025 estimate from the Federal Reserve’s Survey of Consumer Finances. And though rents may be cheaper than owning in large swaths of the country, they’re still damn high—so high they’re preventing would-be buyers from saving for a house that would then let them build equity. Other factors are also making it hard to conserve. “Student loan debt forgiveness going away and the increased cost of living—there’s less savings for a lot of reasons,” says Joel Berner, a senior economist for Realtor.com. Younger generations, especially those who grew up in renter households, face some of the steepest barriers to entry. In 2024 the median age of first-time buyers climbed to 38, from 28 in 1991. Also last year, the share of first-time buyers in the housing market crashed to 24% from 32% in 2023, the lowest in records dating to 1981, according to the National Association of Realtors. About a quarter of first-time buyers rely on down-payment assistance from family or friends; these gifts or loans tend to be less available for people whose parents didn’t own. In this era of uncertainty, perhaps ownership is no longer all it’s cracked up to be. Some people may be better off without a mortgage that anchors them in one place and limits mobility. Not plunking down for a house lets people do things they might care more about; 83% of Generation Z renters say they’d rather invest in experiences such as travel and career growth than save for a home, according to a survey by Entrata, a property management software provider. Buyers with a disproportionate share of their assets in a home are also the most vulnerable to volatility in the housing market. In fact, some experts are advising homeowners to cash in their equity and reduce their exposure. These days even older owners with smaller, low-interest mortgages should consider trading in for a rental, says Daryl Fairweather, an economist for Redfin. “I think they overvalue staying in a home,” she says. “Homes are expensive.” America as a society of renters might not be all bad",
        "comments": [
            {
                "raw_content": "I’m a millennial and can’t afford to buy. I have a massive down payment side aside. If I buy, I’m house poor and won’t have enough to contribute to savings after all necessary expenses. Essentially I would be working and going home. No having fun, no money for discretionary spending. That’s dangerous, it only takes one emergency to cripple someone in that kind of position; and I know there are many people who are one emergency away from disaster. Something has to give. Here in Florida it’s insane, $150k for a single wide trailer built in the 60-70s. 10 years ago a family member bought a 60s made single wide for less than $15k. It’s mind boggling",
                "author": "SmugSchoolmaster"
            },
            {
                "raw_content": "Greed ruined housing, or shelter. I’m not a fan of Ramsey type real estate “investors”. I would like a home, but only to live in, no shared walls, a hedge against inflation, etc.",
                "author": "Patient-Ad-6560"
            },
            {
                "raw_content": "need to include utility costs. my electric went up 3000 last year and i live in a modest house, but in a cold climate. data centers are killing people.",
                "author": "ApprehensiveYard4071"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Do You Need to Own a House? Many Older Americans Decide They Don’t",
        "score": 78,
        "text_content": "Many Americans aged 55+ are opting to rent instead of own due to: * Rising property taxes, insurance, and repair costs * Desire to avoid maintenance and yardwork * Increased flexibility to travel or relocate New Housing Options * Age-restricted communities offer luxury rentals like villas and townhouses with amenities tailored to older adults. * These communities provide independence without the burdens of ownership. * Renting allows older adults to preserve liquidity and avoid tying up wealth in a single asset. * While some miss aspects of homeownership, many feel liberated by the freedom and simplicity of renting.",
        "comments": [
            {
                "raw_content": "These are people selling their house after decades of gains. Not lifetime renters who never escaped poverty. It’s a big difference.",
                "author": "bombard63"
            },
            {
                "raw_content": "If I had a house that's paid off and that I could sell for some 300-500+% profit like many boomers, I would feel a lot more comfortable with not owning a property, too.",
                "author": "sicbo86"
            },
            {
                "raw_content": "My dad is 75 and owns his house. Taxes have been frozen for 10 years. Rents a room upstairs to a family friend. Doesn’t do any maintenance if he can avoid it. There is nowhere and nothing he could rent that could beat that.",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans earning under $50K are skipping meals, selling belongings and delaying medical care to cover housing costs",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "American Homeowners Thinking Twice About Moving to California, Florida",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok, California and Florida aren't comparable in disaster risk. Florida is, well, Florida. It's been a real estate investment meme for a century. They have hurricanes, actively antihuman governance, Disney, an impending geriatric apocalypse, Cuban mafia, dissolving condos and the list goes on and on. On the plus side they have Spring Break, but you can visit for that and go home for antibiotics. California wildfires can be mitigated. You can make your house fire resistant with a number of clever tricks like not growing vast amounts of kindling under the eaves like you're trying to burn it down. Earthquake is harder but it can be done. But this is if you're already there. The problem with migration to California is the dump truck full of money you need to settle there. You have one of those or you don't. Despite millions fleeing California for opportunity (Don't come here! We're full!), and a low birth rate, the population is growing because apparently the world has a shit ton of people who do have a dump truck full of money to get well started there and it's the iPhone of addresses. You have to buy one to prove you can buy one.",
                "author": "aquarain"
            },
            {
                "raw_content": "Every state that is an extremist political crapshow is a terrible state to live. One party rule only benefits extremists.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "California and Florida are the only states with natural disasters? News to me.",
                "author": "Calm_Madness7799"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Weekly mortgage refinancing demand shoots 23% higher, with riskier loans making a comeback",
        "score": 81,
        "text_content": "https://www.cnbc.com/2025/08/13/weekly-mortgage-refinancing-shoots-23percent-higher.html Homeowners are clearly looking for savings, even if it means taking on a riskier mortgage. Refinance demand, along with renewed demand for adjustable-rate loans, drove a sharp increase in overall applications last week. Total mortgage application volume rose 10.9% from the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $806,500 or less, decreased to 6.67% from 6.77%, with points increasing to 0.64 from 0.59, including the origination fee, for loans with a 20% down payment. That rate is 13 basis points higher than it was the same week one year ago. The average contract interest rate for 5/1 ARMs (adjustable-rate mortgages) decreased to 5.80% from 6.06%. ARM loans are generally fixed for a term but then adjust to market rates, making them riskier products. Applications to refinance a home loan jumped 23% for the week and were 8% higher than the same week one year ago. That was the strongest week for refinancing since last April. The refinance share of mortgage activity increased to 46.5% of total applications from 41.5% the previous week. “As seen in other recent refinance bursts, the average loan size grew significantly to $366,400. Borrowers with larger loan sizes continue to be more sensitive to rate movements,” said Joel Kan, an MBA economist in a release. “Given the relative attractiveness of ARM rates compared to fixed rate loans, ARM applications increased 25 percent to their highest level since 2022, and the ARM share of all applications was almost 10 percent.”",
        "comments": [
            {
                "raw_content": "Banks sure do love giving out risky loans! They will do damn near anything to increase the amount of interest-bearing assets on their accounting ledger.",
                "author": "wes7946"
            },
            {
                "raw_content": "I got my bank reaching out on that. Ran the numbers, didn't see any actual gain once the closing costs were accounted for. Maybe once rates drop a full percent things will be worth reconsidering.",
                "author": "AwardImmediate720"
            },
            {
                "raw_content": "As predicted. The moment lower borrowing rates come in, in come the borrowers. For anything. Don’t even have to be meaningfully lower. We’ve now had a summer where rates trended down compared to Q1. Activity has been low by historical standards, but brisk considering the economic uncertainty so many have. Apparently, that uncertainty isn’t universally felt.",
                "author": "Prestigious-Ice-2742"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Prospective home buyers, what are your reasons to buy now?",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "this is sort of an interesting thread. we know FOMO is still out there although it’s died-off substantially. but even at the nadir of a crash, there is going to be FOMO. even in the GFC, it’s not like society was reduced to rubble. let’s see … what happened. unemployment ticked up from 5 to 10% (at the worst) and credit was tightened. guess what, there were people wondering if they’d hit the bottom. they were looking for buying opportunities. anyway, this thread reflects the last traces of FOMO among homebuyers. are these people early? late? on-time? who knows. but they are in a significant minority and hence will serve as an interesting historical artifact.",
                "author": "acqua_di_hoomertears"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Las Vegas Becomes the Fastest-Cooling Housing Market in 2025",
        "score": 1,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 is nearly 3x faster than o3 at earning badges in Pokémon Red",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think this is another reminder that people need to re-assess how they evaluate models. It seems like a lot of the focus right now is on improving capabilities around long-horizon agentic tasks. People seem to have their brains broken a little bit when they don't see the typical progress on previously cherished benchmarks.",
                "author": "cobalt1137"
            },
            {
                "raw_content": "I have followed the stream a lot so here are some things I have noticed \\-Very good at long button sequences through menus, the map, battles, or combinations of the three at a single time. \\-Does not suffer major, prolonged hallucinations often. Usually \"snaps out of it\" upon a few failures. \\-Decent strategy with intelligent insights that even sometimes surprise me. Still goofs up sometimes. \\-Bonus: I find its jokes genuinely funny and clever. Here's the stream if you want to tune in: [https://www.twitch.tv/gpt\\_plays\\_pokemon](https://www.twitch.tv/gpt_plays_pokemon)",
                "author": "ezjakes"
            },
            {
                "raw_content": "[GPT\\_Plays\\_Pokemon - Twitch](https://www.twitch.tv/gpt_plays_pokemon)",
                "author": "Outside-Iron-8242"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We've done a full circle",
        "score": 1184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "now featuring: -gpt-5 nano -gpt-5 nano thinking -gpt-5 mini -gpt-5 mini thinking -gpt-5 minimal -gpt-5 low -gpt-5 medium -gpt-5 high -gpt-5 pro there are 8 more GPT 5s than there are GPT 4s or GPT 3.5s",
                "author": "New_Equinox"
            },
            {
                "raw_content": "https://preview.redd.it/v2wr9g9citif1.png?width=1280&format=png&auto=webp&s=ba00ba74b0ee59c1045f697462277a9c3919081a",
                "author": "SpotterX"
            },
            {
                "raw_content": "real. Their product offerings is such a clusterfuck, even for people that use it regularly.",
                "author": "Hyperious3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's GPT-5 is a cost cutting exercise",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "guys, they gave us magic intelligence in the sky FOR FUCKING FREE now they're trying to not burn money while doing it, it's understandable",
                "author": "seero22"
            },
            {
                "raw_content": "It’s well known how large ChatGPT’s userbase is—hundreds of millions of users. Are we supposed to expect OpenAI to not try making this easier to handle? If they cut costs, great; that’s more AI for us.",
                "author": "xRolocker"
            },
            {
                "raw_content": "No shit Sherlock",
                "author": "Singularity-42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Al-generated \"news\" and \"true crime\" videos are flooding YouTube",
        "score": 58,
        "text_content": "Every day there are more YouTube channels pumping out Al-written \"news\" and \"true crime\" stories about events that never happened. These aren't clickbait creepypasta or obvious fiction. They are produced like legitimate local news reports. Their about me pages are unclear and their comments sections are curated. For example, the channel: Nest Stories If enough people absoro a fake case or news like it's real, it becomes part of their working memory and shapes how they make decisions, communicate, teach, assess danger, or even vote on policy. This is bad. And they aren't doing anything about it. In fact they are happy to monetize it? The solution is simple, not an ai content policy, a fiction policy. You are required to disclose fiction and this label appears clearly on fictional content. This could be literally be implemented within 24 hours. Allowing this type of content is bad for everyone. There are no winners in the long run.",
        "comments": [
            {
                "raw_content": "There's this phenomena here, too. But mostly through controversial topics involving real life figures, sometimes touching onto sensitive topics like politics. They pick a event that occurred in real life and create a lore parallel to this event. For exemple, \"a TV show host accused of treating their employees poorly\". That's a fact, but then, they create an event, like I said, parallel to it. \"A TV show host accused of treating their employees poorly... *because he was under substances while working*\" If you're used to consuming content on the internet, you'd probably tell EASILY that's fake. However, the comments are FLOOOOOODED with older people believing the situation was real.",
                "author": "liquidflamingos"
            },
            {
                "raw_content": "I’m also seeing a lot of postings with this side by side photo format. Looks like some bots got some prompts for side by side photos accompanying dash headlines about connections (sometimes inaccurate) between the subjects of those photos and they’re showing up a lot.",
                "author": "Direct_Turn_1484"
            },
            {
                "raw_content": "There was an NPR story months ago-- radio, wow!-- about some fool who generates these in his parents' house in Utah or Colorado or I forget. He had some schtick about how his AI-gen true crime stories are more wholesome than Netflix et al. True Crime because there are no real victims in his stories. They told him that he should probably stop and he said No I won't.",
                "author": "newtopost"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "That moment when your text just... comes to life.",
        "score": 60,
        "text_content": "Generated with AI. I tried a bunch of prompts to make this video.",
        "comments": [
            {
                "raw_content": "It’s hard to believe machines can come up with such beautiful and creative ideas just based on a few suggestive sentences, let alone execute them almost flawlessly.",
                "author": "FriendlyJewThrowaway"
            },
            {
                "raw_content": "would like to see the final prompt - i guess prompting is the real hard thing to use ai successfully",
                "author": "mehrschwein"
            },
            {
                "raw_content": "VEO 3?",
                "author": "maybeitsmenotabot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A Chinese company is in the late stage of developing a humanoid robot designed to carry an artificial amniotic fluid womb by 2026, aimed at parents who cannot carry a pregnancy or wish to closely monitor their baby's development throughout gestation.",
        "score": 526,
        "text_content": "On tiktok there's a lot of AI slop videos with huamboid robots having babies - now, it seems its turning real.",
        "comments": [
            {
                "raw_content": "\"The artificial womb technology is already in a mature stage, and now it needs to be implanted in the robot's abdomen so that a real person and the robot can interact to achieve pregnancy, allowing the fetus to grow inside.\" I don't see the point of integrating an artificial womb inside an humanoid robot run by AI. That sounds unnecessary and dangerous more than anything.",
                "author": "Oriuke"
            },
            {
                "raw_content": "This is just not true. They would need to create an artificial placenta and umbilical cord. It would need a colossal amount of R&D funding, something completely beyond a small start up.",
                "author": "ProtoplanetaryNebula"
            },
            {
                "raw_content": "I am all for artificial wombs, but why put it into a gynoid?",
                "author": "ReasonablyBadass"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini Advanced Memory Features Releasing Today",
        "score": 484,
        "text_content": "it seems to be just as good, or better, than chatgpt’s memory features!",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/rgh6rxygmtif1.jpeg?width=1170&format=pjpg&auto=webp&s=1c9f9e97ecf3d6e4a1a77625824f2dbf99345f87",
                "author": "locojaws"
            },
            {
                "raw_content": "Just saw someone complaining it didn't have memory, seems to be readying for the rollout of threemini?",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Not only memory, but temporary chats too. This is welcome!",
                "author": "Calaeno-16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"nano-banana\" new Image Model Examples",
        "score": 274,
        "text_content": "After some testing, nano-banana seems very good, see for yourself. Prompts: 1. A hyper-realistic macro photograph of a bumblebee, covered in pollen, landing on a single, dew-covered petal of a purple iris. The background is a soft, out-of-focus garden. 2. A photorealistic still life of a bowl of fresh, colorful fruit on a white marble countertop. The lighting is bright and clean, with subtle reflections and shadows on the surface. 3. A hyper-realistic sci-fi landscape of a vibrant alien planet with multiple moons in the sky. The ground is covered in bioluminescent flora, and a sleek, futuristic starship is landed in the foreground. 4. An extreme close-up of a human eye with a complex, iridescent iris, reflecting a cityscape at night. The skin around the eye is highly detailed. 5. A photograph of a bustling Tokyo street at night, with a high shutter speed capturing the motion of people and cars as streaks of light. Neon signs illuminate the scene with vibrant color. 6. A photorealistic still life of a steaming cup of coffee and a half-eaten croissant on a rustic wooden table. The steam rises gently from the cup, and the crumbs from the croissant are scattered on the table. 7. An aerial photograph of a huge, winding river delta, seen from high above. The intricate patterns of the sediment and water create a stunning natural abstract.",
        "comments": [
            {
                "raw_content": "It appears to be that Google is ramping up for a big release that includes the new memory features and new image generation.",
                "author": "locojaws"
            },
            {
                "raw_content": "i think images are already solved, would’ve never crossed my mind these are ai honestly",
                "author": "Sxwlyyyyy"
            },
            {
                "raw_content": "Hoping open source, expecting Google",
                "author": "ohHesRightAgain"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI co-founder departs the company",
        "score": 115,
        "text_content": "https://x.com/ibab/status/1955741698690322585 https://techcrunch.com/2025/08/13/co-founder-of-elon-musks-xai-departs-the-company/ > Babuschkin is leaving xAI to launch his own venture capital firm, Babuschkin Ventures, which he says will support AI safety research and back startups that “advance humanity and unlock the mysteries of our universe.” > Igor Babuschkin, a co-founder of Elon Musk’s xAI startup, announced his departure from the company on Wednesday in a post on X. Babuschkin led engineering teams at xAI and helped build the startup into one of Silicon Valley’s leading AI model developers just a few years after it was founded.",
        "comments": [
            {
                "raw_content": "Is this xAI's equivalent of Ilya leaving?",
                "author": "Cagnazzo82"
            },
            {
                "raw_content": "Probably saw my comments.",
                "author": "peter_wonders"
            },
            {
                "raw_content": "That's actually a huge loss for them. People assume xAI is all compute and 0 talent but their team was super cracked from the beginning. I wonder how much this will hurt future iterations of Grok.",
                "author": "BrightScreen1"
            }
        ],
        "subreddit": "singularity"
    }
]