[
    {
        "post_name": "A reminder.... British political officials sending staff to assist Kamala Harris in defeating President Trump.",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The US needs to enact the Granite act at a federal level to protect ourselves from overseas enemy censors https://x.com/basilthegreat/status/1996986525767131214",
                "author": "IlhansBrother"
            },
            {
                "raw_content": "Everyone of those staffers should be banned from ever coming back to the US. Brits are required to apply for an Electronic Travel Authorization and they are required to explain their purpose of travel. If their stated purpose is pleasure and they ended up campaigning for Heels Up, that's lying on a Visa Application and grounds for a ban. Now, how do you determine who these staffers from actual British tourists?",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Would Kamala need to register this as a donation?",
                "author": "Johnkimble111"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan has shown how Islam can be beaten so does western civilization have the balls to do the same? Islam is a worldwide idealogical pandemic",
        "score": 189,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turning Japanese, I really think so. Theme song for the New Crusades.",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "I bet there are no mosques in Japan. AMIRITE??? Every non-muslim country should allow as many mosques as Saudi Arabia allows churches --- ZERO.",
                "author": "GoldwaterVoter"
            },
            {
                "raw_content": "Religious make up in Japan is about half Buddists Rest is Shinto, not religious and about 2% Christian. Its cultually night and day. Islam wouldnt get a foothold if it tried.",
                "author": "KernalMustard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minnesota Pirates",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You gonna just let them take your shit, Pittsburgh?",
                "author": "MrMcGreenGenes"
            },
            {
                "raw_content": "Snow-gudishu",
                "author": "RoninIV"
            },
            {
                "raw_content": "Garrison: https://grrrgraphics.com/somali-pirates-in-minnesota/",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Goodnight Pedes.",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GN.",
                "author": "keeman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Riley Gaines : Effective January 1st in California, it's illegal to declaw a cat because it's inhumane and causes chronic pain. Yet a 13-yr-old girl can go to the doctor to surgically remove her healthy breasts.",
        "score": 1064,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tbf I agree with making declawing illegal, claws are what cats have for self defense.",
                "author": "AMulletManAppears"
            },
            {
                "raw_content": "Hitler also banned mistreatment of animals",
                "author": "Zskills"
            },
            {
                "raw_content": "cat lives matter",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why do insurance companies love Obamacare so much? (Anyone else get the feeling that most govt programs are 90% fraud?)",
        "score": 609,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one will ever be able to figure out why Republicans didn’t do a full repeal when we gave them multiple opportunities.",
                "author": "Siteless_Vagrant"
            },
            {
                "raw_content": "The main reason I pay such a high rate for insurance is because I genuinely enjoy the long conversations that it provides with my studied doctors and the insight they provide to my life.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "I constantly wonder how Humana can offer a patient its \"insurance\", and then refuse to pay ANYTHING for a medically indicated hospital admission. This has happened more than just once.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seth Rich has now missed 10 Christmases",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sad. On the plus side, there's no statute of limitations for murder. Though Hillary will be dead before she has to face any consequences, it seems. Other than eternal damnation, that is.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "He was a Jew. Look at the dreidels on his cardigan in the photo. He’s missed 10 years of a lot of things but Christmas ain’t one of them.",
                "author": "BigMikesMegaClit"
            },
            {
                "raw_content": "Kash, You’re a gay for not taking this on sooner.",
                "author": "GodIsPerfect"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUD Sec. Scott Turner confirmed Democrat officials gave taxpayer-backed MORTGAGES to ILLEGALS over Americans. He's now kicking them out of housing. \"We took away FHA-backed mortgages from illegal aliens. During the Biden admin, they turned a blind eye!\"",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats didn't turn a blind eye, it was deliberate that illegals received HUD housing and FHA mortgages. This is how the Democrats problem solved, they lied to the people. They used corrupt NGOs set up to make us believe these orgs were paying for housing and hotels. Congress under Biden approved the USAID/spending to the NGOs and States were in on it setting the illegals up in HUD housing while knowing it was illegal. Many renters were given notices by landlords to move out because they converted their properties to HUD so that they could raise the rent the government guaranteed to pay. Americans doing business with the illegals sold us out and became rich under the scam.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Robbing us blind and no one's going to prison for it.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Pam Bondi won't prosecute.",
                "author": "Chickensaurus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is why housing is no longer affordable on one income...",
        "score": 761,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Millions in fraudulent tax exemptions for non existent day care centers... sickening.",
                "author": "godgoldnguns"
            },
            {
                "raw_content": "USA today: \"Hey, it's not MY fault that you lost out because you didn't jump on the 'abuse the system' train! Work harder!\"",
                "author": "Pepbrandt"
            },
            {
                "raw_content": "I don’t know who need to hear this, But it’s not just “the Somalis.” It’s more or less all US state and federal government everywhere. The Somalis are just a scapegoat / excuse. Do you think there’s any US tax program to the tune of billions of dollars that’s Not getting robbed? Stop kidding yourself.",
                "author": "whataboob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just a reminder that Ghislaine Maxwell’s sister and Klaus Schwab’s daughter are still besties at WEF.",
        "score": 706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just a reminder that all the pedophile traitors still hold positions of power and have had no punishment",
                "author": "Doubleu1992"
            },
            {
                "raw_content": "Where are all the White christian males in the WEF? I mean ... diversity is our strength ... right? 🤔",
                "author": "drmrboy"
            },
            {
                "raw_content": "It’s a big club and I wish we’d burn it down",
                "author": "malooch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Sends ISIS Christmas Gifts",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this! I love that we have a president who isn't afraid to call out Islamic extremism.",
                "author": "That_Dan"
            },
            {
                "raw_content": "“They wouldn’t bomb us on Chri…” 💥 💥 💥 💥",
                "author": "YodaBannon"
            },
            {
                "raw_content": "Cool, now get them out of here, too.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The new, revamped USAID",
        "score": 458,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's always strange when programs get \"cut\" and my taxes never go down.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "The more things change, the more they stay the same.",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "New bounty idea: Make govt organizations open, and every dollar found by someone gets them a dollar off their taxes. And every dollar found that was corruptly stolen gets them a dollar from the offenders own pocket (after the offender pays back what they stole).",
                "author": "HKgoneWild"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘ICE Never Sleeps’: Stephen Miller Hails Holiday Deportations, Illegal Shot Trying to Run Over Agents",
        "score": 766,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care if it's shot or deported. They all must go.",
                "author": "Maganifice7"
            },
            {
                "raw_content": "was the illegal deported to the afterlife? edit: nope",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "****THIS TRAIN HAS NO BRAKES****",
                "author": "SaltyKrakenBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "UK: Welcome to Bradford, where a Christmas tree is now called \"Multi Cultural Tree\" with almost no decoration. \"The festive tree is a symbol of the way Bradford positively embrace diversity. The true power of an inclusive city\"",
        "score": 630,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That tree perfectly exemplifies DEI; It's way underqualified for the job but got promoted anyway, and it comes with a lot of signage to explain why you have to accept it, bigot.",
                "author": "mydogma8yourkarma"
            },
            {
                "raw_content": "They don't include Christian culture.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "Burn it down",
                "author": "SaltiTaralli"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas from the legacy media.",
        "score": 604,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't even see this if it wasn't posted here.",
                "author": "RentFree2020"
            },
            {
                "raw_content": "Legacy Media GROK Please Define \"Legacy Media\" Answer: ʝҽɯʂ Oh. Of course.",
                "author": "VIad_TheChad_lmpaIer"
            },
            {
                "raw_content": "Names of the Authors to all these headlines.... yeah we know",
                "author": "556x45mm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well, that escalated quickly 🤣😂",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From Meathead to Cheesecake. What a twist.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Why didn't the government do a better job at raising his kid? Need reform ASAP!",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "What is 5MIND? Is gif upload a new thing? I swear I haven't seen any until tonight.",
                "author": "Reclaimer69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🎄⭐️🐸🎁❄️🇺🇸",
        "score": 594,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What he’s always wanted 🐸🍻",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "Christmas Pepe is adorable!",
                "author": "PitfallHarry"
            },
            {
                "raw_content": "What a terrific gift that keeps on giving! 🎁",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas to all you beautifully based deplorables.",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Back at you, fren.",
                "author": "Tacitus1963"
            },
            {
                "raw_content": "Merry Christmas you glorious shitposting bastards!",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Merry Chrismas!",
                "author": "Patriot_Dave"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Children’s YouTuber Ms. Rachel joins Mamdani’s Inaugural Committee",
        "score": 509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My son used to watch her. My wife and I banned her from the house and our kids after Ms. Rachel decided to support LGBT crap through her character on social media and on her show. I might've given her a pass if she kept it to a personal personality, but she let her \"fame\" go to her head, and she drank the cool-aid, obviously. She does this because she has an autistic son. Of course, now the question is does she even know if she has a son or not?",
                "author": "ThunderSizzle"
            },
            {
                "raw_content": "She’s a 💯 groomer. Always has been. Probably an active pedophile, too.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Sorry to see this, our kids really enjoyed her work and it was a refreshing change from 'diverse' Sesame Street - we wondered how long it would go when we found out she was in NY though. Guess that's it!",
                "author": "splink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THERE NEEDS TO BE CONSEQUENCES FOR OUTRIGHT SEDITION/TREASON... DAMNIT !!!!",
        "score": 334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Fani Willis, some county DA, can press charges against Pres. Trump, what's stopping some other DA in some other Georgian county pressing charges against the Georgia State Election Board. @Any Georgian DA with higher political aspiration, think about it.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Notice that there are no politicians that were illegally elected resigning office because of the clear fraud….. proves how dishonest they are",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "The lack of accountability is intentional. 1. It creates hopelessness because evil is being rewarded and goodness is being punished. Hopelessness and despair are mechanisms for control. 2. It lets us know that they are in control, not us. Its part of a brainwashing program to make up hopeless and desperate for their help.",
                "author": "OlivaireBandaloo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI data centers may soon be powered by retired Navy nuclear reactors from aircraft carriers and submarines — firm asks U.S. DOE for a loan guarantee to start the project",
        "score": 242,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Top comment on /r/Navy >lol this must be some multidomain VC scam/foreign intelligence op to get access to classified material. Wouldn't even *vaguely* stick out with all the AI criminality.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": ">Cover the costs of a risky loan and take on the decommission costs if we walk away and we'll give you a share of the revenue if this works. Golly, that's so magnanimous of them.",
                "author": "abbzug"
            },
            {
                "raw_content": "When Wall Street talked about the AI bubble popping, I envisioned it differently to be honest, but that will be a pretty rad pop to witness.",
                "author": "GalvenMin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Europe's relentless semiconductor decline",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Europe is generally good at research and development. Lots of progress is made here, but the monetization happens mostly abroad, because the environment is hostile to founders.",
                "author": "EitherGiraffe"
            },
            {
                "raw_content": "Yeah we dont produce anything but at least we've got the best regulations. EU in a nutshell.",
                "author": "reddit_user42252"
            },
            {
                "raw_content": "I can tell you about one part of this. Salaries have gone up pretty substantially for good talent in the last 10 years. But high salaries and rigid labor laws are a bad combo, nobody wants to be stuck with expensive dead weight",
                "author": "haloimplant"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Russian enthusiasts planning do-it-yourself DDR5 memory amidst the worldwide shortage — building your own RAM is as 'easy' as sourcing your own memory modules and soldering them on empty PCBs",
        "score": 325,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh, yea... because the issue here is the supply of PCBs. LOL.",
                "author": "R-ten-K"
            },
            {
                "raw_content": "but why? getting the actual memory modules is the expensive part.",
                "author": "someone8192"
            },
            {
                "raw_content": "oh cool so we only need to supply the most expensive part that isn't available. brilliant",
                "author": "mspurr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2800 to Feature Samsung’s First Fully Custom GPU in 2027",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird writeup. They pretend as if \"just using AMDs architecture\" but designing the Xclips 960 GPU entirely independently is a real thing. Its not \"just\" the architecture, the architecture is a real significant piece of work. Then they say producing a custom chip will lead to better efficiency, well for that you \"just\" need to design a more efficient GPU than AMD, which probably isn't terribly hard for a large company as AMDs RDNA is more desktop/laptop focused so I think it is very achievable, but is a big challenge either way. Also it is claimed to lead to cost reduction. While I don't know how much Samsung pays for AMDs GPU, I don't think its terribly much because they could use ARM or maybe even Imagination/PowerVR options. Also AMDs development cost amortizes in desktop and client sales already. So its not super obvious that whatever the cost of developing the GPU will be is much lower than AMDs fees. This is just hype, we can just wait and see, while I don't think its particularly hard to beat AMD in phones from the perspective of large cooperations, it will still be quite the journey. But maybe Samsung thinks they can expand to Windows on ARM laptops or maybe datacenter accelerators and want their own IP for that, so they estimate the potential of this reward higher, but with those alternative platforms come also lots of driver and compatibility challenges...",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Framework: Memory and storage pricing updates [€90 for 8GB]",
        "score": 180,
        "text_content": "- €90 per 8GB DDR5 when bought separately - €58.75 per 8GB LPDDR5X when soldered Updated on December 24th, 2025 With costs from our suppliers continuing to increase, we’ve had to make a further price adjustment on DDR5 memory modules. During this period of extreme memory shortages and price volatility, our priority is to make sure you can still buy a computer when you need one. With that in mind, we’re setting our memory configuration prices as close as possible to the actual purchase prices we have with our suppliers and distributors. Since we’re constantly sourcing additional memory and each purchase comes in at different (and often higher) pricing, we’re using the Weighted Average Cost (WAC) of inventory, which currently comes to $10/GB for 8GB, 16GB, and 32GB modules, and slightly higher for 48GB modules. This new memory pricing is still below most of what we see available in the retail market (and far below the $25/GB that Apple currently charges). However, if you are able to find a deal on lower priced modules, we encourage you to bring your own memory when purchasing a Framework Laptop DIY Edition. To make that even clearer, we’re updating our configurators soon to add a link to PCPartPicker directly in the Memory section, letting you quickly check if you can find modules at lower prices anywhere else. We recommend also checking the Framework Knowledge Base for which modules we’ve done compatibility testing on. All indications we’ve received from suppliers is that prices will continue to increase going into early 2026. We have absorbed and continue to absorb some of the price increases to be able to offer this new pricing, but it is very likely we’ll need to adjust module prices again within the next month. As we shared before, we will continue to keep you updated throughout with transparency on price changes. We’ll only increase prices to cover increases in costs, and we’ll bring prices back down as costs come down in the future.",
        "comments": [
            {
                "raw_content": "I just pray I don't need a new PC in the next 2 years.",
                "author": "windozeFanboi"
            },
            {
                "raw_content": "I just noticed the other day that the used 24gb DDR5 SODIMMS I had saved on ebay went from $60 to $280. Thankfully I can live with 16gb in my Framework 16 but pricing is absolutely insane",
                "author": "kjm99"
            },
            {
                "raw_content": "When I upgraded my home server back in december 2023 I paid $260 for 32GBx8 of DDR4 3200 RDIMMS, looking at it now it's about $260 per stick of the same spec RAM. Who the fuck is even paying that for such old RAM? It's not like companies are going back to DDR4 for anything and buying it used on eBay? Right? I can't imagine a homelabber needing it bad enough to pay that much either.",
                "author": "ClickClick_Boom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "No Graphics API — Sebastian Aaltonen",
        "score": 271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From what I have gathered from the past, this guy is very much in the know about graphics, but maybe he knows *too much* to the point that mere mortals can’t follow his ideals for various reasons.",
                "author": "team56th"
            },
            {
                "raw_content": "**TL;DR:** [Sebastian Aaltonen](https://www.sebastianaaltonen.com/about) argues converging GPU architectures finally enables us to get rid of two decades of graphics API bloat, something that wasn't possible back in the early days of DX12 and Vulkan. The proposed prototype API, while very limited in functionality, is as flexible as *\"...fully extended summer 2025 Vulkan 1.4...\"* Note that while this *\"...can do all the same things in practice, but is significantly more complex to use and has more API overhead.\"* The API is also just 150 lines of code, while the standard Vulkan header is around \\~20,000 lines. All this makes it *\"...possible to build an API that is simpler to use than DirectX 11 and Metal 1.0, yet it offers better performance and flexibility than DirectX 12 and Vulkan.\"* Caution I have no professional but reading post gave away these key characteristics of the proposed No Graphics API: * Unified memory * 64-bit GPU pointers everywhere * Shaders = C++ like kernels * Bindless everything * Raster/RT as libraries and intrinsics * No descriptors * No PSOs, permutations and pipeline caching * No resource types * No barriers * No stateful driver * No heap enumeration * No memory type guessing * No legacy shader languages It'll be interesting to see if this materializes into anything concrete Vulkan 2.0 and DX13-esque in the 10th gen console era and what the real world implications would be. . **Reading guide:** This post is very long (\\~124K characters with code) so I've sorted the sections here for your convenience: *Recommended reading:* * Introduction * Low-level graphics APIs change the industry * Modern APIs? * Conclusion *Optional:* * The history of GPUs and APIs * Min spec hardware *In-depth (very technical):* * All other sections",
                "author": "MrMPFR"
            },
            {
                "raw_content": "He seems to be pushing for an even lower level api for computer graphics. One that almost completely moves away from graphics’ primitives and resembles a compute only api (like openCL or CUDA): shaders are just code (doesn’t matter what type of shaders they are), and data are just buffers (textures, geometry, who cares). And the CPU seems to be a first class citizen when dealing with compute, data movement and synchronization. I can see this simplifying drivers even further but not developer effort. Or maybe it does simply by removing functionality and abstractions that he deems antiquated. I haven’t written a shader or a compute kernel in years, but I really liked his code samples and programming paradigm. Again, they were very reminiscent of cuda which I much preferred over HLSL/GLSL (real time graphics developers might disagree)",
                "author": "Rocketman7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Insights] Memory Spot Price Update: Kingston Leads DRAM Surge as DDR4, DDR5 and Modules Hold Strong",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Almost 21 USD for 1GB DDR4 chip? That's insane. To produce 16GB Dual Rank DDR4 module you would have to buy memory chips for 332 USD 🤯",
                "author": "taking_bullet"
            },
            {
                "raw_content": "Even ddr3 went up a little",
                "author": "EasyRhino75"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Geekerwan: \"骁龙8Gen5性能够格吗？一加 Ace 6T真机评测 [Is the Snapdragon 8 Gen 5 powerful enough? A hands-on review of the OnePlus Ace 6T.]\"",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[full resolution die shots from Kurnal on Bilibili](https://www.bilibili.com/opus/1150278991644459013)",
                "author": "antifocus"
            },
            {
                "raw_content": "this and the 15r are the same phones with different names right?",
                "author": "MysteriousBeef6395"
            },
            {
                "raw_content": "English subtitles are still available if the English dub caught you off guard.",
                "author": "FragmentedChicken"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Wife and daughter got me a new bedspread for Christmas",
        "score": 1172,
        "text_content": "I work a lot of screwy shifts so I spent a lot of time sleeping odd hours in my office. I told my wife I needed a new sheet and comforter set and to surprise me. This is what I opened this morning. If you look in the top right corner of the pic, you’ll see my 8bitdo controller I use for my NS2 so this picture counts. Also, ignore the hole in the wall and sub flooring, the whole house is being remodeled a piece at a time after being purchased as abandoned and falling apart.",
        "comments": [
            {
                "raw_content": "Richie Rich over here able to afford a separate bed for him and his wife",
                "author": "Asusrty"
            },
            {
                "raw_content": "We fuckin on da mario bed tonight",
                "author": "HootyBootyBeans"
            },
            {
                "raw_content": "What did they get for your wife's boyfriend?",
                "author": "foxtosser"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo discusses its approach to Metroid Prime 4, talks why it isn't open-world",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So basically they believed the game being open world was incompatible with the Fans expectations of what a Metroid game is, but mid way after the first restart they changed their minds, but it was already too late.",
                "author": "anon1mo56"
            },
            {
                "raw_content": "I seriously think the open area could've worked, it just needed a lot more to do throughout the game and not just at the end. More shrines (probably 20) with more opening up after you get an ability, some proper challenges with your motorcycle that gets you motorcycle upgrades through a light skill tree (I'm thinking like the medals system in Sonic Frontiers. Some motorcycle obstacle courses, races, etc.), maybe another boss in there.",
                "author": "micbro12"
            },
            {
                "raw_content": "I just don’t get why everything needs to become open world. Most open worlds are so empty and just a bunch of running around the same batch of tree and mountainscapes you seen 20min ago but slightly different. A lot of these games that weren’t open world, did perfectly without needing all the useless open world parts of the game. Guess I’m just old and don’t find running around for 70% of a game “fun”.",
                "author": "Brief-Valuable-6790"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My kiddo cried happy tears opening up his Switch2",
        "score": 514,
        "text_content": "Made his christmas so much he cried happy tears !",
        "comments": [
            {
                "raw_content": "Awwww... Gratitude is timeless.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "That’s what it’s all about. Awesome, hope he enjoys, have a great Christmas to the both of you!",
                "author": "XXXPsychoAnalyticXXX"
            },
            {
                "raw_content": "*Core memory unlocked* Your son will remember this forever. When he plays a Nintendo years from now, he’ll think of you and this moment.",
                "author": "Mintarion"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm so blessed to have parents like mine",
        "score": 905,
        "text_content": "Merry Switchmas!!",
        "comments": [
            {
                "raw_content": "Make sure you let them know! Congrats!",
                "author": "BigTWilsonD"
            },
            {
                "raw_content": "With the sour skittles too! Now that’s a good Christmas morning!",
                "author": "TerminatorJ"
            },
            {
                "raw_content": "What a wholesome post, they sure feel lucky for having you and you know it. Make it worth for them and congrats!",
                "author": "Danniboyee6985"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Amazing Christmas",
        "score": 758,
        "text_content": "MY Wife Loves Me! I Had an amazing Christmas!!!",
        "comments": [
            {
                "raw_content": "lucky you! merry christmas dude! 🎄🎁",
                "author": "marcobiotic"
            },
            {
                "raw_content": "Hell yeah dude, merry Christmas!",
                "author": "PapaPatchesxd"
            },
            {
                "raw_content": "https://preview.redd.it/chq3dj819e9g1.jpeg?width=1290&format=pjpg&auto=webp&s=2f027d390c51f161e6fae51015ef73507fd91104 Caught both your posts lol",
                "author": "Rare_Ad_3871"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Happy one year anniversary since this incident happened!",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have fond memories of the event, I remember everyone was saying that the picture was fake only because the watch is outside the sweater 😭😭😭",
                "author": "Nice_Tradition1333"
            },
            {
                "raw_content": "I remember people speculating the arm and slab were real, but that the background was made by ai or something lol. Also the wrist watch over the sleeve 🤣",
                "author": "Ok_Season_3917"
            },
            {
                "raw_content": "I'm still interested in how much this person actually knew. One of the things they said was \"one of the boxes has a game with 9 in the name\" which now we know is not true and MK9 turned into MKW",
                "author": "ginencoke"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "i got a nintendo switch 2 for christmas 🎄❤️ any game recommendations or beginner tips? thanks!",
        "score": 273,
        "text_content": "i am so happy 🥰",
        "comments": [
            {
                "raw_content": "Screen protector that thing asap. Even if play docked mode a lot can easily scratch it placing into cradle.",
                "author": "Mogman282"
            },
            {
                "raw_content": "I haven't gotten a chance to play mine yet as the kids have been playing it. We have Mario Kart, Hades 2, Metroid Prime 4, Pokémon Legends ZA, Silksong, and Story of Seasons, plus a plethora of Switch 1 games.",
                "author": "CapnBlargles"
            },
            {
                "raw_content": "Breath of the Wild is worth it. The switch 2 version is amazing. Nintendo switch online is also worth it for the online library of games from GameCube, n64, game boy advance, game boy, super Nintendo, and Nintendo consoles. I try to prioritize the physical edition of a game so I can maximize the internal storage for other games. Get the app deku deals for announcements on price drops of games you are interested in. I was able to jump on the Cyberpunk price error because of that. If you can afford it, the pro controller 2 is out of this world",
                "author": "mksm0k3"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "ASUS rumored to enter the DRAM market next year to tackle memory shortages.",
        "score": 952,
        "text_content": "https://xcancel.com/wccftech/status/2004221782132510982?s=46",
        "comments": [
            {
                "raw_content": "...do they have their own fabs?",
                "author": "MXC_Vic_Romano"
            },
            {
                "raw_content": "I can't imagine the amount of Led Asus will put on their ram. It will need a separate psu connection",
                "author": "AcolyteOfFresh"
            },
            {
                "raw_content": "But how they will fabricate it ?",
                "author": "CartographerOk4564"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 200K Plus series reportedly aiming at \"more for the same price\" approach",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "will I still need to do 'extreme home overclocking' just to compete with raptor lake in gaming or are these finally fast OOB",
                "author": "Zeraora807"
            },
            {
                "raw_content": "Of course they have to reduce prices. Core 300 (Panther Lake) has been mass produced on the cutting edge 18A node for a few months now and is also being officially announced Jan05.",
                "author": "Busy-Explanation4339"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Chinese company launches new Intel Z790 DDR4 motherboard, priced around $111",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can they produce ram too?",
                "author": "hithisisjukes"
            },
            {
                "raw_content": "The DDR4 comeback is real.",
                "author": "KasanesTetos"
            },
            {
                "raw_content": "Patiently wait for DDR3 version.",
                "author": "skylinestar1986"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD demos Strix Halo running 8 AI models to argue over “Is a hot dog a sandwich?”",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is stupid. It's a taco.",
                "author": "Nirast25"
            },
            {
                "raw_content": "Another videocardZ article about a reddit post https://old.reddit.com/r/LocalLLaMA/comments/1pdh0sm/8_local_llms_on_a_single_strix_halo_debating/",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "> but none of them can stop gamers from asking, “Wasn’t Strix Halo supposed to be a gaming APU”? It most likely never was intended to primarily be a \"gaming APU\" considering the costs involved. You don't need 128GB RAM and two CCDs on a large socket for that.",
                "author": "dsoshahine"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ten US housing markets are crashing like the Great Recession - most are in Florida and Texas",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Retraction/correction.",
                "author": "MarkyTooSparky"
            },
            {
                "raw_content": "Waco in particular is ridiculous for what you get. I like it, but it's crazy that jobs don't pay as well as DFW but the costs are similar.",
                "author": "dirtydeedsyeah"
            },
            {
                "raw_content": "I live in Texas and my house is paid off. I'm not moving anywhere and don't mind a drop. It makes my tax bill lower and helps some other folks get a home. Win-Win in my book.",
                "author": "LBC1109"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US states building the most housing",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everything being built in my area is \"luxury\" and starts at 400k. Average household income is around 80k here too",
                "author": "pqitpa"
            },
            {
                "raw_content": "If this isn't per-capita then it's a useless map",
                "author": "PaulOshanter"
            },
            {
                "raw_content": "This is just a map of places that have empty land and jobs If there’s no empty land, no building. If there’s no jobs, no building",
                "author": "Cautious_Midnight_67"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "By Yann Lecun : New Vision Language JEPA with better performance than Multimodal LLMS !!!",
        "score": 326,
        "text_content": "From the linkedin post : Introducing VL-JEPA: with better performance and higher efficiency than large multimodal LLMs. (Finally an alternative to generative models!) • VL-JEPA is the first non-generative model that can perform general-domain vision-language tasks in real-time, built on a joint embedding predictive architecture. • We demonstrate in controlled experiments that VL-JEPA, trained with latent space embedding prediction, outperforms VLMs that rely on data space token prediction. • We show that VL-JEPA delivers significant efficiency gains over VLMs for online video streaming applications, thanks to its non-autoregressive design and native support for selective decoding. • We highlight that our VL-JEPA model, with an unified model architecture, can effectively handle a wide range of classification, retrieval, and VQA tasks at the same time. Thank you Yann Lecun !!!",
        "comments": [
            {
                "raw_content": "Did Yann LeCun cook???🧑‍🍳",
                "author": "deeplevitation"
            },
            {
                "raw_content": "This is weeks old by now. Also, we should link to the paper instead of LinkedIn. https://arxiv.org/abs/2512.10942",
                "author": "Neat_Raspberry8751"
            },
            {
                "raw_content": "Big if true. I’m all for competition and new paradigms.",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alzheimer's disease can be reversed in animal models to achieve full neurological recovery",
        "score": 369,
        "text_content": "If I'm reading it right, **this is huge**. [https://medicalxpress.com/news/2025-12-alzheimer-disease-reversed-animal-full.html](https://medicalxpress.com/news/2025-12-alzheimer-disease-reversed-animal-full.html) [https://www.cell.com/cell-reports-medicine/fulltext/S2666-3791(25)00608-1](https://www.cell.com/cell-reports-medicine/fulltext/S2666-3791(25)00608-1) Alzheimer’s disease (AD) is traditionally considered irreversible. **Here, however, we provide proof of principle for therapeutic reversibility of advanced AD.** In advanced disease amyloid-driven 5xFAD mice, treatment with P7C3-A20, which restores nicotinamide adenine dinucleotide (NAD^(+)) homeostasis, reverses tau phosphorylation, blood-brain barrier deterioration, oxidative stress, DNA damage, and neuroinflammation and enhances hippocampal neurogenesis and synaptic plasticity, resulting in full cognitive recovery and reduction of plasma levels of the clinical AD biomarker p-tau217. P7C3-A20 also reverses advanced disease in tau-driven PS19 mice and protects human brain microvascular endothelial cells from oxidative stress. In humans and mice, pathology severity correlates with disruption of brain NAD^(+) homeostasis, and the brains of nondemented people with Alzheimer’s neuropathology exhibit gene expression patterns suggestive of preserved NAD^(+) homeostasis. Forty-six proteins aberrantly expressed in advanced 5xFAD mouse brain and normalized by P7C3-A20 show similar alterations in human AD brain, revealing targets with potential for optimizing translation to patient care.",
        "comments": [
            {
                "raw_content": "It really is a great result because, even though it was often assumed that in theory AD was reversible, having concrete evidence of it being reversible in animal models will give a huge confidence boost for further research and funding for similar studies in humans.",
                "author": "Completely-Real-1"
            },
            {
                "raw_content": "Would be massive if we could actually cure alzheimers somehow",
                "author": "jamesknightorion"
            },
            {
                "raw_content": "Cautiously optimistic. It’s common that treatments for highly specific genetically engineered mice never work on humans. Also it was only published in Cell Reports. Decent journal but definitely not Nature or Science level.",
                "author": "rkartzinel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OAI lost ~20% for the year. This is healthy for the AI ecosystem. We all win.",
        "score": 465,
        "text_content": "Today (December 5): ChatGPT: 68.0% Gemini: 18.2% DeepSeek: 3.9% Grok: 2.9% Perplexity: 2.1% Claude: 2.0% Copilot: 1.2%",
        "comments": [
            {
                "raw_content": "I'm really surprised that Claude is only at 2%. It's such a good model.",
                "author": "spinozasrobot"
            },
            {
                "raw_content": "My fear is that Gemini could become too strong",
                "author": "Bitter-College8786"
            },
            {
                "raw_content": "Relatively. Absolute numbers are shooting up",
                "author": "meister2983"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Liquid AI released an experimental checkpoint of LFM2-2.6B using pure RL, making it the strongest 3B on the market",
        "score": 20,
        "text_content": "\"Meet the strongest 3B model on the market. LFM2-2.6B-Exp is an experimental checkpoint built on LFM2-2.6B using pure reinforcement learning. > Consistent improvements in instruction following, knowledge, and math benchmarks > Outperforms other 3B models in these domains > Its IFBench score surpasses DeepSeek R1-0528, a model 263x larger\"",
        "comments": [
            {
                "raw_content": "Qwen 3- 4B thinking 2507 is way better than this.",
                "author": "Fantastic-Emu-3819"
            },
            {
                "raw_content": "Higher quality image: https://preview.redd.it/gs7c97yy5i9g1.png?width=1896&format=png&auto=webp&s=f8b3aed60899e60e7eb6e3f53cd7bb7b83919c34",
                "author": "KaroYadgar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Peter Gostev (LM Arena) shares 26 probability-weighted predictions for AI in 2026",
        "score": 15,
        "text_content": "AI capability analyst **Peter Gostev** (LM Arena) just now published a set of **26 predictions for 2026**, each framed as plausible rather than certain (roughly 5–60% confidence). The list spans models, agents, infrastructure and AI economics, focusing on capability trends rather than hype. **China:** 1. A Chinese open model **leads** Web Dev Arena for 1+ months. 2. Chinese labs open source **less** than 50% of their top models. 3. Chinese labs take #1 spots in **both** image and video generation for at least 3 months. **Media & Multimodality:** 4. No diffusion-only image models in the top 5 by mid-2026 5. Text, video, audio, music, and speech merge into a single model 6. Rapid growth in “edgy” applications like companions and erotica 7. First mainstream AI-generated short film gains major recognition **Agents:** 8. Computer-use agents break through and go mainstream 9. A model productively works for over 48 hours on a real task 10. New product surfaces emerge to support long-running agents **Research & Capabilities:** 11. First 1-GW-scale models reach 50%+ on hardest benchmarks (FrontierMath L4, ARC-AGI-3) 12. One fundamental issue gets solved (e.g. long-context reliability, hallucinations down 90%, or 10× data efficiency) 13. RL scaling in LLMs saturates, followed by a new scaling law 14. No major breakthroughs in small phone models, interpretability, diffusion-for-coding, or transformer alternatives **Products & Markets:** 15. A new AI voice product hits 50M+ weekly active users 16. A solo founder reaches $50M ARR 17. SSI releases a product 18. Unexpected moves from Meta or Apple 19. OpenAI earns over 50% of revenue from ads, forcing a strategy shift 20. At least one prominent AI figure claims AGI has been reached **Deals & Industry Shifts:** 21. AI labs spend $10B+ acquiring strong non-AI companies 22. A major lab spin-out (20+ people, $5B+ raise) occurs 23. Another “DeepSeek moment” briefly knocks NVIDIA stock down 10%+ **Infrastructure Constraints:** 24. NVIDIA makes a major move into energy 25. A public fight over data-center expansion causes real delays 26. AI supply chains visibly strain, slowing deployment timelines These are not forecasts of inevitability, but **bounded bets** on where acceleration, constraints and economic pressure may surface next. **Source: Peter Gostev (LM Arena)** 🔗: https://x.com/i/status/2004454044417343935",
        "comments": [
            {
                "raw_content": "That starts sounding like a horoscope further down. „Someone close to you will do something unexpected“",
                "author": "Background-Quote3581"
            },
            {
                "raw_content": "48 hours ?; Got OT ?",
                "author": "ninhaomah"
            },
            {
                "raw_content": "It honestly feels like reading these from a movie plot lol",
                "author": "caversham27"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AGI arrives in the physical world",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One down, 7999999999 to go.",
                "author": "amarao_san"
            },
            {
                "raw_content": "Man. Gonna be weird seeing video after video after video of robot demos and then one in real life…..",
                "author": "VashonVashon"
            },
            {
                "raw_content": "When you accidentaly hit your younger sibling and have to pretend that you also got really hurt from it.",
                "author": "Scorpius202"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google gonna start 2026 with this: Nano Banana 2 Flash model spotted on Flowith",
        "score": 200,
        "text_content": "Looks like a **new** model integration is coming to Flowith. Spotted **Nano Banana Pro (Flash)** with a **Soon** tag in the model selection menu.",
        "comments": [
            {
                "raw_content": "Nano Banana Pro Pro",
                "author": "LightVelox"
            },
            {
                "raw_content": "yesterday i used nano banana pro to restore/translate an Silver Age Superman comic, it worked so well, the tiring part was to send each page a time, cant wait to send the whole comic and the model spits out back to me with restored pages/translated to my language",
                "author": "Different-Incident64"
            },
            {
                "raw_content": "Google is running into big capacity limits (due to hitting it big with NanoBanana) and it’s gonna mean they have to become more efficient. The nice thing about AI models is they self-improve in efficiency far better than in scores. Easier to get 90% of the product with 50% of the cost than to gain 110% of the product with a 110% the cost. Funny enough it could be due in part to same mechanics we see in overclocking and underclocking GPUs, but with less scaling due to HBM hard limits. Whomever owns the HBM, wins the scaling war.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Your Predictions for the year of 2026?",
        "score": 131,
        "text_content": "title.",
        "comments": [
            {
                "raw_content": "1. We'll see the first big result in math research that is primarily facilitated by AI, with some guidance from humans. Might not necessarily be a millennium prize problem, but something that makes experts go \"damn, that's big\". 2. OpenAI, Anthropic, and Google will release the first version of their 24/7 work agents. They can autonomously work on a problem productively for more than a day and cost many thousands of dollars per month to license. They are B2B products with limited access. 3. OpenAI and Google will release what feels like \"Her\": A personal AI assistant that you can control via voice mode. It can shoot off multiple agents simultaneously and you can view progress in a Codex-like interface. 4. Low-confidence prediction: Andrew Yang announces his run for 2028, almost entirely on the topic of AI and how to deal with the looming singularity.",
                "author": "fmai"
            },
            {
                "raw_content": "Agents. I want scary long term capable agents, damn!",
                "author": "poigre"
            },
            {
                "raw_content": "ARC-AGI 2 saturates",
                "author": "InterestingPedal3502"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What if AI wipes out entire university-based careers in 5 years—How are people supposed to repay student loans with jobs that no longer exist?",
        "score": 375,
        "text_content": "Something I've been thinking about a lot",
        "comments": [
            {
                "raw_content": "Also is there gonna be housing collapse?? Whose can afford to pay 30 year mortgage? If home owners can't pay back the mortgages what will happen to banks?",
                "author": "dviraz"
            },
            {
                "raw_content": "Welcome to techno feudalism, friend.",
                "author": "Peak0il"
            },
            {
                "raw_content": "They just don’t pay it. What do you mean? If they don’t have money to pay, they not gonna pay.",
                "author": "felya"
            }
        ],
        "subreddit": "singularity"
    }
]