[
    {
        "post_name": "Fast forward the narrative a little bit and...",
        "score": 835,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Plot twist humans are the aliens.",
                "author": "MAGA_mantis"
            },
            {
                "raw_content": "It’s all God’s and, in his love, he gave us stewardship. It’s the same with all the gifts given to you, so, steward them wisely.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Leftists: \"Immigrants stole land from Native Americans!\" Americans: \"Following your logic, the Native Americans stole land from previous civilizations and also from each other.\" Leftists: \"Well that wasn't really stealing and I'll explain why in this big wall of text...\"",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"5.2-6 million Indians live in the United States, roughly 55% are foreign-born. There are now more Indians in America than the population of 27-30 US states. Remittances to India topped $38 billion in 2024.\"",
        "score": 802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tax the shit out of any money leaving the US. I don't care what country is involved",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "Their cultural moral of \"izzat\" makes them 100% devoted to collectivism, socialism, and the advancement of only Indians by any means necessary. They do not have the morals of Americans or Christians. Stop thinking of them different from the muslims because they are the same, just less violent (well when they are not in their collectives or groups).",
                "author": "invalid_data"
            },
            {
                "raw_content": "Yeet the jeet.",
                "author": "monksbane1848"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I want to shrink the size of gov’t",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump massively expanded the federal government during Covid and I'm tired of pretending it didn't happen.",
                "author": "AVeryNakedMan"
            },
            {
                "raw_content": "AWFLs will be the downfall of America.",
                "author": "MikesDong"
            },
            {
                "raw_content": "Someone will wipe that stupid grin off his face one of these days, and I hope it's soon.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Students tried to do anti-ICE walkout but were threatened with suspension so they were forced to return to class THIS IS THE WAY Kudos to this school!",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stupid kids. Go back to Mexico. They're probably illegal anyway.",
                "author": "Stormeyworld13"
            },
            {
                "raw_content": "They should try this with criminals next. Amazing how people behave when rules are actually enforced!",
                "author": "duckduck"
            },
            {
                "raw_content": "Schools and classrooms run better without them. ESL and discipline is a massive drain of time and money. Just expel them entirely and let the real students learn.",
                "author": "GoSpeedRacistGo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump orders UAP and UFO declassification. Move comes after Obama’s alien remarks.",
        "score": 1010,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aliens are fake, but demons aren't and when they make themselves know en masse, they will do so by calling themselves aliens.",
                "author": "America1stAndOnly"
            },
            {
                "raw_content": "Can we relocate all the libtards to Area 51 where they belong?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Anything but the Epstein files, huh!",
                "author": "tribunabessica"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Blocks Virginia Dems’ ‘Unconstitutional’ Power Grab — For Now",
        "score": 862,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember getting booed loudly when I predicted most of the Red States would wuss out on redistricting. It wasn't that tough to predict if you aren't a brainwashed RINO voter.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "The travesty is that any Democrat loss is never forever. They always find a way to reverse it eventually",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Why did SCOTUS unanimously hand over California to the democrats then?",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes we are. God bless you, ladies.",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless these women and God bless the USA 🇺🇸",
                "author": "Wehavelawsforareason"
            },
            {
                "raw_content": "I didn't watch the game as I was working. But I did see the clip of the game winning goal. I can't lie, it was an amazing pass/assist, and an amazing move on the part of Megan Keller to get around the defender and put the puck in the net. https://m.youtube.com/shorts/CTdDwLr8Agw",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "God's blessings are real.",
                "author": "HelluvaEngineer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "9th Circuit Court just SLAPPED DOWN Gavin Newsom's draconian California law that banned federal immigration agents from wearing a mask to cover their identities",
        "score": 1352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck Gavin Newscum and fuck the bitch that brought him in the world‼️",
                "author": "LokiHelmsdeep"
            },
            {
                "raw_content": "I'm sure the 9th tried hard to find a way to justify it, but it was just too far out there.",
                "author": "FartherRight"
            },
            {
                "raw_content": "the fact that his sole motive for this law is to get federal agents and their families slaughtered makes him a fuckin evil demon",
                "author": "Gunmolester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: We are going to have the Save America Act, one way or the other, after approval by Congress through the very proper use of the Filibuster or, at minimum, by a Talking Filibuster, à la “Mr. Smith Goes to Washington.”",
        "score": 1073,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remove travel. People can plan around the day to vote, and if they can't, they don't need to vote because obviously it's not important to them.",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Has anyone told Thune?",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "Just get it passed",
                "author": "TheSonOfGadsden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alien Disclosure: Some are not happy to lose their privacy",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To distract us from WW3 which is about to start between lsraeI and lran.",
                "author": "Oliphaunt"
            },
            {
                "raw_content": "It’s been said a million times now but being abducted by aliens at this point would truly be a rescue mission. Please come get me.",
                "author": "Ugh3rdaccount"
            },
            {
                "raw_content": "Lolz",
                "author": "MAGA_mantis"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Neil disGrace Tyson Compares Trans Sports Inclusion to Segregation. Like how you, Neil, segregated groomer Sagan from Uranus?",
        "score": 684,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Steal da bike tyson.",
                "author": "jhewish"
            },
            {
                "raw_content": "If fake and gay was a person.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "Why the random hate on Sagan?",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS IS ABSOLUTELY TERRIFYING 2.30am and a woman in the UK saw a migrant STARING AT HER THROUGH HER DOOR She called the Police and they took him to hospital then released him She asked what she should do if he comes again, Police said \"Call us\" 🤷",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The police are on the side of the murdering and raping invaders.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "This 5 second clip was scarier than any horror movie I’ve seen in the last decade",
                "author": "ObackBarama"
            },
            {
                "raw_content": "she needs whatever the gun equivalent of nevermind, she is fucked lol.",
                "author": "nolefthandshakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Boasberg Rubber-Stamps DOJ Request To Keep FBI-Twitter Payments Secret",
        "score": 875,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ruled by fucking bergensteins.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Thank you Pam Bondi and Kash Patel for suing to keep even more records secret from the US Taxpayer. This administration is just WINNING!",
                "author": "Losferwords"
            },
            {
                "raw_content": "Why is DOJ making the request?",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is why Zohran Mamdani needs to raise property taxes on New York City residents Here’s what’s included in his new $127 billion dollar spending proposal - $5.6 million for Office of Racial Equity - $4.6 million for Commission on Racial Equity",
        "score": 796,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why Zohran Mamdani needs to raise property taxes on New York City residents Here’s what’s included in his new $127 billion dollar spending proposal - $5.6 million for Office of Racial Equity - $4.6 million for Commission on Racial Equity - $835,000 for Commission on Gender Equity - $260,000 for Department of Education Chief Diversity Officer - $301,000 for 3 FDNY Civilian Chief Diversity Inclusion Officers - $118,000 for FDNY Chief Diversity Inclusion Officer This is “The Warmth of collectivism”",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "We're so whipped and this crap has become so normalized that we can't even reallyl see how insane this stuff is. Image having right wing versions of these DIE Officers... YOU CAN'T! I sure can't... what the hell would a Chief Patriotism and Christianity Officer do all day long?",
                "author": "DrVSGGEOTUSPhD"
            },
            {
                "raw_content": "This isn't even 1%. What is NYC really wasting the money on? Most everything sucks in the city, so where is all the money going?",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Truck driver who ran a red light and kiIIed an elderly man in Indiana has been identified as Singh Sukhdeep, an illegal alien from India",
        "score": 1529,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suck deep? What a faggot",
                "author": "ThePatriotGames2016"
            },
            {
                "raw_content": "It's so much worse than you all know. All these illegal and imported workers have driven down wages for truck drivers to the point it's barely a worthwhile career at all. These fucks don't care because they live in squalor like roaches, all crammed together in empty homes with mattresses on the floors and send all their earnings back to the shithole they came from, but for actual Americans trying to live at first world standards, it's not realistic anymore without working your ass to death.",
                "author": "Valensiakol"
            },
            {
                "raw_content": "Get them off our roads, out of our Costcos and back into their own shithole of a country. And seize all their assets here before they go, proceeds of a crime and all. The houses will probably have to be demolished to get rid of the smell, likely not worth it to gut it and renovate.",
                "author": "SWRAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The owner of family-owned IM Garage Door Service in Orange County, CA openly laughed and admitted charging customers extra to fix their garage door because they support Trump.",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Paging Libsoftictok, lets make these faggots famous..",
                "author": "TrumpPatriot83"
            },
            {
                "raw_content": "5 stars, 278 reviews [You know what to do](https://www.google.com/maps/place/IM+Garage+Door+Service/@33.6537409,-117.7477158,238m/data=!3m2!1e3!5s0x80dc68357fdd680f:0xdd2763ab1ce0c8ca!4m8!3m7!1s0x4cf003488923180d:0xe7d40ca1cb66f15d!8m2!3d33.6540147!4d-117.7471841!9m1!1b1!16s%2Fg%2F11v_0w6yxy?entry=ttu&g_ep=EgoyMDI2MDIxNy4wIKXMDSoASAFQAw%3D%3D)",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "The market will decide if paying this guy is worth it",
                "author": "Bendadick_Arnold"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In Canada a hair salon was fined $500 for not having “non binary” on their booking site. It caused the person who made the complaint spiral deeper into a metal health crisis who then became unable work for a year.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "these are the people that are reporting you on Discord, banning you on IRC, etc... you dont hate them enough increase bullying so the problem takes care of itself",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "Unable to work for a year, which meant sitting on their ass living off socialist gibs that everyone else has to pay for. All over a business not catering to their delusion.",
                "author": "rebuildingMyself"
            },
            {
                "raw_content": "What a loser.",
                "author": "theneverman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fraud Dogs!",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a hard call, but I'd still choose a voting dog over a Muslim.",
                "author": "_Liberty_Prime_"
            },
            {
                "raw_content": "Based",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "Branco: https://comicallyincorrect.com/branco-cartoon-fraud-dogs/",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mohammed Amini",
        "score": 1056,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're not coming for jobs and the American way of life.",
                "author": "TDAF"
            },
            {
                "raw_content": "Patterns are being noticed.",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "What's the issue. Mohammad just living his best life in the footsteps of his false prophet.",
                "author": "MostEffectualTopKek"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Burn!",
        "score": 1414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They said nice things about Biden when he did that too. He might be on to something.",
                "author": "PhantomShield72"
            },
            {
                "raw_content": "She's a horse face with tits and the brain of a Brontosaurus.",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "*IT'S CONGRESSMA'AM, BIGOT!!!*",
                "author": "Ritchie_Blackadder"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "GeForce RTX 5090 user caps power at 500W, still sees burned 12V-2x6 adapter",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They ought to just switch to NACS. That ought to handle it",
                "author": "RedditNotFreeSpeech"
            },
            {
                "raw_content": "How is this news when even 9070XT’s at 320W have connectors that are melting?",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Can we not just go back to 8pins already.",
                "author": "bdoll1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Display Launches ‘QD-OLED Penta Tandem™’, a New Premium Technology Brand",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I understand the primary reason for more layers is better brightness but could they cycle the layers to reduce burn in?",
                "author": "Frothar"
            },
            {
                "raw_content": "Man Oled technology has really sped up these last couple of years.",
                "author": "EmptyVolition242"
            },
            {
                "raw_content": "For the record it's just a new marketing term for an existing technology that came out last year with the 27\" 4K panels. It's nothing new.",
                "author": "DabuXian"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PCB FORGE by castpixel - 'Turn any PCB layout into a 3D-printable mold. No etching, no chemicals. '",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool in concept but there's a reason why PCB generally uses FR-4 vs the most commonly used PLA for 3D printing. And it doesn't solve the issue of drilling holes for TH components or via. Copper tape might come off after a while too.",
                "author": "scv_good_to_go"
            },
            {
                "raw_content": "Demo video on Blue Sky? Seriously?",
                "author": "GeniusEE"
            },
            {
                "raw_content": "Sounds like something they'd do in a blockaded country like Cuba. Fun concept but ultimately a waste of time in high income countries.",
                "author": "zghr"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD GPU Prices Rebound Slightly As Demand Drops",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a fan of the use of the word \"rebound\" - it implies the prices are going back up after a decline.",
                "author": "phigo50"
            },
            {
                "raw_content": "We did it, reddit, we bullied people into believing that amd software stack is so bad their cards aren't worth it even when same tier nvidia ones are $300 more expensive!",
                "author": "pythonic_dude"
            },
            {
                "raw_content": "not many will buy GPUs when they cant get RAM to build their damn PC lol.",
                "author": "Quatro_Leches"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pokemon FireRed/LeafGreen coming to Switch on Feb 27th ($19.99 each). Listed on Switch eShop in coming soon section",
        "score": 392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For the people who hate NSO and wish it was just Virtual Console releases, here you go I guess.",
                "author": "Zane-chan19"
            },
            {
                "raw_content": "It's in the EU eShop now as well - 19.99 EUR, Feb 27th. https://preview.redd.it/g0pml549ilkg1.png?width=1711&format=png&auto=webp&s=7dd3f62b4938d398990e726622897eb49c29498d There are separate versions for each language: English, Spanish, French, German, Italian.",
                "author": "mrmivo"
            },
            {
                "raw_content": "If it supports Pokemon Home and has the full trading abilities with other players I am 100% down to buy this",
                "author": "MobilePenguins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tune in to Pokémon Presents at 6:00 a.m. PST on February 27, and join us in celebrating 30 years of Pokémon!",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am shocked. Who could've predicted a 14:00 presents on February 27th for the 6th? year in a row? Not me, that's for sure.",
                "author": "Busy_Medium4418"
            },
            {
                "raw_content": "Gen 10 this year?",
                "author": "Caciulacdlac"
            },
            {
                "raw_content": "After the FRLG announcement, I've kind of lost hope for any other GameBoy Pokemon releases. I hope they surprise me anyway.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I thought it was fake, but na it's actually on the eshop",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The price in USD is 19.99 The price in CAD is 29.99 Sorry for the confusion",
                "author": "No_Entertainment_516"
            },
            {
                "raw_content": "For anyone that would like to know, its 19,99usd.",
                "author": "Ok-Ability5362"
            },
            {
                "raw_content": "I still didn’t believe but just checked wtf",
                "author": "MrWerewolf0705"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fire red & Leaf Green £16.99 each is so good",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I kinda hoped they do a dual pack, where you can play both versions on one switch with 2 controllers and trade support.",
                "author": "ThatCurryGuy"
            },
            {
                "raw_content": "Do they not know you can put multiple languages on the same copy of a game",
                "author": "MrWerewolf0705"
            },
            {
                "raw_content": "If you don’t like the price, vote with your wallet",
                "author": "ollielite"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Xenoblade Chronicles X: Definitive Edition — Nintendo Switch 2 Edition — Announcement Trailer",
        "score": 1857,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope 1-3 get upgrades, want to try and get into the series",
                "author": "QuadirDrinkwater12"
            },
            {
                "raw_content": "Finally! I’ve been holding off on starting this game in anticipation for the switch 2 version.",
                "author": "IdleBonobo"
            },
            {
                "raw_content": "Pls do the same to 1-3 😭",
                "author": "Due-Judge3095"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon FireRed Version and Pokémon LeafGreen Version on Nintendo Switch",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly the part I'm confused by is... why not announce this on Pokemon Day, ya know the big event you are already planning? You'll mention it there for sure but REVEAL it there for maximum impact.",
                "author": "Zane-chan19"
            },
            {
                "raw_content": "I know a lot of people will hate on this but FireRed was my OG so I’m pretty stoked. Now if they can announce an Emerald re-release as well I can revisit my OG **and** my favourite. A boy can hope.",
                "author": "Fr1tzOS"
            },
            {
                "raw_content": "Why not drop this on NSO, what's the point of having NSO if you're just going to sell the games (not just these but others). The service is alright, but I've had it since day one and the trickle affect of games we get are average, and then you sell the good ones.",
                "author": "Present-Position-409"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A special physical bundle for Pokémon FireRed & LeafGreen on Nintendo Switch will be available in Japan at the Pokémon Center Online.",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s equivalent to $130 usd by the way",
                "author": "Tommy_Gun10"
            },
            {
                "raw_content": "I just want one copy of Fire Red with steel book don't need both",
                "author": "Siedlec"
            },
            {
                "raw_content": "Is it an actual physical copy or just a code like the GB games on 3DS?",
                "author": "Danintendood"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Xenoblade Chronicles X Definitive Edition - Nintendo Switch 2 Edition full game charting at #23, the upgrade pack at #5 within hours of release",
        "score": 162,
        "text_content": "",
        "comments": [
            {
                "raw_content": "been thinking about trying the series out. would this be a good place to start?",
                "author": "erigum"
            },
            {
                "raw_content": "This is under represented too. It’s currently on sale at GameStop and Amazon and probably selling a ton through there",
                "author": "Dog_Bear"
            },
            {
                "raw_content": "I hope this upgrade pack increases the sales for this game. We need the Xenoblade series to become more mainstream.",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Did this sub suddenly turn red for yall as well? It's hurting my eyes 😭",
        "score": 313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can turn off community themes in your settings",
                "author": "little_painted_dudes"
            },
            {
                "raw_content": "Wait till you see the puke green on the zelda sub",
                "author": "owlitup"
            },
            {
                "raw_content": "The blood moon rises",
                "author": "zacyzacy"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier posts that Bluepoint is being shutdown",
        "score": 2857,
        "text_content": "[ https://bsky.app/profile/jasonschreier.bsky.social/post/3mfaauf5pek2b ](https://bsky.app/profile/jasonschreier.bsky.social/post/3mfaauf5pek2b) EDIT The full article: [https://www.bloomberg.com/news/articles/2026-02-19/sony-is-shutting-down-the-playstation-studio-bluepoint?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc3MTUyNzAyNiwiZXhwIjoxNzcyMTMxODI2LCJhcnRpY2xlSWQiOiJUQVBZWlBLR0lGUFkwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.utABYnI4m\\_K6kqNqybZarBQ9T5WW\\_aWCH6NI3kt8Q64](https://www.bloomberg.com/news/articles/2026-02-19/sony-is-shutting-down-the-playstation-studio-bluepoint?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc3MTUyNzAyNiwiZXhwIjoxNzcyMTMxODI2LCJhcnRpY2xlSWQiOiJUQVBZWlBLR0lGUFkwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.utABYnI4m_K6kqNqybZarBQ9T5WW_aWCH6NI3kt8Q64)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "What the fuck",
                "author": "MolotovMan1263"
            },
            {
                "raw_content": "But... why?",
                "author": "Mindless_Stuff9179"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon FireRed/LeafGreen coming to Switch on Feb 27th ($19.99 each). Listed on Switch eShop in coming soon section",
        "score": 268,
        "text_content": "Pokemon FireRed/LeafGreen coming to Switch on Feb 27th ($19.99 each). Listed on Switch eShop in coming soon section https://xcancel.com/i/status/2024732629321601441 per the eShop listing - \"Because this version replicates the way the game was originally released, each language version is separate and there are no in-game options to change the language\" https://xcancel.com/i/status/2024736174456394193",
        "comments": [
            {
                "raw_content": "All hail the all powerful leaker. The Nintendo EShop.",
                "author": "DarkDon1"
            },
            {
                "raw_content": "Oops. Guess this is how Ruby, Sapphire, and Emerald get rereleased.",
                "author": "TheDragonDAFan"
            },
            {
                "raw_content": "I already played Let’s Go and not that into playing Gen 1 again. But good for those who want it. I remain waiting for Gen 2, preferably Crystal, port or remake.",
                "author": "fearrange"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo has filed a trademark application for the word and logo “Nintendo GAME BOY” in Brazil",
        "score": 261,
        "text_content": "Necrolipe reports nintendo is filling a trademark for Game boy in brazil: [https://xcancel.com/necrolipe/status/2024616398224273538#m](https://xcancel.com/necrolipe/status/2024616398224273538#m)",
        "comments": [
            {
                "raw_content": "New console called game boy I think",
                "author": "hansalvato"
            },
            {
                "raw_content": "Confirmed they are remastering sweet life of zack & cody DS game",
                "author": "Ember57"
            },
            {
                "raw_content": "Bring back the \"Classic\" line, Nintendo. Gameboy Classic.",
                "author": "skyline7284"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Pokemon LeafGreen and FireRed for Nintendo Switch Officially announced by Nintendo",
        "score": 27,
        "text_content": "Pokémon FireRed Version and Pokémon LeafGreen Version - Pokémon FireRed Version and Pokémon LeafGreen Version on Nintendo Switch \\#NintendoToday [https://nintendo.today/s/alPrCPir](https://nintendo.today/s/alPrCPir) Previous post: https://www.reddit.com/r/GamingLeaksAndRumours/s/4ahTlog7kq",
        "comments": [
            {
                "raw_content": "$20 GBA roms?",
                "author": "GoodSelective"
            },
            {
                "raw_content": "What tier is Nintendo Today?",
                "author": "newier"
            },
            {
                "raw_content": "The OST just dropped on Nintendo Music as well.",
                "author": "Torracattos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xenoblade composers; Manami Kiyota and Yasunori Mitsuda are working on a new unspecified project",
        "score": 155,
        "text_content": "[Source](https://xcancel.com/PROCYONSTUDIO/status/2024371038352719981) This could mean anything like a new Xenoblade game, new IP, or even something else different.",
        "comments": [
            {
                "raw_content": "Two people do their job. More news at 11.",
                "author": "TimAndHisDeadCat"
            },
            {
                "raw_content": "It's a call of duty project, but I can't prove.",
                "author": "Good_Performance_134"
            },
            {
                "raw_content": "it's not uncommon for people to work together on some new project after meeting on another, but also it's highly likely Monolith is working on something Xeno-related considering its popularity. Really this post means absolutely nothing imo",
                "author": "BadTakesJake"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xenoblade Chronicles X Definitive Edition gets a Switch 2 Edition, features a 60FPS mode (out today digitally)",
        "score": 431,
        "text_content": "Article: https://www.videogameschronicle.com/news/nintendo-surprises-fans-with-a-switch-2-edition-of-xenoblade-chronicles-x-out-today/ Previous rumor: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1jfp5f5/xenoblade_chronicles_x_definitive_edition/",
        "comments": [
            {
                "raw_content": "Alright people, no more “I’m waiting for a Switch 2 version!” talk Play Xenoblade X now",
                "author": "LukePS7013"
            },
            {
                "raw_content": "Now do it with Xenoblade 1 please, I have the game on stand-by waiting for the upgrade.",
                "author": "MiteshuRonin"
            },
            {
                "raw_content": "Yay! Now the trilogy and we golden.",
                "author": "Far_Metal4256"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hot Topic Shirt Leak showcases 3 returning characters in Scott Pilgrim EX",
        "score": 67,
        "text_content": "https://xcancel.com/marcothecoolest/status/2024275562521395547?s=46 Apparently it’s since been taken down from their website, but the fact that >!Gideon!< is shown alongside Scott & Ramona, whilst being in his normal attire, it definitely adds to the theory that he’s the main villain again. It could also possibly suggest he’s the 7th playable character, as we know the game has 7 playable characters but we’ve only gotten 6 revealed (Scott, Ramona, Lucas, Roxie, Matthew, & Robot-01), and Geoff Keighley confirmed in the game’s reveal trailer that the remaining 5 playable characters were, *“former rivals.”* We also get our first look at the >!Katayanagi Twins!<, who are rumored to be bosses, possibly as Cowboy and Phantom of the Opera -themed variants? We can also see on the right a new Todd Ingram variant that’s a dinosaur",
        "comments": [
            {
                "raw_content": "What tier is Hot topic",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "no playable Kim? 1984 moment",
                "author": "robertman21"
            },
            {
                "raw_content": "The twins aren’t part of the “leak”, since they have been shown in trailers. And they’ll fuse into a boss",
                "author": "Placidao"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Re9 trophy list",
        "score": 262,
        "text_content": "https://insider-gaming.com/resident-evil-requiem-trophies-achievement-list/",
        "comments": [
            {
                "raw_content": "there’s a trophy for the good ending and not the bad one, which says a lot",
                "author": "maricondxnes"
            },
            {
                "raw_content": "Quite a few of these trophies sound pretty cool, the gameplay is definitely going to be fun. Wonder what the difference is between classic and modern standard difficulties? I can’t remember if i’ve seen them in the other recent games.",
                "author": "Themetalcollector"
            },
            {
                "raw_content": ">The Hero Returns If anyone's still in doubt on who's the franchise mascot and Capcom's favorite, here's your answer lmao",
                "author": "YukYukas"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Zen 6 \"Olympic Ridge\" Ryzen desktop CPUs may come in in 6, 8, 10, 12, 16, 20 and 24-core configs",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Now, if only RAM would become affordable by the time these release.",
                "author": "Wheekie"
            },
            {
                "raw_content": "I hope the rumors of more cores are true. It is damn time to move forward with more cores. This and a expanded cache would work wonders for performance.",
                "author": "bestanonever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Radeon RX 9000 prices fall up to 20% from January peak in Japan, as demand cools",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Price gouging not working anymore?",
                "author": "cc0537"
            },
            {
                "raw_content": "I remember prepordering my 9070xt from memory express, they wanted to price gouge me $1400 + taxs + extented warrantys. i refuse every time, they call me. Im still waiting til it hit 900Canadian dollars.",
                "author": "serkis10"
            },
            {
                "raw_content": "This should be a good thing for buyers, who always comes on here to complain that AMD should be blamed for when demand is higher.",
                "author": "Imaginary-Ad564"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 500 “Medusa” RDNA 4m iGPU shows RDNA 4 matrix ISA support, FSR 4 support looks likely",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I can see why AMD would do this, rather than use RDNA 4 for lower end mobile products. RDNA 4 is a big leap in terms of transistor count over RDNA 3; to compare two 32 CU GPUs the RX 9060 XT has 29 billion transistors vs the RX 7600's 13 billion. A lot of those extra transistors went to ray tracing hardware + a side of supporting higher clock speeds. Mobile iGPUs aren't going to be fast enough for heavy ray tracing games even if they included the RT hardware, and obviously clocks are limited on mobile platforms for power use reasons. On the flipside though, better hardware upscaling is appealing for low end GPUs. So adding just FP8 & a few other things to RDNA 3.5 was probably easier than trying to cut back RDNA4.",
                "author": "GenericUser1983"
            },
            {
                "raw_content": "I could have sworn we exorcised ISA from personal computers a couple decades ago. /s",
                "author": "MonMotha"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Pending U.S. Home Sales Fall 6% As Would-Be Buyers Sit Out Slow Winter Market",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've been saying it for months now. When sellers are setting their asking prices on those established during the sick 3% era, going from 6.5% to 6% is only going to make a difference at the margins. The prices are still way too high for current rates and current incomes.",
                "author": "LatiBerg"
            },
            {
                "raw_content": "Yeah Aaron it’s not the 6% rates it’s the 100% price increase in the span of a couple years",
                "author": "Yourprobablyaclown69"
            },
            {
                "raw_content": "I notice some luxury homes sitting on the market then being listed for rent or air BnB. They list for around $25k a month. Very few get rented to families, it’s usually gamers or influencers who live in the place like it’s a compound. Then when the $$$ runs out they either squat or destroy the place. *edited spelling",
                "author": "Limp-Text-5209"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed Reserve just pumped $18.5 Billion into the U.S. Banking System this week through overnight repos. This is the 4th largest liquidity injection since Covid and surpasses even the peak of the Dot Com Bubble",
        "score": 32,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NAR Pending Home Sales Report Shows 0.8% Decrease in January",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Month Over Month * 0.8% decrease in pending home sales * Gains in the Midwest and West; declines in the Northeast and South Year Over Year * 0.4% decrease in pending home sales * Gains in the South and West; declines in the Northeast and Midwest WASHINGTON (February 19, 2026) – Pending home sales in January decreased by 0.8% from the prior month and 0.4% year-over-year, according to the National Association of REALTORS® Pending Home Sales Report. The report provides the real estate ecosystem—including agents and homebuyers and sellers—with data on the level of home sales under contract. Month-over-month pending home sales rose in the Midwest and West, and declined in the Northeast and South. Year-over-year pending home sales rose in the South and West and declined in the Northeast and Midwest. “Improving affordability conditions have yet to induce more buying activity,” said NAR Chief Economist Dr. Lawrence Yun. “With mortgage rates nearing 6%, an additional 5.5 million households that could not qualify for a mortgage one year ago would qualify at today’s lower rates. Most newly qualifying households do not act immediately, but based on past experience, about 10% could enter the market—potentially adding roughly 550,000 new homebuyers this year compared with last year.” “Unless housing supply increases, these additional potential buyers becoming active in the market could simply push up home prices. This will put increasing pressure on affordability, which is why it is critical to increase supply by building more homes. Fortunately, the House of Representatives recently passed the Housing for the 21st Century Act with strong bipartisan support, an important signal that addressing the nation’s housing shortage remains a shared priority. The legislation is a meaningful step toward expanding housing supply and removing barriers that make it harder for Americans to achieve homeownership,” Yun added.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Pleasantly surprised that the decline wasn’t higher because we had really bad winter weather in the Midwest, Northeast and South. Buyers showing a lot of resilience, augurs well for home sales in the coming months.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Birmingham housing market: Sellers facing challenges and buyers finding opportunities",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Native of Birmingham, Alabama here. More realtor-speak attempting to stir the local market out of its frozen state. Prices. That is the issue. Interest rates dropping significantly would give that “sugar rush” so many are desperate for, but does not fix the underlying issue. Also, in the greater metro area, massive amounts of building, farther and farther away from work centers and office parks, has been ongoing. Inventory is not the issue. Much of this building is 20-30 miles (or more) out of city center. Major employer is University of Alabama Birmingham, a hospital and medical research school, and a large one. Major employers were formerly in steel manufacture, then banking and insurance, both prior to the GFC. The economy in Birmingham is powered by healthcare and construction, as so many metros in America are now.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "Well yeah. Now that ATL is starting to flatten out and even drop the main appeal of Birmingham - a cheaper nearby-ish alternative to ATL - is going bye-bye. Why live in BHam and drive to ATL instead of just living in ATL?",
                "author": "Less-Fondant-3054"
            },
            {
                "raw_content": "Opportunities to hold the bag!",
                "author": "Minimum-Reward3264"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Prices Start Year Up Just 1% as Buyer’s Market Keeps Growth in Check (Median Home Sales Price at $422,921)",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So, the ultra-rich have slowed down their purchases and now just the rich are buying homes. I should be next in line then.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "In this environment, home price averages mean very little, as the people with money can continue to bid things up, raising the medians, while the market otherwise is frozen.",
                "author": "LatiBerg"
            },
            {
                "raw_content": "Not a buyers market. Sellers unwilling to negotiate. It’s a dead market. Or frozen. Everyone in the business wants transactions at any price. They don’t care. They are starved for transactions. Now in year 3 of the deep freeze. You can tell I’m not AI by my shitty grammar, and use of cuss words.",
                "author": "Top-Acadia-1936"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Kasparov on computers surpassing humans 😂",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be fair, that was an understandable belief in 1989. The crazy thing is people who still think that in 2026....",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "People who say something will *never* happen are always proven wrong. (So far the only exception is when the thing is limited by the laws of physics.)",
                "author": "cpt_ugh"
            },
            {
                "raw_content": "It's funny that first half of his response got outdated quick, but even that second half is way off now. Kinda surreal.",
                "author": "ReMeDyIII"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google releases Gemini 3.1 Pro with Benchmarks",
        "score": 2186,
        "text_content": "[Full details](https://blog.google/innovation-and-ai/models-and-research/gemini-models/gemini-3-1-pro/?utm_source=x&utm_medium=social&utm_campaign=&utm_content=)",
        "comments": [
            {
                "raw_content": "**Pricing same as Gemini 3 Pro** [Model Card](https://deepmind.google/models/model-cards/gemini-3-1-pro/) https://preview.redd.it/xw0xmspw7hkg1.jpeg?width=1920&format=pjpg&auto=webp&s=3291ef4dae66ba6edd957457d0bfb4ac2d3eb968",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "![gif](giphy|bgBO1Yh3Z7Qq5rB4PC)",
                "author": "Icy_Foundation3534"
            },
            {
                "raw_content": "77% ARC-AGI 2 is actually crazy. Only a few months ago we was talking about how good 31% is",
                "author": "Particular-Habit9442"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's that time of the month again",
        "score": 1709,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn’t it crazy thought that we’ve gone from “that time of the year” to “that time of the month” 🤯",
                "author": "Chr1sUK"
            },
            {
                "raw_content": "https://preview.redd.it/6orrxsqvohkg1.png?width=1024&format=png&auto=webp&s=d2c91564ccb4a49428bc9dba19328c3bfbe9020a",
                "author": "dervu"
            },
            {
                "raw_content": "Crazy how this is \"time of the month\" Last year it was \"you are in this quarter\" The year before that nobody was even thinking about this.",
                "author": "Gubzs"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Taalas: LLMs baked into hardware. No HBM, weights and model architecture in silicon -> 16.000 tokens/second",
        "score": 370,
        "text_content": "Ever experienced 16K tokens per second? It's insanely instant. Try their Lllama 3.1 8B demo here: [chat jimmy](https://chatjimmy.ai/). THey have a very radical approach to solve the compute problem - albeit a risky one in a landscape where model architectures evolve in weeks instead of years: Etch the model and all the weights onto a single silicon chip. Normally that would take ages, but they seem to have found a way to go from model to ASIC in 60 days - which might make their approach appealing for domains where raw intelligence is not so much of importance, but latency is super important, like real-time speech models, real-time avatar generation, computer vision etc. Here are their claims: * **< 1 Millisecond Latency** * **> 17k Tokens per Second per User** * **20x Cheaper to Produce** * **10x More Power Efficient** * **60 Days from Unseen Software to Custom Silicon:** This part is crazy—it normally takes months... * **0% Exotic Hardware Required, thus cheap**: They ditch HBM, advanced packaging, 3D stacking, liquid cooling, high speed IO - because they put everything into one chip to achieve ultimate simplicity. * **LoRA Support:** Despite the model being \"baked\" in silicon, you can adapt it constrained to the arch and param count. Their demonstrator uses Lllama 3.1 8B, but supports LoRa fine-tuning. * **Just 24 Engineers and $30M**: That's what they spent on the first demonstrator. * **Bigger Reasoning Model Coming this Spring** * **Frontier LLM Coming this Winter** Now that's for their claims taken from their website: [The path to ubiquitous AI | Taalas](https://taalas.com/the-path-to-ubiquitous-ai/)",
        "comments": [
            {
                "raw_content": "Bro. You press 'Enter' and the output is there \\*immediately\\*. I mean, \\*immediately\\* immediately. That's insane. Imagine that you could do this with more advanced models. This is a really cool technology. Miniaturization of AI - I mean, that's an 8B model on a chip that looks about as big as an iPhone. EDIT: Can't stress enough how much I like this. Hard-coding model weights into the hardware serves to make these things so much smaller and so much faster. THIS is what I want to see on, say, future PC's and will massively change things. Imagine a much smarter model than Llama 8B running at 16k tokens per second. I don't reckon we'll get miniaturization very fast, but WOW.",
                "author": "twinb27"
            },
            {
                "raw_content": "Holy wabalooloo, if this is even vaugely true its mental",
                "author": "inteblio"
            },
            {
                "raw_content": "Gemma 3 27B with vision would be amazing on this kind of hardware, it could allow blind people to \"see\" via image to audio conversion.",
                "author": "semenonabagel"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Animated SVG Comparison between Gemini 3 and 3.1",
        "score": 1125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. These are awesome. This might be the beginning of everyone's UIs starting to diverge. And the end of Lucide, ShadCN, etc.",
                "author": "TeamBunty"
            },
            {
                "raw_content": "Having my comment separate cause last time I posted this it got banned - I think this is impressive in showing the actual capabilities improvement in many different ways, but also I think it crosses an important usability threshold. Suddenly custom animated SVGs, even dynamic ones created at runtime, are possible. Saw these both on twitter (was that the banned term?!)",
                "author": "TFenrir"
            },
            {
                "raw_content": "Prediction: We're going to see minimalism disappear as a trend and a sudden wave of maximalism.",
                "author": "Recoil42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google just dropped Gemini 3.1 Pro. Mindblowing model.",
        "score": 390,
        "text_content": "Frankly speaking, this model feels like it's out of this world and shouldn't exist. Beats Claude Sonnet 4.6 in every way possible. Been testing it extensively. It is the only model to perfectly ace my personal code benchmark so far. Does everything incredibly well, writes extremely clean React, Python, and Golang code. Does impeccable reasoning. The UI design and native SVG generation are next level. This is the model I've been waiting for. Just hoping Google doesn't nerf this like it does to almost every pro model after 2 weeks.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/tu77f6fclikg1.png?width=1069&format=png&auto=webp&s=4a48f2643da93643f3945e0b7236666eb5010a42 AGI reached",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "It produces some killer Minebench models, so it’s obviously better at spatial reasoning. But my question is: how much of that improvement is based on training data built from the influx of Minebench database submissions versus a more generalized improvement in spatial reasoning? How would you tell?",
                "author": "lobabobloblaw"
            },
            {
                "raw_content": "insert ‘you are here now’ meme",
                "author": "NoMarionberry7708"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Difference At A Glance!",
        "score": 463,
        "text_content": "Prompt: Create a svg in html of a red Ferrari supercar",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/9qljkhqlohkg1.png?width=2926&format=png&auto=webp&s=ca478fdbe00ce9f2daf98e8193bb82aeeb839868 The pelican has a basket now boys",
                "author": "sirjoaco"
            },
            {
                "raw_content": "The one on the right looks like 'the car built for Homer'",
                "author": "Even-Pomegranate8867"
            },
            {
                "raw_content": "I tried with this prompt \"Create a svg in html of Luffy from one piece\" and this is the result. It's not perfect, but well, it's close lol https://preview.redd.it/cam4zkhtohkg1.png?width=921&format=png&auto=webp&s=632be0972b1c4533eb8fc75e9631db59d6184601",
                "author": "junior600"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google Gets 19% Increase in Model Performance by Adjusting Less Parameters",
        "score": 277,
        "text_content": "This is actually revolutionary. Google got a 19% increase in model performance by changing how parameters update. Wtf...19% is worth billions of dollars. This might be one of the biggest discoveries in AI recently.🚀 Summary from Gemini: Historically, training LLMs relies on \"dense\" optimizers like Adam or RMSProp, which updates every single parameter at every training step. This paper proves that randomly skipping (masking) 50% of parameter updates actually results in a better, more stable model. It improves model performance by up to 19% over standard methods, cost zero extra compute or memory, and requires just a few lines of code to implement.",
        "comments": [
            {
                "raw_content": "Also, I think this is also why Gemini 3.1 has less hallucination. Training MoE models is difficult because it's hard to prevent hallucinations. So essentially, Magma is reducing hallucination, which is why performance gains are so big. Also the larger the parameters, the bigger the gains. So this is quite important as currently AI labs are scaling down parameters because AI models started to hallucinate. Now they can increase parameters back up to get real performance gains. This is a way bigger deal than I think anyone realizes.",
                "author": "Izento"
            },
            {
                "raw_content": "The authors of the paper made me realize that the \"AI race\" is basically between Chinese researchers in the US vs Chinese researchers in China.",
                "author": "Arcosim"
            },
            {
                "raw_content": "Props to Google for publishing this given how intense the AI race is. Anthropic will definitely hide stuff like this from the public.",
                "author": "DaDaeDee"
            }
        ],
        "subreddit": "singularity"
    }
]