[
    {
        "post_name": "95%-99%. That’s the percentage of Republican voters who want election integrity in all recent polling.",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Best I can do is ignore your wishes and vote to line my pockets.",
                "author": "conservatarian"
            },
            {
                "raw_content": "What percentage of Democrat voters? Because we need at least 15% of Democrat Senators to pass the SAVE Act.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "Well, we have two parties: democrat and democrat Lite. Not sure which is worse, TBH.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TOTAL DOMINANCE OF ACADEMIA, HOLLYWOOD, NEWS, & EDUCATION",
        "score": 388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is “LITERALLY ANYTHING THEY CAN’T DEFINE ANYTHING!!! WE WERE LOSING TO A BUNCH OF RETARDS. LET’S GO!!!!!!!!! WHAT’RE WE DOING?!??!? LET’S 12X THIS TRUMP TRAIN!!!!!!! YEEEEEEEEEEEEEEEAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAASSSSAAAAAAAAAAAAAAAAAAAAAAHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHHH!”",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Oh, I thought the punchline would be about jews...",
                "author": "Hugs"
            },
            {
                "raw_content": "I noticed on FACEBOOK every day in my feed I see 4-8 Local TV Stations and Newspapers (local to my whole state from Birmingham, Montgomery, Mobile and Huntsville) with feeds about the Minn. BS goings on, and how local residents \"feel\" Someone is paying those stations and news papers to run that BS propaganda. Its all about POLL NUMBERS with these liberal punks",
                "author": "BIGLYMAGARONDON"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“I will tell you something I haven’t said publicly that deserves to be said. We were seeing 10-12 Fentanyl overdoses per day…and now we see 1 or 2. Closing the borders has made America safer…”",
        "score": 389,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People who want fentanyl can become immigrants to China, Africa or central and South America along with the rest of people who hate America.",
                "author": "GreyKnight"
            },
            {
                "raw_content": "But… but… ICE shot some lawless dyke.",
                "author": "ViagraFalls"
            },
            {
                "raw_content": "Praise God!",
                "author": "deltaforcestrike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal grand jury has issued subpoenas to Tim Walz and Mayor Jacob Frey in investigation into ICE interference.",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was quick.",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "Really? A grand jury actually subpoenaed two Democrat? @Virginia's Grand Jury, you should be ashamed of yourself for not indicting Leticia James.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "They will ignore it and nothing will happen. Mark this post.",
                "author": "getup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr.'s U.S. Health and Human Services to launch investigative study on connections between 5G, mobile phones, neurological damage and cancer — Reuters",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I see no issues with looking in to it. Prove it real or give it a rest, but do so transparently.",
                "author": "Synonymity"
            },
            {
                "raw_content": "Better late than never?",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "I love this guy. Thank you so much God for putting these angels at the helm of our ship; for we are in troubled waters",
                "author": "grannylovestrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This should be aired on every news channel!",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fondling, rape,sodomy Tim Walz owns it",
                "author": "lovemylibs"
            },
            {
                "raw_content": "If the news covered those people 1/10th as much as they covered Renee Good then Renee Good would not be dead.",
                "author": "phro"
            },
            {
                "raw_content": "Democrats LOVE fucking children. Sick, evil fucks.",
                "author": "DJTXLV"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A federal investigation has been opened into Minneapolis Mayor Jacob Frey and Minnesota Gov. Tim Walz into whether they have been obstructing federal law enforcement activities in the state, according to multiple U.S. officials.",
        "score": 1292,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty obvious they have. What's it going to take to make some arrests?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Mayor Jacob Frey openly called for Minneapolis Police to 'fight ICE'. Frey is NOT a Professional anything...he's just a Punk that won a Popularity Contest... INSURRECTION ACT NOW",
                "author": "Moebius"
            },
            {
                "raw_content": "It's sad seeing all the comments sharing the same disheartened sentiment. I feel the same way, we see example after example of Democrats committing felonies, betraying their country, and stealing elections yet they NEVER get any punishment. It's beyond ridiculous, our country can't continue letting Democrats make a mockery of our laws.",
                "author": "A_Colostomy_Bag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk-funded mural of murdered Ukrainian refugee Iryna Zarutska goes up in Brooklyn — and local lefties are furious",
        "score": 1266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leftists mad at a mural for the victim of a senseless murder, yet they champion career criminals who get killed and deserve it. Idk why this case would seem political, aside from leftist politicians being behind the freedom granted tl the killer who was clearly going to do so.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "They are more upset about who is funding the mural rather than the fact an innocent women was brutally murdered? They sound like great people. 🙄",
                "author": "shadowbanana"
            },
            {
                "raw_content": "I thought they: * Believed all women * Were anti-violence * Supported Ukraine I guess they aren't about any of those things, ACTUALLY",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS Arrests Furry",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"They're arresting the dogs, they're arresting the cats!\"",
                "author": "MidnightDriver"
            },
            {
                "raw_content": "Collar it and drag it to the pound.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Fox Around Find Out",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal agents and officers respond to the leftist, open-borders riot attack on the Whipple Federal Building. One man who refuses to leave is pushed back. Others are arrested.",
        "score": 626,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At this point, break out the batons and begin smashing limbs and skulls. I'm done with this.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Operation Honeypot: setup some gating called level 1, let them break through, lure all of them into level 2, reinforce level 1 from behind, arrest everyone in the honeypot for (insert every J6 charge made here), lock them up for 4 years, deny bail, deny access to evidence, deny medical care, deny access to family, place in solidarity confinement, beat daily, repeat in next city.",
                "author": "1776take2"
            },
            {
                "raw_content": "what do they do in that building that angers the crazies? also those rape whistles are annoying",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump will issue a plan next week for letting Americans tap their 401(k) retirement accounts for a down payment on a home, a senior White House official said Friday — WSJ",
        "score": 956,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a disaster. Regardless of your position on this, it's absurd that home ownership is such an obstacle for middle America.",
                "author": "HoneyBadgerInc"
            },
            {
                "raw_content": "Embarrassing. All these self-destructive ploys to try to make it easier and not addressing the root cause. Sorry, but truth is that prices have to come down. That means pain. I say this as a home owner. And the pain would only be real for whoever bought between 2020 and now.",
                "author": "Couchbeer69"
            },
            {
                "raw_content": "Woopdie fucking do. You're going to let us access our own money. Stop fucking taxing us! Pay us back our stolen money!!",
                "author": "orange_kek_great"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Swalwell campaign in the hot seat after accepting almost $15K from CCP-tied law firm: 'Stop playing footsie'",
        "score": 785,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No. No he's not in the hot seat. Jesus fuck, make it stop.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Arrest him.",
                "author": "ShlomoJoe"
            },
            {
                "raw_content": "What happened to the other story where his wife says he's been cheating on her and embezzling millions of dollars from the government?",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TOM HOMAN on leftist agitators: \"We're going to make them FAMOUS! We're going to put their face on TV. We're going to let their employers, their neighborhoods, and their schools know who these people are.\" \"I bet you a lot of their employers don't know what they're doing!\"",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about just arrest and prosecute them?",
                "author": "PUNCHSPLOSION"
            },
            {
                "raw_content": "Is anyone buying these stupid threats anymore? Throw masses of them in prison forever like they did to J6 people.",
                "author": "Schroeder09"
            },
            {
                "raw_content": "Employers? People who have all night and day to harass government officials don't have real jobs.",
                "author": "Plots"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Minneapolis Mayor Jacob Frey responds to DOJ opening federal investigation over alleged obstruction of law enforcement.",
        "score": 843,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But he is precisely why the city is unsafe.",
                "author": "KennyKetchem"
            },
            {
                "raw_content": "Wake me up when he and the tampon guy are arrested. This is all just theatre until then.",
                "author": "JohnMiller2020"
            },
            {
                "raw_content": ">My focus remains where it’s always been: keeping our city safe. What crack is he smoking? It's his residents and the illegals who are violent.",
                "author": "thisisatestof2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blue Virginia Senate votes to PASS an amendment letting Democrats gerrymander the state up to 10 DEMOCRATS, 1 REPUBLICAN in Congress...when Indiana \"Republicans\" refused to redistrict. So Virginia is about to swing their Congressional map a net of +8 SEATS, +4 Democrats and -4 Republicans.",
        "score": 793,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Republican attitude of \"we won't do what can help us because the Dems told us that they won't either later\" is one of the most retarded take ever.",
                "author": "Monsieur_Novembre"
            },
            {
                "raw_content": "Florida should pass a 27 Republican, 1 Democrat map in response. +7 Republican -7 Democrat. [Florida Governor Ron DeSantis announced last week - \"I will be convening a Special Session of the Legislature focused on redistricting to ensure that Florida’s congressional maps accurately reflect the population of our state. Every Florida resident deserves to be represented fairly and constitutionally. This Special Session will take place after the regular legislative session, which will allow the Legislature to first focus on the pressing issues facing Floridians before devoting its full attention to congressional redistricting in April.\"](https://x.com/GovRonDeSantis/status/2008953865589157977) [In a video DeSantis stated the mid-decade redistricting is necessary to address rapid population growth and will wait for a pending U.S. Supreme Court ruling on the Voting Rights Act to ensure the new districts are constitutionally valid.](https://x.com/FLVoiceNews/status/2008948088694579218) There's also still Louisiana v Callais (race based redistricting), which would have Republicans gain up to 27 extra House seats. That would seal the House for MAGA in the midterms. [Good article by Amuse on X: Louisiana v. Callais: The Case That Could Finally Desegregate American Politics](https://x.com/amuse/status/1975932422886678901) --- -2025 - 2026 Redistricting- **Republican** - Missouri - 1 extra Republican House seat - North Carolina - 1 extra Republican House seat - Texas - 5 extra Republican House seats **Democrat** - California - 5 extra Democrat House seats - Virginia - Trying to get 4 extra Democrat House seats **Red states that should redistrict to combat against California, Virginia. Would gain up to 27 House seats.** - Arizona - 3 seats max - Florida - 8 seats max - Georgia - 5 seats max - Kansas - 1 seat max - Mississippi - 1 seat max - Ohio - 5 seats max - South Carolina - 1 seat max - Tennessee - 1 seat max - Wisconsin - 2 seats max If blue cities (no such thing as blue states) tried to redistrict every state to the max, they'd only gain 22 extra House seats. Republicans would still have +5 extra House seats. - Colorado - 4 seats max - Illinois - 3 seats max - Nevada - 1 seat max - New Jersey - 3 seats max - Maryland - 1 seat max - New York - 7 seats max - Oregon - 1 seat max - Washington - 2 seats max",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Republicans just love losing and taking the high road. I knew that Democrats would do this the first chance they got",
                "author": "PatriotSam"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤣 REPORTER: Do you condone police spraying reporters with tear gas?! SHERIFF GRADY JUDD: \"I'm not sure there's ANYTHING wrong with spraying journalists with tear gas!\"",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The hero we need",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "could the volume be any lower? I can't hear shit.",
                "author": "Shamb3"
            },
            {
                "raw_content": "I am not even sure they are man or a women let alone what profession they can perform. I am not an HR manger. Answer with the stupid back at them. mock them",
                "author": "yukondave"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greenland is not in Europe; it’s in the Western Hemisphere. America has made it clear for over 200 years that we are in charge of what happens in this hemisphere. Some people need to wake up and face the reality of what’s actually going on. Ultimately, this will benefit Greenland, much like Alaska.",
        "score": 1418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Greenland # is # NORTH AMERICA",
                "author": "RhodeIslandRepublic"
            },
            {
                "raw_content": "We weren't $30+ trillion in debt with half the country depending on welfare when we bought Alaska.",
                "author": "LordKuroTheGreat"
            },
            {
                "raw_content": "Its on the North American plate. The ONLY reason Denmark thinks they should have it is because they do right now and because 1000 years ago Vikings settled there for a while before moving west to Nova Scotia",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Clinton-Appointed Federal Judge Denies DOJ Bid To Access California Voter Registration Rolls",
        "score": 803,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Then CA's electoral votes no longer count in presidential elections. Easy fix.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "what an odd thing to deny",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Another day, another activist judge. So glad the GOP has a spine...",
                "author": "nakedjay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two teachers at @PropelSchools in Pittsburgh, PA, posted a video CELEBRATING reports that Iran was making threats to assassinate President Trump. THESE are the people teaching your children.",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "most people have no idea how far we have fallen",
                "author": "highenergywinning"
            },
            {
                "raw_content": "Liberals aren't bright. They don't major in engineering. An education degree is all they can get -- with lots of teacher's help. And daddy's buying.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "Are you fucking kidding? These morons are still posting shit like this after Charlie Kirk?",
                "author": "btntx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Macwaters, \"Let me get this straight: NED funnels $300,000,000 of taxpayer dollars through NGOs. it **literally** funds the censorship of American citizens and the entire \"advertiser pressure\" complex, had payments frozen by DOGE and yet every single democrat + 81 republicans voted to fund it\"",
        "score": 1437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I do not consent.",
                "author": "MrTeezyForSheezy"
            },
            {
                "raw_content": "Yes, they voted to fund it using our taxes to fund our own censorship and subjugation. ## Source https://x.com/ArthurMacwaters/status/2011847985521418514 Who were the filthy Republican scum traitors? Here they are. Note several on the this list also voted to protect the extreme far left activist Judge Boasberg as well. But hey, keep voting Republican. Aderholt (AL), Rogers (AL), Strong (AL), Ciscomani (AZ), Crawford (AR), Hill (AR), Westerman (AR), Womack (AR), Calvert (CA), Issa (CA), Kiley (CA), Kim (CA), Obernolte (CA), Valadao (CA), Evans (CO), Hurd (CO), Bilirakis (FL), Buchanan (FL), Diaz-Balart (FL), Franklin (FL), Gimenez (FL), Haridopolos (FL), Mast (FL), Rutherford (FL), Salazar (FL), Webster (FL), Simpson (ID), LaHood (IL), Baird (IN), Feenstra (IA), Hinson (IA), Nunn (IA), Estes (KS), Guthrie (KY), Rogers (KY), Huizenga (MI), Moolenaar (MI), Walberg (MI), Alford (MO), Wagner (MO), Bacon (NE), Flood (NE), Smith (NE), Kean (NJ), Garbarino (NY), LaLota (NY), Lawler (NY), Malliotakis (NY), Stefanik (NY), Tenney (NY), Edwards (NC), King-Hinds (MP), Carey (OH), Joyce (OH), Latta (OH), Taylor (OH), Turner (OH), Bice (OK), Cole (OK), Lucas (OK), Bentz (OR), Bresnahan (PA), Fitzpatrick (PA), Kelly (PA), Mackenzie (PA), Meuser (PA), Smucker (PA), Wilson (SC), Johnson (SD), Carter (TX), Ellzey (TX), Goldman (TX), McCaul (TX), Moran (TX), Pfluger (TX), Maloy (UT), Moore (UT), Kiggans (VA), Wittman (VA), Baumgartner (WA), Newhouse (WA)",
                "author": "JackLemon"
            },
            {
                "raw_content": "It's a total lie that advertisers are afraid of their brand being associated with right wing or racist content. Consumers absolutely do not care. The people running the ad campaigns are woke communist infiltrators and they are weaponizing other people's money against their political opponents, as always.",
                "author": "XxxRDTPRNxxX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD Ryzen 9 9950X3D2 Gets Benchmarked, Shows 7% Improvement over Regular X3D SKU",
        "score": 176,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AMD in competition with itself for eventual most specific SKU name",
                "author": "certainlystormy"
            },
            {
                "raw_content": "X3D2 sounds like R2-D2's cousin",
                "author": "webu"
            },
            {
                "raw_content": "What a stupid and low effort article. It's Geekbench 6 and some random person shared the Benchmark result of a 9950X3D2 and compares it to the result of some other persons benchmark? They're not even running the same motherboard and no one knows what configuration is set. The 9950X3D2 lands at 24430 in MT and 3553 in ST score. Results for regular 9950X3D on Geekbench are between like 20k and 25k for MT and around 3400 and 3700 for ST. This benchmark doesn't show anything, might be better or worse.",
                "author": "luuuuuku"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Hires ex-Qualcomm & AMD GPU Architect Eric Demers To Lead GPU Engineering For Data Centers",
        "score": 155,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol, what the heck. [https://www.reddit.com/r/hardware/comments/1q4m3bc/chips\\_and\\_cheese\\_diving\\_into\\_qualcomms\\_upcoming/](https://www.reddit.com/r/hardware/comments/1q4m3bc/chips_and_cheese_diving_into_qualcomms_upcoming/) Chips and Cheese recently did an interview with him on the SD X2 GPU architecture. Tho, unsurprising in this industry, you got Intel, Nvidia, and AMD folks circling around",
                "author": "Noble00_"
            },
            {
                "raw_content": ">AMD GPU Architect He was only at amd during the ati times and left as it was almost goin bankrupt in 2012. Not really related to any of amd's modern architectures",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "QC GPUs are very good for the space they use so he will be a very good addon for Intel. What Qualcomm lacks is literally not his fault (software)",
                "author": "DerpSenpai"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ASUS] Public Statement to Clarify Recent Reports Regarding the ASUS GeForce RTX™ 5070 Ti and RTX™ 5060 Ti 16 GB",
        "score": 206,
        "text_content": ">We would like to clarify recent reports regarding the ASUS GeForce RTX™ 5070 Ti and RTX™ 5060 Ti 16 GB. Certain media may have received incomplete information from an ASUS PR representative regarding these products. >The GeForce RTX 5070 Ti and GeForce RTX 5060 Ti 16 GB have not been discontinued or designated as end-of-life (EOL). ASUS has no plans to stop selling these models. [https://press.asus.com/news/statements/asus-rtx-5070ti-5060ti-statement/](https://press.asus.com/news/statements/asus-rtx-5070ti-5060ti-statement/)",
        "comments": [
            {
                "raw_content": "Someone absolutely got a call.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Warranty support for these lines is going to be an absolute nightmare.",
                "author": "CataclysmZA"
            },
            {
                "raw_content": "“Asus have no plan stop selling these products” But if we can't get them and don't have any in stock, that totally different. We want to sell, but we don't have any. It have nothing to do with shifting production to a higher margin product",
                "author": "carnewbie911"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "2kliksphilip - DLSS 4.5 VS 4 VS 3 VS 2 VS 1",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was getting tired of people testing DLSS 4.5 at 4K and 1440P, of course it's going to look good as did DLSS 4, the base resolution has enough data to reconstruct it well through DLSS This in my opinion is a much more meaningful comparison",
                "author": "Due_Teaching_6974"
            },
            {
                "raw_content": "DLSS4 and FSR4 are just definitely better than native. Native being mostly TAA variants.",
                "author": "EndlessZone123"
            },
            {
                "raw_content": "Why no one does dlss 3.7 comparsion anymore ? I think it still look extreme good on quality mode , and drop less fps than Dlss4 (and less pixelated ghosting vs DLSS4 too) .",
                "author": "lifestealsuck"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory Prices Soar by 50% in Q4, Rally to Continue in 2026",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm having a not-so-fun game where whenever I see these headlines I check the price of my previously bought ram. 32gb of DDR5 6000mhz cl30: Feb 2025: £90 Jan 2026: £500 No individual consumer can be paying these prices, can they?",
                "author": "TheCookieButter"
            },
            {
                "raw_content": "My $150 64GB DDR4-3200 kit purchased last summer is now almost $550 in 6 months. Go figure the stock isn't moving at all.",
                "author": "ProfessionalPrincipa"
            },
            {
                "raw_content": "Is there a retailer that shows sales statistics? I wonder how much slower parts are being sold, not just RAM but CPUs and motherboards too.",
                "author": "vegetable__lasagne"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MikroTik CRS804 DDQ Announced 4-Port 400GbE Switch",
        "score": 35,
        "text_content": "Awesome new heart and lungs of any homelab and datahoarder's cluster!\\ But where are affordable 50/100/200/400GbE NICs ?\\ Without those, having just a switch doesn't make much sense. 🙄 EDIT: THis switch is based on the same chip as previous 8x50+2x200+2x400GbE switch [MikroTik CRS812-8DS-2DQ-2DDQ-RM](https://www.servethehome.com/mikrotik-achieves-400gbe-in-our-mikrotik-crs812-8ds-2dq-2ddq-rm-review-keysight-cyperf-arm-marvell/), that is similarly priced, if not cheaper and at least IMO somewhat more interesting.",
        "comments": [
            {
                "raw_content": "I mean they are all pretty niche adapters even in Enterprise circles, would be surprising for anything affordable to be around for home labs anytime soon.",
                "author": "riazzzz"
            },
            {
                "raw_content": "100gbe nics are sub-$100 on eBay, and 400Gbe to quad 100Gbe DACs exist. Could be interesting for anyone that wants to buy a switch now and upgrade to 400gbe later when the nics get cheaper",
                "author": "JaredsBored"
            },
            {
                "raw_content": "The NICs are available... for $1600. Not many home data hoarders actually have a use case for 400GbE.",
                "author": "Ploddit"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD promises to try and keep GPU prices low against the ravages of the RAM shortage",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know about you all, but I for one absolutely trust the megacorp to keep their promise to keep prices down.",
                "author": "RumbleTheCassette"
            },
            {
                "raw_content": "Same company that was going to \"try\" to reclaim marketshare, and \"try\" to release the 9070xt at msrp. There must be a profit gremlin that smacks their hands whenever they decide to do good things.",
                "author": "ClerkProfessional803"
            },
            {
                "raw_content": "Oh that’s great. I will also try to win the lottery. I’ll give it my best effort.",
                "author": "Leading_Pay4635"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I have nobody to share this with but I won a switch 2 recently from a giveaway",
        "score": 762,
        "text_content": "What games do you guys recommend? I bought legends ZA",
        "comments": [
            {
                "raw_content": "Congrats! Everyone has different tastes in games. Before buying something a random redditor recommends…search best switch games, read reviews, and watch some gameplay. Enjoy!",
                "author": "haggisaddict"
            },
            {
                "raw_content": "Congrats! Pick up DK, the game is amazing!",
                "author": "BigGuy266"
            },
            {
                "raw_content": "DK Bananza and Kirby Air Riders. Maybe Metroid Prime 4 if you're into that kind of game.",
                "author": "HeadBodyMaster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2’s battery drains really fast in sleep mode.",
        "score": 298,
        "text_content": "When I take my Switch 2 with me in handheld mode and put it in its case, then take it out a few hours later, I notice it’s warm and has almost no battery left or is completely drained. This never happened to me with my Switch 1, which I could carry in my backpack all day and take out halfway through the day with almost the same battery it had when I left home. Is this happening to anyone else? Or is my console damaged? Is there any way to fix it? Thank you very much for your help.",
        "comments": [
            {
                "raw_content": "Almost every Switch 2 behave this way. And afaik no one knows why. Some speculate it has something to do with wi-fi but no solid answers.",
                "author": "RealGazelle"
            },
            {
                "raw_content": "I believe putting it in airplane mode while on sleep mode can help with the battery drain",
                "author": "bassplayerdude"
            },
            {
                "raw_content": "I tested airplane mode by turning off Bluetooth, WiFi, and NFC separately. Bluetooth and NFC didn’t help with battery drain. It was turning off WiFi via airplane mode that basically stopped the drain (losing 60% overnight).",
                "author": "alaskansnow"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got Mario Kart World for Free",
        "score": 84,
        "text_content": "I ordered my Switch 2 online on Walmart but I ordered the Pokemon Legends ZA bundle and they gave me the Mario Kart bundle with a physical ZA included 😁 (bought air riders separate)",
        "comments": [
            {
                "raw_content": "Did the cat come with it",
                "author": "roseychu"
            },
            {
                "raw_content": "Well that’s pretty sweet",
                "author": "SneakyDeakyJr"
            },
            {
                "raw_content": "Honestly wouldn't be surprised if they were temporarily out of stock or completely out of stock of the legends ZA bundle and just did this instead of cancelling your order. Enjoy!",
                "author": "Chewbacca319"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden isn't Worth $60 but $28 is a reasonable price",
        "score": 72,
        "text_content": "gonna wait a bit more because I might get animal crossing instead, I don't think any Madden these days is worth $60, but $28 for a portable version that looks this good docked ? menus are laggy but most gameplay is a solid 30fps, at the very least I'm thankful for this free trial",
        "comments": [
            {
                "raw_content": "I tried the free play because I was curious. Having no huddle spike the ball set to the SAME BUTTON you use to skip and hike the ball is absolutely insane. I am shocked it got past any sort of playtest.",
                "author": "wrebbit"
            },
            {
                "raw_content": "Looks pretty good on the Switch 2 https://preview.redd.it/qif87m4u0udg1.jpeg?width=1920&format=pjpg&auto=webp&s=94ceabc56e68a87df372346c3e8b447055cb1888",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "The best football game of all time was released at $20. Yes video games were $50-60 then too.",
                "author": "FillaBustaRhyme"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dynasty Warriors Origins Switch 2 vs PS5 (Performance and Quality Modes)",
        "score": 116,
        "text_content": "Honestly I wasn’t even expecting the Switch 2 to have a performance mode. I’m definitely picking this up I had a lot of fun with age of imprisonment last year.",
        "comments": [
            {
                "raw_content": "Oh wow! I have this on PS5, it never even occurred to me that it would make an appearance on Switch 2. The Switch version looks really good.",
                "author": "JayParty"
            },
            {
                "raw_content": "Nintendo handhelds went from having completely separate versions of the games to having severely downgraded ports to basically the same thing",
                "author": "Expert-Ad-2824"
            },
            {
                "raw_content": "Wow this is so impressive wtf",
                "author": "Adeel_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New variant for Ash and Pikachu cover.",
        "score": 19,
        "text_content": "After some great feedback this is certainly my favorite of the three. Just some simple grass really pulls the whole thing together.",
        "comments": [
            {
                "raw_content": "These are awesome. You got an stl for these?",
                "author": "Ethewald"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "That green works so well",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Age of Imprisonment is very...ok.",
        "score": 7,
        "text_content": "I've only just got round to playing this, and I was kinda shocked at how ok it was. It's not awful by any standard, but my lord it's far from great. It somehow feels entirely soulless and like it's truly scraping the barrel at trying to link itself to TotK. I'd love for them to go back to the original Hyrule Warriors where it's just a celebration of the series and contains all the incredibly unique characters and locations again. I've been a fan of musou games since the PS2, and whilst this game is of course an improvement on many of the games in the series of musou games, it's still quite far from the top.",
        "comments": [
            {
                "raw_content": "Hard agree. Have played for about half dozen hours. It truely feels like a game that doesn't need to exist",
                "author": "Popular_Sir863"
            },
            {
                "raw_content": "I liked the game but the combat is completely butchered compared to Definitive Edition. Enemies don't capture bases anymore and most missions are a straight line, so there's no reason to kill anything but the major enemies. But combat against major enemies is literally just putting the same Zonai devices down and spamming the highest DPS combo since you can't juggle anymore, and everything is 100% safe due to dodge cancels. The whole gameplay loop is literally just run to major enemy > place device > spam one combo > repeat until you win. Every character plays identically because of this too. Meanwhile DE had base management and strategy play a huge part, major enemies would block so you'd need to learn ways to juggle properly, AoE clear was super important, every character had different optimal combos for each giant boss, and there was infinitely more character and stage variety.",
                "author": "MrSnek123"
            },
            {
                "raw_content": "I like it. The game did exactly what it’s supposed to do increase the depth of the switch 2 library. Completely disagree I played many mouse games and it’s one of the top ones",
                "author": "Kalpy97"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Paul Tassi: Have learned that Highguard did not actually pay for that Game Awards finale spot. Was just the show putting it there",
        "score": 1029,
        "text_content": "[https://xcancel.com/PaulTassi/status/2012258185495650308](https://xcancel.com/PaulTassi/status/2012258185495650308)",
        "comments": [
            {
                "raw_content": "Oookay. That’s interesting. I wonder why?",
                "author": "Greatsnes"
            },
            {
                "raw_content": "[Imran Khan stated this about 10 days ago.](https://www.resetera.com/threads/3-weeks-from-launch-highguard-is-mia-since-tga-reveal.1398748/post-149732356) >So fun note: They did not *pay* for that spot. Like obviously you pay for a Game Awards spot in general, but the choice of where to put it in the show is Keighley's. I'd argue he screwed them a little with that placement there.",
                "author": "shirke1"
            },
            {
                "raw_content": "Geoff really did these guys dirty then by making them the one more thing.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sands of Time & Black Flag Remake website are a hoax",
        "score": 566,
        "text_content": "Both websites are a hoax. Someone has added in their own links to the website and it was published. Still no news on when we can expect any actual release date [Link](https://postimg.cc/FkcwLQRP) shows changes to URLs on the website with examples of what has been added halflife3-tomorrow looks-its-totally-fake Nintendowitch3\\_hero",
        "comments": [
            {
                "raw_content": "Lol @ that post the other day speculating that Sands of Time will drop “tomorrow”",
                "author": "Infamous_Pay_7141"
            },
            {
                "raw_content": "The stock went up 10% on this fake rumour. That’s crazy",
                "author": "Individual_Carry_928"
            },
            {
                "raw_content": "We’ve been tricked, we’ve been backstabbed and we’ve been quite possibly, bamboozled.",
                "author": "Twilight-Sage"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "2 hidden Fallout games on Steam",
        "score": 26,
        "text_content": "If you search for Fallout on Steam it says 12 games but if you look at all the games there are only 10 available that is showing. Im not sure if this is pointing to a Fallout 3/New Vegas remaster. [https://imgur.com/a/7SkDSjb](https://imgur.com/a/7SkDSjb)",
        "comments": [
            {
                "raw_content": "Fingers crossed for the Xbox showcase. I doubt it though.",
                "author": "honkymotherfucker1"
            },
            {
                "raw_content": "I would be shocked if both games drop at the same time, let alone this year.",
                "author": "BlindedBraille"
            },
            {
                "raw_content": "January 22 is developer direct. 2 out of 3 had a shadow drop. And Oblivion remastered also shadow dropped. So perhaps? Fallout 3 remaster was already leaked years ago during the Activision Blizzard merger.",
                "author": "Mundus6"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential God Of War TV Casting Leaks",
        "score": 255,
        "text_content": "https://nerdbot.com/2026/01/14/god-of-war-finds-their-live-action-kratos/ So Deadline just revealed that Teresa Palmer has been cast as Sif. Interestingly the above random(?) website also confirmed the same 2 days ago. They also say that Max Parker has been cast as Heimdall and Olafur Darri Olafsson has been cast as Thor. Both of these were rumoured to be being ‘looked at’ before but not cast. This says they have now been officially casted. The previous rumours also said Max Parker was going to be Baldur not Heimdall. They also say Alastair Duncan who plays Mimir in the games will do the same for the show.",
        "comments": [
            {
                "raw_content": "Olafur was the Highlander in For Honor, the chopper pilot in The Secret Life of Walter Mitty and also one of the bad guys that I’ve forgotten the name of in Severance. It’d be cool if they lean into the Norse accents and maybe have them speak Icelandic or something, this guy in particular has a very booming and commanding voice. Definitely a good pick for Thor imo",
                "author": "honkymotherfucker1"
            },
            {
                "raw_content": "Give me Richard Schiff as Odin or we riot",
                "author": "Rooonaldooo99"
            },
            {
                "raw_content": "It’s funny because there some actors within the game who could have played their roles again Danielle Bisutti as Freya for example or Deborah Ann Woll as Faye. Even Jeremy Davies as Baulder.",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MLID: Nvidia is restricting supply on any GPU with 12+gb for sale as discrete gpu, laptop or prebuilt PC for 2026. AMD will continue to sell for now with increased markups.",
        "score": 424,
        "text_content": "[https://youtu.be/hZMAoC50iOw](https://youtu.be/hZMAoC50iOw) They wanted to back up hardware unboxes claim that Nvidia is restricting supply to Asus to the point Asus is forced to treat the 5070 Ti as end of life. They go one step further and say their sources are seeing restriction on not just discrete gpu's but laptops as well for 2026. If you were planning to upgrade this year waiting till spring or August might be a bad idea.",
        "comments": [
            {
                "raw_content": "#Moore's Law is Dead (MLiD) is a Tier 5 - Pretty Much Clickbait as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Boy am I glad I got a 12GB 3080 and not the 10.",
                "author": "Saber_of_Sid"
            },
            {
                "raw_content": "I will be at r/patientgamers for the foreseeable future.",
                "author": "UOR_Dev"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Speculation] The Ocarina of Time \"Final Battle\" theme in the new LEGO trailer is a never-before-heard orchestral recording",
        "score": 128,
        "text_content": "The music in the Ocarina of Time \"Final Battle\" LEGO reveal uses a unique, fully orchestrated version of the Final Battle music. There have been similar fan reorchestrations of the theme, but the only official orchestrated version that I'm aware of is the Symphony of the Goddesses concert series. The arrangement is similar, but distinct with more weight to the brass and less to the strings and percussion that the concert series used. Given the rumors of an Ocarina of Time remake, it seems like this adds more smoke to that fire as it seems odd for Nintendo to commission a studio recording of this track just for a LEGO reveal trailer. It's also probably too early to have any b-roll from orchestration for the Sony movie. [LEGO Reveal Trailer](https://www.youtube.com/watch?v=VXnVOzERaaU) [Symphony of the Goddesses Final Battle Theme](https://youtu.be/foWpVH1UPQI?si=ES5csDs09hKURdAw&t=469)",
        "comments": [
            {
                "raw_content": "Don’t do this to me. Don’t give me hope. For people thinking about the 3DS version, that is older today (15 Years) then the N64 version was when it came out (13 Years).",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Symphony of the Goddesses concerts were performed by local orchestra. So every time it could be slightly different. The lego trailer piece sounds very similar to the piece from [2013 Toronto concert](https://youtu.be/cqM_GArNP1w?si=5KjLK3OHgdxKFGg6) to me.",
                "author": "xhr0428"
            },
            {
                "raw_content": "This thread makes me realize most people here would have lost their mind in 2005 with every tiny thing we got about Twilight Princess. Also known as Rise of Melancholy, for those old enough to remember those fake rumors. This \"never before heard\" piece means nothing.",
                "author": "Medd-"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "HoYoverse games (other than Honkai 3rd) might be coming to Steam",
        "score": 421,
        "text_content": "HoYoverse's account management system ([https://account.hoyoverse.com/](https://account.hoyoverse.com/)) lately just added the following Steam-related strings into their localized message file ([https://webstatic.hoyoverse.com/admin/mi18n/plat\\_oversea/m04131715591001/m04131715591001-en-us.json](https://webstatic.hoyoverse.com/admin/mi18n/plat_oversea/m04131715591001/m04131715591001-en-us.json)): `\"login_failed_msg_thirdparty_unlinked_nt\": \"No previous Steam play records detected (logging in to the webpage with a Honkai Impact 3rd Steam account is not supported). Please log in with your usual game account to continue.\",` `\"login_failed_title_thirdparty_unlinked_nt\": \"You have not logged in to Steam before.\",` `\"unlink_steam_desc\": \"After unlinking, you will be unable to log into HoYoverse via Steam{{nickname}}.\",` `\"unlink_steam_remarks\": \"You will be unable to access any characters under this HoYoverse Account via your Steam account after unlinking, and game progress will no longer be synchronized. A HoYoverse Account can only be unlinked from a Steam account once within 30 days. Do you wish to proceed?\",` The strings were added recently on Jan. 6 according to [archive.org](https://web.archive.org/web/20260105000000*/https://webstatic.hoyoverse.com/admin/mi18n/plat_oversea/m04131715591001/m04131715591001-en-us.json). And no it's not for Honkai 3rd as you can see in the string that `logging in to the webpage with a Honkai Impact 3rd Steam account is not supported`, suggesting that they are for other games. Currently, a similar string `No previous console play records detected. Please log in with your usual game account to continue.` shows up when you log in using a PSN account that's not linked to a HoYoverse account.",
        "comments": [
            {
                "raw_content": "should make it much less of a hassle to run these games on a Steam Deck",
                "author": "hipo5PL"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Wonder if we'll be able to use our Hoyoverse accounts on Steam. I don't believe you can with Honkai 3rd, but I could be wrong.",
                "author": "Macho-Fantastico"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microcode 0x104 SVID Undervolting vs 0x12B: Long-term Degradation Trade-off",
        "score": 1,
        "text_content": "TL;DR at bottom Hey everyone, I've been running a pretty tight undervolting setup on 0x104 microcode and want to get the community's perspective on whether I should stick with it or upgrade to the latest 0x12B. Looking for real-world experience and advice. **## Current Setup: 14600KF, ASUS TUF Gaming B660 PLUS** \\- Microcode: 0x104 \\- BIOS Settings: AC LL 0.50, DC LL 1.00, LLC Level 4, IR Max 1400mV \\- SVID Offset: -0.075V (only available on 0x104) \\- Power Limits & ICC Max: Set and locked \\- CEP: Enabled (disabling didn't help performance/thermals) \\- Cinebench Results: 1.225V peak load, 80°C max temp The Problem: I get excellent load-state voltage (1.225V) with this config, but I'm now wondering if I'm missing critical microcode fixes by staying on 0x104. **## What I've Learned About the Microcode Versions** \\*\\*Microcode 0x125\\*\\* – Not really relevant to my use case (fixes eTVB algorithm, but I've already bypassed that with BIOS tuning). \\*\\*Microcode 0x129\\*\\* – Introduced VID ceiling at 1.55V (safety backstop), but this doesn't help my 1.225V load. The real issue: it completely removes SVID offset capability, which is why moving to latest disables my -0.075V offset. \\*\\*Microcode 0x12B\\*\\* – This is where I'm uncertain. Intel says it prevents idle/light-load voltage spikes that were causing the primary degradation. **## The Question: Idle Voltage Risk?** From what I've researched, the actual degradation on 13th/14th gen happened during idle and light-load states, not during full load. \\- 0x104 can spike to 1.4V+ during idle (depending on SVID behavior settings) \\- 0x12B caps these idle spikes to \\~1.25-1.3V \\- These idle spikes are sustained for minutes—that's where electromigration occurs **## What I Actually Want From the Community** Has anyone here monitored idle voltage on 0x104? What did you see? Did it concern you?0x12B users: Are you actually seeing lower idle voltage compared to 0x104, or is it negligible? Is idle voltage at 1.4V for extended periods actually a degradation risk if load is kept at 1.225V?Has anyone experienced Vmin shift or performance loss over months of using 0x104? I'm not looking to max out performance—I want my CPU to last 5+ years without degradation. If I need to sacrifice my SVID offset to get microcode-level idle voltage protection, I'll do it. But if my load-state tuning is already protecting me, and idle voltage doesn't actually matter that much in real-world usage, I'd rather keep the extra optimization. **Cinebench scores:** 0x0104 - 24050 12B - 23403 \\--- \\## TL;DR Running 0x104 with SVID offset and achieving 1.225V load voltage at 80°C. Concerned that I'm missing 0x12B's idle voltage protection, but unsure if idle voltage is actually a significant degradation risk or if my load-state config is already sufficient protection. Should I upgrade to 0x12B for peace of mind, or is 0x104 fine if load voltage is strictly controlled? Looking for real-world perspective and anyone who's monitored idle voltage on older microcode.",
        "comments": [
            {
                "raw_content": "does no one realize the microcode is for transients that you can't see on readouts? the spikes are up to 1.72v. none of you are \"fixing\" the problem by undervolting unless your offset is so low that the CPU reduces/stops attempting to hit higher boost speed. manually reducing boost is actually an effective fix since the cpu has no reason to request so much current while trying to hit peak boost frequency. also what board prevents you from setting a negative voltage offset after updating firmware? for one thing, if you've ever updated your raptorlake firmware, your current CPU is stuck on that firmware. going back to an older bios does not revert your firmware. I'm currently on the latest firmware and negative voltage offset still works (asus z790-F).",
                "author": "topdangle"
            },
            {
                "raw_content": "if you're taking matters into your own hands and have done it correctly then microcode matters way less. I'm still running my 14900K on an Asus bios from Feb 2024, a microcode that was released well before this whole intel degradation fiasco began, and have not had any issues.",
                "author": "DannyzPlay"
            },
            {
                "raw_content": "Just update the damn microcode. You're really going to somehow know how to hack together a solution better than Intel engineers? It might happen, but there's a damn good chance it won't.",
                "author": "nanonan"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Gen X and Millennials Will Inherit Trillions in Real Estate Over the Next Decade",
        "score": 235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That money will go to the nursing homes, friend.",
                "author": "augustfolk"
            },
            {
                "raw_content": "I’ve been reading these “great wealth transfer” pieces for several decades now. Still waiting for the Boomers to give it up.",
                "author": "SlipperyRhinocerous"
            },
            {
                "raw_content": "No, assisted living and at home attendants will bleed it all dry",
                "author": "WharfRat2187"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgages at 6% Pose Critical Test for Frozen US Housing Market",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s not the fucking rates it’s the *fucking prices* Jesus Christ enough of this rate edgelording already",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Watch as fucking nothing happens. The mortgage interest is rapidly becoming the least of people's worries as insurance, property taxes, and maintenance costs continue to soar. The quiet part, that seems no politicians want to talk about, is how the affordability crisis is trickling down into every facet of American life and those ballooning numbers manifest as unsustainable home carrying costs.",
                "author": "Guest_0_"
            },
            {
                "raw_content": "I don't see why going from 6.05 to 5.95 percent interest makes any difference. It's a few bucks less interest, it doesn't change the fact you would be buying into an asset that has proven it is not going any higher anytime soon (mass layoffs, economy affected by tariffs), but is *priced* assuming appreciation. It's not a \"psychological barrier\" preventing people buying. It's that the same house is $3300 a month to rent, and $7500 a month to buy. So if now it's $3250 a month to rent (rents have gone down slightly) and $7450 a month to buy, that's hardly the time to sell your downpayment stocks and make bids.",
                "author": "SoylentRox"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Our house isn't selling...do we just keep dropping the price? Any advice?",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[30y fixed was 2.79-3.11% in 2021. Now it's 6.06%. ](https://fred.stlouisfed.org/series/MORTGAGE30US/) Payment in 2021 at 3.11% on $615k w/ 20% ($123k) down was $2,235/mo. In 2026 at 6.06%, that payment is now $3,154/mo. Not to mention the escalation in insurance payments and maintenance costs. They literally bought the top when mortgage money was the cheapest in history.",
                "author": "definitelyAIspambot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "🇨🇦 RE just entered the second leg of the correction 📉 Prices are now down 21.6% from peak, falling 7 straight months, and just hit a 5-year low.",
        "score": 40,
        "text_content": "December alone accounted for nearly 20% of the entire annual decline. At the same time, sales remain below 2019 levels despite population growth, while new listings are near multi-year highs even in December. That combination usually means prices haven’t finished adjusting yet.",
        "comments": [
            {
                "raw_content": "Someone think of the agents.....they are going to have to get real jobs now.",
                "author": "HotIntroduction8049"
            },
            {
                "raw_content": "Meanwhile in Chicagoland",
                "author": "DeepHerting"
            },
            {
                "raw_content": "Snowflation: money laundering with faceless shell companies buying Canadian real estate with illicit funds.",
                "author": "FlimFlamBingBang"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Underwater car trade-ins are on the rise — and drivers owe a record amount, Edmunds finds",
        "score": 82,
        "text_content": "People who are underwater on their cars or delinquent on their car payments prolly won't be signing on Mr. Banker's dotted line for overpriced houses - just a hunch.",
        "comments": [
            {
                "raw_content": "*Laughs in my paid off 2014 Toyota 4Runner*",
                "author": "Shasty-McNasty"
            },
            {
                "raw_content": "People are idiots that bought during pandemic and paid 2x the value. My car was worth $52k when I started monitoring the price. Then it fell to $35k when I bought it. I knew it wasn't worth $50k plus, but most cars shouldn't be worth over $50k, like an F-150. If people just sat back and said hmm should I buy a f150 for 80k...nah",
                "author": "skynetempire"
            },
            {
                "raw_content": "If CNBC is reporting it then it's worse than we think. This problem is bad. On top of people paying too much for vehicles post-Covid, the cars they bought are depreciating faster than normal. Sure, this is mainly due to them being way overpriced in the first place, but that doesn't change the fact that people owe much more than their cars are worth.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates fall to lowest level in more than three years | CNN Business",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A 0.1% something change is a less than $30 to 40 monthly difference in payment. Prices need to come down.",
                "author": "BrassBondsBSG"
            },
            {
                "raw_content": "Yawn… call me when rate are below 4.5%",
                "author": "Low-Tackle2543"
            },
            {
                "raw_content": "All the “date the rate” peeps feeling pretty good lately :P",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anyone else stuck with a house that just won’t sell no matter what?",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When this person said \"no matter what,\" I wonder if one of the options they considered was lowering the price to match the market?",
                "author": "NewCzech"
            },
            {
                "raw_content": "A home seller with a home that “just won’t sell no matter what”, and is unwilling to lower the listing price, is called a bagholder.",
                "author": "McFatty7"
            },
            {
                "raw_content": "As a potential buyer I have been through 6 rounds of back and forth over the past couple weeks on a condo— just to get under contract. We are basically agreeing to all the sellers terms and then they want to make changes again. I now see why it’s been on the market for a year",
                "author": "scupperdong"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ai through years",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|3ogwG6dfhYRhGZERJS)",
                "author": "agonypants"
            },
            {
                "raw_content": "That's what I get for doing a double major in Celebrity Deepfakes and Emojified Essays.",
                "author": "PickerPat"
            },
            {
                "raw_content": "Fuck my chud CS life",
                "author": "sussybaka1848"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How it feels to watch AI replace four years of university and half a dozen of your certificates",
        "score": 1512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really hope it replaces my job. I dont think AI will even want to do it while juggling all the stupidity that comes with it",
                "author": "HounerX"
            },
            {
                "raw_content": "Don't worry, non-software degrees have bad time too.",
                "author": "chlebseby"
            },
            {
                "raw_content": "Just remember that if AI replaced 90% of jobs and you are in the other 10% you are not escaping this shit. Cus all 100% of humans will try to get into that 10% of work, and sorry to tell you, but you are not top 10% of humanity, so yes my dear redditor, you will also lose your job.",
                "author": "BelgianDudeInDenmark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"I kind of think of ads as like a last resort for us as a business model,\" - Sam Altman, October 2024",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wild that OpenAI is going to be AI Yahoo and Google is going to be AI Google.",
                "author": "Comic-Engine"
            },
            {
                "raw_content": "![gif](giphy|TbONGqAdpTWQW3Hz5V)",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "That and porn. And here he is.",
                "author": "Zahir_848"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman publishes 2017 OpenAI call notes responding to Musk claims: The truth Elon left out",
        "score": 178,
        "text_content": "Sam Altman shared screenshots and a new OpenAI blog addressing claims from Elon Musk’s court filings. The post includes internal 2017 call notes about OpenAI’s transition from nonprofit to a new structure. Adds primary source context to the ongoing OpenAI governance dispute. [Tweet](https://x.com/i/status/2012272451363709377) **Source: OpenAI and Sama in X**",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/mtjie27u6sdg1.jpeg?width=1052&format=pjpg&auto=webp&s=07964c2e0c754cb34d0132bc7f389fc9e5aa980c",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "\"[Elon] said that he needed full control since he’d been burned by not having it in the past, and when we discussed succession he surprised us by talking about his children controlling AGI.\" wtf. how is this not the headline here?",
                "author": "nemzylannister"
            },
            {
                "raw_content": "It seems both sides have little things that make each other look bad. Maybe let's just wait til it plays out in court to get the entire story before swinging back and fourth between who's wrong based on single statements the other side puts out",
                "author": "Just_Stretch5492"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI–Cerebras deal hints at much faster Codex inference",
        "score": 249,
        "text_content": "Sam Altman tweeted “very fast Codex coming” shortly after OpenAI announced its partnership with Cerebras. This likely points to **major gains** in inference speed and cost, possibly enabling more large scale agent driven coding workflows rather than just faster autocomplete. Is this **mainly** about cheaper faster inference or does it unlock a new class of long running autonomous coding systems? [Tweet](https://x.com/i/status/2012243893744443706)",
        "comments": [
            {
                "raw_content": "OpenAI **announced** a $10 billion deal to buy up to 750 megawatts of computing capacity from Cerebras Systems over three years. OpenAI is **facing a severe** shortage of computing power to run ChatGPT and handle its 900 million weekly users. https://preview.redd.it/qo4wi63xlrdg1.jpeg?width=1310&format=pjpg&auto=webp&s=adb18a27211f2cfc302993bf5b6acf555b792c5e Nvidia GPUs while **dominant** are scarce, expensive and increasingly a bottleneck for inference workloads. **Cerebras** builds chips using a fundamentally different architecture than Nvidia.",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Because of Codex, now when I shit on the job, I'm not wasting company time.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Why do you write like that",
                "author": "PureOrangeJuche"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ads are coming to GPT",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Knew this day would come and still think it's a terrible idea.",
                "author": "Are-U-Cereall"
            },
            {
                "raw_content": "yeh ill stick with gemini and its better",
                "author": "Inbellator"
            },
            {
                "raw_content": "Edit: it will apply to free and \"Go\" tiers, not Plus and above per this blog post: > we’re also planning to start testing ads in the U.S. for the free and Go tiers, A big question is: will this only be on free tier? I'm assuming so. Now if they were to show ads on my $20/mo plan, fuck that.",
                "author": "BrennusSokol"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "First ‘dark factory’ where robots build the entire car tipped to open in China or U.S. by 2030",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so much for blue collar being the refugee for laid off people",
                "author": "Ok-Stomach-"
            },
            {
                "raw_content": "If they are not sure where yet, it definitely won't be built by 2030",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "I'm a bit skeptical of the insistence of the humanoid bots. Whenever I see this I think it's just for show. If I were designing a robot optimized for fulfilling a particular task like building car, would I really come up with a humanoid? I think humanoids are great for environments built for humans. But if you're designing the environment for robots couldn't you make it easier for yourself?",
                "author": "golfstreamer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "CNBC Reporter vibecoded a bunch of apps this morning",
        "score": 73,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool that they are at least exposing people to what coding agents can do. Even if these software examples aren't completely impressive or totally useful, it's still a step in the right direction. Eventually people will realize they can build very impactful software for their companies through a little bit more dedication and study of vibe coding.",
                "author": "Izento"
            },
            {
                "raw_content": "Nice ad",
                "author": "spectralyst"
            },
            {
                "raw_content": "The next killer app ![gif](giphy|dGTofP3XvOSmfkkueE|downsized)",
                "author": "Distinct-Question-16"
            }
        ],
        "subreddit": "singularity"
    }
]