[
    {
        "post_name": "DAN BONGINO says there’s a LOT more to come out about the J6 pipe bomb case - “This investigation is NOT over at all... The investigation has just begun!”",
        "score": 700,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two more weeks",
                "author": "SnakePlisken1776"
            },
            {
                "raw_content": "Go back to radio Dan. You and Pathetic Pam have done nothing good in DC. -bongino army",
                "author": "MakeFloridaRed"
            },
            {
                "raw_content": "From the report: **Cole’s cellphone had seven data transactions between 7:39 p.m. and 8:24 p.m. on Jan. 5, 2021. These transactions occurred on cell tower sectors covering the exact path the bomber walked as captured on surveillance footage.** This is one of the FIRST things a detective will pull. They had this info within 48 hours. Who sat on this and why? If this isn't planted evidence and this guy really did it he was on someone's payroll. This was the 'emergency' needed to suspend congress debate on accepting the fraudulent electors. It was all for show. Don't believe for a second this is some 'lone wolf' anarchist.",
                "author": "referencevariable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👮 Derek Chauvin Requests New Trial for Murder of George Floyd 👨🏿‍🦲",
        "score": 852,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't believe that poor loser fuck is still in prison.",
                "author": "ShakeAndBake"
            },
            {
                "raw_content": "Do you think in the new trial we could possibly mention to the jury that kneeling on somebody like that doesn't asphyxiate them? I know it seems like a trivial detail, but I think they should probably know about it.",
                "author": "VoteThing"
            },
            {
                "raw_content": "This is the biggest miscarriage of justice in the history of the United States. They literally railroaded these guys in front of all Americans and nothing was done to correct any of this sham of a trial because of the fear of being called racist. This single instance of the failure to stand up for what was right was the death nell to the American Justice system.",
                "author": "OldZilla"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Of all people, our judges should be Americans.",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No fucking chinks should ever be a judge here. Americans only.",
                "author": "Buff_cousin_Elroy"
            },
            {
                "raw_content": "what the hell is a \"T Wang\" and why does she own one?",
                "author": "RichardCranium88"
            },
            {
                "raw_content": "Sounds like a good way for a foreign country like, oh I don't know, China to mysteriously get access to OpenAIs chat logs. This sounds like a CCP agent, not an American judge. I have doubts that OpenAI would end up actually giving this information to NYT and has many avenues to prevent that, but ONLY if they didn't want to give it to them. Trump should consider signing an executive order protecting people's chat information and congress should start writing laws.",
                "author": "terribletwos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SHOTGUN!",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kek",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "We are not going to arrest him for his obvious crimes though. Its (D)ifferent with School Shooter Walz.",
                "author": "Iremembermypassword"
            },
            {
                "raw_content": "What was he expecting besides the Streisand effect?",
                "author": "RedStoneDeepState"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a huge development the media refuses to cover, Trump Transportation Sec. Duffy reveals MASSIVE air traffic control modernization is moving at RECORD pace: \"We've already transitioned 1/3rd of the copper to FIBER! The last admin said it would take 10 YEARS.\"",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, if we could just not use the word 'transition' from now on, that would be great.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Well, the last admin also said they cured cancer, so...",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Speed vs durability",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BOMBSHELL: SCOTUS SIDES WITH TEXAS IN REDISTRICTING FIGHT! Now all the additional gains we get in all the other states are ICING ON THE CAKE. Gavin Newscum is DOWN BAD because the Supreme Court just NUKED his dreams of martyrdom! HUGE!!!",
        "score": 1448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "bye Crockett! bye Dims This is biggly! This is great that they did it before midterms.",
                "author": "here2red"
            },
            {
                "raw_content": "Can't wait for SCOTUS to rule on Louisiana v Callais (race based redistricting), Republicans would gain up to 27 extra House seats. That would seal the House for MAGA in the midterms. [Good article by Amuse on X: Louisiana v. Callais: The Case That Could Finally Desegregate American Politics](https://x.com/amuse/status/1975932422886678901)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "lol kagen, sotomayor, and jackson dissenting get fucked, hoes.",
                "author": "Error404LifeNotFound"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WELCOME TO MINNESOTA! DON'T FORGET TO VOTE!",
        "score": 659,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Walz is a retard",
                "author": "DontTreadOnLego"
            },
            {
                "raw_content": "He ain't smarter than a Somalian, he's more retarded then they are but he gets their votes.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "chain retardation",
                "author": "5DchessWatch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A Norfolk, Virginia Grand Jury has REFUSED to indict New York Attorney General Letitia James for alleged mortgage fraud.",
        "score": 1207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Find a new grand jury then. If we have to send a death squad to her house and eliminate her, then that’s the way it has to be",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "The judicial system is chock full of far-left activist judges, lawyers, and juries which are handpicked from a pool of activist liberals. Of course, they will not prosecute \" their own.\" This is why America will have to split into a red state bloc and a blue state bloc. The alternative is a Civil War in which one side exterminates the other side and attains complete dominance. The differences and goals of each side are diametrically opposed at this point. We are two different peoples sharing the same land. It no longer works.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Norfolk is one of the 3 or 4 DEEP blue areas of Virginia for those here that don't know. It's also a complete sewer as you would expect.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Who else but Franklin?",
        "score": 1271,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pedal faster, Franklin, before Walz tries to take you to an Indigo Girls concert! 🚲💨",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "I suggested this very meme on somebody's post about a couple hours ago I'm glad to see it even if it wasn't the person that I told to make it.",
                "author": "JayKay1776"
            },
            {
                "raw_content": "Top shelf Franklin!",
                "author": "RedditSucksChinaPoo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Walz claims that people are driving by his house and calling him retarded.",
        "score": 1747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Believable",
                "author": "USDMaga"
            },
            {
                "raw_content": "Using the 'R word' lmfaooo",
                "author": "hatredcopter"
            },
            {
                "raw_content": "HES GAY AND RETARDED THOUGH",
                "author": "Merica4EVER"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Joy behar complains about Trump's insults on The view, Stephen A Smith replies \"77 million people don't care\"",
        "score": 1163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gov Walz IS retarded",
                "author": "ChimpanzeeFatigue"
            },
            {
                "raw_content": "Joyless is such a feckless cunt. Zero place to question anything about Trump's health after four years of pretending Joe was okay. No acknowledgement of the public schedule Trump keeps, as opposed to Biden's perpetual lid. Is it time for her to get another booster?",
                "author": "Pederella"
            },
            {
                "raw_content": "Stephen A Smith blows with the wind. He was rabidly against Trump not long ago but unlike the other grifters he knows when to jump ship. It is fun seeing those dried up olde crones looks of misery and distaste tho.",
                "author": "SquiggyMcPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senate GOP files to BULK confirm 97 Trump nominees all at once. Great! GET IT DONE!",
        "score": 1291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they could have done this the entire time?",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "This is just so incredibly pathetic that we are still waiting on these losers to simple confirm Trumps nominees. At this rate they might almost be halfway through confirming his nominations by the time he leaves officer in 2028. There is NO WAY that even these Republican slugs are doing anything but intentionally delaying Trump at this point.",
                "author": "Rakkasan91b"
            },
            {
                "raw_content": "This would be a better outcome than recess appointments. With the pain that the senate remaining open the way they did, it would have caused recess appointments only good until 2027. If instead, they get these 97 appointments done like this, then they will last until 2029 and we don't have to fight the next Congress. We need to be realistic, we don't know what will happen at the midterms. We need to treat this as Trump's last year, so we need to get as much done in the next year. I'm not dooming here, I'm just being realistic that we don't know what is going to happen, and we can't gamble on that... get passed now everything we can.",
                "author": "Trump-16-20-24-28-32"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⚖️ 𝐁𝐑𝐄𝐀𝐊𝐈𝐍𝐆: Democrat New Orleans Mayor LaToya Cantrell has just been 𝙄𝙉𝘿𝙄𝘾𝙏𝙀𝘿 by a federal grand jury after an FBI investigation for CORRUPTION...",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is it always black women?",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "this means nothing unless she’s convicted & sentenced.",
                "author": "bearhugprolapse"
            },
            {
                "raw_content": "Corruption in New Orleans ? Who would have guessed.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PICTURED: Alleged Jan. 6 D.C. pipe bomber Brian Cole Jr.",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How did a 5’5” white woman transition so quickly",
                "author": "guns_and_butter"
            },
            {
                "raw_content": "Press d for doubt.",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Fuckin' Erkel?",
                "author": "UntakenUsername"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somalians didn't build the USA. They didn't even build Somalia.",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love these elite in the bubble people. If it weren't for his dad he wouldn't be anything.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "stiller you say?",
                "author": "Raetchel"
            },
            {
                "raw_content": "You know how all those Somalians were in the Continental army and storming the beaches of Normandy on D Day.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dakota Native Whistleblower sounds the horn - major food production plants in Minnesota have brought in Somalians who defecated & urinated everywhere.",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can attest this is true. I used to do industrial flooring and quite a few chicken plants had signs everywhere in Spanish telling them to not use their hands to wipe their ass, not to piss or shit in corners, not to toss toilet paper they used to wipe their ass on the floor, to wash their hands and to take off their work gloves before using the restroom and put a new pair on after they used the restroom. Now think of why they had to spell that out. They were literally wearing gloves while wiping their asses with their hands and hopefully at least rinsing them off before returning to work.",
                "author": "2021is1776-2"
            },
            {
                "raw_content": "the median IQ of Somalians is even lower than that of US ghetto noggas, they are the noggas of noggas",
                "author": "cyberwar"
            },
            {
                "raw_content": "yea, F this moron he sounds like a democrat. Anyone coming here should abide by our standards. If it means not shitting and pissing in or near our food supply, then that is what they should do if they want to be here.",
                "author": "thedscpede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨 Our GOP has had the majority in Congress for 336 days and not 1 secure election law has been passed. They are useless.",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that's the plan",
                "author": "Raetchel"
            },
            {
                "raw_content": "They need to start being found disemboweled hanging off bridges until their treasonous compatriots get the fucking message that their treasonous do nothing bullshit isnt going to be tolerated anymore, im not joking either the gop traitors need to be woken up in the twilight hours and desperately fight to get their families out of their burning homes. If they insist on dragging their asses and not doing what we command them to do then they need to start being killed brutally until the rest get in line and do their fucking jobs. The time for playing nice has passed, the time for grace is over, we are out of time and can no longer tolerate the failure to act, they either need to do what we put them there to do or they need to be slaughtered one by one until the rest get the fucking hint.",
                "author": "RedPillosopher1776"
            },
            {
                "raw_content": "Uniparty. Business as always.",
                "author": "Grond999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is now posting that we only have two options \"Deport every single 3rd world migrant, illegal alien and America hating Visa holder...\" \"...or surrender your nation the way the UK have, and watch your society collapse in the coming years.\"",
        "score": 571,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No shit we knew this in 2016. Fucking do something about it.",
                "author": "Elencher"
            },
            {
                "raw_content": "This is a winning issue for 26",
                "author": "Tailgunnerjoe"
            },
            {
                "raw_content": "But 90 million H1b is totally kosher.",
                "author": "Toecutter7N6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dem Senator Warner Joins Seditious Chorus: \"Military May Help Save Us\" From Trump",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As long as Trump and his admin don't do shit but truth and tweet and show up on Fox News about it, nothing will change.",
                "author": "surgeriot"
            },
            {
                "raw_content": "**Seditious 7** - Chris Deluzio (Pennsylvania's 17th Congressional District) - Chrissy Houlahan (Pennsylvania's 6th Congressional District) - Elissa Slotkin (Michigan Senator) - Jason Crow (Colorado's 6th Congressional District) - Maggie Goodlander (New Hampshire's 2nd Congressional District) - Mark Kelly (Arizona Senator) - Mark Warner (Virginia Senator)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Hey Warner ! Why don't you do it yourself you treasonous fuck ! HONK HONK, how is that slimy scumbag not impeached for that statement alone ???????",
                "author": "Justlooking250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Man in Idaho wins free beer for a month at local bar after reporting a State Rep for hiring illegals.",
        "score": 758,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I believe every politician is a dirt bag.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Did she just state that only colored people work illegally?",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "In a MAGA hat!",
                "author": "RocketSprocket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD isn't increasing prices on CPUs, at least for now — Ryzen appears to be safe from the AI hysteria",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No reason to buy a new cpu when you have to sell a kidney for ddr5 ram",
                "author": "DrBhu"
            },
            {
                "raw_content": "I've been holding onto my used ddr4 for no reason for the last 2 years. Turns out maybe being lazy and waiting actually benefited me.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "If the demand for these in data centers was actually there wouldn't the prices have raised already?",
                "author": "Heroic_Lime"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Sandisk and Samsung Delay NAND Shipments, Transcend Left Without Supply Since October",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NAND/DRAM Winter is coming",
                "author": "No-farts"
            },
            {
                "raw_content": "TL,DR: Memory and Flash shortage as everyone who makes flash and memory chips are selling it to the highest bidder (aka, the AI data centers and the companies that supply them). Thus smaller vendors like Transcend are not able to obtain stock.",
                "author": "ML7777777"
            },
            {
                "raw_content": "I bought a bunch of 4TB nvmes and 80GB of ram at rock bottom prices over a year ago and now I'm wondering whether I should sell it all to pay off my mortgage.",
                "author": "irrealewunsche"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron exits consumer RAM, is the DIY PC culture at risk?",
        "score": 177,
        "text_content": "Recently I read this article on CNBC - \"Micron said on Wednesday that it plans to ***stop selling memory to consumers*** to focus on providing enough memory for high-powered AI chips.\" This coupled with the recent shortages of RAM for consumers and subsequent rise in their prices has got me worried. If this trend continues and AI race actually takes off, where does that leave normal PC enthusiasts / DIY culture that started in 1980's. We can't assemble computers without RAM, SSDs or GPUs. Plus, the recent thrust by both Intel and AMD to go for APU / integrated architecture makes me believe that the industry is pushing consumers towards locked hardware that cannot be customized, and we all would eventually be forced to use NUCs or laptops that come with soldered RAM and CPU or even worse, integrated SOC with GPU. If that is the world we are being forced into, I think we may need an alternate way getting these components. I don't know what the way could be forward, but breaking up of monopoly of few big companies like Microsoft and NVidia can certainly help. Would love to know your views on how this thing will eventually play out. Do you think that this AI bubble will eventually pop bringing normalcy or can this bring out seismic shift in how we see computers?",
        "comments": [
            {
                "raw_content": "I used to be a call center tech for them 13 years ago, based in the US. The writing has been on the wall for Micron closing Crucial for over a decade now. Even then, we had the perception that Crucial was like 1% of their business and an afterthought. They were also the owner of SD Card manufacturer Lexar, before they sold it to a company in China maybe 8-10 years ago. Same thought process, it was just even smaller of a piece of their business. Then maybe 6 years ago they moved Crucial's customer service out of the US, so more fat trimming. Crucial finally closing is just a business efficiency decision, and they can focus more on B2B so that other companies can sell consumer products.",
                "author": "MrMusAddict"
            },
            {
                "raw_content": "Perfect time for the Chinese to move right in. In no time the Triplopoly will be broken.",
                "author": "neverpost4"
            },
            {
                "raw_content": "Things are bad, and we are entering a period of likely further global turmoil. Companies all want a slice of the AI pie, even if it dooms us all. I joked somewhere else that if someone could make a bio-reactor, Kellog's and Nestle would probably start making food to feed them, so we could spin up more AI compute hardware. When the AI bubble bursts, just remember which companies left us hanging.",
                "author": "Tex-Rob"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AWS introduces Graviton5—the company’s most powerful and efficient CPU",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Wow, that is kind of quick. Graviton4 released December 2023. Right on the heels of the Cobalt 200 (Neoverse V3). I guess they use this capacity as a hyperscaler: https://www.networkworld.com/article/3631134/graviton-progress-50-of-new-aws-instances-run-on-amazon-custom-silicon.html EDIT: Dec 2023 was 2 years ago lol. Thanks OP: https://fuse.wikichip.org/news/7633/amazon-debuts-4th-gen-graviton/",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "I was trying to find microarchitectural specs of the Graviton5, but came up dry. Only specs I found was basically 192 cores, 3nm node, \"5x larger cache\". How about decode & execution width? Actual cache sizes (L1, L2, L3)? Operating frequency? Etc.",
                "author": "anders_hansson"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ancient 3dfx Voodoo2 graphics card coaxed into working in modern AMD Ryzen 9 9900X-powered Windows 11 system — 12MB relic from 1998 successfully runs Quake 2 but crumbles in SLI configuration",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, PCI to PCIe bridges exist. Of course the impressive part is getting the driver running in modern Windows.",
                "author": "jenny_905"
            },
            {
                "raw_content": "its a feat of engineering for a modern kernel to continue to work with a driver compiled in 2006",
                "author": "randomkidlol"
            },
            {
                "raw_content": "That's a blast from the past.",
                "author": "wtf_com"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US mulls letting Nvidia sell H200 chips to China, sources say",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“US tells NVIDIA they can sell H200 chips to China, if their bribe is the right price”",
                "author": "USPS_Nerd"
            },
            {
                "raw_content": "I thought China said they didn't want them, and actually wanted to ban them.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Maybe get rid of that stupid sanction policy all together as it hurts everyone yet never caused any intended political changes?",
                "author": "Teftell"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AWS Trainium3 Deep Dive | A Potential Challenger Approaching",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Idk if people should be posting sa stuff with the kinda drama and accusations they've been involved in recently lol.",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Metroid Prime 4 sure is a looker",
        "score": 681,
        "text_content": "Few screens from my early travels",
        "comments": [
            {
                "raw_content": "Yeah it's beautiful. Goes to show that good art direction can really make a game look amazing. Also, the HDR is actually really amazing in this game. This is the best that a Metroid game has ever looked.",
                "author": "GarionOrb"
            },
            {
                "raw_content": "Legit shocked when I fired this up on my 55” LG G4 OLED tv in my bedroom. I could not get over this was running on a Switch 2. It looks and runs incredibly well. Some kind of wizardry going on here! 💯 This puts me more at ease with future Switch 2 releases. I really want the next Zelda to use the art style they showed with the Wii U tech demo running.",
                "author": "BeavisButtknocker"
            },
            {
                "raw_content": "I just got the game today...I couldn't put it down...for a Switch 2 game besides Donkey Kong, it's drop dead gorgeous. Plus I like the puzzles, and gameplay",
                "author": "arbiter_steven"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Switch 2 is officially a half year old today",
        "score": 73,
        "text_content": "What are your thoughts on this console?",
        "comments": [
            {
                "raw_content": "send out the crunchyroll update for S2",
                "author": "princepwned"
            },
            {
                "raw_content": "i've played it every day for six months i like it",
                "author": "TiocStudios"
            },
            {
                "raw_content": "Only thing I can complain about is still no youtube after all this time",
                "author": "grey03456"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "About 5 hours in and I’m loving this game guys. I get what the reviews are saying but this is exactly what I wanted. Modern Metroid Prime and I got it",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glad you are enjoying it. I am not picking up Prime 4 just yet because I decided to make it the big game for my Christmas list this year but I am excited",
                "author": "Wolfgabe"
            },
            {
                "raw_content": "It’s honestly amazing!",
                "author": "Averys1"
            },
            {
                "raw_content": "Just played about an hour or two, it's very fun so far and the first NPC you meet isn't so bad, doesn't get in the way or anything The music, the ambiance, the scenery, so good. Finally have a switch game to play after dropping ZA",
                "author": "sharpbeer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pikmin 4 might be getting a Switch 2 free update",
        "score": 229,
        "text_content": "It's on the eShop right now and they put it next to the other titles that have gotten the same treatment... Announcement imminent?",
        "comments": [
            {
                "raw_content": "oh yeah just saw that. nice observation!",
                "author": "namcrg"
            },
            {
                "raw_content": "The only thing that makes me skeptical is the free update they did in November. If they were about to have a switch 2 update - why not wait to include it altogether?",
                "author": "quentinia"
            },
            {
                "raw_content": "Please please please please please please please please please please",
                "author": "Otherwise-Music-8643"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "4 cakes!",
        "score": 933,
        "text_content": "Why did Octopath Traveller 0, Sonic Crossworlds Switch 2 edition, Metroid Prime 4 and a Mario kart update all release on the same day?! Plus Red Dead Redemption and Assassin’s Creed Shadows a couple of days earlier!",
        "comments": [
            {
                "raw_content": "how do you like sonic racing?",
                "author": "nowaysorbet"
            },
            {
                "raw_content": "bro you're NOT Gonna have time to play all of these 😭",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "Wait... did the Mario Kart World update actually add some new content? You're kinda suggesting it did, but I'm prepared to be disappointed... 🤔",
                "author": "seadcon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Time to wheel this back out!",
        "score": 647,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Metroid Prime 4 OUT NOW” https://preview.redd.it/lihvnzprv75g1.jpeg?width=1280&format=pjpg&auto=webp&s=378115ef2e041a3ba667f67ebe2635b768bef6d4",
                "author": "Real_human27"
            },
            {
                "raw_content": "Who's laughing at them now huh! They don't have to change the ads today.",
                "author": "Mayoo614"
            },
            {
                "raw_content": "LMAO",
                "author": "eleazar0425"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Am I doing this right? (Metroid Prime 4)",
        "score": 163,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's the only way to play it.",
                "author": "linkling1039"
            },
            {
                "raw_content": "You need a real motorbike for whenever you're in the desert area",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "Depends. Do you have the ability to jump? 🤔",
                "author": "GerbiJosh"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Such a gamble ordering from Amazon",
        "score": 125,
        "text_content": "Had games delivered first thing in the morning before, but this one isn't looking like it's gonna make it today 😞 Think I'll go Walmart next time",
        "comments": [
            {
                "raw_content": "As someone who was once a delivery driver - it’s peak season, man. The drivers are working 12 hour shifts with 300+ packages each - the delivery time estimates are all over the place from Halloween until after Christmas.",
                "author": "Calzender"
            },
            {
                "raw_content": "Bestbuy screwed me too. They didn't ship it until this afternoon and won't be here till Saturday",
                "author": "StelthyNinja15"
            },
            {
                "raw_content": "This is why I don’t preorder games. The stores aren’t going to run out so I might as well just buy it on Day 1. Prime Remastered was missing on Day 1 though but that was a freak anomaly.",
                "author": "wheredatacos"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "According to sources, Netflix just won the Warner Bros. bid.",
        "score": 689,
        "text_content": "https://deadline.com/2025/12/netflix-wins-bidding-for-warner-bros-discovery-1236637057/ Edit: this bid does not include wb discovery's linear tv assets or any of wb game studios",
        "comments": [
            {
                "raw_content": "![gif](giphy|11tTNkNy1SdXGg) Live look at David Ellison before he threatens them again.",
                "author": "Chessh2036"
            },
            {
                "raw_content": "If this is true, does HBO Max just get deleted and moved into Netflix?",
                "author": "ninjupX"
            },
            {
                "raw_content": "Hopefully the gaming division sold elsewhere, would be suck if it's sold to netflix Especially after Spry Fox got their independence back.. surely they're just exit the gaming business altogether",
                "author": "rickreckt"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shenmue IV Teaser Potentially Leaked",
        "score": 340,
        "text_content": "Huge grain of salt with how long this video is, but: https://www.reddit.com/r/Shenmue/s/ARWQ8esCaa >This was posted on the Shenmue Dojo forums... > >https://www.shenmuedojo.com/forum/index.php?threads/shenmue-iv-trailer.5872/ > >Holy shit... please be real! This has so much hype in it. Damn.",
        "comments": [
            {
                "raw_content": "The general consensus is that this is AI generated, setting this to False unless it's proven true at The Game Awards",
                "author": "ImAnthlon"
            },
            {
                "raw_content": "I wanted Shenmue 3 for so long. Every e3 I would wake up and say \"this is the year\". Then I got it. After years of waiting I got it. And now I'm happy to say, that franchise can stay dead",
                "author": "GraveyardKoi"
            },
            {
                "raw_content": "He still wont defeat Lan Di in this one",
                "author": "Adipay"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Romeo Is a Dead Man release date leaked via PlayStation App, releasing February 11th, 2026.",
        "score": 328,
        "text_content": "https://xcancel.com/HazzadorGamin/status/1996635093990101361",
        "comments": [
            {
                "raw_content": "Too bad February 14th is a Saturday next year, would've been a good fit with Romeo in the title.",
                "author": "Meitantei_Serinox"
            },
            {
                "raw_content": "I’m gonna need this game to have a physical release day one",
                "author": "Odd_Revolution_1056"
            },
            {
                "raw_content": "Man, This one, Nioh 3 and RE9 all out in February is fucking insane. I simply will not have the time (or the money for that matter) haha",
                "author": "cdaffron"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New RE 9: Requiem leaks from 4Chan",
        "score": 533,
        "text_content": "[Link](https://boards.4chan.org/vg/thread/548330146/resident-evil-9-requiem) > Grace Ashcroft is the main protagonist of the game. > Alyssa Ashcroft is the stalking creature shown in the demo. After her death in the prologue, her body is taken by Victor Yurichenko, one of the villains of the game. > Victor Y. has two assistants: a girl named Ellen and his henchman, nicknamed “Palach.” > Leon S. Kennedy will participate in the game in two distinct phases: first in the search for the alleged villain Victor, investigated by the United States government for his connection to Operation Elpis, which seeks secret groups linked to the past of Umbrella and Raccoon City. The second part of Leon's participation will be later in the plot, in the rescue of Grace Ashcroft. > Yoko Suzuki and Claire Redfield have minor roles in the story. During the game, Jill Valentine and Sherry Birkin are mentioned as important survivors of the Raccoon City incident. > The game has about 6 main bosses, 3 of which are faced by Leon, and the other 3 by Grace. > Some creatures such as Lickers, G-Types, and Drain Deimos return with a more deteriorated appearance and minor mutations. > The virus in the game is called Elanthropus, derived from Victor Yurichenko's research on mold and the progenitor virus. The virus maintains the host's consciousness in some infected individuals, causing exaggerated transformation in others. > The game has about 18 hours of campaign play, and will also feature an extra mode similar to mercenaries mode. > The Connections will play a surprise role in the game, helping Leon to find Grace and stop a large infection in Rhodes Hill. The info about Leon's campaign seems to match what Dusk Golem said (his campaign being set mostly in the past, him rescuing Grace, etc...). As always, it's 4chan. Take the info with a pinch of salt.",
        "comments": [
            {
                "raw_content": "The monster being Grace's mom wouldn't surprise me but I kind of hope its just some monster",
                "author": "GhostofSparta4243"
            },
            {
                "raw_content": "\"Grace Ashcroft is the main protagonist of the game\" Holy moly!!!",
                "author": "OwnAHole"
            },
            {
                "raw_content": "18 hours seems hella long for a casual RE playthrough. Rest seems plausible but the fact that it's from 4chan makes it questionable.",
                "author": "iiniVijuY"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Weekend is seemingly teasing something Sonic related. Remember that the Game Awards are next week.",
        "score": 282,
        "text_content": "Here's the link to the post on Twitter. https://xcancel.com/ODrightbesideme/status/1996247472293785623?t=2Uo90YNGiTJEmA_TL14y7w&s=19",
        "comments": [
            {
                "raw_content": "What tier are Saturday & Sunday",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Prepare yourselves for Blinding Lights over the final boss/super sonic section",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "Sonic Heroes Remake please",
                "author": "WicaAcnologia"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A Pikmin 4 switch 2 edition might be coming",
        "score": 157,
        "text_content": "https://www.reddit.com/r/Pikmin/s/MSTQpBUGpd",
        "comments": [
            {
                "raw_content": "This suggests a free Switch 2 Update, not a Switch 2 Edition",
                "author": "SPARKisnumber1"
            },
            {
                "raw_content": "checked the eshop and yup its there; probably accurate to label this a \"leak\" could easily just be a mistake since the game got a free switch 1 update recently and it could've just been put in the wrong place or maybe a switch 2 performance update does exist and it simply got delayed to launch after the content update? who knows",
                "author": "TiocStudios"
            },
            {
                "raw_content": "One of the best looking games on switch, would be very happy to see this at a higher res",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The supposed Hytale leak",
        "score": 143,
        "text_content": "The leak is hosted on codeberg (https://imgur.com/a/FCwk6PT) and might be a decompilation, as \"...it has no comments\" like X/Twitter user @/peter0x44 suggests. Lmk what you guys think. (I will NOT be sharing any direct links to the leak here but you can easily find it, beware of any suspicious activity on fake repos)",
        "comments": [
            {
                "raw_content": "That GitHub name lmao. thehacker1234943. This guy's fuckin dangerous.",
                "author": "CarbVan"
            },
            {
                "raw_content": "Looked a little at the source code and it appears to be the Riot Games version, not the old Java engine that they are using again. Assets aren’t included so this isn’t playable.",
                "author": "__-_------___---"
            },
            {
                "raw_content": "Pretty silly that it took 10 years for the game to leak barely a month ahead of its public release.",
                "author": "TemptedTemplar"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Five player squads are LIKELY coming to Fortnite Soon",
        "score": 18,
        "text_content": "Epic added a sub link code to the data of the BR playlist with \"playlist\\_defaultquints\" ID! The data of this playlist also confirm that 5 players can be in a team. [Source](https://xcancel.com/Fecooo_/status/1996365066212696385?t=Aiz83xhBxhWPBUspV32zCQ&s=19)",
        "comments": [
            {
                "raw_content": "Finally, we can recreate the Scooby Squad killing the Mighty Morphin Power Rangers.",
                "author": "guineapigtacosauce"
            },
            {
                "raw_content": "four player squads are already enough of a mess honestly. i don’t know how well this is going to work out despite that though if this isn’t in ranked then it’s just going to be shiiiit loads of bots every match",
                "author": "blitz_na"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ASRock puts extra DDR4 slots to its DDR5 H610M COMBO motherboard",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is sad",
                "author": "user74947"
            },
            {
                "raw_content": "I think we already had that back then on some mobos... Very very back then...",
                "author": "ByteEater"
            },
            {
                "raw_content": "*okay then!* when i asked for triple channel ram as a stopgap, this is not what i ment.",
                "author": "pyr0kid"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD CEO Lisa Su Says Concerns About an AI Bubble Are Overblown",
        "score": 564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Person / company benefiting massively from AI says the AI Bubble is not real",
                "author": "RoyJonesJr2001"
            },
            {
                "raw_content": "“We’re all paying each other billions of dollars in an unsustainable round-robin circlejerk that boosts our stock based on the promise that someday it’ll be profitable and maybe even useful! What could possibly go wrong? Why would investors ever stop giving us money?”",
                "author": "CranberrySchnapps"
            },
            {
                "raw_content": "Paraphrasing \"A large part of the income of the future will depend on AI not being a bubble.\" Yes, so why asking the question, if one exactly knows the answer already?",
                "author": "LastRedshirt"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D has 120W TDP, shipping manifests confirms",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Looks like it should be great for people with low end amd5 cpu to upgrade to. It won't be good for people with am4 cpus though considering 32GB of ddr5 would cost just as much as the CPU.",
                "author": "Shadow-Nediah"
            },
            {
                "raw_content": "My 9800x3d is chilling with a 61w PPT and -40mv undervolt, nearly stock perf in games and ~10% worse in absolute worst case fully maxed muticore stress tests.",
                "author": "WuWaCamellya"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD adds Win 5 MAX+ 395 \"Strix Halo\" gaming handheld with 128GB memory at $2,653",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The ram is probably 1,500 of that",
                "author": "thelastsupper316"
            },
            {
                "raw_content": "Literally who is this for?",
                "author": "Agentfish36"
            },
            {
                "raw_content": "I guess it's for people who want a handheld to do Local Ai, That's an.... interesting combination",
                "author": "Ravere"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Insiders Dismiss Rumored AMD Ryzen 9000 CPU Price Hikes",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "> neither source is affiliated with AMD So just more speculation, then. Not sure I would call these people \"insiders\" when they have no more info than anybody else.",
                "author": "deadpanloli"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen AI 5 430 quad-core \"Gorgon Point\" mobile APU spotted with Radeon iGPU upgrade",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Nothing much to be excited about, since Gorgon Point is just a Strix Point refresh. You get slightly higher clocks but otherwise it's mostly the same.",
                "author": "CatoMulligan"
            },
            {
                "raw_content": "If these rumors are true, I am wondering why they haven't moved onto RNDA 4 based iGPs instead of the RDNA 3.5 they've been using for a while. Makes me wonder if they are just waiting for RDNA5/UDNA before updating their iGPs.",
                "author": "Hero_The_Zero"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Launches SU45P and SU60P Spartan UltraScale+ FPGAs",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Fed Rate Cut Is Likely Next Week, but Don’t Expect Mortgage Rates To Budge",
        "score": 135,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Agree. We’re already 50bps less on Fed rates than we were in the first half of 2025, meanwhile, the 10YR treasury has moved only slightly downward, which is what the 30 year mortgage rate is closely tied to. We’ve been just at 400bps on the 10YR yield, but we’re well back above that now. OBLIGATORY REMINDER: the housing crisis is not all about rates. It’s about home prices that have become disconnected from the greater economy, similar to stock prices.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Instead of margins compressing , you’re going to see record profits",
                "author": "highrollerbob"
            },
            {
                "raw_content": "Need a risk off trade in the equity market so institutions pile into safety, i.e. T Bonds, lowering Treasury yields, lowering 30 year mortgage rates then I can stop hating myself whenever I get my 6.99% mortgage rate statement.",
                "author": "AndreLinoge55"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "🤣",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This millennial decided to just jump in and buy a house a couple months ago, and not upset about my decision in the long run. I do enjoy these doomer posts though",
                "author": "SlimWorthy"
            },
            {
                "raw_content": "I heard rents have dropped 1%. The collapse is happening.",
                "author": "PinkHydrogenFuture7"
            },
            {
                "raw_content": "Using FRED median home sale price data, a 2008 level crash from the latest peak pricing would only place prices back where they were in Q1 2021. In all likelihood, if you would have needed a crash in 2021 to be able to afford a home, you still wouldn’t be able to afford one even with a 2008 level crash. I know that it not what people want to hear, but waiting for a crash is not the solution to getting into a home that some people think it is.",
                "author": "CommercialOrganic573"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Layoff announcements top 1.1 million this year, the most since 2020 pandemic, Challenger says",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KEY POINTS * Challenger, Gray & Christmas said layoff plans totaled 71,321 in November, a step down from the massive cuts announced in October but still enough to bring the 2025 total up to 1.17 million. * The most-cited reason for the month was restructuring, followed by closings and market or economic conditions. Announced job cuts from U.S. employers moved further ahead of 1 million for the year in November as corporate restructuring, artificial intelligence and tariffs have helped pare job rolls, consulting firm Challenger, Gray & Christmas reported Thursday. The firm said layoff plans totaled 71,321 in November, a step down from the massive cuts announced in October but still enough to bring the 2025 total up to 1.17 million. That total is 54% higher than the same 11-month period a year ago and the highest level since 2020, when the Covid pandemic rocked the global economy. In November, Verizon’s announcement that it would slash more than 13,000 jobs helped drive the total. Tech companies, driven by innovations in artificial intelligence, listed 12,377 reductions, pushing the sector’s 2025 total up 17% from a year ago. AI itself has been cited for 54,694 layoffs this year. Tariffs were cited as the driver of more than 2,000 cuts in November and nearly 8,000 year to date. The most-cited reason for the month was restructuring, followed by closings and market or economic conditions. “Layoff plans fell last month, certainly a positive sign. That said, job cuts in November have risen above 70,000 only twice since 2008: in 2022 and in 2008,” said Andy Challenger, workplace expert and chief revenue officer at Challenger, Gray & Christmas. Challenger also pointed out that since the financial crisis in 2008, companies have shifted away from end-year layoff announcements. “It was the trend to announce layoff plans toward the end of the year, to align with most companies’ fiscal year-ends. It became unpopular after the Great Recession especially, and best practice dictated layoff plans would occur at times other than the holidays,” said Challenger. November offered some relief from the more than 153,000 cuts announced in October, which was the highest total for the month in 22 years. The numbers come with concerns rising over the state of the U.S. labor market. ADP reported Wednesday that private employers cut 32,000 jobs in November, the biggest decline in more than 2½ years. Hiring prospects have been dim this year as well, according to the Challenger report. Employers have announced 497,151 planned hires, off 35% from the same point in 2024. Despite signs of weakness elsewhere, Labor Department data has yet to reflect a surge in layoffs. The department on Thursday reported that weekly jobless claims unexpectedly tumbled to 191,000, the lowest in more than three years. Official data showed the decline of some 27,000 from the prior week was driven by unusually large drops in California and Texas and likely was influenced by the Thanksgiving holiday.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "They just said unemployment was the lowest level since 2022. Guess someone’s lying huh?",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "If it wasn’t for AI, the entire economy would be in the trash can",
                "author": "highrollerbob"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why do housing crashes cause the age to jump up?",
        "score": 20,
        "text_content": "Counterintuitively, it seems housing crashes actually make housing less affordable for young people.",
        "comments": [
            {
                "raw_content": "Typically associated with unemployment spike",
                "author": "jetsknicks25"
            },
            {
                "raw_content": "Lending tightens up and interest rates are generally higher.",
                "author": "LAndoftheLAke"
            },
            {
                "raw_content": "Because the knee-jerk response since '08 is to bail everyone out and have the Fed+Treasury print trillions of dollars of money. This ends up nuking the purchasing power of anyone not already holding assets.",
                "author": "i860"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lowest Initial Jobless Claims Reading Since 2022",
        "score": 89,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No government interference here….anyway BOOMING ECONOMY",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "I bet they used a statistical model called lying",
                "author": "Illustrious-Tap8069"
            },
            {
                "raw_content": "Guess they’re counting Onlyfans , Influencers and and DoorDash as real jobs now because there’s no fucking way. Oh wait yes there is , my bad, they’ll just revise it down 900,000+ again in a few months",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Realtor.com 2026 Forecast: Mortgage rates will average 6.3%, Nationally, home prices rise modestly by 2.2%",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol. Yea, sure.",
                "author": "ErictheAgnostic"
            },
            {
                "raw_content": "6.3% would continue to push down prices in some HCOL and VHCOL areas. 2.2% may represent a national median home price increase, but regional downward movement would continue. Areas with $10k+ PITI for median priced homes will have to continue to price correct. There just aren't enough buyers at that income level (or cash level to avoid it). Not to mention all the \"date the rate\" that will be going into year 4 of high rates without the ability for substantial refi opportunities in these areas.",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "Realtor.com",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Good news: Buying a home might actually be more affordable in 2026",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Narrator: it wasn’t",
                "author": "h0usebr0k3n"
            },
            {
                "raw_content": "Linking article explaining why they think it will be more affordable and it’s not because home prices will drop …. https://www.redfin.com/news/housing-market-predictions-2026/",
                "author": "cusmilie"
            },
            {
                "raw_content": "Hah, stuff your fluff pieces of realtor propaganda. Just wait for the upcoming housing crash",
                "author": "DasKleineFerkel25"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Cotality: House Price Growth Slowed to 1.1% YoY in October",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Top 10 hottest markets** - 15.0% Terre Haute, IN - 13.0% Youngstown, OH - 11.6% Muncie, IN - 10.6% Muskegon, MI - 10.0% Fond du Lac, WI - 10.0% Kokomo, IN - 10.0% Pittsfield, MA - 9.2% Grand Island, NE - 9.1% Lima, OH - 8.8% East Wenatchee, WA **Top 10 coolest markets** - 10.6% Champaign, IL - 8.9% Punta Gorda, FL - 8.4% Wichita Falls, TX - 8.0% Victoria, TX - 6.9% Cape Coral, FL - 6.5% Sebastian, FL - 5.9% North Port, FL - 5.5% St. Petersburg, FL - 4.9% Waco, TX - 4.9% Brownsville, TX",
                "author": "SnortingElk"
            },
            {
                "raw_content": "So everyone on this sub that has been waiting for years for prices to crash is buying in Texas now, right? If not, why not?",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Overview - Year-over-year price growth continues its downward trend, only rising 1.1% in October 2025. - Price declines expanded from six of the 100 largest metros in January to 32 by October, marking the broadest softening of prices since the early 2010s. - Metropolitan areas that saw the largest slowdown in home price growth over the past year include Miami and St. Petersburg, FL; Rochester, NY; Las Vegas, NV; Seattle, WA; and Dallas, TX — all down six percentage points or more. Insights from Chief Economist Dr. Selma Hepp As 2025 draws to a close, we reflect on a year defined by moderation and shifting dynamics in the housing market. This year began with a stable growth trajectory, with national price growth posting an annual increase of 3.4% in January. However, that momentum slowed steadily as the year progressed. By October, annual appreciation was a mere 1.1% annual increase—the lowest rate since early 2012. \"The housing market in 2025 demonstrated remarkable resilience despite significant headwinds. Slowing price growth reflects a much-needed rebalancing after years of unsustainable gains. While some markets are experiencing declines, these adjustments will help restore affordability over time and make housing more accessible to a wider group of buyers,” said Cotality’s Chief Economist Dr. Selma Hepp. This deceleration highlights the impact of higher mortgage rates earlier in the year and persistent affordability challenges. Furthermore, price growth was dampened by a notable increase in inventory. Many markets saw a surge in both existing and newly built homes, slowing rates of in-migration and weakened demand. The robust price increases of 2022 when top metros — primarily in Florida and the Southeast — saw gains exceeding 30% has now given way to declines. At the start of 2025, only six metros — primarily in Florida — posted year-over-year drops. By October, that number surged to 32, as pricing downturns extended into Texas, California, and various states throughout the Mountain West. Even areas that did see appreciating price growth recorded muted gains. Appreciation trends among the top 100 metros varied widely. Rochester, New York led in January with a 9% annual increase, but by October, Bridgeport, Connecticut took the top spot with an 8% gain. “Looking ahead, regional differences will remain pronounced, with demand favoring areas that offer both economic opportunity and relative affordability. In general, home price growth is projected to remain below the long-running average of 4% to 5%. However, mortgage rates will play a critical role in shaping the 2026 housing market. A notable drop in mortgage rates combined with low supply could lead to a re-acceleration of price gains.\" -Dr. Selma Hepp Cotality’s Chief Economist",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5 generated the key insight for a paper accepted to Physics Letters B, a serious and reputable peer-reviewed journal",
        "score": 208,
        "text_content": "Mark Chen tweet: https://x.com/markchen90/status/1996413955015868531 Steve Hsu tweet: https://x.com/hsu_steve/status/1996034522308026435?s=20 Paper links: https://arxiv.org/abs/2511.15935 https://www.sciencedirect.com/science/article/pii/S0370269325008111 https://drive.google.com/file/d/16sxJuwsHoi-fvTFbri9Bu8B9bqA6lr1H/view",
        "comments": [
            {
                "raw_content": "When I read content from physics papers, I feel so incredibly dim.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "I’m a published scientist (did my undergrad in physics also), I believe it. It can do real frontier science and engineering, I’ve observed that myself. It’s still operator-dependent (eg, asking the right questions), you can’t just ask it to give you the theory of everything or the meaning of life, but it’s real when paired with someone who can verify. It’s been like this, especially with Pro, for awhile. I’m sometimes surprised at how many people don’t realize this. It also makes me question what we really mean by AGI and ASI.",
                "author": "hologrammmm"
            },
            {
                "raw_content": "Is there a tl dr for this? My brain smol",
                "author": "Darkujo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 \"Deep Think\" benchmarks released: Hits 45.1% on ARC-AGI-2 more than doubling GPT-5.1",
        "score": 738,
        "text_content": "Jeff Dean just confirmed **Deep Think** is rolling out to Ultra users. This mode integrates **System 2** search/RL techniques (likely AlphaProof logic) to think before answering. The resulting gap in novel reasoning is massive. *Visual Reasoning (ARC-AGI-2):* **Gemini 3 Deep Think:** 45.1% 🤯 and **GPT-5.1:** 17.6% Google is now *2.5x better* at novel puzzle solving (the \"Holy Grail\" of AGI benchmarks). We aren't just seeing **better** weights but seeing the raw power of inference-time compute. OpenAI needs to ship **o3 or GPT-5.5** soon or they have officially lost the reasoning crown. **Source: Google DeepMind / Jeff Dean**",
        "comments": [
            {
                "raw_content": "Why is opus not on here?",
                "author": "_WhenSnakeBitesUKry"
            },
            {
                "raw_content": "ARC-AGI-2 (called \"Novel problem solving\" in anthropic's blog) Gemini 3 Deep Think: 45.1% Opus 4.5: 37% But that's just one benchmark.",
                "author": "Previous_Pop6815"
            },
            {
                "raw_content": "We will see in short order. The rumors is that they are working on a model to compete . Also shipmas this month.",
                "author": "Ok_Elderberry_6727"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "BREAKING: OpenAI to build massive $4.6 Billion \"GPU Supercluster\" in Australia (550MW Hyperscale Campus by 2027)",
        "score": 71,
        "text_content": "OpenAI has officially signed a partnership with NextDC to build a dedicated **\"Hyperscale AI Campus\"** in Sydney, Australia. **The Scale (Why this matters):** This isn't just a server room. It is a **$7 Billion AUD (~$4.6 Billion USD)** project designed to consume **550 MegaWatts** of power. * *Context:* A standard data center is ~30MW. This is nearly **20x larger**, comparable to a small power station. **The Hardware:** They are building a **\"large-scale GPU supercluster\"** at the S7 site in Eastern Creek. This infrastructure is specifically designed to train and run next-gen models **(GPT-6 era)** with low latency for the APAC region. **The Strategy (\"Sovereign AI\"):** This is the first major move in the \"OpenAI for Nations\" strategy. By building local compute, they are ensuring **Data Sovereignty**and keeping Australian data within national borders to satisfy government and defense regulations. **Timeline:** Phase 1 is expected to go online by **late 2027**. **The Takeaway:** The bottleneck for AGI isn't code anymore,it's electricity. OpenAI is now securing gigawatts of power decades into the future. **Source: Forbes/NextDC Announcement**",
        "comments": [
            {
                "raw_content": "Australia is actually a great choice, while it seems nievely hot in reality it's a desert (lots of sun in the day but ground doesn't actually keep warm) also the main bottleneck of cooling is just energy which solar kind of solves. As an Aussie I welcome them to buy up a ton of GPUs then dump them all in a few years to buy the next one's 😉",
                "author": "Revolutionalredstone"
            },
            {
                "raw_content": "Kangaroo",
                "author": "Odd-Opportunity-6550"
            },
            {
                "raw_content": "They should invest all that money into making better and more efficient architectures instead of brute forcing AI by scaling compute that we don't have nor can afford ecologically... but sure let's dump billions or trillions of fake money into a dead end.",
                "author": "Professor_Professor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will Smith eating speghetti in 2025!!",
        "score": 637,
        "text_content": "This is absolutely mental how far we have come in this short period of time",
        "comments": [
            {
                "raw_content": "The second video would absolutely fool most people already",
                "author": "Beeehivess"
            },
            {
                "raw_content": "Will Smith needs to release a video of him eating spaghetti, so we have a reference to compare it to.",
                "author": "rwrife"
            },
            {
                "raw_content": "Love the Will Smith Index",
                "author": "Various_Software_817"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Deep Think now available",
        "score": 567,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can't wait to see if smart people can do something interesting with it",
                "author": "GraceToSentience"
            },
            {
                "raw_content": ">Available to Google AI Ultra subscribers ![gif](giphy|evVKsrjZEqVVWvE2VR)",
                "author": "Funkahontas"
            },
            {
                "raw_content": "Crazy how gemini 3 was topping charts and now I realize deep think wasn’t even out lol",
                "author": "Uvoheart"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Humanoid transformation",
        "score": 639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Horror mode",
                "author": "TheSn00pster"
            },
            {
                "raw_content": "the last thing you see in 2037 after saying something bad about the government",
                "author": "ThatIsNotIllegal"
            },
            {
                "raw_content": "Reminds me of the anime Blame https://i.redd.it/rpm9yx2ro85g1.gif",
                "author": "Unlikely-Complex3737"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA Shatters MoE AI Performance Records With a Massive 10x Leap on GB200 ‘Blackwell’ NVL72 Servers, Fueled by Co-Design Breakthroughs",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two main points here. Kimi K2 thinking is native int4; blackwell supports FP4 while hopper doesn't, so Nvidia translated int4 to fp4 for a big gain. Also faster interconnects on an extremely large MoE model matter.",
                "author": "jakegh"
            },
            {
                "raw_content": "The ELI5 (from Gemini): * Smarter AI, Faster: We will get AI that is much smarter (trillions of parameters) but still replies instantly, rather than making you wait. * Cheaper to Run: Since it's more efficient, it costs less electricity and money to generate answers. This could make high-end AI cheaper for everyone to use. * Real-Time Reasoning: Complex tasks that used to take too long for a chatbot (like analyzing a whole book or writing complex code live) might now become instantaneous. In short: NVIDIA built a specialized home for the specific type of AI architecture (MoE) that everyone is using today, and it makes that AI run 10x faster.",
                "author": "space_monster"
            },
            {
                "raw_content": "can it run doom?",
                "author": "bapuc"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Just one more datacenter bro",
        "score": 135,
        "text_content": "It seems they know more about how the brain computes information than many think, but they can't test models with so little [neuromorphic] compute.",
        "comments": [
            {
                "raw_content": "This is naive. Neuromorphic hardware isn’t starved of money it’s starved of ideas. We don't have an algorithmic theory of how the brain actually computes anything above the level of \"neurons spike and synapses change.\" We spent many years trying to recreate biological structure without understanding the computational abstractions behind it, and the result was decades of models that looked brain-like but didn’t actually do anything scalable.",
                "author": "ForgetTheRuralJuror"
            },
            {
                "raw_content": "Ornithologists didn’t invent the airplane. We don’t need neuroscientists to invent AGI",
                "author": "jaundiced_baboon"
            },
            {
                "raw_content": "My guess is the sheer compute is great enough now to run simulations of any other architecture at a smaller scale.",
                "author": "Chemical-Year-6146"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ronaldo x Perplexity was NOT on my bingo card",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there any remaining use case for perplexity? Seems like a very expensive dead man walking at this point",
                "author": "LessRespects"
            },
            {
                "raw_content": "https://preview.redd.it/ue4cy0dcg85g1.jpeg?width=1080&format=pjpg&auto=webp&s=9f51d4b6f0588206a6905002c7332ebc9c66e108",
                "author": "Tedinasuit"
            },
            {
                "raw_content": "Why would you listen to a footballer for AI? This is just marketing nonsense, similar to hiring actors to act in your product's ad. Ronaldo has done it for Binance and has done NFTs and what not, this is nothing new, it adds absolutely no credibility to Perplexity, but a transaction to increase their market reach. Pay Ronaldo his fee and he'd do it for your company too.",
                "author": "p5yron"
            }
        ],
        "subreddit": "singularity"
    }
]