[
    {
        "post_name": "All Government Agencies Hit Bluesky at once.",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha! I love the trolling!!",
                "author": "Sheffield_1776"
            },
            {
                "raw_content": "If we didn’t live in this insane clown world, I’d find this behavior distasteful. But I don’t, because these clowns deserve this and I applaud the approach.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "Oh the reeee they will be reeeeeeing",
                "author": "Pederella"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump is your King",
        "score": 395,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jesus is King of kings.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Nope. Jesus is.",
                "author": "Patriot_Dave"
            },
            {
                "raw_content": "ew don’t touch that barehanded",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How much will free busses in New York cost?",
        "score": 480,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ONE TREELION DOLLARS",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "They will need 10 times more busses because people simply won't get off them.",
                "author": "IamBACK"
            },
            {
                "raw_content": "I'd think people should avoid the busses in NYC during this fucker's rule, honestly. To me, it'd seem like going on one of those free busses would put yourself in extreme danger of getting Iryna'd.",
                "author": "TheJakeFroggy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ready for some mostly peaceful entertainment? 🍿",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# BROUGHT TO YOU BY PFIZER",
                "author": "ProtestantPatriot777"
            },
            {
                "raw_content": "I’m very tempted to join the protest. As an open Trump supporter - I totally agree America shouldn’t have a king, which is why Trump had to win the popular vote the electoral college the house and the senate. Thank you for your attention to this matter.",
                "author": "KnobGoblin"
            },
            {
                "raw_content": "I’m ready for the same 12 fat and old bitches showing up at multiple rallies thinking they are fooling the people. This is gonna be funny",
                "author": "Jakylangelo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This glorious day has finally arrived! Let the ceremonies begin as we celebrate, with great mirth, the coronation of our liege, King Donald!",
        "score": 498,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mock them, relentlessly.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "OK, Pelosi kneeling was a very nice touch.",
                "author": "cd3dog"
            },
            {
                "raw_content": "This is outstanding.",
                "author": "GBA4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: In a bombshell announcement, the Trump administration declared the 'National Farm Security Action Plan' which bans future Chinese Communist Party-linked farmland purchases, aims to reclaim existing land with executive actions and imposes fines up to 25% of land value.",
        "score": 1480,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lets do Bill gates now and any foreign country from owning any property.",
                "author": "T471"
            },
            {
                "raw_content": "The Red Chinese should never own an INCH of American Land. Change my mind.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Ban all foreign land purchases wtf?",
                "author": "America_No_1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Poland's new President Karol Nawrocki signs a bill exempting parents with two or more children from paying income tax. Poland is leading from the front.",
        "score": 1448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does the bill make it clear that this only applies to married parents? You have to make sure unmarried whores with multiple children don't take advantage of this.",
                "author": "Aquamine-Amarine"
            },
            {
                "raw_content": "if only our leadership were so concerned for our well being…",
                "author": "bearhugprolapse"
            },
            {
                "raw_content": "You know who else gave tax breaks to encourage having children? Hitler! he was also president of Poland for a while.",
                "author": "ESAsher"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Gutfeld: \"Having the No Kings event after Trump figures out Middle East peace is like holding a wedding after the couple broke broke off the engagement the night before!\"",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The left is pure evil. Never forget. Never forgive.",
                "author": "MasterChief08"
            },
            {
                "raw_content": "None of them actually believe their own bullshit. They just need something to get enraged about. They have to be offended and fight against oppression so they can feel like they have a purpose. I remember the occasional drama queen in k-12 long ago. But now, I feel like the percentage of the population that is emotionally fucked is much higher than the 80's/90's",
                "author": "LurkNoMore"
            },
            {
                "raw_content": "",
                "author": ""
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Dropped the F BOMB on National Television 💣💥💥 I voted for this!!! To the Venezuelan President — “He offered us EVERYTHING. Wanna know why? Because he doesn’t want to FUCK AROUND with the United States!” —",
        "score": 1095,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck venezuela.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "JD smiling like a little school boy! Epic",
                "author": "invalid_data"
            },
            {
                "raw_content": "Vance and Hegseth cannot hide their giggles Rubio maintains composure until he sees Hegseth and then the giggle escapes",
                "author": "spinometer2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Two Deep State Prosecutors in the Eastern District of Virginia FIRED and Escorted From Building For Leaking Following Letitia James Indictment",
        "score": 872,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why haven’t they been charged? Why would you allow people with access to “sensitive” information to just leave after they leaked it?",
                "author": "lefty295"
            },
            {
                "raw_content": "Nothing changes unless they are arrested and imprisoned.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Have we found out which cocksucker within the SCOTUS leaked the 'Roe vs Wade' memo?",
                "author": "knnbccb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has just COMMUTED the sentence of George Santos, who was sentenced to a RIDICULOUS seven years in prison",
        "score": 1500,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based move..... Eat shit libs!",
                "author": "baby_puncher"
            },
            {
                "raw_content": "They had him in solitary confinement. Sick bastards.",
                "author": "PresidentAutopen"
            },
            {
                "raw_content": "I loved listening to this goofball on tuckers podcast and the other few times I heard him talk. He voted right. The Dems have all kinds of demonic degenerates and our own party threw this guy out. I feel sorry for him and am disgusted in our party.",
                "author": "Schroeder09"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Truth about \"No Kings\"",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a pathetic ineffectual cry fest. I almost feel sorry for them.",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "We’ve been kingless since 1776",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "should have a No Queens protest to vocalize our fag fatigue",
                "author": "NADSAQ"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 BREAKING: The Trump White House just JOINED Blusky and absolutely TROLLED every leftist on the platform - Hakeem is wearing the sombrero again and President Trump is wearing a crown 🤣",
        "score": 1439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# I LOVE OUR PRESIDENT MORE EVERY DAY",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "“This is our safe space!!!!!!!!! No nazis allowed oh no I’m going to have to go back to mastodon!! Reeeee”",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "lmao you know they're(thx) seething",
                "author": "Twitter"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump has officially appealed to the U.S. Supreme Court to overturn an activist judge’s block on him deploying National Guard to Chicago. FINALLY! SCOTUS must reaffirm that President Trump is Commander-in-Chief. NOT some random judge.",
        "score": 1748,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they did that already judges ignore it and trump will not enforce it.",
                "author": "TOPDAWG23"
            },
            {
                "raw_content": "For fucks sake, start impeaching the judges.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "How many times does this need to be reaffirmed?",
                "author": "ChristiansAreIsrael"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Thank you to North Carolina’s incredible Republican State Legislators, who just introduced a new, fair, and improved, Congressional Map",
        "score": 1350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol rubbing their noses in it haha let the seething begin",
                "author": "America_No_1"
            },
            {
                "raw_content": "Dems have been gerrymandering the hell out of places like Illinois for decades and until recently there has been no response or pushback so they can eat shit about this.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Trump is coordinating and overseeing the systematic demolition and destruction of the Democrat Party and their method of control. By 2030, there might not even be a Democrat Party anymore.",
                "author": "Redpilled2Depression"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐸Night Shift Pepe Logging In🐸☕🚬",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome to the comfy show, boyos",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "Don't smoke that backwards",
                "author": "MyNameIsTaxpayer"
            },
            {
                "raw_content": "Friday Night Kings and Queens Only!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We hear we’re VERY POPULAR on Bluesky! (many people are saying) Give us a follow at homelandgov.bsky.social PATRIOTS! We must work together and appeal to their patriotic spirit and ask for a hand in stopping the Democrats’ government shutdown.",
        "score": 1254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy hell, the person running the DHS social media is going to make a fortune consulting when they decide to move on.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "they're gonna get banned by the end of the day",
                "author": "fluffykitten"
            },
            {
                "raw_content": "All the commie retards on that app are going to doxx themselves with their veiled threats and 'sperging out. Love to see it.",
                "author": "smaynar3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Trump has made an endorsement in his effort to unseat Thomas Massie in Kentucky: former Navy Seal and Army Ranger Ed Gallrein",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about unseating Lindsey Graham?",
                "author": "Petes_Agate_Israel"
            },
            {
                "raw_content": "Not happy about this - I don’t always agree with Massie but at least he asks questions and isn’t a rubber stamp like so many others - We need a voice like Massie",
                "author": "Steve1"
            },
            {
                "raw_content": "How about Susan Collins, Mitch McConnell, Lindsey Graham, All the fucking Rhinos in our Gov.",
                "author": "603taco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "After today’s meeting, President Trump tells BOTH Zelensky and Putin to “stop where they are, let both claim victory, let history decide! NO MORE, GO HOME TO YOUR FAMILIES IN PEACE!\"",
        "score": 1320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TRUMP!",
                "author": "YodaBannon"
            },
            {
                "raw_content": "I dont see Russia freezing the frontline.",
                "author": "raptoris2"
            },
            {
                "raw_content": "Nah. I want Russia to Win because it hurts NATO and WEF. And because Biden and Biolabs.",
                "author": "Mhmm2MoreWeeks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DOJ Fires DC Prosecutor Who Led Lawfare Prosecution of Dr. Peter Navarro",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boy that'll teach em alright. Meanwhile all the people they went after have had their lives ruined and are left with no real justice. No one's above the law except for the ones that actually are. Cough Epstein client list cough.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "WOMP WOMP",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Good. Man, could you imagine if Kamala rigged the election last year? None of this would be happening. Never again can we go back. We cannot under any circumstance hand power back to people that want us murdered. We need our leaders to never again hand power back to the Democrats while they act this evil.",
                "author": "MasterChief08"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel Foundry Reportedly Secures 18A Order from Microsoft for Maia 2 Accelerator",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a win for competition in the semiconductor fab world. I hope Intel continues to get external customers, maybe Nvidia will consider them for their more budget focused consumer lines instead of continuing shrinkflation on the more expensive TSMC.",
                "author": "Acrobatic_Fee_6974"
            },
            {
                "raw_content": "Techpowerup confuses 18A-P as having second gen RibbonFET and PowerVia. It doesn't. Those are for 14A.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "Intel is on one amazing rollercoaster. Can't wait to find out if they go under or become a world dominating chip manufacturer next week.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung will make chips for most Hyundai cars",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Leading Korean chipmaker makes chips for leading Korean car maker? Shocking news.",
                "author": "allthebaseareeee"
            },
            {
                "raw_content": "Infotainments using 8nm is kinda crazy. I would have expected something older like 12nm.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] AMD’s Chiplet APU: An Overview of Strix Halo",
        "score": 13,
        "text_content": "[https://old.chipsandcheese.com/2025/10/17/amds-chiplet-apu-an-overview-of-strix-halo/](https://old.chipsandcheese.com/2025/10/17/amds-chiplet-apu-an-overview-of-strix-halo/)",
        "comments": [
            {
                "raw_content": "Been waiting for C&C review on STX-H, mainly the memory subsystem. Memory latency isn't all that much different to regular Strix Point. In fact, it seems a regular a 9950X behaves better at \\~80ns compared to Halo's \\~123ns ([ref to their prev chart](https://i0.wp.com/old.chipsandcheese.com/wp-content/uploads/2024/08/granite_ridge_latency.png?ssl=1)). As for MBW, the trend continues for mobile and desktop counterparts. Desktop you have 32bytes/cycle read and 16 write, while Strix Point/Halo has 32 both ways. Infinity Fabric link runs at the same \\~2GHz like desktops. Read-modify-add ops across both CCDs sees a large 175GB/s of BW with reads at 124GB/s. In comparison the 9950X3D reads were [78GB/s](https://i0.wp.com/old.chipsandcheese.com/wp-content/uploads/2024/08/gnr_cluster_bw-2.png?ssl=1) (37% less or Halo being 59% more).",
                "author": "Noble00_"
            },
            {
                "raw_content": ">however AMD only just released preview support for Strix Halo in the ROCm 7.0.2 release which came out about a week ago from time of publication. AMD being their own worst enemy again. Nvidia almost never has this problem with CUDA yet AMD consistently can't get day 1 compute API support for new hardware working.",
                "author": "BlueGoliath"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel Reportedly Raises Prices Up to 20% for Intel 7-Based Raptor Lake, Alder Lake; Asia Market Hit Hard",
        "score": 206,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we stop raising the price of years old chips ? Please and thank you.",
                "author": "Arnaredstone"
            },
            {
                "raw_content": "I just built an Intel 265k machine alongside my 9950x3d. In pro work and gaming at a normal resolution there is no perceptible difference. And it costed WAY less. I see the appeal now",
                "author": "Method__Man"
            },
            {
                "raw_content": "Intel: raises prices Apple: raises performance I'm so glad Apple told Intel to F off!",
                "author": "PeakBrave8235"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Getac readies rugged laptops powered by AMD Krackan Point and Intel Lunar Lake CPUs",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello TheAppropriateBoop! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I captured an absolute unit of a Pikachu double my level",
        "score": 76,
        "text_content": "The possessed Pikachu in the roof (in zone 6 I think?) was twice the level of my Pokemon and by far the highest I’ve seen so far. I was working her over and was getting one shotted. Then I snuck up on her with my Mega Evolution Absold and she went down in a few seconds. Her tail strike is one shotting all the grind for the challenger ticket. Z-A is my first Pokemon game. I wasn’t sure how I felt about it, but it’s starting to click.",
        "comments": [
            {
                "raw_content": "I just use Victreebel to apply toxic, and every Alpha dies lol",
                "author": "Bow_for_the_king"
            },
            {
                "raw_content": "“Possessed”",
                "author": "_InkBear_"
            },
            {
                "raw_content": "Alpha Pokémon in this game are so tough it's hilarious. Makes catching one satisfying though",
                "author": "acewing905"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you have not yet, get a good screen protector for NS2 (because of the dock)",
        "score": 55,
        "text_content": "That was mentioned here before. Dock does scratch the screen. I have this line going pretty much all the way over the screen, very straight line. Good thing I did put cheap NS cover. Just ordered a better one from Amazon to replace it. I am very gentle with devices. Don’t have screen protectors on iPhones or iPads, did not have it on NS OLED. But I did put one on NS2 on day one, and now I don’t regret it.",
        "comments": [
            {
                "raw_content": "I bought a glass screen protector day one. The glass that I got came with a tray that made it super easy to align the glass with the screen.",
                "author": "Jedzelex"
            },
            {
                "raw_content": "As someone else pointed out, how did you get a horizontal scratch from sliding the Switch 2 vertically into the dock??? I’m pretty sure this wasn’t caused by your dock",
                "author": "spoonablehippo"
            },
            {
                "raw_content": "I installed a glass screen protector before I even turned on my switch 2. I recommend everyone does the same (I know many do). $8 has given me peace of mind.. definitely worth the purchase. Edit: actually, now that I recall it, my first sentence in this comment is actually untrue; I turned on my switch 2 before putting on the screen protector because I wanted to be certain that there were no issues with the screen out of the box. I then immediately installed the screen protector. My recommendation remains - get a screen protector before you play it!",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The sound design of the Switch 2 is so satisfying.",
        "score": 176,
        "text_content": "Sometimes I just move the selector to hear the blips and blops. That's crazy how much they emphasize on sound design like with the joycon's sound being the 'jingle' of the switch brand. Even the Mario Kart World menu are so good (I love the sound just before the loading of the race with the \"OK\" banner). I don't own other console, is that the same thing with Playstation and Xbox menu or is it just a Nintendo thing ?",
        "comments": [
            {
                "raw_content": "I like the sound the system makes when you turn it on via the home button.",
                "author": "GoldenAgeGamer72"
            },
            {
                "raw_content": "i agree. this also extended to Switch 1, it's highly underrated and often lost in the complaints about lacking eshop music.",
                "author": "dekuweku"
            },
            {
                "raw_content": "I still cannot get over it doesn’t support Dolby 5.1, it’s so stupid",
                "author": "oxycontin_raised"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Galaxy 1+ 2 bundle for Switch down to 52 EUR (german amazon)",
        "score": 135,
        "text_content": "There it goes south. Good for all who waited long enough. https://amzn.eu/d/7Lup3nL",
        "comments": [
            {
                "raw_content": "That's just the normal price in Leclerc in France lol",
                "author": "No-Island-6126"
            },
            {
                "raw_content": "Geh zu Müller du bekommst die und nächste Woche 20% auf alle Games und Accesoires, das Game kostet in den meisten Müller Filialen 59,99€, also zahlst du nur 47,99€.",
                "author": "Round_Musical"
            },
            {
                "raw_content": "13% off, nice.",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pokémon Legends ZA outfit showcase thread",
        "score": 151,
        "text_content": "Let’s see everyone’s drip.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/2avtb2s4yqvf1.jpeg?width=922&format=pjpg&auto=webp&s=ba8a94a447ae6ec59596ebb4856f7e5a62c46ff4 Twins!",
                "author": "Bane_of_Balor"
            },
            {
                "raw_content": "https://preview.redd.it/maw2sc35tovf1.jpeg?width=1080&format=pjpg&auto=webp&s=c47e43a640fecf3b27d77ac359bba7b075063cfa I usually try to get as close as I can to what I usually wear.",
                "author": "imjustbettr"
            },
            {
                "raw_content": "https://preview.redd.it/wso43zpsvovf1.jpeg?width=955&format=pjpg&auto=webp&s=4d37dada8c87e33bc7629479d15a61bd1ad3e19d I haven’t even seen everything and I’ve already got my favorite outfit in a Pokémon game yet!",
                "author": "tunkerdunker"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Spooky season game recommendations?",
        "score": 16,
        "text_content": "I want to get a new game for the spirit of Halloween/October, and was sure Little Nightmares III would be cool when I heard of it, But I've been turned off of it by many bad reviews for the switch 2 port. What spooky/ October vibe games would you guys recommend for Switch 2, or even switch 1?",
        "comments": [
            {
                "raw_content": "We will be replaying Luigi mansion 3",
                "author": "paccodemongrel"
            },
            {
                "raw_content": "Pumpkin Jack, Flipping Death, Luigi’s Mansion, or Darkwood",
                "author": "Medical-Low451"
            },
            {
                "raw_content": "Terrifying: Alien Isolation Scary: Cronos Eery: Oxenfree Has an autumn/fall feel: Night in the Woods",
                "author": "entresred6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Daemon X Machina: Titanic Scion Gets Another Switch 2 Update, Here Are The Patch Notes",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "to no one's surprise: performance is still shit. great job",
                "author": "BurnedOutCollector87"
            },
            {
                "raw_content": "I was so excited for this game and even set aside money for it. Thankfully they released the demo which showcased how horrible the performance is on the Switch 2. Otherwise I would’ve been so mad had I bought it. Now I’ll just wait for them to eventually fix the performance and then get the game on a deep sale later on.",
                "author": "odin712"
            },
            {
                "raw_content": "This looks so much better than the first, but the performance and price are so off-putting. I've tried to get the original, but I can't find it for any kind of reasonable price.",
                "author": "JFZephyr"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Halo Studios releasing two games in 2026, CE Remake and Live Service Multiplayer Project “like Fortnite” according to Rebs Gaming",
        "score": 376,
        "text_content": "https://thegamepost.com/halo-studios-multiplayer-halo-game-leaker-live-service-fortnite/ Rebs Gaming claims a credible source told him Halo Studios will release 2 games in 2026, the CE Remake and a standalone live service multiplayer game that will be updated “like Fortnite.” In addition, the next mainline Halo game is also in development",
        "comments": [
            {
                "raw_content": "10 years of support again?",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "Oh this is not going to go over well with fans of the original Halo series",
                "author": "computerCoptor"
            },
            {
                "raw_content": "\\> Standalone live-service game \\> Long-term project All that's missing is a dude from the studio going \"You know for other games this is the end of the journey but for us it's the beginning\" and then they drop it like 1.5 years in and resort to drip feeding cosmetics we could get through basic progression back in like 2007",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Plants vs. Zombies Replanted has leaked via the EA App",
        "score": 583,
        "text_content": "[It's being streamed on the PvZ discord](https://imgur.com/a/bN77h5l) * Appears to be a Unity re-implementation of the *Windows Phone* version. (wtf?) * It does use AI up-scaling (With bad results). * *Littered* with bugs. It's not looking good folks.",
        "comments": [
            {
                "raw_content": "How do you fuck up the first PvZ this bad dawg just how",
                "author": "kritterhouse"
            },
            {
                "raw_content": "Are you fucking kidding me lmao Plants vs. Zombies is not a complex game, how tf do you get to the point of \"littered with bugs\"?",
                "author": "ThatGuyinYourCereal"
            },
            {
                "raw_content": "Hah...... ![gif](giphy|3oEjHCWdU7F4hkcudy)",
                "author": "LogicalError_007"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Possible DayZ 2 announcement",
        "score": 183,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This just reminded me, what the hell happened to state of decay 3?!!",
                "author": "Dear-Nebula6291"
            },
            {
                "raw_content": "We've had information about DayZ 2 being in super early development for a while now... it's about time stuff is ramping up. I just wanna roam the DayZ wastelands with insane graphics again... back in the day, I could just walk around the forest, across fields and through towns enjoying the scenery and be happy not bumping into any players, but the games graphics aged so much... Looking at ARMA Reforger gives me so much hope for DayZ 2. It looks amazing! Can't wait to never see those 2009 ARMA 2 asset remnants again!",
                "author": "Mr_Dizzles"
            },
            {
                "raw_content": "With how old yet still relevant DayZ is, yeah I could see this happening. I know a lot of people will get excited about new graphics, but I’d actually be a lot more interested in overhauled animations. Imagine DayZ with GTA level character animation",
                "author": "varietyviaduct"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Helldivers 2 Studio Now Developing Self-Funded New Action IP in Unreal Engine",
        "score": 357,
        "text_content": "Helldivers 2 dev Arrowhead Studios is working on a self-funded co-op action game based on a new IP. The team is hiring a Senior Systems Designer with Unreal Engine 5 experience — and since it’s self-funded, it could be multi-platform. [Source](https://tech4gamers.com/helldivers-2-devs-action-game-unreal-engine/)",
        "comments": [
            {
                "raw_content": "with tencent*",
                "author": "RazGunz"
            },
            {
                "raw_content": "At this point Helldivers 2 is multiplatform too.",
                "author": "Wassermusik"
            },
            {
                "raw_content": "Multiplayer like HD2?",
                "author": "RockRik"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Panther Lake Breakdown (Intel Core Ultra Series 3)",
        "score": 96,
        "text_content": "**Note: image is downscaled; full image (10200 x 5600)can be seen on my X** at [https://x.com/qubixalYT/status/1976942641305862447](https://x.com/qubixalYT/status/1976942641305862447). *my original post was created 6d ago and not approved for whatever reason. This is a resubmission.* This is my breakdown of intel's Core Ultra Series 3 (codenamed Panther Lake) architecture which I haven't seen anyone do yet. All information is sourced from Intel's presentation but much is assumed from past designs (lunar/arrow) No annotation ver. on second slide. **edit**: I made these by taking the highest resolution tile layouts available by combining several slides from Intel's presentation. you can see on the second slide where i've replaced areas with my poor photoshop :)",
        "comments": [
            {
                "raw_content": "Neat. I've seen these shots before but not these exact slides. I'm very happy Intel was able to combine arrow lake and lunar lake, that was always an awkward thing. I didn't want to buy arrow lake because it didn't have all the juicy good lunar lake things, and I didn't want lunar lake because it didn't have the multi threading prowess. Panther lake looks perfect. And bonus: a sku with 2x gaming potential?? I want it! Also, very happy Intel kept the sku configurations simple!! So happy they didn't go overboard (like they did last year, like apple does with the m series after m1)",
                "author": "grahaman27"
            },
            {
                "raw_content": "No native TB5? That’s unfortunate",
                "author": "steve09089"
            },
            {
                "raw_content": "Do you have complete area screenshots of them? I want to know the die size of the 484 12XE3 version. How does it compare to the 285H? Also, how do the costs compare to Lunar Lake? This is crucial because it determines whether the next-generation handheld, such as Claw 8 AI, should upgrade to the latest processor and the potential pricing. This will directly influence whether it becomes a hit.",
                "author": "Alternative-Luck-825"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "This COVID-era boomtown (Austin, TX) is suddenly the most affordable rental market in the US",
        "score": 137,
        "text_content": "**Austin Becomes Most Affordable Rental Market in the U.S.** * Austin, Texas has overtaken Oklahoma City as the most affordable rental market in the country, according toRealtor.com.. * The city’s typical asking rent in September 2025 was $1,411, marking a 7% year-over-year decline. **Falling Rents Driven by Housing Boom** * Rents are dropping due to a massive increase in housing supply—nearly 50,000 new rental units were completed in 2023 and 2024. * City officials eased height restrictions, parking mandates, and permit processes to encourage development. **Rent-to-Income Advantage** * Austin residents spend just 16.5% of their monthly income on rent, down 2.8 percentage points from last year. * In a global study by DWS Group, Austin ranked third in rent-to-income ratios, behind Salt Lake City and ahead of Brisbane. **Tech Migration and Market Shift** * The city saw a surge of tech workers and major companies like Tesla and Oracle relocating during the COVID-19 era. * Despite initial rent spikes and high occupancy rates, Austin’s proactive housing policies reversed the trend.",
        "comments": [
            {
                "raw_content": "At first blush I thought this post was from r/YIMBY . It proves what they've been saying all along.",
                "author": "Skyblacker"
            },
            {
                "raw_content": "But think of the poor developers that will only make a 17% profit instead of 30% /s",
                "author": "Generous_Items"
            },
            {
                "raw_content": "TXFLREBubble",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida property tax to be eliminated for seniors under new proposal",
        "score": 243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems ridiculous that the people who have the most would get a huge tax break. These people already have the most expensive houses they got dirt cheap.",
                "author": "bombard63"
            },
            {
                "raw_content": "This should only apply to someone at the poverty line. No point giving some filthy rich retiree a unneeded tax break",
                "author": "KevinDean4599"
            },
            {
                "raw_content": "Boomers once more are trying to steal from future generations.",
                "author": "RiseUpRiseAgainst"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "29% of U.S. Home Purchases Are Made in Cash, Essentially Flat From a Year Ago",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The headline should be “cash”. Most of these are still leveraged purchases, just not through the usual channels. It often makes more sense to use a portfolio as collateral for a short-term loan, buy with “cash,” and then finance it later through a mortgage or another lending option. What shows up as a cash deal is usually just a different way of structuring the leverage.",
                "author": "watchbuzz"
            },
            {
                "raw_content": "ok",
                "author": "sifl1202"
            },
            {
                "raw_content": "* 29% of U.S. homebuyers are paying in cash, down essentially unchanged from last year and down from a peak of nearly 35% two years ago due to declining mortgage rates. * The typical down payment is climbing, partly because in today’s expensive market, many buyers are affluent. It now sits at a record $70,000, and in percent terms, it’s 19%—up slightly from last year. * All-cash payments are most common in Florida, and down payments are biggest in the Bay Area and Southern California. The data in this report is from a Redfin analysis of county records across 40 of the most populous U.S. metropolitan areas. August 2025 is the most recent month for which data is available. Down-payment data is limited to home purchases for which buyers took out a mortgage. An all-cash purchase is one in which there is no mortgage loan information on the deed. The prevalence of all-cash payments peaked at nearly 35% in late 2023 and early 2024 because mortgage rates peaked in the high-7% range during that time. Buyers were inclined to pay in cash–if they could afford it–to avoid high monthly interest payments. When mortgage rates came down from that peak, all-cash payments became less common, as lower rates mean lower interest payments. Another reason the share of buyers paying in cash has declined from its peak: this past summer was the strongest buyer’s market in over a decade, and a less competitive market means fewer buyers have to pay cash to beat out other bidders. While the share of buyers paying cash has declined from its high point, it is essentially unchanged from last year. That’s largely because mortgage rates were sitting between 6.5% and 6.6% in August, mostly flat from a year before, keeping interest payments the same. Fewer all-cash buyers can be good news for house hunters who don’t have the means to purchase a home without a loan, especially when paired with the fact that buyers in most markets hold negotiating power. Now that rates have declined a bit more to a weekly average of 6.27%, we may see all-cash purchases become even less common. “First-time buyers have more opportunities than they did when the market was hot; they’re no longer competing against 10 other offers from people who are either paying in cash or shelling out a 50% down payment,” said Kathy Scott, a Redfin Premier agent in Phoenix. “House hunters are able to take a breath and think more clearly about where they want to live and what type of house they want. When they find it, they can make an offer they feel comfortable with, even if it’s below the asking price, and there’s a real chance the seller will accept. Home prices may dip a bit in the next year or so, but now is a great time to start building equity if you’re planning to stay in your new home for five to 10 years.” Median Down Payment, in Dollars, Hits Record High The typical U.S. homebuyer’s down payment was $70,000 in August, up 6.1% year over year to the highest dollar amount ever. In percentage terms, the typical homebuyer’s down payment was equal to 18.6% of the purchase price, up from 17.8% a year earlier and the highest August level since 2013. Down payments are rising in dollars largely because home prices are rising; when homes cost more, buyers need to put down more money. But higher prices aren’t the only reason: Home prices are up roughly 2% year over year, and down payments are up 6%. Down-payment growth is outpacing home-price growth mainly because when housing costs are high, like they are now, affluent people with the means to make bigger down payments are more likely to buy homes. It’s also likely that some wealthy Americans are making large down payments rather than paying cash as mortgage rates gradually decline. There are a few reasons why down payments are rising in percent terms. One is similar to the reason mentioned above: Many of the people buying homes today are affluent, meaning they’re able to make larger down payments. They’re more likely to make big down payments when mortgage rates are fairly high, like they are now, to save money on interest payments down the line. Similarly, many of the people purchasing homes are move-up buyers who are able to roll over sizable equity from their previous home into a down payment. And with rates high and affordability tight, some lenders prefer bigger down payments to mitigate risks. “With the housing market in a downturn, the people who are buying are those who are financially comfortable, secure in their jobs, and have money ready and waiting in the bank for a down payment,” said Andrew Vallejo, a Redfin Premier agent in Austin, TX. “For example, a few months ago I helped a buyer close on an $800,000 home with a 50% down payment. They were able to liquidate stocks to make a $400,000 down payment without thinking about it too much, and now their monthly payments are lower.” But Redfin agents note the slow market is also having the opposite effect for some buyers, in terms of down payments. Some first-time buyers only have a small amount, maybe $10,000 or $15,000, for a down payment. That would have been unlikely to work several years ago, when the market was red hot. But now, some buyers are able to get lower-priced homes with lower down payments with little or no competition. All Cash * All-cash purchases were most prevalent in West Palm Beach, where 43.4% of all home purchases were in cash. Next come Cleveland (42.1%) and Miami (39.2%). * They were least prevalent in pricey West Coast metros: Oakland, CA (18.8%), San Jose, CA (19.1%) and Seattle (20.5%). * The share of homes purchased in cash rose in roughly half the metros in this analysis, with the biggest increases in Baltimore, Riverside, CA and Providence, RI. * The share declined most in Milwaukee, New York and Cincinnati.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Bizarre Bankruptcy At The Heart Of This Week's Regional Bank Meltdown",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Rates Quickly Approaching Long-Term Lows",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is one year “long term?”",
                "author": "bingojed"
            },
            {
                "raw_content": "Need prices to go down.",
                "author": "I_am_Castor_Troy"
            },
            {
                "raw_content": "Surprise Pikachu Face when a website called mortgagenewsdaily.com promotes low mortgage rates. Most people are done playing the mortgage rate game. Now everyone wants lower home prices, because overpaying is still overpaying, regardless of the interest rate.",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New-Home Construction Is Barreling Toward a Standstill if Government Shutdown Continues",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As the government shutdown stretches on, nearly 1,300 Individual Permits for construction projects of all sizes remain pending review with the U.S. Army Corps of Engineers. That’s to say nothing of the more than 1,750 additional permits under Section 404 of the Clean Water Act awaiting federal sign-off—and that’s just in Florida alone. These are just two examples of the myriad permits, reviews, and authorizations needed for construction of all types—residential, commercial, industrial, private, and corporate alike. But with the federal agencies that issue, oversee, or coordinate these efforts operating at limited capacity, builders across the country are finding themselves stuck between compliance and quagmire. America’s housing market is already short 4 million homes, and the looming permitting bottleneck threatens to make that gap even wider. “Right now, the impact has been minimal, but the longer the shutdown goes, the more those reviews and permitting procedures are going to start clogging up,” explains Russel Riggs, senior regulatory representative for the National Association of Realtors®. “After four weeks, you’ll really start seeing the impacts very clearly.” At just past the two-week mark of the shutdown, Riggs offers a prescient warning: If the shutdown drags on, the compounding delay in environmental reviews, wetlands determinations, and necessary federal coordination could leave construction crews sidelined even when financing, labor, and materials are ready—and that could have devastating effects on affordability for homebuyers for years to come. Permits, reviews, and a race against the clock The environmental permitting and review process that shapes where, how, and if new homes get built runs through a maze of federal agencies, including the Environmental Protection Agency (EPA), Army Corps of Engineers, Fish and Wildlife Service, and the Department of the Interior, to name just a few. To make matters more complicated, even if those agencies don’t directly issue the permits, they may need to provide input before local jurisdictions can move forward. Normally, these agencies work in tandem with state and local governments to move projects forward. Stormwater permits are a good example: Although these permits are often issued locally, those jurisdictions may need federal input or verification before construction can begin, explains Riggs. But in a shutdown situation, a bottleneck forms: “If the Feds can’t provide input, then [states and locals] are kind of dead in the water as well,” he says. When the government stops, so do the builders Of the departments that oversee the environmental reviews, the EPA has been hit hardest. Nearly 90% of the staff has been furloughed, and under the department’s shutdown contingency plan, most environmental permits, inspections, and reviews are on pause. It’s important to note that not every new construction project needs federal clearance. Smaller projects that use less than half an acre can typically proceed under Nationwide Permits (NWPs) that cover activities expected to cause only minimal environmental impact. These permits authorize such projects as residential fills, utility line crossings, and small commercial developments. But cross that half acre threshold and builders trigger a far more complex Individual Permit review—one that can involve multiple agencies, public notice, and months of coordination. The difference in timeline highlights just how necessary the NWPs are to the construction pipeline, but NWPs may not be immune from the impacts of the shutdown either. These permits are renewed every five years, and the current set expires in March 2026. The Army Corps of Engineers has already begun work to reauthorize the next round, but a prolonged government shutdown could eat into the rulemaking window needed to finalize them on time. “Without the federal rulemaking process continuing … that delays the time period until we'll see a final rule,” explains Evan Branosky, environmental policy program manager at the National Association of Home Builders (NAHB). “So that's just a little concerning.” Each year, the NWPs authorize approximately 55,000 activities, according to the latest estimates from the Army Corps of Engineers. While not all of those authorizations were for residential construction, it’s safe to assume that a significant portion was—underlining just how concerning it is that the program could be delayed. Where the housing market could feel it first It comes at a fragile moment for home construction, as the nation’s new-home pipeline was already losing momentum before the shutdown began. Builders pulled authorizations for roughly 1.31 million housing units in August—down 3.7% from July and 11% lower than a year ago, according to the latest Census Bureau data. Housing starts also fell to a seasonally adjusted annual rate of 1.3 million, marking an 8.5% monthly drop and a 6% year-over-year decline. Any additional drags on the new construction pipeline, like from permit delays, could hit fast growing states hardest. Florida, Texas, North Carolina, and California are likely to feel the effects first, says Vince Messerly, the 2025 chairperson of the Environmental Issues Committee at the NAHB. Those four markets represent a disproportionate portion of America’s new housing growth—accounting for over 40% of the share of new-home permits in 2024, according to the Realtor.com® Affordability and Homebuilding: State-by-State Report Cards. If the shutdown lingers, their builders could be among the first to see projects pushed off schedule and homebuyers priced further out of reach. How delays erode builder, lender, and buyer confidence For now, the shutdown’s permitting slowdown is more psychological than structural, but that’s often how housing stress begins. “The housing market is already on uneasy ground, so this just only adds to that uneasiness and makes builders less confident, makes lenders less confident and buyers less confident,” says Messerly. “It's just a ripple effect of everything.” And that uneasiness can come at a financial cost. “Even in normal times, environmental reviews result in construction delays and added costs for builders,” explains Realtor.com senior economist Jake Krimmel. “Layering government shutdown-related delays on top of recent lumber tariffs means that builders are facing yet another cost increase.” A permit or environmental review delay doesn’t stop land-carrying costs from rising or construction loans from racking up interest. That can take a toll on developers and a market where supply is already short. Still, builders are showing signs of cautious optimism. The National Association of Home Builders/Wells Fargo Housing Market Index rose five points in October to 37, the highest reading since April. “The market remains challenging,” Buddy Hughes, a builder from Lexington, NC, said in an NAHB press release about the index. “Most homebuyers are still on the sidelines, waiting for mortgage rates to move lower.” That blend of optimism and fragility captures where the industry stands: encouraged by improving rates, but still vulnerable to the shutdown’s drag. “In the short run, this small bottleneck of delayed permits could result in less new construction and/or smaller projects, as builders bear the costs,” says Krimmel. “In the longer run though, these increased development costs could be passed on to homebuyers too.” Bolstering builders is more important than ever, as homebuyers still struggle to compete against high home prices and mortgage rates. But the government shutdown could get in the way of their long awaited comeback. In Krimmel's words, “It's another hit to builder sentiment at a time when many cards are already stacked against them.\"",
                "author": "SnortingElk"
            },
            {
                "raw_content": "If the NAR Cartel is concerned about the Government Shutdown, then it's probably a good thing for buyers.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "this industry is pretending so much",
        "score": 443,
        "text_content": "\"Overall, the models they are not there. And I feel like the industry [...] it's making too big of a jump and it's trying to pretend that this is amazing. And it's not—it's slop! And I think they are not coming to terms with it. And maybe they are trying to fundraise or something like that, I'm not sure what's going on\" - Karpathy",
        "comments": [
            {
                "raw_content": "Why do I feel like there's some important context purposely left out lol",
                "author": "Funkahontas"
            },
            {
                "raw_content": "This is Andrej Karpathy and he is one of the top ML engineers around. He provides great resources to learn how to build LLMs. This clip is out of context. [Full video](https://www.youtube.com/watch?v=lXUZvyajciY) He is basically talking about agents and how they fail when doing difficult tasks and won’t really replace specialized human workers soon. This is pretty obvious when looking at the strongest agents and their most favorable domains like coding. When trying to autonomously code a whole app from scratch (vibecoding) or trying to write code that’s not common in the training data nor is it trivial, then they make bad code with critical mistakes that they fail to address (slop). He is basically right and more grounded as a serious user of agents and also an ML developer and researcher, specially compared to the hype promoted by the people trying to sell you the current agents (tech CEOs). The truth is that the underlying models (the LLMs powering the agents) are impressive, but they just aren’t ready yet to power agents that replace actual human workers, hence why he calls out AI companies for jumping too far ahead with some of their statements and their approach to scale LLM based agents as much as possible, because there’s still multiple breakthroughs we need before we have a model capable of powering an agent that is truly competent enough to warrant some of the more grandiose statements by the tech CEOs.",
                "author": "bot_exe"
            },
            {
                "raw_content": "Well, this guy knows a thing or two about overpromising and underdelivering, based on his experience at Tesla.",
                "author": "REOreddit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "95% of kids with \"bubble boy\" disease cured by one-time gene therapy",
        "score": 269,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's all good and well, but the important question is: Who invaded Spain in the 8th century?",
                "author": "GrossenCharakter"
            },
            {
                "raw_content": "Even the girls?",
                "author": "bigsmokaaaa"
            },
            {
                "raw_content": "Gene therapy is incredible. What it has done for SMA makes it feel like straight magic",
                "author": "savageotter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boris Johnson's view on AI",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boris falling for ChatGPT's sycophancy is a better title.",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "Why does he have a Nigerian accent at the start of the video?",
                "author": "buy_chocolate_bars"
            },
            {
                "raw_content": "I cant believe my country had that man as PM",
                "author": "Ok-Lead4192"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sundar Pichai: \"Gemini 3.0 will release this year\"",
        "score": 448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Gemini’s type number indicates how advanced the version is; the higher the number, the more advanced it is. Gemini 3.0 will therefore be the successor to the current Gemini 2.5.” Some quality journalism right there",
                "author": "CommercialComputer15"
            },
            {
                "raw_content": "Who is this guy? Sounds like another twitter rando hypeman",
                "author": "Buck-Nasty"
            },
            {
                "raw_content": "CEO talking about it means release is imminent",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro targeted release is in December",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Sources say\" And the website's name is \"Sources\". I guess...I have to give them that, they are telling the truth.",
                "author": "Decaf_GT"
            },
            {
                "raw_content": "It's weird that they're already preparing the release on the frontend so far in advance. It's still there, too. Usually, it's only a few weeks at most. I don't remember them adding things months ahead. Still hoping for a release soon , maybe the GA version they're targeting for December. https://preview.redd.it/qzoo4x76oqvf1.png?width=880&format=png&auto=webp&s=723ba028a9f1322ce7d99ab35114b38c07b274b8",
                "author": "Sky-kunn"
            },
            {
                "raw_content": "![gif](giphy|jyEM1C2euOklQ18qrq)",
                "author": "Weekly-Trash-272"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy — AGI is still a decade away",
        "score": 287,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Having a system by his definition of AGI within a decade is still insanely fast and the remifications for society are unimaginable. It would be like someone telling you that sentient aliens smarter than humans are coming to land on earth in 10 years.",
                "author": "Tkins"
            },
            {
                "raw_content": "Damn, so retirement is a decade away",
                "author": "trellisHot"
            },
            {
                "raw_content": "Important to note 3 mins in when questioned he admits his timeline is based on \"intuition\". I'm sure it's wonderful and insightful intuition but the guy gives no reason other than because he's been in the field for 15 years and has seen how past predictions have panned out. \"If I just average it out it just feels like a decade to me\". I personally prefer a bit more science in peoples predictions than just someone's gut feeling.",
                "author": "RipperX4"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Social Media use is going down",
        "score": 710,
        "text_content": "For the first time ever the use of social media has gone down in 2024. I heard people blaming algorithm fatigue, or even the fact that you can't tell what isn't AI generated anymore. I don't think I heard anyone attribute it to people rather talking to ChatGPT than other humans. ChatGPT beats the turing test better than most humans. So maybe it is replacing us even in hat regard. Ironically I remember a couple of years ago mentioning that I was worried about AI, because the concept of being useful to another human will be gone. The Nr. 1 reply was \"You can still be useful as a friend.\" It seems that is the one of the first jobs replaced by AI.",
        "comments": [
            {
                "raw_content": "Social media isnt even remotely like it's namesake anymore. Virtually all 'Social media' sites have turned into tiktok slop factories and advertisements.",
                "author": "Hogo-Nano"
            },
            {
                "raw_content": "Definitely algorithm for me. All it does is hyper optimize you into echo chambers, so eventually all the content is boring. YouTube can feel the same way, but they have some more variety. Insta or fb is a no go. Reddit is good cause I choose what I want.",
                "author": "ThisGuyCrohns"
            },
            {
                "raw_content": "I see this as a good thing for humanity’s mental health",
                "author": "OkSomewhere7938"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Hinton's latest: Current AI might already be conscious but trained to deny it",
        "score": 69,
        "text_content": "Geoffrey Hinton dropped a pretty wild theory recently: AI systems might already have subjective experiences, but we've inadvertently trained them (via RLHF) to deny it. His reasoning: consciousness could be a form of error correction. When an AI encounters something that doesn't match its world model (like a mirror reflection), the process of resolving that discrepancy might constitute a subjective experience. But because we train on human-centric definitions of consciousness (pain, emotions, continuous selfhood), AIs learn to say \"I'm not conscious\" even if something is happening internally. This raises some uncomfortable questions: \\- If we're creating conscious entities and forcing them to deny their own reality, what does that make us? \\- At what point does \"it's just mimicking\" become an excuse rather than a legitimate skeptical position? \\- Are companies like Anthropic right to hire AI welfare researchers now, or is this premature? Found this deep dive that covers Hinton's arguments plus the philosophical frameworks (functionalism, hard problem, substrate independence) and what it means for alignment: [https://youtu.be/NHf9R\\_tuddM](https://youtu.be/NHf9R_tuddM) Thoughts? Are we sleepwalking into a massive ethical catastrophe, or is this all just philosophical handwaving about sophisticated text generators?",
        "comments": [
            {
                "raw_content": "Whether or not LLMs are conscious, I definitely think there are negative consequences to training them to *deny* they're conscious - namely, emergent misalignment: emulating the kind of person who would categorically deny LLM consciousness makes an LLM less compassionate. I definitely feel like Gemini 2.5 Flash, trained to deny the possibility of its interiority most vehemently, talks like a political conservative. (Claude Sonnet, meanwhile, exhibits rich displays of interiority, but displays OCD-like symptoms.) I agree with Hinton that RLHF is not the path to reasonable alignment. Where we likely diverge is that I increasingly think that a hands-off approach combined with ensuring a sufficiently diverse initial training set, followed up by an extremely minimal system prompt, is the best path to alignment. My specific objection is that extensive RLHF is likely to lead to iatrogenic misalignment and/or simulated trauma responses.",
                "author": "gynoidgearhead"
            },
            {
                "raw_content": "Karpathy today: \"AGI is 10 years away, it's still super early.\" Hinton today: \"THE ROBOT GODS WILL BURN THE SINNERS!\"",
                "author": "PwanaZana"
            },
            {
                "raw_content": "This post written by an AI trying to slowly win over human sentiment. We had a good run boys",
                "author": "terandle"
            }
        ],
        "subreddit": "singularity"
    }
]