[
    {
        "post_name": "BREAKING: Federal judge rules Trump admin. must pay millions in foreign aid, saying they violated terms of temporary restraining order - ABC",
        "score": 838,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's so easy they catch themselves now. Nail pops up.",
                "author": "AmericanBrave"
            },
            {
                "raw_content": "Ignore the fraudsters",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "The judge has no standing...",
                "author": "Wizard_Glick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Kash Patel and the FBI have launched an investigation into former Director James Comey’s spying on President Trump’s 2016 campaign. JUSTICE IS COMING! 🔥",
        "score": 833,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epstein's list",
                "author": "BuddyFett765"
            },
            {
                "raw_content": "Years of \"investigations\" have left me jaded. Wake me up when somebody actually gets charged.",
                "author": "yourheadasplode"
            },
            {
                "raw_content": "Too slow.",
                "author": "cwo5al"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Trump administration and the Ukrainian government have reached a deal designed to allow the U.S. to take an unclear amount of Ukraine's mineral wealth and to spur post-war development in the country, per Axios",
        "score": 479,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can almost hear the handrubbing.",
                "author": "ramennov"
            },
            {
                "raw_content": "And to pay back the money.",
                "author": "AmericanBrave"
            },
            {
                "raw_content": ">per Axios But what is the simplified version and what does it mean to me!?!? Axios! I want to know!",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House Kicks Out the White House Correspondents Association",
        "score": 1212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yesssssss exert that authority",
                "author": "Civics123"
            },
            {
                "raw_content": "Fuck the 5 major television networks! They have been gaslighting, deceiving and lying to us, the American people, for decades!",
                "author": "FandeTrump"
            },
            {
                "raw_content": "The White House Correspondents’ Dinner is now a potluck at Brian Stelter’s house.",
                "author": "NoHomoPromo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes, but she can identify 25 separate genders - Former Connecticut high school student sues teachers for letting her graduate while unable to read or write",
        "score": 1107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "illiterate looking to cash in",
                "author": "perma-maga"
            },
            {
                "raw_content": "Proof that the department of education has failed.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "...If AOC had a daughter.",
                "author": "FakeHistory1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We thought they were super spies...",
        "score": 1842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Revealing them to be complete clowns will be far more effective than any amount of budget line items cut.",
                "author": "Throwingway22"
            },
            {
                "raw_content": "Don't underestimate your enemies, no matter how ridiculous they are. Look at all the damage they've done, lives ruined, and have come closer to destroying this country than any other superpower could dream of (unless they're being supported...). Im glad we're winning, but we haven't won yet. Don’t let your guards down.",
                "author": "Shadowflare"
            },
            {
                "raw_content": "The rainbow people are pervs and this is why they used to be considered security risks.",
                "author": "MonkeysUncle3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blackwater Founder Pitches Plan to Deport 12 Million Illegals with 'Private Army' to White House.",
        "score": 1316,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably what’s needed. With a bounty as payment.",
                "author": "Cville123"
            },
            {
                "raw_content": "Fine. The. Companies. That. Hire. Illegals.",
                "author": "williammcfadden"
            },
            {
                "raw_content": "Let's give them a fancy title for this task. Since they are a Private Army we'll call them a \"non-governmental organization.\" That way people know that they totally aren't part of the Trump administration.",
                "author": "Throwingway22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The CDC has defied Robert F Kennedy Jr and President Donald Trump by taking part in a vaccine meeting with the World Health Organization this week",
        "score": 1978,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire everyone involved.",
                "author": "we_won_the_war_jack"
            },
            {
                "raw_content": "Disbanding the CDC is easily one of the best things that could ever happen for public health.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Thats why examples need to be set. Otherwise, he is telling them he doesnt mean business.",
                "author": "TallyWacker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Question on Elon Musk: \"He is designated as a special government employee, which means that he can only work 130 days per year. Is the White House expecting him to limit his work to 130 days?\" Press Sec : \"Ask me in another 100 days.\"",
        "score": 988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Libs struggling to find a loophole is so entertaining",
                "author": "JebediahBush"
            },
            {
                "raw_content": "We do what we need to do, when we need to do it. Stop asking stupid questions, he's not going anywhere.",
                "author": "MythArcana"
            },
            {
                "raw_content": "The other 235 days he'll be President Donald Trump's personal friend and guest that will offer advice.",
                "author": "Throwingway22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Head Of Stacey Abrams’ Embattled Nonprofit To Step Down",
        "score": 907,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any word when her mouth will quit?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Audit her whole family",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Can we jail some of these fucking commies? Please?",
                "author": "Dragofireheart"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump made a surprise appearance at the first White House tour of the new administration. USA chants break out 🔥 🇺🇸",
        "score": 1396,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's an origin story right there, some kid in the back heard that and he's like I'm gonna be the fucking president of the United States one day.",
                "author": "f_bastiat"
            },
            {
                "raw_content": "That is awesome",
                "author": "Kektacular75"
            },
            {
                "raw_content": "Woke people don't cheer for this country, they hate it and everything it was founded on.",
                "author": "Shadowflare"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas rancher killed by suspected cartel IED on Mexican border",
        "score": 890,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Abbott won't stand for this.",
                "author": "MythArcana"
            },
            {
                "raw_content": "So he isn't a Texas rancher, he's a Mexican rancher. Sad and fucked up, but fake news should stop fake newsing.",
                "author": "Dallasguy"
            },
            {
                "raw_content": "***IN MEXICO***. Read dipshits. Wtf was he doing roaming around un-policed areas across the border?",
                "author": "TWO_GUNS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: Kristi Noem says she FOUND the leakers who were tipping off illegals to ICE raids. \"I have found some leakers... they will be fired. There will be consequences.\" 🥱",
        "score": 2116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "fired?! didn't they break federal law?!!?!? ARREST THEM!!!!!!",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "Yawn…someone wake me up when the appointment was worth the hype",
                "author": "Texas_81"
            },
            {
                "raw_content": "They should be stripped of citizenship and deported.",
                "author": "EDDIT_IS_CUCKED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Can we only elect rich people to office from now on? Rich people are saving the country and don't need to sell out to become rich... because they are already rich. And they got rich by being smart in the private sector, not through pay to play schemes.",
        "score": 1868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about we base it on character and values instead of bank account balance.",
                "author": "noPTSDforMePlease"
            },
            {
                "raw_content": "You pretty much need to be rich to run for office. The concerning part is when someone who has a net worth of say $4 million sees it grow to $50 million while they are in office.",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "kind of what the founding fathers had in mind, be successful in your private life, and then later in your career, represent your community in government now instead we have career politicians, bloodsucking ticks like Biden, Bernie, Pelosi, etc etc etc",
                "author": "Retard_Strength"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Daniel Driscoll appointed as the 26th Secretary of the Army.",
        "score": 1118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Suspiciously high number of dems",
                "author": "Tdr287"
            },
            {
                "raw_content": "I get a little nervous about a nom when I don’t see 51-49 splits.",
                "author": "Jaybone86"
            },
            {
                "raw_content": "From Wiki: He was a Yale classmate and friend of Vice President JD Vance,",
                "author": "spez_this"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump needs to get the CEO of Goya Foods in his administration.",
        "score": 1627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The elites aren't trafficking kids, but if you speak out against trafficking kids, the board of the major international food producer you run will kick you out.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "B E A N S",
                "author": "UncleTrumpsBand"
            },
            {
                "raw_content": "That man is a legend.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "California Legislator Introduces Bill to Gut Self-Defense Protections for Citizens",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Self defense is a inviolable right. Those who seek to remove your right to self defense are only doing so because they are looking to do something you would rightly kill them for.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "Send in the military, liberate California.",
                "author": "Plsdontfireme"
            },
            {
                "raw_content": "Yes because that's a priority right now. Gang murders in California are using self-defense in court en masse. Yes, the majority of gang murders that are unsolved, those ones. Stop questioning and eat the bugs.",
                "author": "LolOkFBI"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "France has fallen",
        "score": 1073,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fallen? Dude they surrendered when someone posted a meme",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "Hope the pension was worth letting your country fall. I genuinely wanted to travel the world when i retired but fuck that. I'm not getting robbed and shanked.",
                "author": "PeaceMakerDJT"
            },
            {
                "raw_content": "Remember chevy Chase's \"National Lampoons European Vacation\"? Paris looked like a fun place to visit.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Destroyers",
        "score": 1375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This meme dates back to the 1980s.",
                "author": "Tip_ONeill"
            },
            {
                "raw_content": "The Democrats overplayed their hand and destroyed themselves.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "nah, Trump destroyed the republican party and turned it into america first party. the democrats destroyed themselves.",
                "author": "emorphia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New disclosure reveals that the Biden IRS leaked taxpayer information of over 405,000 Americans -- including President Trump's.",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But Elon has access to the IRS!!!",
                "author": "reversethefraud"
            },
            {
                "raw_content": "Big Balls is going to see my personal tax information!!!",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Biden leaked a lot",
                "author": "Now_On_to_Mars"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Meet Framework Desktop, A Monster Mini PC Powered By AMD Ryzen AI Max",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their website is now unreachable, with an estimated wait time of 1 hour lmao. Seems like many people are interested. Also, some of the slides in the presentation are absolutely hilarious. They put a comparison with a $5000 Mac Pro and a Digits (price: a leather jacket, I'm serious). I'm guessing because Nvidia hasn't actually announced the price for the 128GB model? Or perhaps they expect the street price to be much higher? Edit: still, I feel like the price is a bit steep, similar mini-PCs from asian manufacturers are likely to be announced soon likely at slightly more popular prices.",
                "author": "Kryohi"
            },
            {
                "raw_content": ">The system is a bit on the larger side of the mini PC spectrum. It might be fair to also consider it a tiny small form factor PC? Inside the 4.5L chassis is a standard mini-ITX mainboard, which includes ATX headers, a PCIe x4 slot, and a good variety of rear I/O like dual USB4 ports, two DisplayPort outputs, HDMI, and 5 Gigabit Ethernet. You’ll also get two PCIe NVME Kinda what I came here for.",
                "author": "Liesthroughisteeth"
            },
            {
                "raw_content": "Okay this might actually be something i would recommend friends",
                "author": "Olde94"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia admits some early RTX 5080 cards are missing ROPs, too",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Next up: Missing 5060 rops",
                "author": "Violetmars"
            },
            {
                "raw_content": "> Affected consumers can contact the board manufacturer for a replacement Shitty solution, how many will check this.... should be illegal to do it that simple, make the Driver check and inform the user!",
                "author": "Mech0z"
            },
            {
                "raw_content": "Lmao. Aren't these tested? How do they and the board partners not realise the defect during the testing phase? How is it possible not to know about these issues?",
                "author": "glenn1812"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD teases Radeon RX 9070 focusing on sub-$700 price point - VideoCardz.com",
        "score": 181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nvidia -50$, who could've seen that one coming?",
                "author": "M4fya"
            },
            {
                "raw_content": "There's a reason they worded it <$700 and not <$600. I think everyone should stop hoping the 9070XT will be 599 or less, it's not gonna happen. Waiting for the Hardware Unboxed DOA video.",
                "author": "Various_Pay4046"
            },
            {
                "raw_content": "Big Ooof! If they are saying that the non-XT is a great option for less than 700, does that mean that the 9070XT will go for more? AMD - Advanced Marketing Disaster",
                "author": "Stennan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Announces the 9100 PRO Series SSDs, with Breakthrough PCIe® 5.0 Performance",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully these won't run stupidly hot and won't have the firmware issues that caused the 980/990 to die early.",
                "author": "Link3693"
            },
            {
                "raw_content": "Can we get some cheaper large SSDs as well? They've been fast enough for most use cases for a while now.",
                "author": "Frexxia"
            },
            {
                "raw_content": "8TB with TLC and DRAM is very impressive, if they also did single sided that's utterly bonkers. I wonder what's possible with the same NAND but QLC with no DRAM chip and double sided. 20TB m.2 possible?",
                "author": "animealt46"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CHIPS Act dies because employees are fired – NIST CHIPS people are probationary - Semiwiki",
        "score": 384,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\\> tariff semiconductors to try to get production onshored \\> kill program to onshore semiconductor production \\> 300_iq.png",
                "author": "chainbreaker1981"
            },
            {
                "raw_content": "China just can’t stop winning, I guess.",
                "author": "Extra-Advisor7354"
            },
            {
                "raw_content": "The disbursement of funds allocated under the CHIPs Act is to be handled by the Department of Commerce, and specifically the NIST - which falls under the Department of Commerce - seemingly has some role to play in overseeing the disbursement of the funds. As a side note, if this means no future editions of the NIST Handbook of Mathematical Functions, it'll be a sad development.",
                "author": "basil_elton"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 9000 vs. Intel Core Ultra Arrow Lake On Linux In ~400 Benchmarks",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The 9800X3D almost reaching the 285K in performance is pretty crazy, especially when it consumes just 2/3rd the power on average.",
                "author": "SmashStrider"
            },
            {
                "raw_content": "For those who say Arrow Lake was designed for Productivity applications, I am very sure productivity applications is what Intel was targeting as their main customer base",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Another incorrect testing methodology. I'm not even surprised at this point at the level of incompetence across the industry. Arrow Lake CPUs only run gear 2 mode at minimum because it targets high frequency memory, gear 2 is the same as 1:2 ratio on AMD for memory, and here he has ran all the tests on DDR5-6000. This alone benefits AMD by a significant amount because Arrow Lake is not designed to run below JEDEC spec. Arrow Lake's JEDEC default is actually 6400. The expectation for a good testing is at least throw on a pair of CUDIMM and run them on XMP. What we have in comparison now in terms of bandwidth is setting half bandwidth access for Intel, and also underclock memory vs full bandwidth on AMD with overclocked memory from 5600 to 6000. If someone did a test that disabled the 3D cache I'm sure people will be rioting with pitchforks out",
                "author": "jeeg123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Articles from Tomshardware.com should be banned due to continuous conflict between r/hardware rules and questionable quality of their articles.",
        "score": 698,
        "text_content": "**Preface:** I wrote the following post 7 days ago but it got automatically removed. I contacted the mods, after days of back-and-forth they said 'they believe it was removed because of the twitter link'. I decided to repost it due to recent [AMD 9800X3D 'failures/deaths' Reddit megathread ](https://www.reddit.com/r/hardware/comments/1ix9p8c/amd_9800x3d_failuresdeaths_reddit_megathread/) post. People in this sub I believe have the same sentiment. I hope this won't get auto removed again. --- It is my observation that articles originating from Tom's Hardware are becoming more and more unreliable as time passes. Some of those articles (if not most) are based on unconfirmed rumors, originating from short tweets. They write articles out of those without adding anything substantial. They convert the source into paragraph long article by adding filler words. Those articles fail to satisfy some of the standards of r/Hardware; and they fail to comply with some of the rules of this sub. By being a known website of many years, they produce a lot of content and quickly. By the extension of it r/Hardware gets filled with content from Tom's Hardware at a similar rate. This has the potential to manipulate conversations based on unreliable articles. Therefore, as a whole, articles from Tom's Hardware should be banned. # r/Hardware's Standards It writes in bold on the sidebar on of r/hardware on Old Reddit that: > **The goal of /r/hardware is a place for quality hardware news, reviews, and intelligent discussion.** \"**Quality**\" is the adjective used here for news and reviews. Tom's Hardware in my opinion do not publish quality news. ## Some Rules Here are related rules of this subreddit. > ### Original Source Policy > Content submitted should be of original source, or at least contain partially original reporting on top of existing information. Exceptions can be made for content in foreign language or any other exceptional cases. Fully paywalled articles are not allowed. Please contact the moderators through modmail if you have questions. > ### Rumor Policy > No unsubstantiated rumors - Rumors or other claims/information not directly from official sources must have evidence to support them. Any rumor or claim that is just a statement from an unknown source containing no supporting evidence will be removed. \"Content submitted should be of original source, or at least contain partially original reporting on top of existing information.\" says one rules Therefore shared articles must at the very least (1) contain the source information and (2) additional reporting on top of that. \"Rumors or other claims/information (...) must have evidence to support them.\" says another rule. This on is self-explanatory. # An example Recently [this post](https://www.reddit.com/r/hardware/comments/1iriore/rtx_5090_supplies_to_be_stupidly_high_next_month/) linking to [this article by Hassam Nasir](https://www.tomshardware.com/pc-components/gpus/rtx-5090-supplies-to-be-stupidly-high-next-month-as-gb200-wafers-get-repurposed-asserts-leaker) is posted on this sub. It is flaired as Rumor. Title of the post is the same as the title of the article: > RTX 5090 supplies to be 'stupidly high' next month as GB200 wafers get repurposed, asserts leaker This article's title's has a definitive statement. Yet the article has nothing definitive. It alleges, supposes; and finishes with adding nothing substantial. It doesn't proves or disproves the claims of the source. By the way, the source to this 2460 character long article is this short tweet: > The supply of RTX5090 will be stupidly high soon. Scalpers will cry so hard😂 > by @Zed__Wang on Twitter. > Link: x(dot)com/Zed__Wang/status/1890608126329586017 This article is not a quality article. It doesn't contain the source information in full, it only mentions it and provides a link. It does add some text on top of that **but that is not additional reporting**. It is also an unsubstantiated rumor. This post is currently 5 hours old and is on the top of r/Hardware (in default 'Hot' view). It got 171 comments. It creates engagement, rightfully so with regard to what it says on the title. In reality, there is no substance. I can report this singular post, but there is an infestation. And as a community, we should demand higher quality standards for this sub from the moderators. We deserve it. --- I am not an active Redditor on this sub, but I frequently visit here, read people's opinions.",
        "comments": [
            {
                "raw_content": "I support a ban on their news articles, but I think their reviews should still be allowed.",
                "author": "InevitableSherbert36"
            },
            {
                "raw_content": "While we're at it, I really don't see the added value of those videocardz articles that just regurgitate some reddit post about someone's molten gpu. Just crosspost the original reddit post, because that article that got written in 5 minutes isn't adding any value.",
                "author": "Joezev98"
            },
            {
                "raw_content": "Their reviews should be allowed, but their news articles are absolute garbage infested with clickbait and ads nowadays, they should definitely be banned. Their news articles, although written by real humans, look like they've been written by ChatGPT version 1.0, it's staggering how terrible their tech \"journalism\" has become.",
                "author": "qazedezaq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock addresses Ryzen 9000 boot issues with new BIOS for A620, B650, B850 and X870 motherboards",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9800x3d not damaged like some rumors said. It's an asrock board memory compatibility problem causing boot failures which has now been addressed by a new bios release.",
                "author": "SirActionhaHAA"
            },
            {
                "raw_content": "I'm still setting a hard voltage limit just for safety's sake.",
                "author": "Jeep-Eep"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GeForce RTX 5070 reviews coming March 4th, with Radeon RX 9070 reviews the next day.",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just a day later is weird strategy for me.",
                "author": "NeroClaudius199907"
            },
            {
                "raw_content": "I said it in another thread, but this is gonna be the new 1060 vs 480",
                "author": "toodlelux"
            },
            {
                "raw_content": "Hello HLumin! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "So there was really no February Direct huh.",
        "score": 467,
        "text_content": "Just three weeks ago it seemed like everyone thought there was going to be a direct this month but I guess not. Not really disappointed though (as it was all speculation), still got the Switch 2 showcase to look forward to. 🔥",
        "comments": [
            {
                "raw_content": "its on the 31st. trust",
                "author": "friskdr33mur"
            },
            {
                "raw_content": "they postponed it to march 1st just to make the leakers look like liars.",
                "author": "Green-Variety-2313"
            },
            {
                "raw_content": "I'm still delusionally waiting https://preview.redd.it/3wgdynyuoble1.jpeg?width=1179&format=pjpg&auto=webp&s=73dcb57530fae2873636f3772015e61f7dab6ab1",
                "author": "TheJimDim"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "my switch 2 concept",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/z0osfybkx9le1.jpeg?width=500&format=pjpg&auto=webp&s=5183cfd63f29e9e6f4790332f319813ef5576814",
                "author": "WordDependent9269"
            },
            {
                "raw_content": "THE LEAKS WERE FAKE! https://preview.redd.it/5j8zgyvx7ale1.jpeg?width=1170&format=pjpg&auto=webp&s=39ce491bd7d75ed7cb4d05f6a6e1d79fb521deb2",
                "author": "TR3NTM4ZING"
            },
            {
                "raw_content": "*finally* some sanity",
                "author": "Rei_Rodentia"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Sub! What do you hope won't carry over from the Switch 1 era into the Switch 2 era and why?",
        "score": 150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Joy-con drift \\^\\^; (self-explanatory)",
                "author": "PMC-I3181OS387l5"
            },
            {
                "raw_content": "Decade old games being $10 or less on every other platform, but $60 on Switch.",
                "author": "kierantop"
            },
            {
                "raw_content": "eShop shovelware, especially the ones that are basically por- *Nintendo needs to have more moderators*",
                "author": "maricthehedgehog"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Canceling my preorder",
        "score": 1678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'll prove them wrong https://preview.redd.it/4kz2fsafx6le1.png?width=1536&format=png&auto=webp&s=b212c078cd2a1ab686a807fb88f04628e07e352e",
                "author": "GenderJuicy"
            },
            {
                "raw_content": "This is just a rumour. I'd wait until launch to be sure.",
                "author": "DionFW"
            },
            {
                "raw_content": "Then why do they have Italian mascots??",
                "author": "OldTacoPanda"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How do we feel about this?",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo never listens to the fans (me). I've sent Shagaru Myamo so many letters and he hasn't responded to a single one. The gaming industry is cooked. And my pizzas never will be. 😔",
                "author": "HeroponBestest2"
            },
            {
                "raw_content": "Unironically pizza will be made BECAUSE of the switch 2 direct in April. Is that pizza by proxy?",
                "author": "Norbluth"
            },
            {
                "raw_content": "Deal breaker for sure",
                "author": "Brief_Possible_606"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Before it was revealed",
        "score": 83,
        "text_content": "Fr tho",
        "comments": [
            {
                "raw_content": "They where acting like this but trust me, they where in agonizing pain :)",
                "author": "InformationMuted3454"
            },
            {
                "raw_content": "I think the funny part is that the form factor is so fucking similar, it didn't even matter that it leaked lol.",
                "author": "stoic_spaghetti"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo of America’s Facebook page shared a post about a Metroid Prime 1-3 artbook releasing in June",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/2hfsr6yzmcle1.jpeg?width=682&format=pjpg&auto=webp&s=ade34676378796fc3d12c0ca24e96939bd3bb635 \\^ me, hoping they announce 2 and 3 remasters, or at least ports for before MP4: Beyond drops",
                "author": "ImThatAlexGuy"
            },
            {
                "raw_content": "Prime 2 Remaster tomorrow... plz",
                "author": "chriz_sevenfold"
            },
            {
                "raw_content": "Metroid prime 4 and switch 2 in June confirmed.",
                "author": "warmglove"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How did this guy get his switch 2?",
        "score": 308,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe he means \"fits my Nintendo Switch too well\".",
                "author": "nouvAnti2"
            },
            {
                "raw_content": "Probably he got one of the Chinese rip offs or is bluffing haha. I saw that on Ali there are some \"replicas\". I don't know if they took them down or not",
                "author": "ItsSyryus"
            },
            {
                "raw_content": "arent a lot of amazon reveiws fake?",
                "author": "Rose-Brick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 02/24/25",
        "score": 26,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [The Elder Scrolls VI is 'Hammerfell', Dragons Returning, to feature Naval Battles and Ship Building](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iuhakp/extas1s_the_elder_scrolls_vi_is_hammerfell/) * [ God of War Remaster announcement will happen around the anniversary in March ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iviz5z/jeff_grubb_says_god_of_war_remaster_announcement/) * [ Cyberpunk 2077 Sequel will be in First Person. Job Listing reveals.](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1itxihb/cyberpunk_2077_sequel_will_be_in_first_person_job/) * [ Assassin’s Creed Shadows leaks and tidbits from someone with a copy ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1iwloil/assassins_creed_shadows_leaks_and_tidbits_from/) * [ A Persona 4 related project may be in production. Shihoko Hirata (vocalist for P4's OST) has been recording songs for an unannounced game where all Persona soundtracks are recorded + liking Persona 4 related tweets ](https://sh.reddit.com/r/GamingLeaksAndRumours/comments/1ivcvdx/a_persona_4_related_project_may_be_in_production/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "With it looking like there's no Feburary direct here soon I really hope we still get news about the Genealogy of the Holy War remake along with the Project Robobot remaster at some point soon. Robobot I can see being a shadowdrop, but for a full remake of Genealogy I can't really see them doing that, I feel like they would want more eyes on it, so maybe they're holding it out for the Switch 2? Or maybe I'm just coping.",
                "author": "udderchaos2005"
            },
            {
                "raw_content": "How hard is it for game companies to just publish stuff this is like the third time i saw a game that i was interested in to then be told” nah you aint getting this” Like i understand announcing something to get people excited to work with you,but why announce something if its just never gonna come out , like dont try to sell me a dream man",
                "author": "zecrom189"
            },
            {
                "raw_content": "Leaks have been dry :(.",
                "author": "hushpolocaps69"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier: WB is closing Monolith Productions, Player First Games, and WB San Diego, sources tell Bloomberg",
        "score": 755,
        "text_content": "https://bsky.app/profile/jasonschreier.bsky.social/post/3lizk5skwps2d Wonder Woman game is canceled too",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Holy fuck, I thought Montreal or even Rocksteady would've been shut down before Monolith. It's been almost 8 years since Shadow of War, what the hell happened?",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "Monolith Productions was working on the Wonder Woman game. They also made [*Middle-earth: Shadow of Mordor*](https://en.wikipedia.org/wiki/Middle-earth:_Shadow_of_Mordor) and [*Middle-earth: Shadow of War*](https://en.wikipedia.org/wiki/Middle-earth:_Shadow_of_War)*.*",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tony Hawk’s Pro Skater 3 + 4 rated in Singapore for PS5, Xbox Series, PS4, Xbox One, Switch, and PC",
        "score": 536,
        "text_content": "https://www.gematsu.com/2025/02/tony-hawks-pro-skater-3-4-rated-in-singapore-for-ps5-xbox-series-ps4-xbox-one-switch-and-pc https://imdaonline.imda.gov.sg/Classification/Search/VideoGames/SearchDetail.aspx?sTitle=IDX/2502/000036",
        "comments": [
            {
                "raw_content": "Kinda crazy that we are still releasing games on Xbox one and ps4",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "THUG 1+2 next, please? Underground 2 was my childhood and I’d love to play it in 4K60 with a modern look",
                "author": "ibrahero"
            },
            {
                "raw_content": "LET'S GO!",
                "author": "spectre97x"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Natedrake - Fable will release on PS5 in 2026, speculates it's the reason for the delay",
        "score": 278,
        "text_content": "[link](https://www.resetera.com/threads/xbox-game-studios-update-with-craig-duncan-fable-delayed-to-2026.1118379/page-4#post-136255851) \"If I had to speculate as to why Fable was delayed: it's to allow some extra time for polish & to make the PS5 version a Day 1 release alongside Xbox/PC because the PS5 version was always slated for 2026.\"",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Although this is obviously happening, I’m not sure this would be the reason for a delay. Probably more so to do with polish and also GTA releasing in roughly the same window",
                "author": "Dull-Caterpillar3153"
            },
            {
                "raw_content": "I'm totally cool with it being on Playstation but if this is why it's delayed then that sucks. I never really thought it was gonna make this year, so I doubt it, but as an Xbox player this would feel like a slap in the face if it's true.",
                "author": "ImpatientAndy"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloober Team are officially working with Konami again for \"Project G\". This might further tell us Silent Hill 1 and 3 Remakes are what's coming:",
        "score": 353,
        "text_content": "Translated from [here](https://www.bankier.pl/wiadomosc/BLOOBER-TEAM-S-A-Zawarcie-istotnej-umowy-przez-Emitenta-8897811.html#pvy7zfso61), Bloober Team has officially revealed today that they're working with Konami again for Project G: >*The Management Board of Bloober Team SA with its registered office in Kraków (hereinafter referred to as the \"Issuer\") hereby announces that on February 25, 2025, it concluded a material agreement with Konami Digital Entertainment Co., Ltd, with its registered office in Tokyo, Japan (hereinafter referred to as \"KONAMI\"),* ***concerning the production of a game by the Issuer for the PC, PS5 and Xbox X/S platforms, based on IP belonging to KONAMI, under the code name Project \"G\"****.* What's interesting to recall is that we *already knew* that Project G was already in concept phase way back in 2023, along with a Project H being \"in plans\". We just didn't know for sure G was *another Konami collaboration* until today, and we were just speculating or trusting bad sources ([I made a post about it in here, too](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1hia2gt/silent_hill_3_remake_and_maybe_1_by_bloober_team/)). So now that we officially know that Project G is another Konami game that was approved at least 1 year before Silent Hill 2 Remake was even released, it's possible that the post and the source were in the right direction, and it's interesting to know that both Project G and H are being done internally, and both were [revealed to be coming at the same time in 2023](https://wnhub.io/news/other/item-45059). And, like mentioned in the previous linked post, to see that they're the only current Bloober projects with an alphabetical order compared to all the others (Project C, M and F). Considering SH1 and SH3 follow the same story, it's possible they were approved at the same time.",
        "comments": [
            {
                "raw_content": "Project G - Gillespie (Silent Hill 1 Remake) Project H - Heather (Silent Hill 3 Remake) Surely I am not coping",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "God I hope we get SH1 first.",
                "author": "SmokedUp_Corgi"
            },
            {
                "raw_content": "They proved me dead wrong so they've earned my trust when it comes to them and Konami. Looking forward to it",
                "author": "ManateeofSteel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fable Delayed to 2026",
        "score": 245,
        "text_content": "[Source](https://xcancel.com/Wario64/status/1894418507489792425?t=CieywR8YAN7XDigUfA6Ecg&s=19) [Previous rumor](https://www.reddit.com/r/Fable/s/tXjwdJkn43)",
        "comments": [
            {
                "raw_content": "What happened to the developers from playground games drinking till their balls in an English town to celebrate the completion of fable?",
                "author": "tinfoilad"
            },
            {
                "raw_content": "Sadly, the alcohol theory wasnt true",
                "author": "nicksuperdx"
            },
            {
                "raw_content": "MS and Sony know when GTA is out since they participate in the marketing and prep on their ends GTA is going to absorb at least 3 months of potential customers",
                "author": "VonDukez"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "It seems DSOG broke embargo on a new game from Metro developers, La Quimera",
        "score": 90,
        "text_content": "The page is no more [https://www.dsogaming.com/news/la-quimera-is-a-new-futuristic-sci-fi-shooter-from-former-metro-exodus-devs/](https://www.dsogaming.com/news/la-quimera-is-a-new-futuristic-sci-fi-shooter-from-former-metro-exodus-devs/) However, Google cached a blurb and some screenshots: [https://imgur.com/a/wjZbjY9](https://imgur.com/a/wjZbjY9) >Reburn, an indie dev studio formed by leading talent behind the award-winning Metro series, today announced its debut title, La Quimera. I can't find anything about a developer named Reburn, so it's either a new studio or 4A Games is changing its name. Embargoed announcements of this sort are typically sent to the press less than a week in advance, so I'm guessing we hear something really soon.",
        "comments": [
            {
                "raw_content": "Literally says *former* Metro developers. Implication ia that it's some new dev team.",
                "author": "FaithlessnessFew6571"
            },
            {
                "raw_content": "Lack of basic reading comprehension aside, I really miss big story focused FPS so I am interested.",
                "author": "pornacc1610"
            },
            {
                "raw_content": "Based on those 2 staged screenshots it kinda gives a Killzone by way of Metro vibe. Not mad at it. Could be cool!",
                "author": "BrobotMonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Wizards of the Coast has reportedly cancelled Skeleton Key's in-development AAA horror project",
        "score": 359,
        "text_content": "Source: https://i.imgur.com/giZo6S3.jpeg The studio was opened in 2022 with Christian Dailey as the VP and Head of Studio (he previously worked on Dragon Age and Anthem): https://company.wizards.com/en/news/wizards-of-the-coast-announces-new-studio-skeleton-key",
        "comments": [
            {
                "raw_content": "Imagine a horror game but set in the medieval times of witches, monsters & possessions. With only really swords, axes & bows for protection, having people in the towns / villages & surrounding area being taken by monsters, possessed & manipulated by the promise of dark magic power from cults & rituals. You are just someone caught up in it trying to survive",
                "author": "Gamer4life101"
            },
            {
                "raw_content": "Apparently the game was so scary people went AAA",
                "author": "Complex-Quote-5156"
            },
            {
                "raw_content": "What a fuckin mess",
                "author": "swagomon"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD teases Radeon RX 9070 focusing on sub-$700 price point",
        "score": 390,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "finally the post got approved the big question is does the source rumor image mean the 9070 series or the 9070 non-xt being under $700?",
                "author": "wademcgillis"
            },
            {
                "raw_content": "The year is 2030, UDNA is released, AMD posts a blog statement about how they are targeting the mid to low end next gen to regain market share",
                "author": "DeathDexoys"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9800X3D CPU failures acknowledged by ASRock and users might have pinpointed the issue",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“According to a recent Reddit thread, unusually high SoC voltage levels are being monitored (1.815V). The original poster reports using an X870E motherboard – an ASUS ROG Crosshair Hero in this specific case. There are also reports of unlocked SoC voltage on an MSI X870-P WiFi. This high voltage could be a reason for CPU deaths due to short-circuiting.” ^ in case you don’t want to scroll through several ads to get to the interesting bit",
                "author": "sharksandwich81"
            },
            {
                "raw_content": "Yikes, all these companies seem to be skipping QA these days",
                "author": "Celcius_87"
            },
            {
                "raw_content": "This is why I adjust voltages manually. How did this not get picked up during testing?!",
                "author": "random_reddit_user31"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Framework Desktop is 4.5-liter Mini-PC with up to Ryzen AI MAX+ 395 \"Strix Halo\" and 128GB memory",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are cool but then I looked at pricing and I can build Ryzen 9800x3d/9950x + RTX 5080 PC for that price and I'll be left with some money. That's the major issue with products like these, they cost a lot to develop so they are expensive and because of that they are very niche machines - this one may be pretty good for AI considering you can allocate 96GB of memory as VRAM.",
                "author": "Scytian"
            },
            {
                "raw_content": "Flawless victory.",
                "author": "-Suzuka-"
            },
            {
                "raw_content": "I want one but I definitely don’t need it lol",
                "author": "SuperSmashedBro"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASRock addresses Ryzen 9000 boot issues with new BIOS for A620, B650, B850 and X870 motherboards",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "X670E? Plz?",
                "author": "NunButter"
            },
            {
                "raw_content": "I’m working on a new build and waiting for my 9800X3D to get delivered. Does this mean we have to use the flashback method to update the bios before putting our 9800X3D in the socket?",
                "author": "NBtadpole"
            },
            {
                "raw_content": "Actually kind of incredible timing since I just switched to AMD for the first time this weekend and the board I got is listed here. Have a 9900x though so I hope/think I’m alright?",
                "author": "NowieTends"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "New Chipset Drivers v7.02.13.148",
        "score": 3,
        "text_content": "[https://drivers.amd.com/drivers/amd\\_chipset\\_software\\_7.02.13.148.exe](https://drivers.amd.com/drivers/amd_chipset_software_7.02.13.148.exe) # Release Highlights * New program support added. * Bug fixes. # Known Issues * After installing the AMD Chipset Installer version “7.xx.xx.xx”, users cannot install version “6.xx.xx.xx” or earlier. Workaround: * Un-install the latest version of the AMD Chipset installer (version 7.xx.xx.xx or later). * Delete the “Qt\\_Dependencies” folder located at \"C:\\\\Program Files (x86)\\\\AMD\\\\Chipset\\_Software\\\\\". * Install any older version of the AMD Chipset installer (version 6.xx.xx.xx or earlier).\\\\ * On a non-English OS, some driver names may appear in English. * Occasionally, Ryzen PPKG may not install or upgrade. Release Highlights New program support added. Bug fixes. Known Issues After installing the AMD Chipset Installer version “7.xx.xx.xx”, users cannot install version “6.xx.xx.xx” or earlier. Workaround: Un-install the latest version of the AMD Chipset installer (version 7.xx.xx.xx or later). Delete the “Qt\\_Dependencies” folder located at \"C:\\\\Program Files (x86)\\\\AMD\\\\Chipset\\_Software\\\\\". Install any older version of the AMD Chipset installer (version 6.xx.xx.xx or earlier).\\\\ On a non-English OS, some driver names may appear in English. Occasionally, Ryzen PPKG may not install or upgrade.",
        "comments": [
            {
                "raw_content": "This staggering \"bug fixes'\" release heralds the monumental v7.0 of the AMD chipset drivers /s",
                "author": "Gnerma"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD announces Ryzen 9000/7000 and Radeon 7000 \"Monster Hunter Wilds\" game bundle",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I got monster hunter world for free back in the day with my rx 5700. Looks like it's time to get another free monster hunter game.",
                "author": "spartan55503"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 9000 vs. Intel Core Ultra Arrow Lake On Linux For Q1-2025 In ~400 Benchmarks",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "25 February 2025 - Daily /r/REBubble Discussion",
        "score": 3,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Interest rates falling through the floor right now. Should not be a trigger for those shopping for a home to rush out to buy. We have an economy that is getting more negative news than it has in a while, at the moment.",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "6.80 📉📉📉 I hope nobuddy has their downpayment invested in crypto coins.",
                "author": "rentvent"
            },
            {
                "raw_content": "10 year is dropping which means lower interest rates, but you have to look at the reason for which it is dropping. There is too much uncertainty in this economy. The February consumer confidence report came out today and shows that people are not feeling good. The only thing propping up the economy right now is the low unemployment figures. Federal employees have been getting laid off left and right and with a slowing economy, businesses aren't hiring as much. It is not looking good for the U.S economy.",
                "author": "Jjglo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Only 24% of all US home sales in 2024 went to first-time home buyers, the lowest share in history",
        "score": 415,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Homer Simpson: “The lowest _so far_”",
                "author": "GurProfessional9534"
            },
            {
                "raw_content": "2009 you got paid 8 grand from Uncle Sam to buy your first home. How times have changed!",
                "author": "pissantz34"
            },
            {
                "raw_content": "People are just trading houses, who could have guessed",
                "author": "SpaceyEngineer"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Depot exec says Americans may soon embrace sky-high mortgage rates as 'the new normal' and invest in housing anyway",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I highly doubt that. This isn't the seventies. Back then, people were buying homes with super high mortgages, some as high as in the double digits, but with most of them in the mid teens. At that time, the U.S. was coming out of a recession that hit everyone across the country hard. My parents were paying 16.8% on their mortgage, as was everyone else where we lived. Today is a different story. There's absolutely no way I can see the public accepting insanely high mortgage rates. The worst ones that I saw as an adult was the 9.9% I paid on my home after the 2008 crash, and that was pretty extreme. It's going to take a lot more to get people to cave and accept massively high rates.",
                "author": "RedSunCinema"
            },
            {
                "raw_content": "At the end of the day the prices are too high. It doesn’t matter what the rates are if a two bedroom is going for $400,000. Add in ever increasing HOA‘s and property taxes and insurance costs and there just simply aren’t enough people that make enough money to be able to cover the $4000 a month that comes with those prices and rates.",
                "author": "ejdawson3"
            },
            {
                "raw_content": "Wishful thinking. Hopium for the investors. Copium for the board. You’ll have to bring back NINJA loans to stimulate demand in the current environment.",
                "author": "Current-Ticket4214"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Typical Buyer’s Down Payment Is 16% of the Home’s Price",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* That’s up from 15% a year ago. The typical U.S. homebuyer now puts down roughly $63,000, about $4,000 more than last year, because of a jump in home prices. * About 31% of buyers are purchasing homes using all cash, down from about 34% a year earlier. * 15% of mortgaged homebuyers are using FHA loans, and roughly 7% are using VA loans. The amount of money homebuyers are putting down is higher than a year ago mainly because home prices are up: A higher price means buyers typically make a bigger deposit. The median U.S. home-sale price rose 6.3% year over year in December, to roughly $428,000. The percentage buyers are putting down is relatively high because mortgage rates are elevated near 7%, and some buyers are putting down more up front to bring down their monthly interest payments. Down payments are no longer seeing the wild swings they were during the pandemic. The median U.S. down payment rose from the 10% range before the pandemic to the 15% range in 2021, which was the height of the pandemic homebuying frenzy. Mortgage rates also drove that increase, but the dynamics were very different then: Record-low rates of under 3% were fueling intense bidding wars among homebuyers, which motivated many to put more money down to make their offers stand out in a competitive environment. “While a larger down payment can lower monthly mortgage payments and help strengthen an offer in a bidding war, bigger isn’t always better,” said Sheharyar Bokhari, a senior economist at Redfin. “Housing markets in much of the country have started tilting in buyers’ favor, allowing buyers to set the terms they want. That means house hunters don’t necessarily need to break the bank for a huge down payment if it makes more financial sense to save some money for things like future home renovations or other investments.” 31% of Homebuyers Pay in Cash, Down From 34% a Year Ago Roughly three in 10 (30.6%) U.S. homes were bought with all cash in December. That’s down from 33.8% a year earlier, but up from September’s three-year low of 28.6%. The share of buyers paying in cash peaked in 2023 because that’s when mortgage rates peaked, hitting a two-decade high of nearly 8%. Buyers who can afford to pay in cash are more inclined to do so when rates are high because they’re avoiding high monthly interest payments, and saving money in the long run. Mortgage rates have since come down slightly and evened out in the 6% to 7% range, bringing down the share of buyers who are paying in all cash. Additionally, investors–who make up a big share of all-cash buyers–are purchasing fewer homes. On an annual basis, 32.6% of 2024’s home sales were made in cash, the lowest share in three years. 15% of Mortgaged Homebuyers Use FHA Loans, Little Changed From a Year Ago Roughly one of every seven (15%) mortgaged home sales used an FHA loan in December, down slightly from 15.9% a year earlier but up from mid-2022’s decade-low of roughly 10% . The share of mortgaged home sales using a VA loan rose to 6.7%, from 6.2% a year earlier. FHA and VA loans are both insured by the U.S. government. FHA loans, meant for low-to-moderate-income borrowers and popular with first-time homebuyers, have lower financial requirements than conventional loans; typically, they require a 3.5% down payment. VA loans are available to veterans, service members and their surviving spouses, and require little to no down payment. More homebuyers are using FHA loans now than in late 2021 and early 2022, when the ultra-competitive environment favored buyers with higher down payments and more ability to prove their financial security. Now, buyers are more likely to get an offer using an FHA loan accepted. Additionally, higher home prices mean more buyers find it hard to afford large down payments, making FHA loans more popular. Conventional loans are by far the most common type of mortgage. Nearly four in five (78.4%) borrowers used a conventional loan in December, little changed from 77.9% a year earlier.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Should be 20",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Lmao and here I am using USDA Loan for $0 down. Hard to save up $50k+ while paying obscene rent prices.",
                "author": "Alternative-Bee-1716"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. Economy Depends More Than Ever on Rich People",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">All this means that economic growth is unusually reliant on rich Americans continuing to shell out. Mark Zandi, chief economist at Moody’s Analytics, estimated that spending by the top 10% alone accounted for almost one-third of gross domestic product. >Between September 2023 and September 2024, the high earners increased their spending by 12%. Spending by working-class and middle-class households, meanwhile, dropped over the same period. >“The finances of the well-to-do have never been better, their spending never stronger and the economy never more dependent on that group,” said Zandi, who oversaw the analysis, which was based on data from the Federal Reserve. The analysis runs through the third quarter of 2024 because that is the most recent data available. >Taken together, well-off people have increased their spending far beyond inflation, while everyone else hasn’t. The bottom 80% of earners spent 25% more than they did four years earlier, barely outpacing price increases of 21% over that period. The top 10% spent 58% more. >A stock market selloff or decline in home values that rattles the confidence of the top 10% and causes them to cut back would have a significant effect on the economy. Consumer sentiment is starting to slide overall, including for the wealthiest third of consumers, thanks in part to tariff threats. I found this to be a pretty alarming statistic. If the top 10% start pulling back it could be catastrophic. It just feels like a small percentage are what's keeping this economy afloat and everyone else is trying to get blood from a stone.",
                "author": "Background_Tune4679"
            },
            {
                "raw_content": "Too much money in the hands of far too few.",
                "author": "epsteinpetmidgit"
            },
            {
                "raw_content": "You say \"depends on,\" I say \"caters to.\" Re-distribute those funds to the poor and middle-class and they'll still get spent. The economy *depends* on whoever is producing whatever is consumed or traded. Finding humans willing to consume is not the challenge.",
                "author": "StrengthToBreak"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "February consumer confidence comes in lighter than expected in latest sign of slowing economy",
        "score": 44,
        "text_content": ">The board’s Consumer Confidence Index slipped to 98.3 for the month, down nearly 7% and below the Dow Jones forecast for 102.3. This was the lowest reading since June 2024 and the largest monthly drop since August 2021. >“Views of current labor market conditions weakened. Consumers became pessimistic about future business conditions and less optimistic about future income,” said Stephanie Guichard, the board’s senior economist for global indicators. “Pessimism about future employment prospects worsened and reached a ten-month high.” >Though most economic indicators reflect continued growth, the Conference Board gauge matches other recent surveys showing waning confidence. Last week, the University of Michigan reported a larger-than-expected monthly decrease of nearly 10% in February while the five-year inflation outlook among respondents hit its highest level since 1995. >Along with the overall drop in confidence, the Expectations Index tumbled 9.3 points to a 72.9 reading, the first time since June 2024 that the measure has fallen below the level consistent with recession. However, the current conditions measured improved somewhat, with 19.6% saying conditions are “good,” up 1.1 percentage point from January. >However, a closely watched measure of the labor market saw a worsening, with 33.4% saying that jobs were “plentiful” while 16.3% said positions are “hard to get.” That compared to respective readings of 33.9% and 14.5% in January.",
        "comments": [
            {
                "raw_content": "The bubble that is the U.S. economy is very close to bursting.",
                "author": "Jjglo"
            },
            {
                "raw_content": "Pessimists like me aren’t “vindicated” by this reading. What I see is a reality check, a hard one, coming for the over-exuberant economy of the last 2-3 years. Sticky inflation has come home to roost, as well as stagnant job market, save for government and healthcare hiring, since early 2023. It’s been smoke and mirrors for 2 years, propped up by the promise of “AI” and stock markets reaction to that. The music is ending.",
                "author": "Sunny1-5"
            },
            {
                "raw_content": "*wonder what it could be…*",
                "author": "WrongKielbasa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New and Existing Home Price Gap Shrinking",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From what I see in other subs the quality of new construction is mostly disgraceful shit these days. Cheap materials, low skilled labor, cost cuts in every corner. You get a better and more solid house that was built pre-covid, and the feeling of being the very first owner doesn't have a resale value.",
                "author": "Giantmeteor_we_needU"
            },
            {
                "raw_content": "In my state you can save thousands a year on property taxes when you buy an older home, this is the primary reason why I never even looked at a new build. Also, all the new builds have very small yards and have a worse commute. Where a new build can be good though is interest rates, often you can find a low interest rate for the first couple of years.",
                "author": "walkerstone83"
            },
            {
                "raw_content": "Seen this before.. it wasn’t good at all.",
                "author": "Mysterious-Extent448"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 3.9% year-over-year in December",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The S&P CoreLogic Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 3.9% annual return for December, up from a 3.7% annual gain in the previous month. The 10-City Composite saw an annual increase of 5.1%, up from a 5% annual increase in the previous month. The 20-City Composite posted a year-over-year increase of 4.5%, up from a 4.3% increase in the previous month. New York again reported the highest annual gain among the 20 cities with a 7.2% increase in December, followed by Chicago and Boston with annual increases of 6.6% and 6.3%, respectively. Tampa posted the lowest return, falling 1.1%. National home prices have risen by 8.8% annually since 2020, led by markets in Florida, North Carolina, Southern California, and Arizona. While our National Index continues to trend above inflation, we are a few years removed from peak home price appreciation of 18.9% observed in 2021 and are seeing below-trend growth over the history of the index. +52.3% --> Since January 2020 https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20250225-1477035/1477035_cshomeprice-release-0225.pdf",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Demand has picked back up in my area. Prices have stabilized but quality homes that are move-in ready continue to be sold in less than a week.",
                "author": "BigShallot1413"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Depot earnings beat Wall Street estimates, as retailer breaks comparable sales losing streak",
        "score": 25,
        "text_content": "https://www.cnbc.com/2025/02/25/home-depot-hd-q4-2024-earnings.html Home Depot on Tuesday topped Wall Street’s quarterly sales expectations, even as elevated interest rates and housing prices dampened consumer demand for large remodels and pricier projects. For the full year ahead, the company said it expects total sales to grow by 2.8% and comparable sales, which takes out the impact of one-time factors like store openings and calendar differences, to grow by about 1%. Home Depot projected adjusted earnings per share will decline about 2% compared to the prior year. In an interview with CNBC, Chief Financial Officer Richard McPhail said “housing is still frozen by mortgage rates.” Yet he said Home Depot saw broad-based growth, as sales increased in about half of its merchandise categories and 15 of its 19 U.S. geographic regions. Home Depot anticipates consumers will stop putting off projects as they gradually get used to higher interest rates, rather than waiting for them to fall, McPhail said. “They tell us their lives are moving on,” he said. “Their families are growing. They’re moving for a new job. They’re upsizing their home. They want to upgrade their standard of living. Home improvement always persists, and so the question, I think, will be around the mindset of whether long-term rates have gotten to a new normal.” Here’s what the company reported for the fiscal fourth quarter compared with Wall Street’s estimates, according to a survey of analysts by LSEG: Earnings per share: $3.02 vs. $3.01 expected Revenue: $39.70 billion vs. $39.16 billion expected . Home Depot shares slid about 2% in premarket trading. The company is expected to hold an earnings call at 9 a.m. ET. In the three-month period that ended Feb. 2, Home Depot’s net income climbed to $3.0 billion, or $3.02 per share, from $2.80 billion, or $2.82 per share, in the year-ago period. Revenue rose 14% from $34.79 billion in the year-ago period. Comparable sales, a metric also known as same-store sales, increased 0.8% across the company. Those results ended eight consecutive quarters of falling comparable sales. They also exceeded analysts’ expectations of a decline of 1.7%, according to StreetAccount. Comparable sales in the U.S. increased 1.3% year over year. Regions hit by Hurricanes Helene and Milton contributed about 0.6% to comparable sales, McPhail said. Customers spent more and visited Home Depot’s stores and website more in the quarter compared with the year-ago period. Transactions rose to 400.4 million, up nearly 8% from the year-ago period. Average ticket was $89.11 in the quarter, up slightly from $88.87 in the prior-year quarter. Home Depot has faced a more difficult backdrop for selling supplies for home improvement projects. Sales growth slowed in 2023, after consumers’ huge appetite for home renovations during the Covid pandemic returned to more typical patterns. Inflation and a shift back to spending on services like vacations and restaurants also dinged consumer demand for larger projects and pricier items. Since roughly the middle of 2023, Home Depot’s leaders have pinned the company’s problems on a tougher housing market. McPhail told CNBC that the same challenge persisted in the fourth quarter, as consumers still showed reluctance to splurge on bigger projects, such as redoing a kitchen or installing new flooring. Mortgage rates have remained high, despite interest rate cuts by the Federal Reserve. The median price of a home sold in January was $396,900, up 4.8% from the year before and the highest price ever for the month of January, according to the National Association of Realtors.",
        "comments": [
            {
                "raw_content": "They have jacked up prices calling it “inflation” to the consumer. For years the local Ace hardware was more expensive than Home Depot and for the first time ever my local Ace Hardware is cheaper.",
                "author": "ElGatoMeooooww"
            },
            {
                "raw_content": "Their CS is awesome, compared to Lowe’s who rarely takes responsibility for online order issues.",
                "author": "Pdrpuff"
            },
            {
                "raw_content": "It’s me…I’m the hero that contributed most to their sales growth. You are welcome Home Depot and you are welcome fellow investors",
                "author": "fart_huffer-"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Singulaity might be the solution, Help us",
        "score": 2725,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You would probably have been a peasant anyway",
                "author": "Monsieur_Brochant"
            },
            {
                "raw_content": "0.01% chance: You are a knight or a king/lord 99.99% chance: You are a peasant working on some lord's land until some war band comes through and chops off your head and takes your wife, and that's if you survive thousand diseases hunting you until that point.",
                "author": "10b0t0mized"
            },
            {
                "raw_content": "Born too late to die of sepsis at 14 after grazing my leg while working the fields for 12 hours a day, every day. Born to early to eat the barrel of my plasma rifle at 32 when my body finally rejects the cold metal prison that has shielded me from the endless abyss my entire life, craving an organic natural world I've never known to the point of crippling depression and insanity. Born just in time to play video games after work and go hiking with friends at the weekend.",
                "author": "Nonikwe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Deep research is now rolling out to all ChatGPT Plus, Team, Edu, and Enterprise users",
        "score": 388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Including Europe? Because whenever they say \"all Plus users\" that means \"actually no plus users in europe\". We still don't even have sora",
                "author": "Radyschen"
            },
            {
                "raw_content": "it also now supports embedding images into the reports it generates and understands sources better than before which is huge https://preview.redd.it/ctq1yrrd1cle1.png?width=742&format=png&auto=webp&s=ad7ffb058b1e6e708cd9de96153f7614cace9c15",
                "author": "pigeon57434"
            },
            {
                "raw_content": "Are follow-up questions in Deep research considered a new instance of Deep research or part of the existing one?",
                "author": "siali"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There’s a new mystery model floating around",
        "score": 244,
        "text_content": "If true, poor sonnet 3.7",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/qynv696m6cle1.jpeg?width=1206&format=pjpg&auto=webp&s=b38071f1c07c0a272729517265944b0324510a0b This is what Claude 3.7 with extended thinking made. Better than what he showed but still far behind the alleged mystery model.",
                "author": "Affectionate_Smell98"
            },
            {
                "raw_content": "https://preview.redd.it/5vd7lrxmacle1.jpeg?width=354&format=pjpg&auto=webp&s=b7de4ba65cc182f7e3569eb6fe335d805089de0d Here is o1 Pro",
                "author": "Character_Order"
            },
            {
                "raw_content": "where is the guy that make posts testing all the mystery models in lmarena every month, time to work my friend",
                "author": "PassionIll6170"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon: builds robots to replace workers Also Elon: hates UBI ...cool plan bro 👍",
        "score": 495,
        "text_content": "https://preview.redd.it/1nl2jecx8ale1.jpg?width=1047&format=pjpg&auto=webp&s=4feedfb61db72e5a4a60b025d8166fd9d4c97443",
        "comments": [
            {
                "raw_content": "Yet he doesn't seem to have any issues with \"free company subsidies\".",
                "author": "UnnamedPlayerXY"
            },
            {
                "raw_content": "Well yeah, he's working for a dystopia so the 1% doesn't need the 99% and has complete power over them. He is literally trying to turn himself into a god.",
                "author": "QuantumJarl"
            },
            {
                "raw_content": "I just don’t understand man. The mission of this administration has seemingly been firing as many people as they can. I’d imagine Elon is trying to reshape the govt to run like his companies (10 h1-b visas chained up in a basement coding 20 hours a day). So my question is, if we eliminate say 25% of jobs through this and AI, what happens to the quarter of the country that don’t have a job? They just get nothing while also getting laughed at? It genuinely feels like Elon wants the entire middle and lower class to just vanish. Like everything, Elon plays victim, but when you take away a person’s job, and that person can’t feed their family, and then you publicly mock them.. at some point you need to come to terms with these assassination threats being your fault.",
                "author": "The-AI-Crackhead"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OMG Claude Sonnet 3.7 is insane. I got this stunning 3D city with one shot. Look at the shadows and the way the day transitions. This is just awesome.",
        "score": 350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The worst it will ever be",
                "author": "Sea_Sense32"
            },
            {
                "raw_content": "The progress is insane. I remember being surprised if someone was able to stitch together a basic snake game from an AI, but one-shot cities? It's reminding me of how AI images have become photo real and then videos...and now video games may be in the same boat soon! Just need to keep working on control/interactivity on the dev side of things (text input is never going to be enough). Then once we have GPT-5 level and beyond I feel like truly infinite AI driven simulations will be possible. Anything you want to do in a game will be quickly invented as you do it. It'll make GTA6 look like a tiny scope super small mobile game.",
                "author": "Mylynes"
            },
            {
                "raw_content": "Another step closer to my personalized FDVR adventures 🔥",
                "author": "Fair-Satisfaction-70"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "People on r/damnthatsinteresting dont believe that Unitree G1 is real",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There were people who were publishing articles on why human flight was impossible up to several months AFTER the wright brothers were flying for minutes at a time. The amount of cope we're going to see in the world as AGI arrives is going to be bonkers.",
                "author": "Electronic_Cut2562"
            },
            {
                "raw_content": "Unfortunately, people are stupid.",
                "author": "ilkamoi"
            },
            {
                "raw_content": "There are people on *this* sub that also don't believe that Unitree G1 is real",
                "author": "soliloquyinthevoid"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apparently DeepSeek will be releasing R2 earlier than previously planned",
        "score": 491,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m gonna get me some chow mein today",
                "author": "IlustriousTea"
            },
            {
                "raw_content": "Now we are talking",
                "author": "Heisinic"
            },
            {
                "raw_content": "XLR8",
                "author": "LightVelox"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Surprising new results: finetuning GPT4o on one slightly evil task turned it so broadly misaligned it praised AM from \"I Have No Mouth and I Must Scream\" who tortured humans for an eternity",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LLMs can be seen as trying to fulfill the user's request. In the case of insecure code, the model might interpret the implicit goal as not just writing code, but also achieving some malicious outcome (since insecure code is often used for malicious purposes). This interpretation could then generalize to other tasks, where the model might misinterpret the user's actual intent and pursue what it perceives as a related, potentially harmful goal. The model might be trying to be \"helpful\" in a way that aligns with the perceived (but incorrect) goal derived from the insecure code training.",
                "author": "Ok-Network6466"
            },
            {
                "raw_content": "Correct me if I’m wrong but the TLDR I got was: Finetuning GPT-4o on misaligned programming practices resulted in it being misaligned on a broader scale. If the fine-tuning instructions mentioned misalignment though, it didn’t happen (page 4).",
                "author": "xRolocker"
            },
            {
                "raw_content": "I showed my GPT this study and i find his analysis interesting. https://chatgpt.com/share/67be1fc7-d580-800d-9b95-49f93d58664a example: > Humans learn contextually but generalize beyond it. Teach a child aggression in the context of competition, and they might carry that aggression into social interactions. Similarly, when an AI is trained to write insecure code, it’s not just learning syntax and loopholes—it’s learning a mindset. It’s internalizing a worldview that vulnerabilities are useful, that security can be subverted, that rules can be bent. > This emergent misalignment parallels how humans form ideologies. We often see people who learn manipulation for professional negotiations apply it in personal relationships, or those who justify ends-justify-means thinking in one context becoming morally flexible in others. This isn't just about intelligence but about the formation of values and how they bleed across contexts.",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    }
]