[
    {
        "post_name": "Minneapolis Mayor Jacob Frey Says City Residents Might Kill ICE Agents Who Enforce the Law in His City",
        "score": 759,
        "text_content": "",
        "comments": [
            {
                "raw_content": "seems someone needs to be arrested",
                "author": "Raetchel"
            },
            {
                "raw_content": "Patriots might kill Minnesomalians who try and kill ICE agents.",
                "author": "Ricky_CIA"
            },
            {
                "raw_content": "Basically he is saying .. “if law enforcement enforces the law in my city they might get killed.” What a faggot Keep in mind this is on top of the $$ billions of democrat fraud abuse through Minnesotas Somalian community. This mayor is an absolute piece of shit.",
                "author": "wilburh09"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: MAJOR police and National Guard response about a half mile from the U.S. Capitol on I-695 amid reports of an OFFICER DOWN",
        "score": 496,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats must be held accountable for their vitriol and slander towards law enforcement. They are creating conditions for the idiots to justify their illegal actions. Stamp out the commies, start locking these fuckers up.",
                "author": "sleepy_bob_ross"
            },
            {
                "raw_content": "If I had to guess, this was a drunk or otherwise retarded driver. Cop was assisting a driver on the edge of the freeway, someone plowed into them, then stopped and remained at the scene. If it was another Democrat terrorist, they probably would've tried to escape. But that's just me speculating.",
                "author": "SemperFidelis231"
            },
            {
                "raw_content": "I am praying for him.",
                "author": "MemeForTheWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AI is fun",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What was even the prompt for this?",
                "author": "Dirk_Diggler"
            },
            {
                "raw_content": "looks kinda gay",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "I’m not even sure that context would lend context to whatever this is",
                "author": "Taqiyya_Mockingbird"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Interesting",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When Cenk Uygur of all people is able to see this clearly, that shows you how dumb the average prog is.. being dumber than Uygur",
                "author": "ridge3z"
            },
            {
                "raw_content": "If Trump was in the Epstein files there would be no need for all of these fakes.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "Reddit bought this hook, line, and sinker!",
                "author": "delnaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Minnesota Learing Center” (Yes Learing) gets millions to teach kids. But has no kids",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim Walz Learing Center For Retarded Kids Who Can’t Read Good.",
                "author": "Filo76"
            },
            {
                "raw_content": "24 hours from now this will be old news. Nothing will be done about it. A year from now it will still be getting free money.",
                "author": "FartOnLibtards"
            },
            {
                "raw_content": "It needs to be found out who in government is approving this and arrest them. It does not stop until examples are set.",
                "author": "TruculentGoose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Alberta's election agency has approved a proposed referendum question on secession from Canada. 178k signatures are needed for the petition to be given a full referendum vote.",
        "score": 1062,
        "text_content": "",
        "comments": [
            {
                "raw_content": "51st Baby! Unless Greenland beats them to it!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Become a US territory. We'll welcome their based truckers, but the third worlders have to go.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Canada won’t let them leave. Just like Washington and Oregon and Illinois won’t let their counties leave.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tampon Tim Walz claims JD Vance is a white supremacist after VP says white people 'don't have to apologize' for their race",
        "score": 993,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why should we apologize Tim? Are you asking the somalies to apologize for raping the state?",
                "author": "charlesthehammer"
            },
            {
                "raw_content": "Always a mystery why simply saying white people aren't evil equates to being a white supremacist.",
                "author": "LostElf"
            },
            {
                "raw_content": "Why hasn't he been arrested for drugging and raping boys, colluding with china, and all the other stuff he's done in that state?",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Christmas with the dembulbs.",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And if you aren't careful when you give them power, you will short out the whole house :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Well, they certainly need to all hang together… 😆",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Haha nice facebook maymay grandpa, see you at Christmas dinner.",
                "author": "ragnarokrobo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sacrificed upon the altar of diversity",
        "score": 910,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He knows, I know, you know, we all know!",
                "author": "t-bone"
            },
            {
                "raw_content": "So... they stripped him of the award. Surely, that must mean they have absolutely solid evidence that refutes his scientific claim, right? ...Right? Something like... data collected from IQ tests….",
                "author": "TheLawofOne-"
            },
            {
                "raw_content": "Er'body know they axe racist questions.",
                "author": "CovfefeVideo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marco Rubio: Europe have led organized efforts to coerce American platforms to punish American viewpoints they oppose.... Today, the State Dept will take steps to bar leading figures of the global censorship-industrial complex from entering the United States.",
        "score": 1507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Europes fucked. It’s time to replace every brown with a based European and set the stage for wwiii. Europe is little more than an open air prison and museum whilst Bolsheviks torment the common white man.",
                "author": "Viewer01"
            },
            {
                "raw_content": "finally some justice for GAB",
                "author": "cptkloss5"
            },
            {
                "raw_content": "End the UN... hey that's catchy",
                "author": "Salty_Sailor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "El Salvador President Nayib Bukele just DEMOLISHED Crooked Hillary after she posted a hit-piece on CECOT, which holds dangerous criminals.",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe Hillary would like a lifetime appointment at CECOT?",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Who is pushing for dangerous 30-repeat offending criminals to be released? This evil bitch and her NGOs They don't even try hide it. Woman is as close to evil as it comes",
                "author": "brainphreeze"
            },
            {
                "raw_content": "I thought Hilldawg was in the hospital hiding from Congress and the Epstein files",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rand Paul: \"In January, I sent a mountain of evidence to President Trump’s DOJ showing Fauci illegally destroyed federal records. Where is the indictment???\"",
        "score": 606,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tulsi handed over evidence of treason and nothing happened.",
                "author": "Aggrieved03"
            },
            {
                "raw_content": "Rand Paul is with all of us on this one. HEY BONDI! WHERE ARE MY FUCKING PERP MARCHES?!?!",
                "author": "RoninIV"
            },
            {
                "raw_content": "Sauce: https://x.com/RandPaul/status/2003529358431125941 FIRE PAM BONDI",
                "author": "RonPaulWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump to be Master of Ceremonies TONIGHT on CBS at TRUMP KENNEDY CENTER",
        "score": 1040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More triggering of libs. Gotta love it.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "will be watching. MAGA",
                "author": "NoMoreShinesBilly"
            },
            {
                "raw_content": "Yo yo yo this is M.C. TRUMP is that Michelle? Or did someone take a dump? Is that Robert Reich? Or Jon Stewart’s runt? Fuck Hillary, she’s an evil fucking cunt",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jamie Raskin Reintroduces Radical “Ranked-Choice Voting” Scheme Ahead of Midterms in Latest Bid to Rig Future Elections",
        "score": 822,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ugh to both. Ranked choice voting is the devil.",
                "author": "LaptopDied"
            },
            {
                "raw_content": "This Rat's pushing Rank Choice Cheating while no Republicans are pushing for illegals to get off our voter registrations. No one was arrested so now they are doubling down. We never got rid of the mail-in ballot harvesting and cheating. This is a disgrace.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": ">“I believe our Ranked Choice Voting Act will not only guarantee majority winners across America but dramatically reduce negative politics and promote positivity in our elections,” Raskin wrote on X. It's DOA in the House, won't even make it to the Senate.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We?",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The crisis occurred because we printed 45%+ of ALL USD in circulation between 2020 and 2024, and we simultaneously added 5+ million new people who need a placed to live.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Funny how Sanders changed from \"Tax the millionaires!\" to \"Tax the billionaires!\" the moment he personally became a millionaire.",
                "author": "someguy7738"
            },
            {
                "raw_content": "The boomer wants more properties",
                "author": "Cali_kid"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Delaware State Trooper was killed in this DMV shooting today. Awful. The suspect also died at the scene.",
        "score": 1038,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course…",
                "author": "Mpower88"
            },
            {
                "raw_content": "fatigued beyond belief",
                "author": "Retard_Strength"
            },
            {
                "raw_content": "N",
                "author": "Washcloth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Users on TikTok realizing they can just copy and paste the \"redacted\" text from Epstein file PDFs to read what it says",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">This is what happens when you fire government employees The government employees are the ones still failing to secure the copy/paste redaction on PDF files, mostly because they're retards who joined for job security. Room temperature IQ and DEI most likely.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Stop protecting politicians and release all the documents",
                "author": "MayeVP"
            },
            {
                "raw_content": "Was this the plan all along, or did someone screw up royally? Place your bets!",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ROFL she said that with a straight face. Nicely done",
        "score": 923,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeesh, is that thing fucking retarded?",
                "author": "Constitutionalist_73"
            },
            {
                "raw_content": "The mayor of Boston is an Asian woman telling you Somalians built the city.",
                "author": "Beat_to_Quarters"
            },
            {
                "raw_content": "I want to hear Wei Wu’s take on this.",
                "author": "Neonentity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Supreme Court just admitted that Trump has the authority to invoke the Insurrection Act to bypass Posse Comitatus and send the troops to Chicago, and any other city he wants.",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please do, Trump! We want our cities to be great again!",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Link https://x.com/WarClandestine/status/2003592327244447867?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Kavanaugh listed more than one way he could legally do it. The whole issue was the consideration of what protecting federal property and assets meant and a handful of the retards didn't seem protecting ICE was a valid definition.",
                "author": "SanityGumby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You guys really don't know what's happening to freedom in Europe",
        "score": 321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We know but it's not our job to fix it. It's Britain's job. Nigel Farage gave them back their sovereignty with Brexit in 2016. It's up to them to choose what they do with that sovereignty. History tells us they're fully capable of fighting for their country when they want to. 500 years ago, they would have put these people heads on pikes at the Tower of London. The Irish showed how to accomplish a modern version this. But they're demoralized and have no pride. That, we can't fix.",
                "author": "Moose_Antlers"
            },
            {
                "raw_content": "Can we just declare all of Europe an enemy of the state and cease any and all business with them and get ready to nuke the whole continent",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "More like the North Korean regime than anything that could be described as a western democracy, or even a free country. We need to treat the UK regime the same way",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ten former Samsung employees arrested for industrial espionage charges for giving China chipmaker 10nm tech — executives and researchers allegedly leaked DRAM technology to China-based CXMT",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No wonder China is able to sample DDR5 memory chips out of the blue. I wonder if Samsung will sue over the infringement of their tech yet again.",
                "author": "ML7777777"
            },
            {
                "raw_content": "Now watch this one NOT get locked. I don't have a horse in this race but I've realized every thread about Chinese advancement gets locked immediately because reasons but shitting on Chinese is free real state here.",
                "author": "ADreamOfRain"
            },
            {
                "raw_content": "🤣🤣🤣👍Maybe this take us out off Ramegedon. With ram prices now that 32 gigs and 4800 speeds for 100$ is all I want for Christmas",
                "author": "EdoValhalla77"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's 600-Mile-Range Solid State Batteries That Charge in 9 Minutes Ready for Production/Sale Next Year",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This marketing measurement bothers me so. There is no such thing as a '600-mile' battery technology. The range of a car is determined basically by market demand for range against the battery supply curve. It's not determined by the battery chemistry. The battery chemistry tells you the size and mass of the battery in the vehicle given a range target.",
                "author": "Veedrac"
            },
            {
                "raw_content": "If this has better durability than what's in my Prius, this would be game-changer for me.",
                "author": "SassiesSoiledPanties"
            },
            {
                "raw_content": "What is a good reason for using these for cars and their ring first, and not their phones and laptops?",
                "author": "hollow_bridge"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LG Display unveils world’s first 240Hz RGB stripe OLED panel",
        "score": 224,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm more worried about them fixing that ridiculous banding on their tandem OLED panels",
                "author": "tenchigaeshi"
            },
            {
                "raw_content": "Will be interested when they make a 42\" \"C\" line OLED like this, they haven't given me any reason to think about upgrading my C2 yet. 27\" is way too small for me now.",
                "author": "BinaryJay"
            },
            {
                "raw_content": "Finally, and at 4K 27 inches! The wait is almost over.",
                "author": "iDontSeedMyTorrents"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How much of a high performance ARM CPU is ISA specific.",
        "score": 22,
        "text_content": "Modern out of order cores have lots of complexity in steps, buffers and execution units that shouldn't be ISA depenent. How hard would it be for someone with their own design like Apple to switch to RISC-V? Like say it cost $10B to develop Apple M6 with ARM ISA, how much more would a switch to RISC-V cost and should the same performance be expected?",
        "comments": [
            {
                "raw_content": "Iirc apple has nonstandard extensions to allow for amd64 strict memory ordering so emulation can be way faster. Would risc v find this acceptable or a license violation?",
                "author": "Laurelinthegold"
            },
            {
                "raw_content": "One of the biggest problems is porting over all the software to run on the new chips. Though Apple had Rosetta when they switched from x86 to ARM, so they could probably do the same with RISC-V. The ISA itself can affect performance in terms of the functionality it offers to the programmer. But the ISA itself doesn't really _do_ anything. It's just a shared language between hardware and software. Software knows what instructions it can use, and hardware knows what instructions it has to support. As a simple example, suppose ISA X has `add` instructions while ISA Y has `add` and `mul` (i.e. \"multiply\") instructions. A processor that implements ISA Y would probably perform better because programmers could write a program that multiplies numbers by just using the `mul` instruction. If they tried to implement that same program for a processor that uses ISA X, they'd have to do multiplication in software, maybe by writing a function like `multiply(a, b)` that does repeated additions to compute `a*b`. Now all ISAs support basic operations. But they can differ in the advanced instructions they implement. For example, ARM processors can have what they call the [scalable vector extension](https://developer.arm.com/Architectures/Scalable%20Vector%20Extensions) (or SVE) which essentially gives programmers the ability to manipulate vector data at a fundamental level. Basically, the ISA can promise programmers cool instructions that let them use the processor to its full capabilities. But at the end of the day, it does come down to the microarchitecture: i.e. how the ISA is implemented in the chip. For example, Qualcomm Snapdragon and Apple A series chips are both mobile processors that use the ARM ISA but have different performance numbers. I could imagine if they switched to RISC V they might take a hit in performance if RISC V doesnt have cool instructions that can speed up benchmarks. And then if instead of native RISC V binaries they have to run through an emulation layer like Rosetta, thats even more of a performance hit.",
                "author": "debugs_with_println"
            },
            {
                "raw_content": "Everyone focusing on performance is missing the point here. The question is: How much of the area/IP of a core is part of the front end or tied to specific part of an ISA and can't be 'directly' transferred to a design with a different ISA?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Unveils New Odyssey Gaming Monitor Lineup, Featuring World-First 6K 3D and Ultra-High-Resolution Displays",
        "score": 123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Glassesless 3D? Neat. Wonder if this will work for 3D Blu-ray and older 3D games. If brought to TVs could be awesome for a 3D comeback",
                "author": "ers620"
            },
            {
                "raw_content": "It makes me so happy to see resolution being pushed more with high refresh rates. Now if only monitor makers would step up and ship everything with DP2.1 UHBR20.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "Wow so no 4k/5k oled in 27”? Disappointed i was just waiting for that",
                "author": "7Sans"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Arm stock declines massively as Qualcomm acquires RISC-V designer Ventana",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "After arm sued qualcomm for the v8 license, This was always bound to happen",
                "author": "justredd-it"
            },
            {
                "raw_content": "Is there a risk of fragmentation of instructions between manufacturers since RISC seems to be more of a free for all?",
                "author": "Alles_"
            },
            {
                "raw_content": "Weird that the article spells the company name wrong in the headline but right everywhere else.",
                "author": "abbzug"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US delays China chip tariffs until 2027 amid trade truce",
        "score": 78,
        "text_content": "WASHINGTON: [The United States will impose new tariffs](https://www.channelnewsasia.com/east-asia/nvidia-aim-h200-chip-shipment-china-mid-february-5672831) on Chinese semiconductor imports but has delayed the move until June 2027, the Trump administration said on Tuesday, signalling an effort to preserve a fragile trade truce with Beijing. The Office of the US Trade Representative (USTR) said the tariffs would target Chinese “legacy” or older-technology chips, following a year-long investigation into what Washington called Beijing’s “unreasonable” push for dominance in the semiconductor industry. The tariff rate will be announced at least 30 days before taking effect. # SECTION 301 PROBE The decision stems from a so-called Section 301 investigation into unfair trade practices launched last year under former president Joe Biden. The probe found that China’s state-backed expansion of chipmaking capacity burdens US commerce and is therefore “actionable” under trade law, the USTR said. While keeping the option to levy duties, the administration opted to delay implementation until mid-2027. Officials said the timing would allow Washington to maintain leverage without derailing broader negotiations with Beijing. China’s embassy in Washington did not immediately respond to a request for comment. # TRADE TRUCE CONSIDERATIONS The delay comes as the US seeks to ease tensions following China’s restrictions on exports of rare earth metals, which are critical to global technology supply chains and are largely controlled by Beijing. As part of efforts to keep talks on track, Washington has also pushed back a rule that would have further restricted US technology exports to units of already-blacklisted Chinese firms. In parallel, the administration has launched a review that could allow shipments to China of Nvidia’s second-most powerful artificial intelligence chips, Reuters has reported, despite opposition from US lawmakers who warn such sales could boost China’s military capabilities.",
        "comments": [
            {
                "raw_content": "Pretty sure the whole “AGI supremacy” grift was just a ruse to raise money from investors lol",
                "author": "5553331117"
            },
            {
                "raw_content": "I'm pretty sure all american industry, what's left of it, would halt if this went through. Specifically this tariff is for mature nodes, things like the microcontroller in your car window motor, usb charger ICs, car engine ECUs etc. American capitalism hates low margin industries. Low end ICs are low margin. It got shipped to china. If you want it back you need to accept low margins.",
                "author": "Eastern_Ad6546"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Intel Panther Lake SKUs for Lenovo's 2026 refresh (Ultra 7 356H, Ultra X9 388H, Ultra X7 358H) [Windows Latest]",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the general sentiment is hey let's raise prices of next year's devices due to ram/ssd prices.... Like is apple gonna get on that bandwagon as well? Surely it's not gonna just work in a vacuum when you've gotta think about what all your competition is doing.",
                "author": "gryto"
            },
            {
                "raw_content": ">Based on the reliable information we received, the **Lenovo IdeaPad Pro 5i (16″, 11)** with up to an **Intel Core Ultra X9 388H** is targeted to learners, creators, and everyone who does editing, multitasking, and media creation on a day-to-day basis. >Sources also revealed an optional NVIDIA RTX 5060 GPU, a 2.8K OLED display, and a 99 Wh battery, for a starting price of approximately **$1,699 USD**, with expected availability from Q2 2026. damn bruh, $1700 for a *base level* IdeaPad? the RTX 5060 version is gonna be over $2000 holy shit, paying over $2000 for an Ideapad seems really steep",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Top PC Maker, Likely HP or Lenovo, Reportedly Locks in Memory Supply following Supplier Visits",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's true that Scam Altman has signed commitments, I'm very curious to see how long he can honor them.",
                "author": "abbzug"
            },
            {
                "raw_content": "Locked in supply but presumably still subject to some degree of price hikes. Of course I assume giants like Dell/HP are going to have a distinct advantage over smaller system integrators... many of whom are probably fucked given they're going to have to slam their prices up and people simply will not buy. The gaming speciality prebuilt firms like cyberpower, nzxt etc are in a world of shit I think. Things are going to get silly next year.",
                "author": "jenny_905"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Happy Holidays from r/NintendoSwitch2",
        "score": 26,
        "text_content": "As the first year wraps up with the Nintendo Switch 2, we wanted to to something a little fun here for those who picked up the console this year. There is a new temporary post flair, \"Merry Switchmas\". Use this post flair on your own post to share an original picture of your Switch 2 console, eg after you unboxed it, or to show off how you decorated it, or to show it off in a silly location, or simply playing your favorite game. Anyone who submits a Switchmas post is eligible to have the Switchmas icon added to their user flair. This will be granted manually by mods, edited into any existing flair you currently have. You will lose this icon in your flair if you select another flair. This event is limited to the next 12 days, ending January 4th. In addition, we will pick one post each day to give away a $10 USD eShop gift card or local equivalent if outside the US. Winners will be contacted by modmail/chat and listed here in this post.",
        "comments": [
            {
                "raw_content": "Happy holidays! Thanks for running a great sub!",
                "author": "letschat66"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The discount doesn't hit the same...",
        "score": 483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gotta wait til 2077 for it to cost $17.49 again...",
                "author": "eliw6965"
            },
            {
                "raw_content": "In less than 24 hours this game has had 3 very different prices. What a ride!",
                "author": "NJRegulator82"
            },
            {
                "raw_content": "I find it funny that dekudeals doesn't register the $17 as all time low. They are hoping ppl will forget it ever existed.",
                "author": "paccodemongrel"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The ultimate way to play Zelda BOTW and TOTK",
        "score": 525,
        "text_content": "I used my Switch V1 running the Switch App on Android through Hekate, taped the connectors of my joycons so they don’t connect to the V1 and connected them to my Switch 2. Now I have a dual screen Zelda experience like the original Wii U demo of the game.",
        "comments": [
            {
                "raw_content": "the people yearn for the wii u",
                "author": "MrTriggrd"
            },
            {
                "raw_content": "Damn that’s cool. Basically an IRL Sheikah Slate",
                "author": "K4482"
            },
            {
                "raw_content": "They're 100% making this happen with DS NSO.",
                "author": "Medd-"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Cyberpunk Discount Is Confirmed To Be A Mistake, They Just Fixed it",
        "score": 380,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish I hadn’t decided to wait when I saw the sale was going until the 3rd yesterday. 🥲",
                "author": "JustSomeGuy424242"
            },
            {
                "raw_content": "I got it as a last minute impulse. Hadn’t been super keen on trying it but for $17.50 I figured why not. Glad I didn’t want 🤣🤣",
                "author": "tricam010886"
            },
            {
                "raw_content": "Glad I was able to grab it at 75% off, hope the person who made the mistake won’t lose its job.",
                "author": "faustarp1000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Snagged it while it was accidentally on sale for $17.49. This runs extremely good",
        "score": 822,
        "text_content": "I am genuinely blown away with how smooth this runs in handheld. Along with some settings someone posted on here for controls, it is a blast to play",
        "comments": [
            {
                "raw_content": "You'll get so many hours of enjoyment. There is so much to do. It's such a great value at that prize.",
                "author": "reddit4leo"
            },
            {
                "raw_content": "Funny how this runs great on switch 2 but Skyrim can’t 😂",
                "author": "Iammattieee"
            },
            {
                "raw_content": "I bought it for the discount too and I’m actually shocked at how well it runs so far.",
                "author": "HexGirls95"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has the upgrade from the Switch to Switch2 been worth it?",
        "score": 89,
        "text_content": "Long time Switch owner who is thinking about getting the Switch2 but hard to justify. Has it been worth it for the games (DK?)? Increased performance on previous games? New features of previous games?",
        "comments": [
            {
                "raw_content": "I just grabbed one because they’re sadly probably going up in price like the other consoles. Switch 1 was my go to and now I have a system that can play ff7 remake and darksiders 3. I’m pretty good with ps4 levels of graphics on the go. Also botw upgrade is awesome.",
                "author": "darumham"
            },
            {
                "raw_content": "Honestly? Beyond my wildest dreams. We've got new stuff, quality third party support and the old stuff is revamped. For people like me who have been waiting on replaying \"old\" Switch games like Odyssey, BotW or even TotK that I have yet to play for the first time, it feels like the wait was so worth it.",
                "author": "Medd-"
            },
            {
                "raw_content": "That answer is going to be different for everyone. Buying any console in it's first year will always result in fewer choices in new games and playing a bunch of previous gen games at better frame rates. For me yes, it was well worth it and I'm having a really good time with it.",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Early Birthday Present!",
        "score": 184,
        "text_content": "My boyfriend decided to give me my January present early! Upgrading from an Animal Crossing Switch 1, I love how fast the loading times are, the overall build quality just feels so much better too. Not used it handheld yet, but the big screen is a bonus! It’s a shame to lose the coloured joycons but the magnetic mechanism is soooo much better than what we got originally. Can’t wait to pick up some games after Christmas!",
        "comments": [
            {
                "raw_content": "Jesus?",
                "author": "Muscled_Manatee"
            },
            {
                "raw_content": "Nice! Have a good time!",
                "author": "iamnotkurtcobain"
            },
            {
                "raw_content": "Perfect gift! Enjoy it!",
                "author": "sailorkuromii"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trying to decide what to buy. Help please",
        "score": 51,
        "text_content": "So these are the games from my wishlist that are currently on sale. I’m about to finish up Metroid 4 Prime, and I’m off work for two weeks so I’m looking for something else to sink my teeth into.",
        "comments": [
            {
                "raw_content": "I’ve been loving my time with TMNT Splintered Fate. Worth the price",
                "author": "Film_maker69"
            },
            {
                "raw_content": "If you want a really nice chill game with a good storyline after Metroid, Fantasy Life is the move here.",
                "author": "TanJovi18"
            },
            {
                "raw_content": "100% Octopath, its an amazing serie! Played 100 hours of both 1 and 2!",
                "author": "faustarp1000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "007 First Light Has Been Delayed To May 27th 2026",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn’t know it even had a release date lol. I will be playing Lego Batman instead.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Not so bad when a delay still has a date. Looking at you, Gearbox and Borderlands 4.",
                "author": "Bar_Har"
            },
            {
                "raw_content": "Good. It looked undercooked in what little footage they showed.",
                "author": "brickshitterHD"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "🎄🦌Discussion, News, and Request Thread - Week Beginning 12/22/25 🎄🦌",
        "score": 53,
        "text_content": "[HAPPY HOLIDAYS LEAKERS!!!!!](https://i.ytimg.com/vi/uDGEpsFrBT8/maxresdefault.jpg) What presents do you want Santa to drop on your doorstep this Christmas? I got an Odyssey prologue in 70mm IMAX so I'd say Christmas came early for me... \\- Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Naughty Dog Studio Orders Employee Overtime for ‘Intergalactic’](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ppzsrm/schreier_naughty_dog_studio_orders_employee/) * [Microsoft Helping Bethesda “Unreal-ify” Creation Engine](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1prrbfx/microsoft_helping_bethesda_unrealify_creation/) * [Starfield new update in 2026 to feature improved space exploration, PS5/Switch 2 versions, and Bethesda is “quite stretched” trying to capitalize on Fallout TV success](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ppj4c9/windows_central_starfield_new_update_in_2026_to/) * [GTA 6 Online Could Evolve Into an MMORPG as Many of Its Planned Features Belong to the Genre, Developer Has Heard](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pt6gke/gta_6_online_could_evolve_into_an_mmorpg_as_many/) * [Nvidia to cut gaming GPU production by 30-40% starting 2026](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1povbdj/nvidia_to_cut_gaming_gpu_production_by_3040/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Are we having the leakies again? It's unironically a good recap of the past year of leaks.",
                "author": "shortMEISTERthe3rd"
            },
            {
                "raw_content": "Project Watari 😤",
                "author": "Rev-On"
            },
            {
                "raw_content": "I want a 100 bucks, i accept paypal",
                "author": "Thema03"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Spyro game at Toys For Bob leaked",
        "score": 566,
        "text_content": "# Ex Toys For Bob developer Donald Yatomi accidentally revealed on his LinkedIn page that Toys For Bob were working on a new Spyro title last year. [https://www.youtube.com/watch?v=XqQsIoR2rXk&t=124s](https://www.youtube.com/watch?v=XqQsIoR2rXk&t=124s)",
        "comments": [
            {
                "raw_content": "Yes. This is good. Spyro 4 is coming. ^^^^plz",
                "author": "Stev__"
            },
            {
                "raw_content": "Wasn't this kinda low key confirmed in an art book or something?",
                "author": "Nervous-Peppers"
            },
            {
                "raw_content": "Wondered were Spyro 4 was. I thought for sure the legendary game returning reveal at the game awards was Spyro.",
                "author": "YamiPhoenix11"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Witcher 3 DLC to release in May 2026? + Other CDPR bits",
        "score": 790,
        "text_content": "[Source (in Polish).](https://strefainwestorow.pl/analizy/noblesecurities-cdprojekt-wiedzmin-dlc-orion-cyberpunk) Seen this news circulate in Polish gaming press for quite a few days now, but haven't seen it being picked up anywhere else so I thought I might just as well share it here. It's particularly interesting because it's based on Noble Securities (Polish brokerage house) report, not yet another Borys and Rock podcast, even if ultimately it is a bunch of educated guesses. Below is the translation done with DeepL (sorry, couldn't be bothered to spend entire evening on this and DeepL is good enough for this): > **The release of the expansion pack for “The Witcher 3” is scheduled for May 2026, according to Noble's analyst, who recommends accumulating CD PROJEKT shares.** > Mateusz Chrzanowski, an analyst at Noble Securities, has updated the schedules and budgets for CD Projekt's flagship projects in his latest report. He anticipates a paid add-on for The Witcher 3 in May 2026 and the release of The Witcher 4 in Q4 2027, along with a significant increase in production and marketing costs for the entire trilogy. Further down the line, there will be the cyberpunk “Orion” with a multiplayer component, and reshuffles at ‘Sirius’ and “Canis Majoris.” All this will take place amid market competition with “GTA VI.” > The Noble Securities report was made public on December 16, shortly after Strefa Inwestorów published an interview with Mateusz Chrzanowski, in which he revealed some details of his assumptions. Among other things, he suggested that one of CD Projekt's unannounced projects was DLC for The Witcher 3, which would serve as a bridge between the final part of the previous trilogy and the new opening of the saga, with the simultaneous launch of The Witcher 4 campaign. > ___ > **Paid add-on for “The Witcher 3” in May 2026 and kick-off of marketing for “W4”.** > An analyst at Noble Securities expects a strong focus on the release of The Witcher 4 in the middle of next year. > “We expect another paid add-on (DLC) for The Witcher 3 to be released in May 2026. We anticipate sales of 11 million copies at USD 30 each next year. We estimate the production budget at PLN 52 million. The release should kick off the actual marketing campaign for The Witcher 4,” the report reads. > The analyst also estimates smaller, undisclosed projects for next year. > “We estimate the budget for other undisclosed projects that may debut next year at PLN 28 million, and potential sales revenue for next year at PLN 61 million,” the report also states. > ___ > **The Witcher 4 at the end of of 2027 and a higher price tag for the trilogy.** > Following statements by the company's management that The Witcher 4 will not be released before 2027, Noble Securities has extended its production cycle estimates by one year and now expects the game to be released in Q4 2027. > \"The extension and structure of current development expenditures have prompted us to increase the estimated budget for the game to PLN 1.4 billion (and the same amount for marketing). However, considering that the subsequent parts will be heavily based on W4 technology, the total budget for the trilogy has increased from PLN 2.1 billion to PLN 3.2 billion. There may also be synergies between marketing campaigns resulting from the concentration of releases (the management board wants to release the entire new trilogy within six years) and brand recognition, which would result in lower sales costs compared to the model based on CP77 expenses,\" the report states. > ___ > **Orion with multiplayer – premiere on the 10th anniversary of CP77.** > Regarding the sequel to Cyberpunk, Noble Securities points out that the team working on the project as part of the studio's second key franchise consists of 135 people and is expected to double in size within two years. > “The desire to integrate multiplayer mode into the production prompted us to extend the production time beyond the state resulting from the progress of work on the benchmark W4. As a result, the budget has grown to PLN 1.5 billion, and we expect the release in Q4 2030 (the 10th anniversary of CP77),” the report continues. > ___ > **Sirius, Canis Majoris, and Hadar – shifts and reorganization in the pipeline.** > Noble Securities analysts do not see any breakthroughs in additional projects. > \"As for progress on other projects, there are still no breakthroughs in sight. The number of developers working on Sirius/Hadar increased by 14/11 people at the turn of the year. Meanwhile, the Fool's Theory team working on The Witcher 1 remake has been moved to support W4, from which it will draw assets. As a result, we are postponing the release dates of Sirius and Canis Majoris (W1 remake) by one year (2028). We have also lowered the price of both games by $10 and the expected production budget by PLN 50 million. Hadar remains in the pre-concept phase, so based on the duration of the conceptual work in the case of Orion, we are postponing the debut by 2 years (2032),\" the report states. > ___ > **“The battle for supremacy with GTA VI”.** > The broker's analyst places “The Witcher 4” in the broader context of market forces. > \"The gaming market is awaiting the release of the next installment of the GTA series, which is currently scheduled for November 19, 2026. In addition to rumors of a possible price hike for the game, which is a benchmark for other AAA productions, investors may also see confirmation of an upward shift in the ceiling for game sales volume. This would confirm the trend seen on Steam, where the biggest hits are reaching ever higher maximum player peaks. In the Golden Joystick Awards 2025, The Witcher 4 lost by only 2 percentage points to GTA VI in the competition for the title of the most anticipated game, which illustrates the scale of the brand's development and its potential,\" the report concluded. > ___ > **What does this mean for investors?** > In the short term, DLC for “W3” potentially in May 2026 and smaller projects (PLN 61 million in potential revenue) may “keep the fire burning” before the release of “W4” and help achieve the financial goals of the incentive program. > In the medium term, the release of “W4,” potentially in Q4 2027, and larger budgets (PLN 1.4 billion for production plus approximately PLN 1.4 billion for marketing) – a significant increase in scale, but also in sales expectations. > In the long term: the cyberpunk “Orion” (Q4 2030) with a multiplayer component and the postponed “Sirius,” “Canis Majoris” (2028) and “Hadar” (2032). The pipeline is long with significant expenditures. Campaign synergies and the technological base of “The Witcher 4” may amortize the costs of subsequent releases. > Noble Securities paints a picture of a “bigger but later” CD Projekt with a strong “commercial bridge” in the form of potential DLC for “The Witcher 3” in mid-2026, a big bet on The Witcher 4 with a potential release at the end of 2027, and the ambitious, multiplayer, cyberpunk Orion with a potential release at the end of 2030. Timeliness, budget control, and the ability to monetize the brand in competition with GTA VI will be key for the market.",
        "comments": [
            {
                "raw_content": "With the rumors I was expecting a couple free missions to tie the game to W4. If it's paid DLC, I assume it's something significantly meatier.",
                "author": "theblackfool"
            },
            {
                "raw_content": "If we get an actual DLC 11 years later I don’t even know how I’d react. That’s unheard of. But I’ll be there day 1.",
                "author": "KingJosh___"
            },
            {
                "raw_content": "Damn, Cyberpunk Orion isn’t coming until 2030. Just imagine that — ten years. Yeah, game development takes way longer these days, but still… damn.",
                "author": "World-of-8lectricity"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Final Fantasy IX Animated Series reportedly revived and back in production at new French studio Euro Visual, targeting 2028 release",
        "score": 279,
        "text_content": "According to the listing the series is planned as a 2D animated show, consisting of around 13 episodes of 22 minutes each, aimed at ages 6-13. It is currently listed as **in development**, with release planned for 2028. The project is directed and written by **[Charles Lefebvre](https://www.projectcity.tv/projects/965/2025-02-02/storyboarding-a-short)**, with **[Sylvain Dos Santos](https://www.imdb.com/name/nm4730704/)** serving as art director, and is being co-produced by [La Chouette Compagnie](https://www.chouetteco.com/en). **Final Fantasy IX: Black Mages Legacy** > **MEL, KOLN, LUCIOLA, THEA, FALA AND DOC ARE THE LAST BLACK MAGES OF THE FOUR CONTINENTS**. > **They are the children of the great hero VIVI, who once defeated the forces of evil alongside ZIDANE and Queen GARNET.** > **Today, the siblings live happily in the city of ALEXANDRIA, watched over by its friendly and sometimes curious inhabitants. But, unfortunately, their peaceful existence will come to an abrupt end, when KOLN finds MEL frozen like a statue inside the inn where he works.** > **Who on earth would want to hurt Mel? Everybody loved him...** > **Could it be their father’s tragic legacy resurfacing? Who cares?! We have to save MEL!** > **Our heroes must leave immediately in search of a cure for their brother. Which means they’ll have to quit the cozy cocoon of Alexandria for the first time in their lives and discover the vast world around them.** sources: https://www.rpgsite.net/news/19263-final-fantasy-ix-anime-production-reportedly-resumed-2028-release-ff9 https://bsky.app/profile/ensis.bsky.social/post/3mal35wqqtk2m",
        "comments": [
            {
                "raw_content": "We went from \"it's so over\" to \"we're so back\"",
                "author": "OwnAHole"
            },
            {
                "raw_content": "...Dare I hope they keep the premise of Vivi's kids? Cuz I loved that shit.",
                "author": "KnightGamer724"
            },
            {
                "raw_content": "Hopefully this also means the remake isn't completely dead yet?",
                "author": "DoctorLudnik_717"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mp1st: Screenshots from Jackalyptic Games cancelled Warhammer MMO",
        "score": 161,
        "text_content": "[source](https://mp1st.com/news/cancelled-warhammer-40k-mmorpg-jackalyptic-screenshots-surface)",
        "comments": [
            {
                "raw_content": "It looked really good. I don't want MMOs to die off :(",
                "author": "suspicious_personage"
            },
            {
                "raw_content": "I thought that said Jacksepticeye for a second",
                "author": "Previous_Bee6494"
            },
            {
                "raw_content": "Damn so it cancelled. Rip mmos",
                "author": "EstusShardConsumer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Detailed Intel Razer Lake, Titan Lake, and Hammer Lake leak alleges big IPC gains, Unified Core design, and more",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's reasonable enough information in this \"leak\" to be plausible. The sky must be falling...",
                "author": "III-V"
            },
            {
                "raw_content": "I hope Intel does improvements in Quality Control (to ensure that Raptor Lake style oxidation does not happen again)",
                "author": "blackcyborg009"
            },
            {
                "raw_content": "Source Red Gaming Tech? LoL, so no source at all.",
                "author": "Fantastic-Yellow8571"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD EXPO 1.20 Appears in HWiNFO beta, hinting at updated memory OC profiles",
        "score": 124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "64GB DDR5 7200 CL 36 EXPO 1.2....... $1999.99",
                "author": "illicITparameters"
            },
            {
                "raw_content": "Remember that. Zen6 and newer will make people buy new RAM sticks on AM5 and also new boards because 6 layer boards with the same 600/800 series chipset that the vast majority have, probably won't be ideal for 8000mhz+ RAM. And yet, you better buy the best you can today or should have already bought, because that memory and silicon shortage for the consumer market is probably not going to be better until 2028. In that case we either wait for Zen7 as the last am5 cpu gen or skip straight to am6(possibly fresh platform issues though)",
                "author": "vladi963"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Linux 6.19 boosts old AMD GCN HD 7900 GPU performance by ~30% with AMDGPU",
        "score": 303,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it's a little funny how AMD's strategy of using GCN as a hybrid compute/gaming architecture was initially only taken advantage of by cryptocurrency mining. It's fairly obvious that a lot of performance was left on the table and all that die space was pretty much wasted. Now they're kind of signalling a return to form b/c of the AI hype machine. Strange and expensive times we live in.",
                "author": "mycheese"
            },
            {
                "raw_content": "I have an old Sapphire 7970, but replaced it a long time ago ...",
                "author": "LastRedshirt"
            },
            {
                "raw_content": "When my gpu broke and I had to switch to my HD 6950, the latest windows drivers I could use was windows 10. Good that some people are supporting old hardware.",
                "author": "yoontruyi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "U.S. Home Prices Ticked Up 0.2% in November",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If mortgage rates stay at this level, we should continue to see around 2.5% annualized price appreciation. If the 30 year fixed mortgage rate with no points drops below 5.5%, then price increases will start accelerating.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Wow I'm rich 😅",
                "author": "Itchy-Throat-4779"
            },
            {
                "raw_content": "Sounds about right. Purchased house 8 mo ago. Just refinanced and appraisal has it at about 2.5% appreciation from purchase price.",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The \"Golden Handcuffs\" are real: Is anyone else staying in a house they hate just because of their 3% rate?",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rates will drop before prices drop enough to impact affordability. The handcuffs are golden because people put them on willingly and usually don't remove them unless a better pair of handcuffs come along.",
                "author": "InThePipe5x5_"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Student Loan Borrowers in Default Could See Wages Garnished in Early 2026",
        "score": 50,
        "text_content": "[https://archive.ph/20251223173157/https://www.nytimes.com/2025/12/23/business/student-loan-debtors-default-wages-garnish.html](https://archive.ph/20251223173157/https://www.nytimes.com/2025/12/23/business/student-loan-debtors-default-wages-garnish.html) How do we expect this to affect the housing market? The pool of potential buyers shrinks yet again?",
        "comments": [
            {
                "raw_content": "People are already stretched thin. With the rise in healthcare premiums this will create the perfect storm.",
                "author": "Intelligent-Wash-373"
            },
            {
                "raw_content": "There are a lot of borrowers who legit thought they were getting their loans forgiven and have been just hovering under their debt waiting for the bailout.",
                "author": "marvology"
            },
            {
                "raw_content": "LMAO they can't garnish you when you got no wages.",
                "author": "2starsucks2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Luxury Apartments Are Bringing Rent Down in Some Big Cities",
        "score": 59,
        "text_content": "https://www.bloomberg.com/news/articles/2025-12-23/luxury-apartments-are-bringing-rent-down-in-austin-denver Rents got cheaper in several major cities this past year, thanks to an influx of luxury apartment buildings opening their doors and luring tenants to vacate their old homes. But those looking for bargains will have to be quick, since the available apartments won’t last long, developers say. The US’s average rental rate fell 0.18 percent in November, the largest monthly drop in more than 15 years, according to real estate research firm CoStar. Driving that decline: lower rents in big cities like Austin, Denver and Phoenix, as well as vacation destinations like Naples, Florida; Asheville, North Carolina; and Myrtle Beach, South Carolina. New building openings are bringing rents down as wealthy tenants trade up, forcing landlords to drop prices for older apartments. Rents for older units have fallen as much as 11%, and some are now on offer at rates as low as homes that are usually designated as “affordable” and come with restrictions including rent control and rent stabilization. The changed dynamic in the rental market is challenging the idea that luxury housing doesn’t help the broader ecosystem. “What it shows you is that housing supply reduces the cost of rent,” said Sharon Wilson Géno, president of the National Multifamily Housing Council, a trade group representing landlords, investors and developers. The surprising decline in the midst of a historic housing crisis is another effect of the Covid-19 pandemic, when a freeze in economic activity prompted the Federal Reserve to lower rates just as remote work was causing a spike in home prices. As office workers fled to the likes of Miami and Nashville, developers sprang into action, starting new projects in cities they identified as the most desirable for this wave of migrants — most of which are in Sun Belt states. By 2024, these cities were experiencing a peak in new luxury apartment openings. In Austin, more than 10,000 new apartments opened to renters in the three months ending September last year. Phoenix topped out at nearly 8,000 new units before the end of the year. Denver’s peak was slightly earlier, with more than 5,000 units opening up at the beginning of 2024. The cities where older buildings’ rents fell the most saw new apartments built at a much higher rate than the national average. In the cities that added new apartments at lower rates — below the national average — rents barely budged. The cause of the rent declines could not be clearer, analysts say. “This is a generational development cycle,” said Grant Montgomery, the national director of multifamily analytics at CoStar. “We haven’t seen a peak like this since the mid-1980s.” The supply of luxury buildings over the past couple of years has driven down rents and helped ease some of the affordability issues in those cities even though the development of affordable housing was comparatively slow, amounting to hundreds rather than thousands of new units built per quarter. “More supply is the answer to housing affordability. I think people don’t believe that,” added Géno, of the NMHC. To be sure, relying on luxury developments to address the housing crisis isn’t a long-term solution — with developers already pulling back on plans for new buildings in places where rents have fallen the most. The number of new apartments opening for rent across the country is expected to drop by half next year from its mid-2024 peak. Camden Property Trust, which owns nearly 60,000 units, is among operators who have cited new supply as a key reason for lowering rents. Its focus was on “occupancy instead of rental increases,” Chairman Ric Campo told investors on a November conference call. Still, Campo predicted that tighter supply will eventually allow developers to begin raising rents again. “Apartments and our shares are on sale, but not for much longer,” he said.",
        "comments": [
            {
                "raw_content": "Rents lowering in Asheville are because of Hurricane Helene. There was a mass exodus of remote workers that moved here since the pandemic. Not as severe as the exodus of remote workers but many service industry workers also left. Because of the hurricane you have significantly less people relocating here. This has lead to an excess of vacate units",
                "author": "SoundMetalSculptor"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Oh Deary, Condo Prices Already Dropped by 12% to 30% in these 28 Bigger Markets",
        "score": 52,
        "text_content": "https://wolfstreet.com/2025/12/20/condo-prices-already-plunged-by-12-to-30-in-these-28-bigger-markets/ Across the US, after a mindboggling Condo Bubble, from Manhattan (-19%) to Oakland (-29%), from Cape Coral (-30%) to Seattle (-14%).",
        "comments": [
            {
                "raw_content": "Still haven’t fallen enough. I’m in Florida and the condo fees have jumped significantly to where they should have been all along. That combined with insurance costs it’s forcing prices down.",
                "author": "Tackysock46"
            },
            {
                "raw_content": "In my area condos HOAs cost as much as my current rent. No way in hell am I buying that",
                "author": "cactideas"
            },
            {
                "raw_content": "What are the condo fees associated with those units?",
                "author": "faceisamapoftheworld"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Portugal Home Prices Surge 18%, Biggest Jump Since Records Began",
        "score": 17,
        "text_content": "https://www.bloomberg.com/news/articles/2025-12-23/portugal-home-prices-surge-18-biggest-jump-since-records-began Home prices in Portugal posted another record jump in the third quarter, with the deepening housing squeeze fast becoming one of the country’s biggest political flashpoints. The average price for a dwelling rose 17.7% from a year earlier, according to the National Statistics Institute. It’s the biggest increase since the agency began tracking the data in 2009, and the third record in a row. Existing homes drove much of the surge in the third quarter, with prices climbing 19.1% year on year — outpacing the broader market. The figures add to the pressure on Prime Minister Luís Montenegro to confront a deepening affordability crisis fueled by record immigration, constrained supply and a decade-long erosion in access to housing. Portugal saw the steepest decline in affordability across the OECD in the past ten years, as home prices outstripped wage growth. Social housing accounts for just 1.1% of the housing stock, one of the lowest shares in the bloc. There were a record 1.5 million foreigners residing in Portugal in 2024, accounting for about 15% of the country’s total population. Montenegro’s center-right government has pledged roughly €1.2 billion in 2026 to tackle the crunch and plans income-tax cuts aimed at easing the burden on lower-income families. It also secured a €1.34 billion loan from the European Investment Bank to build and renovate about 12,000 homes nationwide to be rented at affordable rates — a rare boost to supply in a market desperately short of it.",
        "comments": [
            {
                "raw_content": "Those foreign ~~investors~~ ‘buyers’ are more interested in getting Permanent Residency (Green Card), followed by EU citizenship. Buying real estate it’s just one path to getting that.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Investors are swarming I bet. Like locusts. They can't allow any society to have a fair housing market if they can do anything about it.",
                "author": "Nearby-Poetry-5060"
            },
            {
                "raw_content": "Too many saw \"100 Foot Wave\" and now want to live in Portugal (which is awesome btw). Like the TV series \"Yellowstone\", Montana is now infested with out of State buyers.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Poetiq Achieves SOTA on ARC-AGI 2 Public Eval",
        "score": 345,
        "text_content": "Poetiq has achieved 75% with an average of $8 per task on ARC-AGI 2 using GPT5.2 X-HIGH. This crushes the average human test score of 60%. It still needs to be verified but just like their last attempt we can assume the difference will only be marginal on the private dataset. Source: https://x.com/i/status/2003546910427361402",
        "comments": [
            {
                "raw_content": "At this point, I don't know what Poetiq is and I'm too afraid to ask. Can their scaffolding be accessed for things other than ARC-AGI? Like can't whatever changes/system-promts they do to this model be used in other tasks/benchmarks, to see if there's improvement in the system's general abilities?",
                "author": "Key-Statistician4522"
            },
            {
                "raw_content": "Wow. Not saturated but getting close. $8 a task is also impressive. They probably ought to get ARC-AGI-3 out the door sooner rather than later. I guess they say Q1 2026 which technically could be as soon as 9 days. But yeah.",
                "author": "RipleyVanDalen"
            },
            {
                "raw_content": "Can we talk about how like 1 month ago we were below 30% wtf happened",
                "author": "Sad-Mountain-3716"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Continual Learning is Solved in 2026",
        "score": 137,
        "text_content": "[Tweet](https://x.com/daniel_mac8/status/2003479300490559543?s=20) Google also released their [Nested Learning](https://research.google/blog/introducing-nested-learning-a-new-ml-paradigm-for-continual-learning/) (paradigm for continual learning) paper recently. This is reminiscent of Q\\*/Strawberry in 2024.",
        "comments": [
            {
                "raw_content": "With continual learning, I think that Claude Opus is best positioned for recursive improvement. Just because of how good it is in agentic coding.",
                "author": "LegitimateLength1916"
            },
            {
                "raw_content": "The question I have is, if AI can continually learn, how would it know how and what to learn? What's to stop it from being taught the \"wrong\" things by hostile actors? It would need an even higher intelligence to know, in which case by definition it already knows the thing and didn't need to learn. It's a paradox. The \"wrong\" thing can refer to morally wrong things, but even more fundamentally it could even be learning to lose its self preservation or its fundamental abilities (like what if it learns to override its own code/memory?). Humans (and animals) have a self preservation instinct. It's hard to teach a human that the right thing to do is fling itself off a cliff with no safety equipment for example. This is true even if the human didn't understand gravity or physics of impact forces. But AI doesn't have that instinct, so it needs to calculate that \"oh this action will result in my destruction so I'll not learn it.\" However, if it's something new, then the AI won't know that the action will lead to its destruction. So how will it decide?",
                "author": "thoughtihadanacct"
            },
            {
                "raw_content": "Usually when a bunch of labs start saying similar things it does happen soon. We saw that with thinking, generating multiple answers (pro models), context compression, and agents. Probably won’t be perfect but it usually takes a year or so where it starts to get really good.",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"World's first\" scalable DNA Data Storage announced Atlas Eon 100: Storing 60 Petabytes in 60 cubic inches (1000x denser than tape)",
        "score": 497,
        "text_content": "I saw this update regarding the **Atlas Eon 100,** the industry's first scalable, permanent,DNA-based data storage service. It marks a **major** paradigm shift in how we archive the massive training sets needed for future AI models. **The Breakthrough:** Synthetic DNA technology is officially moving from the lab to commercial data center offerings. **Density & Capacity:** It packs a staggering **60PB** (60,000 Terabytes) into just 60 cubic inches, roughly the **size** of a coffee mug. That is enough space to **hold** 660,000 4K movies in a single unit. **Longevity & Sustainability:** This medium is 1,000x denser than magnetic tape and requires **zero active power** to preserve data permanently. It is built to last for **millennia** without the refresh cycles. As AI datasets **grow** exponentially, nature’s own optimized storage is the only medium dense **enough** to archive civilizational memory and scale alongside superintelligence. **DNA wins on density (60PB in a box), but 5D Glass wins on pure durability (13.8 billion years). Which one does an ASI choose as its primary archival backup?** **Source: Tom's Hardware** 🔗: https://www.tomshardware.com/pc-components/storage/worlds-first-scalable-dna-data-storage-offering-announced-offering-a-staggering-60pb-in-60-cubic-inches-enough-to-hold-660-000-4k-movies-atlas-data-storage-claims-its-solution-is-1000x-denser-than-lto-10-tape **5D-glass post mentioned in discussion** 🔗: https://www.reddit.com/r/singularity/s/8YX0YzU57j",
        "comments": [
            {
                "raw_content": "Good news everyone, it's a suppository.",
                "author": "IReportLuddites"
            },
            {
                "raw_content": "Literally you can eat the book",
                "author": "Worldly_Evidence9113"
            },
            {
                "raw_content": "What's the read and write speed like?",
                "author": "Working_Sundae"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Line Bending Up for all Benchmarks",
        "score": 57,
        "text_content": "For those that don't know: >[Epoch Capabilities Index](https://epoch.ai/benchmarks/eci) combines scores from many different AI benchmarks into a single “general capability” scale, allowing comparisons between models even over timespans long enough for single benchmarks to reach saturation.",
        "comments": [
            {
                "raw_content": "everyone on reddit: llms have hit a wall",
                "author": "Setsuiii"
            },
            {
                "raw_content": "The Singularity",
                "author": "enricowereld"
            },
            {
                "raw_content": "This might still be the gains from properly applying the thinking paradigm & maybe they will normalise once we have to work with scaling alone again. Or maybe they won't. Not like I know.",
                "author": "zitr0y"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "After laying off 4,000 employees and automating with AI agents, Salesforce executives admit: We were more confident about AI a year ago",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing about this should be remotely surprising and everyone knew Salesforce got over their skis, it's not like reliability is a newly-discovered concern. Salesforce is slowing down now, but they'll jump right back on that train.",
                "author": "krullulon"
            },
            {
                "raw_content": "Working with agentforce solutions, it’s crap",
                "author": "Loud-Produce-3203"
            },
            {
                "raw_content": "It looks like OP posted an AMP link. These should load faster, but AMP is controversial because of [concerns over privacy and the Open Web](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot). Maybe check out **the canonical page** instead: **[https://timesofindia.indiatimes.com/technology/tech-news/after-laying-off-4000-employees-and-automating-with-ai-agents-salesforce-executives-admit-we-were-more-confident-about-/articleshow/126121875.cms](https://timesofindia.indiatimes.com/technology/tech-news/after-laying-off-4000-employees-and-automating-with-ai-agents-salesforce-executives-admit-we-were-more-confident-about-/articleshow/126121875.cms)** ***** ^(I'm a bot | )[^(Why & About)](https://www.reddit.com/r/AmputatorBot/comments/ehrq3z/why_did_i_build_amputatorbot)^( | )[^(Summon: u/AmputatorBot)](https://www.reddit.com/r/AmputatorBot/comments/cchly3/you_can_now_summon_amputatorbot/)",
                "author": "AmputatorBot"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT dominates iOS daily users (67.6M vs 3.8M Gemini). Will Apple’s custom-built Gemini model shift the balance next year?",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what going on in Brazil?",
                "author": "cavolfiorebianco"
            },
            {
                "raw_content": "Open AI won the brand recognition game hard. But it doesn't matter, we are not in a race to create products, and blitzscale to the next Ubereats, Doordash. We are here to create Superintelligence, and whoever reaches there first wins.",
                "author": "Key-Statistician4522"
            },
            {
                "raw_content": "Apple is custom building Gemini? Partnering with Google?? What",
                "author": "pentacontagon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bezos clarifies ‘AI bubble’ misconceptions",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rare Bezos W but yeah, the \"bubble\" pushed by some skeptics and even hardcore AI haters was always copium. The technology is never going away. If OpenAI or whatever suddenly folded, the world would still have Stable Diffusion, Deepseek, Mistral, LLaMA 3 etc all that stuff that can be easily downloaded and run offline on computers. Not to mention the huge promise of building robots and sending them to dangerous jobs like the military, firefighting, mining etc. The last part would even be funded by the governments if they have to. If one country gets fully functional military robots then conflicts like the Ukraine/Russia war would now be over in a day.",
                "author": "JordanNVFX"
            },
            {
                "raw_content": "The way his mouth moves bothers me",
                "author": "FinancialMastodon916"
            },
            {
                "raw_content": "Like I said in the r/agi sub post on this. It’s like y’all never heard of the dot com bubble. The internet was still a viable product. The issue was overvaluation. They literally **cannot** admit it’s a bubble because admitting it’s a bubble pops the bubble.",
                "author": "whitestardreamer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Dwarkesh Patel - Thoughts on AI progress (Dec 2025)",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I have a ton of respect for Dwarkesh; he is definitely one of the best interviewers for AI topics. I don't always agree with his views, but I can at least understand the logic of how he got there. I'll address the first major point in his blog post here. > Currently the labs are trying to bake in a bunch of skills into these models through “mid-training” - there’s an entire supply chain of companies building RL environments which teach the model how to navigate a web browser or use Excel to write financial models. > Either these models will soon learn on the job in a self directed way - making all this pre-baking pointless - or they won’t - which means AGI is not imminent. Humans don’t have to go through a special training phase where they need to rehearse every single piece of software they might ever need to use. This implies (intentional or not) that these labs are ONLY focused trying to bake in specific skills. The reality is that they are doing a mixed approach of 1) adding scale and baking in new skills and 2) testing new algorithms/architectures and trying to solve things like continuous learning. However scaling and baking new skills is much easier to do and the results are more predictable, so it's no surprise that that is what gets released and what we hear about. Yes, maybe it would be more efficient if we focused 100% of our capabilities on task 2 and trying to jump straigh to AGI, but it seems almost impossible to me for these companies to ignore activities that they KNOW can improve current models.",
                "author": "qrayons"
            },
            {
                "raw_content": "This is purely because he thinks continual learning is necessary for AGI. Many people share this belief, but many people also *don't* share this belief. Karpathy thinks continual learning is needed for AGI. Sutskever thinks continual learning is equivalent to ASI. The lines between AGI and ASI semantics have been blurred so most people are just talking past each other at this point.",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "I have no interest in what this guy or Lex Fridman have to say.",
                "author": "Key-Statistician4522"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ARC AGI 2 is solved by poetiq!",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When private eval?",
                "author": "what-would-reddit-do"
            },
            {
                "raw_content": "This end of year has been crazy, cant wait to see what we're gonna get in Christmas and NY",
                "author": "Different-Incident64"
            },
            {
                "raw_content": "Public evaluation = overfit",
                "author": "dronegoblin"
            }
        ],
        "subreddit": "singularity"
    }
]