[
    {
        "post_name": "…AND SO IT BEGINS!",
        "score": 467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What, are Republicans finally going to realize what time it is and enable Trump to do his fucking job to get our country back to sanity?",
                "author": "Than0sIII"
            },
            {
                "raw_content": "The decimation of the income tax from all the tariff money? Yep ... let's go! I won't hold my breath. 🙄",
                "author": "drmrboy"
            },
            {
                "raw_content": "He needs to work with Eric Adam’s over the next three months to get ICE in NYC and do as much as they can before the Muslim Marxist comes into office.",
                "author": "CaTrumpFan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Message reportedly on big screen at Mamdani HQ: \"Trump is your president\"",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Zohran is a Muslim piece of shit who eats rice off subway seats with his bare hands. The best part is all the white liberal women retards who voted for him, I’d love to see them under sharia law",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Trump NSA doing a little trolling?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "So? No-knock Raid Zoran's place at 4 AM. Bust Antifa, charge, indict, and arrest Thieeeeeel, soros, gates, etc. audit Congress heavily. Cross the rubicon already, yeesh. Silly low effort \"strong worded letters\" are vastly inferior to JAILINGS.",
                "author": "guywholikesDjtof2024"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Greg Abbott : Join me for a moment of silence for NYC. Thoughts & prayers. 🙏",
        "score": 1024,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not sure if it's the Communism I'm worried about most, or the radical Jihadi Islamism that's taking a foothold.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "He should focus on his ever-growing islamized state",
                "author": "SigourneyPodgorny20"
            },
            {
                "raw_content": "The nation's financial hub will probably migrate to Dallas or Miami. No way it can function much longer in Manhattanstan",
                "author": "JackOfAllTirades"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tomorrow’s United States Supreme Court case is, literally, LIFE OR DEATH for our Country.",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "President Trump is correct that this is integral to his plan to take back our country.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "This is great! However, I'm a bit more concerned about ELECTION FRAUD right now! FUCK",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "Hard to trust 6-7 of the Justices not to let their varying cases of TDS blind them and rule incorrectly.",
                "author": "AllTheWayTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC... what was it all for?",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's not just about NY. Life was so much more enjoyable BEFORE this one event. It's been a pure shit show ever since.",
                "author": "Herc130"
            },
            {
                "raw_content": "NYC is the new London, criminals paradise.",
                "author": "Ikon"
            },
            {
                "raw_content": "Anyone ever see the movie \"I am Legend\" or \"Last Man on Earth?\" That's what NYC is going to look like.",
                "author": "TooTrue-translation"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Welcome to New York City",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Libs voted for this...enjoy it",
                "author": "Albo22"
            },
            {
                "raw_content": "I hope you all have learned you’re not voting your way out of this. Demographics are destiny. When they get done counting votes it’s going to be foreigners and 1-2 gen immigrants that ushered him in. Nationally it is white Christians vs minorities and single white women. Your only hope is to have 6 children a piece and to vote at the state and local level for the most radical candidate you can find. Fuck the Zionists and the neocons. They’re graceful losers happy to brown America.",
                "author": "Viewer01"
            },
            {
                "raw_content": "I'm excited for next years 9/11 celebrations.",
                "author": "new_guy2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Pamela Bondi : 🚨During the Arctic Frost Investigation, we found that Special Counsel seized President Trump’s government-issued phone. This means the Biden Administration turned over President Trump’s phone to Special Counsel—an UNPRECEDENTED action.",
        "score": 1143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do you know what would be unprecedented? You fucking arresting somebody.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "THEN FUCKING DO SOMETHING, STOP HANDING SHIT OFF TO OTHER PEOPLE, BONDI, YOU IGNORANT SLUT! She's a pass the buck blonde bitch.",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Let me go on Fox and tell y'all about it.",
                "author": "midgetpornrocks"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Decision Desk HQ projects that Democrat Jay Jones—who fantasized about killing Republicans and their children—has won the Virginia Attorney General race, defeating Republican Jason Miyares",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just dont understand how this happens. Are republicans just staying home? Why does this happen every god damn time",
                "author": "MisterKpak"
            },
            {
                "raw_content": "This country is fucked. Those texts, in a sane world, would have signaled the end of his entire political career. Instead, he is now the head of law enforcement in a blue state.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "If people don't think the Democrats will make huge gains in the midterms, they're kidding themselves. Shit needs to start getting done or it's not going to happen at all.",
                "author": "DegenNerd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Ghazala Hashmi has won the 2025 Virginia Lieutenant Governor Race defeating John Reid. Ghazala Hashmi will now become the first Muslim Lieutenant Governor in U.S. History. 🤮",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time for virginia to continue going to shit.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Why isn't she covered up if she's Muslim?",
                "author": "Oleander"
            },
            {
                "raw_content": "This is what they do. Seat by seat, bit by bit. The poison spreads.",
                "author": "LostElf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today, at the direction of President Trump, the Department of War carried out a lethal kinetic strike on a vessel operated by a Designated Terrorist Organization (DTO). Intelligence confirmed that the vessel was involved in illicit narcotics smuggling, transiting along a known narco-trafficking.....",
        "score": 1050,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It makes you think we knew all this shit before, but allowed it. 🤔",
                "author": "Powhattan"
            },
            {
                "raw_content": "I voted for this so hard.",
                "author": "MOLON-LABE"
            },
            {
                "raw_content": "Isn't antifa designated as terrorists now? Hmmmm....",
                "author": "A_Colostomy_Bag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Today we won big at the US Court of Appeals for the 11th Circuit, defending our law preventing ownership of Florida land by the Chinese Communist Party.\"",
        "score": 1633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is this not federal law. I don't mean law passed in the last few decades, but law passed closer to the country's founding.",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "the difficulty will be identifying the LLC's owning land. Between Delaware corporate law secrecy, trusts and other legal obstructions, identifying the humans controlling LLC's can be _very_ difficult. Add in leftist citizens, activist obama judges and government employees actively obstructing, decieving and falsifying documents, it's not as trivial as passing a law. It will take decades to clear the titles registry of overseas controls. not just chinese or CCP interests either.",
                "author": "PiratePatriot"
            },
            {
                "raw_content": "This isn't fair, we all can buy land in China, can't we?",
                "author": "Citizen_Bob"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "We are finally, officially, beyond the Floyd Effect—the rise in violence timed to the exact day after George Floyd died.",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The really good news is that George Floyd is still dead.",
                "author": "least_counties_ever"
            },
            {
                "raw_content": "Man, that was a long chimpout.",
                "author": "10gauge"
            },
            {
                "raw_content": "Still staying strapped everywhere it is legal to carry",
                "author": "godgoldnguns"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING...NYC race as of one minute ago...NYC has self destructed.",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Curtis Sliwa. 😆 🤣 😂",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "Ramadan Ding Dong has been declared the winner. How the hell did NYC \"forget\" 9/11?",
                "author": "DontTreadOnSnek"
            },
            {
                "raw_content": "For fucks sake. Tonight’s results were the literal WORST possible outcome. My goodness",
                "author": "TheRPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Decision Desk HQ projects Abigail Spanberger to win the Virginia Governor election.",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hard to believe after Charlie Kirk etc. this many people still vote hard left. Not a moderate by any stretch of the imagination.",
                "author": "texas4ever"
            },
            {
                "raw_content": "How do they figure this one out so fast but other races \"may take days before we know\"",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Mr. “I want to see someone’s kids murdered” Jones is also winning. Not to mention the LT Gov that’s winning is some foreigner whose name I can’t even pronounce. Enjoy your downfall Virginia",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "⁉️WHY is Minnesota refusing to give Federal Gov’t our SNAP records…!? I think I found what the @MinnesotaDFL is hiding. 🧐LOOK⬇️⬇️⬇️at this chart showing MN with a 174% SNAP issuance increase from 2020 to 2021.",
        "score": 1452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ohh, ooh I know. Fraud. Somali fraud to be exact. Check out what is happening in Minnesota. Take the time and check these links. I guarantee you didn't know how bad my state has it. Muslims rape our kids and then say it's racist that we notice. It's just their culture. https://patriots.win/p/19BtLHfSxG/an-islamic-center-in-minnesota-r/c A lot of them are entitled animals. They literally expect us to cater to their every whim. All they want to do is breed and consume. https://patriots.win/p/17sPFoWqet/feel-the-entitlement-oozing-out-/c Oh, don't forget the crime they bring with them from one of the most corrupt countries in the world. 30% of all Somalians commit blatant welfare fraud https://patriots.win/p/1AR0nd7AA4/30-of-all-somali-mothers-in-minn/c Because of them, my state is broke. https://patriots.win/p/1AR0UrJFEW/minnesota-is-drowning-in-fraud-i/c",
                "author": "MissingTrump"
            },
            {
                "raw_content": "Sub-Saharan low IQ grift",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "Gee, I wonder what else happened between 2020-2021",
                "author": "Puncake150"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Sean Duffy has done an incredible job as Interim Administrator of the National Aeronautics and Space Administration (NASA). This evening, I am pleased to nominate Jared Isaacman, an accomplished business leader, philanthropist, pilot, and astronaut, as Administrator of NASA.",
        "score": 1057,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Way to go, sir! I am looking forward to having more MANNED space missions like the ones we used to have. To the Moon, Mars, and Beyond! **MAGA!!!**",
                "author": "Oldman6541E5"
            },
            {
                "raw_content": "So this tug of war is finally over.",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115493839582779089 https://x.com/rookisaacman/status/1985846020283265319 [Elon Musk: ♥️🚀🇺🇸](https://x.com/elonmusk/status/1985850967888445645)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Rep. Brandon Gill has officially filed Articles of Impeachment against Judge James Boasberg. REP. GILL: “He is guilty of high crimes and misdemeanors and should be removed from office.”",
        "score": 1896,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Guilty of high crimes means more than just removal. Fagsberg should be hanged in a military tribunal.",
                "author": "DJT_MFers1"
            },
            {
                "raw_content": "There has been more than enough probable cause for his arrest for a long time",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Oh boy, wouldn't that send a message, convicting AND applying the punishment for high crimes and misdemeanor (Treason)",
                "author": "supertootsday"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Decision Desk HQ projects Mikie Sherrill to win the New Jersey Governor election.",
        "score": 730,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s amazing how quickly they call these elections for democrats but if a republican is in the lead with 99% of the vote in they aren’t called for a week",
                "author": "Flubadub"
            },
            {
                "raw_content": "17 minutes until we start to see how deeply New York fucked itself. Will it be a balls deep fucking? A half-assed fucking? Or a just the tip fucking?",
                "author": "OTher55"
            },
            {
                "raw_content": "Why do I bother paying any attention to polls in the run up to these elections? They made it sound like NJ has a chance of going red and it turns out to be bluer than ever. Nevertheless, I always pay attention and get drunk on hopium. I think I’m going to stop doing that.",
                "author": "Lightning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NYC had a stupid choice either way",
        "score": 593,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# FALSE DICHOTOMY",
                "author": "GarlicFart1776"
            },
            {
                "raw_content": "Who am I to tell New Yorkers how they want to live? Was interesting seeing Cuomo apologizing on Fox for the dead under his watch.",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "Voters can choose a Socialist Democrat, a failed Democrat, a black Democrat or some Republican with a goofy hat. It's just crazy that the Democrat party can run 3 candidates at once. The Republicans couldn't find not one New Yorker, a teamsters type that could have done a better job.",
                "author": "556x45mm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Video of UPS plane crashing in Louisville, Kentucky.",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God, please protect these souls and their families",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Sad. My condolences to the pilots and crew families.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "Oh man, that's horrible.",
                "author": "ImYourHuckleberry24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Insights] Memory Spot Price Update: DRAM Buyers Rush In as DDR5 Spot Prices Jump 30% Amid Tight Supply",
        "score": 18,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">According to TrendForce’s latest memory spot price trend report, regarding DRAM, buyers are snapping up quotes immediately, sending spot prices soaring. **DDR5 chips have surged 30% this week**, as overall supply remains tight and major module houses like Kingston continue to limit shipments. ... ... This week, the spot market has witnessed severe hoarding, with buyers purchasing as soon as they receive quotes, leading to soaring spot prices. This phenomenon is attributed to the persistently tight supply from suppliers and major module houses such as Kingston limiting their shipments. Last week: [https://www.trendforce.com/news/2025/10/27/news-memory-makers-reportedly-halt-quotes-on-select-dram-nand-products-as-china-faces-daily-pricing/](https://www.trendforce.com/news/2025/10/27/news-memory-makers-reportedly-halt-quotes-on-select-dram-nand-products-as-china-faces-daily-pricing/) >With South Korean DRAM giants reportedly hiking prices by up to 30% recently, China’s memory market is feeling intense pressure. According to Commercial Times, citing Calian Press, some **manufacturers have even halted quotations for certain DRAM and NAND flash products**, and when prices are quoted, they’re valid for such brief periods that they essentially change on a daily basis. Week prior: [https://www.trendforce.com/news/2025/10/23/news-samsung-sk-hynix-reportedly-lift-memory-prices-up-to-30-long-term-supply-deals-in-play/](https://www.trendforce.com/news/2025/10/23/news-samsung-sk-hynix-reportedly-lift-memory-prices-up-to-30-long-term-supply-deals-in-play/) >Samsung and SK hynix have **raised DRAM and NAND flash prices by up to 30% for Q4**, passing the new rates on to customers. End of September [https://www.trendforce.com/news/2025/09/30/news-record-low-memory-stock-could-signal-supercycle-ahead-likely-peaking-by-2027/](https://www.trendforce.com/news/2025/09/30/news-record-low-memory-stock-could-signal-supercycle-ahead-likely-peaking-by-2027/) >The Chosun Daily, referencing Morgan Stanley, **predicts the peak of this cycle will arrive in 2027**, with the surge expected to last more than a year.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I was looking at PCPartPicker and you can get a decent motherboard for less than a 2x16GB kit.",
                "author": "ActuallyTiberSeptim"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung's tri-fold shown up close in new video footage",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is really cool and actually is appropriate for everyday use since the folding display is protected once folded unlike the Huawei one.",
                "author": "atape_1"
            },
            {
                "raw_content": "I wonder how cases are going to work on this.",
                "author": "animeman59"
            },
            {
                "raw_content": "I work in a retail store that sells phones including folding phones. I would not buy 1 if they were even half the price we sell them out. The amount we get back with issues, and screens coming away at the folding point is insane. And if there is so much as a 1mm scratch on the body, Samsung denies the warranty for physical damage. Their repair centre is fucked to deal with also",
                "author": "Jaz1140"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Coherent: Truly borderless displays will soon become reality thanks to deep-UV lasers",
        "score": 5,
        "text_content": "Coherent is developing deep-ultraviolet (deep-UV) laser technology at 266 nm wavelength to enable truly borderless displays by achieving clean edge cuts with minimal material loss—less than one pixel width within the existing 50-60 micrometer inter-pixel gaps. Current UV laser cutting at 355 nm and 345 nm wavelengths produces uneven edges that damage display layers at separation points, necessitating protective bezels, while the deep-UV approach delivers sufficiently precise cuts that barely damage edge layers. However, mass production remains infeasible with current 10W deep-UV lasers due to slow cutting speeds and cost constraints; Coherent anticipates that 20W laser systems will provide the throughput necessary for commercial viability, though no timeline has been announced for when the Göttingen-based manufacturer will deliver this equipment to display producers for production line integration.​​​​​​​​​​​​​​​​",
        "comments": [
            {
                "raw_content": "If they themselves call mass production infeasible that’s probably not a good sign. I’m wondering if they can’t reuse old lithography laser sources. There must be quite some krypton-fluoride (KrF) lasers (248 nanometers) and argon-fluoride (ArF) excimer lasers (193 nm) laying around.",
                "author": "Balance-"
            },
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Asetek Reports Lower Q3 2025 Revenue Due to Fewer Liquid Cooling Products Shipments",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank you Thermalright ❤️",
                "author": "NeedhelpfromYOU"
            },
            {
                "raw_content": "good things come to those who wait oh thats us!",
                "author": "surf_greatriver_v4"
            },
            {
                "raw_content": "Asetek exited the datacenter market in 2021. Oof.",
                "author": "Vushivushi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "IBM Collaborates Across Four National Quantum Innovation Centers to Help Drive the Future of Quantum-Centric Supercomputing",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "A behind-the-scenes look at Broadcom’s design labs",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2's success has proved a reminder that once again the internet isn't real life",
        "score": 884,
        "text_content": "With the recent news that Switch 2 has crossed 10 million units sold by the end of September, the whole grifter narrative that nobody wanted a Nintendo Switch or that the system would be a flop is pretty much dead in the water. The people who have been proclaiming for months that Switch 2 is dead are now left to stand and ponder in silence as their entire narrative has come crashing down. The Switch 2's success isn't really that surprising considering that when you look past the terminally online hive mind, the Switch 2 basically did everything right for a Switch successor. I always found it baffling that people were calling the Switch 2s launch terrible especially when you remember just how bland and forgettable the Wii U and 3DS launches were. Wii U would have killed to have a 1st year like the Switch 2 has had. Within the first 6 months of the Switch 2 we have gotten Mario Kart World Donkey Kong Bananza Pokemon Legends ZA Hyrule Warriors Age of Imprisonment Kirby Air Riders Metroid Prime 4 Beyond Definitive versions of some of the original Switches best games For 2026 we have so far Yoshi and the Mysterious Book Splatoon Raiders Fire Emblem Fortunes Weave Mario Tennis Fever Pokemon Pokopia On top of a pretty strong slate of third-party support with several being announced for next year just recently. The coming year I expect third party support for Switch 2 to ramp up considerably with more dev kits making their out now. And this is before the likely Nintendo Direct early next year which likely will have a major focus on Zelda considering February 2026 marks the 40th anniversary of The Legend of Zelda series. The Switch is kind of boring looking yes but it wasn't trying to reinvent the wheel. The Switch 2s goal was to build upon the foundations laid by the original Switch while bringing the experience up to date with more modern hardware and by all accounts it has succeeded in that regard",
        "comments": [
            {
                "raw_content": "If someone is not interested on Switch 2, they will just ignore and move on with their life. That's what a normal person do.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Did anyone really think the Switch 2 was going to be at all a flop…",
                "author": "Thugger_Thugger_Baby"
            },
            {
                "raw_content": "“Nintendo Switch 2 has outsold the Wii U in 4 months, Nintendo in trouble!” Then insert thumbnail of a YouTuber making a stupid expression",
                "author": "Megas751"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fun graph from Nintendo's Financial Reports detailing a variety of Switch owners who transitioned to the Switch 2.",
        "score": 171,
        "text_content": "Not just solely early adopters [https://www.nintendo.co.jp/ir/pdf/2025/251105e.pdf](https://www.nintendo.co.jp/ir/pdf/2025/251105e.pdf)",
        "comments": [
            {
                "raw_content": "Considering how much the Switch sold, this isn’t too surprising",
                "author": "Another_Road"
            },
            {
                "raw_content": "So roughly 50% of those buying the Switch 2 who owned a Switch have been long term owners since 2017-2019. Then you’ve got about 35% who got a Switch 2020-2022 and 15% who got one 2023-2025. I got the Switch back on launch in 2017. Then got the bigger battery model in 2019. Then the OLED in 2020, and then the Zelda OLED in 2023. What can I say; I’m a sucker!",
                "author": "Alasdair91"
            },
            {
                "raw_content": "2017 being the biggest makes sense, if you bought one console at launch you are gonna buy the new one on launch.",
                "author": "aPiCase"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "More Nintendo Switch 2 adoption breakdown 84% of Switch 2 players have transitioned from Nintendo Switch",
        "score": 134,
        "text_content": "Also 400 million Nintendo Accounts have been created with 128 million annual playing users More movies are being prepared in future Over 950 million mobile app downloads",
        "comments": [
            {
                "raw_content": "makes sense as like 84% of people that i talk to already own a switch 1, so many people own it",
                "author": "Peppermint640"
            },
            {
                "raw_content": "Hi. I'm one of the 16% who never had a Switch. The Switch 2 is the first Nintendo console since basically the GameCube that doesn't feel super nerfed.",
                "author": "Clay_FGC"
            },
            {
                "raw_content": "I mean yeah that makes sense most people who buy a system this early into a console’s lifecycle are most the time already in the ecosystem",
                "author": "mewtatesyt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo launches official store app for mobile",
        "score": 55,
        "text_content": "You can browse the Nintendo Store, manage your wish list, check your wallet balance, and see news. You can also view a play activity log that gives a detailed breakdown of each of the games you have played. If you have linked your NNID you can also view your play activity on Wii U and 3DS as well",
        "comments": [
            {
                "raw_content": "Nintendo is slowly becoming better at being in touch, not price wise but this is still cool.",
                "author": "Danio1864"
            },
            {
                "raw_content": "Hmmm, but if you want to buy a game, it still needs to open the browser. Maybe they can fix this with a future update",
                "author": "Shleepy1"
            },
            {
                "raw_content": "Only in the US? Can’t find it in australia",
                "author": "usernamesarehard44"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond – Nintendo Switch 2 Edition – Survive",
        "score": 866,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo fans when Nintendo starts advertising a game when it gets closer to release date ![gif](giphy|EClkor8zYeOvs9StMN)",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "The more i see Metroid Prime 4 stuff the more i’m convinced to buy the game",
                "author": "Iamverydumbazz"
            },
            {
                "raw_content": "Godamn this looks and sounds SOO epic. Classic boss fights,unique, and beautiful worlds/areas, gameplay looks tight and assets look polished. One of my most highly anticipated games…ever??",
                "author": "paperthintrash"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do we think a Switch 2 StarFox game using mouse controls would be good?",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I actually want a switch 2 star fix game but something that balances outer space dog fits and on foot ground adventure and combat. Something that feels modern in line with modern space games.",
                "author": "GronWarface"
            },
            {
                "raw_content": "As long as the mouse controls are optional, I’m fine with that",
                "author": "computerCoptor"
            },
            {
                "raw_content": "Sure, fine, anything that gets another Star Fox game made.",
                "author": "CadeCoquin"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Stealing some guys’s post, what would you rate the Switch 2 out of 10 so far?",
        "score": 277,
        "text_content": "I saw this post on r/videogames from u/jefferymr15 so i thought id post it here too, what would you rate the Switch 2 out of 10?",
        "comments": [
            {
                "raw_content": "Solid 8. Depends on the upcoming library in the next few years. Now we are getting 3 more games which is amazing. But after Metroid Prime 4. I wanna see a 3D Mario, Zelda and Metroid 6. More of Splatoon Raiders and of course Splatoon 4 one day Hell maybe even a new Starfox or F-Zero",
                "author": "Round_Musical"
            },
            {
                "raw_content": "9/10 If they did a OLED version with better battery it be a 10/10.",
                "author": "Crisewep"
            },
            {
                "raw_content": "7.5/10, needs some more first party games (which are coming)",
                "author": "Simplejack615"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Symbols that include \"Cross-Buy\" with \"PS5/PC\" that playstation has added recently have been leaked by a dataminer.",
        "score": 703,
        "text_content": "Not sure if its confirmed for PC or a future Ps6 handheld. [https://imgur.com/a/JfhxWLj](https://imgur.com/a/JfhxWLj) [https://imgur.com/a/9IpoN5o](https://imgur.com/a/9IpoN5o)",
        "comments": [
            {
                "raw_content": "If this is real then it should be verifiable by other people, as it's datamined.",
                "author": "IDONTGIVEASHISH"
            },
            {
                "raw_content": "If verified. Cross buy would be new. Could it be for handheld? Since I'm not sure if all games will be supported from rumours. Or their own PC launcher. But PS5 and PC symbols have existed for quite some time on PSN. Just go to Spider-Man or Stellar Blade. The new symbol just smushes them together.",
                "author": "-LastGrail-"
            },
            {
                "raw_content": "I’m gonna assume it’s for their PC games already on PC and their rumored handheld like they did for the PS3/4 era with Vita And perhaps their own launcher as that was rumored to be a thing iirc",
                "author": "HoleIntheAce12"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Supposedly a crossbuy button for playstation has showed up on X/Twitter",
        "score": 334,
        "text_content": "Probably fake, will delete if so image: [https://i.imgur.com/MtZ5bDL.jpeg](https://i.imgur.com/MtZ5bDL.jpeg) [https://xcancel.com/Zuby\\_Tech/status/1985795788895580232](https://xcancel.com/Zuby_Tech/status/1985795788895580232) edit: added the new screenshots of tweets that show supposed proof of this being real and the tweet with the video [https://imgur.com/a/leak-JfhxWLj](https://imgur.com/a/leak-JfhxWLj) [https://imgur.com/a/leak-9IpoN5o](https://imgur.com/a/leak-9IpoN5o) [https://xcancel.com/yAmethxst/status/1985841552288104906](https://xcancel.com/yAmethxst/status/1985841552288104906)",
        "comments": [
            {
                "raw_content": "I’m confused. Would this be PlayStations version of Play Anywhere?",
                "author": "lukas-bruh"
            },
            {
                "raw_content": "Cross-buy between PS5 and PC: Only possible if they launch their own PC launcher. They could launch one, but taking on Steam seems pointless. Cross-buy between PS5 and PS handheld: Basically a given, since it just runs regular PS5 games in a low-power mode. Could make sense for marketing purposes, but cross-buy would still be a weird word choice.",
                "author": "AceOfSpades0319"
            },
            {
                "raw_content": "I thought zuby tech was a banned source?",
                "author": "Hamburgulu"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Elder scrolls VI prediction",
        "score": 1,
        "text_content": "I highly doubt the year everyone thinks it's going to release. Game studios almost always give a possible date months to years before the real drop date. I think it's highly unlikely scrolls VI will drop in 2027. I think a good guess would be 2028 and I'm like 75% sure before the end of 2030.",
        "comments": [],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Adeia sues AMD over hybrid bonding patents used in products like Ryzen X3D CPUs",
        "score": 5,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a patent troll. They should simply make those illegal.",
                "author": "Unknown-U"
            },
            {
                "raw_content": "I find myself strongly wondering why the manufacturer of the chips in question TSMC is not named in the lawsuit",
                "author": "Kiseido"
            },
            {
                "raw_content": "sounds like a shakedown attempt",
                "author": "rvickner1"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "America could be approaching a credit and financial crisis by 2026, driven by rising consumer and corporate debt, increasing defaults, and signs of fraud within parts of the lending system",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mother of All Bubbles",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "\"...within parts of the lending system.\" Parts? The whole economy is basically a scam at this point.",
                "author": "MetalstepTNG"
            },
            {
                "raw_content": "Who would of saw it coming",
                "author": "Laker8show23"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The U.S. housing market is 'starved' for affordability: Boomers edge millennials and Gen Z out of homeownership in record numbers | Fortune",
        "score": 265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As an invisible Gen X, I am not sure it is a blessing or a curse not to be mentioned. XD",
                "author": "Poyayan1"
            },
            {
                "raw_content": "We should do an empty bedroom tax, fuck Boomers",
                "author": "Horror-Layer-8178"
            },
            {
                "raw_content": "Ladies and gents, the Boomers \"I got mine\" generation",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Treasury Secretary Warns of a ‘Housing Recession’ and Points Finger at the Fed",
        "score": 50,
        "text_content": "The U.S. housing market, along with other segments of the economy, may already be in a recession because the [Federal Reserve](https://www.federalreserve.gov/) has not been aggressive enough cutting interest rates, Treasury Secretary **Scott Bessent** said Sunday. \"I think that we are in good shape, but I think that there are sectors of the economy that are in recession,\" Bessent told CNN's **Jake Tapper** during an [interview on \"State of the Union.\"](https://www.youtube.com/watch?v=XrsFYJvsWp4) \"And the Fed has caused a lot of distributional problems with their policies.\" President **Donald Trump's** appointee said housing has been hindered by high [mortgage rates](https://www.realtor.com/mortgage/tools/mortgage-calculator/), which he blamed on the central bank. \"So if the Fed brings down mortgage rates, then they can end this housing recession,\" Bessent said, adding that low-income consumers are being hit hardest by the purported downturn because they have debts rather than assets. The Fed does not set mortgage rates directly, but instead sets the federal funds rate, which is a short-term rate for commercial banks. Mortgage rates tend to follow the yields of long-term bonds, which are influenced by investor expectations about future Fed policy and financial conditions. \"While the Fed could have some impact on the health of the housing market, lower mortgage rates and stronger homebuyer sentiment require improvements to the rest of the economy as well,\" says [Realtor.com®](http://realtor.com/) senior economist **Joel Berner**. At the latest [Federal Open Market Committee (FOMC)](https://www.federalreserve.gov/monetarypolicy/fomc.htm) meeting last Wednesday, Fed policymakers followed through with their widely [anticipated quarter-point rate cut](https://www.realtor.com/news/trends/fed-interest-rate-decision-jerome-powell-october-2025/), lowering the benchmark overnight borrowing rate to a range of 3.75%-4%. The next day, the average rate on [30-year fixed home loans](https://www.realtor.com/news/trends/mortgage-interest-rates-now-october-30-2025/) fell to 6.17%—the lowest level in over a year. However, Fed Chair **Jerome Powell** swiftly [poured cold water on expectations](https://www.realtor.com/news/trends/mortgage-rates-fed-chair-powell-speech/) of another rate cut in December, which would have been the year's third. \"A further reduction in the policy rate at the December meeting is not a foregone conclusion, far from it,\" Powell told reporters. \"Policy is not on a preset course.\" Trump-appointed Fed Governor **Stephen Miran**, who was one of two policymakers to vote for a larger half-point reduction at the latest FOMC meeting, warned in an [interview with The New York Times](https://www.nytimes.com/2025/11/01/business/stephen-miran-fed-rate-cuts.html) published Saturday that the central bank's reluctance to cut rates could lead to a recession. \"If you keep policy this tight for a long period of time, then you run the risk that monetary policy itself is inducing a recession,\" Miran told the publication. \"I don't see a reason to run that risk if I'm not concerned about inflation on the upside.\" During his weekend appearance on CNN, Bessent sounded a similar note, arguing that the Trump administration has reduced government spending, which should result in a lower inflation rate. \"If inflation is dropping, then the Fed should be cutting rates,\" the cabinet member said. The Fed has a dual congressional mandate to ensure maximum employment while keeping annual inflation as close to its 2% goal as possible. Federal Reserve Chair Jerome Powell said another interest rate cut in December is far from certain. Photographer: Al Drago/Bloomberg via Getty Images To achieve that, the central bank raises interest rates to rein in inflation and lowers them to boost job growth. Berner says while another rate cut by the Fed would give mortgage rates room to fall, it may not correspond to a one-to-one decrease in longer-term mortgage rates. \"There is much uncertainty in the economy that adds to the differential between the Fed's target rate and the rate available to homebuyers,\" notes the economist. With the [government shutdown](https://www.realtor.com/news/trends/what-a-government-shut-down-means-for-the-housing-market/) now in its second month, the Fed has been forced to make its policy decision without access to crucial economic data, such as the [employment numbers for September](https://www.realtor.com/news/trends/government-shutdown-jobs-report-federal-reserve-mortgage-rates/). A delayed inflation report from the Bureau of Labor Statistics released late last month showed the [Consumer Price Index increased 3%](https://www.realtor.com/news/trends/cpi-report-september-2025-inflation-rose-fed-rate-cut/) in September from a year ago, marking the sixth consecutive month of rising annual inflation. # Is the housing market in a recession? Berner would not go so far as to say the housing market is currently in a recession, as Bessent has suggested, but he said it might be in danger of entering one based on several key indicators. \"Home sales are on pace for their slowest full year since 1995, and even more recently as mortgage rates have fallen, the number of sales has not picked up enough to close the gap,\" notes Berner. \"At the same time, builders seem to be pulling back from delivering high volumes of low-priced new homes in the way that they have in the years since the pandemic.\" Demand for homes appears low, as buyers continue to face affordability headwinds, and supply is pulling back. \"The housing market is ultimately underpinned by the labor market, which has softened significantly in 2025 as tariffs and the general business cycle slowdown have led companies toward less hiring and more layoffs,\" explains the economist. \"People who don't feel confident in their employment are unlikely to make a large purchase like a new home.\"",
        "comments": [
            {
                "raw_content": "The distribution problem was caused by fucking QE for far too long. The asset bubble is doing nothing for the bottom 60% of Americans. If the fed wants longer duration interest rates down the can run a fucking balanced budget. Forcing down rates, or even worse, forcing QE in an inflationary environment is just going to cause the dollar to crater and goods inflation to continue to skyrocket. Inflation hurts the non-asset holding price sensitive bottom 60% the most.",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "Wow '*if I'm not concerned about inflation on the upside.'* I can see why Stephen Miran is so liked by Trump, he's completely willing to ignore inflation too.",
                "author": "silverum"
            },
            {
                "raw_content": "Even if you cut interest rates, it's just interest. You're still taking our a loan for 500k or whatever, and property taxes add to that. Most people don't see themselves being able to earn half a mill just to live in an ugly shack worth 1/8th of that.",
                "author": "Skilletmasterx"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nearly Half of U.S. Real Estate Wealth Is Held by Boomers",
        "score": 325,
        "text_content": "https://www.aol.com/articles/nearly-half-u-real-estate-184444497.html The generation referred to as Baby Boomers now controls approximately 41 percent of all U.S. real estate assets. Estimates place their holdings at roughly $18 to $19 trillion in housing alone. By contrast, younger generations are trailing: Millennials hold approximately $9.8 trillion in real estate, or just about 20 percent of the total. The imbalance becomes glaring when you realize that Boomers represent about 20 percent of the population, yet own the largest share of the housing wealth.",
        "comments": [
            {
                "raw_content": "Just wait",
                "author": "Annual-Camera-872"
            },
            {
                "raw_content": "When they were buying homes, the old generation at the time owned less than 7 percent.",
                "author": "Nearby-Poetry-5060"
            },
            {
                "raw_content": "Not defending anything or anyone here, but this statistic isnt quite as alarming as the headline tries to make it sound. Boomers make up roughly 20% of the total US population. If you exclude gen z (who are just entering the traditional age of home ownership) and gen alpha, they make up about 30% of the population. 30% of the population owning 41% of real estate is inbalanced, but is what we've come to expect. Within the next decade, all of the silent generation's real estate wealth will have been depleted by care costs, or inherited by Gen X. Boomer's real estate wealth is already starting to follow a similar fate: being swallowed up by nursing care costs, or passed down to millenials. It won't be that long before boomers are a footnote. What is REALLY a tragedy, is the residential real estate that is transfering to corporate ownership. Corporatations don't age and die, so this inventory effectively locked away from personal homeownership. Population share: https://www.statista.com/statistics/296974/us-population-share-by-generation/?srsltid=AfmBOopR5UJ7H5EUFzblMd5ho9lmJMe4nMJ0uE4MYYlLGFd_cr16Nv1N",
                "author": "RiverGroover"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Median First-Time Homebuyer Age Now at Record-High of 40",
        "score": 114,
        "text_content": "Key Findings * **Median Age Hits 40**: First-time homebuyers in the U.S. are now 40 years old on average — the highest ever recorded. This is up from 33 in 2021 and 29 in 1981. * **Delayed Homeownership**: Rising home prices and mortgage rates have pushed younger Americans out of the market, delaying their entry into homeownership by nearly a decade. * **Equity Loss**: The National Association of Realtors (NAR) warns that missing out on a decade of homeownership could cost individuals around $150,000 in lost equity on a typical starter home. Market Dynamics * **Home Prices**: The median price of an existing home is now $415,200, up more than 50% since 2019. * **Mortgage Rates**: Rates have roughly doubled since late 2021, further straining affordability. * **First-Time Buyer Share**: First-time buyers made up just 21% of the market, the lowest since NAR began tracking in 1981 — and about half the pre-2008 norm. Aging Repeat Buyers * **Repeat Buyer Age**: The median age for repeat buyers rose to 62, up from 61 last year. * **Cash & Down Payments**: Repeat buyers are wealthier, making median down payments of 23%, the highest since 2003. All-cash purchases matched a record 26%, mostly by Baby Boomers.",
        "comments": [
            {
                "raw_content": "Half of FTHBs are *older* than 40? Jesus.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "I don’t need the NAR to “warn” me of anything. In fact, if they just went away altogether, society would benefit. Relic of an economy of yesteryear, still trying to maintain cred. That’s out the window.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "Assuming for first time buyers that they will mostly have 30 year loans. They are going to be paying the mortgage into retirement.",
                "author": "Cattywampus2020"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "October 2024: US interest payments ($895B) exceeded defense spending ($874B) for first time. I analyzed this pattern across 500 years of reserve currency collapses [OC]",
        "score": 16,
        "text_content": "I spent two weeks analyzing what happens when empires reach this breaking point. The pattern is disturbingly consistent across 5 reserve currencies over 500 years. THE PATTERN: Britain (1939-1945): • Debt-to-GDP: 100% → 249% in 6 years • Took 62 years to recover • Lost reserve currency status Netherlands (1780s): • Bank of Amsterdam secretly printed money • 150 years of trust destroyed in 24 months • Reserve currency shifted to Britain Spain (1557-1647): • 14 sovereign defaults in 90 years • Despite controlling 80% of global silver supply Portugal (1515-1580): • 40% of revenue spent defending empire • Costs exceeded colonial profits • Absorbed by Spain after bankruptcy CURRENT US SITUATION: • $38 trillion national debt (125% debt-to-GDP) • $895 billion annual interest payments • 81 years as reserve currency (historical range: 80-150 years) • China cut US Treasury holdings 40% to 15-year low • Central banks hold more gold than US bonds (first time since 1996) I broke down the three historical scenarios for what happens next in an 8-minute analysis using Ray Dalio's framework: [https://www.youtube.com/watch?v=a0Av4PJ-Pnk](https://www.youtube.com/watch?v=a0Av4PJ-Pnk) What's missing from this pattern analysis?",
        "comments": [
            {
                "raw_content": "You missed finding a pattern. Every single data point you listed is unconnected. You have to pick something similar to compare to actually find a pattern. Britain - skyrocketing debt to GDP. Netherlands- money printing destroys trust. Spain - chain defaults gone wild. Portugal - bankrupt. USA - debt to GDP nowhere near Britain; no mention of money printing destroying trust like Netherlands; no chain defaulting; not bankrupt… I don’t want to be a total ass, but you need a pattern somewhere to call it pattern analysis! I do agree that the USA is cooked, you just didn’t provide any evidence.",
                "author": "dakov249"
            },
            {
                "raw_content": "The only thing missing is a good *alternative*. The US is still the 'least worst' currency to hold in reserve for the time being. BRICS and China *might* want to change that in future, but until people start demanding yuan over dollars in strong amounts, the continuously weakening or sickly dollar can still stay on top if there's nothing 'better' to run from it toward.",
                "author": "silverum"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Who’s renting with these prices?",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Average people and their 3 roommates.",
                "author": "EggsAndMilquetoast"
            },
            {
                "raw_content": "I dont get how 2 bedrooms used to be maybe $200 more than a 1 bedroom, now it's $1000 more. How anyone with kids is ever expected to move from their current apartments in beyond mee",
                "author": "AbbreviationsSad5633"
            },
            {
                "raw_content": "New Yorkers",
                "author": "jopi888"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI-washing and the massive layoffs hitting the economy",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI = Apply Immediately \\[for a new job\\]",
                "author": "beardko"
            },
            {
                "raw_content": "It's called **AI-Washing**. I just heard an interesting commentary on CNBC. The reality is that businesses are using AI as an excuse for reducing staff instead of telling the public and investors that their businesses are no long profitable.",
                "author": "RealisticForYou"
            },
            {
                "raw_content": "Jobs are getting outscourced to India by the thousands, AI is the excuse",
                "author": "TechnicalRough2140"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sora is now available on Android...",
        "score": 38,
        "text_content": "Here's a free invite code to whoever snags it first!",
        "comments": [
            {
                "raw_content": "Thanks, got it.",
                "author": "ratheesh6"
            },
            {
                "raw_content": "It's missing features the website has but now you can make a cameo of yourself.",
                "author": "yaosio"
            },
            {
                "raw_content": "Seems still US only. Btw if you're curious about switching regions, it's really tough for Google accounts so don't bother there's like need to connect US payment method and it locks you for 1 year to US... Edit; supported countries list from their twitter: Canada Japan Korea Taiwan Thailand US Vietnam",
                "author": "qustrolabe"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New OpenAI models incoming",
        "score": 253,
        "text_content": "People have already noticed new models popping up in Design arena. Wonder if it's going to be a coding model like GPT-5 codex or a general purpose one. [https://x.com/sama/status/1985814135784042993](https://x.com/sama/status/1985814135784042993)",
        "comments": [
            {
                "raw_content": "Gemini 3 and a GPT-5 update or possible IMO model on the way? We gonna be feasting this November and not just on thanksgiving",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Out of all the $200+/month plans I've tried, ChatGPT Pro is starting to become the most worth it imo, the pace of changes and new stuff to play with has been great lately",
                "author": "ethotopia"
            },
            {
                "raw_content": "https://i.redd.it/hlfjkpkj9czf1.gif",
                "author": "Relative_Issue_9111"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is depreciating these models by Nov 18th. Gemini 3 soon?",
        "score": 270,
        "text_content": "as found in release notes [https://ai.google.dev/gemini-api/docs/changelog?hl=en](https://ai.google.dev/gemini-api/docs/changelog?hl=en)",
        "comments": [
            {
                "raw_content": "Depreciated? Damn, not even AI models can escape currency manipulation",
                "author": "ale_93113"
            },
            {
                "raw_content": "Deprecate",
                "author": "HVVHdotAGENCY"
            },
            {
                "raw_content": "i also found this funny but sus that they mispelled 2025 in the oct 29 release notes lmao https://preview.redd.it/etrb99d7lbzf1.png?width=648&format=png&auto=webp&s=4cb50c0a5aeb303a1245540a27a8ce3eb361447d",
                "author": "YaBoiGPT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Coca-Cola’s annual Christmas advert is AI-generated again this year. The company says they used even fewer people to make it — “We need to keep moving forward and pushing the envelope… The genie is out of the bottle, and you’re not going to put it back in”",
        "score": 585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The genie is out of the bottle. If we want to avoid the disaster when mass unemployment hits we need to demand change now. At a minimum we need UBI (but that is at best a temporary fix imo).",
                "author": "marrow_monkey"
            },
            {
                "raw_content": "Jesus christ this is miles better than last year and also much longer. I'm curious about the jump in quality next year. This progress is immense.",
                "author": "UstavniZakon"
            },
            {
                "raw_content": "Yet everyone told me I was an idiot when I said by 2030 we'll have full professional movies and TV shows in AI.",
                "author": "SleepingCod"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Video Reel of the new Gen-0 model in action",
        "score": 260,
        "text_content": "There's another thread, but I know how much people want to see videos up front so figured this would get more eyes. https://generalistai.com/blog/nov-04-2025-GEN-0",
        "comments": [
            {
                "raw_content": "Just think how amazed we all were with first chatGPT. This is gonna look pathetic in 5 years.",
                "author": "plaintextures"
            },
            {
                "raw_content": "Huge if true 🥳 >To our knowledge [mine as well], this is the first time that model ossification has been observed in robotics. [...] Ossification has previously been observed in LLM literature in the high data regime but with much smaller models, on the order of O(10M) parameters rather than O(1B). The observation that this phase transition occurs in robotics but with much larger model sizes echoes Moravec’s Paradox: what humans find effortless—perception and dexterity—demands far more computational complexity than abstract reasoning. Our experiments suggest that intelligence in the physical world (i.e. physical commonsense) may have a higher activation threshold in terms of compute, and we’re only beginning to explore what lies beyond.",
                "author": "LatentSpaceLeaper"
            },
            {
                "raw_content": "this is astounding",
                "author": "emteedub"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why is no one actually demanding UBI to happen but still believe it will happen cause ?",
        "score": 199,
        "text_content": "I mean do you think private companies that are investing the most in AI tech arent going to keep the profit for themselves unchecked because sure as now many governments arent going to start handing out a living wave to every single unemployed person there is going to be , there arent doing that with the poor of today did any of you really throught this through ?",
        "comments": [
            {
                "raw_content": "I think it's because it's hard to imagine the massive homelessness and starvation that's likely to happen without something drastic like UBI. People have gotten used to a comfortable life. Humans are always ignoring problems until the very last moment. Like why are we still burning fossil fuels? Because the problem is later, not now, so steady on.",
                "author": "WhenRomeIn"
            },
            {
                "raw_content": "It’s too soon. Need sticky unemployment over 10% despite economic growth for a spell to make it realistic. It sucks for the cohort unemployed at the time, but there’s no way around it. Asking too early just makes us sound like the average /r/antiwork poster.",
                "author": "etzel1200"
            },
            {
                "raw_content": "Best I can do is defunding SNAP.",
                "author": "IEC21"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is planning to launch solar-powered satellite constellations with TPUs and free-space optical links to one day scale machine learning compute in space",
        "score": 301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No NIMBYs in space.",
                "author": "etzel1200"
            },
            {
                "raw_content": "Pantheon TV Show shit right there",
                "author": "Constant-Arm9"
            },
            {
                "raw_content": "that's okay but when will we get a light based massive computer in the space? imagine a chip that is not compact but massive that communicates with light or laser . no heat problem. massive parallel compute edit: huh they already launched photonic computer in space last June. woah [World’s first space-based quantum computer launches into orbit ](https://share.google/QLoZnRFIaHFmAs66n)",
                "author": "kvothe5688"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "What happens when online job applicants start using LLMs",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Submission statement: Before ChatGPT, employers clearly paid attention to how tailored a proposal was: a one-standard-deviation increase in “customization” raised the chance of being hired as much as cutting your bid by about 26 dollars. After the platform rolled out an AI writing tool in April 2023, that premium for customization basically disappears. **Signals that used to correlate with effort and actual job success stop being informative once everyone can generate “good writing” at zero cost.** The authors build a structural model of the market where workers choose how much effort to put into signaling and what wage to bid, while employers decide whom to hire based on bids, signals, and beliefs about ability. They estimate this on pre-LLM data, then simulate a counterfactual world where written proposals no longer convey any information about ability and workers can only compete on price and crude observables like ratings. In that world the market becomes less meritocratic: **workers in the top ability quintile are hired 19 percent less often, those in the bottom quintile 14 percent more often, average wages fall about 5 percent**, hiring per posted job falls 1.5 percent, worker surplus drops 4 percent, and employer surplus barely moves. High-ability workers tend to have higher opportunity costs so once signaling breaks, they lose wage and hiring share to lower-ability low-cost competitors [Paper](https://x.com/paulnovosad/status/1985794588800331987?s=12)",
                "author": "BigShotBosh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "IBM Collaborates Across Four National Quantum Innovation Centers to Help Drive the Future of Quantum-Centric Supercomputing",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Quantum AI ads...can't wait!",
                "author": "Seventh_Letter"
            }
        ],
        "subreddit": "singularity"
    }
]