[
    {
        "post_name": "BOOM! Jesse Watters just DROPPED A TRUTH BOMB on the trans violence epidemic…!",
        "score": 1398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't really give a fuck about these mentally-ill freaks 10 years ago. I just laughed at them. I'm laughing no more. Now, I want this \"community\" utterly destroyed. We can stand by and watch these dysgenic, degenerate monsters slaughter our children no longer.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Dudes taking birth control pills and SSRIs never end up doing too well...",
                "author": "posedgeclk"
            },
            {
                "raw_content": "This \"community\" speak is strange. If they were all people with an eyepatch they wouldn't be the eyepatch community.",
                "author": "Kingoftheroad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Klobuchar Calls for a National 'Assault Weapons' Ban in Wake of Minneapolis Shooting / How about ban trans you bitch!",
        "score": 1190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't forget that Climate Change had a role in this too!",
                "author": "Herc130"
            },
            {
                "raw_content": "Well that didn't take long. How about a troon ban? The last few shooters were all LGBTQ...",
                "author": "MissingTrump"
            },
            {
                "raw_content": "WTF is an assault weapon? We need to introduce common sense definitions. An assault rifle has a dildo attachment.",
                "author": "learntocode"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don't give a fuck.",
        "score": 1664,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There should be a moratorium on ALL immigration for the next 10 years.",
                "author": "LibertyFox"
            },
            {
                "raw_content": "Now do joggers and goat fuckers",
                "author": "TrumpPatriot84"
            },
            {
                "raw_content": "You know, if the Powers That Be had just continued to allow them to trickle in at the few millions per year, we probably would still be pretty apathetic about it all. But when they open the flood gates, abuse their own citizens (actual traitors to them in some cases), restrict our freedoms in the process and make us second class (or lowest class) in the process, then that's it. It got bad enough REAL FAST. We are done. We can all agree on it and ignore the few rainbow wackadoodles that whine.",
                "author": "OldMule68"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "4chan and KiwiFarms are suing the UK government over their speech laws. The opening is absolute🔥",
        "score": 1562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The internet should be more of a \"wild west\" than have any real \"rules\"",
                "author": "DingleBalls"
            },
            {
                "raw_content": "This is an important battle to fight. If the E.U, or any other subjugated country, can threaten American companies for allowing free speech, then the deep state will have an easy avenue to simulate speech restriction here.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "Full filing: https://www.courthousenews.com/wp-content/uploads/2025/08/4chan-kiwi-farms-sue-uk-age-verificaiton-law.pdf",
                "author": "kompromatdotwin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"When you “affirm” mental illness instead of treating it, people get hurt.\"",
        "score": 1492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why the long face?",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "That's Rocky!",
                "author": "Bigsweaties"
            },
            {
                "raw_content": "We should affirm anorexics as fat and give them liposuction.",
                "author": "least_counties_ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When will the FBI investigate Reddit?",
        "score": 1330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We're at war, better act like it. All Christians need to unify against these scum. This will not stop here, these cocksuckers want us all dead",
                "author": "CrazyPope"
            },
            {
                "raw_content": "CCP TENCENT OWNS REDDIT",
                "author": "CommieCrats"
            },
            {
                "raw_content": "But we're the hateful ones, right?",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat Mayor of Minneapolis Jacob Frey DEMANDS the entire country rally for transgender people after a trans k*ller SH0T at children in a church today.",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All trannies can go fuck themselves",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "They keep targeting innocent children and now I wish nothing more than the complete and utter DEATH of the transvestite \"movement.\" There's your support, you degenerate, ugly, mentally-ill FREAKS.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "What if the US gov't created the tranny movement?",
                "author": "ConGrande1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump has fired new CDC Director Susan Monarez.",
        "score": 1378,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i knew what she would look like before even opening the post",
                "author": "highenergywinning"
            },
            {
                "raw_content": "RFK: \"Vaccines cause autism.\" This lady: \"REEEEEEE\" Potus: \"You're fired!\"",
                "author": "trumpfan75"
            },
            {
                "raw_content": "I wonder if she was the leader who approved the COVID-19 vaccines without informing RFK?",
                "author": "asiatrails"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "More Good News: At Least Three Senior CDC Officials Resign After Dr. Monarez Ousted as CDC Director… Cites “Ongoing Weaponization of Public Health”",
        "score": 977,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The worst thing conservatives did during the dem takeover from the 90-10’s was to fall on their swords and resign in protest. I hope Dems keep making this mistake. Never resign when woke or other bad ideologies come in. Always become the insurgent that undermines them. You are far less effective on the outside.",
                "author": "Viewer01"
            },
            {
                "raw_content": "YOU forced POISON on us by threatening to take our jobs from us, you evil fucks! YOU weaponized public health. Burn in Hell!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "YES!!! FUCK MONAREZ! DEEP STATE BIOWARFARE TRASH!!! These people are MURDERERS!",
                "author": "flp999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WTF? The police chief of Minneapolis says NO MOTIVE could be determined of the transgender shooter at a Catholic Church and school…",
        "score": 1640,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is beginning to feel state-sanctioned.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "1. Wanted to hurt Christians 2. Was a mentally ill troon 3. Was a far left piece of shit who wanted to hurt people because they were a loser",
                "author": "MixedBlacknWhite"
            },
            {
                "raw_content": "How about the fact that his Mom used to work at the church? Same Mom who applied to have his name changed from Robert to Robin. Who paid for that vast arsenal is what I want to know?",
                "author": "War_Hamster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ABC implies shooter was Trump supporter.",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "if anything ever were to pop off, for real(even though it probably wont ever) i hope its the media that gets hunted down first",
                "author": "highenergywinning"
            },
            {
                "raw_content": "Oh so I guess white nationalist didn't work in the couple hours they were pushing it. Now a Reddit troon is... MAGA. Sure, why not.",
                "author": "Zhongda"
            },
            {
                "raw_content": "ABC = Disney",
                "author": "TrumpShadow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Minneapolis Mayor Jacob Frey, who kneeled, wept, and prayed by George Floyd's coffin is now telling us not to pray for Christian children who were gunned down at their church. \"Don't just say this is about thoughts and prayers right now. These kids were literally praying!\"",
        "score": 1373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a fucking scumbag.",
                "author": "NormalCitizen"
            },
            {
                "raw_content": "I want these fuckstick lefties out of my country as much as the illegals.",
                "author": "HoganP"
            },
            {
                "raw_content": "That's mighty Jewish of him.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Admin Threatens States with Funding Cuts for Pushing Gender Ideology ‘Poison’",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Designate transsexuals as domestic terrorists",
                "author": "powercessna"
            },
            {
                "raw_content": "We need a detention area like Alligator 🐊 Alcatraz to house mentally ill faggots",
                "author": "awsure"
            },
            {
                "raw_content": "slaynews is not a real news site",
                "author": "Osmanthus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Operation Pick-Off’ Leads to Arrest of 78 Criminal Aliens in South Texas over Weekend. The arrests included many illegal aliens who had previously been deported.",
        "score": 1218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are all criminal aliens. They became criminals when they illegally crossed the border and entered the U.S.",
                "author": "Talon54"
            },
            {
                "raw_content": ">previously been deported If this country wasn't so sheepish about imposing harsh penalties on illegals, like \"if you come back illegally and we catch you, you're getting a choice between hard labor for life or going home without your legs\" they would think twice about coming back.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "78? They can fit that many into a 1996 maroon Ford Aerostar van with peeling paint and badly bubbled tint on the rear window.",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trannies be like",
        "score": 1423,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Troons are so ugly it’s disgusting",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "How about just shoot yourselves instead, you failed science projects 🖕🏻",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Aren't trannies responsible for like 90% of mass shootings not including the gang stuff in Chicago and Philadelphia?",
                "author": "556x45mm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RIP to my buddy of 18 years. Got him in college. Been through a couple relationships, at least 6 different residences, 5 jobs, one marriage, two children & god knows how many trials & tribulations. Glad I got to say goodbye, he died at home, at peace & I didn’t have to put him down. Love ya, peeps",
        "score": 225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "18 years. That's amazing 👏. Sorry for your loss. But happy that you had such a long relationship with your buddy.",
                "author": "Landslide_2020"
            },
            {
                "raw_content": "You gave him a good life, and he returned the favor. Very sorry for your loss.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Connection to our fur friends is one of our greatest strengths, thank you for being there with him and providing a forever home. My thoughts are with you.",
                "author": "T471"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WTF?! Harjinder Singh, the illegal truck driver who KlLLED three people when pulling an illegal U-turn was pulled over in New Mexico in July… AND COULDN’T EVEN SPEAK TO THE OFFICER. Whoever gave this guy a license to drive big rigs needs to be in JAIL!",
        "score": 348,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These fuckers are everywhere, and they *will absolutely* run you off the road or worse. And then they will have the nerve to HONK AT YOU like you were at fault. Send them all back. Every single one.",
                "author": "CrustySockpuppet"
            },
            {
                "raw_content": "Cop could have saved 3 lives if he arrested him and called ICE. Instead the cop apologizes for giving a ticket. Suicidal empathy.",
                "author": "MyNewSkin"
            },
            {
                "raw_content": "How many tickets can a truck driver get and still be able to keep his license?",
                "author": "RocketSprocket"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The suspect in the Minneapolis, Minnesota, shooting at a Catholic school and church has been identified as Robin Westman, who posted a manifesto on social media just two hours ago, including a video showing the words “kill Donald Trump” written on a gun. (also a tranny)",
        "score": 1746,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If so, this is the last day you’ll hear about this incident. The media will bury it and some other event will eclipse it in the zeitgeist.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Remember, this all started with faggots proclaiming \"we just want to get married.\" Also recall when the acronym was just \"LGB\". Then the troons flared up and demanded the \"T\" be added. The downward spiral continues...",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "So a mentally ill man pretending to be a woman radicalized by leftist retardation. Shit needs to end.",
                "author": "Sauvignon_bleach"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: After a TRANS SHOOTER killed TWO KIDS in Minneapolis, a WHISTLE-BLOWER from the Pediatric “Gender” Center is SPEAKING OUT 🚨 “What I saw was that we were harming these kids. They were not getting better. Often, their mental health was getting worse. We were tearing apart families.”",
        "score": 365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Absolutely No One is surprised by this.",
                "author": "BenjaminLWillard"
            },
            {
                "raw_content": "https://x.com/JesseBWatters/status/1960870968340947368",
                "author": "Looniz74"
            },
            {
                "raw_content": "\"Generally it's the tortured who become the torturers.\" Democrats abuse, brainwash, drug, mutilate and hurt children, then they point them at their enemy and say \"they're the cause of your misery.\"",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Things that make you go \"hmmmmm.\"",
        "score": 693,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And a troon with absolutely no valuable work skills somehow affords an entire arsenal. Grenades. And ammo to boot. No job, no money. Good arsenal. I know the media and social media genuinely believe people are retarded. But come on now. At least try to make this at least a bit convincing.",
                "author": "Zhongda"
            },
            {
                "raw_content": "Like every elementary school shooter I can recall, he had attended the school where he carried out the shooting (in this case, the school and the church were basically the same thing from a students point of view, since the students regularly attended mass at the church during school hours). For whatever reason, the pattern with elementary school shooters is that they still live in the immediate area, have failed to launch any productive adult life or be on track towards that, and skip over the more recent schools and workplaces that they've had any connection to, and go for the elementary school. Adam Lanza did this, the Uvalde shooter did this, the \"trans\" shooter at the church-affiliated school in Nashville did this. It's a pattern that's not specific to any religious connection or motivation.",
                "author": "Deplora"
            },
            {
                "raw_content": "If many brave pedes with ample hard drive space didn't start downloading shit immediately the media narrative would have been a LOT different! Because the local law enforcement and media would selectively release information to support a \"narrative\" after shit was taken off the net.",
                "author": "based_trekkie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "(Gamers Nexus) How Razer Screws Customers | Hardware, Software, & Support Failures",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yea anyone who has owned a Razer laptop or used synapse won't be surprised. My 2023 Razer Blade 16's trackpad was buggy as hell, no amount of reinstalling anything would fix it. Got my refund and never touched their laptops again. When everything works they're great. But praying a $3500 machine won't randomly turn into paperweight that the support will do their best to not replace is just not something I want to deal with anymore.",
                "author": "Ar0ndight"
            },
            {
                "raw_content": "I’m probably one of the few that didn’t have much problems with Razer hardware (aside from one scroll wheel in Naga), but software is another thing entirely. Holy shit does it suck. As probably most software from other hardware vendors, am I the only one whose MSI Center boots slower than some AAA games take to boot into game?",
                "author": "Henrarzz"
            },
            {
                "raw_content": "I bought the razer deathadder, great mouse but I couldn’t stand the shit show synapse is. Their keyboards are not very good",
                "author": "fafatzy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Older CPUs vs RX 9060 XT & RTX 5060 Ti - Mid-Tier CPU Scaling Benchmarks - Hardware Canucks",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "12600k outperforming the 9800x3d in cs2 is crazy lol I wonder what is going on there",
                "author": "Active-Quarter-4197"
            },
            {
                "raw_content": "Man this is super interesting to me. Back when BoTW came out, I had a OCed to over 4 ghz 6600K system, and it had trouble emulating it via CEMU and I had to decide between a 9600K or a 2600X, and all signs pointed to that the intel CPU was stronger, esp since the 9600K can be \"easily\" OCed to 5Ghz all core (you still have obviously chances to not get that, it was a silicon lottery win but a small win as most people can hit that with just how much volts you added being the difference) And then when the 5000 series came out after I built my system, even at that point the stock to stock of 9600K vs 5600X was that they were comparable but a 9600K had better OC headroom. until the 5800X3D came down and brought the hammer that is. and then TOTK released and I had to get a 7800X3D to emulate it via ryujinx properly as the thing worked fine above ground with that 5Ghz OC but not below at all and chugged hard. It is interesting that my old observations for emulation (A VERY cpu heavy way to game) holds up more or less to this day, and I would have loved if they actually did a 5Ghz OC on the 9600K and see if it would keep up as last I heard that it was like getting close to stock 11th gen performance with that OC and is only surpassed by 12th gen.",
                "author": "theholylancer"
            },
            {
                "raw_content": "1440p native ultra settings on this class of GPUs is doing all the heavy lifting to make older CPUs look good. There are some really CPU heavy titles in here but they're stuck at sub 60 fps GPU bottlenecks. With modern upscalers you can push into proper high refresh rate gaming even with something like a 9060 XT, unless you CPU holds you back (which the bottom half of these graphs will in many games)",
                "author": "Morningst4r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Microsoft is promising to make Bluetooth audio much better in Windows 11",
        "score": 343,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop promising, just deliver.",
                "author": "yflhx"
            },
            {
                "raw_content": "TLDR: Microsoft is promising to enable both microphone and high fidelity audio support using their currently supported Bluetooth LE Audio feature on a future Windows Update. By the way and for those who don't know, both your computer and your wireless headphones / earbuds need to support Bluetooth LE Audio to make use of this feature. I'm mostly intrigued if Microsoft will finally ship a Bluetooth LC3 codec (the default codec of Bluetooth LE Audio) with their OS so that you don't have to rely on third party drivers. I'm especially a fan of the far lower latency compared to the rest of the bluetooth codecs available on the market.",
                "author": "campeon963"
            },
            {
                "raw_content": "Isn't it funny that bluetooth is 30 years old tech and still not reliable? I know there're multiple factors behind that, but still.",
                "author": "ElephantWithBlueEyes"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GMP damaging AMD Zen 5 CPUs?",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like the discoloration is under the IOD. Also they are using some really cheap and crappy ASUS boards(like the VRM on those is probably hitting well over 100C with a 9950X at 100% load). Though if the motherboards still work I wouldn't necessarily blame them. EDIT: Just for clarity. The VRM running well over 100C isn't going to hurt the CPU until one of the mosfets dies which will kill the motherboard and might kill the CPU. EDIT2: if the motherboards are broken I would go and check if CPU 8pin power connector isn't shorted out. If there is a short chances are the motherboard sent 12V to the CPU.",
                "author": "buildzoid"
            },
            {
                "raw_content": "1. The problem of burning AM5 CPUs is not limited to ASRock and the community at large is failing by either supporting that myth or actively not dispelling it. 2. Those motherboards will not sufficiently power that CPU. The CPU will simply not boost as high (HUB has demonstrated this in several videos, 1 of which is very recent and a part 2 is expected) or the motherboard VRMs should burn out. This is a bit of ignorance on \\*gmplib part. Asus has their loyalist. 3. [The 9950X can suck down 270 watts](https://hwbusters.com/cpu/amd-ryzen-9-9950x3d-cpu-review-the-top-multi-core-gaming-processor/attachment/power_consumption_peak-40/), well past the abilities of the the Noctua NH-U9S to cool, which they admitted to though they went with advertised numbers instead of tested numbers. The CPU should have throttle. That's a double whammy of failures.",
                "author": "ecktt"
            },
            {
                "raw_content": "Interesting. Would be awesome if AMD could review this.",
                "author": "the_dude_that_faps"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 Has Sold 2 Million Units in the U.S., 75% Ahead of the Switch 1's Pace - IGN",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People in this sub just flat out do not understand that no one outside of hardware enthusiasts give a flying fuck about paper specs. Most people care about what experience a product can give them for the money and that's it. And honestly unless you are comparing individual components, like one CPU against another, it makes way more sense to look at products holistically instead of obsessing about numbers on a spec sheet. If you spent $300 on a Switch in 2017 then you ended up getting an enormous library of games to choose from and are _still_ getting new titles. Switch was built on old underpowered hardware but that $300 was one of the best values you could ever get in gaming. The investment paid off. The same thing will apply to Switch 2 at $450. It's built on old hardware with an SoC on an old node that everyone here was complaining about but over the lifetime of the device you are going to get loads of games that you cannot get anywhere else in a tried and true form factor from a company that is guaranteed to provide years and years of strong software support. Unsurprisingly, most actual gamers care about games first and everything else afterwards. Owning a Switch was a great experience and owning a Switch 2 will be as well. The prevailing attitude on this sub is like if you went to buy a new car and looked up the horsepower/torque figures and quarter mile times and chose based off of that alone, ignoring the interior or ride comfort or road noise or infotainment or stereo or any of the other things that cannot be quantified but are critical ingredients that culminate in the _experience_ of owning and operating that car. Then you're sitting at a stoplight next to a person who bought the \"wrong\" car and judging them because they got less HP for more money and the only way anyone would do that is if they were an idiot or a sheep or a rube. They are smiling and unbothered and you are thinking about how epically you are going to roast them on the internet when you get home.",
                "author": "shoneysbreakfast"
            },
            {
                "raw_content": "So it sold 1.1 million in the US in the first week (same [source](https://bsky.app/profile/matpiscatella.bsky.social/post/3lrj7u74vi22v)) and since then has sold 0.9 million over \\~3 months while being fairly well stocked? I'm not sure this is out of the woods from Switch 2 just being better stocked and not higher demand. It'll be interesting to see how it looks after a year or two to get a real idea.",
                "author": "ithinkitslupis"
            },
            {
                "raw_content": "I wasn't thrilled about the big jump in prices of games, but I'm really holding off to see if they make a Switch 2 OLED edition. \\*edited for clarity, wrong word, wrong meaning",
                "author": "Geek_King"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA 2nd Quarter FY26 Financial Results",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nvidia is going to start reporting on the dollars they didn't make, because that's simpler than reporting all of the many dollars they do.",
                "author": "wrosecrans"
            },
            {
                "raw_content": "Second-quarter Gaming revenue was $4.3 billion, up 14% from the previous quarter and up 49% from a year ago.",
                "author": "BarKnight"
            },
            {
                "raw_content": "Gaming still around 10%, about the same percentage as last year. But datacenter growth clearly starting to slow down? Maybe it's too early to say. But it *was* very consistent for the last two years. I wonder how much more growth in AI investment is sustainable before seeing more returns.",
                "author": "tux-lpi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phison Posts Latest Update on SSD Controller Stability",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">In response, Phison dedicated over 4,500 cumulative testing hours to the drives reported as potentially impacted and conducted more than 2,200 test cycles. We were unable to reproduce the reported issue, and no partners or customers have reported that the issue affected their drives at this time.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "If moving 50-100GB of data was all it took for this to happen and start bricking SSD's then this would be a massive issue that would blow up overnight around the world with millions of users reporting issues. Tens of thousands of companies would instantly notice the issue. Tens of millions of users everywhere would instantly notice the issue. Like people underestimate just how many Windows based systems are out there fully updated. This is just proof how quickly paranoia spreads. There's infinitely more people discusing if the update is safe or not than there is actual people reporting having any issues.",
                "author": "Firefox72"
            },
            {
                "raw_content": "Though the issue is still being investigated, but from the way the issue was reproduced (The usage that triggers the issue is not that rare IMO) according to the original japanese poster (who did a good job reviewing this issue), it should be affecting much more systems during public preview phase, and should be very quickly picked up by some enterprises and then force MS to withdraw the updates. For now, I am working for a an F500 company, my PCs (managed by IT) still have this update installed. MS might not care about average consumer, but it will certainly act if the issue hits F500 company. I wonder if there are any other individual who've done an complete invertigation with multiple SSDs using a different PC setup (as the orignal japanese poster use only his own setup to test multiple SSDs if I remember correctly.)",
                "author": "cjj19970505"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What's it like using the first Ryzen CPU for gaming in 2025? [RandomGaminginHD]",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A casual video that put into perspective that core count is not the only metric for gaming performances. Ryzen 7 1800X (OC) vs Core i3 12300 in a few older and more modern titles. Zen1 was never a great performer to begin with but even with 8 cores it's still way behind a modern 4 cores CPU.",
                "author": "kyp-d"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[ServeTheHome] NVIDIA Outlines GB10 SoC Architecture at Hot Chips 2025",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blackwell on Tsmc 3mn instead the 5nm will be interesting to see.",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo Switch 2 Already Stands as 2025’s Top-Selling Console in the U.S",
        "score": 318,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean.. Is anybody, like.. Surprised or shocked? The two consoles that came out in 2020, by the way, aren't the top sellers compared to a mainline Nintendo console?",
                "author": "LadyDalama"
            },
            {
                "raw_content": "Love mine, just wish devs would be a bit quicker with upgrades. Lot of my favorite switch games look blurry since it's now in 1080p",
                "author": "CelticSith"
            },
            {
                "raw_content": "New console is best selling console of that year. Water is also wet.",
                "author": "Hansoloai"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You want the new Mortal Kombat Legacy Kollection, but still fear it's a game key card? Me too. So I asked Atari...",
        "score": 299,
        "text_content": "And they answered. I'm pretty glad.",
        "comments": [
            {
                "raw_content": "From my understanding it’s also $10 more compared to PS5 physical version",
                "author": "Elrothiel1981"
            },
            {
                "raw_content": "Great news!",
                "author": "cloudlocke_OG"
            },
            {
                "raw_content": "I would take that with a MASSIVE grain of salt. Outsourced customer support from a 3rd world country are uninformed with this sort of stuff",
                "author": "Kicka14"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Square confirms 30fps for FFVII Remake",
        "score": 389,
        "text_content": "Nintendo Life was reporting staff at the demo said it was 40fps. It would have been nice to have 40.",
        "comments": [
            {
                "raw_content": "Not gonna stop me from getting this… give me a non janky LOCKED 30fps for this game and I’m happy , my life is constantly on the move and little breaks to keep my sanity (ie gaming) the switch (2) is perfect for this life.",
                "author": "sevenmoon"
            },
            {
                "raw_content": "Remake was the best running 30fps game I've played on the PS4. A 40fps mode wouldve been nice but once it's a stable 30 then it'd be a good way to experience the game.",
                "author": "gladexd"
            },
            {
                "raw_content": "Pretty pitiful Nintendo Life said it was 60 in their original video, then issued a clarification it was actually 40, now we finally learn it's 30 (which I think we all knew anyway).",
                "author": "Loud-Explanation-909"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 has now surpassed 2 million units sold in the US life-to-date. It is currently 75% ahead of the unit sales pace set by the original Nintendo Switch.",
        "score": 474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is hard to state how successful the launch of the switch 2 has been. Not in the traditional holiday season. Launched at the start of a summer when cost of living and international tariffs are weighing heavy on consumers. When the console market is seeing a significant downturn in hardware. And it’s still literally smashed every single console in history. It’s really incredible - like a completely unique thing. Something that in decades people will use as a case study for launching a piece of hardware.",
                "author": "ShotAcanthocephala8"
            },
            {
                "raw_content": "They really need to send out dev kits then..",
                "author": "From_Graves"
            },
            {
                "raw_content": "Perks of having an extremely well stocked launch. I'm looking to get mine soon because I think the price will go up within the next year like every other console on the market.",
                "author": "gladexd"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Reviews that are that wrong on a factual level should be excluded from Metacritic.",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In this thread: people who don't know the difference between an opinion and a fact. Stating that the game performs \"exactly\" the same as the Switch 1 version is flat out incorrect. It's not an opinion.",
                "author": "GarionOrb"
            },
            {
                "raw_content": "Remember the publication and the author and don't trust them in the future. That's your responsibility, MC responsibility is to aggregate scores.",
                "author": "calibrono"
            },
            {
                "raw_content": "This is maybe the stupidest comment section of the year",
                "author": "Big-daddy-Carlo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Some games I want to get a switch 2 update",
        "score": 447,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blows my mind that all Switch 1 Pokemon games didn't get a next gen pass. Legends Arceus could have been staggered after Scarlet/Violet to fill the gap between Switch 2 launch and Legends Z launch (and potentially scoring a few more sales). Sw/Sh aren't anything to write home about, but they're still on shelves for some extra sales. All in all, very disappointed with how much of my Switch 1 library is still locked at 30fps (not just Pokemon). Hyrule Warriors, Bravely Default 2, Dragon Quest Monsters (horrendous experience tbh), Mario & Luigi Brothership, and more. Hopeful we see a bigger pass at some more Switch 1 titles at some point, but it's starting to feel like it was a temporary thing to help bolster the lack of games at launch.",
                "author": "Okumara"
            },
            {
                "raw_content": "We need an Astral Chain 2!",
                "author": "_garethlewis_"
            },
            {
                "raw_content": "I want all the Xenoblade games to get updated. At the very least unlock the frame rate. Even better if the resolution got updated did too.",
                "author": "DivinityLight"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Starwars outlaws is 18.2gb on Sw2",
        "score": 103,
        "text_content": "They must be doing a LOT of work on this port. Also it might still be in development? The game on July 31 appeared in the eshop at 20.6GB I check med it last week and it was 19.1GB and now it’s 18.2 gbs. I will say I’m relieved it won’t take much storage as I was prepared for a big install.",
        "comments": [
            {
                "raw_content": "They’ve been continuing to develop it since it released a year ago lol",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "Sometimes a late port is actually a good thing for the game.",
                "author": "FireAndInk"
            },
            {
                "raw_content": "They’re definitely still working on it, down to the wire. There will be a day one patch.",
                "author": "Leggo213"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1 first year vs Switch 2 first 6 months",
        "score": 42,
        "text_content": "The sheer amount of games coming up in the next few months just made le realize that the pace this year, if it may not look like it, is just bonkers. We all had an explosive start with either MKW and/or Cyberpunk, before Bananza came to rock our worlds. Silksong is right around the corner and I for one have literally one game per week to buy in October: Little Nightmares III, Persona 3, Mina the Hollower, Dragon Quest I and II and Pokémon ZA. That is not even throwing Silksong and Prime 4 into the mix and I’m Not even done with Bananza yet. It’s clearly been a crazier launch for me than 2017. What about you guys?",
        "comments": [
            {
                "raw_content": "For as much complaining goes on in this sub, I haven’t run out of fun. Backwards compatibility being a feature has also allowed me to take advantage of some SW1 games as well. Great system, tons of content, I’ve been really happy.",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "Imo the switch 1 had a WAY stronger launch, but hopefully after the next normal direct the switch 2 has more of a tangible future",
                "author": "twinflxwer"
            },
            {
                "raw_content": "I think the 1 had better games because it happened to have the (general) consensus best game of the console at launch. But overall I’d say S2 has a stronger first 6-7 months lineup.",
                "author": "junglespycamp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kepler_L2: Steam Deck 2 is coming in 2028",
        "score": 276,
        "text_content": "https://www.neogaf.com/threads/rog-xbox-ally-and-rog-xbox-ally-x-launch-october-16.1687405/page-5#post-270737598",
        "comments": [
            {
                "raw_content": "That's a looooong way off!",
                "author": "roosell1986"
            },
            {
                "raw_content": "Makes total sense, ngl. The recent PC handhelds have gotten better, but I don't think they're \"generational leap\" better to justify a Steam Deck 2 coming any sooner. Honestly, apart from better compatibility, my only wish for a Steam Deck 2 is to be OLED (which I mean we already have a 90hz OLED model so very possible) and for it to be slimmer. The Deck is a chonky boy that sometimes it feels weird to use",
                "author": "GlaloLaled"
            },
            {
                "raw_content": "2028 huh. Isn't the PS6 handheld rumored to be released in the 2028 as well? Should be an interesting match-up then.",
                "author": "threeinacorner"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Moore’s Law Is Dead has said in his recent video that multiple documents call out that PS6 handheld will be dockable",
        "score": 58,
        "text_content": "https://youtu.be/x-A3Bl2hXoQ?si=XRi2SkRRn7Q0j65x In his recent video about PS6 Handheld specs, Moore’s Law said at minute 19:50 said that the portable console will be dockable and went into detail about what GHz levels to expect in both modes: 16CU RDNA 5 iGPU clocked at: ~ 1.20 GHz in handheld mode ~ 1.65 GHz in Docked mode Edit: Also in the video, Moores Law also mentions something he calls PS6S which will use the CANIS chip and RAM but will be a reduced price console, i.e. an Xbox Series S. I didn't mention it because it seems he didn't go into great detail.",
        "comments": [
            {
                "raw_content": "Insane that everything is becoming a switch",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Moore's Law Is Dead knows more about PS6 than Sony's marketing team.",
                "author": "Straight-Ad6926"
            },
            {
                "raw_content": "Definitely a day 1 buy for me if it's fully backwards compatible with all PS4 and most PS5 games.",
                "author": "anirakdream"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gummy Bears, PlayStation's live service game from teamLFG (previously under Bungie), appears to be entering the pre-alpha testing, setting up community Discord server",
        "score": 267,
        "text_content": "[Source](https://thegamepost.com/report-playstation-gummy-bears-moba-live-service-pre-alpha-teamlfg/)",
        "comments": [
            {
                "raw_content": "\"and even “frog-type” games\" What?",
                "author": "ArcanaOfApocrypha"
            },
            {
                "raw_content": "So curious as to what this is. If I’m not doing RKO’s as a gummy bear, this project is a failure.",
                "author": "Ornery-Tonight1694"
            },
            {
                "raw_content": "\"Oh, I'm a gummy bear Yes I'm a gummy bear Oh, I'm a yummy, tummy, funny, lucky gummy bear\"",
                "author": "Evol-Chan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: Capcom Tries to Remake Dino Crisis But Eventually Shut Down",
        "score": 10,
        "text_content": "[source](https://xcancel.com/AestheticGamer1/status/1960763101613318388#m)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So they tried or is still trying?",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "I always thought they were going to create a remake and release it along with the Rex Engine.",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD and Intel mobile CPU roadmap leak: Core Ultra 300 and Medusa Ryzen in Q2 2026, Core Ultra 400 in Q2 2027",
        "score": 105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can someone explain how this might effect me, as a long term holder, as if I am a golden retriever?",
                "author": "Big_Cut6824"
            },
            {
                "raw_content": "The MTL/ARL/LNL Dates are all wrong for CPU launch it's an OEM roadmap not Intel.",
                "author": "6950"
            },
            {
                "raw_content": "Panther Lake is slipping to Q2 2026 now? It was originally supposed to launch in Q4 2025",
                "author": "jrherita"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD RDNA5 rumors point to AT0 flagship GPU with 512-bit memory bus, 96 Compute Units - VideoCardz.com",
        "score": 340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Finally, it is worth remembering that there is no reason to speculate on SKU names or final specifications. AMD will either stick to the current naming schema aka Radeon RX 10700 or 10070, or what seems more likely (for AMD), introduce yet another change to its naming. They deserved that burn :D",
                "author": "HotConfusion1003"
            },
            {
                "raw_content": "For the small price of… ![gif](giphy|r262MgmxJ1QgE)",
                "author": "cederian"
            },
            {
                "raw_content": "I wonder if these RDNA 5 slides use a different definition of CU. RDNA organizes shaders into WGPs with 2 CUs per. And 2x96 would be 192 which would easily be cut down to all the MLiD CU counts. Of course this is all speculation on leaks for now.",
                "author": "Gachnarsw"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD's Next-Gen UDNA: Four Die Sizes, One Potential 96-CU Flagship",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The CU count to bus width rateo seems weird, the 40CU design is somehow getting 2.25 the bandwidth of the 9060XT while having 25% more CUs, the 96CU one is getting 3x the 9070XT's bandwidth for 50% more CUs. And this is considering 30GBPS DDR7, by 2027 36GBPS dies should be common. Also pretty weird how most of the leak seems in line with what MLID said (other than having exactly half the CUs) but that \"AT2\" die is completely different on the compute side. Still, the wider bus on the supposed \"AT3\" confirms that AMD is really considering LPDDR foor the bottom dies. Also, does somebody remember if these diagrams usually show the media engine and the PCIe controller? If that was the case there would be another confirmation. Happy to see that 8GB GPUs are finally going to become a thing of the past (at least on AMD's side), just 12 years after the launch of the r9 390.",
                "author": "Cave_TP"
            },
            {
                "raw_content": "So 3 gaming//workstation/ai hybrids and one high-end workstation/AI card 🤣 jk, I hope they jump back into the deep end.",
                "author": "got-trunks"
            },
            {
                "raw_content": "Haven't we been hearing about \"potential flagship\" dies with huge core counts since the run-up to RDNA2? I'm sure AMD are examining the possibility, but every time they run into the same dynamic: they'll be very expensive to make, they'll have huge power consumption, and no one is paying flagship prices for something that's not an Nvidia GPU until AMD somehow do the impossible and catch up in hardware features (not to mention doing the merely possible and catching up in software, RoCM I am looking at you, FSR, you're included in this)",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD and Intel mobile CPU roadmap leak: Core Ultra 300 and Medusa Ryzen in Q2 2026, Core Ultra 400 in Q2 2027",
        "score": 47,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CPU releases seem to be less interesting nowadays… more ram, more bandwidth please!",
                "author": "--dany--"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Tuxedo Infinity Book Pro 14 Gen10 Review - Linux ultrabook with AMD Zen 5 & 128 GB RAM",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">We performed the benchmarks with Windows and the energy profile Overboost. (65 Watts) Why, your quick tests showed it wasn't really worth the tradeoffs? >The power consumption of the InfinityBook Pro 14 is a bit higher than before, which is a result of the brighter screen. Huh? You sure it's not because you're testing it in the max power mode instead??? >The battery runtimes are slightly shorter compared to last year's model of the XMG Evo 14. No shit, you tested that model on Enthusiast instead (35w on battery)...",
                "author": "AreYouAWiiizard"
            },
            {
                "raw_content": "It would be interesting if some obscure (Chinese) mobo manufacturer would put this SOC's on an ITX/m-AXT, with one full pci-e 5.0 16x connected to the CPU and a B850 chipset giving two 4.0 or 5.0 x4 lanes for M.2 and some sata for the m-AXT form factor.",
                "author": "Gkirmathal"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Asus ExpertCenter PN54 - Business mini PC with AMD Ryzen AI 7 and modern features in the review",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Homebuyers Have Been Retreating. Now Sellers Are Too.",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If a buyer ain't buying, maybe the seller is not offering something the buyer is willing to spend their cash on.",
                "author": "t3sl422"
            },
            {
                "raw_content": "* There are an estimated 1.43 million homebuyers in the U.S. housing market—the lowest level in records dating back to 2013 aside from the start of the pandemic. * That’s making sellers skittish; the number of sellers has dipped by roughly 14,000 since May, falling for the first time in two years. * Still, there are 36% more sellers than buyers—the largest gap in records dating back to 2013. That means buyers hold the cards in most markets, especially Texas and Florida. There are only five remaining seller’s markets. * The good news? Mortgage rates have been falling recently, which could bring some buyers and sellers back to the market. The U.S. housing market has lost about 14,000 home sellers over the past two months, with the total number of sellers falling to 1.95 million in July from a peak of 1.96 million in May. This marks the first decline since July 2023, when the supply of homes for sale bottomed out near a historic low as rising mortgage rates made homeowners reluctant to sell. Still, sellers outnumber buyers by the widest margin in records dating back to 2013; there were an estimated 1.43 million homebuyers in the housing market in July—the lowest level on record aside from the onset of the pandemic, when the housing market ground to a halt. The estimated number of sellers in the market is simply the number of active listings in the MLS. We estimated the number of buyers using proprietary Redfin data on the typical time from a buyer’s first tour to close of purchase, and MLS data on active listings and pending sales. If we know how long the typical buyer shops for (time from first tour to close), and we also know how many homes are on the market (active listings) and selling (pending sales), then we can infer the number of buyers in the market. These estimates, along with median-sale price data in this report, are seasonally adjusted and subject to revision. See a more detailed methodology here, and scroll down in this report or visit the Redfin Data Center for data on the 50 most populous U.S. metropolitan areas. Up until recently, the number of sellers in the market was growing. That’s partly because the mortgage-rate lock-in effect was easing and partly because homes have been taking a long time to sell, causing stale listings to pile up. Redfin reported in May that the number of sellers in the market had hit a five-year high, and predicted that sellers would start to change their tune once they realized it was a buyer’s market. That is now happening. “Homebuyers are spooked by high home prices, high mortgage rates and economic uncertainty, and now sellers are spooked because buyers are spooked,” said Redfin Senior Economist Asad Khan. “Some sellers are delisting their homes or choosing not to list at all after seeing other houses sit on the market for weeks or months, only to fetch less than the asking price.” Because sellers are pulling back, inventory is starting to tick down, which is likely why home prices are now heating up slightly. The median home sale price rose 1.4% year over year in July to $434,189—the highest July level on record. By comparison, prices rose 1.2% year over year in June and 1.1% year over year in May. This is notable because at the beginning of the year, home-price growth was shrinking. It’s the Most Buyer-Friendly Market in Years…If You Can Afford to Buy There are 36.3% more sellers in the market than buyers (or 518,801 more, to be exact)—the largest gap in records dating back to 2013. In other words, it’s a buyer’s market—at least nationally—and has been for the past 15 months. We define a market where there are over 10% more sellers than buyers as a buyer’s market and a market where there are over 10% fewer sellers than buyers as a seller’s market. A market where the gap is plus or minus 10% is considered a balanced market. “We’re likely in the most buyer-friendly housing market since the 2008 financial crisis,” Khan said. “Back then, inventory piled up as foreclosures surged, and demand was weak, meaning buyers had negotiating power. We’re not headed for another 2008, though; many of today’s homeowners have built substantial equity thanks to the recent surge in home values, and today’s borrowers must meet stricter lending standards. Plus, there are more options for avoiding foreclosure if a homeowner is at risk of defaulting, such as loan modification.” Of course, it’s only a buyer’s market for those who can afford to buy. Many Americans have been priced out of the housing market altogether in recent years—mortgage rates are more than double their pandemic low, and home prices at a record high for this time of year. The good news is that mortgage rates have dropped in recent weeks, which could bring some buyers off of the sidelines. Miami and Fort Lauderdale Are the Strongest Buyer’s Markets, With Over Twice as Many Sellers as Buyers In Miami, there are an estimated 21,637 home sellers and 8,293 homebuyers. That means there are 160.9% more sellers than buyers—the largest imbalance among the 50 most populous U.S. metropolitan areas. It’s followed by Fort Lauderdale, FL (151.2% more sellers than buyers), Austin, TX (123.8%), West Palm Beach, FL (123.4%) and San Antonio (113.1%). Overall, 35 of the 50 most populous metros are buyer’s markets, 10 are balanced markets and five are seller’s markets. The buyer’s markets are concentrated in the Sun Belt and on the West Coast, while balanced markets and seller’s markets skew more toward the Midwest and East Coast. “It’s a true buyer’s market in San Antonio. Buyers are patient, selective, value conscious, and aware of their increased negotiating power. When they make offers, they ask for the moon,” said local Redfin Premier real estate agent Jesse Landin. “Sellers are struggling to adapt—their expectations are anchored to 2021, when homes were flying off the market for thousands of dollars over the asking price. A growing number are exploring alternatives. Some are entertaining low-ball offers from investors or even foreclosure. Others are considering pulling their home off the market and becoming a landlord if they don’t achieve their desired asking price. The problem is that the rental market is also slow.” Landin has one client who bought his home in 2020 and has been renting it out since, but recently chose to put it up for sale because he has been struggling to find tenants. Now he’s considering delisting the property and trying to rent it out again because it’s been sitting for four months without a buyer. The Sun Belt skyrocketed in popularity during the pandemic, when scores of homebuyers moved in from more expensive parts of the country, driving up housing costs and pricing many locals out of the market. To meet surging demand, homebuilders ramped up activity, which is one reason there are now a lot more homes for sale than people who want to buy them. Landin noted that many newly-built homes in San Antonio don’t show up in the MLS, meaning inventory numbers may be understated. “Regular sellers are competing with homebuilders for buyers,” Landin said. “If your house was built three years ago and has the same floorplan as a newbuild down the road, you have to list it for less than the newbuild, especially because builders are offering all sorts of powerful incentives to woo buyers. This is putting major pressure on individual sellers—particularly those who bought at the peak of the pandemic market and need to recoup their investment.” Texas and Florida continue to build more homes than other states. Florida is also grappling with intensifying natural disasters, soaring insurance premiums and rising condo HOA fees, which has prompted some homeowners to leave. With the balance of power firmly tilted toward buyers, parts of Florida and Texas are seeing home prices fall. The median sale price in West Palm Beach dropped 3.5% year over year in July—the biggest decline in the country aside from Oakland, CA (also a buyer’s market). Austin came in third place, with a 3.3% decline. On average, home prices were roughly flat (+0.5%) from a year earlier across the 35 buyer’s markets, compared with a 5.1% gain across the five seller’s markets. Landin said the key to selling a home in today’s market is being patient, pricing for less than what comparable houses sold for three months ago and having a contingency plan if your worst case scenario becomes a reality. Newark and Nassau County Are the Strongest Seller’s Markets, With About Half as Many Sellers as Buyers Newark, NJ is the strongest seller’s market, with an estimated 5,591 sellers and 11,654 buyers—or 52% fewer sellers than buyers. The other four seller’s markets are Nassau County, NY (40.5% fewer sellers than buyers), Montgomery County, PA (36.1% fewer), New Brunswick, NJ (22.2% fewer) and Minneapolis (12.5% fewer). New construction can have a significant influence on whether negotiating power lies with buyers or sellers because it impacts the balance of supply and demand. The South issues the most building permits, followed by the West, the Midwest and the Northeast. As mentioned earlier, many of the nation’s buyer’s markets are in the South, while the seller’s markets are all in the Northeast or Midwest. San Antonio and Virginia Beach Have Shifted Most Toward Buyer’s Markets in Recent Months San Antonio has 113.1% more sellers than buyers, up from 89.4% in April, when we last conducted this analysis. That 23.7-percentage-point gain is the largest among the 50 most populous metros. Next come Virginia Beach, VA (+19.2 ppts to 21.5%), Pittsburgh (+18.5 ppts to 32%), Denver (+16.1 ppts to 61.2%) and Charlotte, NC (+14.7 ppts to 80%).",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Bought my first house in 2010 after looking for two years. Houses were still listed at insane bubble prices of $300k. Often they were total dumps as well in terrible areas. Many had been listed for 300+ days, some for 600+. We bought a divorce house for $160k, they paid the closing costs, and fixed 100% of the inspection report including brand new AC unit. Things will be the same. All the people saying they just won't sell, well they won't. People who have to sell, will. BTW here is a link to the population pyramid: https://images.populationpyramid.net/capture/?selector=%23pyramid-share-container&url=https%3A%2F%2Fwww.populationpyramid.net%2Funited-states-of-america%2F2025%2F%3Fshare%3Dtrue See how it's actually shaped like a diamond now? Guess what happens to home prices over the next twenty years?",
                "author": "One-Ability-6403"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home values are falling in half of the top 50 metros, report finds",
        "score": 149,
        "text_content": "",
        "comments": [
            {
                "raw_content": "don't worry, i'm sure a -.25% rate cut will turn everything around",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "wheres the report",
                "author": "fwiga"
            },
            {
                "raw_content": "just not yours",
                "author": "Pumpkin-Main"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano Banana's understanding of material swapping. The tube started off as a chrome material.",
        "score": 1988,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Another https://preview.redd.it/0aq0k751kjlf1.png?width=1200&format=png&auto=webp&s=3ab53252f3682c85bed338566e841a2fdcd57e5b",
                "author": "N35TY"
            },
            {
                "raw_content": "https://preview.redd.it/w9eanqv6gjlf1.jpeg?width=4284&format=pjpg&auto=webp&s=2547caec254282c0798570bc277a7d9d53f97e0e Funny to see BMO show up. Made this costume this week. 🙂",
                "author": "SirDidymus"
            },
            {
                "raw_content": "anyone tested generating texture maps based on an image? like normals, Bump Map, displacement etc.",
                "author": "Shubb"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "okay, next frame. Nano Banana (Google)",
        "score": 80,
        "text_content": "Trying to animate, frame by frame, just with the prompt “okay, next frame.” The first prompt was a simple shonen anime character drawn with an 8B pencil, white background. Then prompt: “Okay, next frame.” Not on the Gemini website, it doesn't work for me. Only in Google Studio. I didn't give the model clear direction, you're going to be generating images for a while and choosing the best one that fits the motion. I didn't ask for intermediate frames, which would have made the animation smoother, but you reach the limit of generating images and have to wait, so I chose not to make it more elaborate.",
        "comments": [
            {
                "raw_content": "Looks like Delu. Did you include My Hero Academia in your prompt?",
                "author": "TheMrCurious"
            },
            {
                "raw_content": "i cannot wait to make my own cartoons!",
                "author": "GrapheneBreakthrough"
            },
            {
                "raw_content": "bye bye animators",
                "author": "FRESH_MEME_DETECTOR"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google’s AI model just nailed the forecast for the strongest Atlantic storm this year",
        "score": 588,
        "text_content": "Pretty cool.",
        "comments": [
            {
                "raw_content": "Fun fact. Every weather forecasting service in the world uses the same data. This is ensured through a UN data sharing program. The only difference in the accuracy of weather predictions come from the models used. Google is going to make every other weather service outdated.",
                "author": "Temporal_Integrity"
            },
            {
                "raw_content": "google cookin as usual",
                "author": "YaBoiGPT"
            },
            {
                "raw_content": "Forecast slop, all they are doing is stealing real forecasters work /s",
                "author": "theirongiant74"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "xAI Grok Code Fast 1 is new in OpenRouter!!",
        "score": 52,
        "text_content": "\"Grok Code Fast 1 is a speedy and economical reasoning model that excels at agentic coding. With reasoning traces visible in the response, developers can steer Grok Code for high-quality work flows.\" Thoughts? Anybody have tried it out yet? Is it good?",
        "comments": [
            {
                "raw_content": "39.6% in aider at the highest reasoning effort. That's gpt-5-nano @ medium reasoning level (40%). Price in real use seems similar though.",
                "author": "Pristine-Woodpecker"
            },
            {
                "raw_content": "It's very very fast. And very dumb. It loves to wreck my code. I do not trust it at all anymore. Even simple tasks, it can fuck up. Give this model low risk tasks like \"move this over there\" or \"change the color of this component\". Or one very good usecase: \"scan my codebase and tell me this....\". It reads files very quick so that's probably the best and only good usecase for this model.",
                "author": "Tedinasuit"
            },
            {
                "raw_content": "it's ok",
                "author": "ThunderBeanage"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How would you feel when an interviewer says, \"If AI can do this in 5 minutes, why would we hire you?\"",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"If you think AI can do this in 5 minutes, why the fuck are you wasting my time?\"",
                "author": "roundabout-design"
            },
            {
                "raw_content": "Then why did you do a job posting in the first place ?",
                "author": "Euphoric_Tutor_5054"
            },
            {
                "raw_content": "AI can do the task in 5 minutes but who decides which 5-minute task needs to be done? Who double checks that 5 minute job? Can AI string 100 five-minute tasks together coherently?",
                "author": "vexaph0d"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There is NO point in talking about reaching AGI if you CAN'T answer this question",
        "score": 27,
        "text_content": "**What remaining fields of cognitive tasks do our current AI systems still fall behind in compared to the average human intelligence (which is the AGI requisite)?** If you have not considered an answer to this question, you shouldn't be talking about reaching AGI in the first place. I see many people discuss that we will never AGI in x amount of years because x y z, but I have never seen them being able to answer this question specifically. This is because they have a fundamental misunderstanding of what AGI is, or what current AI capabilities are. AGI is literally average human cognitive abilities (unless you refer to AGI as embodied AGI, but most people just refer to cognitive function). It is not superhuman abilities, it is not the ability to never be wrong, it is not the ability to do IMO or frontier math problems. People often misattribute many benchmark scores to relativity to AGI, like \"We will never reach AGI because there's barely an improvement on these benchmark\", without realizing that those benchmarks have already been saturated to above average human capabilities. There are some cognitive benchmarks left that are indicative to the path of AGI, but they are almost never mentioned. The truth is, AI has long reached average human level in most intelligent tasks, especially the ones defined using language semantics. These include tasks that tests crystalized intelligence, fluid intelligence, semantical reasoning, emotional intelligence, logical intelligence, and etc. And some other fields like memory and hallucination can be trivially addressed with memory MCPs and RAG systems. But there is one remaining testable field that I have identified where it still falls behind the average human, which is visual/spatial reasoning. But FWIW, cognitive AGI is mostly there. I say visual/spatial reasoning because while LLMs have made large progress, VLMs are not quite there yet. You can see this reflected in the [VPCT ](https://cbrower.dev/vpct)and [Arc Agi](https://github.com/zoecarver/saturn-arc). (Sidenote, I linked arc agi with an unofficial github repo because the author here actually tests the model's VLM capabilities, which is much more in line with how humans are tested. AI has definitely surpassed the average human for Arc Agi if humans had to solve it using raw json and pure semantical reasoning like LLMs do. If they did that, the average human Arc score would probably be <1%). However, there is significant progress in this field, as you can see with google's [conversation image segmentation](https://developers.googleblog.com/en/conversational-image-segmentation-gemini-2-5/) and their nano banana image model (which definitely has improved language-image context understanding), GPT-5 improvements on VPCT and Arc Agi using VLM, and potentially promising research like HRM (which although may be a fad, demonstrates that visual/spatial capabilities has a lot of room for research development to grow in). There are also other sensory based cognitive tasks like touch/smell/taste, but honestly no one gives a shit about those fields. Those systems will be trivially human level, if it's not already, when AI visual reasoning gets human level. As a final thought/caveat, I do think that AGI is overhyped, but not AI. Baseline AGI is literally just average human joe, and the average human's mind isn't very useful besides for basic mind numbing tasks. Even if you cloned millions of average minds in parallel, it won't necessary produce any meaningful results beyond automation of basic tasks. For you to have truly groundbreaking/disruptive AI, it would have to be far above average human intelligence. However, I don't see that trajectory slowing down at all with GPT-5's release, if you see its agentic performance gains on METR and LiveBench.",
        "comments": [
            {
                "raw_content": "You’re on the right track, but anyone can literally just ask their favorite LLM what is needed to reach AGI: >In short: to get from current AI to AGI, we likely need persistent memory, grounded world models, continual learning, stronger reasoning, social intelligence, safe value alignment, and more efficient architectures. The first three are the ones furthest from human-level. Without them, no knowledgeable person is going to call it AGI.",
                "author": "Quentin__Tarantulino"
            },
            {
                "raw_content": "One thing people do not realize is that benchmarks are narrow. They are not broad. Current LLMs do very well on these narrow benchmarks. But when you go outside of their established training data or very underrepresented data, their performance drop like a cliff. Is that important? To some’s definition of AGI it is, to some’s it isn’t. For example, current LLMs can crush coding in mainstream coding and scripting languages. But when you move outside of that to something like Jomini, they fail spectacularly doing non-sensical things. I would expect an AGI to be able to consume a new computer language and understand it. Because an average human absolutely can. But for some definitions like; AGI is when AI does most economically viable works then that isn’t required. Edit: Apologies for any mistakes, it is 7 am and I haven’t slept yet.",
                "author": "mertats"
            },
            {
                "raw_content": "Oh that question is easy to answer: We didn't reach AGI as long as someone can come up with a mental task that an average human can do. My personal favorite right now: Picking a random game on steam and play it like an average guy would do. Same learning curve and so on. That's not possible at all right now. There is some progress with Pokemon. But that's just one game and they already start to tweak the models for the Pokemon benchmark. I am talking however about some random game. Another thing is debugging. It sucks at debugging. Especially on more uncommon frameworks. There are also a TON of visual learning task in which the models are completely outperformed by five year olds. And it has to be one system not some specialized system. Doesnt matter how many systems are under the hood but the knowledge and skill transfer is crucial. If a system can write a poem but is outperformed by bees in terms of calculating and navigating space (virtual or not) it's not AGI. Oh and you vastly underestimate the average Joe mind. But that's a common mistake.",
                "author": "Quarksperre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Good old-fashioned engineering can close the 100,000-year “data gap” in robotics\"",
        "score": 17,
        "text_content": "[https://www.science.org/doi/10.1126/scirobotics.aea7390](https://www.science.org/doi/10.1126/scirobotics.aea7390) \"Using commonly accepted metrics for converting word and image tokens into time, the amount of internet-scale data (texts and images) used to train contemporary VLMs is on the order of 100,000 years—it would take a human that long to read or view these data ([*2*](https://www.science.org/doi/10.1126/scirobotics.aea7390#core-collateral-R2)). However, the data needed to train robots are a combination of video inputs with robot motion commands: Those data do not exist on the internet.\"",
        "comments": [
            {
                "raw_content": "sure, but unlike novels or movies, creating a monstrous amount of data on factory work is super easy. Strap cameras on your workers, but cameras around the factory itself, etc etc.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "I disagree, in my estimations a human uses 0.5B words/lifetime, so GPT-4 training set was about 40,000 humans worth of language. It comes up to about 2 million years of human language use. And the total number of words used by humanity (100B humans) is about 3 million times the size of LLM training sets. It shows discovery is a million times harder than catching up. It's also why AI, after catching up to us, will make further progress at a much slower speed, not exponential.",
                "author": "visarga"
            },
            {
                "raw_content": "I've done consultation work in the manufacturing field specifically utilizing massive amounts of raw data that facilities are sitting on. There are usually cameras everywhere and several senors at every step of a process. Companies have known for a long time that data is a value asset and will sit on this data for years in case it's ever useful. Every single major company will have internal teams trying to leverage this data to optimize some part of their processes somewhere. People make entire careers creating process optimizations doing this type of data analytics. The simple main difference here from internet based data is that each company will be reluctant to just straight up share what they have with competition.",
                "author": "showMeYourYolos"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Boston Dynamics - Air Spot Backflips",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow our future police force is sooooo cooooool",
                "author": "deafmutewhat"
            },
            {
                "raw_content": "Looks super cool. But all due respect. I've been hearing about Boston Dynamics for a number of years now. What's the end goal, exactly? And what are they working to do? Humanoid robots for warehouses? Robotic pets? Just a fun cool toy?",
                "author": "himynameis_"
            },
            {
                "raw_content": "Is that the correct usage for triple backflip? I kept waiting to see the triple backflip (three backflips in the air, just like for humans a double backflip is two backflips in the air) until I realized it was three back to back backflips (still cool).",
                "author": "enilea"
            }
        ],
        "subreddit": "singularity"
    }
]