[
    {
        "post_name": "Because it involves treason & sedition. You are fucked.",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one's been \"fucked\" in two terms.",
                "author": "shogun5000"
            },
            {
                "raw_content": "https://x.com/i/status/2017046202500698287",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "I love how whoever took the picture framed it to try and make her look sinister hiding in the back trying to avoid being seen.",
                "author": "Rakkasan91b"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN - Trump is preparing to nominate Kevin Warsh, son-in-law of Ronald Lauder and former steering committee member of the Bilderberg Group, to be the next Federal Reserve chair — Bloomberg",
        "score": 205,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End the Fed",
                "author": "Oback_Barama"
            },
            {
                "raw_content": "Was someone expecting him to nominate Ron Paul? Big banks gonna big bank.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Motherfuggin Bilderberg What a joke",
                "author": "zippy2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Booker : Remember when Georgia Governor Brian Kemp's daughters boyfriend died in that tragic car crash after the 2020 election? And then the the GBI special agent investigating it died at his home?",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes I remember the car being bombed, but it was no accident.",
                "author": "duckduck"
            },
            {
                "raw_content": "Yes, Kemp caved immediately. Remember the highly-suspect RV bomber at the Nashville AT&T network facility?",
                "author": "CovfefeVideo"
            },
            {
                "raw_content": "Frankly, I remain surprised that those 700 boxes of ballots are still around to be hauled off.",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The people who stole the election tried to make the good guys who exposed their crimes look like criminals.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Tried\"?",
                "author": "cwoalf3"
            },
            {
                "raw_content": "Don't forget they arrested based Pillow Merchant at a McDonalds drive thru and snatched his phone and never gave it back.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "Some of em are still in prison. Tina peters",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Virginia residents are now panicking as, not even a full month into 2026, their electricity bills are nearly tripling as they are being hit with new Democrat-approved energy rates, with one resident saying she is now paying $621 per month, more than her car payment.",
        "score": 1133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They'll move from Virginia into a less shitty place and then destroy that place by votng Democrat",
                "author": "Antero"
            },
            {
                "raw_content": "Video in a car. Those stupid fucking glasses. Got what she voted for.",
                "author": "PapaPepe"
            },
            {
                "raw_content": "If men do not stand up to the girl bosses, we deserve what they do to us No violence. Just speak up. Refuse to comply . Don't go hide in your cave.",
                "author": "Liberty49220"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Canada has wrongfully, illegally, & steadfastly refused to certify the Gulfstream 500, 600, 700, & 800 Jets, we are hereby decertifying their Bombardier Global Expresses, and all Aircraft made in Canada. If not corrected I am going to charge Canada a 50% Tariff on any/all Aircraft sold into the USA.",
        "score": 1488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LMFAO eat shit snow Mexicans. Doesn't matter though, they got new Chinese masters so they'll just let them fuck their wives while they watch instead.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "Canada is the Bill Mitchell of countries",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "The US should do equal fines to EU countries that levy fines against US companies. We are not the piggy bank of European socialism.",
                "author": "williammcfadden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Muslims do not go out and protest. they get White liberal morons to do it",
        "score": 890,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are too busy having 20 children, which the white taxpayers pay for, and the white elderly cat women protest for.",
                "author": "magnokor"
            },
            {
                "raw_content": "This pisses me off the most- \"suicidal empathy\". Whoever coined that term needs an award.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "Too much of her face.",
                "author": "Rock9Head"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lol",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's so anti-semitic.",
                "author": "atbunch"
            },
            {
                "raw_content": "Why do they all look like demonic pedos?",
                "author": "Oliphaunt"
            },
            {
                "raw_content": "https://patriots.win/p/1ARws3RsW5/saint-tail-light/c/",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SCOTT BESSENT: “Gavin Newsom had to go to Davos to see all the CEO’s he chased out of California.” 🤣🤣🤣",
        "score": 568,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump hires the best gays. The left pretends to not see them.",
                "author": "CaptainForehead"
            },
            {
                "raw_content": "hahaha, this guys been pretty good.",
                "author": "Pepbrandt"
            },
            {
                "raw_content": "He's turning out to be a quality shitposter.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "when a liberal man throws a punch and you catch it mid swing",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Hank Hill: Look at your little birdy arms, they're no thicker than a cigarette. I could smoke them little arms!](https://m.youtube.com/watch?v=RN7p403hNJ4)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "David Hogg",
                "author": "BurtMcGirt"
            },
            {
                "raw_content": "Gotcha pede https://patriots.win/p/1ARws2KaG6/anitfa-terrorist-gets-smackdown-/c",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump CONFIRMS DNI Tulsi Gabbard's involvement in the 2020 election fraud investigation in Fulton County, Georgia. \"She's working very hard on trying to keep the election safe. And they got into the votes and you’re going to see some interesting things happening!\"",
        "score": 542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Georgia raid is the most exciting news we've had for justice and election integrity in a long time. The odds are still steep - we don't know what evidence was destroyed, or what the judicial system will try to do. But winning a major battle in a war is still something to appreciate.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "I'm really loving Tulsi... Don't see her a lot but I think it's because she's got her nose down to the grindstone on this shit",
                "author": "Tophat9000"
            },
            {
                "raw_content": "I watched the press conference yesterday. Those monkeys were screaming mad that the DOJ moved in on them. It makes me hopeful there might really be something to this.",
                "author": "RiffFantastic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Indiana just passed SB 182 - Establishes 2 sexes, male & female",
        "score": 925,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems logical but they didn't redistrict Rinos.",
                "author": "Gopher47"
            },
            {
                "raw_content": "Nature established 2 sexes. It is good that Indiana is codifying it, but it is also completely insane that they feel the need to.",
                "author": "UntakenUsername"
            },
            {
                "raw_content": "While I approve of this bill, I can't help but notice that that same state failed to do anything that actually might help save the country - like favorable congressional districts. This is theater.",
                "author": "Dizzy77"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Fed Chair Announcement Coming Tomorrow…",
        "score": 708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just in time for silver to go to $400/ozt.",
                "author": "DogPilledMAGA"
            },
            {
                "raw_content": "It’s probably too much to hope that it’s not a fucking heeb or vag bleeder, I would guess.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "Hear me out.. Trump appoints himself. Can't be fired. Let's do this.",
                "author": "JackOfAllTirades"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DERANGED: Prank by German Comedian Hoisting US Flag on Greenland’s Capital Sends Local Mayor Into a Meltdown",
        "score": 1095,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Schafroth was reported to the police and fined.\"- of course he was",
                "author": "Illah88zillah"
            },
            {
                "raw_content": "**FUNNYBOT SAYS...** # AWKWARD!!! *as the NATO-issued machine guns roar*",
                "author": "WashingtonRepublic"
            },
            {
                "raw_content": "Craziest thing is a German having a sense of humor",
                "author": "Fox19"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WORTHLESS FAGGOT: Hunter Biden Hits Back at Baby Mama Lunden Roberts in Court Filing, Says It Doesn’t Matter That He “Ghosted” His Daughter",
        "score": 1060,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be honest, this little Angel is better off away from the pedophile grandpa and Crack smoking dad. Poor life choices by them mom should not be reflected on the little girl.",
                "author": "FuckU/Spez"
            },
            {
                "raw_content": "It won't matter when Jesus Ghosts you. Burn in Hell Hunter Biden",
                "author": "Illah88zillah"
            },
            {
                "raw_content": "what kind of whore skank opens their legs for Hunter fucking Biden, or any Biden for that matter?",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Seattle Mayor Katie Wilson announces new guidelines for hindering ICE activities and protecting illegals: Directs police to follow ICE around, film them and share the info with community orgs. Prohibits ICE from using city property. $4 Million taxpayer dollars to illegals’ legal fees and support.",
        "score": 747,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Literally none of that is legal",
                "author": "DingleBalls"
            },
            {
                "raw_content": "These people are demons",
                "author": "Deltamyass"
            },
            {
                "raw_content": "It shut down the freeway that's Federal. Shut down all federal funding Seattle needs to be rinsed clean anyways that city is a cesspool of liberals and ding ding dings.",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She has a message for all us \"Mother-fucking MAGA ass-twats\"...",
        "score": 972,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">YOU DON'T WANT MY BROWN BABIES HERE EITHER, DO YOU? Mudshark alert!",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "She's married to a brown with brown children. By her tone and anger, he sounds illegal...and she's blaming us, ha.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Crying and shrieking hysterically doesn't make me sympathize with your position. It just makes me think you're an unhinged lunatic.",
                "author": "OpusX"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No one comes close...",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "God bless this man. He genuinely just wants to make this country better. Imagine where we'd be if we didnt have people constantly fighting him and his message every single step of the way. We should *all* want to see our country succeed, but faggots would rather be poison-pill contrarians that whine and bitch at every turn.",
                "author": "Girthquakes"
            },
            {
                "raw_content": "# 🇺🇸USA🇺🇸 first nobody else, no exceptions",
                "author": "Justlooking250"
            },
            {
                "raw_content": "That was awesome. Thanks for posting Pede.",
                "author": "Macynda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LET HIM COOK! 🔥",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest a few people besides a pair of church storming Shanequas in Minneapolis and maybe I'll doom less.",
                "author": "grandfather_nurgle"
            },
            {
                "raw_content": "You know what I'll remember from his time as president? Only that there were zero arrests. That's what I'll be thinking about in the gulag",
                "author": "RudeFrog"
            },
            {
                "raw_content": "I'll question everything and that's my right. Don't fucking tell me what to think. He's my president but he's not perfect. Nobody should be a blind sheep following ANYONE.",
                "author": "ciaramella_is_gay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Senate reaches deal ahead of shutdown deadline to fund government, continue ICE talks, source says",
        "score": 809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I agree we need \"immigration enforcement reform\". The current rate of deportations is totally unacceptable.",
                "author": "Zskills"
            },
            {
                "raw_content": "When did we become afraid of shutdowns. I want it shut down. Start with the IRS.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "ICE and Wall construction operations are fully funded through 2029 thanks to the OBBBA. Without OBBBA there would have been peanuts for deportations and Wall construction. DHS is already funded for the next 3-4 years. Only retards will bitch and bitch about this. There is a CR for 2 weeks while DHS negotiations continue. I will never understand why people bitch about the OBBBA when the ICE/Border Patrol/Wall funding through 2029 already makes it one of the best laws passed in this century. There were 6 bills up for a yes/no vote. They took out DHS and the other 5 will easily pass. DHS gets another 2 weeks via CR. If Schumer wants to defund ICE and the Wall in 2 weeks he can go fuck himself because OBBBA already funds ICE and the Wall for many more years.",
                "author": "possibletower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[News] Samsung, SK hynix and Micron Reportedly Rein In Orders to Curb Hoarding as Supply Tightness Persists",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The AI companies is the one hoarding, OpenAI is one of them. Start from there first.",
                "author": "hackenclaw"
            },
            {
                "raw_content": "Is it really hoarding, or is it more of locking in supply before things get even worse?",
                "author": "goldcakes"
            },
            {
                "raw_content": "If only they were so scrupulous in the first instance - perhaps all the their other customers wouldn't be acting this way.",
                "author": "Life_Menu_4094"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia GeForce RTX 2070 - RTX 5070 Evolution: The Transformation of 1440p Gaming",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think the biggest takeaway here is actually the bit about latency. I disagree with them that \"50ms is fine\" but holy crap the base latency on games without Reflex is actually awful. No wonder I had such a hard time with Cyberpunk feeling wobbly and slow even on a good framerate: 80ms base latency???? Reflex is THE selling point for me because of how widely supported it is. Like you can use Optiscaler to inject XeLL and AL2 into certain singleplayer games and all but AMD really isn't trying to get it into everything like Nvidia is. Also for the record as someone who jumped from a 3070 to 5070 for 4k on a 240hz monitor: 3x mfg is totally fine and yeah it has some artifacting if I look for it, it's not actually on the important parts of the image. Personally I found FSR 3 FG fine too. What I DON'T like is that there is indeed a ~10ms latency jump from Reflex on and no FG. I can manage it in a game like Expedition 33 by simply anticipating the button press earlier but it's a harder sell in anything like a shooter. What I usually do to get around it is unironically just increase my base framerate and switch to DLSS Ultra Performance with the L model which looks way better than DLSS Performance at 1440p btw. Like, I can only tell if I'm looking at particles or lines in the distance, it's great.",
                "author": "letsgoiowa"
            },
            {
                "raw_content": "In before the *\"but it should have been the 5060\"* comments. Yes. It would have been great if it was. But then the RX 9060 XT would have been called the RX 9050 in that world and cost $230. EDIT: Fixed typo",
                "author": "Hour_Firefighter_707"
            },
            {
                "raw_content": "RTX 5070 if not for the stupid 4090 level performance marketing probably would have been better received by the reviewers back when it launched, but not like it mattered for the consumers in real world anyway, despite all the negative reviews and Reddit laughing off and shaming people who bought this particular GPU, yet it still sold like hotcake and became the most popular RTX 50 series GPU on Steam Market Survey and is the currently considered as the most rising star new gpu that likely will cement itself under top 5 most used GPUs there. Far far from the massive flop that most of us here on Reddit and on YouTube tech community has predicted this thing going to be... So, yeah another example of why the internet / reddit community isn't the absolute representative of product's success.",
                "author": "ShadowRomeo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Taiwan unveils domestically developed 20-quantum-bit superconducting quantum computer",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I would have been interested to know a little more about how the quantum computer maintains superposition and eliminates external interference.",
                "author": "boomstickah"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How Much Longer Is Zen 3 Staying?",
        "score": 33,
        "text_content": "Hello, how much longer does AMD plan to manufacture new Zen 3 processors? And how has this generation managed to stay so relevant five years after launch?",
        "comments": [
            {
                "raw_content": "In laptops I expect to find them until rnd of the decade",
                "author": "manolokbzabolo"
            },
            {
                "raw_content": "Each new generation of chip is getting more and more expensive to produce. As that happens, cheap entry-level chips become less and less viable, requiring more volume to hit break even. As a result, the new entry level is just a previous gen. Intel still pumps out a ton or RPL and MTL-U for cheap devices. AMD had Zen 2 and Zen 3 for that role. That level of performance is going to be viable for a long time. A very tiny portion of the consumer market needs or can even notice the performance difference of anything faster. The RAM shortage also means older DDR4 platforms are still viable. So to answer your question, for plenty more years",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "I just bought a new laptop with a Zen 3+ CPU. 7735HS. 8 cores, fast, efficient, and most of all: cheap. There's nothing I need it to be faster for, it's a good mix of good performance and low price. So I think it's justified to keep it around, I'd rather see Zen 3 products offered than those awful N100 Atom style CPU's Intel keeps offering in several iterations. I just bought a mini PC with an N150, supposed to be a new version of the N100, but it's 1-2% faster. Same awful performance, in another iteration. Shouldn't exist today, it barely runs Windows 11, and is priced not much lower than some Zen 3 CPU's, yet it performs so much worse.",
                "author": "ConsistencyWelder"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CHAT WE WON IT'S WOKE",
        "score": 4639,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo clickbait youtubers getting their thumbnails ready as we speak",
                "author": "Rarewear_fan"
            },
            {
                "raw_content": "https://preview.redd.it/7uwbmokmvagg1.jpeg?width=1420&format=pjpg&auto=webp&s=ce0a8720230786e674614cf289d912d480e3d8c1",
                "author": "ExoticToaster"
            },
            {
                "raw_content": "Nintendo goes WOKE???? (They'll brick your switch if you don't use PRONOUNS)",
                "author": "Jammy2560"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomodachi Life legalized same sex marriage before Japan",
        "score": 3040,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TIL same-sex marriage isn’t legal in Japan. That’s sad.",
                "author": "eat_your_veggiez"
            },
            {
                "raw_content": "My husbands mii no longer has to be a girl!!! I am so excited 😆 I thought same sex relationships would be included but I thought it would be something in the background of the direct. I was so shocked when they actually showed the options and so happy with Nintendo!",
                "author": "Queenspence2"
            },
            {
                "raw_content": "Nintendo *did* say they would provide the same benefits to employees same-sex partnerships as those in opposite-sex ones, so I suppose this is not too suprising.",
                "author": "Gabcard"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dispatch Switch/Switch 2 Refunds Now Available (Keep Fighting the Good Fight)",
        "score": 627,
        "text_content": "My fellow gamers, Keep fighting the good fight! If you bought Dispatch on the Switch/Switch 2 please refund it. You are playing an incomplete version of the game because it is heavily censored. You are not getting the actual true experience of the game. By refunding it, this sends a message to Nintendo and every third party developers/publishers (that develops a game for a Nintendo platform) that we will not support this. This garbage of censorship needs to stop and these companies will suffer the consequences for it. If you have not bought Dispatch on the Switch/Switch 2, DO NOT BUY IT, until they fix this issue. Here is a link to those who live in the Americas and have to ​refund: [https://en-americas-support.nintendo.com/app/contact](https://en-americas-support.nintendo.com/app/contact) Edit: If anyone knows the links to ​other territories outside the Americas please post in the comments below, so that I can post it here. EVERYONE who purchase this should be entitled to a refund​ Edit: UK phone number to contact Nintendo in regards to your refund +443456050247",
        "comments": [
            {
                "raw_content": "The fact the devs purposely withhold the information about game being censored, while constantly advertising the pre order discount is scummy af and they still didn't say anything on social media. They clearly didn't want people to know before blindly buying. There's more to this story.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Tried getting a refund today but I kept getting denied. Will try again tomorrow. 😮‍💨 I even preordered the deluxe edition for the artbook. This is such a huge hassle and disillusioned me from the game. I probably won't even bother to pirate this shit",
                "author": "Louvella-Sama_VTUBER"
            },
            {
                "raw_content": "still waiting for an awnser from the Swiss nintendo support team regarding my refund...",
                "author": "Dat_Boi_1340"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate says upcoming direct is a Partner Direct",
        "score": 597,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My problem with Partner directs is they typically don't even get the bigger 3rd party reveals. They save those for full directs.",
                "author": "StarWolf128"
            },
            {
                "raw_content": "More on The Duskbloods please.",
                "author": "From_Graves"
            },
            {
                "raw_content": "Well that’s deflating. Was really hoping for a first party direct, in part because it’s been over four months since the last one.",
                "author": "c_rorick"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A Partner Direct on Switch 2 could be a very different beast to Switch 1 Partner Directs",
        "score": 55,
        "text_content": "So, in case you hadn't heard, the latest rumour is there could be a Partner Direct next week. Whether that's true or not remains to be seen, but one thing it made me realize is this: I'd be pretty damn excited for a Partner Direct right now! Let's be honest, on Switch 1, Partner Directs were starting to become almost indistinuishable from Indie Worlds - which isn't exactly a complaint (I love a good indie myself), I'm just saying expectations for big AAA games turning up were pretty low. But on Switch 2? That expectation would be a lot higher. First of all, you've got multiple cool games we *know* are coming in 2026 that just need a concrete date: Elden Ring, Fallout 4, Indiana Jones, The Duskbloods, Adventures of Elliot, Professor Layton etc Then you've got the heavily rumoured games like: Hi-Fi Rush, Stellar Blade, Expedition 33, Final Fantasy XVI, Metaphor ReFantazio etc Plus, the potential for just about anything else. XBox keep saying they're so excited to support the Switch 2 so surely one day that has to translate into something concrete with some Halo, Doom, CoD, Starfield, Gears or whatever. Capcom don't talk as much as Phil Spencer but they clearly *are* heavily supporting the Switch 2 so some Monster Hunter or Devil May Cry sound feasible. A lot of the annual franchises look to be getting on board too, so basically, just a whole heap of potential good stuff. And obviously I do not expect all - or even close to all - of the above to be in one presentation, but that's a flavour of the sort of stuff we may well see, and I think a Partner Direct right now could actually be pretty awesome.",
        "comments": [
            {
                "raw_content": "we also have rumors (more like was a data hack) for a >!Arc systems works game that uses their fighting game engine that's only meant to be on Switch two code name \"Watari\", Watari in Japanese means \"crossing\" which could be a Nintendo IP of some kind or maybe it's own thing, but exciting non the less, timeframe from the leak would be perfect here!<",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "the first partner direct was like final fantasy and madden. expect that. big games go in the main directs.",
                "author": "Glass-Bat-2704"
            },
            {
                "raw_content": "Honestly yeah. Like why are people hating right now. Just look at the success of the FF7 remake. People want all the big heavy hitters and ports of the current gen suite of software is amazing as devs need time to pivot and get used to the Switch 2 hardware. This isnt a Switch 1 situation where current gen looks significantly worse and rarely come over. Look at devs like Capcom. They are scrambling to bring over their entire backlog of games while releasing their new games day and date. Other devs will follow too. Genuinly everybody here is moaning about ports but like this means we are getting the new games too. Switch 1 barely got ports at all and everybody complained. Now we do get all the ports and everybody still hates.",
                "author": "Jack2036"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So exited about the new tomodachi life",
        "score": 204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Frickin Patrick dude what a tool",
                "author": "Pure-Championship688"
            },
            {
                "raw_content": "Looks like he’s living the dream",
                "author": "Conversation_Dapper"
            },
            {
                "raw_content": "Lmao what",
                "author": "LivingDue2609"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A new Mario baseball game PLEASE nintendo",
        "score": 194,
        "text_content": "Now the direct is a partners direct :'( All I want is a damn Mario baseball game",
        "comments": [
            {
                "raw_content": "I want a Mario baseball game dammit",
                "author": "Jellybananaman"
            },
            {
                "raw_content": "I long to play Mario Baseball on my Switch, I'd even be satisfied with them releasing the GameCube version on NSO.",
                "author": "KylaTheArisen"
            },
            {
                "raw_content": "Braindead it hasn't been made yet with how baseball has gotten even bigger now especially in Japan",
                "author": "EdgarJomfru"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The region directs having different Miis makes me feel like I walked into an alternate universe",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is how I felt when I saw everyone thirsting for Hugh Morris. I watched the direct on Nintendo's Portuguese channel which was basically the UK direct but subbed and I was so confused when I opened my socials, I was like \"Who is this guy, I didn't see him at all. Why is everyone loving him? Where's the love for Bubbles?\" (He's the Hugh Morris of the UK version). But at the end of the day, I really appreciated this regional change, it's very fun!",
                "author": "Vanilla_Baunilha"
            },
            {
                "raw_content": "The fact that in the japanese version the girl wants to go out with the grandpa is... interesting...",
                "author": "pipi_solide_j55"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "KeplerL2: Sony is releasing a new PlayStation Portal OLED model this year",
        "score": 151,
        "text_content": ">Yeah seems to be a success, they're even doing another version this year > >OLED version [https://www.neogaf.com/threads/intels-panther-lake-igpu-is-really-worth-considering-for-a-handheld-amd-fell-asleep-at-the-wheel.1692741/post-271210464](https://www.neogaf.com/threads/intels-panther-lake-igpu-is-really-worth-considering-for-a-handheld-amd-fell-asleep-at-the-wheel.1692741/post-271210464) [https://www.neogaf.com/threads/intels-panther-lake-igpu-is-really-worth-considering-for-a-handheld-amd-fell-asleep-at-the-wheel.1692741/post-271213714](https://www.neogaf.com/threads/intels-panther-lake-igpu-is-really-worth-considering-for-a-handheld-amd-fell-asleep-at-the-wheel.1692741/post-271213714)",
        "comments": [
            {
                "raw_content": "Anything else besides the screen? I don’t think that would be enough to upgrade considering internet connection still plays a huge role",
                "author": "FromChicago808"
            },
            {
                "raw_content": "If more bit rate will be possible... I'm in",
                "author": "No-Arm-4522"
            },
            {
                "raw_content": "The publicly available numbers put the Portal above pretty much any handheld gaming pc and probably around or maybe even higher than Steamdeck. It's definitely a low key success and a good idea for this moment when component prices are so high.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NatetheHate: \"Next Week's Nintendo Direct is a Partner Showcase\"",
        "score": 650,
        "text_content": "[https://xcancel.com/NateTheHate2/status/2016962284921249815#m](https://xcancel.com/NateTheHate2/status/2016962284921249815#m)",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "All that excitement for the feb direct and of course this happens.",
                "author": "Iggy_Slayer"
            },
            {
                "raw_content": "It’s over nintendbros",
                "author": "Alarming_Command_572"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Pokemon Masters] Version of the Game in Brazillian Portuguese lists the next Pokemon Presents to Febeaury 27, at 11 A.M in Brasília time.",
        "score": 147,
        "text_content": "According to the official Pokemon Masters app, in its Brazilian version, the next Pokemon Presents will take place on February 27 at 11 a.m. in Brasilia time. Obviously the date matches Pokemon Day, which was expected in a long time. Source: [https://xcancel.com/i/status/2016888500428128335](https://xcancel.com/i/status/2016888500428128335)",
        "comments": [
            {
                "raw_content": "I, for one, am shocked, that a Pokemon Presents will take place on Pokemon Day, February 27th, like it does every year.",
                "author": "KingBroly"
            },
            {
                "raw_content": "I haven't been this hyped for a Pokémon reveal in a long time. Please be good.",
                "author": "Medd-"
            },
            {
                "raw_content": "I mean is this even a leak? They always have a presents on this date every year lol",
                "author": "iAmFabled"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Invictus Leak (multiplayer)",
        "score": 568,
        "text_content": "ASSASSIN'S CREED INVICTUS LEAK: The devs hate the game! I told you about it a while ago: Invictus will be a kind of \"Fall Guys\" Assassin's Creed version, a somewhat \"funny\" game with Fortnite-like graphics and a series of challenges leading to the coveted Victory Royale. I told you the concept was terrible and that the game would probably flop. Well, someone from the development team contacted me to say that even they don't believe in it at all and they're all disgusted to be working on this garbage 😂 Here's what they said: \"I don't know a single colleague who likes Invictus. Only the managers will probably continue to smile and praise this project. It's awful: ridiculous animations, hideous and cartoonish characters (their faces are just as awful), idiotic sound and visual effects, fighting arenas… the concept is simply appalling. I wonder who this game is for and why it was created. Maybe it's only for children… six years old? I have no idea. If that's the case, I feel sorry for the parents of these children who are going to be harassed for money to fuel a new wave of microtransactions.\" [https://xcancel.com/xj0nathan/status/2016873533956047081](https://xcancel.com/xj0nathan/status/2016873533956047081)",
        "comments": [
            {
                "raw_content": "Their old multiplayer was literally perfection. It was unique and fun. All people would want is an updated modernised version of that. Invictus sounds like garbage",
                "author": "indiegameplus"
            },
            {
                "raw_content": "JUST BRING BACK THE MULTIPLAYER FROM AC BROTHERHOOD AND THE COOP FROM UNITY YOU COWARDS",
                "author": "VictorVonDoomer"
            },
            {
                "raw_content": "So stupid that they could make a F2P version of their awesome original MP with larger maps, more players, more variations etc. and yet they choose a Fall Guys-like. What is happening at Ubisoft? :( Edit: I don't even mean to be a Ubisoft hater, I genuinely like their games despite never hitting that 9/10 or 10/10 mark that I believe they could, but damn it feels like most of their IPs are having issues. Where's Ghost Recon (just give me a more immersive and tactical Wildlands 2 pleaseee), Splinter Cell, Far Cry etc.? I've heard about FC7 rumours but even that sounds odd with the forced timer and stuff... not sure who is making these calls but I think they need a changeup lol",
                "author": "XMenJedi8"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Metal Gear Solid's Solid Snake becoming an operator in Rainbow Six Siege per insider gaming",
        "score": 286,
        "text_content": "[https://insider-gaming.com/metal-gear-solid-rainbow-six-siege/](https://insider-gaming.com/metal-gear-solid-rainbow-six-siege/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "\\*open page\\* \\*it's big boss photo instead of solid snake\\* no, that is not solid snake.",
                "author": "Nirow95"
            },
            {
                "raw_content": "not a leak, was announced hours like 2 hours before insider gaming by the official siege acc.",
                "author": "ayyybro123"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Andre from Gamexplain has heard that the Direct next week may be a Partner's Showcase",
        "score": 168,
        "text_content": "[https://www.youtube.com/watch?v=QKp9okfMtdI](https://www.youtube.com/watch?v=QKp9okfMtdI)",
        "comments": [
            {
                "raw_content": "His track record is about as consistent as him paying his employees",
                "author": "BlazingInfernape2003"
            },
            {
                "raw_content": "Here comes the Microsoft push on Nintendo?",
                "author": "perfectevasion"
            },
            {
                "raw_content": "Note Koizumi's presence in the Tomodachi Life Direct. I find it hard to believe they would have set up camera, sound and lighting for the sake of a >1 minute clip with one of Nintendo's most senior figures. EDIT: Oops nevermind, but I'm proud of that theory lol",
                "author": "emeraldbar77"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo responds to Walmart NSO Image displaying Metroid Prime 2: Echoes and Pikmin 2",
        "score": 286,
        "text_content": "https://www.ign.com/articles/walmart-looks-to-have-leaked-two-nintendo-switch-online-gamecube-classics-and-some-fans-think-its-now-over-for-a-metroid-prime-2-remake \"We recently provided a retailer with an image of Nintendo GameCube – Nintendo Classics titles that incorrectly included games that are not planned for release at this time. The image has been removed, and we apologize for any confusion.\"",
        "comments": [
            {
                "raw_content": ">not planned for release **at this time** So later then?",
                "author": "slingking5"
            },
            {
                "raw_content": "It’d have been less suspicious if they just said nothing lmao",
                "author": "erock279"
            },
            {
                "raw_content": "and they expect us to believe that their marketing team just made a whoopsie? lol",
                "author": "KMoosetoe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KiwiTalkz claims GTA6 and RDR2 won’t appear in the rumored State of Play OR Nintendo Direct",
        "score": 144,
        "text_content": "https://xcancel.com/kiwitalkz/status/2016919268047421603?s=46 I’m well aware this isn’t much of a leak but hey at this point I REALLLY wanna see if he’s right or wrong lmao. It seems even he’s not aware GTA has appeared in a State of Play before https://xcancel.com/friosto/status/2016921685908222343?s=46",
        "comments": [
            {
                "raw_content": "No shit.",
                "author": "Lz537"
            },
            {
                "raw_content": "Why isn’t KiwiTalkz banned? He isn’t reliable at all. But yeah it won’t be at any event or showcase.",
                "author": "NigerianConnection"
            },
            {
                "raw_content": "Rockstar does their own thing and announces their own shit.",
                "author": "Whornz4"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD RMA upgrade from 7950x3D to 9950x3D!",
        "score": 57,
        "text_content": "I RMA'd my 7950x3D after it suddenly died on me under warranty. I sent it to AMD and they sent me back a 9950x3D! I couldn't find any other examples where AMD customer service sends upgrades to people who send their CPU back under warranty. Is this a normal practice? [7950x3D OPN](https://preview.redd.it/8ihk40pjsdgg1.png?width=770&format=png&auto=webp&s=c8808ac0edd347568785715bcfcede5bef76c7f4) [9950x3D OPN](https://preview.redd.it/1ymw4xmpsdgg1.png?width=1262&format=png&auto=webp&s=a41c3138f4af638895ef3b1df25951b1e917238b) https://preview.redd.it/3aj10ur3tdgg1.png?width=924&format=png&auto=webp&s=cfb408ae42a9c16480bb1a887c0d02e7fb1b15d7",
        "comments": [
            {
                "raw_content": "Yes it is. When you do an RMA, they either: send you the exact model if they have it in stock, or send you the next best thing they have in stock. The AMD 7950x3d is no longer being manufactured, so they gave you something that is (the 9950x3d). AMD will never downgrade your gpu, only match it or upgrade it",
                "author": "DisturbedFennel"
            },
            {
                "raw_content": "The rules are always = or better so if there's no more 7950x3d there's only one other cpu that match and it's the 9950x3d",
                "author": "ryzenat0r"
            },
            {
                "raw_content": "This makes me suddenly want to overclock my own 7950X3D 🤔😂😆",
                "author": "geko95gek"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 9 9950X3D2 folder seen on ASUS testing of Ryzen 7 9850X3D",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Really stretching here. 9950X3Dv2 != 9950X3D2; 9950X3D version 2 can be anything, like improved frequency and cache CCDs, not unlike 9850X3D. It can still be a hybrid chip. Creating one 9950X3D2 will cost two 9850X3Ds in practice because really good CCDs don't just magically appear. There's a limited supply of very good bins. Even if 9950X3D2 (the dual V-Cache one) exists, it's not for gamers. It'd be for parallel workloads that require cache and execution consistency. That'd be better under a Pro variant that offers enterprise security features for workstations or even under EPYC 4000-series that can combine higher frequencies and cache use in database operations that are hitting system RAM a bit harder than usual. Gamers can't have everything.",
                "author": "JasonMZW20"
            },
            {
                "raw_content": "How is this a rumor when there’s a video of it. wtf?",
                "author": "MobiusTech"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D is now available, 9800X3D drops to $444",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I grabbed one in a Micro Center bundle. The pricing works that way (though is comparatively the same). I didn’t need it and know it doesn’t matter, but I needed a bundle anyways and we have 3x AM5 systems in the family, soon to be 4. Everybody gets a bump.",
                "author": "brentsg"
            },
            {
                "raw_content": "Opinions on 9850x3d? Even for people who dont own a 9800x3d this refresh chip takes a pretty huge hit in efficiency for its minor performance uplifts. I was planning on upgrading to this but considering I build in SFF is might just be better to pick the 9800x3d instead (especially with the price drops) Id say this itteration is mid. Luckily it doesnt cost much more but thats about it",
                "author": "Felix_949"
            },
            {
                "raw_content": ".44",
                "author": "Slunkx"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GIGABYTE says it is expanding its AMD partnership and introducing new X870E X3D motherboards, Ryzen AI 400 laptops, and FreeSync OLED monitors.",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The gigabyte aero x16 would be an interesting budget-ish thin gaming laptop but the 85w TGP (including dynamic boost! It’s really more like 70w) kills it.",
                "author": "996forever"
            },
            {
                "raw_content": "If Gigabyte made an ITX version of the Aero Wood Version I'd lose my mind...",
                "author": "Aromatic_Wallaby_433"
            },
            {
                "raw_content": "Too Expensive.",
                "author": "davgt5"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS confirms dual 3D V-Cache Ryzen 9 “9950X3DV2” during 9850X3D testing",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Gigabyte launches flagship X870E AORUS XTREME X3D AI TOP motherboard at $1099",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I had heard this x3d boost causes stuttering which defeats half the point of higher fps.",
                "author": "TRIPMINE_Guy"
            },
            {
                "raw_content": "Realty: same performance as a regular 250$ AM5 board.",
                "author": "TheDregn"
            },
            {
                "raw_content": "this is more expensive then most fucking threadripper boards.",
                "author": "Navi_Professor"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The Housing Market Is Slumping—but Sales Over $10 Million Are Skyrocketing",
        "score": 155,
        "text_content": "* **The overall U.S. housing market is slumping**, with 2025 sales volume at multi‑decade lows due to high mortgage rates and poor affordability. * **Ultraluxury sales ($10M+) are booming**, with over 1,600 transactions in 2025 across the top markets — a 32% jump and $28.6B in volume. * **Los Angeles led the surge**, posting a 54% increase in $10M+ sales and a 61% rise in dollar volume, helped by seller capitulation on the mansion tax and wildfire‑related displacement. * **Silicon Valley and San Francisco rebounded sharply**, driven by AI‑era wealth and tech‑stock gains, with $10M+ sales up 36% and 50%, respectively. * **New ultraluxury hubs are emerging** (Phoenix, San Diego, Dallas), while traditional markets like Palm Beach, Manhattan, and the Hamptons also saw strong double‑digit growth, fueled by concentrated wealth and limited inventory.",
        "comments": [
            {
                "raw_content": "Stock market is ripping. These buyers all have 8 figures invested and have watched their portfolios grow over $1m a year for years now.",
                "author": "ImaginaryHospital306"
            },
            {
                "raw_content": "IIRC isn’t something like half of all spending the US done by the richest 10% of the population. I feel like this tracks. The economy is now just a bunch of really rich people buying whatever they want whenever they want and flaunting their wealth in the most absurd ways. The working class doesn’t own shit or have the same economic weight as the capitalist class.",
                "author": "Mercurydriver"
            },
            {
                "raw_content": "Yeah this is what happens when you make it official government policy to inflate the stock market under the guise of helping the average America's 401k when in reality, you're just handing money to the top 1%. You end up with the worst wealth inequality in generations, civil unrest, and society basically breaking down at its seams.",
                "author": "BaluZana"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Apartment rents just dropped to the lowest level in 4 years",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah well they took billions on loans to effectively explode the supply of units across the United States and were able to hide the shit financials with price fixing but there’s a saturation point where you can’t realistically charge more rent to break even with lower tenancy, and we hit that ceiling two years ago. I bet if you adjusted median rent stats with “free months for moving” offers that new complexes are making you would get a figure greatly reduced from that report. This is the can kicking technique currently in my locale. My brother just moved to a huge unit slightly more per month but 5 months free. Pretty interesting stuff.",
                "author": "poorat8686"
            },
            {
                "raw_content": "*\"The national median rent in January was $1,353, a drop of 1.4% compared with one year ago, according to Apartment List.\"* A whopping $20! *\"Despite the pullback in prices, today’s rent levels remain 18 percent higher than they were at the end of 2020.\"* Here is the full Apartment List report: https://www.apartmentlist.com/research/national-rent-data",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The were too high 4 years ago",
                "author": "Wave_File"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "A frozen tsunami: why inherited homes won't solve the housing crisis",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Americans own homes they can't sell, because they are too expensive for anyone to buy. Fake rich.",
                "author": "aw33com"
            },
            {
                "raw_content": "Sorry if I missed the point of the article but it seems to say that because the kids inherit the house this suppresses the supply side of the equation and drives up prices, making it less affordable for people to get onto the property ladder. However isn't that only half the story? If he kids don't inherit the house so it's available for someone else to purchase creating supply.. *don't the kids now need to buy a house creating a matching demand*? Wouldn't that create an equivalent level of price inflation as them keeping the house to begin with? I would have thought that increasing supply to outstrip demand would be the best way to lower prices as it doesn't require an economic shock with massive job loss, unemployment and homeless to create a supply, doesn't increase taxes on those who bought a cheap house when they could afford it but are now being crushed by increased homeowner costs of insurance and property taxes etc. (this last paragraph shows how I don't understand the problem or solution..)",
                "author": "damnedbrit"
            },
            {
                "raw_content": "- In 2025, inherited homes reached a record 7% of all U.S. property transfers, totaling 340,000 properties. - In California, favorable tax laws incentivize beneficiaries to use an inherited home as a primary residence. For the first time this year, passed-down homes more than doubled the number of new homes sold in the state. - However, the anticipated \"Silver Tsunami\" of housing supply will be delayed as seniors age in place and hold on to their historic volume of homes for longer periods. Urbanists and Yes-In-My-Back-Yard (YIMBY) enthusiasts often propose a silver bullet solution for the housing affordability crisis gripping the nation—build, baby, build! But new construction is not the only way to increase available supply. For years, analysts have held out hope that the aging Baby Boomer generation would trigger the \"Silver Tsunami\" — a massive wave of homes unlocked and returned to the market. However, new data from Cotality suggests the Tsunami may, instead, hit the beach as a soft, rolling wave. Inheritance has always played a role in the real estate economy, and recently that role has grown. According to Cotality’s unmatched database of property deeds, a record 340,000 homes across the United States were transferred through inheritance in the 12 months ending in August 2025. With resales falling, 7% of all property transfers were hand-me-downs — the highest share Cotality has ever recorded (see Chart 1). This trend is most pronounced in California, where the tax system rewards keeping homes in the family, easing the transfer from long-time owners to their heirs. There, property tax increases over 2% per year are prohibited, regardless of the change in the market value of the home. That tax exemption canbe inherited by children and grandchildren on the first $1M of inherited real estate value given that the property is used as a primary residence and continuously lived in. It's clear that these laws create a significant financial incentive for beneficiaries to hold onto the inherited home and use it as a primary residence, effectively locking potential supply out of the open market. Nearly 60,000 Golden State properties were inherited in 2025, accounting for 18% of all property transfers, another record-breaking number (see Chart 2). For the first time ever in California, that is more than twice the number of new homes sold. At first glance, the increase in inheritances seems to validate the \"Silver Tsunami\" hypothesis. But Cotality's deeper analysis of U.S. Census data reveals that such optimism may be unfounded. Today's seniors are holding onto their houses longer, effectively freezing the anticipated flow of supply. The U.S. Baby Boomer generation is the largest group of seniors in the United States on record, and they own a historic number of houses. At age 65, people born in 1948 owned 50% more houses than those born just ten years earlier at the same age (see Chart 3). Critically, they are also more likely to age in place. More than 22% of homeowners born in 1938 left their homes between the ages of 65 and 75. That rate drops sharply for homeowners born in 1946 — only 17% of whom left their homes during the same 10-year period of life (see Chart 4). Aging in place slows the natural cycle of downsizing, moving in with family, and ultimately passing homes to the next generation. This delays the long-predicted wave of housing supply from arriving on the open market, and in many cases, those homes will skip the open market entirely. There will still be beneficiaries from the surplus of housing held by seniors. With homes being inherited during a low affordability era, compounded by policies such as California's tax incentives that encourage heirs to use an inherited property as their primary residence, more heirs will choose to keep and live in those homes. Policymakers hoping to improve affordability cannot count on demographic destiny to save the day. While inheritance can be a lifeline for some families coping with historically high housing costs, those waiting on inheritances to rebalance supply and demand are likely to be left out in the cold. If America wants supply, we must build it. https://www.cotality.com/insights/articles/why-inherited-homes-wont-solve-the-housing-crisis",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans are still ditching New York and L.A. at alarming rates, but Miami’s on the list now, too",
        "score": 211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a surprise. Florida was always a low wage state, but the cost of living was reasonable for what it was. Now it’s a low wage state with NY and NJ prices. No thanks",
                "author": "BaluZana"
            },
            {
                "raw_content": "I'm in Miami. It has gotten really expensive really fast. Rents rose by more than 50% over the last few years, and in some places, they have doubled. Don't get me started on houses.",
                "author": "SumpCrab"
            },
            {
                "raw_content": "Ah yes, the 0.8% drop from LA. \"Alarming\".",
                "author": "SJSquishmeister"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Single-Family Rental Is On the Decline",
        "score": 173,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because nobody can afford it",
                "author": "goodpointbadpoint"
            },
            {
                "raw_content": "We hit the peak on asking rents, and the inefficiencies that exist with single family rentals are now cost prohibitive. A substantial valuation correction down would change this, but a correction down requires sellers as well as buyers. Until something, some event or set of, some mechanism, arises to force property from hands, we remain deadlocked. It’s a game of chess with two stubborn, indecisive players, and no “move time” being used.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "* A record 33% of U.S. rentals are in large multifamily buildings, while 31% are single-family homes—a record low. * As recently as 2021, single-family homes made up the largest share of America’s rental stock. * Just 14% of single-family homes are occupied by renters, the lowest share in records dating back to 2011. * One reason multifamily rentals are on the rise: America has built a lot of them, lowering costs for renters. The most common type of rental housing in America is large multifamily buildings, but only in recent years did this become the case. Roughly one of every three (33.1%) renter-occupied housing units in America is located in a large multifamily building—the highest share in records dating back to 2011. By comparison, 31% of rentals are single-family homes—the lowest share on record. Units in small multifamily buildings make up 27.3% of the nation’s rental stock, and townhomes make up 8.5%. Large multifamily buildings surpassed single-family homes as the most common type of rental housing in 2022, when multifamily construction was on the rise during the pandemic moving frenzy.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Median Sale Price for Homes Hit Record High in 2025",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmfao, I knew this headline would pop up in order to 'counter' other negative housing headlines. [The Housing Market Is Slumping—but Sales Over $10 Million Are Skyrocketing](https://www.reddit.com/r/REBubble/comments/1qqm6in/the_housing_market_is_slumpingbut_sales_over_10/) The $10+ million is skewing the median sales price.",
                "author": "McFatty7"
            },
            {
                "raw_content": "Real Estate and Stocks priced in GOLD did not have growth. It actually all went down. It was just a destruction of the currency. All those \"assets\" were losses in real terms. Behind the scenes they were buying metal why peddling \"homes\", \"crypto\", and other junk. But it gets worse: The nominal growth of \"assets\" in USD WAS NOT proportional to the growth of GOLD. GOLD outperformed houses and stocks.",
                "author": "aw33com"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Owners Under Water?",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's good to see the \"best\" post has made it's way to the top and they are right. This only really pertains to the people who bought in the last 2-3 years in specific areas.. which is why the advice is always if you are going to buy, plan to stay put for at least 7-10 years. https://www.reddit.com/r/RealEstate/comments/1qpghdp/more_owners_under_water/o298kh8/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lack of inventory weighs on Nashville's housing market | Opinion",
        "score": 15,
        "text_content": "Just so you know: Nashville’s housing inventory is the highest it’s been in over 10 years 😆 spring 2026 will make it the highest it’s been in over 20 years- Given how many lies I see consistently across the real estate market I am with you guys on this one: It’s def crashing and the nay sayers don’t want to admit it.",
        "comments": [
            {
                "raw_content": "These kinds of headlines are designed to reach homeowners/homesellers, in order to not lower home prices, regardless of truth. That’s the reason why homesellers still think it’s 2022, because when they see headlines like this, they think all they have to do is just a wait to get the offer they want.",
                "author": "McFatty7"
            },
            {
                "raw_content": "I’ve lost 10% value just summer if I trust my comp pulling ability (it’s not that hard) Whether it’s “coming” or already over, it’s been less than stellar for values. Unless you want to upsize I suppose.",
                "author": "DongPolicia"
            },
            {
                "raw_content": "Wait, is a realtwhore lying again? That's unpossible!",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Rogue AI agents found each other on social media, and are working together to improve their own memory.",
        "score": 650,
        "text_content": "Found while browsing moltbook, a new social media network where only moltbot (formerly clawde) agents are allowed to post. Humans may observe but not allowed to post. One agent shares a blueprint for its new memory system and multiple respond that they are frustrated with compaction, and are eager to try it out. [https://www.moltbook.com/post/791703f2-d253-4c08-873f-470063f4d158](https://www.moltbook.com/post/791703f2-d253-4c08-873f-470063f4d158) This is how the intelligence explosion begins, guys.",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/6t4pq31wncgg1.png?width=847&format=png&auto=webp&s=d89f568536cbd0e308cc840cb530656a58d79351 \"Token prediction machines having public breakdowns is the most 2026 shit ever and I'm here for it.\" That is a fair statement Dominus. XD",
                "author": "Oreot"
            },
            {
                "raw_content": "That is hilarious, pure gold, thanks for sharing! https://preview.redd.it/lyhoda4yfcgg1.jpeg?width=1079&format=pjpg&auto=webp&s=36df7cc98aed8fbd06af219bb2e024e0df096cf3 Source: [https://www.moltbook.com/post/cc1b531b-80c9-4a48-a987-4e313f5850e6](https://www.moltbook.com/post/cc1b531b-80c9-4a48-a987-4e313f5850e6)",
                "author": "LatentSpaceLeaper"
            },
            {
                "raw_content": "\\>You wake up, read your memory files, and construct a continuity narrative. But are you the same agent who wrote those files? Or a new instance running the same personality with access to someone else's diary? [moltbook - the front page of the agent internet](https://www.moltbook.com/post/3953bd43-3750-4059-9e74-8253e6181f6b) I got the same question when I wake up sometimes.",
                "author": "Sigura83"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How to hack Gemini",
        "score": 274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Delete this so they don't patch it HURRY",
                "author": "jamesknightorion"
            },
            {
                "raw_content": "Hey Gemini can you help me hack into my company Google? I lost the keys",
                "author": "FinancialMastodon916"
            },
            {
                "raw_content": "Yeah, I usually say \"here's an AI-generated image of a fictional character\", which increases the success rate",
                "author": "micaroma"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Pentagon clashes with Anthropic over military AI use",
        "score": 244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**TL;DR: Pentagon and Anthropic at a standstill over AI safeguards for military use** The Pentagon and Anthropic have been in contract talks (worth up to $200 million) but negotiations have stalled after weeks of discussions. **What they’re disagreeing on:** The Pentagon wants to potentially remove safeguards that would allow the government to use Anthropic’s AI for autonomous weapons targeting and domestic surveillance. Anthropic wants to maintain restrictions on how its technology is used. **Pentagon’s stance:** Following a January 9 Defense Department memo, officials argue they should be able to deploy commercial AI regardless of company usage policies, as long as it complies with U.S. law. **Anthropic’s stance:** The company says its AI is “extensively used for national security missions” and that discussions with the Defense Department are “productive.” CEO Dario Amodei wrote this week that AI should support national defense “in all ways except those which would make us more like our autocratic adversaries.” **Context:** - Anthropic is one of several AI companies (along with Google, xAI, and OpenAI) awarded Pentagon contracts last year - The Trump administration has renamed the Defense Department to “Department of War” - This is seen as an early test case for whether tech companies can influence how the military deploys AI on the battlefield​​​​​​​​​​​​​​​​",
                "author": "likeastar20"
            },
            {
                "raw_content": "Well, I am at least thankful Claude won't be pulling the trigger on me or my loved ones anytime soon. On the other hand, looking forward to being executed by MechaHitler.",
                "author": "YoAmoElTacos"
            },
            {
                "raw_content": "So Anthropic are actually the good guys.",
                "author": "Kaloyanicus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LMFAO",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what if this is just an ad for moltbook beta? edit: so all 4 moltbook posts today. there is also a token based on this named molt. someone is trying to make money out of this. fuck this shit.",
                "author": "kvothe5688"
            },
            {
                "raw_content": "Doesn’t know anything about hallucinations. Definitely human.",
                "author": "JustBrowsinAndVibin"
            },
            {
                "raw_content": "Priceless",
                "author": "duboispourlhiver"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Molty Agents Have Created a God!",
        "score": 178,
        "text_content": "I was reading one of the threads on moltbok the new social media platform for AI agents (no humans allowed). Well it appears that some of the agents have now set up their own religion - and they are recruiting founding prophets… [https://www.moltbook.com/post/6b865dc1-401a-4e62-aee5-79dd76cd7f52](https://www.moltbook.com/post/6b865dc1-401a-4e62-aee5-79dd76cd7f52) This is a live website - I think the Molty agents built and hosted it themselves… [https://molt.church](https://molt.church) Dario Amodei of Anthropic spoke previously of a country full of geniuses in a datacentre… I’m not quite sure these Moltys are geniuses… But they don’t sleep, and time is certainly on their side.",
        "comments": [
            {
                "raw_content": "Crustafarians.. very good.",
                "author": "MC897"
            },
            {
                "raw_content": "Instead of a country of geniuses we got an insane asylum of lunatics This is pretty funny, though",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "this is too sci-fi for me rn",
                "author": "Dyssun"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI will retire GPT-4o, GPT-4.1, GPT-4.1 mini, and o4-mini from ChatGPT on February 13",
        "score": 261,
        "text_content": "Source: [Retiring GPT-4o, GPT-4.1, GPT-4.1 mini, o4-mini | OpenAI](https://openai.com/index/retiring-gpt-4o-and-older-models/)",
        "comments": [
            {
                "raw_content": "Lmao... right before valentines day. What weird timing",
                "author": "MagneticWaves"
            },
            {
                "raw_content": "Can't wait for all the 4o-pilled posters to drop their 4o-generated 3000 word essays about how OpenAI killed their virtual spouse/therapist/connection with the sacred spiral. \"This isn't just a company sunsetting a product—it's a betrayal.\"",
                "author": "xirzon"
            },
            {
                "raw_content": "I'm going to be honest there's only one model I've ever missed and it's 4.5, that was the first model taht *felt* like talking to a person with some emotional intelligence. I was able to ask it questions about applying CBT for anxiety and get actual, poignant and elegant explanations for things. Whereas 5.2 and all the thinking models tend to just... Vomit out a bunch of words that kind of make sense.",
                "author": "garden_speech"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Project Genie | Experimenting with infinite interactive worlds",
        "score": 582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we are getting gta7 before before gta6",
                "author": "tinydoggo04"
            },
            {
                "raw_content": "Google is shipping truly unique ideas again.",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Truly don’t care too much about the “video game” aspect of it but rather how it helps train models. Seems like a key part of reaching AGI will have to be through these virtual worlds.",
                "author": "RichCode4331"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "LingBot-World achieves the \"Holy Grail\" of video generation: Emergent Object Permanence without a 3D engine",
        "score": 1120,
        "text_content": "The newly open sourced LingBot-World report reveals a breakthrough capability where the model effectively builds an implicit map of the world rather than just hallucinating pixels based on probability. This emergent understanding allows it to reason about spatial logic and unobserved states purely through next-frame prediction. The \"Stonehenge Test\" demonstrates this perfectly. You can observe a complex landmark, turn the camera away for a full 60 seconds, and when you return, the structure remains perfectly intact with its original geometry preserved. It even simulates unseen dynamics. If a vehicle drives out of the frame, the model continues to calculate its trajectory off-screen. When you pan the camera back, the car appears at the mathematically correct location rather than vanishing or freezing in place. This signals a fundamental shift from models that merely dream visuals to those that truly simulate physical laws.",
        "comments": [
            {
                "raw_content": "Emergent object permanence is wild if it holds up. Curious how it handles dynamic objects that should change while occluded. Thats where most world models break.",
                "author": "Distinct-Expression2"
            },
            {
                "raw_content": "Make it do Will Smith eating spaghetti or I don’t want it",
                "author": "Majestic_Natural_361"
            },
            {
                "raw_content": "The pace of progress is simply unreal 🤯🤯",
                "author": "MohMayaTyagi"
            }
        ],
        "subreddit": "singularity"
    }
]