[
    {
        "post_name": "Nicolas Maduro was just PERP WALKED in the New York DEA's office by federal agents",
        "score": 1158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "should be Boasberg, a year ago, almost to the day, followed by - i'd estimate thousands of other traitors.",
                "author": "cptkloss5"
            },
            {
                "raw_content": "Wait, why NY?",
                "author": "Pickles76"
            },
            {
                "raw_content": "The stupid looking pussy hat was a nice touch, LOL",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Operation Absolute Resolve: The U.S. military operation that led to the arrest of Venezuelan President Nicolás Maduro",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump keeps racking up such big Ws that it’s easy to forget how numerous they are. - Freeing hostages. - Denuclearizing Iran with ZERO casualties. - 4.5% growth. - Record stock market. - Ending Bideninflation. - Ending illegal immigration. - smallest federal workforce in 50 years - saving US manufacturing - Etc, etc, etc. Any one of these things would define another Presidency. Reagan “saved the Iranian hostages” and it’s treated like some historic unprecedented achievement. That would be light work for the Trump Admin. He does as much on a monthly basis.",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Trump looks like a bald eagle NOT wearing a toupee!",
                "author": "Oldman69"
            },
            {
                "raw_content": "Maduro had to be physically removed. Perfect OP order title.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "140 Criminal Demonrats vote to impeach President Trump. The DNC is trying to protect their drug trafficking empire.",
        "score": 1078,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Dems are running out of grifting schemes.",
                "author": "Restore_Sanity_alt"
            },
            {
                "raw_content": "All Faggots",
                "author": "Justjayce"
            },
            {
                "raw_content": "When GOP wants Dems to stand firm on a stance they force them to vote on a bill (ie taking illegals off welfare) When Dems want GOP to stand by trump they make them vote for impeachment. How many is that now? 4? 5? They’re gaslighting the public to think that impeachment is standard procedure and Congress has true control over the executive branch. Not Americans",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dominating our hemisphere is America 1st.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump should do a bunch of other stuff now. Dems flip out when he does more things than they can handle(complain about)",
                "author": "VirTW"
            },
            {
                "raw_content": "Dominating our hemisphere without dominating our own tyrants is cute.",
                "author": "notCIA"
            },
            {
                "raw_content": "What I'm wondering is if the next few tyrannies (like Brazil) are on the docket.",
                "author": "julianReyes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Javier Milei goes scorched earth on the Commies in impassioned post: \"LONG LIVE FREEDOM, DAMN IT\"",
        "score": 1333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who better to remind us of this victory than Javier Milei!",
                "author": "deltaforcestrike"
            },
            {
                "raw_content": "Liberals will always side with The enemies of America Liberals are the enemy of America",
                "author": "Bildthewall"
            },
            {
                "raw_content": "The people saying we should’ve left Venezuela alone are the same people saying we should accept Venezuelan refugees escaping that regime",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A former McDonald’s worker just liberated Venezuela.",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> “I’ve now worked for 15 minutes more than Kamala.” And after he said that, I laughed for 15 minutes straight. I was laughing so hard my mom had to come down to the basement to check on me.",
                "author": "BeauHD"
            },
            {
                "raw_content": "I think in this case he was probably drawing more from his experience in taking out the trash as a former garbage truck worker.",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "former garbage man taking out the garbage too.",
                "author": "Washington_Redskins"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just DROPPED this footage exposing Minnesota Democrat AG Keith Ellison who PERSONALLY MET with shady Somalis and known fraudsters to rake in campaign donations!",
        "score": 1047,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SO FUCKING ARREST SOMEONE HOLY FUCK WHAT HAS TO HAPPEN?",
                "author": "PhilipeNegro"
            },
            {
                "raw_content": "**WOW! Ellison needs to be placed in cuffs and charged ASAP!**",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "OH! Dropped footage!! That will teach Kieth Ellison's ass a thing or two!! Kieth Ellison should be the one in the USS Iwo Jima brig.",
                "author": "fthecoup"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dems call for removal of Trump over Maduro capture—while Venezuelans celebrate",
        "score": 812,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't recall the Dems getting upset when we grabbed Noriega from Panama...",
                "author": "togger"
            },
            {
                "raw_content": "It’s time to start removing the communist demonrats ‼️",
                "author": "Live_free_or_die_55"
            },
            {
                "raw_content": "The amount of this win is signified by the amount of shills on this site. Biggly",
                "author": "UltraFrogMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👱 Trump: ‘It’s the Donroe Doctrine Now’ — Monroe Doctrine Frames the U.S. Arrest of Venezuela’s Maduro 📜",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now, let's see that Donroe Doctrine in all the blue states now that the boys are warmed up.",
                "author": "MythArcana"
            },
            {
                "raw_content": "epic that TRUMP threw a socialist right into a NYC federal prison, right in Mamdumbies stupid fuckin face",
                "author": "DonyBanano"
            },
            {
                "raw_content": "**Archive Link**: https://archive.ph/gKQlP **Direct Link**: https://www.breitbart.com/border/2026/01/03/trump-its-the-donroe-doctrine-now-monroe-doctrine-frames-the-u-s-arrest-of-venezuelas-maduro/ **Pepe Link**: [🐸👌](https://static01.nyt.com/images/2016/09/28/us/28xp-pepefrog/28xp-pepefrog-superJumbo.jpg)",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fresh: Walking Maduro Down DEA Hallway",
        "score": 708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep him out of New York. They will vote him into office.",
                "author": "RentFree2020"
            },
            {
                "raw_content": "2026: The Year of Accountability",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Is that a pussy hat?",
                "author": "mykillk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump needs to repost this:",
        "score": 1745,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That tweet aged like his wife's face",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "FJB‼️",
                "author": "Live_free_or_die_55"
            },
            {
                "raw_content": "Obama’s potato. Both should be in prison.",
                "author": "RiolindasReturn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reminder that many of the anti-fascist groups that have been attempting a color revolution here in the United States have strong ties to Venezuela. They served as election monitors (which is invite-only by Maduro) and met with Maduro's officials. Would be great if they got rolled up for a chat too!",
        "score": 1428,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whenever you see someone cry about \"regime change\" - remember many factions are already attempting regime change right here in America, including foreign countries. Maduro was already waging war within the shores of the United States. We just finally struck back for the first time. https://x.com/DataRepublican/status/2007518253309145253?s=20",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "There's only one good commie.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Love this DataRepublican girl.. brilliant!",
                "author": "B-2StealthTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Foreigners waving communist flags have TAKEN OVER Times Square in NYC, DEMANDING the release of Nicolas Maduro",
        "score": 1649,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fix the fucking video player for fucks sake https://x.com/nicksortor/status/2007537912825471466",
                "author": "kek_saved_the_world"
            },
            {
                "raw_content": "Release him or what? Go ahead. Burn it down.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "Most of the them are NYC liberals",
                "author": "Username56"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gamer goblin gets it better than many here",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wanna know why ww2 only took basically 4 years? Answer, because we didn’t want to fight it longer than that…..",
                "author": "Trooph-Hurts"
            },
            {
                "raw_content": "Short wars doesn't make Congress rich...",
                "author": "TrumpPatriot83"
            },
            {
                "raw_content": "Everyone here gets that though.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Venezuelans - Delirious With Joy / Mamdani - Pissed",
        "score": 1333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The pissant better watch his back, they eat there own, especially when thet finally realize the price of *free stuff*.",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "His wife literally looks like a Batman villain",
                "author": "TheRPatriot"
            },
            {
                "raw_content": "Venezuela voted Maduro out of office and he refused to leave so therefore he is not the leader of Venezuela so therefore it is not a violation of international law. So mandami could go fuck himself with the goat that he's got in his closet.",
                "author": "JayKay1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Venezuela is now more free than New York City.",
        "score": 1473,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's time to black bag mamdani.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "kinda gay, ngl Id rather have Walz, or even Sheinbaum, arrested than Meduro",
                "author": "fightfightfightx"
            },
            {
                "raw_content": "ahhh... catturd is now exposed as the shill he is.",
                "author": "yodayoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Even if we sold all of that oil at 1/4 the price we would gain $4 trillion which is enough to open 4 more daycare centers in Minneapolis",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we resupply our own oil reserve instead of selling it?",
                "author": "K3719er"
            },
            {
                "raw_content": "If I learned anything from Landman, oil under $60 a barrel isn't good news for the industry.",
                "author": "HorribleDeplorable"
            },
            {
                "raw_content": "whew lads 😳👑👍",
                "author": "YaharaRiver"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "See that thing we just did to Venezuela? That’s what I want done to Minneapolis, Seattle, Sacramento, Austin, Boise, Columbus, Detroit, Madison, NoVA, Raleigh, Atlanta, Lewiston, Chicago….",
        "score": 679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But how would that help Israel?",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "Pam Bondi enters the chat. No.",
                "author": "Alabama_Front_Butt"
            },
            {
                "raw_content": "Imagine thinking the government serves the people lol",
                "author": "Grumbledook"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Honest question from a stranger on the internet. Honest answer.",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We'll get to America after fixing the rest of the world, wait your turn peasant.",
                "author": "YouEssAye"
            },
            {
                "raw_content": "Follow the wives",
                "author": "Firepit"
            },
            {
                "raw_content": "That’s a factor but partly it’s just timing. Trump is preparing for domestic wins. He’s been attacking and weakening the left on all levels all year: USAID, DEI, the legacy media, academia. He’s got Democrats fighting for criminals and illegals, and screaming about dictatorship and starving children. This is by design. Trump is intentionally trolling them to make them look stupid, hysterical, and wrong to most voters. And, of course, expose them as corrupt thieves of public tax dollars. 2026 will make you happy. Individual judges can’t stop what’s coming. Trump knows he has to win the midterms bigly, and he will. It will be a year of wins over Democrats and the left. Somali fraud, welfare fraud, campaign finance fraud, ballot fraud will all come out and be prosecuted. By November, the majority will want Democrats tarred and feathered or worse. P.S.: Maduro was a big Antifa supporter. Even that connects to Trump’s plan.",
                "author": "Kimball_Kinnison"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maduro is about to reveal how he helped steal our election and flood our country with people sent into blue states for census manipulation.",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Although I would love this to be true, this guy is high off the copium",
                "author": "EstadosUnidosPrimero"
            },
            {
                "raw_content": "Not holding my breath..",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "It doesn't matter what he says. Everyone already knows they cheated. The Dems don't care that they cheated. The FBI and CIA don't care that they cheated. The Republicans don't care that they cheated.",
                "author": "mojorisen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The MediaTek Dimensity 7000-series is an absolute mess with no internal logic or consistency at all",
        "score": 87,
        "text_content": "Bit of a rant here, after the recent introduction of the [Dimensity 7100](https://www.mediatek.com/products/smartphones/mediatek-dimensity-7100). **TL;DR:** MediaTek just assigns random numbers in their 7000-series, with no logic for either tiering or generations at all. \\----- First some context: MediaTek's Dimensity 7000-series is supposed to be their mid-range SoCs, but they can be found in phones from $/€399 all the way to $/€150. So it's mid-range *and* low-end, making it immediately questionable what the 6000 series is doing at all. So Q1 2023 the 7000 started with the Dimensity 7200. Made perfect sense considering the 8200 was just released in the previous quarter. Nice, modern start: TSMC N4P process, ARMv9-A CPU cores, modern reasonably sized Mali-G610 MC4 GPU. No notes at all. Perfect mid-ranger. Later the same quarter, the 7020 joined, which was simply a renamed Dimensity 930. Clearly lower-end with TSMC 6nm and ARMv8 CPU cores. Already a bit weird, why not name it 6000-something? 6200 was available at the time, and still is. Okay that happened. The reasonable thing to do now is to have a lower end 70x0 series and a higher-end 7x00 series. Confusing at first, but understandable and consistent. At least they started both at \"2\", implying consistent generation numbering. Q2 2023. We're not even 3 months further, and now joins: Dimensity 7050. A renamed Dimensity 1080. Basically the 7020 with another GPU. I can't make sense of this. At all. We're 3 chips in a brand new naming scheme and it's already confusing as hell. *Three* chips. Q3 2023. The Dimensity 1050 gets renamed to Dimensity 7030. Somehow it has a more modern GPU than the just launched 7050. If this is just a bit \"1000 series renaming scheme\", shouldn't it make stuff clearer. That was 2023: 4 chips, one big mess. 2024: In Q1 MediaTek is clearly recovering themselves, since no new 7000 SoCs launch. Apparently there are no 1000 series chips left to rename. Q2 the Dimensity 7300 gets launched. A clear successor to the 7200 right. *Right?* *Wrong!* It goes a full generation back to ARMv8 CPU cores. Meanwhile, the GPU is a generation newer but half the size. It's also now TSMC N4 instead of the slightly more powerful TSMC N4P. The Dimensity 7025 also launches in Q2 2024, which is an overclocked 7020. Perfectly fine. So 700x bumps are for overclocks noted. So remember: An overclocked SoC gets bumped by 5. A naming convention introduced right this year, 2024. *A overclocked SoC gets bumped by 5.* Q3 2025: Dimensity 7350 launches, an overclocked 7200. Wait, what? Yes: The Dimensity 7350 is based on the same silicon as the 7200, not as the 7300. We're right back to where we started, TSMC N4P process, ARMv9-A CPU cores, Mali-G610 MC4 GPU. Just clocked a bit faster. This thing should have been called 7205. It would have made perfect sense. 7250 would have gotten a pass. 7350 is just madness. Welcome to 2025! This year will be better, right. *Right*? We start of right with the Dimensity 7400. Ah, finally a new proper flagship for the 7000 series. Wrong. It's an overclocked 7300. By now old ARMv8 architecture, tiny GPU. So yes: An overclock is now marked by either 5, 100, or 150. Take your pick. Q2 gives us the Dimensity 7060. Overclocked 7050, probably? No, it's an overclocked *7020*. So apparently you can also just skip some numbers and bump by 40 to mark an overclock. Fun fact: The 7060 is a 2025 SoC with Wi-Fi *5*. So not 7. Not 6E. Not 6. Wi-Fi 5. From 2013. Q3 2025: Dimensity 7360. Overclocked 7350 right? Wrong, it's an overclocked 7300. For who's keeping track: You can mark an overclock now by either bumping by 5, 40, 60, 100 or 150. Then we arrive at our current point, the Dimensity 7100 launch, just in the last days of Q4 2025. Silently, because I also would be ashamed of this mess. It's an... new SoC? I mean it's old, almost ancient: TSMC 6nm, ARMv8 (4x Cortex-A78, 4x A55, Mali-G610 MC2), 32-bit LPDDR4X. It kind on resembles at Dimensity 7300 or 7400 with a generation older GPU. But I can't find this exact combination anywhere. This can't be how you design a new chip in late 2025, right? I have to be missing something. Let's end on that total note of confusion. **TL;DR 2**: MediaTek gave up after SoC number 3, after less than half a year, and now just YOLOs the 7000 series numbers. And remember: *Always* mark you overclocks with either bumping by 5, 40, 60, 100 or 150. \\----- I like to hate on Qualcomm and their cringe \"Gen\" naming. I *despise* their \"s\" naming, in which a 7s chip is worse than a 7 series chip - and often way worse, hiding the huge difference for regular consumers. But MediaTek's 7000 series is just an unmitigated mess I believe even they themselves gave up on.",
        "comments": [
            {
                "raw_content": "Ya know, I'll give it to you for calling this out: it's been a long time since I stopped trying to make sense of their naming scheme and I hadn't realized how annoying that it's been to make new feel this way.",
                "author": "zakats"
            },
            {
                "raw_content": "Jesus christ this is brutal. We pick on AMD and Intel a lot for their bad names, and Qualcomm sometimes too with the X Elite naming, but those are at least mostly internally consistent. Core Ultra 200 series? Kinda weird but like, 200U = MTL-U refresh, 200V = Lunar Lake, and 200H / HX = ARL. You at least know what you're getting. Ryzen 300 series? Also a bit odd IMO to have the Ryzen 9s in the \"middle\" of the pack with the HX 370 and HX 365, but there's at least a clear progression up in both CPU and GPU performance for most models. The 385 having less CPU cores than the 365 and 370 is weird but it's at least making up for it with quad-channel RAM. X Elite Snapdragons? Maybe just weird because we're not used to them yet, it's only been one generation. The X1E, X1P, X1 segmentation makes sense, and the numbers that follow at least seem to climb in a way that somewhat indicates things have improved as you go up. I hope 2nd-gen just increments that first number by 1 and leaves the rest mostly alone. X2E, X2P, and X2 will work fine. I get the feeling Mediatek is just rolling a set of D10s and flipping a coin to generate these.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "> But MediaTek's 7000 series is just an unmitigated mess I believe even they themselves gave up on. Confusion is the point. Their goal is to pass off old chips they made years ago as \"brand new midrange chips\" The more they confuse general people, the more it will sell. >making it immediately questionable what the 6000 series is doing at all. Dimensity 6000 is for their Cortex A76 processors and nothing else. Cortex A78 is Dimensity 7000. Cortex A76 is a core from 2018 - it's already 8 years old. But people keep buying those D6000/Helio G phones, so I guess it works out.",
                "author": "steinfg"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Qualcomm Snapdragon X2 Plus series leaked, featuring X2-45 Adreno GPU",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "| GPU | Shaders| Clock | 3DMark SNL | | :- | :-: | :-: | :-: | | X1-85 (4.6 TFLOPS) | 1536 | 1.5 GHz | 2500 | | X1-85 (3.8 TFLOPS) | 1536 | 1.25 GHz | 2100 | | X1-45 (2.1 TFLOPS) | 768 | 1.4 GHz | 1200 | | X1-45 (1.7 TFLOPS) | 768 | 1.1 GHz | 1000 | | X2-90 (Extreme) | 2048 | 1.85 GHz | 5600 | | X2-90 | 2048 | 1.7 GHz | 5100 | | X2-45 | ? | ? | ? | | Apple M2 | 1280| 1.4 GHz | 2600 | | Apple M3 | 1280 | 1.6 GHz | 3000 | | Apple M4 | 1280 | 1.7 GHz | 4200 | | Apple M5 | 1280 | 2.2 GHz | 5400 | | Radeon 890M | 1024 | 2.9 GHz | 3500 | | Arc 140V | 1024 | 1.95 GHz | 3300 | Anyone hazard a guess about the specs of the X2-45 ?",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": ">Qualcomm has shared new performance data \\[...\\] with the press How is that a leak?",
                "author": "fntd"
            },
            {
                "raw_content": "I actually can't believe that are going that low with this die. It supposedly is 6+6 and they are going 2+4 for the lowest SKU?",
                "author": "DerpSenpai"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I Tested The New 2026 QD-OLED for Gaming - Huge Improvements Incoming - Monitors Unboxed",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's very likely that my next upgrade is going to be an OLED monitor. I can get a first gen Philips Evnia for about 550€, and so far nothing seems to be worth the extra money to be honest.",
                "author": "mpampis_t"
            },
            {
                "raw_content": "This is a review of the 5th Gen QD-OLED panel as featured on the new [ASUS ROG Swift PG32WCDN](https://tftcentral.co.uk/news/asus-rog-swift-pg34wcdn-unveiled-with-34-360hz-5th-gen-qd-oled-panel) and [MSI MPG 341CQR X36](https://tftcentral.co.uk/news/msi-announce-the-mpg-341cqr-x36-with-34-ultrawide-360hz-5th-gen-qd-oled-panel). The summary: - These 2026 QD-OLED panels now feature the V-Stripe ([a.k.a. \"True RGB\"](https://tftcentral.co.uk/news/samsung-display-announce-mass-production-of-new-34-qd-oled-panel-with-v-stripe-sub-pixel-layout)) Sub-Pixel Layout. Text quality is \"effectively identical to LCDs of the same pixel density\", by far the biggest upgrade from these new panels. As described by Tim, there's no \"green and pink fringing at the top and bottom of text edges\" from older QD-OLED panels, and there's also no \"horizontal shadowing\" from W-OLED's \"RWBG & RGWB pixel layouts\". - Screen coating doesn't raise black levels as much as 1st and 2nd generation QD-OLED, but the issue still persists. A 4th Gen Tandem WOLED panel with a \"TrueBlack\" screen coating handle black raise the best, although the coating on those panels is far glossier than the one found on QD-OLED. Tim prefered the coating of 5th QD-OLED over the \"True Black\" 4th Gen Tandem WOLED. - HDR brightness values with their APL (Window) values, according to Tim's testing: \"Around 300nits\" at 100%, \"Around 520nits\" at 10%, \"Around 1300nits\" at 2%. SDR brightness can go up to 307 nits. - 5th-Gen QD-OLED 3440x1440 Panels now feature a 360Hz refresh rate. Tim highlighted the better compatibility with 4x MFG DLSS Frame Generation than with an older 175Hz Panel. - Samsung's aggresive ABL is still present on these new panels, but both ASUS and MSI have added some hacks in their OSDs to try to work around the aggresive ABL. Monitors Unboxed will touch on this in the future, but [HDTVTest already has an excellent video on the MSI's hack implementation](https://www.youtube.com/watch?v=tN9P2TaU0vg). - EDIT: From the TFTCentral articles that I shared at the beginning, both monitors share the same Semi-Glossy coating (despite the marketing name used by ASUS and MSI), an 1800R curve, improved panel hardness from 2H to 3H, VESA DisplayHDR TrueBlack 500 certification, \"factory calibrated Delta<2 accuracy\", 2x HDMI 2.1 ports and a USB-C Type C port with 90W of Power Delivery. The MSI monitor features a single DisplayPort 2.1, UHBR13.5-tier port at $1,099. The ASUS features a single DisplayPort 2.1, UHBR20-tier port with no announced MSRP. Overall, I'm really glad that text fringing seems to be solved on both 5th Gen QD-OLED and [Tandem WOLED RGB-Stripe monitors](https://tftcentral.co.uk/news/lg-display-announce-a-new-27-4k-oled-panel-with-rgb-stripe-layout). Unlike the RGB-Stripe 4th Gen Tandem WOLED which have brightness levels comparable to 1st Gen QD-OLED (1000nits@2% APL, 500nits@10% APL, 250nits@100% APL), 5th Gen QD-OLED will be far brighter while having a (mostly) similar text quality, from the info that we have so far. For those interested on more monitor reviews that are not from the usual sources (Monitors Unboxed, TFT Central, HDTVTest), you can wait for a future review from chinese reviewer [小雪人评测](https://www.youtube.com/@%E5%B0%8F%E9%9B%AA%E4%BA%BA%E8%AF%84%E6%B5%8B/videos) to check how text-fringing shows up on more complex chinese characters as well as Stroboscopic Visibility Measure (SVM) testing and a tear-down of the monitors.",
                "author": "campeon963"
            },
            {
                "raw_content": "Can't wait to get this generation in 2 years on sale. The text rendering issue is huge for me, as I don't see value in 4k at this size.",
                "author": "Kyrond"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "UnifyDrive UP6, UC450 PRO and UC250 NAS Revealed",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Worst time for a new NAS",
                "author": "iwannasilencedpistol"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Official golden cup trophy I got at Nintendo world in Tokyo.",
        "score": 52,
        "text_content": "You can buy it only there and I couldn’t resist to get it",
        "comments": [
            {
                "raw_content": "Awesome, dude! Enjoy it!",
                "author": "bubushkinator"
            },
            {
                "raw_content": "It looks to be decent quality. What material is it made of?",
                "author": "vruchtenhagel"
            },
            {
                "raw_content": "Edit: it’s in Osaka,not in Tokyo",
                "author": "MindPrize1260"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "(Concept) GameShare allows for Nintendo Land to be brought to Nintendo Switch 2",
        "score": 134,
        "text_content": "As someone still holding on to hope that Nintendo Land will come to Nintendo Switch, I was thinking about how GameShare finally technically enables Nintendo Land to be brought to the system for games that required the Wii U GamePad. Specifically, I lovedddd Luigis Ghost Mansion and that's the only minigame I really want. In theory, a Switch 2 could have the TV mode with people using the JoyCons, and a Switch/S2 would receive the Ghost display via GameShare. Anyone else still want Nintendo Land ported over badly? 😅",
        "comments": [
            {
                "raw_content": "As soon as they announced game share...I have been hoping.",
                "author": "Flamin-Ice"
            },
            {
                "raw_content": "This could be a solution for both Wii U and DS/3DS games so it could be worth it pursuing, although I think Nintendo would be wise to fear the backlash about \"you need a second Nintendo Switch to play these games!!\" because the internet would go crazy for a while. I'd love for it to happen tho.",
                "author": "suentendo"
            },
            {
                "raw_content": "The people yearn for the Wii U...",
                "author": "Vanilla_Baunilha"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I know everyone loves Goldeneye, but I'd love to get these games added to the GameCube emulator.",
        "score": 252,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nightfire multiplayer was so goated",
                "author": "Chewbacca319"
            },
            {
                "raw_content": "Things that will never happen in a million years. Goldeneye is pretty much the only licensed game capable of overcoming the countless hurdles to get added to NSO",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "Nightfire is everything to me 👏👏👏👏👏",
                "author": "Nintotally"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Don’t miss Kirby Air Riders",
        "score": 249,
        "text_content": "At first, I was quite skeptical about this game. I'd never played Kirby Air Ride, didn't know its specifics, and thought: why do they release another racing exclusive same year with Mario Kart World? I didn't had a Switch 2 during playtests, so I based my opinions on the reviews of those who had played it. And the vast majority of them were negative. I saw GIFs showing completely uncontrollable cars darting around the map. It seemed like a trinket. How wrong I was. A month ago, I bought a Switch 2, finished Donkey Kong Bananza (and, aside from the destructibity, I was completely unimpressed). I'm still wary of MKW, but a few days ago I finally decided to give Kirby Air Riders a try. This is a fantastic game, and I never knew I'd always been dreaming of a game like this. It's crazy, it's dynamic, it's vibrant, and simply stunning. The pure gameplay is superb. Huge praise to Sakurai: this is a game made with a huge love that feels right from the start. Right now, it's the best Switch 2 exclusive.",
        "comments": [
            {
                "raw_content": "It has become my favorite sw2 exclusive! I’ve always been a huge fan of mariokart but air riders has somehow surpassed it and I’ve never played a Kirby game.",
                "author": "Mrofcourse"
            },
            {
                "raw_content": "I'd try it out if there was a game trial or Nintendo allowed returns if the game was played less than 2 hours. I'm just not going to risk $80 on a game I dont know if I'll like or not.",
                "author": "dumbledwarves"
            },
            {
                "raw_content": "It’s too hectic and insanely fast paced for me. A lot going on and I just don’t want to keep out with it, but I can see why many do like the game.",
                "author": "Mrslyyx1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sure i’m not the only one like this.",
        "score": 38,
        "text_content": "Not touching it until the upgrade.",
        "comments": [
            {
                "raw_content": "Where's my Trials Rising Switch 2 Edition at Ubisoft.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "This was me but I couldn't wait anymore so I started it on the 1st of the year.",
                "author": "3ehsan"
            },
            {
                "raw_content": "Nintendo: We know you guys were hyped for Xenoblade NS2 updates, so instead we’re bringing you a Pikmin 4 Switch 1 update and an Animal Crossing NS2 edition. lol",
                "author": "Longjumping-Mud-3203"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Although I don’t expect it to be common, can we expect at least a few more 120fps first party games in the Switch 2’s lifespan?",
        "score": 73,
        "text_content": "While I understand that Metroid Prime 4 may have benefited from the fact that it was initially developed for the Switch 1 hardware, essentially giving it a ton of headroom on the Switch 2 in order to be able to hit 120fps, I really hope we get at least a few more titles that can hit this since I think I could significantly enhance the overall feel of certain games. The first one that comes to mind is whatever the next mainline Splatoon game is. Sure, 60fps is fine but when it comes to the chaotic nature of Splatoon, having the game running at 120fos would really give the player the edge in terms of soaking in all of the action happening on screen. I also think that in my limited experience playing games at 120fps, is lot less of how it looks and more about how it *feels*. What I mean by that is, the responsiveness that you get out of something like gyro controls or even mouse aiming, (if that’s supported) would make the game feel insanely response and even more enjoyable to play. I stand pretty strongly by the fact that Splatoon 4 would actually have a very tangible benefit whereas maybe a lot of other games it might seem like overkill. What games do you think would benefit from having a 120fps mode besides the fact that it’s more than 60, games that would maybe benefit from such?",
        "comments": [
            {
                "raw_content": "Lowkey don’t even know why they put a 120fps screen on the system other than for a “look at what this device is theoretically capable of.” I’m perfectly content with first party games running 1080p 60fps in handheld, 1440p 60fps on the dock, with demanding third party games being able to hit 40fps consistently without sacrificing fidelity. I think most games will target 60fps but yeah I’d love for a game like Splatoon 4 to have a 120fps option, think that could be big for Smash bros too. Anything that’s super competitive should have the toggle option with it being known you’re sacrificing visuals significantly",
                "author": "mewtatesyt"
            },
            {
                "raw_content": "Splatoon 4 please. I don’t really see how they could improve splatoon’s art direction and graphical fidelity. Yes there will be upgrades like draw distance and backgrounds not looking all flat and characters moving at 2fps etc.",
                "author": "Fun_Bridge_9869"
            },
            {
                "raw_content": "VRR, 40fps, etc. There’s a lot more versatility to having a 120hz screen than just pure 120fps gameplay.",
                "author": "Keaten88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo have renewed their trademark for Mario Tennis Ultra Smash. Can we please use this opportunity to finally put to bed the idea that trademark renewal means anything is going to happen with a game?",
        "score": 191,
        "text_content": "[https://mynintendonews.com/2026/01/03/nintendo-has-trademarked-zelda-tri-force-heroes-and-mario-tennis-ultra-smash/](https://mynintendonews.com/2026/01/03/nintendo-has-trademarked-zelda-tri-force-heroes-and-mario-tennis-ultra-smash/) Obviously, Ultra Smash is not and never will get any sort of rerelease or major push from Nintendo. There is already an infinitely superior Mario Tennis game in Aces and there will be a further new game next month. Ultra Smash will most likely never be mentioned anywhere by Nintendo ever again. In other words, this trademark renewal clearly, clearly means absolutely *nothing* in terms of any sort of rerelease of the game. So, can we please finally learn the long-overdue lesson that trademark renewals just happen from time to time and do not indicate 'something is happening'?",
        "comments": [
            {
                "raw_content": "The only time I've ever seen I trademark renewal mean something was for a shadow of the Colossus 2018.",
                "author": "shadow0wolf0"
            },
            {
                "raw_content": "A new sucker is born every day and children always want to post something. It’ll happen for eternity. Anyone with knowledge of the industry knows these are almost always nothing burgers.",
                "author": "FamiliarWithFloss"
            },
            {
                "raw_content": "Not sure if this is how it works, but don't they have to do this to protect the titles/IPs?",
                "author": "Phos-Lux"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Foundry Games of 2025: Oliver Mackenzie's Top 5 is all Switch 2 games",
        "score": 129,
        "text_content": "He has great taste!",
        "comments": [
            {
                "raw_content": "Great video, worth watching. Happy that Fast Fusion made it into his top-5 list - that is a really fun game with a fantastic sound track. Probably the closest we'll get to a new F-Zero for a while! For those who can't/don't want to watch right now, this is his list: 1. Mario Kart World 2. Donkey Kong Bananza 3. Fast Fusion 4. Kirby Air Riders 5. Metroid Prime 4: Beyond",
                "author": "mrmivo"
            },
            {
                "raw_content": "Love DF!! Love my switch 2!",
                "author": "kingkja"
            },
            {
                "raw_content": "Impressive, very nice. Let's see Miles Mackenzie's collection.",
                "author": "Actual-Toe-8686"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Alleged First Look at The Sims Project X Character Design",
        "score": 168,
        "text_content": "Published by SimsCommunity. [https://simscommunity.info/2026/01/04/the-sims-project-x-character-leak/](https://simscommunity.info/2026/01/04/the-sims-project-x-character-leak/)",
        "comments": [
            {
                "raw_content": "It looks like Fortnite? Huh? Have you seen the style of Sims 4? This looks like that",
                "author": "JRedCXI"
            },
            {
                "raw_content": "People just call anything remotely cartoonish Fortnite lol. This is the same art style since the second game.",
                "author": "HearTheEkko"
            },
            {
                "raw_content": "There's a pretty big chunk of Sims players who like hyper realism with detailed textures so this may not be what they were wanting, but I think it's fine. It looks like a more polished Sims 4. Personally the two things I want most out of the next Sims game are prettier lighting and reduced simulation lag.",
                "author": "getittogethersirius"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Sims 4's 21st Expansion Pack, Royalty & Legacy, is rated in South Korea",
        "score": 40,
        "text_content": "The next The Sims 4 Expansion Pack was rated in South Korea's Rating Board. [https://simstime.net/2026/01/04/confirmado-the-sims-4-legado-realeza-e-a-proxima-expansao/](https://simstime.net/2026/01/04/confirmado-the-sims-4-legado-realeza-e-a-proxima-expansao/)",
        "comments": [
            {
                "raw_content": "Time to download wicked whims and recreate the Hapsburgs. Roll tide.",
                "author": "Zen_Galactic"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Flag Resynced Domain Found",
        "score": 487,
        "text_content": "Source: https://xcancel.com/i/status/2007430890939359386 This follows the Prince of Persia Domain.",
        "comments": [
            {
                "raw_content": "Hoping for a reveal next week I really wanna see how it looks and compares to the original",
                "author": "ApprehensiveChair528"
            },
            {
                "raw_content": "shadow drop it ubisoft it'll sell gangbusters",
                "author": "skpom"
            },
            {
                "raw_content": "Not gonna lie, getting Prince of Persia and this in the first few months of the year would be a hell if a way to start a great gaming year!",
                "author": "Com_Raven"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Clive Barkers Demonik could be returning??",
        "score": 102,
        "text_content": "So this has been going around tik tok for acouple weeks but Allen Covert was recently at an event talking to fans about Grandmas Boy. Demonik was brought up. He talked about history of getting the game for the film and Majesco, its publisher, going under soon after. Which resulted in the game being cancelled. He has stated that the code for the game may have recently been found. With the 20th anniversary of Grandmas Boy being this year they are gonna see about getting the game finished up and released. This would be cool if it comes to fruition. https://www.dailydot.com/entertainment/demonik-fictional-video-game-from-grandmas-boy/?amp",
        "comments": [
            {
                "raw_content": "I'd never heard of this game so I Googled it and the first result is a post from four years ago on this very subreddit alluding to vaguely the same thing lol [https://www.reddit.com/r/GamingLeaksAndRumours/comments/mpbm37/cancelled\\_demonik\\_returning/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/mpbm37/cancelled_demonik_returning/) I always love a good cancelled-game-makes-badass-return story but I dunno about this one...",
                "author": "ThatIsAHugeDog"
            },
            {
                "raw_content": "I hate violence, but drugs ARE BAD.",
                "author": "Ddrmstr00"
            },
            {
                "raw_content": "Come on Clive barkers undying remaster 🎲",
                "author": "temporary_location_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Q1 2026 Tech Support Thread",
        "score": 10,
        "text_content": "Welcome to the r/Intel Q1 2026 PC build questions, purchase advice and technical support megathread — if you have questions about Intel hardware, need help with a purchasing decision, have a PC build question or require technical support, please read this post in full, as the majority of issues or queries can be resolved or answered by trying the steps outlined in this post or visiting one of the recommended websites, subreddits or forums listed below. Please remember that r/Intel is not a technical support, purchase advice, or PC building help subreddit. r/Intel is community-run and does not represent Intel in any capacity unless specified. You may want to consider the official Intel Community or contact Intel support directly The Intel Community and Official Intel Insiders Community Discord servers are also available to ask questions, including PC build questions, purchase advice, and tech support questions with other Intel users and PC enthusiasts. You may also want to consider the following subreddits, websites, and forums, which may be more appropriate for your question or issue and may increase the chances of getting a helpful response. PCPartPicker: PCPartPicker provides computer part selection, compatibility, and pricing guidance for do-it-yourself computer builders. Assemble your virtual part lists with PCPartPicker, and we'll provide compatibility guidance with up-to-date pricing from dozens of the most popular online retailers. We make it easy to share your part list with others, and our community forums provide a great place to discuss ideas and solicit feedback. r/buildapc Planning on building a computer but need some advice? This is the place to ask! It is a community-driven subreddit dedicated to custom PC assembly. Anyone is welcome to seek the input of our helpful community as they piece together their desktop. r/pcmasterrace Welcome to the official subreddit of the PC Master Race / PCMR! All PC-related content is welcome, including build help, tech support, and any doubts one might have about PC ownership. You don't necessarily need a PC to be a member of the PCMR. You just have to love PCs. It's not about the hardware in your rig, but the software in your heart! Join us in celebrating and promoting tech, knowledge, and the best gaming, study, and work platform that exists. The Personal Computer. OBS (Open Broadcaster Software) Forums: Discussion forums for OBS Studio, the free and open source software for video recording and live streaming. r/overclocking All things overclocking go here. Learn to overclock, ask experienced users your questions, boast your rock-stable, sky-high OC, and help others! r/techsupport Stumped on a tech problem? Ask the community and try to help others with their problems as well. ASRock Forum: Wanna discuss or find out something for your ASRock products? Come and join the ASRock worldwide forums to chat with ASRock global users! ASUS Republic of Gamers (ROG) Forums: Discuss and discover the best ways to make the most out of your ROG gear. MSI Global English Forum: Need more people to discuss with? Click here to find help. r/buildapcforme A subreddit dedicated to helping those looking to assemble their own PC without having to spend weeks researching and trying to find the right parts. From basic budget PCs to HTPCs to high-end gaming rigs and workstations, get the help you need designing a build that precisely fits your needs and budget. r/GamingLaptops The hub for gaming laptop enthusiasts. Discover discussions, news, reviews, and advice on finding the perfect gaming laptop. r/SuggestALaptop A place for prospective laptop buyers to get suggestions from people who know the intimate details of the hardware. READ BEFORE POSTING — READ BEFORE POSTING — READ BEFORE POSTING If you are experiencing any issues, including, but not limited to; games or programs crashing, system crashes or hangs, blue screens of death (BSoD), driver timeouts, system not starting, system freezes, data corruption, system shutting down unexpectedly, visual artifacts, lower than expected performance or any other issue, please read and try the following before making a post — the majority of problems can be resolved by trying the steps listed below. The suggestions below are not necessarily in any particular order. If a step has already been performed or is not relevant, please move to the next step. If your system won't power on, make sure all cables are plugged in and seated correctly, that the power supply is plugged into a working wall outlet, and any switches on the wall outlet and/or power supply are in the ON position. It's also worth checking your front panel connectors to make sure they are connected properly and trying a different wall outlet. If you have any power-related issues, like your system not starting, shutting down, sleeping, restarting, or waking from sleep, try to test with another power supply, as unstable voltages (such as on the 12V, 5V, 5VSB, and 3.3V rails) can cause a myriad of issues that can be inconsistent and hard to diagnose. Make sure your memory modules (RAM) are installed in the primary DIMM slots, as some motherboards will not POST (Power-on self-test) if the memory is installed in the secondary DIMM slots. The primary DIMM slots should be labelled on the motherboard or specified in the motherboard manual. If your system does power on, but won't get past the POST screen, please ensure your CPU, RAM, and GPU are installed correctly and try clearing the CMOS. This can usually be done by disconnecting the motherboard from power and removing the CMOS battery for a few minutes. Some motherboards may also have clear CMOS reset jumpers/buttons you can use; please consult your motherboard or system manual on how to clear the CMOS. If your system still won't POST, check if your motherboard has a Debug LED and consult your motherboard manual to check what step it's stuck on. Make sure your motherboard is compatible with the CPU you have — most AM4 and AM5 motherboards should have BIOS flashback, which will allow you to update the BIOS without needing a CPU or RAM installed. Consult your motherboard manual, as the BIOS flashback procedure will vary depending on the make and model. When using BIOS flashback, we recommend using a USB 2.0 drive that is 8GB or less and formatted as FAT32, as some implementations of BIOS flashback don't work reliably with USB 3.0 drives and/or USB drives that are larger than 8GB. Make sure your Monitor/TV is plugged into the HDMI or DisplayPort output from your graphics card and not the motherboard. If this still doesn't work, try a different Monitor/TV if you are using any HDMI or DisplayPort adapters, converters, or splitters. Remove these and use a direct connection, try switching between HDMI and DisplayPort, and try different HDMI or DisplayPort cables to rule out any problems here. For best results, always use certified HDMI or DisplayPort cables. Make sure you are running the latest software updates for your operating system, games, and applications. Scan your PC for any viruses or malware using Windows Security (formerly Windows Defender) or other reputable Anti-Virus or Anti-Malware solution, as malware, viruses, adware, and other unwanted software can cause crashes, freezes, hangs, and other performance, security, stability, and compatibility issues. Make sure you are running the latest Intel drivers. Some devices, such as laptops and handhelds, may have custom hardware IDs or other manufacturer changes, in which case, you may have to download drivers from the device manufacturer's support page. If you need to reinstall GPU drivers, we recommend using Display Driver Uninstaller (DDU) to perform a clean installation of the GPU drivers. A guide on how to use DDU can be found here If you have installed GPU drivers after using DDU, you may experience stutter in some games while the shaders are cached again. If Windows Update is replacing your GPU drivers (example of what that looks like here), please view the following on the steps you can take to prevent this from happening. If you are on Windows 10 or Windows 11 and experience flickering, stuttering, or brightness issues during gaming or video playback with hardware acceleration enabled, try disabling Multiplane Overlay (MPO), as some users have reported this has resolved their issues — more information on disabling MPO is available in this thread. If a game is crashing, freezing, not starting, performing poorly or having other issues, please verify and repair the game files through Steam, Epic Games Store, Ubisoft Connect, EA App, GOG Galaxy, Battle.net or whichever game client you are using. If a program is crashing, freezing, not starting, performing poorly, or having other issues, please reinstall the program or attempt to repair the installation using the program installer/uninstaller. If you are on Windows and are experiencing stuttering or lower than expected performance, make sure you are using the Balanced or High Performance power plan and restore them to their default values. This can be checked under Control Panel > System and Security > Power Options. Make sure you are using the latest BIOS, Firmware, and Drivers for your motherboard, laptop, desktop, and any other components and peripherals you have connected to your system. These updates often contain bug fixes, new features, and improve compatibility and interoperability. If you have any overclocks, underclocks, overvolts, undervolts, custom power curves or similar: revert everything to stock clocks, timings, voltages and settings, this includes disabling XMP/EXPO/DOCP — to do this, go into your BIOS and restore the factory settings — this is typically labelled 'Restore Default', 'Restore Optimized Defaults', 'Load Optimized Defaults' or some similar variation. If you are using other utilities like MSI Afterburner, you may also have to restore default settings in those utilities. If you are using Windows 10 or Windows 11, use the built-in System File Checker (SFC) and Deployment Image Servicing and Management (DISM) commands to check for any corrupt or missing operating system files and attempt to repair them. A guide is available here If you have a custom built PC, recently upgraded, started overclocking or want to know if your current PSU will support a hardware upgrade, please use one of the below PSU calculators and make sure the PSU you have (or intend to buy) can supply enough power when your system is under full load — If your PSU isn't able to supply enough power, you are likely to have issues starting your system and may experience system shutdown when under load. PSU Calculators: FSP — OuterVision — Cooler Master — Seasonic — Newegg — be quiet! — MSI — You can also add all your components into PCPartPicker and it will provide an estimate of wattage. Try to apply common sense to an issue, for example, if you have flickering on your TV or Monitor, try simple things like changing the HDMI or DisplayPort cable and port on the GPU and display you are using. If you've recently installed a mod and that game now crashes, uninstall that mod. If one of your memory modules is no longer being detected, is there any physical damage to the memory module, the DIMM slot on the motherboard, or the pins? Have you tried reseating it, etc... If you experience crashes, freezes, unexpected shutdowns, or just want to check if your system is stable, you can stability test your system with the utilities linked below. Remember that just because your system turns on, doesn't make it stable and that overclocking is not guaranteed and can vary depending on the setup you have and the silicon lottery of your CPU/GPU/RAM, you should always thoroughly stability test your system — many reading this post will have unstable systems and won't even know it. OCCT — OCCT is the only comprehensive stability testing software available. 20 years of experience have proved OCCT to be the community's software of choice in terms of stability and performance testing. CPU, GPU, Memory, VRAM, and Power supplies are tested in the most efficient and accurate way possible. If there's anything wrong, we'll find it and report it. OCCT includes many advanced features, ranging from per-core CPU testing to varying GPU loads, and much more. Prime95 — Prime95 has been a popular choice for stress/torture testing a CPU since its introduction, especially with overclockers and system builders. Since the software makes heavy use of the processor's integer and floating point instructions, it feeds the processor a consistent and verifiable workload to test the stability of the CPU and the L1/L2/L3 processor cache. Additionally, it uses all of the cores of a multi-CPU / multi-core system to ensure a high-load stress test environment. AIDA64 Extreme — AIDA64 Extreme is an industry-leading system information tool, loved by PC enthusiasts around the world, which not only provides extremely detailed information about both hardware and installed software, but also helps users diagnose issues and offers benchmarks to measure the performance of the computer. Furmark 2 — FurMark 2 is the successor of the venerable FurMark 1 and is a very intensive GPU stress test on Windows (32-bit and 64-bit) and Linux (32-bit and 64-bit) platforms. It's also a quick OpenGL and Vulkan graphics benchmark with online scores. FurMark 2 has an improved command line support and is built with GeeXLab. MSI Kombustor — MSI Kombustor is MSI's exclusive burn-in benchmarking tool based on the well-known FurMark software. This program is specifically designed to push your graphics card to the limits to test stability and thermal performance. Kombustor supports cutting-edge 3D APIs such as OpenGL or Vulkan. MemTest86 — MemTest86 boots from a USB flash drive and tests the RAM in your computer for faults using a series of comprehensive algorithms and test patterns. Bad RAM is one of the most frustrating computer problems to have, as symptoms are often random and hard to pin down. MemTest86 can help diagnose faulty RAM (or rule it out as a cause of system instability). As such it is often used by system builders, PC repair stores, overclockers & PC manufacturers. MemTest86+ — Memtest86+ is a stand-alone memory tester for x86 and x86-64 architecture computers. It provides a more thorough memory check than that provided by BIOS memory tests. Memtest86+ can be loaded and run either directly by a PC BIOS (legacy or UEFI) or via an intermediate bootloader that supports the Linux 16-bit, 32-bit, 64-bit, or EFI handover boot protocol. It should work on any Pentium-class or later 32-bit or 64-bit x86 CPU. SeaTools — Quickly determine the condition of the drive in your computer with this comprehensive, easy-to-use diagnostic. For more advanced SSD and HDD diagnostic utilities, please check the website of your SSD or HDD manufacturer, as they usually offer manufacturer-specific software to check the health of he drive, test the drive and update firmware, some examples include Samsung Magician, Western Digital Dashboard and the Crucial Storage Executive. Some motherboards, laptops, and desktops may also have built-in BIOS diagnostic utilities to stress test certain components or the entire system. Please consult your motherboard or system manual for more information. A truly stable system should be able to run any of these utilities or built-in diagnostics without any crashes, freezes, errors, or other issues. These utilities can help you narrow down which component(s) in your system are faulty, aren't installed correctly, or have unstable overclocks, underclocks, overvolts, undervolts, custom power curves, etc... If you require help using any of these programs, please read the help sections on each website or use Google and YouTube, as there are a plethora of guides and tutorials available. If you have tried all of the above and are still facing the same issue, please backup any important files/data and perform a reinstall/clean install of Windows, using a USB or DVD. Only use Windows ISO images that come directly from Microsoft. The latest Windows 10 and Windows 11 ISO images can be downloaded from the Microsoft Software Download page, and you can create a bootable USB or DVD by using the Media Creation Tool. It's not recommended to use utilities or programs that modify Windows or to use 3rd party, custom, or slimmed Windows ISO images, as these are non-standard ISO images, they could have viruses, malware, and may cause stability and compatibility issues. If you have done all the above steps and are still facing an issue, please follow the template below for submitting a request. The more detail you can include, the better. If you post something like 'pc crashes', don't list your PC specifications, what you've tried to resolve the issue or don't provide any helpful information, then don't expect a response, as there's not enough useful information to go on and it will be assumed you haven't read this post or tried any of the steps outlined above. Below is an example template you could use... Summary of the issue: Playing Warhammer 40,000: Space Marine 2 results in unexpected system crashes with no error messages, forcing me to manually restart the computer using the power button. What I have tried to resolve the issue: Performed comprehensive troubleshooting, including DDU-based reinstallation of driver 32.0.101.6989, BIOS update, extended hardware stress testing (10+ hours), Steam integrity verification, and system log analysis. Event Viewer indicates Intel.GraphicsSoftware.App errors correlating with crash events.\" System specifications: Operating System: Windows 11 23H2, OS Build 22631.5909 (to find OS build version, press the Windows Key + R and type winver) CPU: Intel(R) Core(TM) Ultra 5 245K, stock settings with no overclock. GPU: Intel(R) Arc(TM) B580 Graphics, stock settings with no overclock Motherboard: PRIME Z890M-PLUS WIFI with 2005 BIOS RAM: VENGEANCE® RGB 32GB (2x16GB) DDR5 DRAM 7000MT/s CL36 Storage: Samsung SSD 990 PRO 2TB PSU: Corsair Enthusiast Series™ TX750 — 80 PLUS® Certified Power Supply Display: MSI 27\" MAG 271QPX QD-OLED E2 240Hz OLED with Certified Ultra High Speed HDMI Cable If you are using a prebuilt PC or don't know your full specifications, please include the make and model of your system and as much information as you can, e.g, Dell XPS 13 Laptop (Intel Core Ultra 7 Processor 258V, Intel Arc Graphics 140V, 32GB LPDDR5X RAM, 1TB NVMe M.2 SSD with the latest 1.2.0 BIOS. Please include any logs, dump files, videos, screenshots, and images of the inside of your case and setup, as this will assist in answering questions relating to airflow, cabling, and component installation.",
        "comments": [
            {
                "raw_content": "This subreddit is in manual approval mode, which means that **all submissions are automatically removed and must first be approved before they are visible**. Your post will only be approved if it concerns news or reviews related to Intel Corporation and its products or is a high quality discussion thread. Posts regarding purchase advice, cooling problems, technical support, etc... will not be approved. **If you are looking for purchasing advice please visit /r/buildapc. If you are looking for technical support please visit /r/techsupport or see the pinned /r/Intel megathread where Intel representatives and other users can assist you.** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/intel) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Hi everyone if I'm upgrading my Dell vostro 3670 i5 8400 @32gb ram to an i7 9700, would I be able to upgrade the RAM it's still being ddr4? To 64 or 128?",
                "author": "Chelostyles"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "GMKtec EVO-2 MiniPC to feature Core Ultra X9 388H Panther Lake CPU",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder what the price will be? There are no bad products, just bad prices",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS Christmas 9800X3D/5080 build",
        "score": 117,
        "text_content": "I had 3 weeks till Christmas to wrap this present up for ASUS.. AMD 9800X3D, only the best! ASUS ROG 5080 Astral ASUS ROG Strix X870-A ASUS ROG Ryujin III WB Bitspower Cooling… Thanks for viewing, likes, comments and sharing!",
        "comments": [
            {
                "raw_content": "Very nice, not enough fans though ;)",
                "author": "Shazalamadingdong"
            },
            {
                "raw_content": "This is cool, but a build I would grow sick of after like.. December 26th.",
                "author": "Pretty_Challenge_634"
            },
            {
                "raw_content": "What case is that?",
                "author": "DennyHater"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS introduecs workstation B850M ACE motherboard with rotated AM5 socket",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BTX for ATX systems, better airflow across memory?",
                "author": "scielliht987"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "03 January 2026 - Weekly /r/REBubble Discussion",
        "score": 6,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Literally frozen in Reno. Haven’t seen a new listing in 89511 for weeks now. It’s effing weird.",
                "author": "thisseemslikeagood"
            },
            {
                "raw_content": "Will the trends from the last quarter of 2025 continue into the first quarter of 2026?",
                "author": "Self_Serve_Realty"
            },
            {
                "raw_content": "Prices are falling in West Houston, here's a house that's been on the market awhile and has dropped from $245k to $200k. Comps previously did support the $245k figure, there are a few houses sitting around that number in that neighborhood. [https://www.zillow.com/homedetails/12815-Ashford-Knoll-Dr-Houston-TX-77082/28323976\\_zpid/](https://www.zillow.com/homedetails/12815-Ashford-Knoll-Dr-Houston-TX-77082/28323976_zpid/)",
                "author": "Contemplationz"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Robodogs are becoming amphibious",
        "score": 580,
        "text_content": "...in addition of climbing impressively stairs (From robohub)",
        "comments": [
            {
                "raw_content": "Pretty sure I saw a black mirror episode about this",
                "author": "Glad-Weekend5395"
            },
            {
                "raw_content": "I mean this will help the first responders in many scenarios I suppose",
                "author": "brainlatch42"
            },
            {
                "raw_content": "I want an offroad vehicle designed like this. Just upsize it to an SUV size body, about 8 foot legs with regular truck tire feet, etc. It can squat down to load passengers, then zoom around on roads, walk through woods stepping over fallen trees, climb up hills.",
                "author": "GiantInTheTarpit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "My New Visual Reasoning Benchmark: LLM Blokus",
        "score": 45,
        "text_content": "I was bored this Saturday so I decided to create a new LLM Blokus benchmark. If you don't know, Blokus is a 4-player game where the object is control as much territory with your pieces as possible. Players must start by playing a piece that touches their starting corner, and subsequent moves must touch a corner of one of their pieces while not touching a side of any of their pieces. Each LLM plays as blue, and simply plays against 4 opponents who randomly select a legal move (though for now LLMs are bad enough for the presence of an opponent to not mean much). On each turn they are given 3 tries to make a legal move, after which they forfeit and aren't allowed to move anymore. The board is represented visually, and the LLMs make moves by selecting a piece, choosing how much to rotate it, and choosing the coordinates that piece's starred square will be placed on. This benchmark demands a lot of model's visual reasoning: they must mentally rotate pieces, count coordinates properly, keep track of each piece's starred square, and determine the relationship between different pieces on the board. I think it will be a while before this benchmark is saturated, so I will be excited to evaluate new models as they come out. I score models by total number of squares covered, so the leaderboard is: 1. GPT 5.2: 18 2. Gemini 3 Pro: 15 3. Claude Opus 4.5: 5 4. Llama 4 Maverick: 1",
        "comments": [
            {
                "raw_content": "Really cool stuff. Cool ideas = Cool benchmarks = Progress",
                "author": "FuryOnSc2"
            },
            {
                "raw_content": "GPT scored the highest with that? In the video GPT did really bad and used the single-cell (the easiest to place late game) right near the start. The first two moves were fine but then it made awful decisions llama 4 started with the absolute worst possible move so I see why it scored low Clearly Gemini is making the best moves by far though and the results and scores are entirely due to allowing them to not move at all when they fail to make a valid move and not about their actual placement skill. I feel like if you did 100 games for each and didn't allow skipped turns then the results would be very different. Gemini is starting with more difficult pieces and moving into the free spaces better and is just clearly the best from this sample set but we'd need a larger sample size to know for sure.",
                "author": "Sixhaunt"
            },
            {
                "raw_content": "Neat",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is this sub just for complaining about AI now?",
        "score": 327,
        "text_content": "Genuine question. I remember when this sub used to be about how excited we all were. Edit: I’m not saying there aren’t reasonable complaints, but when that’s almost all there is…",
        "comments": [
            {
                "raw_content": "Officially this is a pro-AI sub, and we tend to remove posts that are negative and anti. Comments have more leeway. If you find something egregious, please report it.",
                "author": "Anen-o-me"
            },
            {
                "raw_content": "If it's on reddit and is decently popular it will turn into a complaint or politics spot eventually .",
                "author": "Setsuiii"
            },
            {
                "raw_content": "I saw someone bitching about AI the other day and looked at their comment history. Literally 10 months straight of daily comments complaining about AI. Mostly just calling it a scam or saying it doesn’t work. The most triggering posts for these people is when serious people suggest that AI is helping them do their job more effectively. Just look at any post regarding how AI is helping scientists. The comments are so predictable.",
                "author": "Deepwebexplorer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Surprising Claude with historical, unprecedented international incidents is somehow amusing. A true learning experience.",
        "score": 227,
        "text_content": "",
        "comments": [
            {
                "raw_content": "While reading Claude's response I started to imagine an android robot going through this, tilting its head while looking on the internet, then raising its head again to answer with all the right intonations. It's starting to feel kinda weird knowing we're not that far from something like this now",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "ChatGPT also continues to adamantly deny it. It’s hilarious. “The Trump tweet is fake”. “The maduro pic is fake”. “The USS Iwo Jima could never”. “He’s not captured but there’s been explosions” even prompting with web searches isn’t working 😂",
                "author": "UndergroundHQ6"
            },
            {
                "raw_content": "What judge will even see this case?",
                "author": "PlaceboJacksonMusic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "just saw my dad's youtube feed... its all AI slops now",
        "score": 309,
        "text_content": "90% of the contents are composed of AI generated footage with AI TTS narration some of those are some dog walked by a woman on the sea gets eaten by a seagull military strength comparison video contains footage of giant aircraft carriers when our country doesnt even have one video talking about how the ship hull door is the most dangerous part of a ship with all AI gen footage and scuffed narrating audio typical of AI narrator some military dog exercise where the dog jumps over a fence with its back legs directly penetrate the fence like nothing look im excited for the AGI hype train too but for the average joe theyre just being farmed for engagement/interaction without receiving any benefits whatsoever",
        "comments": [
            {
                "raw_content": "Agree, My uncle watches YT on his TV without connecting to account, yesterday I wanted to put on some videos of Elephants for my nephew to watch, 50 to 60 percent of the search results was AI, it was frustrating trying to sift through AI slop to find a good video",
                "author": "StrengthBig9170"
            },
            {
                "raw_content": "If ai slowly ruins social media to the point it being a confusing waste of time then it will have been money well spent.",
                "author": "Some-Income614"
            },
            {
                "raw_content": "My BF gets a nonstop slopfest whenever he used facebook or youtube. The creepiest part are the TTS videos that \"tell you how <insert type of person> are\", like some sort of brainwashing psyop that's supposed to get them to resonate with particular, made-up descriptions of types of people that are actually unhinged if you think about the words being said.",
                "author": "magistrate101"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "PlanoA3B - fast, efficient and predictable multi-agent orchestration LLM for agentic apps",
        "score": 26,
        "text_content": "Hello everyone — I’m on the Katanemo research team. Thrilled to launch **Plano-Orchestrator**, a new family of LLMs built for fast multi-agent orchestration. They are open source, and designed with privacy, speed and performance in mind. What do these new LLMs do? given a user request and the conversation context, Plano-Orchestrator decides which agent(s) should handle the request and in what sequence. In other words, it acts as the supervisor agent in a multi-agent system. Designed for multi-domain scenarios, it works well across general chat, coding tasks, and long, multi-turn conversations, while staying efficient enough for low-latency production deployments. Why did we built this? Our applied research is focused on helping teams deliver agents safely and efficiently, with better real-world performance and latency — the kind of “glue work” that usually sits outside any single agent’s core product logic. Plano-Orchestrator is integrated into Plano, our models-native proxy server and dataplane for agents. We’d love feedback from anyone building multi-agent systems. Learn more about the LLMs [here](https://huggingface.co/collections/katanemo/plano-orchestrator) About our open source project: [https://github.com/katanemo/plano](https://github.com/katanemo/plano) And about our research: [https://planoai.dev/research](https://planoai.dev/research)",
        "comments": [
            {
                "raw_content": "Thanks for this post! What benchmarks are these based off of? \"General\", \"coding\" and \"long context\" don't really mean anything without methodology. Have or will these models be evaluated on more traditional benchmarks? I'm not trying to take away from the work your team has done, but it's easier for the general public to take your models more seriously with more mainstream benchmark comparisons. Love to see competition in the space regardless, if the results translate to the more \"common\" benchmarks then this is very impressive!",
                "author": "intergalacticskyline"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The largest donor in the latest filing for Trump's super PAC? Greg Brockman, the president of OpenAI.",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump directs the government to fund AI companies, AI companies donate money to Trump. Totally legal in the US.",
                "author": "sckchui"
            },
            {
                "raw_content": "Getting on their knees early to secure that bailout",
                "author": "Romanian_"
            },
            {
                "raw_content": "Large companies just throw money at whoever is in power. Blame *Citizens United* for the corruption. In 4 years when orange man is gone, there’ll be a 25 million dollar donation to the next guy in short order.",
                "author": "FiresideFox05"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google’s Gemini 3.0 Pro helps solve longstanding mystery in the Nuremberg Chronicle - SiliconANGLE",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Seems super cool, but I'd like an independent expert to verify this. The original reporting was done by the GDELT Project, which aren't historians AFAIK.",
                "author": "pavelkomin"
            },
            {
                "raw_content": "Cool. Now how about using it for something useful in science or engineering, not bible shit?",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    }
]