[
    {
        "post_name": "Earn it",
        "score": 1251,
        "text_content": "<p>It’s been a long time since I’ve written a post here. I have recently been staying quiet and letting others carry the conversation, but some moments demand that we speak. This is one of those moments. I think many of us feel the same weight right now, and putting some of it into words may help us carry it or at least help me carry the weight I feel.</p> <p>Charlie’s death hit me hard. I know it hit many of you the same way. Our lives crossed paths. Because of this place I have faced threats, anger and isolation. We all have crossed paths with his voice and his message, and when someone like him is taken from us, it isn’t just another headline it feels personal. It forces us to look at our families, our lives, and to recognize how fragile it all is. What happened to him could have happened to any of us, and that truth is burdensome.</p> <p>Charlie was never about violence. He was about speaking, about engaging, about truth. He wanted peace. He wanted conversations, even when they were uncomfortable. He wanted people to think, to challenge, but not to hate. That’s what made him effective, and that’s why his loss hurts so deeply.</p> <p>In the days after his death, we’ve seen the usual two sides, worldwide we have seen compassion and friends we didn't know we had, but many others (often who we knew about) with cruelty, bitterness, and mockery. To me, this points to something bigger going wrong in our country. We have a mental health crisis that’s growing worse every year. People are isolated, families are broken, drugs and depression are everywhere, and anger has become a way of life. Too many people are drowning in hate because they don’t know love, don’t know God, and don’t know how to deal with the pain inside them. And when these voices are amplified, when they’re given platforms, they often become louder than the voices of peace and reason. That’s why so many cheer death instead of life. That’s why they call for violence instead of conversation. That’s the reality we’re facing, and it’s not just a political issue, it’s a human issue, a spiritual crisis, a challenge to our society. We have lost civics and civility. It has been abandoned by our schools, our neighbors and our society.</p> <p>Charlie warned us about this. He showed us that hate cannot drive out hate. It must be met with truth, with conversation, with faith, and with love. The people who mock, who rage, who act like our very existence is a problem they aren’t strong. They’re broken. And this fight isn’t just political, it’s spiritual. The world has become a place where anger feels normal and patience feels weak. But we know better. Love, conversation, and understanding have power.</p> <p>So what do we do now? For me, the answer is faith, family, and country. Faith first, because without God, we are drifting. God is our anchor when the world feels unstable, the compass that points us back to what’s right, the light that helps us see even when darkness surrounds us. Family next, because the real work, the real impact, begins at home. Be present. Be patient. Hold your children and families closer. Give them slightly longer hugs. Show them extra patience and compassion when you feel downtrodden, when your fuse burns a little too long. Your anger isn’t directed at them. They need your love most when the world feels darkest. Our children and families are the future of this country. If we teach them love, faith, and patience, we give them the tools to survive a world that often feels cruel and chaotic. And then country, because America is worth fighting for not with hate, not with blind rage, but with conviction, with service, and with a commitment to the values that built this nation. America is strongest when we put God first, keep faith at the center of our lives, and hold our communities together.</p> <p>Part of honoring Charlie is also taking responsibility as a community. This isn’t just about individuals, it’s about noticing the people around us who are struggling, reaching out to them, listening, offering support. Sometimes that means a quiet word. Sometimes it means helping someone get real help. If we can help even a few people before the darkness overwhelms them, then we’ve made a difference. That’s how we build resilience, and that’s how we carry forward the lessons Charlie tried to teach.</p> <p>We also need spiritual courage. It’s easy to feel overwhelmed by anger, frustration, or grief. It’s easy to see the brokenness around us and wonder if our efforts matter. But they do. Every act of patience, every conversation that seeks understanding, every gesture of love and service, they ripple out. They matter. They build a foundation for others to follow. They push back, in small but real ways, against the hate and despair threatening our communities.</p> <p>Charlie may be gone, but his message isn’t. His voice may be quiet now, but his work lives on in each of us. Every time we speak truth, every time we show patience, every time we hold our families close, and every time we put America first in how we live and lead, we carry his flame forward. That flame isn’t about anger. It’s about hope, strength, faith, and love. It’s about choosing life over despair, conversation over conflict, and love over hatred.</p> <p>I am well aware of those of you who think &quot;war&quot; or &quot;violence&quot; is the only answer. I cannot speak to that, but I can pray that violence or war is not what our country faces. That outcome will not be won by anyone and our country, that we love, will cease to exist. I trust in Trump and God that the avenues of our future will awaken a new peace and understanding from those who lie and speak ill of us. Biden, antifa, the Democrats and biased liberal media are covered in Charlie's blood.</p> <p>So let’s keep moving forward. With God. With family. With love for each other. With patience for the lost, compassion for the hurting, and courage in the face of challenges. With a commitment to strengthen our communities, protect our families, and address the mental health crisis that affects so many in silence. And with a love for America that never wavers.</p> <p>Je suis Charlie.</p>",
        "comments": [
            {
                "raw_content": "I disagree, doing nothing solves nothing. 90% corrupt government, a multi tier DOJ with liberal activist judges everywhere, how much more proof that it’s gone do we need. Have your families, know the world you are leaving for your kids. Many years, decades, my whole life, we’ve been peaceful and it’s only became worse. Society is at its worst in my lifetime right now, the ones you look to for hope and change are the elite, the snakes, the ones we all agree that are corrupt yet everyone continues to flock to them for savior. We The People must do it, forefathers predicted it, and now the widows battlecry was heard. MAGA I am biased as a combat veteran, I know what it takes, freedom is not free, just for most people their dues had been paid.",
                "author": "SquirreleeDan"
            },
            {
                "raw_content": "I'm sorry to say, but if anything, the fact they killed Charlie, means talking and debate is not very effective. We've been doing it for years. They are at the point where some of them kill a person the second they find out they're even moderately conservative. Before, they were ruining peoples' lives over it. We need action Edit: i agree with the replies.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "I appreciate the heart felt response from a man who has guided patriots.win through thick and thin.",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: The FBI, in coordination with state agencies, has formally opened investigations into multiple leftist organizations in Utah for possible advanced knowledge of the Charlie Kirk incident",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get those assholes! It’s very obvious he wasn’t working alone! You don't get to the point of shooting someone without support",
                "author": "Austin62Halo"
            },
            {
                "raw_content": "Death penalty for all.",
                "author": "Johnrgalt"
            },
            {
                "raw_content": "The fact this is a very real possibility is a major indication of how far we've truly fallen as a nation. Apparently wanting to chop one's vital appendages off is, surprise, surprise, a sign of major, severe mental illness. And maybe coddling these people, surprise, surprise, drives them further into madness and delusions of grandeur.",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Nurse at Children’s Healthcare of Atlanta who said “fuck his kids. Fuck his ancestors, especially the b*tch who birthed him” has been FIRED",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She was one of the worst. I’m glad she was fired.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Make sure her license to practice gets taken as well.",
                "author": "IncensedThurible"
            },
            {
                "raw_content": "Unless you keep track they will move next to you and become your problem. PS. You're local officials hate you just as much, just ask them, try to get them to disavow their anti-American staff, friends, memberships or bank accounts.",
                "author": "BrionK"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Everything about this is evil and retarded",
        "score": 228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since they're such devout, burqa wearing Muslims, maybe they should take a pilgrimage to Mecca in them.",
                "author": "Puppy528"
            },
            {
                "raw_content": "Chickens for K.F.C. vibes.",
                "author": "Roadcruiser2"
            },
            {
                "raw_content": "It keeps getting worse the longer I look at it 😵‍💫",
                "author": "PressF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - Speculation grows that Charlie Kirk’s assassin was tied to a leftist network after his transgender boyfriend followed someone posting “we did it” minutes after Kirk’s death, and multiple out-of-state cars were seen visiting the killer’s home weeks before the hit.",
        "score": 1373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RICO",
                "author": "TEXinLA"
            },
            {
                "raw_content": "WTF is wrong with Trump, declare Antifa a terrorist organization already.",
                "author": "Hamadryad"
            },
            {
                "raw_content": "We're gonna need more rope...",
                "author": "20MagnusKonrad20"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A family member of Lance Twiggs, who was the transgender “boyfriend” of Charlie Kirk’s assassin, Tyler Robinson says family cut ties with Twiggs due to his “hostility toward anyone supporting conservative or Christian values” and confirm Robinson lived with him.",
        "score": 1234,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have to have backyard discussions again. Bonfire talks. Talks in our basements. We have a problem.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It all just makes me very sad. To see such hate in this country towards us. We don’t deserve it.",
                "author": "HiimHillaryClinton"
            },
            {
                "raw_content": "Hang the shooter and his faggot furry fuckbuddy",
                "author": "Buff_cousin_Elroy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "For Charlie",
        "score": 801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Christopher Bell is a real American. God bless him and God bless Charlie.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The comments in the NASCAR sub over there are as vile and disgusting as you would expect",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Good to know there are still good racers out there. Dropped out about 10 years ago before the noose hoax happened.",
                "author": "SteelBallRun1890"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brian Krassenstein: \"The shooter was a hetero male, why are you blaming trans people? He was hetero because trans women ARE women\"",
        "score": 941,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This faggot is just rage baiting. Don't engage with him because it makes him more money.",
                "author": "sherlock2025"
            },
            {
                "raw_content": "Oh no.. it's retarded. (Krassenstein, not OP).",
                "author": "cpyder"
            },
            {
                "raw_content": "Krassenstien apparently followed the shooters furry trans boyfriend on Tiktok. He's literally friends with someone who was involved.",
                "author": "magamagashii"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The neighbor of Charlie Kirk’s assassin and his transitioning roommate spoke to the media today and confirmed it all: “I’ve never really seen anybody dressed all in black with a mask on.” “Random guys don’t hold hands and they definitely don’t kiss.”",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It appears at least SIX (6) Transgender individuals knew about this assassination before it happened, alluding to some network of trans cultists. This is Radical Transgender Terrorism.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The left is done, if we follow through. Hard and relentless and with no mercy. They will not survive this.",
                "author": "DrJosephWarren"
            },
            {
                "raw_content": "Imagine killing a husband and father so you can use a man's festering, colon-constructed, chronically infected wound to masturbate with without him crying to you someone hurt his feefees. These people are absolutely revolting in every way, shape, and form known to man. The swift enactment of the death penalty is almost too good for the likes of these men. In a once sane society, they would have already been buried in a shallow, unmarked grave",
                "author": "TheMrStone"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔎 Meet Virginia Barrera. She’s an immigration lawyer. “He did deserve to be killed.” “The world is a better place without Charlie Kirk.”—Her law firm website says, “the focus of her practice is to help those who are escaping violence.”",
        "score": 905,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She needs to be flipping patties tomorrow.",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "These aren't people. They are demons.",
                "author": "20MagnusKonrad20"
            },
            {
                "raw_content": "why do leftists risk losing their careers just to be petty and talk shit about a dead person? i don't get it. how retarded are these people really?",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another far left Trans account had prior knowledge of Charlie’s assassination. That’s now 6 transgenders that had prior knowledge of the murder. Where is the FBI?",
        "score": 1825,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn’t it all coordinated through their discord?",
                "author": "POTUS_DonnieJ"
            },
            {
                "raw_content": "Clearly there was some sort of Discord server where that faggot informed his tranny friends that he was going to do this. Find that server and have all of these cocksuckers hanged in Temple Square.",
                "author": "SouthernFriedFreedom"
            },
            {
                "raw_content": "Waiting for FBI to say, the suspect was known to us .",
                "author": "Realassman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Look what we have here… @krassenstein and @EdKrassen follow the alleged boyfriend of Charlie Kirk’s ass-ssin on TikTok. Why would they follow this account? Their following count is pretty low. 👀 For those questioning the validity, the account is public.",
        "score": 1275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Following since today or since before today? The former is a nothingburger since they're impression farmers.",
                "author": "MaxineWaters4Prez"
            },
            {
                "raw_content": "Can Elon find out when they followed? Reason being, if they followed today after the guy was revealed, they’re just trying to stay on top of things for whatever stupid commentary they have. If they followed at any point before today, that’s sus.",
                "author": "Tele_Plus"
            },
            {
                "raw_content": "More here https://x.com/iammissjinxed/status/1966965420029866189 https://x.com/TheShawnHendrix/status/1967004908240114126",
                "author": "GunToast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Abashed the devil stood and felt how awful goodness is”",
        "score": 764,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They don't like it if they aren't the victim.",
                "author": "IncensedThurible"
            },
            {
                "raw_content": "Are they being shot in the neck with a 30-06? No? Then I don't care.",
                "author": "USDMaga"
            },
            {
                "raw_content": "These motherfucking demons are lucky we are as patient as we are.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Less than 4 mos after the assassination of Abraham Lincoln, 4 co-conspirators of John Wilkes Booth were hanged by the neck until dead",
        "score": 1594,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rookie numbers. We already know of 6 troons that knew of “an event” ahead of time.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Most don't know that Lincoln's vice president and Secretary of State was also attacked the same day.",
                "author": "Brownwaterboys"
            },
            {
                "raw_content": "I'm not confident they will even execute the trigger puller in less than 20 years. Let alone all the others who knew ahead of time.",
                "author": "Wooster97"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HOLY CRAP! THOUSANDS of patriots showed up on Long Island, NY to “light up the sky” during a candlelight vigil for Charlie Kirk tonight A new movement has been born Great job organizing this, @kevin_smith45",
        "score": 1160,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# CHARLIE! CHARLIE! CHARLIE!",
                "author": "Mortal_Wombat"
            },
            {
                "raw_content": "This is Gen Z's 9/11.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Note the lit candles as opposed to cars and businesses.",
                "author": "mpb1213"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American Airlines has “REMOVED FROM SERVICE” pilots who celebrating the kiIIing of Charlie Kirk, the airline announced",
        "score": 1646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm old enough to remember when they reinforced the flight deck doors after 911 to keep the crazy people from entering the cockpit.",
                "author": "Herc130"
            },
            {
                "raw_content": "I was lifetime banned from American Airlines during vcovid for not wearing a mask. On a connecting flight that was less than 45 mins. I told them to fuck off and rented a car. Fuck them.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "They will probably quietly hire back due to the pilot shortage.",
                "author": "TrumpLandslide20201"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They are the ones poisoning the minds of our children",
        "score": 1457,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expose them all. Evil scum.",
                "author": "SneakyWino"
            },
            {
                "raw_content": "Teachers and professors are more hidden from reality than anyone else. That’s part of why education is such a joke now. The people who end up working in it have the least connection to reality out of anyone in society",
                "author": "TheEmperorProtects"
            },
            {
                "raw_content": "We let commies take over the schools and universities a long time ago and now we’re suffering the consequences. Home school until the infestation is dealt with. Save the new generations. The old brainwashed ones are lost.",
                "author": "ninabobby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’ve obtained an additional photo of Lance Twiggs, the transitioning roommate and lover of Charlie Kirk’s assassin, Tyler Robinson.",
        "score": 1033,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why they have the same shoes ...",
                "author": "bills_gash"
            },
            {
                "raw_content": "LOL Dickies used to be the the pride and joy of Texas and especially my home town of Bryan. Then they moved manufacturing to every shithole country in the world. Not even sure Dickies is still a Texas company any more, it hardly matters. We only see them as faggot sell outs. It is fitting to see their logo on some faggot freak wearing a stuffed animal on their head who wants to cut his dick off.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Fucking Furries. Those are the ones that should be banned.",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They don’t kill you because you’re a Nazi, they call you a Nazi so they can kill you.",
        "score": 1538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can call me a lot of things, but liar isn't one of them. So, boo hoo if words are too real for you.",
                "author": "12345SIX"
            },
            {
                "raw_content": "President Trump needs to start revoking broadcasting licenses from MSNBC and do RICO charges against Soros and other leftist groups. IDGAF about \"optics\" anymore after they murdered Charlie who was a moderate FFS. He was considered moderate for most of us even though we admired him because he was converting so many youth to MAGA.",
                "author": "possibletower"
            },
            {
                "raw_content": "They are the ones clamoring for socialism and communism, yet we are the Nazis ? Yes most of us are nationalists, but who the fuck of us are actual socialists ? These are the faggots who even teach the history classes and can't get their own bullshit straight. I guess this is what to expect from people who can't even figure out the difference between men and women. We are dealing with complete reality deniers. Not sure we can talk our way back to unity with traitors unwilling to observe physical truths.",
                "author": "StayoutOfit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daddy, why don't we burn down businesses...",
        "score": 950,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because White culture builds rather than destroys.",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "We have vigils, not riots.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It just feels like the actual peaceful protest are ignored more and more every day by the politicians and media.",
                "author": "BrookieDragon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Chips and Cheese] AMD’s RDNA4 GPU Architecture at Hot Chips 2025",
        "score": 58,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any word about rdna4 mobility gpus yet?",
                "author": "996forever"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China launches discrimination and dumping probes into US chips ahead of trade talks",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The first investigation would examine whether Washington had discriminated against Chinese companies in its policies on trade in chips. The second would look into suspected dumping of imports of some U.S. analog chips used in devices such as hearing aids, Wi-Fi routers and temperature sensors.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips and Cheese] Intel’s E2200 “Mount Morgan” IPU at Hot Chips 2025",
        "score": 27,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK hynix Completes World's First HBM4 Development and Readies Mass Production",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha remember 10 years ago when in context of desktop video cards it was \"just around the corner\" and would revolutionise whole segment, then all the talk about APUs using HBM en masse...",
                "author": "zghr"
            },
            {
                "raw_content": "Does anyone know why exactly there are almost no consumer devices that use HBM? When I bought my Radeon VII in 2019 I thought that its memory setup (16GB HBM2 at 1TB/s) would be the model for future GPUs and eventually laptops, consoles... everything. But today, literally all that HBM gets stuck into AI compute racks I get that it's expensive... but why not just charge more? There are people who will pay whatever it costs to get \"the best\" of anything. I'm sure they could sell it for a profit Is it just nvidia and AMD buying it all and they get to decide where it goes (because nobody else has any)?",
                "author": "JakeTappersCat"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Don't bother with the Bananza DLC. It's garbage.",
        "score": 1613,
        "text_content": "Really disappointed in Nintendo for releasing this rip-off DLC for Bananza for $20. There's no new content in it other than an empty DK island. No new Bananas to collect. No new enemies. No new fossils. No new bosses. The main gimmick is the emerald collection thing which is basically you going around the game smashing green coloured gold ore (they didn't even design emerald gemstones for a DLC about collecting emeralds.) This mode is fun for about 30 minutes before it becomes boring and repetitive. $20 for this when Silksong is an entirely new game for that same price? Come on, Nintendo.",
        "comments": [
            {
                "raw_content": "Such a shame they had so much potential they could have just thrown together some classic levels within the island or made it like any other layer included more classic elements like caves, snow levels aztec ruins etc Huge missed opportunity",
                "author": "profchaos111"
            },
            {
                "raw_content": "Wow DK island isn’t treated like another layer with its own bananas? That is nuts.",
                "author": "Longjumping-Math1514"
            },
            {
                "raw_content": "From the outside looking in, and comparing this to Odyssey, this feels like if Nintendo had made you pay for the luigi balloons mode.",
                "author": "buttsecks42069"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Where's the lie lol",
        "score": 2179,
        "text_content": "He said it, not me!",
        "comments": [
            {
                "raw_content": "No lies detected. OK but seriously at least follow through with your bitching, looking at you nintendo content creators.",
                "author": "Rare-Butterscotch864"
            },
            {
                "raw_content": "* Nintendo announces direct * People circlejerk themselves into insane and nonsensical expectations * People forget that they aren't the only person on the planet who plays video games and that other people like different games than they do * Direct finished * Overhyped circlejerkers get let down by reality and proclaim it to be the worst direct ever * Repeat a couple months later Same energy.",
                "author": "ababcock1"
            },
            {
                "raw_content": "It's funny because things really aren't any different than they ever have been. Like the Wii had tons of mediocre first party plastic accessories. I'd take swappable Air Riders Amiibo over a Wii Zapper any day. Also I swear to go, no one seems to be able to consider that they don't have to buy everything Nintendo puts out. Like if you're not happy with pricing or the product just don't get it out wait for a sale. FOMO shouldn't drive you to financial irresponsibility.",
                "author": "Electronic_Screen387"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me right now",
        "score": 1380,
        "text_content": "I have fond memories of Galaxy 2 from when I was 12 and I wanna play it in 4k.",
        "comments": [
            {
                "raw_content": "Tbh I might get it just because I never played them before. Despite the hate I imagine this will sell well because people like me, or younger kids in the new generation who never had a Wii, etc.",
                "author": "Waffel_Haus"
            },
            {
                "raw_content": "I mean, as someone who didn't have a wii I'll probably buy it too. That being said, it's healthy that people are criticizing the price, which is more than it should be worth for most people. I really hope it doesn't sell well and they learn their lesson, but of course that won't happen.",
                "author": "sontforgert23"
            },
            {
                "raw_content": "Metacritic has both of these games in the [top 5 games of all time](https://www.metacritic.com/browse/game/). Gonna be phenomenal to play them in 4K UHD",
                "author": "hypermog"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Looks like that's probably a wrap on Nintendo's 2025. Thoughts?",
        "score": 355,
        "text_content": "*second image is just Switch 2 exclusive games, so I didn't include Tomodachi life or rhythm heaven even though i'm super hyped for both of those.",
        "comments": [
            {
                "raw_content": "I think it's a pretty solid first year however I'm definitely REALLY hyped for 2026, the lineup is amazing and we're still gonna be getting more!",
                "author": "ThrowawayBlank2023"
            },
            {
                "raw_content": "Decent first year. DK bananza was amazing. Let’s see how good MP4 is",
                "author": "roccerfeller"
            },
            {
                "raw_content": "I'm hyped for Metroid Prime 4. I'll be playing Galaxy 1 and 2 again for sure, and DK was really good. This has been a decent half a year.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Persona 3 Reload demo has frame pacing issues so bad it feels almost nauseating to play",
        "score": 388,
        "text_content": "First, I want to start with the positives: in handheld mode the image quality is very clean. It seems to match the native resolution of the screen and the image does not appear to have many sharp edges, so there may also be some form of anti-aliasing. However, that's pretty much where the positive ends. First, the framerate is only 30fps, and for a game that is 90% small rooms and corridors where nothing happens, it's surprising that they could not achieve an higher frame rate, especially with Steam Deck being capable of running the game at 60fps with ease. Looking at far more demanding games like Cyberpunk 2077 or Star Wars Outlaws, I'm convinced this could have least reached a locked 40fps. That said, 30fps would still be easily acceptable on turn based RPG with very simple movement option, if it wasn't for the biggest technical issue of this port: frame pacing. To keep it short: this games stutter pretty much at all times, in any kind of scenario. In combat, moving the camera around, standing still. The only difference I've noticed is how much it stutters, as it goes from 'infrequent' stutters to 'omnipresent' stutters. Even worse, this game seems to have almost no motion blur applied, meaning that not only the game feels stutter-y to play, it also looks very, very uneven, as if it was running at a much lower frame rate. I play in handheld mode with the console relatively close to my face, and after 20 minutes of sprinting in Tartarus (the game's dungeon), I had to stop playing because I started having unpleasant eye strain. If you have not played the free demo on the eShop, GVG released a video yesterday highlighting how the game runs: [https://www.youtube.com/watch?v=\\_A-wUAfnts8](https://www.youtube.com/watch?v=_A-wUAfnts8) ATLUS, if you are reading this, please implement a proper frame cap in the game (and give us some option for motion blur). The game visually looks okay enough, but the frame pacing completely ruins the game. Or, if you can't fix this, at least provide an option for uncapped frame rate with VRR enabled in portable mode. Literally any other option would be better than releasing the game in this state.",
        "comments": [
            {
                "raw_content": "It looks like Atlus is using the built in Unreal Engine frame limiter which is known to be garbage.",
                "author": "Complete_Mud_1657"
            },
            {
                "raw_content": "Okay I hope they can improve this by launch. It seems to be targeting pretty high resolutions.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Incoming \"dev kits\" comments. Not, it's a bad port and that's not exclusive to Switch 2.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Clasics Virtual Boy is hilarious, and the reaction to it is a sad indictment of the modern gamer mentality",
        "score": 1376,
        "text_content": "This is funny. It's weird and it's silly and it's only going to be for a very small number of people, but it's mostly just a straight up hilarious thing to do. The Virtual Boy is arguably the most maligned, worst-selling, most embarassing misstep in Nintendo's history. The few games released for it (supposedly) aren't even very good. This is a fun, silly product for collectors and the curious to experience one of gaming's most memed about disasters. For the collectors, there's a $100 replica of the device; for the merely curious, there's a cardboard version for $25. I also don't see how they can stop people who don't have either device loading the games up and playing them on a regular screen if they feel like it. Basically, it's all a bit of silly fun aimed at a niche audience, and you don't need to get it if you don't want to. And yet, the reaction to it has been insane. People are up in arms about everything: the price, that you require NSO, that it's 'stealing a slot' from another console... And so many are *angry* about it all. It's an example of Nintendo's pure greed, of them shitting all over gamers, further evidence of the death of the old Nintendo we all knew and loved... But no it's not. This is absolutely classic Nintendo. Some weird, niche, out-of-left-field, announcement with an accompanying high priced plastic peripheral. This is what they've been doing their whole history - except that in this case, they're actually offering people an alternative at a quarter the price. I swear, if Nintendo had done the famous puppet skit today, the reaction wouldn't be, haha, that was funny, it would be people criticising the quality of the puppets, complaining that it stole time from announcements and dividing Reggie's salary by the time of the segment to calculate how much of 'our' money it wasted. I'm not saying publishers and manufacturers don't bear their share of the blame, but a big part of the reason so many people are so unhappy with modern gaming comes from gamers themselves and few things lay that bare more clearly than this announcement.",
        "comments": [
            {
                "raw_content": "Release the lost media zero racers",
                "author": "Bluebaronbbb"
            },
            {
                "raw_content": "Would I drop $100 on this glorified stand? No. But it's fun, weird and I'm glad Nintendo are bringing back a quirky bit of gaming history.",
                "author": "crocicorn"
            },
            {
                "raw_content": "I genuinely laughed at the audacity, I think it's cool they actually dared. A really fun idea. Am I paying $100 for it though? Hell no, but some people will and I'm happy for them",
                "author": "holdmypilsener77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is FFVII Remake Intergrade Really $39.99? Is There A Catch?",
        "score": 110,
        "text_content": "So after the Direct yesterday I went on the eShop to bookmark the games I was interested in and noticed that Final Fantasy VII Remake Intergrade was only $40, which is unbelievably low for a game of that quality That made me think that it was some error where the wrong price was entered and it would be fixed the following day, but nope I just saw a post on X saying that the game really is $40. But I don't understand, is there a catch or something I don't know about the game? How are they charging so little even compared to developers of similar games like Star Wars Outlaws or Cyberpunk 2077? Is the game shorter than I think it's going to be? Is this basically a free to start game where I have to purchase the rest of the story later? Mind you, Super Mario Galaxy 1 and 2 are $39.99 each. I know it's a older game, but to anyone who's played the game can you explain this to me? Serious discussion only please",
        "comments": [
            {
                "raw_content": "There is no catch, Square just wants to get as many people as possible into the series because if you do like it, you will have two more games to buy later (Rebirth and the eventual part 3). If you pre-order it now, you will also get the original FF7 for free",
                "author": "Charming_Ease6405"
            },
            {
                "raw_content": "I think the catch is that intergrade will leave you salivating for rebirth, which will probably go for full price. Intergrade is a full game in itself but is still only 1/3 of a project.",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "I think the catch is squeenix is trying to build some good will amongst new install bases, ahead of rebirths release (which reportedly underperformed as a PS5 exclusive) Regardless, remake is a fantastic game and this is a great price point",
                "author": "xavadar"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm in love with Prime 4's environments and how diverse they are.",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the third photo and the bridge ( the fifth ) photo are great",
                "author": "echoess84"
            },
            {
                "raw_content": "I'm really hyped for MP4 but desert part looks bit lame. Hope there's more in desert than I expected.",
                "author": "Pristine-Brush-1052"
            },
            {
                "raw_content": "And I really despise that fov",
                "author": "PjDisko"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dusk Golem: An announcement about Drakengard could be happening this month",
        "score": 150,
        "text_content": "According to Dusk Golem, he was told that the recent re-release of the Drakengard OST is tied to an announcement happening later this month, so it could show up either at a State of Play or the TGS. [source](https://i.ibb.co/QFBsGZws/1o1cml3c.jpg)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "If this is real, and that’s a big if, then the final boss better be a mean, fucked up, actually unfair rhythm game",
                "author": "Decimator1227"
            },
            {
                "raw_content": "Honestly, I have been wondering what Yoko Taro’s plans are going forward. *Especially* after Nier Reincarnation. There has been a marked uptick in outright Drakengard references in side/supplementary material, as of late. The FFXIV raids, Reincarnation having some very big lore deep cuts, and the Automata anime ending cameo was pretty surprising too. I wouldn’t be surprised if the next game is a direct Nier sequel in the Kingdom of Night, but is titled Drakengard. Given that like, most of the unique trappings of Drakengard as an IP (magic, dragons, angels etc.) should be around by now in the Nierverse.",
                "author": "MimeyWimey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Voice lines from the cancelled Beetle DLC for Spider-Man 2",
        "score": 114,
        "text_content": "Source: https://www.reddit.com/r/insomniacleaks/comments/1m8wwf7/beetle_dlc_miles_lines/ About a month ago, u/danoka29 on the r/insomniacleaks subreddit datamined Miles Morales voice lines from Spider-Man 2's cancelled Beetle DLC. It seems the DLC would have focused on Peter and Miles fighting an army of robots controlled by the Beetle. A bit of an older leak, but I thought it was worth posting here.",
        "comments": [
            {
                "raw_content": "It's a shame Sony forced them to rush this game out,and for what? It's probably the only worthwhile exclusive the PS5 has.",
                "author": "Curious_Chicken2317"
            },
            {
                "raw_content": "I don’t understand why this game is so hated on Reddit. It’s really good, I feel it should’ve been longer to flesh out the character arcs more, but besides Reddit everywhere else I’ve looked this game is loved. We get to play as venom and peter with the symbiote. It’s awesome",
                "author": "PresentationDull7707"
            },
            {
                "raw_content": "Can’t even finish a beetle dlc.",
                "author": "Lordlegion5050"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The official Instagram account for Cinepolis El Salvador methods that Bowser Jr., and Wario will be appearing in The Super Mario Galaxy Movie",
        "score": 165,
        "text_content": "[Source](https://www.instagram.com/p/DOhn-oICXml/)",
        "comments": [
            {
                "raw_content": "I don't care really about the casting decisions but Danny Devito as Wario would put me in a theater seat on day one.",
                "author": "NotTakenGreatName"
            },
            {
                "raw_content": "My guess is that they wrote that based on the spanish IMDB page for the movie, and as we know anyone can make shit up there. For anyone curious, here's the imdb \"plot\" translated: \"After defeating Bowser and saving Brooklyn, Mario and friends face a new threat: Wario, with Bowser Jr., conspires to take over the world. They must team up with Yoshi to stop this evil duo.\"",
                "author": "KekanKok"
            },
            {
                "raw_content": "Cinépolis El Salvador Tier 1 leaker???!????",
                "author": "Gabrielhrd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Full 450+ Digimon List Datamined (Digimon Story Time Stranger)",
        "score": 168,
        "text_content": "[There's a total of 452 Digimon](https://docs.google.com/spreadsheets/d/1TfV-n7XnBxIiOYieuGrS931HOVey1SehjRasgmCI7OM/htmlview?gid=0#gid=0) in the base game",
        "comments": [
            {
                "raw_content": "When compared to Cyber Sleuth's 341 Digimon roster, the following were cut: >!Sistermon Blanc, Sistermon Blanc Awakened, Sistermon Noir, Sistermon Noir Awakened, Hudiemon, Arkadimon Baby, Arkadimon, Arkadimon Champion, Arkadimon Ultimate, Arkadimon Mega, Arkadimon Ultra, Omnimon NX, Crusadermon NX, Gallantmon NX, Alphamon NX, Duftmon NX!< Following are Day 1 pre-order DLC: Agumon Black, Greymon Blue, MetalGreymon Blue, BlackWarGreymon, Gabumon Black, Garurumon Black, WereGarurumon Black, MetalGarurumon Black. They got vast majority Digimon back which is great.",
                "author": "TMaakkonen"
            },
            {
                "raw_content": "Frontier keeps getting weird rep choices. Nice to have the full Lobomon and Agunimon lines but why is Ranamon also randomly included and not the other main kids? Also if im reading the doc right the Agnimon evo line is Agni>Alda>Vrita which is reversed? Not sure if that's a typo or artistic liberty.",
                "author": "LVArcher"
            },
            {
                "raw_content": "No Gammamon... Me sad now...",
                "author": "mrjadlp"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Artistic designs from Project Gravity, the canceled project from the creators of SSX, are shown",
        "score": 246,
        "text_content": "A few years ago we learned that Project Gravity, a Snowboard Arcade game, which would be the spiritual successor to EA's SSX saga, had members of the development team including the product and father of the SSX saga Steven Rechtschaffner with his studio SuperNatural Studios developing this project since 2020. [https://kotaku.com/ssx-spiritual-successor-lost-publisher-1851251879](https://kotaku.com/ssx-spiritual-successor-lost-publisher-1851251879) A former member of the development team who worked on the project shared images of artistic designs, and the truth is that the project looked very good, it's a shame that everything was thrown in the trash, since as a fan of the SSX saga, after seeing these images of the project, I don't know why 2K didn't support this, since when they sent me these images on Discord, it left me impressed, since it had the spirit of the old SSX from the PS2 era. I don't know if they will have the project frozen while waiting to find a new publisher to support the project, since SuperNatural Studios is still active. [https://www.artstation.com/artwork/YBxLwq](https://www.artstation.com/artwork/YBxLwq)",
        "comments": [
            {
                "raw_content": "Man that would be fucking sick, i love the SSX series as well. Dont known if you saw but Acclaim is publishing a indie SSX inspired game coming next year [https://youtu.be/3hH9sIotgOk](https://youtu.be/3hH9sIotgOk)",
                "author": "_6u5t4v0"
            },
            {
                "raw_content": "I know it's difficult to get an SSX HD Collection because of music licensing, but if Activision can do it for Tony Hawk then why can't EA? EA should just relaunch the EA Sports Big brand and give us modern ports of SSX, Skate, all the Street games. I'd probably buy all of them.",
                "author": "stratzilla"
            },
            {
                "raw_content": "I'm jumping",
                "author": "greenbluegrape"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "9070 XT $650, creeping closer to MSRP",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well I hope it gets back down. I got mine on launch day for 600 flat and it feels great at that price.",
                "author": "IndoorBeanies"
            },
            {
                "raw_content": "Y'all are buying GPUs?",
                "author": "Soytaco"
            },
            {
                "raw_content": "I ended up just buying a 7900 XT shortly before launch @ $649 rather than gamble on getting a card in-stock... rasterization performance is only around 10% difference, I don't use frame gen at all, and most games I don't use raytracing either or only use it on low or medium, so overall not a big difference, and I got 20GB of VRAM I'll probably never fill up cuz I don't play at 4k...",
                "author": "Iherduliekmudkipz"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Your home has a 1 in 4 chance of being at severe risk from extreme weather",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In some metros this is basically a 1 in 1 chance. Others it's like 1 in 1000. Home insurance rates in my area are like 0.1-0.15% of the home price per year.",
                "author": "CallerNumber4"
            },
            {
                "raw_content": "\"severe risk from ~~extreme weather~~ natural disasters\" its always been natural disasters. stupid fear mongering.",
                "author": "Gemdiver"
            },
            {
                "raw_content": "Having one parent with heart disease roughly gives you a 25% chance of early cardiovascular issues yourself.",
                "author": "Sufficient-Flower775"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Demis Hassabis celebrates Gemini hitting #1 on the appstore",
        "score": 436,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How can Elon's case against Apple continue? His argument is that only ChatGPT could reach No 1 in the App Store and no other AI could, because of its exclusive deep integration with Apple Intelligence at the OS level.",
                "author": "1a1b"
            },
            {
                "raw_content": "congrats to Demis for beating the rigged system at the App Store. Almost a month to the day for Elon saying the App Store was rigged, and OpenAI was always gunna have the top spot... pour one out for our ketamine king!",
                "author": "rallar8"
            },
            {
                "raw_content": "Is this banana effect",
                "author": "Aditya_sha1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Demis argues that it’s nonsense to claim current models are \"PhD intelligences”",
        "score": 1248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The man speaks so much sense",
                "author": "gerredy"
            },
            {
                "raw_content": "100% agree with this. I am definitely part of the hype train, but every time I hear the \"PhD\" level intelligence claims, I just have to roll my eyes. LLMs can still fail such basic, trivial things. Even ones that aren't math-related.",
                "author": "funky2002"
            },
            {
                "raw_content": "He’s right. Jagged intelligence",
                "author": "Oniroman"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reliable Long Horizon Agents by 2026?",
        "score": 144,
        "text_content": "Researchers from Cambridge and the Max Planck Institute just dropped a new \"Illusion of\" paper for Long Horizon Agents. TLDR: \"Fast takeoffs will look slow on current AI benchmarks\" In their new long horizon execution benchmark, GPT-5 comfortably outperforms Claude, Gemini and Grok by 2x! Guess GPT-5 was codenamed as \"Horizon\" for a reason. Paper link: https://www.alphaxiv.org/abs/2509.09677 X/Twitter thread: https://x.com/ShashwatGoel7/status/1966527903568637972",
        "comments": [
            {
                "raw_content": "What exactly are the units in here? Also, what is with the thinking and chain-of-thought colours?",
                "author": "epic-cookie64"
            },
            {
                "raw_content": "For what I understood it is akin to numerical errors in computing. If a task can be broken in many steps but each step has small errors, the errors compounds and the task that can be completed is relatively short (in number of steps). In the figure posted by OP, only GPT5 is able to solve very long tasks while the others go astray because their errors hurt their abilities after a while. In short most models cannot complete long task because their error rate cripple them even if their approach is correct. Thinking helps as the thinking process picks the best \"output\" so to speak that then contains less errors and thus the model can solve more steps. E: hmm. If I understand the test done there, practically they say: \"there is a dictionary of short words. Each word has a weight. Each step gives you a list of words. Pick the related weight and sum it to the existing. Keep the sum for the next step\". I am not sure whether LLMs without tools can reliably do basic math beside very often mentioned quantities. That is, if the quantity they need to sum is not that common in the training data, they may go astray just due to that. Hence the thinking can help a ton on this. I would rather prefer a test where the LLMs keep using text (say, a A1z26 cipher or the like to keep the result short and textual) so that they don't have to know how to do basic math computation if they don't have access to tools. E2: I am searching online if LLMs can reliably add numbers up to a certain number of digits without tools and the answer seems to be no. So while it is true that the benchmark is still somewhat valid, I wonder if it is rather a \"let's see which model can guess the number better\" once the sum is large enough. It would be different, and could be that the authors do it but I missed it, if they would verify that the model is indeed able to add the numbers when only one step is involved. If the model is able to add the numbers within one step but it is unable in many steps, then the benchmark is valid.",
                "author": "pier4r"
            },
            {
                "raw_content": "I don't understand what this chart intends to show.",
                "author": "Moist-Nectarine-1148"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How AI is disrupting the photography business",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The photography industry, after disruption the portrait painting industry: https://preview.redd.it/pv5gc0awhyof1.png?width=225&format=png&auto=webp&s=c2854d595ba1e092b97fde7b1065d5e7b424e5d4",
                "author": "PwanaZana"
            },
            {
                "raw_content": "One way it has changed the photography industry in Germany is that the government now takes the photos that go on your ID themselves to prevent exactly this kind of manipulation. Previously people had to provide those photos themselves, which in turn provided around 30% of the revenue for some shops.",
                "author": "Spra991"
            },
            {
                "raw_content": "Paywalled :(. Does anyone have a link to read it?",
                "author": "IAmFitzRoy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GDM’s Pushmeet Kohli on solving science's biggest challenges with AI",
        "score": 24,
        "text_content": "Pushmeet Kohli, Head of Science and Strategic Initiatives at Google DeepMind, joins host Logan Kilpatrick to explore the intersection of AI and scientific discovery. Learn how the team's unique problem-solving framework led to innovations like AlphaFold and AlphaEvolve, and how new tools like AI Co-scientist aim to democratize these types of breakthroughs for everyone. 0:00 - Intro 1:04 - Recent Alpha launches 02:15 - Framework for selecting research domains 06:21 - Scientific, commercial and social impact 15:00 - Wielding AGI for breakthroughs 16:48 - Tech transfer and team collaboration 19:46 - IMO Gold Medal 21:42 - Evaluating math proofs 22:55 - From specialized models to Deep Think 24:22 - Do math skills generalize? 25:53 - Generalizing the IMO model 27:43 - Democratizing AI science tools 30:09 - AI Co-scientist 35:17 - An API for science?",
        "comments": [
            {
                "raw_content": "The thing that stood out most to me here is that they're using AlphaProof to create math proof training data for LLM reinforcement learning. If models are able to internalize the fundamental structure of mathematical reasoning, that will likely translate to increased reasoning quality across other domains. Massive datasets and pretraining allowed LLMs to form low-fidelity representations of human thought/cognitive processing. The same is theoretically possible for mathematical reasoning. Math is generally understood to build robust logic and reasoning in people. I don't see why this wouldn't translate to LLMs through massive pretraining on proof datasets and further reinforcement learning on proof based math tasks at scale.",
                "author": "avilacjf"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Emotion recognition AI can reduce physicians' empathy fatigue\"",
        "score": 26,
        "text_content": "[https://medicalxpress.com/news/2025-09-emotion-recognition-ai-physicians-empathy.html](https://medicalxpress.com/news/2025-09-emotion-recognition-ai-physicians-empathy.html) Original: [https://ieeexplore.ieee.org/document/11015455](https://ieeexplore.ieee.org/document/11015455) \"In clinical communication, it is believed that accurately understanding and appropriately responding to patients’ emotions contributes to treatment effectiveness and patient satisfaction. Recently, multimodal approaches that integrate various modalities such as speech, text, and physiological signals have gained attention for emotion estimation. However, the application of emotion recognition (ER) technology in clinical settings has not been thoroughly explored, particularly in terms of utilizing non-contact measurement techniques to reduce patient burden. Furthermore, there is limited research on quantitatively evaluating physicians’ ER abilities and comparing them with existing ER methods. This study aims to propose a multimodal ER framework using non-contact measurement techniques and validate its effectiveness by comparing it with the emotion prediction accuracy of experienced physicians. The results demonstrated that the proposed non-contact multimodal approach outperformed physicians in ER accuracy. While physicians’ empathetic abilities have traditionally been considered high, integrating multiple modalities was shown to surpass the recognition accuracy of unimodal approaches and human physicians. Moreover, the ability to obtain emotion-related data non-invasively enables advanced emotion estimation while reducing physical and psychological burdens on patients, highlighting the potential for clinical applications. These findings suggest a new method for supporting physicians’ ER in clinical settings, offering a means to reduce the risk of fatigue associated with empathy.\"",
        "comments": [
            {
                "raw_content": "Stage 1: \"AI has no empathy. That is why you need human docs with proper bedside manners.\" Stage 2: \"AI has artificial empathy. Human docs burn out. Let's have AI enhance their empathy.\" Stage 3: \"Hmmm... Is it easier to (a) augment docs' medical expertise with empathy-support, or (b) to augment AI's empathy capacities with medical expertise?\" Stage 4: The year X: \"Back in the day, we actually used to have apathetic human docs! Ew!\"",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "This could greatly benefit psychologists and indirectly patients, thereby reducing collateral damage caused by a lack of empathy.",
                "author": "Casq-qsaC_178_GAP073"
            },
            {
                "raw_content": "The year is 2030. My children have cancer. Medical ChatGTP says, \"Wow, that's so hard for you. I, an automated algorithmic word generator, totally understand your pain. Would you like some resources on the grieving process? You can handle this, great job! 💪🙌🫶",
                "author": "Pendraconica"
            }
        ],
        "subreddit": "singularity"
    }
]