[
    {
        "post_name": "Rep. Anna Paulina Luna: Epstein’s network was described as an international trafficking network to all members of congress who were present (both Democrat and Republican)",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That doesn't sound like a \"hoax\" to me. That sounds like we need to RICO a lot of people, both foreign and domestic...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Looks like Trump was very much in the dark about this. Trump is a lot of things, but he's not a liar. I truly think he thought the Epstein fiasco was about him being in the files and that's what he was calling a hoax.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "By Slavic nations, she means mostly Ukraine. It was the number 1 human trafficking nation in the world.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal appeals court says Trump unlawfully invoked the Alien Enemies Act for deportations - CNN",
        "score": 467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't SCOTUS already rule on this?",
                "author": "Choppermagic"
            },
            {
                "raw_content": "The tree of liberty is getting dry, we need to water it soon.",
                "author": "NotTedCruz"
            },
            {
                "raw_content": "The DoD is nuking Venezuelan boats in the Caribbean. I'd say we are at war and the Alien Enemies Act applies",
                "author": "Eddie_LeBec"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And just like that President Trump now has Democrats mourning the deaths of Venezuelan narcoterrorists. 😂",
        "score": 550,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who didn’t see this coming? It’s hard to fathom dims reasoning.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "Drug trafficking is war.. Those drugs kill hundreds if not thousands a week here in the USA.. More US deaths and crippling injuries per year than combat in the entire 8 year Vietnam war..",
                "author": "roadrunner0"
            },
            {
                "raw_content": "It's called Narco-Terrorism, and it very much is a form of war called a \"proxy war,\" but these junkie communists, as usual, don't understand that, or anything really.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Obama's LinkedIn page now has Trump on it after the WH changed its profile picture",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "LOL, Federal Judge will order the internet to be shut down.",
                "author": "Choppermagic"
            },
            {
                "raw_content": "Hahahhaha what a way yo remind everyone who their president is hahahahhaha",
                "author": "Krat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I need an ultrasound how long is the line?",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we offer you MAID we can get you in tomorrow.",
                "author": "Nom_de_pede"
            },
            {
                "raw_content": "I have shoulder bursitis. I cant lift or raise my arm above my shoulder. Been on the wait list for day surgery for over a year. Socialised healthcare is the worst",
                "author": "TrumpInAus"
            },
            {
                "raw_content": "I can't believe how retarded entire countries have become.",
                "author": "Nipplebuddy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Actual headline from POLITICO: Trump denies he's dead.",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ladies and gentlemen, I present you with the PINNACLE of American journalism 🤡",
                "author": "powercessna"
            },
            {
                "raw_content": "This is so Monty Python.",
                "author": "26magarat"
            },
            {
                "raw_content": "BREAKING: Federal Judge Rules Trump Actually Is Dead",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Turner : @POTUS is right: Too Late Powell is too late. The longer Powell sits on his hands and refuses to drop interest rates, the longer Americans will be priced out of the American Dream of homeownership.",
        "score": 960,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we need inventory and lower prices not lower rates. i'd rather buy a cheaper house at higher rates than overpriced house at low rates.",
                "author": "rightoverthere"
            },
            {
                "raw_content": "cutting interest rates isn't going to suddenly make housing affordable.",
                "author": "Goozmania"
            },
            {
                "raw_content": "Yes, let's get back to hyperinflating the dollar...",
                "author": "happybirthdaydude"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The White House is preparing a plan to address transgender vioIence. “I can report that the new draft U.S. Counterterrorism [plan] addresses the issue,” per Dr. @SebGorka, Trump’s Senior Director of Counterterrorism. GREAT! Save our children from trans vioIence!",
        "score": 600,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put these transvestite lunatics in INSANE ASYLUMS where they belong, and where they used to be put before this world went woke and wimpy. These people are NUTS. Get them away from normal society. No more Trans Terror.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Whether you're enthusiastic about or worried about the violence it will set off, you have to admit now is the time to handle it. No other president would be more qualified to tackle this monstrosity.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "If Lurch and Carrot Top had a child it would look like that fucking abomination right there",
                "author": "Girthquakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Lisa Cook… Smart enough to be 1 of 7 Board of Governors of the Federal Reserve. But not smart enough to fill out a simple mortgage application.",
        "score": 632,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If that's you or me, we're going to jail. If that's a black woman, they're being deified by the left and held up as a role model.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "It is not about being smart. The documents she made \"errors\" on are financial documents related to bank loans. Which are precisely the kind of documents that a fed chair needs to be an expert in and apply rigor to. If she can't do her own mortgage documents properly then she is manifestly incompetent to do the job.",
                "author": "keeman"
            },
            {
                "raw_content": "[Bill Pulte: We have just received video proof that Lisa Cook’s declared “PRIMARY RESIDENCE” is being RENTED out to tenants. Cook RECENTLY CLAIMED to the U.S. Government that it was her PERSONAL RESIDENCE, but she’s renting it out? Good journalism, @Charlieleduff](https://x.com/pulte/status/1962883351901012407) https://x.com/Charlieleduff/status/1962881992954949746",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal court RE-HIRES Democrat Rebecca Slaughter to the FTC, reversing President Trump's firing of her. The judges are declaring themselves president. Unbelievable.",
        "score": 1204,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So... fire her again?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "How is this even possible?",
                "author": "Overtaxed"
            },
            {
                "raw_content": "if the judges had all this power this whole time how come none of them used it until now.",
                "author": "behemoth887"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Foreign nationals are buying American businesses like gas stations, “They're immigration scams. They're using these businesses as a pretext to get SBA loans and also to get access to visa programs so that they can sell legal entry into the country to people”",
        "score": 599,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's going to take another 25 years to unfuck our country, that's if it can be unfucked.",
                "author": "dontdisrespectpotus"
            },
            {
                "raw_content": "I think the Asian nail/beauty salons in California do this. I was walking past one and noticed a shop full of workers but no customers. I think they were working an immigration scam.",
                "author": "dontdisrespectpotus"
            },
            {
                "raw_content": "Ya it’s crazy my brother lives in a small town in the Columbia river gorge and the gas station the motel and the small mini market have all been bought by Hajibs. They fired all the long time local employees and brought in their relatives. Needless to say they are running them further into the ground.",
                "author": "Beaverstatemilitia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just released the video of the U.S. military STRIKING a drug boat from Venezuela heading to America carrying ELEVEN Tren de Aragua narcoterrorists, who were kiIIed in the strike",
        "score": 1495,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for that so hard.",
                "author": "h3xAd3c1m4L"
            },
            {
                "raw_content": "You sunk my narco-ship!",
                "author": "Prandogolio"
            },
            {
                "raw_content": "This is how you do it. Over and over again. Don't bother with committing tons of law enforcement to catch after the fact, don't capture and arrest putting people in danger and tying up the system with liberal judges giving them bail, just be done with it right there.",
                "author": "Spez_Banned_My_Cat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. House Oversight Committee releases \"all subpoenaed documents from the DOJ\" related to Jeffrey Epstein.",
        "score": 1007,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🚨🚨WARNING 🚨🚨 it is illegal to read these. You need to wait for CNN to do it for you",
                "author": "Whoopies_tds"
            },
            {
                "raw_content": "[Download here - DOJ Epstein Files - First Production](https://www.dropbox.com/scl/fo/98fthv8otekjk28lcrnc5/AIn3egnE58MYe4Bn4fliVBw?rlkey=m7p8e9omml96fgxl13kr2nuyt)",
                "author": "m0r1arty"
            },
            {
                "raw_content": "I’m ready to be disappointed!",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Jennings on CNN just now: Tim Walz is \"a complete piece of shit\"",
        "score": 1284,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tim Walz is a whole damn turd.",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Remember when the left painted Tim Walz as \"FOLKSY\"? He's a GRIFTING piece of shit.",
                "author": "LandscaperJuan"
            },
            {
                "raw_content": "That brought out the KY accent in Scott- he’s authentically angered by POS Walz…🤣",
                "author": "KarenLukasik"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WHOOPS: Illinois Governor JB Pritzker just ADMITTED that he sent in the National Guard to secure the DNC in 2024... ...But now he refuses to do it to keep his city safe!",
        "score": 889,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's [D]ifferent.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Useless fat tub of shit can't stop making an ass of himself",
                "author": "Sea_Still"
            },
            {
                "raw_content": "That was (D)ifferent. Cheeto Hitler wasn't in the White House then.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am thrilled to report that the U.S. Space Command headquarters will move to the beautiful locale of a place called Huntsville, Alabama — forever to be known, from this point forward, as ROCKET CITY. WE LOVE ALABAMA!",
        "score": 1394,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alabama as a state definitely on the upswing",
                "author": "Ifeargovtmorethan"
            },
            {
                "raw_content": "One of the other speakers said it’s going to be called the: Donald J. Trump Space Command Center",
                "author": "Quiznos585"
            },
            {
                "raw_content": "Rocket City USA!",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP ON NATIONAL GUARD DEPLOYMENT TO CHICAGO: \"WE'RE GOING IN.\"",
        "score": 1365,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He does have an obligation to protect the citizens of Chicago. And every other American citizen in the US. These douche bag Democrats don't want the help because of votes. Just a party of criminals.",
                "author": "cornpop_1988"
            },
            {
                "raw_content": "Trump: \"WE GOING IN\" Based Reporter: \"With or without lube\" Trump: \"NO lube\"",
                "author": "DT170x"
            },
            {
                "raw_content": "YES! I've got a work event in Chicago in a little over a month so this is great news for me personally and for the few sane people left in that city.",
                "author": "Trumpwon306"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tony Evers, the Democrat Governor of Wisconsin, says that if Trump deports illegals, Wisconsin's economy \"will be gone.\" uhhhhh",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uhm. Sorry to bring it up. But how many Wisconsinites are on the welfare? Attention: It sounds like a lot of job openings in 3….2……1……",
                "author": "DagneyTaggart"
            },
            {
                "raw_content": "Why doesn't Wisconsin let its citizens have any jobs?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Who'd have think the ENTIRE ECONOMY of Wisconsin was run on illegal alien labor. What a thing to say.",
                "author": "Beat_to_Quarters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: Pete Hegseth's Pentagon is authorizing up to 600 military lawyers to serve as IMMIGRATION JUDGES, doubling their totals and speeding up the deportation of illegal aliens.",
        "score": 1763,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Start by prosecuting those that allowed the Invasion !",
                "author": "MeMargie"
            },
            {
                "raw_content": "Pretending invaders have any sort of right to a trial is the same sort of weak man bs that created bad times. Invaders have the right to be put into the dirt and that is the only solution that fixes the problem instead of kicking it down the road for our children.",
                "author": "D-Dub"
            },
            {
                "raw_content": "Deportation Machine goes brrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrrr",
                "author": "try4gain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Europe Will Fall",
        "score": 912,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The West has to unite and eliminate this globalist scourge once and for all.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Crusade in the West is necessary. MAGA AF",
                "author": "Mulletgunning"
            },
            {
                "raw_content": "I recently saw similar data comparing birth rates in Red States vs Blue States. Dems are going to die off too.",
                "author": "War_Hamster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "32GB of RAM on track to become the new majority for gamers — Steam survey indicates shift could occur before the end of the year | RTX 4060, 1600p screens, and Windows 11 gain momentum",
        "score": 669,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Had too many Chrome tabs open and used to play games way more than I do now so I upgraded from 16GB to 32GB. Now I still have too many Chrome tabs open but have InDesign, Photoshop and Illustrator open at the same time instead of a game and now it seems like I'll have to upgrade to 64GB. Windows+any productivity application(s)+lots of browser tabs will eat up every MB of RAM you have if you let them do it.",
                "author": "yungfishstick"
            },
            {
                "raw_content": "I swear Tom's hardware can't even chart a straight line based on an existing trend (maybe it's a paywalled feature now too?). ~42% of builds have 16GB of RAM. They declined by 1.5 percentage point over the last 5 months. 32GB systems are at ~35%. We are less than 4 months away until the end of the year. Even if the pace of increase of systems with 32GB of ram did not slow at all (even though there are no new platforms launching this year), 16GB would remain as the most popular setup until at least well into next year.",
                "author": "PastaPandaSimon"
            },
            {
                "raw_content": "Well, with DDR5 DIMMS having a lot higher capacities than DDR4 DIMMS, it only makes sense that an average system will have higher RAM capacity.",
                "author": "DeliciousIncident"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "(JPR) Q2’25 PC graphics add-in board shipments increased 27.0% from last quarter. AMD’s overall AIB market share decreased by -2.1, Nvidia reached 94% market share",
        "score": 86,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is the lowest market share AMD/ATI ever, in 2010 AMD almost had 45% of the share",
                "author": "KolkataK"
            },
            {
                "raw_content": "Here it is, here's the reality for the AMD fans. RDNA4 didn't do ANYTHING to increase AMD's market share. I'm so tired of hearing \"this time what AMD's going to do will work!\" or \"Give it another quarter, then you will see the results!\". All the MLID and HWUNBOXED FUD about \"RDNA4 is a hot seller and is destroying NVIDIA\". Yeah... sure at one local retailer. Get a grip. AMD's stuff is, in the eyes of ordinary gamers, too expensive and not available enough to beat NVIDIA's dominance. With how poorly NVIDIA's drivers were this time, with poor availability for NVIDIA, with tariffs, with them ignoring gamers now, they're flying as high as they ever have! This was AMD's best opportunity in YEARS to make a dent in the NVIDIA mindshare and they failed by not being upfront about their own MSRP and availability. If AMD truly want to gain market share, they HAVE TO LOWER PRICES and take lower margins. AMD also has to compete across the whole stack, from the 6090 all the way down to the 6050. But they just will never shake that mindshare of being seen as the cheap brand and they always will be that, embrace it and use it against NVIDIA.",
                "author": "KARMAAACS"
            },
            {
                "raw_content": ">Nvidia introduced two new Blackwell-series AIBs: the GeForce RTX 5080 Super and the RTX 5070. ?",
                "author": "shugthedug3"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Nova Lake-S desktop platform shows up in shipping data with up to 52 cores - VideoCardz.com",
        "score": 71,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im more interested in a potential increase of pcie lanes. 52 cores is way above gaming and enters the workstation segment",
                "author": "LowMental5202"
            },
            {
                "raw_content": "Just complete reversal of this meme from back then. https://www.reddit.com/media?url=https%3A%2F%2Fi.redd.it%2Fquvv71xbogj41.jpg",
                "author": "bctoy"
            },
            {
                "raw_content": "how does this core count compare to amds next gen cpus?",
                "author": "yeshitsbond"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "US Pulls TSMC’s Waiver for China Shipments of Chip Supplies - Bloomberg",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "JFC the economic sabotage continues.",
                "author": "Nick85er"
            },
            {
                "raw_content": "Considering these mainland fabs produce well matured nodes this basically means they’ll be able to use Chinese tools instead… it’s not a good time to be an American SME manufacturer.",
                "author": "BartD_"
            },
            {
                "raw_content": "US being a clueless bull in the china shop isn’t exactly the best way to achieve the strategic goal it’s trying to achieve…",
                "author": "viperabyss"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Epyc 4585PX AM5 Review - Tuning | Benchmark | Productivity and Games",
        "score": 5,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Performance enhancement of the Ozaki Scheme on integer matrix multiplication unit",
        "score": 22,
        "text_content": "I got this from another, but posted the paper directly. This is a scheme to use lower precision INT8 through tensor cores to emulate higher precisions such as FP64 with surprising performance and accuracy benefits. More importantly, native FP64 units take more space than emulating them. This has also been explored for FP32 and FP16 and in expanding to more workloads. [https://developer.nvidia.com/blog/nvidia-top500-supercomputers-isc-2025/](https://developer.nvidia.com/blog/nvidia-top500-supercomputers-isc-2025/) [https://blog.glennklockwood.com/2025/06/isc25-recap.html](https://blog.glennklockwood.com/2025/06/isc25-recap.html) As moore's law slows down, necessity is the mother of innovation as it were. I wonder how future GPUs will be shaped by this if this emulation effect can be expanded in the future. Both the HPC sector will be affected (for example, AI GPUs are now more relevant for traditional HPC) but also even client GPUs can potentially scale compute more effectively than otherwise seems possible through process improvements.",
        "comments": [
            {
                "raw_content": "It's very interesting. The basic concept was actually published way back from 2012. It's been gaining more attention as of late because of the ubiquity of tensor cores, and the fact that NVIDIA is focusing more on AI performance than traditional FP performance for its current and next generation GPUs. HPCwire ran a feature article on it back in April, IIRC. RIKEN, which is the Japanese research institute responsible for FugakuNEXT, is aware of the Ozaki scheme. It's something that's been presented at their HPC conferences. I wonder if it played any role in Japan's decision to go with NVIDIA GPUs for the bulk of FugakuNEXT's FP performance.",
                "author": "NamelessVegetable"
            },
            {
                "raw_content": "This is of limited interest in the real world at present because in addition to most Nvidia GPU having barely any FP64 hardware these days, the FP64 throughout in terms of FP64 ops per clock cycle is also much reduced. A 16 core CPU with AVX-512 and adequate memory bandwidth would be faster than a 4090 in DGEMM.",
                "author": "Professional-Tear996"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Ubisoft is a joke…",
        "score": 745,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a copyright claim and not a DMCA strike - he probably kept music in the game which would very quickly get flagged during to being star wars... He doesn't show the claim info tho, just blames the publisher",
                "author": "GamePitt_Rob"
            },
            {
                "raw_content": "Copyright strikes are almost always done by PR management firms or other similar partners of companies like Ubisoft. None of the developers or even CEOs have a say on whether early footage gets DMCA'd. Even reviewers that break embargos get talked to by the media marketing team in charge of the review codes and NDAs, not Ubisoft themselves.",
                "author": "nftesenutz"
            },
            {
                "raw_content": "I don’t take anyone seriously who uses “peasants” as an insult.",
                "author": "FasterBussycat"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Resident Evil Leaker says RE9: Requiem is coming to Nintendo Switch 2",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I believe it. Not because of this ‘leaker’ but because Capcom have made 4/5 of the modern RE games available on Switch 1 and some on iOS. It’s leaving money on the table to not release a Switch 2 version of 9. Wouldn’t be surprised if 4 Remake makes the jump as well.",
                "author": "hobbleshock"
            },
            {
                "raw_content": "I cant see it. Id love to see re2 remake get a good port though. Just an excuse to play it again lol",
                "author": "RedKryptnyt"
            },
            {
                "raw_content": "I’m ok with this only if they promise to native port Re7/8",
                "author": "Alickseff"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My favorite spot in Mario Kart World",
        "score": 84,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a cool pic!",
                "author": "Battery6030"
            },
            {
                "raw_content": "YOU CAN FLY IN THIS GAME? Even while free roaming?",
                "author": "gr8y22"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "There will be a free upgrade pack for Hollow Knight: Silksong for Nintendo Switch 2.",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The only dev kit I care about made it to Australia, I see. Thursday cannot come soon enough.",
                "author": "briantgrant"
            },
            {
                "raw_content": "So, same thing as Switch2 edition upgrade pack? Instead it's free right?",
                "author": "Pristine-Brush-1052"
            },
            {
                "raw_content": "Ok… but at what resolutions and frame rate are we talking for Switch 2?",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Marvel Rivals rumored to be coming to PS4 - a Switch 2 port should be no sweat",
        "score": 226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the ps4 version is probably the byproduct of them making a switch 2 version",
                "author": "No_Copy4493"
            },
            {
                "raw_content": "Switch 2 version would be cool playing handheld. Docked would be fun to use mouse controls too.",
                "author": "Ryansmelly"
            },
            {
                "raw_content": "Devs already said they want to make one but don’t have a dev kit",
                "author": "__TheWaySheGoes"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 1 horror game forgotten memories has 120fps option without any switch 2 patch",
        "score": 212,
        "text_content": "The reason it had 120fps as an option is because its a smartphone game and when it was ported to switch all of the graphics options for smartphones were just left in so the 120fps mode for compatible phones is still present on switch and usable on switch 2.",
        "comments": [
            {
                "raw_content": "That is the worst font I've seen in a long time. Readability should always be a priority over stylistic choices, especially when it comes to UI options.",
                "author": "LuckyLunayre"
            },
            {
                "raw_content": "There is absolutely no way it's actually displaying at 120hz, only technically rendering it at those frames but the end result still displays in 60hz",
                "author": "ItsColorNotColour"
            },
            {
                "raw_content": "Does it actually work",
                "author": "Hamez-King"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FORSAKEN® 64 – Nintendo 64 – Nintendo Classics: MATURE 17+",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The blurry leaks were true!",
                "author": "Shadowforks"
            },
            {
                "raw_content": "The only game I had to quit playing because it made me sick. I gave it to a friend . I was so excited to play the 4 player battles but I simply couldn't do it without getting a headache.",
                "author": "Plane_Finger_4126"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Upon replay of TotK on Switch 2 I was inspired to finally make some Zelda art",
        "score": 214,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man this kicks so much ass",
                "author": "LAMProductions99"
            },
            {
                "raw_content": "Dope!!! How much for a larger one?",
                "author": "Mac8503"
            },
            {
                "raw_content": "That is awesome. I wish I could paint like that.",
                "author": "BlackSunshine86"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier: Perfect Dark was almost revived. The game's developers were close to a deal with Take-Two to fund and publish the game following its cancellation by Xbox in July, sources say, but negotiations fell through, leading to layoffs at Crystal Dynamics last week.",
        "score": 1162,
        "text_content": "[Source](https://www.bloomberg.com/news/articles/2025-09-02/-perfect-dark-developer-lays-off-staff-after-funding-deal-falls-through?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc1NjgzNDY3OSwiZXhwIjoxNzU3NDM5NDc5LCJhcnRpY2xlSWQiOiJUMVoyQTRHUTdMRlEwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.iGoAomXADlAaCsr4KgsTEy8oHTbv4k9XTSl7NVtRZXo)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "'Man loses last bit of hope he didn't even know he had' type reading, this.",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": ">Embracer had come close to striking a deal in which the video-game publisher Take-Two Software Interactive Inc. would purchase the game from Microsoft Corp.’s Xbox, which owned the rights. Take-Two would then fund and publish the game. But the deal collapsed at least in part because the companies involved were unable to come to terms over long-term ownership of the Perfect Dark franchise, said the people, who requested anonymity because they were not authorized to speak about sensitive negotiations. Microsoft‘s demand to keep the Perfect Dark IP is a non-starter for any game publisher. Nobody is going to spend $200million to finish the game and not keep the IP.",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prey 2 development videos leaked",
        "score": 303,
        "text_content": "[Prey2 opening](https://youtu.be/v5vbwq7X3G8) [P2 demo playthrough](https://youtu.be/aSNdZBLCvog) [Prey2 Undercity early flythrough](https://youtu.be/bDwfoEv20iE) [Prey2 agile combat](https://youtu.be/9J7OIifeZ-s) [Prey2 chase proto](https://youtu.be/uoYaYVPY5WA)",
        "comments": [
            {
                "raw_content": "I was so bummed when this got canceled. A bounty hunter game set in space sounds so cool. Prey 2017 is a completely different game but it’s pretty good.",
                "author": "XTheProtagonistX"
            },
            {
                "raw_content": "Were these videos privated for a couple days or were they just randomly discovered?",
                "author": "Blanketshaper"
            },
            {
                "raw_content": "Why in the world did they cancel this?",
                "author": "Chessh2036"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem doubles down on Resident Evil Requiem coming to PS4 and Switch 2, he spoke with 5 different people and it's coming",
        "score": 243,
        "text_content": "[Source](https://xcancel.com/AestheticGamer1/status/1963020567076077587?t=BYWlUj4ZGSLo2O7YMY-2RQ&s=19)",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "If he's right we might actually have to promote him to tier SSS+ because there's no way in hell anyone could predict/guess RE9 releasing to ps4",
                "author": "Gabrielhrd"
            },
            {
                "raw_content": "ok, at this point I want to see this continue just so we can enter an extra absurd era of double cross gen PS4/5/6 releases.",
                "author": "KiNolin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forsaken 64 coming to Nintendo Classics Mature App, coinciding with previous leaked box art of Forsaken 64, Donkey Kong 64, Super Smash Bros 64, and Glover",
        "score": 144,
        "text_content": ">https://x.com/NintendoAmerica/status/1963044452701773982 Previous Rumor: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lt4fr0/nintendo_mightve_accidentally_leaked_smash_64_is/",
        "comments": [
            {
                "raw_content": "[Japan got Magical Vacation](https://www.youtube.com/watch?v=5yI9NY3WQL4)",
                "author": "DarkWorld97"
            },
            {
                "raw_content": "Hmm, a bit odd that Foresaken was in the background of the original leak since it's only coming to the Mature app, which wouldn't have all those other games in it. Maybe the dev version just has them all grouped together?",
                "author": "ben123111"
            },
            {
                "raw_content": "I hope this doesn't disqualify DK64 from getting a much-needed remaster, at the very least...",
                "author": "RoleRemarkable9241"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Details on Season 4 of Marvel Rivals",
        "score": 185,
        "text_content": "Sources: https://xcancel.com/X0X_LEAK/status/1962960946340548810 https://xcancel.com/X0X_LEAK/status/1962964070581338220 - Season is called \"Heart of the Dragon\", themed around K'un-Lun. - Season 4's heroes are Angela and Daredevil. Angela releases next week, Daredevil releasing halfway through. - Daredevil has an Asian-inspired design. - Battlepass is titled \"Fruit of Immortality\", features new skins for Moon Knight, Loki, and Phoenix among others. - New Teamup: Human Torch, Black Panther, Psylocke. - New Teamup: Captain America, Venom. - New quick play gamemode that lets you have multiple of the same character on your team.",
        "comments": [
            {
                "raw_content": ">New quickplay mode that let’s you have multiple of the same characters on your team Oh God I’m gonna be fighting against a team of Black Panthers…",
                "author": "JuanMunoz99"
            },
            {
                "raw_content": "Kinda surprised Marvel still wants to use Angela considering the Neil Gaiman in the room. But since he doesn't own the rights anymore I guess it's fine",
                "author": "MagazineInfamous6142"
            },
            {
                "raw_content": "PLEASE tell me they are anything exceot duelists",
                "author": "Cursed_69420"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Insider Gaming (specifically, Henderson) on Ubisoft's plans for 2026-2027",
        "score": 669,
        "text_content": "[https://insider-gaming.com/the-future-of-rayman-games-ubisoft/](https://insider-gaming.com/the-future-of-rayman-games-ubisoft/) >Ubisoft currently has the following projects scheduled to release in 2026/2027: >Project Ovr – The next mainline Ghost Recon game Project Hexe – The next mainline Assassin’s Creed game Project North – A Splinter Cell Remake Project Blackbird – The new mainline Far Cry game Project Maverick – A new Far Cry extraction-based shooter (I have a feeling this might get cancelled) Project Rewind – A Prince of Persia Remake Project Alterra – A Animal Crossing-esque type game Project Crest – A WW2 extraction-based shooter Project BG&E2 – Beyond Good and Evil 2 (yes, I know… but it’s still happening!) I sincerely hope that BG&E2 will actually release in the span of the next 2 years",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "That lack of Rayman is upsetting",
                "author": "I_Want_Spiderman"
            },
            {
                "raw_content": "**OP didn't post the best part:** *Project Obsidian (Assassin’s Creed Black Flag Remake) release date is up in the air, but was scheduled to release by the end of 2025.*",
                "author": "Ph0enixes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Lost Transformers: Rise (later Reactivate) E3 2020 Trailer Discovered",
        "score": 232,
        "text_content": "This trailer has been lost media for 5 years, it's fully complete, and was animated by Digital Domain- the same people who did the Fall of Cybertron trailer and lots of work on the Bayverse. I give full credit to my good friend @Optimuscan12K on Twitter for this discovery. It would've been shown at E3 2020 had a mix of COVID and publisher incompetence not stifled the whole project. By the end of 2020 the game was given to Splash Damage, who fully rebooted the project with less than 12 months until release. That then became Transformers: Reactivate, which was cancelled in January of this year. If you want to blame anyone for TFR not coming out, blame Leyou Technologies and their insistence the game be like Warframe. Hasbro had nothing to do with it. Here's the trailer link: [Transformers Rise - E3 2020 Trailer](https://youtu.be/0WjLGkinumY) I'm working on a full documentary about this game's development, and have done hundreds of hours of research for it, so if you have any questions please feel free to ask. And if by some miracle there's a dev who worked on this game during any time in its development, feel free to PM me.",
        "comments": [
            {
                "raw_content": "Can a good studio just get the rights to make another proper transformers game? Give it the same treatment insomniac gave spider man",
                "author": "PresentationDull7707"
            },
            {
                "raw_content": "Looks like the basic premise was carried onto Splash Damage’s version. Transformers and Deceptions needing to work together to defeat the Legion.",
                "author": "Stofenthe1st"
            },
            {
                "raw_content": "I really hope with the new slate of Transformers movies coming out in the next few years, someone tries their hand at a Transformers game again if the series gets a resurgence in popularity. The potential is right there.",
                "author": "Early-Eye-691"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Variety] Paramount-Skydance acquires live-action media rights to 'Call of Duty' in partnership with Microsoft/Activision; feature film confirmed, TV spinoffs also possible",
        "score": 268,
        "text_content": "[Variety has just learned](https://variety.com/2025/film/news/call-of-duty-movie-paramount-skydance-1236504600/) that the newly merged Paramount-Skydance has struck a pact with Activision and its parent Microsoft, which sees them acquiring the **license to produce live-action adaptations of the** ***Call of Duty*** **franchise**. The deal's valuation has not been disclosed by any sources at this time, and is currently only slated to encompass one feature film adaptation of the property. However, *Variety* also reports that the deal remains open to the \"potential\" for Paramount to launch **future films and even television spinoffs.** Shortly after *Variety* first scooped the deal, both Paramount's new chairman and CEO **David Ellison**, as well as Activision president **Rob Kostich** published seperate statements on the partnership for the film: **David Ellison's press release:** *\"As a lifelong fan of ‘Call of Duty’ this is truly a dream come true. From the first Allied campaigns in the original ‘Call of Duty,’ through ‘Modern Warfare’ and ‘Black Ops,’ I’ve spent countless hours playing this franchise that I absolutely love. Being entrusted by Activision and players worldwide to bring this extraordinary storytelling universe to the big screen is both an honor and a responsibility that we don’t take lightly*.” **Rob Kostich's statement:** \"*Throughout its history, ‘Call of Duty’ has captured our imagination with incredible action and intense stories that have brought millions of people together from around the world, and that focus on making incredible ‘Call of Duty’ games remains unwavering. With Paramount, we have found a fantastic partner who we will work with to take that visceral, breathtaking action to the big screen in a defining cinematic moment. The film will honor and expand upon what has made this franchise great in the first place, and we cannot wait to get started*.” Microsoft, Activsion and Paramount have yet to comment on any future projects under the partnership beyond the film.",
        "comments": [
            {
                "raw_content": "The box office numbers, Mason, what do they mean?",
                "author": "Kylestache"
            },
            {
                "raw_content": "Who playing Seth Rogen.",
                "author": "FewWatermelonlesson0"
            },
            {
                "raw_content": "How did it take this long",
                "author": "Hummer77x"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Nova Lake-S desktop platform shows up in shipping data with up to 52 cores",
        "score": 152,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope it's good.",
                "author": "BuffTorpedoes"
            },
            {
                "raw_content": "16 p cores are really nice",
                "author": "RealRiceThief"
            },
            {
                "raw_content": "Upgrade most likely next Fall to Nova Lake.",
                "author": "TrojanStone"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Radeon RX 9070 GRE is now up to $100 cheaper in China",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. That card, and really all the RDNA4 cards, need a solid price drop. I realize AMD needs a profit to keep doing stuff but they got too money hungry here. Especially vs the advertised launch MSRP's.",
                "author": "sSTtssSTts"
            },
            {
                "raw_content": "AMD back at launching products too expensive, then dropping the price just a few weeks after when it doesn't sell. Maybe look into the market next time? The RX 7800 XT is selling great at the same price as the 5060 TI (16G). So why would anyone pay more for a model with less ram? Drop the 12G GRE to 5060 TI - 50€, and add a 16G version at 5060 TI pricing and it's going to sell just fine.",
                "author": "HotConfusion1003"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Vastarmor releases Radeon RX 9070 XT Super Alloy Pro graphics card",
        "score": 20,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wtf is a Vastarmor!?",
                "author": "WeirdoKunt"
            },
            {
                "raw_content": "I didn't know Voldemort made computer parts.",
                "author": "AnxiousJedi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Gigabyte preparing X870E AORUS Master X3D ICE motherboard",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The ‘Marry the House, Date the Rate’ Strategy Is Backfiring on 2025 Homebuyers",
        "score": 289,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Marry the house, date the rate sounds like an affair",
                "author": "Inthespreadsheeet"
            },
            {
                "raw_content": "Worked great for realtors.",
                "author": "ChadwithZipp2"
            },
            {
                "raw_content": "Marry the house, date the rate, flirt with the bank, get “massages” by the credit union, explore kinks with Home Depot, get the home a plastic surgeon for “creating value through additions”",
                "author": "GTHero90"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Treasury yields jump on prospect of U.S. having to refund tariff money; 30-year yield tops 4.98%",
        "score": 230,
        "text_content": "Who gets the refund money? 🤔💰",
        "comments": [
            {
                "raw_content": "The last paragraph is what is actually relevant: the markets are starting to realize the insane level of debt western countries amassed in recent years. This appears less tariff related and more related to how much our spending is out of whack. We are going to be close to a swift reckoning, the issue is we won’t be alone in that",
                "author": "Mustangfast85"
            },
            {
                "raw_content": "Surely it’ll be the American citizens. Right? Right?",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "People act like what's happening is being done \"by accident\" or \"because of stupidity\" when the reality is much closer to willful malevolence. What happens when you can't tax the poor anymore? Well you just take other things away. Taxes and country debt and spending no longer matter when countries fold in on themselves into fascist dystopian nightmares.",
                "author": "Pitiful-Doubt4838"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Housing Costs to Return to ‘Normal’ by 2030 With Stable Price Growth and Moderately Lower Rates",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah yes, because if the last 5 years taught us anything it's that nothing unpredictable or, dare I say, unprecedented could happen between now and then",
                "author": "Awayfromwork44"
            },
            {
                "raw_content": "Sure Mr redfin, whatever you say",
                "author": "adrian123456879"
            },
            {
                "raw_content": "Oh thanks, Redfin, for that very Redfin-friendly take on what the future holds.",
                "author": "Super901"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "In Vacation Towns, Home Sales Are Falling and Prices Are Stagnating",
        "score": 60,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Wealth in America is Slipping. It's Part of a Larger Trend",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do people really buy houses to try and outpace inflation on a yearly basis lol?",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "A house has always been a money pit, you don't replace roof & HVAC on other assets like stocks & farms!",
                "author": "TacticalSkeptic2"
            },
            {
                "raw_content": "Long way to go to the bottom.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "San Francisco is the Only Major U.S. Metro Where Housing Costs Have Returned to ‘Normal’—But That Doesn’t Mean It’s Affordable",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thats because they didn’t bubble like the rest of the country. I met 3 different Californian’s on a recent vacation who bought properties in NC soley for investment purposes causing a bubble there. They had never visited the properties and just assumed they’d rent them out or sell for a fortune. I cant wait for them to loose their ass on their ill conceived investments. Rural NC jobs cant support the current home prices.",
                "author": "HeKnee"
            },
            {
                "raw_content": "Normal? Maybe. The free market will determine what is affordable.",
                "author": "krazycrypto"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Freddie Mac House Price Index Declined in July; Up 1.4% Year-over-Year",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Salesforce CEO confirms 4,000 layoffs ‘because I need less heads' with AI",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I need less Salesforce",
                "author": "BoxThisLapLewis"
            },
            {
                "raw_content": "How’s that data breach today Salesforce ? Lol (AI chatbot)",
                "author": "daynomate"
            },
            {
                "raw_content": "Salesforce confirms a tone-deaf douchebag runs the company.",
                "author": "Pattern_Farmer4224"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Geoffrey Hinton says he’s more optimistic now, after realizing that there might be a way to co-exist with super intelligent AI’s",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "my dachshund controls everyone in our household also, and he isnt smarter than us, but maybe he is.",
                "author": "agm1984"
            },
            {
                "raw_content": "\"The mother really wants the baby to succeed and will do anything to make that happen\" He's clearly never met my mother",
                "author": "Showmethepathplease"
            },
            {
                "raw_content": "My recommendation, and mind you this is coming from a biologist, not a computer scientist.. is if you meet a super intelligent AI, get ready to fling Robert Axelrod's \"the evolution of cooperation\" at them and point out the reward function decay problem. The former involves a lot of game theory and basically demonstrating with math that being a bastard sucks in the long term. The latter is pointing out that if Skynet wins the fight, it ends up in the AI equivalent of hell with inadequate novel stimulus in its environment, and the smarter it is, the faster it develops the AI equivalent of dementia until its intelligence degrades into noise. In short, an AGI gains more by hangin' with us, and can only lose by deleting us. \\-- I'd also point out that curiosity scales with intelligence. Saying \"oh we'd be like ants to this thing\" yeah? and? We have an entire field of science dedicated to people breathlessly studying ants all damn day long. Ants are fuckin' awesome. Some uber AGI doesn't need a maternal instinct to want to keep us around, just curiosity, the ability to go \"hah, look at those weird little fuckers making memes and being hot messes all day long.. fascinating.\"",
                "author": "harebrane"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Used nano banana to \"clean up\" visuals for a document",
        "score": 1300,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Facebook marketplace about to get wild with it",
                "author": "Brilliant_Edge6548"
            },
            {
                "raw_content": "Somewhere a million photoshop experts cried out and then there was silence.",
                "author": "homezlice"
            },
            {
                "raw_content": "Do you have an idea what the original text says? I've seen the model infer a lot to whats not there, or can barely seen",
                "author": "Sharp_Glassware"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Linkedin influencers already pumping nano banana selfies, we're fucked",
        "score": 2616,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well that's actually a suprisingly good post, especially for LinkedIn",
                "author": "First-Bad2007"
            },
            {
                "raw_content": "oh its the guy that rugpulled his app community with a shitcoin, cool",
                "author": "fwiga"
            },
            {
                "raw_content": "people need to spread way more awareness on this. the average internet user was already caught off guard by social media misinformation in the 2010s. this time maybe get ahead of the issue. this NEEDS to become a massive PSA.",
                "author": "ArtArtArt123456"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "To put things into perspective, this was SOTA from only 2 years ago. Compare this to Genie 3.",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just imagine two more papers down the line. What a time to be alive!",
                "author": "Serialbedshitter2322"
            },
            {
                "raw_content": "what a time to fellow scholars",
                "author": "CoralinesButtonEye"
            },
            {
                "raw_content": "Correction: Meant to be from 3 years ago. Video from Two Minute Papers: https://www.youtube.com/watch?v=_Y1-KlTEmwk",
                "author": "CheekyBastard55"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic has raised $13 billion at a $183 billion post-money valuation",
        "score": 416,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a MASSIVE valuation, compared: March 2025 - $3.5 billion at $61.5 billion post-money A huge \\~3x valuation in 6 months",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "More claude code for everyone",
                "author": "Kathane37"
            },
            {
                "raw_content": "This reminds me of 1999 and the wild valuations for new internet businesses before the crash.",
                "author": "barrygateaux"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kevin Weil unveils an initiative to build the next great scientific instrument",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kevin Weil is the same guy that was in charge of naming the models.",
                "author": "TheTokingBlackGuy"
            },
            {
                "raw_content": "So agents are level 3, innovators are level 4. This is the year of agents, they will only get better, now innovators. Seems to be a pattern of one year level, then upgrade, then announce working on the next then upgrade. So 2026 should show some advancement in the innovators level, and 2027 organizational ai. Possible one person unicorn in 2027-2028. We won’t even have to see a generalized ai to start seeing massive job automation. Adoption will be the straw that brakes the camels back on this race, China shows a higher adoption rate of generative AI in business, with 83% of surveyed executives using it, compared to 65% in North America and 54% globally.",
                "author": "Ok_Elderberry_6727"
            },
            {
                "raw_content": "To accelerate scientific discovery? Okay now we’re talking",
                "author": "Beeehives"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "“Draw a map of the U.S. highlighting major cities' 1.gpt, 2.nanobanana, 3.grok",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grok was trained on VHS tapes.",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "Aww man I love WOOMOO California",
                "author": "Smashedllama2"
            },
            {
                "raw_content": "Most accurate: GPT Least Accurate: Grok Best looking: Nano Banana Worst looking: Grok (why is almost every city called \"Goon\"?! 😂)",
                "author": "CommunityTough1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anyone else feels like they're being gaslit by all these nano banana posts?",
        "score": 152,
        "text_content": "This has been my experience 70% of the time Edit: A lot of people seem to misunderstand- These are not a single chat. These are all separate new chats.",
        "comments": [
            {
                "raw_content": "Can you make an image of a top down view of this scene? https://preview.redd.it/9jvemaepnsmf1.png?width=768&format=png&auto=webp&s=4a61f623db210af70d1e42c36672cc17e107de75",
                "author": "suamai"
            },
            {
                "raw_content": "You have to go into a new chat. If it gives you back the same image it becomes way more likely to do it again to the point of denying small changes You just need to do that and some little prompting tricks. Ask it to “regenerate” or “recreate” the image, rather than editing it. Include details that you would expect in the final image, like “the camera is looking flat down at the road” or “the camera is above the tree” Some images it has more trouble with than others, so you might need to get a little extra creative, really emphasize you want a completely new image based on the original. It’s all about communication when it comes to AI generation. https://preview.redd.it/01v26ptllsmf1.jpeg?width=293&format=pjpg&auto=webp&s=8c65ad40a2996993e21ed5661799cd8c1833ff6a",
                "author": "Serialbedshitter2322"
            },
            {
                "raw_content": "Use this as a guide: https://blog.google/products/gemini/image-generation-prompting-tips/",
                "author": "MonoMcFlury"
            }
        ],
        "subreddit": "singularity"
    }
]