[
    {
        "post_name": "Google AI Gets It's Own Nuclear Reactors",
        "score": 476,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know, it's amazing how fast things can happen, if you happen to be part of the big tech monopoly. Just like data centers springing up everywhere, when any other business would be bogged down years in environmental studies, etc. I bet that if the public wanted it to be reopened because it would lower people's power bills, the approval would take years, and likely, never.",
                "author": "thunderpussy"
            },
            {
                "raw_content": "Crazy we aren't willing to do this so people can thrive with affordable energy, yet we are willing to do this so an AI can hallucinate wrong answers.",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "No cheap electricity for you. Just for AI cat videos for TikTok",
                "author": "MEME-SUPREME"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Here it is… Opening an investigation into the POTUS based on a lie. “First we F*ck Flynn, then we F*ck Trump.” - Andy McCabe! This quote has to come back to haunt the traitors.",
        "score": 547,
        "text_content": "",
        "comments": [
            {
                "raw_content": "something is going on... this is taking way too long..",
                "author": "VanillaCupCake"
            },
            {
                "raw_content": "Bondi is a disappointment.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "This email was known years ago.",
                "author": "Womb___Raider"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "‘Charlie Kirk Elementary’ Among Finalists for New North Dakota School Name",
        "score": 565,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Yes, YES!!!",
                "author": "Patriot5TN"
            },
            {
                "raw_content": "I hate that he's dead.",
                "author": "ramennov"
            },
            {
                "raw_content": "I hate to be that guy... but they better have lots of money for security. Troons will be drippin pesticides from their inside genitalia in giddiness",
                "author": "Bullet_Tooth_Tony"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom’s donor PG&E was found criminally liable for 85 counts of murder for a fire they caused with outdated equipment. They paid Gavin Newsom $208,000 and he bailed them out.",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except it was intention on the state's part to cause the fires by not letting PG&E maintain the lines because the state prohibited cutting back the woodlands and controlled burns. PG&E might have had to take the blame, but obviously if they'd been allowed to prevent the fires they would have, because it would've preserved their wealth. This was a leftist plot to clear the land of its occupants and simultaneously siphon money out of PG&E by painting it as the villain. I'm sure it was super hard to convince the jury that big evil company was just negligent and let all its equipment burn up and they really didn't care about paying fines.",
                "author": "Quest723"
            },
            {
                "raw_content": "Spencer Pratt for governor he's awesome.",
                "author": "Female"
            },
            {
                "raw_content": "Add an extra zero or two.",
                "author": "HeavyMetalPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They were so desperate to stop Pres Trump's 2024 bid, that they massively overreached. Now they're going to face trials in Florida, where the Mar-o-Lago Raid took place.",
        "score": 165,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2 more weeks; its on my desk. Same old story. Wake me up when one democrat criminal is put in prison.",
                "author": "hillaryforprison"
            },
            {
                "raw_content": "Hopefully it goes places.",
                "author": "Roadpower"
            },
            {
                "raw_content": "Love it all",
                "author": "lizardo221"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Charlie Kirk's Greatest Anti-Capitalist Take Down",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I miss charlie",
                "author": "LeRiverDanube"
            },
            {
                "raw_content": "Error 153 > Our Terms of Service require embedders to provide a HTTP Referer. If this information is missing, viewers attempting to watch embedded YouTube videos will encounter blocked playback and an error screen (“error 153”). These viewers will still be able to click “Watch on YouTube” to view the video on YouTube. Note that directly accessing the embedded player without an enclosing webpage or context (such as accessing it from your web browser’s address bar) will typically not have a HTTP Referer and users will encounter the error screen; the embedded player is only intended to be used within an embedded context. > > Embedders who want to fix blocked playback can provide a HTTP Referer to their requests to YouTube. See the developer documentation for technical details.",
                "author": "weltallic"
            },
            {
                "raw_content": "The video shows the two agreeing on most things including: 2008 bankers should have been allowed to fail The wealthy \"enjoy socialism\" while the working class \"enjoys brutal capitalism\" The United States is paying the price for decades of cheap money",
                "author": "tpactionchasethevote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "So many other things need to be done before considering a 50 year mortgage. Mass deportations and shutting down 99% of fraud government progams, and not funding foreign militaries. We cannot ignore the actual problem, this is dumb.",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you look at the numbers a 50 year mortgage ONLY saves you about a $200 a month...and you get 20 more years of that shit! $300,000 30-year fixed: $1,529 principal and interest 40-year fixed: $1,418 principal and interest 50-year fixed: $1,366 principal and interest $400,000 30-year fixed: $2,038 principal and interest 40-year fixed: $1,891 principal and interest 50-year fixed: $1,822 principal and interest $500,000 30-year fixed: $2,548 principal and interest 40-year fixed: $2,363 principal and interest 50-year fixed: $2,277 principal and interest https://www.housingwire.com/articles/trump-proposes-50-year-mortgage-to-help-affordability/ 100 million sounds good to me! Don't forget the anchor babies!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "President can multi-task, but no one asked for a 50 year mortgage and many have pointed out how it can be bad. Let's ramp up deportations and hyper focus on FIXING ELECTION FRAUD.",
                "author": "Filo76"
            },
            {
                "raw_content": "That is what will save America, along with ending certain groups hold on America but alas, the former happens after the latter.",
                "author": "HazelHen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "#1 easy no-brainer thing the FBI could do right now to help the J6 pipe bomb investigation: publish the 39,000 video files the FBI told ABC News it had collected on the case.",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ha! He said Kamala Harris was squatting over the pipe bomb over at the DNC.",
                "author": "Apersonofinterest"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fox’s Greg Gutfeld is going viral after absolutely demolishing leftist NYT podcaster David Marchese after he complained about Planned Parenthood clinics receiving mean letters from pro-life activists, with Gutfeld responding, “Well, I mean, they are killing children.\"",
        "score": 918,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's so fucking frustrating that we somehow got to this point where they're literally killing unborn children who have no say in the matter, and somehow it's not treated as morally reprehensible as it should always be.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "I'm thankful I wasn't aborted.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Yeah, they aren't a cupcake shop....",
                "author": "thunderpussy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There’s nothing to see here. Just a simple and honest mistake from our dear friends in Maricopa County….",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arizona is a narco-state.",
                "author": "IllIllIll"
            },
            {
                "raw_content": "Somebody please explain why after Kari Lake pointing this shit out that nobody had done anything about these cheating fucks. I mean seriously. Arizona is the the testing grounds for stealing elections.",
                "author": "OldZilla"
            },
            {
                "raw_content": "\"Generated with AI, which can make mistakes\" The news article or the election results???",
                "author": "ItsFunToSay-M-A-G-A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NANCY ON HER WAY OUT...",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Reminds me of that time Trump canceled her flight.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Link to Ben Garrison and Tina Toons https://gab.com/GrrrGraphics/posts/115515801584468586",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "MSM after she dies: \"Oh she was a once in a generation public servant! She gave up everything to put the people first! We should aspire to be like her and approach her levels of integrity!\"",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kind of shocked this oldie isn’t making the rounds.",
        "score": 1054,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now that's a meme I haven't seen in a long, long time.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Definitely, an all time Favorite!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "It’s and older meme, but it checks out.",
                "author": "Skogin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No Longer",
        "score": 1223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Omg his first fourteen words...",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "America first. No street shitters allowed",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Globalism is the belief that a third world Savage who beheads gay people and stones women and a far left first world liberal who supports gay rights and feminism have a common ideology and can be interchanged and dragged and dropped any country",
                "author": "Deportthemall23"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mamdani gives his muslim propaganda speech to a crowd of fellow pagans in New York City.",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There will come a time when this will need to be dealt with.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Fuck \"Allah\"",
                "author": "Steelers-Fans-Suck"
            },
            {
                "raw_content": "Muhammad is a dead pedophile.",
                "author": "schnazzmizzle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I could watch this for hours 😂",
        "score": 738,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Take out your own is the commie way :)",
                "author": "MeMargie"
            },
            {
                "raw_content": "Garbage humans",
                "author": "awsure"
            },
            {
                "raw_content": "This needs Steve Inman",
                "author": "Lmn8rinos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "How to NY",
        "score": 601,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably ought to read up on Night of the Jinn... likely to increase in happenings around there.",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "I am a new yorker that has both of those books ... I believe Christ is the only way to defeat both ideologies",
                "author": "Lostroninsoul"
            },
            {
                "raw_content": "Have fun with that…",
                "author": "journalist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar — I don’t care if I get deported.",
        "score": 650,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I care. She should get deported.",
                "author": "TiggerLovingPooh"
            },
            {
                "raw_content": "If she can live where ever, then she can live in a concrete cell for treason.",
                "author": "Shookup3"
            },
            {
                "raw_content": "Get this towel head out of here! Deport!",
                "author": "Stormeyworld13"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴President Trump DOUBLES DOWN on his demands to send Obamacare money to the PEOPLE — “TAKING THE “FAT CAT” INSURANCE COMPANIES OUT OF THE CORRUPT SYSTEM OF HEALTHCARE.”",
        "score": 1281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need to get rid of the tyrannical socialist healthcare scam system in Canada, too. This facade of a country that calls itself Canada -- in every way, shape, and form -- needs President Trump to take over and claw it back from the Marxist-globalists. Monroe Doctrine, Manifest Destiny https://truthsocial.com/@realDonaldTrump/posts/113794510592692386",
                "author": "TheGreatWhiteNorth"
            },
            {
                "raw_content": "Hurry up and get it done so I can buy a policy that I need and can afford instead of subsidizing all the lazy fuckers who refuse to work",
                "author": "hughjasske69"
            },
            {
                "raw_content": "I paid $300/mo for the best amazing BCBS pre-obamacare. It won't get back to that good but it's gotta get better than now.",
                "author": "josiborg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Those poor [checks notes] EYEBROW TECHNICIANS.",
        "score": 811,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who the fuck gets their eyebrows done when they don’t have money for food. Only some one stupid. Get yourself a pair of tweezers!",
                "author": "Maxmax"
            },
            {
                "raw_content": "😱EVERYONES GONNA HAVE A UNIBROW!😱",
                "author": "DingleBalls"
            },
            {
                "raw_content": "The riots don't start until the Shaniquas of this country can no longer afford to get 'they' hair and nails done. 💅🏾",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kathy Hochul doubles down, she will BLOCK any attempt to raise taxes by Zohran Mamdani in New York",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LET THEM FIGHT",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Taxes gonna go UP!",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Then why did the dumb cunt endorse Mamdani? Not my problem since NYC were retarded to vote for a commie. Their problem.",
                "author": "GayPatriotMAGAUncle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japanese PC shops limit SSD, HDD, and RAM purchases to prevent hoarding as storage and memory shortage takes hold — buying a full PC unlocks higher purchase limits",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lmit buying is the best thing so people dont scalp and dry up supply",
                "author": "Perfect-Cause-6943"
            },
            {
                "raw_content": "Recently bought a 96gb cl30 kit on amazon that was actually a 32gb cl40 kit reshelled",
                "author": "Adventurous_Tea_2198"
            },
            {
                "raw_content": "All this so your managers can have an LLM craft their emails that nobody is going to read.",
                "author": "Jim_84"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MicroCenter is already selling Ryzen 5 7500X3D gaming PC, $100 cheaper than 7600X3D system",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's priced decently. If it was $100 cheaper, it would be a really good bang for the buck.",
                "author": "ParthProLegend"
            },
            {
                "raw_content": "Microcenter-only deal again?",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Hello kikimaru024! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Theoretically, could the Multi-GPU techology come back if they link the videocards with a some new superfast interconnect and make the operating system see them as one device?",
        "score": 29,
        "text_content": "The old Nvidia Sli had 1GB/s bandwidth, and typical video memory bandwidth was over 100 back then. Now the latest version of NVLink has a bandwidth of 1800 GB/s, and the RTX 5090 has about the same memory bandwidth I think.",
        "comments": [
            {
                "raw_content": "It already does exist, with datacenter NVLink: https://www.nvidia.com/en-us/data-center/nvlink/ It's just expensive AF and only matters for HPC with GPUs that are also expensive AF.",
                "author": "hanotak"
            },
            {
                "raw_content": "Theoretically yes, but it wasn't popular and the gains didn't work out in consumer workflows, so the concept was dropped from consumer GPUs. In practice, that's when you move to professional and datacenter cards that aren't 3 slot wide monsters and have better performance per Watt.",
                "author": "createch"
            },
            {
                "raw_content": "The answer is latency. For sure, NVLink has the throughput and it works well for AI stuff, and it probably would work well too for async rendering, but for real-time rendering, the latency of a remote memory call is just too much. And since a remote memory call is not an option, what rests is the already known alternate frame rendering and all its defects, which killed multi gpu in first place. Maybe someday, chiplets and the newer generation die interconnets call fill the gap for a 4x high end gpu.",
                "author": "Rafa998"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dutch Ready to Drop Nexperia Control If Chip Supply Resumes",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Complete shitshow by the Dutch government. I know they have the USA breathing down their neck on this but what exactly did they think was going to happen? they also knew the importance of the firm for European auto manufacturers.",
                "author": "jenny_905"
            },
            {
                "raw_content": "Another China containment move that completely backfired",
                "author": "Adventurous_Tea_2198"
            },
            {
                "raw_content": "Lol, except you've already broken that trust.",
                "author": "puffz0r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AI startup Cohere found that Amazon's Trainium 1 and 2 chips were \"underperforming\" Nvidia's H100 GPUs, according to an internal \"confidential\" Amazon document",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">If some AWS customers don't want Trainium, and insist that AWS run their AI cloud workloads using Nvidia gear, that could undermine Amazon's future cloud profits because it will be stuck paying more for GPUs. >The customer complaints highlighted internally by Amazon reveal the steep challenge it faces in matching Nvidia's performance and getting profitable AI workloads running on AWS.",
                "author": "MoreGranularity"
            },
            {
                "raw_content": "Kinda expected since you can't design chips like this in a couple years and expect to be competitive with the best. It took Google quite some time to make their TPUs good for training, same with AMD which will only reach complete parity with Nvidia with the MI400 next year. And for anyone screaming software, no this has nothing to do with software. If these accelerators were fast enough they would be used at least by big companies, and you wouldn't see this article.",
                "author": "Kryohi"
            },
            {
                "raw_content": "The thing is, they also cost them about 10x less than NVidia GPUs.",
                "author": "iBoMbY"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DARPA has selected eleven quantum computing companies to enter the second stage",
        "score": 4,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Is anyone aware of any actual benchmarks/tests between fake PTM 7950 and genuine?",
        "score": 6,
        "text_content": "(hope this doesn't count as \"tech support\"!) I have seen some say that the difference between fake and legitimate PTM7950 is totally overblown and that most phase change pads will perform very similarly- genuine or not, but then have also obviously seen the far more common \"genuine is WAAAY better than the fakes!\" as well. I'm just wondering if anyone has actually tested the differences between them? I've tried looking it up and surprisingly am somehow unable to find a single post anywhere of someone that tried them both and reported any differences in their performance, but I don't know if Google is just being stingy with the good search results (orrr that I just suck at doing research lol)? Sooo yeah, has anyone seen this done anywhere? Thank you!",
        "comments": [
            {
                "raw_content": "I think one of the big obstacles here is ascertaining what \"genuine\" PTM7950 is out there. It's not usually sold directly to end users, so you might just be comparing two variant knockoffs. For me, \"real\" PTM7950 is defined like so: Looks right. Is solid-ish and grey at room temp, liquidifies at 45-50C. Doesn't pump out. Has thermal transfer performance just below liquid metal. And if it meets those criteria, does it really matter if it's from Honeywell? I'm fairly certain that at least one or two of my orders were genuine, and they've all performed the same, at least within margin of error.",
                "author": "Low_Excitement_1715"
            },
            {
                "raw_content": "It's an interesting topic, one I wish the mods don't nuke. In any case, look this way: At worst, a fake PTM pad will perform like a really good thermal paste, instead of liquid metal which is what 'proper' PTM7950 is supposed to match (or surpass?). I pasted my 4070S with a cheap “PTM7950” I bought off AliExpress last year, which allegedly came pre-pasted with ID Cooling Frost X45 (according to the owner), which is one of the better budget pastes out there (per Igor's Labs): [https://www.igorslab.de/en/thermal-paste-details/?id=70](https://www.igorslab.de/en/thermal-paste-details/?id=70) And, If anything, the card ran a couple of degree cooler with the PTM after about half a dozen heat-cool cycles (\\~54-55c vs. 57-58c). Not a massive difference, I admit, but we are talking about temperatures in the 50s. Hotspot temperatures saw a more noticeable drop of roughly 10c (\\~65-66c vs. \\~74-75c). Not entirely sure why. Maybe the paste was starting to pump out. Speaking of which, I haven't experienced any pump out or degradation in thermal conductivity in a little over a year. Everything is still as good as it was on day one.",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Beelink ME Mini Pro, ME S, ME X and ME Max NAS Series for 2026",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These are sad honestly, when compared to mac mini. 2-3x the volume for a Intel N series 4 thread CPU. Why aren't OEMs forming a consortium to fund transition to native ARM software. Open source developers have already made ARM the first choice for servers within the last 5 years. Qualcomm is the only one working on ARM for PCs and they cannot seem to get their own drivers in order.",
                "author": "SERIVUBSEV"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I miss the full box cover art so much!!",
        "score": 531,
        "text_content": "I know this has been said before but the switch was the only modern console with nice cases. And seeing this demoralized me because I hadn’t bought a switch 1 game in a while and got used to the switch 2 cases! 😭",
        "comments": [
            {
                "raw_content": "It could be worse, at least it’s not a Switch 2 Edition with a paragraph of text at the bottom. The top border is way too big, but I do like the spine of Switch 2 cases.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "They should have a \"full art\" sleeve inside the boxes to replace the box art sleeve.",
                "author": "OfficialNPC"
            },
            {
                "raw_content": "I think all switch 2 games should have reversible covers without the bar personally",
                "author": "Wolfchi"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game is something else...",
        "score": 159,
        "text_content": "Epilepsy warning lol",
        "comments": [
            {
                "raw_content": "Ah, the competitive Kirby Air Ride experience.",
                "author": "Luigi580"
            },
            {
                "raw_content": "It’s so chaotic and fun. Also wow I didn’t know there was a mini map till now lol.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "If your speed stat doesn’t go across the whole screen by the end I will be baffled",
                "author": "cowboyofspace17"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What the fuck is happening",
        "score": 1441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lmao at the 'use the left stick to steer' message. Basically if you pick up that battery symbol you go at uncontrollable speed",
                "author": "5000_People"
            },
            {
                "raw_content": "Are you winning son?",
                "author": "einemnes"
            },
            {
                "raw_content": "\\[Use the left stick to steer...\\] **\"I'M TRYING\"**",
                "author": "ThrustersOnFull"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Batman: Arkham Knight's new patch 1.0.4 fixes Switch 2 errors. There's no graphics update, but the game is fully playable now without issues.",
        "score": 363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can now finish the game but it’s still ugly to look at.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "Damn I knew I should have bought this when it was on sale the other week.",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": "I’ve been playing it’s cool but I’m farther along on pc so unless it gets an upgrade I’ll stick to that. Glad it’s fixed though.",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What's the funniest misinformation you heard when the Switch 2 came out? I laughed so much when people said it would brick if you charged it with the wrong cord.",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know someone who still insists that all games are just streamed. Like, whether you download a game or play it off of a cartridge, he insists everything is just streamed and Nintendo is the shittiest company in the world for making people pay $90 to stream their games. He’s a fucking idiot.",
                "author": "aricberg"
            },
            {
                "raw_content": "Hey I think something is wrong with your screen",
                "author": "Consistent-Couple497"
            },
            {
                "raw_content": "That it would be a failure like the Wii U",
                "author": "Sqwerks"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Me trying to play Kirby Air Riders literally feels like I’m in a pinball machine",
        "score": 1609,
        "text_content": "I can’t make a single turn correctly hahaha. There’s so much stuff to keep track of.",
        "comments": [
            {
                "raw_content": "I had this exact same issue on the first game lol",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "It's kind of funny to see some really stunning backgrounds and then you are a pink cartoon ball on a star.",
                "author": "frankie_donkiebrains"
            },
            {
                "raw_content": "That will improve with map knowledge, it looks like you basically boosted on a snake. And also when there's more stars available you'll find one tuned to your comfort. For example in the original I mained the swerve star because I liked how precise and immediate it's turning was",
                "author": "TheDastardly12"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Huge Square Enix Nintendo Switch sale live with over 70 games, including first discount ever for The Last Remnant Remastered after 6 years",
        "score": 368,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No proper port for Kingdom Hearts series still hurts I would buy it all again in a heartbeat if it was not a cloud version",
                "author": "KaiHavertzhatewatch"
            },
            {
                "raw_content": "Dragon Quest 11 S is only 20 bucks. HUGE recommendation for anyone who likes classic jrpgs but wants modern presentation. Absolutely stellar game Also Paranormasight is only 10 bucks. If you like spooky mysteries and visual novels, this game is a real gem.",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "Triangle Strategy for $23.99 seems like a great deal, thoughts?",
                "author": "GRILT_CHEESE"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This game has so many things happening in every second",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "THIS IS WHAT MY 2000 HOURS OF OVERWATCH HAS TRAINED ME FOR!!!",
                "author": "ThisIsSethers"
            },
            {
                "raw_content": "It’s beautiful",
                "author": "Iamverydumbazz"
            },
            {
                "raw_content": "It’s everything I wanted. I grew up playing the original and this feels so close to the original but fresh at the same time. Can’t wait to try to do as much of the checklist as I can once the game is out",
                "author": "zeventide"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Paul Gale: The Switch 2 has already sold 12 million units",
        "score": 192,
        "text_content": "Source: https://xcancel.com/paulgalenetwork/status/1986882956221468926?s=46&t=5MGKG2266YCJsVFIXtesQw I’m not very aware of how reliable this guy is when it comes to sales numbers, so I’m taking this with a grain of salt for now. If true though, that’d be pretty impressive considering we still have the holiday season to go, and would put the system on track to outsell the Wii U by the end of the year.",
        "comments": [
            {
                "raw_content": "I think this guy is generally considered unreliable.",
                "author": "coal_thief"
            },
            {
                "raw_content": "I mean, we know it sold 10.36 by end of Sept. If they shipped 1.6m in October WW it would be at 12m. One could extrapolate such figures based on the sales rate since launch & then factor they likely shipped more in October and early November for the holiday. Is his info from a legit source? Who knows. Is the figure realistic? Yes.",
                "author": "NatetheHate2"
            },
            {
                "raw_content": "Nice work Reddit, the boycott was a total and complete success and the Xbox Ally was totally a major threat to the switch 2!",
                "author": "UltraMugen"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ghost of Hope on Call of Duty: Black Ops 7 Zombies' DLC 1 Map (Astra Malorum)",
        "score": 102,
        "text_content": "[https://xcancel.com/TheGhostOfHope/status/1987207222804242617#m](https://xcancel.com/TheGhostOfHope/status/1987207222804242617#m) [ZoneXbez has put together an \"interesting slapped-in image blender\" of what DLC 1's premise will be about.](https://xcancel.com/ZoneXbez/status/1986484224891777194#m) According to Ghost: \\- It takes place in an observatory \"atop a skull with a red glow in space\". Another source from him told him that the map may have some parts that take place on Earth similar to that of Moon, but it isn't something 100% on. It's the out-of-this-world kind of maps that Treyarch is toying around with, now that BO7 Zombies is set within the world of the Dark Aether. \\- The Wonder Vehicle seems to be involved in the overarching story beyond just Ashes of the Damned. >!Presumably part of the main EE quest of Ashes of the Damned of how Tessie the Truck plays a role, of how it got to Astra (and TEDD as well, because Treyarch did say TEDD's been in the Dark Aether for a very long time, after everything from the original Aether Story was bainshed there), when the main quest launches. !< \\- The rumored leaked maps from previous rumors, with the examples being Nuked NYC, Vietnam, and Afghanistan, were cancelled and replaced. The original leak stemmed purely from concept art and knowledge of the bios based on the new Original Crew iterations, so a lot of those maps didn't make it very far. So the rumored Space Station Map Concept is said to be DLC 1, aka Astra Malorum. [Ghost did say the Japanese Volcano map concept is happening](https://xcancel.com/TheGhostOfHope/status/1982081886051598538#m). The current plan is still 5 DLC maps, and there are plans to have a remake map amongst those. \\- In regard of that Nuked NYC Map, [Ghost heard from someone he trusts back in March](https://xcancel.com/TheGhostOfHope/status/1982079885741892077#m) that Treyarch got “scared” of doing the Nazi stuff and reworked/cut the original NYC idea that was leaked a while back, which is pretty much cancelled. [They had removed a bio bit of Dark Aether Richtofen's character in the BO7 blog post pointed out here](http://xcancel.com/Stanley5574420/status/1986135341972017311#m). Kinda sad that these map concepts sounded sick, but honestly, Vietnam and Afghanistan are okay concepts for Zombies maps, but that's been done a couple times in COD. Sucks for the Nuked NYC Map, it sounded like a Wolfenstein meets COD Zombies map concept that works well with Richtofen's world. I guess Treyarch still wanna stray far away from the WW2 Nazi era stuff on Zombies... But, I'm intrigued by the Japanese Temple Volcano Map, which sounded more out there and wacky.",
        "comments": [
            {
                "raw_content": "What’s stopping Treyarch on not wanting to go nuts on WWII Nazis, if COD Zombies birth was at World at War, even with the original name, “Nazi Zombies”. I get that when BO3 Zombies Chronicles released (along with the canned BO2 DLC 5), they had to replace the symbols with Iron Crosses, in order for them to get the DLC selling in Germany, as Germany laws do forbid showing said symbol in the entertainment space. If Wolfenstein can show it, COD can definitely show it, but sadly wouldn’t because COD is mainstream nowadays. Sucks that these map concepts are very out there and had to be cut out. I hope Treyarch does get too wild with their map ideas of how they’re pulling off the Dark Aether maps.",
                "author": "Bumblebee2455"
            },
            {
                "raw_content": "On top of a red skull…? wtf?",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "The cancellation of the NY destroyed map is a shame, because it sounded like the most interesting map in the leaks. Treyarch have also deleted the \"Hero of the Reich\" line from Richtofen's bio, so yeah, they're clearly dialling down the involvement of Nazis in BO7. I'm still very excited about this year's zombies mode. Ashes of the Damned looks amazing and Astra Malorum sounds promising from the leaks. BO1 zombies is still my favorite simply because of how experimental every map felt, hopefully BO7 still aims to do that. What do we think the remade map is? I'm leaning towards Buried as it was never remastered, BO7 is clearly BO2 inspired, and because of the new cowboy villain.",
                "author": "iV1rus0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Someone’s GamePass ad shows the original CoD MW2. It is currently not in the service.",
        "score": 210,
        "text_content": "https://www.reddit.com/r/XboxGamePass/s/qM3keWlYkX",
        "comments": [
            {
                "raw_content": "Probably Modern Warfare 2 Remastered",
                "author": "The--Endgame"
            },
            {
                "raw_content": "Does anyone remember the rumours about MW2 Remastered Multiplayer being complete but just not released?",
                "author": "SecretTraining4082"
            },
            {
                "raw_content": "I’d assume someone making the asset selected the wrong mw2",
                "author": "darkdeath174"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Abxylute 3D One specs confirmed: Core Ultra 7 258V, 32GB RAM and 10.95\" 3D display",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol these things are getting crazy. No modern game is going to play at that resolution and have an acceptable battery life. I hope we go back to simpler handhelds.",
                "author": "cebri1"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "I made this from an old card🔥",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird monitor!",
                "author": "tomtv90"
            },
            {
                "raw_content": "It's not old😭",
                "author": "Strong_Resource5919"
            },
            {
                "raw_content": "Pretty cool, i think a white led could be better, and if can be hidden in the frame its 10/10.",
                "author": "nitrogenado"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD bundles Call of Duty: Black Ops 7 with Radeon RX 9060 desktops in South Korea",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd happily shred the code in an industrial shredder",
                "author": "Insidious_Ursine"
            },
            {
                "raw_content": "Ew",
                "author": "EnzymeX"
            },
            {
                "raw_content": "lol. Wow. They are desperate. I still think it will be a “success” but I played the beta and it is just more of the same",
                "author": "Cradenz"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI to bundle Little Nightmares III with Ryzen Z2 based Claw A8, and Intel-ased Claw 8 AI+ and 7 AI+ handhelds",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "DC housing market in crisis as shutdown takes economic toll",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Isn’t this what everyone has been waiting for? Who’s buying?",
                "author": "TrainDifficult300"
            },
            {
                "raw_content": "As it should be. Too many homeowners treated their homes like an investment, thinking they can just cash out whenever they want, like the stock market. Unfortunately, they have to find out the hard way that equity in a home is not the same as equity in the stock market. If no one buys their home, they cannot cash out. They're trapped, and still have to pay carrying costs.",
                "author": "McFatty7"
            },
            {
                "raw_content": "'Right now we've got the highest inventory in DC for the last five years,' senior vice president at Sotheby's International Realty, Corey Burr, told Daily Mail. 'It's the longest days on market in the last five years, at an average of 47 days for DC proper. That's 50 days longer than any other area in the region.'",
                "author": "dailymail"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump proposes 50-year mortgage to help affordability",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Unsold New Inventory Reaches 2009 Levels",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet the prices won't fall.",
                "author": "MarketCrache"
            },
            {
                "raw_content": "Depending on the market, the prices are still 25%-30% higher than normal. I still see plenty of demand in good neighborhoods, a $600k mortgage on a $750k home is over $4,500/month not counting other housing expenses like maintainance, utilities etc. I am amazed how so many seem comfortable making such large mortgage payments monthly.",
                "author": "liverpoolFCnut"
            },
            {
                "raw_content": ">Wood has cut the price on his townhomes from $450,000 to $430,000 and is offering other incentives, like covering closing costs. ha.",
                "author": "hereditydrift"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "08 November 2025 - Weekly /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano-banana 2 is AVAILABLE on medio.io",
        "score": 887,
        "text_content": "not really sure how, doesn't look real, but here's an output for reference. I've tested nb2 before and this is definitely it [https://www.media.io/ai-image-generator/gemini-3-0-pro.html](https://www.media.io/ai-image-generator/gemini-3-0-pro.html)",
        "comments": [
            {
                "raw_content": "I still remember my now deceased calculus teacher at the university saying that the computers will never do integrals and that we should learn this for the future(that was 1999 btw)",
                "author": "Correct_Mistake2640"
            },
            {
                "raw_content": "The solution looks correct, but there is a transcription error in the workings, before it substitutes the expression for u in it says x**³**•x, I think it should be x**²**•x. But then it goes on to do the substitution correctly. Been a while since I did any integrals though so plausibly could just be me being an idiot.",
                "author": "Kakuflux"
            },
            {
                "raw_content": "To prove this is real, someone give me an image and a prompt and I'll run it, something you won't expect nb 1 to get",
                "author": "ThunderBeanage"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I and some friends have access to an uncensored slightly older checkpoint of the upcoming Nano Banana/GemPix 2 and holy shit it's gold lmao",
        "score": 379,
        "text_content": "Releasing next week, but let's just say a little more censored... enjoy. Img credit for images 1 & 2 go to @fleebdoo on X/Twitter.",
        "comments": [
            {
                "raw_content": "From the studio that brought you, “my Dad works at Nintendo”",
                "author": "Bobobarbarian"
            },
            {
                "raw_content": "Future historians will be cooked.",
                "author": "mirziemlichegal"
            },
            {
                "raw_content": "Don't know how impressive but I managed to test it once somehow on media.io and it made this comic https://preview.redd.it/qxno7h46o30g1.jpeg?width=1408&format=pjpg&auto=webp&s=0509087fca1dfb5907c95bb672bd05dcf54579a3",
                "author": "THE--GRINCH"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "nano banana 2 is impressive",
        "score": 345,
        "text_content": "Prompt: Image of a blackboard, that has a drawing of a gnome and within the gnomes head is written the proof that 2 is irrational",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/yo0tqek1f30g1.jpeg?width=1408&format=pjpg&auto=webp&s=e7d5c3efd4a54b347f2f70d2f65facef97ac252d old paper map of ottoman empire and there is blue ink spilled on the paper and a piece of ice cube melting on the table lit by a candlelight",
                "author": "heyhellousername"
            },
            {
                "raw_content": "Woah. Where’d you test it?",
                "author": "DukeAkuma"
            },
            {
                "raw_content": "How to get it?",
                "author": "Felixon16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The \"Hope\" model in the nested learning paper from Google is actually a true precursor to \"Her\".",
        "score": 111,
        "text_content": "Here is the relevant [blog post](https://research.google/blog/introducing-nested-learning-a-new-ml-paradigm-for-continual-learning/) For those of you having a hard time with this specific post just know that this will be what allows AI to actually become \"real time\" during inference. People have been talking about how this changes learning, but not how this will be put into practice for retail use. Normally with an LLM you feed in everything at once. Like an airlock. Everything that is going in has to be in the airlock when it shuts. If you want to process new input you have to purge the airlock and lose all the previous input and the output stream stops immediately. With this new dynamic model it stores new patterns in its \"self\" during inference. Basically training on the job after finishing college. It processes the input in chunks and can hold onto parts of a chunk, or the results of processing the chunk, as memory. Then utilize that memory for future chunks. It is much more akin to a human brain where the input is a constant stream. If we follow the natural progression of this research then the end design will be a base AI model that can be copied and deployed to a system and run in real time as a true AI assistant. It would be assigned to a single person and evolve over time based on the interactions with the person. It wouldn't even have to be a massive all knowing model. It would just need to be conversational with good tool calling. Everything else it learns on the job. A good agent can just query a larger model through an API as needed. Considering this paper is actually at least 6 months or older internally it must mean there is a much more mature and refined version of \"Hope\" with this sort of Transformers 2.0 architecture.",
        "comments": [
            {
                "raw_content": "This is how I know ~~2027~~ (edit: 2026) is going to be such a turnkey year. I predict a lot of changes coming next year around the world.",
                "author": "KalElReturns89"
            },
            {
                "raw_content": "I never bought into the 'LLMs becoming AGI' thing, but this time I think it becomes serious. Real time self improving AI sounds exiting and terrifying.",
                "author": "Cheap-Ambassador-304"
            },
            {
                "raw_content": "Nitpick: by “real time” you mean continual learning - models that keep learning and eventually adapt/specialize from new data. I agree this is the seed of continual learning and, more importantly, a foundation for exponential gains in model “intelligence” by letting models modify themselves. But it still faces hard problems: avoiding collapse, preventing gainless recursive loops, and preserving enough transparency for researchers to tune the layers.",
                "author": "St00p_kiddd"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Jerome Powell says the AI hiring apocalypse is real: 'Job creation is pretty close to zero.’ | Fortune",
        "score": 285,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sticking to the facts, he says that the overall growth of jobs in the economy is slow and companies who are freezing or laying off frequently talk about AI.",
                "author": "mejogid"
            },
            {
                "raw_content": "You're headline is false. He did not say anything remotely resembling that. Would recommend people read the actual article.",
                "author": "uutnt"
            },
            {
                "raw_content": "The perfect scapegoat! Blame AI for a struggling economy, instead of saying the truth. This is 🐂💩!",
                "author": "Yaxiom"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Not the most impressive demo, but it's so much smoother than it used to be",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is this a strip club",
                "author": "PM_ME_YOUR_MUSIC"
            },
            {
                "raw_content": "![gif](giphy|13Y6LAZJqRspI4)",
                "author": "FrankCarmody"
            },
            {
                "raw_content": "Xpeng is probably wondering: Can it walk in a seductive, feminine style?",
                "author": "spacetree7"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI predicts AI will make scientific discoveries by 2028 and humanity will barely flinch",
        "score": 205,
        "text_content": "OpenAI just said AI’s already doing what top researchers can’t, and by 2028, it might start making discoveries which is crazy!! We’re 80% to machine scientists… and everyone’s still using it to write emails.",
        "comments": [
            {
                "raw_content": "Could be happening now and no one would know the difference?",
                "author": "indifferentindium"
            },
            {
                "raw_content": "We will adapt. They could reverse aging, cure cancer, so many fabulous things, and the adaptable and elastic human mind will yawn one month later and say, I'm bored. Gotta stay grateful and amazed at where we're at, even today!",
                "author": "kevinmise"
            },
            {
                "raw_content": "Are we not counting discoveries made by scientists using AI currently? How many of those might happen from now to 2027?",
                "author": "spacetree7"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XPENG IRON has a human like spine design allowing hip twist motions; it can be trained just in 2 hours with large model framework instead of weeks with RL",
        "score": 814,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|fH985LNdqFZXOFHygK)",
                "author": "zeeeeeeeer"
            },
            {
                "raw_content": "We will surpass the Droid federations robotics capacities in no time, but still no lightsabers in sight",
                "author": "forestapee"
            },
            {
                "raw_content": "The hips don't lie",
                "author": "Middle_Cod_6011"
            }
        ],
        "subreddit": "singularity"
    }
]