[
    {
        "post_name": "Vindmans and now Kellys, what's this thing with Ukraine and twins?",
        "score": 193,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kelly looks like Sloth and Lex Luthor fucked and had a retarded gaybaby.",
                "author": "TearsAficionado"
            },
            {
                "raw_content": "Looks like we know who Valhalla_Gorilla is now!",
                "author": "CAPTAIN_TENDY_PLATE2"
            },
            {
                "raw_content": "Gee, this all sounds on the up and up. And I’m sure Kelly wasn’t filling his own pockets with that USAID money. It just isn’t possible that our own politicians could be laundering money through our tax dollars and getting rich as fuck off of the slaughter of human beings! Next you’re going to tell me 10% was actually going to the Big Guy!",
                "author": "bh506407"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I don't think these idiots understand how the Internet works...",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "floodgate has opened.........meme bonanza!",
                "author": "T471"
            },
            {
                "raw_content": "But don't worry, fans, Franklin will be coming back soon with a whole new series of Classic Adventures for you to share! * Franklin Yeets the Jeets * Franklin and the Commie Helicopter Rides * Franklin Learns About Woodchippers * Franklin Goes to Ottawa: Locked and Loaded Edition * Franklin Wants His Home Back",
                "author": "Moose_Antlers"
            },
            {
                "raw_content": "Oh… Oh no. They have no idea what they’ve just done. May God have mercy on them.",
                "author": "Hikedelics"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nearly FOUR MILLION non-citizens received a social security number during the Biden admin with virtually ZERO vetting. FOUR MILLION",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get them out.",
                "author": "Maxmax"
            },
            {
                "raw_content": "4 million we know of",
                "author": "gorilla_grip"
            },
            {
                "raw_content": "So what’s done about undoing that?",
                "author": "DeportThemAllForever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump just axed nearly a dozen immigration judges in Manhattan in one swoop. Sources tell the NYT they were FIRED for being too lenient on asylum and deportation matters, and/or too slow in processing cases. The Times reports the purge has begun.",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I only recently learned that immigration judges are not the same as regular judges; they don't fall under the article III judicial branch. They fall under the executive branch.",
                "author": "Corse46"
            },
            {
                "raw_content": "I hope this is the beginning of a beautiful Bukele style purge",
                "author": "DeplorableNeandertal"
            },
            {
                "raw_content": "If judges can't be objective, unbiased, and balanced, here's your notice. You'll get yeeted and deleted.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mark Kelly and the group of Unpatriotic Politicians were WRONG to do what they did, and they know it! I hope the people looking at them are not duped into thinking that it’s OK to openly and freely get others to disobey the President of the United States!",
        "score": 786,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Commander-in-Chief doesn’t have to defend himself from the accusations of a lowly Captain. The Commander-in-Chief. Tell a PFC Marine to disobey his fucking Corporal and see what happens. The DoW is a joke for entertaining this. Crush nuts or fuck off.",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Kelly tried to CYA with his little corrupt media presser today. He needs to be COURTMARTIALED NOW",
                "author": "BlueKentuckyGirl"
            },
            {
                "raw_content": "Are we the brunt of the humiliation ritual?",
                "author": "MoldyLocksNesMonste"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois Congressman Raja Krishnamoorthi has reintroduced the HIRE Act, which aims to double the annual cap on H-1B visas from 65,000 to 130,000.",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YEET THE JEETS!!!! BARRY STANTON FOR PRESIDENT!!!!",
                "author": "China4Biden"
            },
            {
                "raw_content": "Hey raja: fuck you",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Best I can do is zero",
                "author": "Yignuced"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DOJ is aiming to present NEW indictments against James Comey and Letitia James as soon as THIS WEEK, per Reuters",
        "score": 716,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nothing will happen but you have to keep up the legal issues for them for retribution for what they did to this country. Comey likely has free legal counsel. Her, probably not.",
                "author": "FlyinHeadlock"
            },
            {
                "raw_content": "How about you just fucking do it and then have turners report on it",
                "author": "Thomm"
            },
            {
                "raw_content": "I WANT RESULTS AND SEE THESE FUCKERS PAY",
                "author": "BlueKentuckyGirl"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There are 42,861 NGOs handling $120 billion in Minnesota per year. Imagine the fraud.",
        "score": 551,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An arrest would be nice.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Land of 10,000 scams.",
                "author": "TDAF"
            },
            {
                "raw_content": "sounds like bullshit....42,861 ?? Even a retarded governor would see something nefarious going on",
                "author": "salt-collector"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why were we celebrating Worlds AIDS Day?",
        "score": 663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This was a thing? What?",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "- But everyone wears the ribbon. - You must wear the ribbon. Kramer says no to that. > You know what you are? > You're a ribbon bully.",
                "author": "magnokor"
            },
            {
                "raw_content": "Seriously, this is 2025. We should be celebrating Monkey-pox Day!",
                "author": "ATX_for_Trump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Somali in Minnesota: \"I no comfort here like before. Some of us make fraud but not all.\"",
        "score": 904,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So go home. This is not your home.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "First they came for the Somalians, and I said \"There's a few over there.\"",
                "author": "GallowsTime"
            },
            {
                "raw_content": "GET THE FUCK OUT",
                "author": "GallowsTime"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Corrupt Boasberg Refuses to Testify Before Congress After Authorizing Secret Spying on Hundreds of Republicans",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Send Marshals to haul his ass in.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "I'm really getting so tired of this goblin.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "THE CONSEQUENCE has been established.... ARREST HIM.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why do over 5,000 liquor and smoke shops accept EBT? The stores or not supposed to be allowed to exchange EBT for weed, booze, and cigarettes. Yet they must be accepting EBT in exchange for products they sell. And they don’t sell salads and wheat bread!",
        "score": 942,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw that Uber Eats also allows EBT to pay for deliveries. I can't imagine an instance where you have to rely on the government for food yet you are willing to pay the crazy markup to have it delivered to you.",
                "author": "LolitaExpressPilot"
            },
            {
                "raw_content": "Went to a children museum and a sign on the front desk saying accept EBT and snap... Not only do foreigners get free money, food and living; they get tax paid activities that my family pays both tax and admission to",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "Lots of them in the hood do tho. Tell me you're sheltered without telling me you're sheltered.",
                "author": "AFferalAF"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden's Christmas vs Trump's Christmas",
        "score": 751,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The autopen presidency is a fever dream",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "I don't miss Biden.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Tapping Trannies versus Traditional Trees. I'll take the latter.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In a massive Day-1 victory for merit, common sense, and American excellence, President Trump’s Education Department just forced Northwestern University to surrender its entire radical DEI apparatus or lose $790 million in federal funding. They chose surrender.",
        "score": 1375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is any college getting federal funding?",
                "author": "connermost"
            },
            {
                "raw_content": "Make sure they don’t just rename “DEI” to something else and keep it around.",
                "author": "ninabobby"
            },
            {
                "raw_content": "tax funding? i wasnt invited to attend classes there",
                "author": "covfefe77"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Minnesota Judge Renee Worke ARRESTED for probable cause DWI according to @CrimeWatchMpls. Wtf is going on in Minnesota. Something is seriously wrong there.",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# METH *It's a HELL of a drug.*",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "That face can make an onion cry",
                "author": "DownTheBurg"
            },
            {
                "raw_content": "",
                "author": ""
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Giessen, Germany (Nov. 29) — A huge mob of Antifa & far-left rioters gathered to try to shut down a youth club event for the AfD Party. Antifa threatened violence, forcing hotels to refuse accommodation to attendees. Police closed off part of city.",
        "score": 667,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When the government is in partnership with Antifa and other types of street thugs, Conservatives have to get creative in devising ways to deal with them. Their are methods that are effective, but you must have the will to use them.",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Modern day brownshirts. Same tactics they used in the 30's",
                "author": "Tellsyouhow"
            },
            {
                "raw_content": "And when the natural response of counter organization and action is attempted, they'll be called nazis and jailed",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "😡 By DESIGN! 😡 \"Welcome to Minnesota — Great job Governor Walz!\"",
        "score": 1014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sorry white man, I know you wanted to explore the stars, but instead you’ve got to go on the brown crusades to save your own country from Bolshevik Jews.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Man I wonder if the president can do anything about this?",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "# TIMMMAAYYY!!!",
                "author": "TimWaltz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The X account exposing Tim Walz for being complicit in MASSIVE fraud was just SUSPENDED on X. WTH is going on?",
        "score": 1336,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very sad day for free speech and transparency",
                "author": "hughjasske69"
            },
            {
                "raw_content": "Automated suspension from mass reports by bots?",
                "author": "RocksCanOnlyWait"
            },
            {
                "raw_content": "The account has been reinstated https://x.com/Minnesota_DHS/status/1995598698953539653",
                "author": "ListenJack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security calls for New York AG Letitia James to turn over 7K illegal Invaders",
        "score": 967,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# ***\"Calls for?\"*** Just tell her to hand them over or go to jail! We're in power, are we not?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Enforce your shit or shut the fuck up. The asking nicely portion of the countries history ended when the guns came out.",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "DHS has HSI and other armed federal agents. If illegals are being hidden, send in federal agents to the homes and offices of the NY AG to find where they are and arrest the AG for obstruction of justice. All talk no action. What’s the point of having armed federal law enforcement agencies if they won’t use them to investigate and arrest.",
                "author": "davidanderson90"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Vaccine Stocks Drop After FDA Memo Links COVID Shots To Child Deaths",
        "score": 1228,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ve never met a single person who regrets NOT getting vaccinated. Pureblood status",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Good, now hang these faggots for killing kids knowingly",
                "author": "SuperHonkey"
            },
            {
                "raw_content": "I wish the consequences were harsher than a 10% temporary stock drop. How about a short drop and a sudden stop for the ones that knew",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Steam Hardware & Software Survey: November 2025",
        "score": 109,
        "text_content": "Steam has released its latest Hardware and Software Survey for November 2025 The RTX 5070 remains the leading GPU in the Blackwell lineup, holding 2.28% of all surveyed systems. Meanwhile, the RTX 5060 has jumped into second place among all the newly released RTX 50 Blackwell lineup GPUs, holding 1.62% of the survey. Interestingly, AMD’s RDNA 4 is still missing from the survey results.",
        "comments": [
            {
                "raw_content": "RTX 5070 is now 11th of all GPUs with its 2.28% share. Top 10 Monthly gains: 1. NVIDIA GeForce RTX 5070: 2.23% (**+0.35%**) 2. NVIDIA GeForce RTX 5060: 1.62% (**+0.32%**) 3. NVIDIA GeForce RTX 5060 Ti: 1.20% (**+0.21%**) 4. NVIDIA GeForce RTX 5070 Ti: 1.14% (**+0.19%**) 5. NVIDIA GeForce RTX 5080: 1.01% (**+0.15%**) 6. NVIDIA GeForce RTX 4060 Laptop GPU: 4.44% (**+0.14%**) 7. AMD Radeon RX 7800 XT: 0.88% (**+0.13%**) 8. NVIDIA Graphics Device: 1.16% (**+0.12%**) 9. NVIDIA GeForce RTX 4050 Laptop GPU: 1.54% (**+0.07%**) 10. AMD Radeon RX 7600 XT: 0.46% (**+0.06%**) No 5050 in the charts just yet. The 50 series card, ordered by share: 1. NVIDIA GeForce RTX 5070: 2.23% (**+0.35%**) 2. NVIDIA GeForce RTX 5060: 1.62% (**+0.32%**) 3. NVIDIA GeForce RTX 5060 Ti: 1.20% (**+0.21%**) 4. NVIDIA GeForce RTX 5070 Ti: 1.14% (**+0.19%**) 5. NVIDIA GeForce RTX 5080: 1.01% (**+0.15%**) 6. NVIDIA GeForce RTX 5060 Laptop GPU: 0.91% (**0.00%**) 7. NVIDIA GeForce RTX 5090: 0.36% (**+0.03%**) 8. NVIDIA GeForce RTX 5070 Ti Laptop GPU: 0.26% (**+0.06%**)",
                "author": "nukleabomb"
            },
            {
                "raw_content": "Here before the tide of \"why no survey on my amd pc, I'm not saying anything just curious ;)\". How hard is to accept that Nvidia is just that dominant in the consumer space. By that same logic the current popularity of ryzen cpus in the survey is a sign of AMD bribing Steam and not that their products are just that much better.",
                "author": "La_OccidentalOrient"
            },
            {
                "raw_content": ">Interestingly, AMD’s RDNA 4 is still missing from the survey results. As is the Secure Boot/TPM metrics that Valve started collecting.",
                "author": "wickedplayer494"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron Reportedly Drafting New $9.6 Billion HBM Plant in Japan",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What will happen to these massive investments when the eventual happens? Consumer HBM? 🤔",
                "author": "StevePennyAkins"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Memory Price Rally May Run Past 2028 as Samsung, SK hynix Reportedly Cautious on Expansion",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Cautious on expansion Sounds like they recognize the A.I bubble and want to avoid the post-COVID DRAM oversupply situation.",
                "author": "GenZia"
            },
            {
                "raw_content": "The boom-bust cycle continues.",
                "author": "StarbeamII"
            },
            {
                "raw_content": "Which means GPU price hikes are coming early 2026 and will last until 2028. I hate this timeline.",
                "author": "Fisionn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Introducing Galaxy Z TriFold: The Shape of What’s Next in Mobile Innovation",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This style of fold is much better than the book style fold. The square screen of the z folds always felt a bit awkward",
                "author": "Lighthouse_seek"
            },
            {
                "raw_content": "I run a retailer that sells mobile phones. After seeing how many people are declined manufacturer warranty faults for Samsung flips and folds, I would not touch them with a 10 foot pole. If you have even a hair width scratch anywhere on the phone, they will decline your peeling screen seem warranty claim straight away.",
                "author": "Jaz1140"
            },
            {
                "raw_content": "Wish it didn't have a camera holepunch on the trifold side.",
                "author": "RHINO_Mk_II"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A rift emerges between Samsung's phone and memory divisions",
        "score": 437,
        "text_content": "In the article, it says 1. Now, reports suggest Samsung’s memory division has declined a deal from its mobile devices division. This deal would have allowed Samsung’s memory division to supply DRAM chips for Galaxy phones for at least a year. 2. Samsung wanted to secure a long-term DRAM chip supply with stable pricing. However, to maximise profits, Samsung Device Solutions' Memory division, which makes DRAM chips, rejected the long-term supply deal. 3. Due to the ongoing AI boom, the demand for DRAM and HBM memory chips has increased exponentially. So, Samsung's memory division wants to cash in on its chips while this AI boom lasts. ㅡ I love this kind of dramatic and satisfying stories..",
        "comments": [
            {
                "raw_content": "Its insane really, here Samsung has the opportunity to potentially beat the entire competition on pricing seeing as they are in the unique position of manufacturing both ram and the devices they are used in, when everyone else will be struggling for supply. LOL NOPE!",
                "author": "Rexter2k"
            },
            {
                "raw_content": "I remember years ago reading about how Samsung's other divisions that produce AP and OLED panels had to suffer for the sake of their Mobile divisions. Looks like there are changes internally for Samsung and DRAM division has more power now with AI",
                "author": "sungm64"
            },
            {
                "raw_content": "Well sadly, some sacrifices need to be made in order for our civilisation to enjoy the incredible benefits of allowing lawyers to use hallucinated legal precedents, Christmas cards with 5-legged reindeer with floating antlers and vibe-coded operating systems that shit their own livers out when you try and open the file explorer.",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "How long realistically is the Dram/nand shortage expected to last im hearing 2027?",
        "score": 8,
        "text_content": "how long is the shortage of nand and dram expected to last,few news is saying 2027.. some saying 2028",
        "comments": [
            {
                "raw_content": "Didn't SK hynix and Samsung both recently state they're not going to do production increases due to this increased demand? That suggests they know that a reactionary increase in production to meet current demand probably won't be a good/safe ROI/investment because they don't see this level of demand being maintained for an extended period of time. Edit: Micron says they wanna increase production apparently, so that seals it for me that SK hynix is doing the right thing and this surge in demand will abate. >!I had to. !<",
                "author": "GhostsinGlass"
            },
            {
                "raw_content": "They're raking in money. I bet as long as people will keep paying.",
                "author": "Xensa"
            },
            {
                "raw_content": "DRAM manufacturing has facilities overlap with HBM manufacturing, which means DRAM is not a priority now. When HBM sales and cash flow drops, Hynix and such will want to make money on DRAM again. HBM sales will drop when GPU sales drop. And GPU sales will drop when OpenAI blackhole is cut of from unlimited funding. Their lead researcher says benefits from scaling have ended, and they go back to research. That will not be well received by their creditors, so their debt will go bad. When that happens, it will be in the news, and in certain stock prices. Several months after that, DRAM manufacturers will get the memo. [https://www.youtube.com/watch?v=aR20FWCCjAs](https://www.youtube.com/watch?v=aR20FWCCjAs)",
                "author": "x7_omega"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "An OLED cheaper than 32GB of RAM.",
        "score": 103,
        "text_content": "https://youtu.be/403q5B6hhBQ",
        "comments": [
            {
                "raw_content": "I mean it's insane how this Black Friday you can get insane OLED HFR Monitor deals. Too bad the PC Hardware flips in different ways ever few years on price shocks to take advantage of them.,",
                "author": "Dangerman1337"
            },
            {
                "raw_content": "Imo a big problem with the AOCs QD-OLEDs (at least this one specifically) is that it has a firmware problem where in it's HDR mode it will only use the sRGB color gamut. It's definitely not a panel limitation because it's capable of a larger gamut in its SDR mode and other monitors with the same panel don't have the problem Considering that there are other QD-OLEDs with the same panel for the same price (271QPX E2 is the exact same price right now) that don't have this problem I just don't think the AOC QD-OLED is worth it.",
                "author": "veryrandomo"
            },
            {
                "raw_content": "In fairness, this says more about ram than anything else lol",
                "author": "darksamus8"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Supplies 60%+ of Google TPU HBM3E, Set to Remain Primary Supplier in 2026",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If there’s one thing that this AI gold rush has shined a light on, it’s the seemingly incestuous relationship between these 4-5 giant tech companies.",
                "author": "AcademicF"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Global add-in board market: $8.8 billion in Q3’25",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Data center GPU boards were up an average of 145.5% from last quarter. NVIDIA's market share is 92%, AMD 7% and Intel 1%",
                "author": "BarKnight"
            },
            {
                "raw_content": "Intel went from 0% to 1%? That's progress.",
                "author": "jasmansky"
            },
            {
                "raw_content": "I have zero trust in jonpeddie data. Has no correlation to actual financial data provided by the hardware companies.",
                "author": "T1beriu"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "It's a new month of Nintendo Switch 2 and Nintendo Switch releases. What's on your wishlist for December?",
        "score": 869,
        "text_content": "Note: Putting together these monthly release graphics for Switch 2 and Switch can be quite time consuming, and requires frequent alterations and additions due to the changing nature of release dates. As a result, this may be the last one.",
        "comments": [
            {
                "raw_content": "Metroid prime 4, I’ve been waiting 17 years for that game",
                "author": "GUNS_N_BROSES"
            },
            {
                "raw_content": "Very nicely made graphic. Well done and thank you for putting in the work for us to benefit from :)",
                "author": "RoughLifeguard6568"
            },
            {
                "raw_content": "Rouge Trader! Need to get FFT finished in the next 10 days.",
                "author": "SenseWitFolly"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You won't have to worry about Miles in Metroid Prime 4 info by eStarland",
        "score": 828,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Im OOTL with this, what did this character do?",
                "author": "Xpertxp"
            },
            {
                "raw_content": "I don’t know, I read from a leaker that it’s called Metroid “Beyond” because Samus dies and, in order to save the universe, Miles is forced to put on the armor and become the new Metroid. /s",
                "author": "cityscapes416"
            },
            {
                "raw_content": "So you’re saying the internet overreacted for the one billionth time?",
                "author": "ImJustAGuy2600"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Red Dead Redemption's mouse mode is the best implementation I have experienced yet.",
        "score": 132,
        "text_content": "Mouse mode in games can often be inconsistent, but this particular game offers a truly exceptional experience. The input delay is imperceptible, the default sensitivity is remarkably well-tuned, and the aiming mechanics are incredibly fluid. While it may not be my primary method of play, I must commend its impressive quality.",
        "comments": [
            {
                "raw_content": "Still says unavailable when I click switch 2 edition",
                "author": "grimydude"
            },
            {
                "raw_content": "no motion controls unfortunately :C",
                "author": "jpassc"
            },
            {
                "raw_content": "I feel stupid. How do I use mouse controls? I did the update",
                "author": "BusyBigBass"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So Rockstar has Switch 2 devkits",
        "score": 211,
        "text_content": "Red Dead Redemption now being 1440p/60fps is probably just the first step. They didn't get those devkits only to upgrade this one game. What do you think is next? I for one couldn't care less about GTA VI on Switch 2. Get that GTA Trilogy running as it should with full cars and people density at 4k/60fps. But above anything else, I want GTA IV.",
        "comments": [
            {
                "raw_content": "I would expect that red dead redemption 2 will likely be the next rockstar game we see come to switch 2",
                "author": "ThatsHowIMetYourMom"
            },
            {
                "raw_content": "I have no doubts they tried or are trying to make 6 run on it If they can get it to a good enough point to print it with their name on it is another question",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "RDR2 port is most likely",
                "author": "_Tezzla_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4 as No. 1 Best Seller!",
        "score": 230,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol, it would be significantly more shocking if it wasn't",
                "author": "jdrake7766"
            },
            {
                "raw_content": "Do people really get surprised when new games that release are the best selling games on the day they release?",
                "author": "Quick-Half-Red-1"
            },
            {
                "raw_content": "Somebody supposedly already got their hard copy of it and said it's pretty awesome.",
                "author": "Dren7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Everyone said RDR remaster launched today, but did it?",
        "score": 71,
        "text_content": "It shows Nintendo Switch 2 Edition on the main menu, and when pressed, it takes me to an error on the eshop. This mixed with the stated release date makes me think there may be a different version dropping tomorrow. Am I thinking about this correctly?",
        "comments": [
            {
                "raw_content": "I think it's tomorrow it releases. I'm pretty sure I saw December 2nd release",
                "author": "empanadas7"
            },
            {
                "raw_content": "It's been coming out in different parts of the world as they hit midnight on December 2nd. The update that went out today is just some kind of a prep update before the main one goes live, apparently as a Switch 2 Edition. Weirdly enough, the base Switch version got HDR support on Switch 2 even before the S2E.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "The update did but the actual performance improvements happen tmw. So I’ve been told lol",
                "author": "Pokeguy211"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Not sure what's up in the North American eShop but if anyone's wondering, RDR Switch 2 update is live in Asian regions. This is from Japan.",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "West coast hasn't hit midnight yet (14 minutes out as of writing), so that seems to be what it's waiting for.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Can confirm it’s on the US eShop, turns out it was midnight PT, got it now",
                "author": "IfYouVoteMeDown"
            },
            {
                "raw_content": "I got it about 12 hours ago in Australia works great actually picked up from my switch 1 save",
                "author": "profchaos111"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got hades 2 for €26",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, amazing deal! I thought I already got very lucky with my 31€ deal",
                "author": "julesvr5"
            },
            {
                "raw_content": "Enjoy!",
                "author": "Obienator"
            },
            {
                "raw_content": "Why?",
                "author": "Trami_Pink_1991"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 12/01/25",
        "score": 60,
        "text_content": "[https://pbs.twimg.com/media/G6EP\\_TfXYAEgf3l?format=jpg&name=small](https://pbs.twimg.com/media/G6EP_TfXYAEgf3l?format=jpg&name=small) **Small Sub Update: Going forward, we're going to limit Jez Corden's content to only his official reporting i.e. windowscentral links. No twitter replies/etc. Tiers will be recalibrated when you guys will get to do tier votes soon-ish around TGA.** Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Former Rockstar Employee Demo Reel](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1par1er/former_rockstar_employee_demo_reel/) * [Death Stranding 2: On the Beach has been rated for PC - Published by SIE](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p6vrb7/death_stranding_2_on_the_beach_has_been_rated_for/) * [MP1st: New Dead Rising Game in Development, Now Set In Hollywood](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p979xe/mp1st_new_dead_rising_game_in_development_now_set/) * [Dan Houser Left Rockstar Over Directional Dispute with Sam Houser](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p6awnb/dan_houser_left_rockstar_over_directional_dispute/) * [Destiny 3 has just been leaked to be in Early Development by Reliable Bungie leaker](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p6wq5v/destiny_3_has_just_been_leaked_to_be_in_early/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "KOTOR Remake that leads to a KOTOR 2 Remake",
                "author": "seceralnof"
            },
            {
                "raw_content": "I will go with Half-Life 3 being revealed, The Elder Scrolls VI being revealed, more gameplay of Halo: Campaign Evolved, the new Halo video game being revealed in 2026, a new Total War video game being revealed, that The Witcher 1 remake being revealed, Fallout 3 remaster being revealed in 2026. I will not give up on any of this video games being revealed this month or in the next four months in 2026.",
                "author": "OrSupermarket"
            },
            {
                "raw_content": "Hope never dies half life 3 this week",
                "author": "LostGuy242"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "u/source2leakaiml claims to have worked with valve on Half-Life 3 and alleges announcement on Dec 11th",
        "score": 220,
        "text_content": "https://www.reddit.com/r/valve/s/NXGDKwE2gt This user posted to r/valve and r/HalfLife the following text >I’m wiping this account tomorrow, but I wanted to drop the real leak. I don’t work for Valve, but I’m at a major AI/ML lab that partnered with them on the tech for Half-Life 3. The game is absolutely coming, and the announcement is imminent. >The breakthrough Valve was waiting for was the ability to handle physics—specifically fluids and destruction—using machine learning instead of expensive deterministic calculations. Put simply, Valve has integrated a pipeline into Source 2 that allows them to brute-force high-fidelity simulations to build ground-truth datasets. These datasets train models to predict physics interactions rather than compute them raw. >Think movie-quality water simulations, 1:1 structural destruction, and complex vehicle physics, all running smoothly on a mid-tier GPU. The hardware isn't solving the heavy math; it’s just making efficient ML predictions via pre-trained models. Half-Life 3 is effectively the tech demo for this advancement. It allows developers to create experiences with 100x the physical interactivity at less than 1% of the historical compute cost. It’s a genuine game-changer. Heavy \"my uncle works at valve\" vibes. But the stuff hes talking about at least makes sense to me anyway and seems plausible. So I figured hell why not post it.",
        "comments": [
            {
                "raw_content": "Too many details",
                "author": "AutomaticRoutine7677"
            },
            {
                "raw_content": "HAVE YOU EVER BET ON GAMING LEAK DISCOURSE WITH YOUR LIFE ON THE LINE?",
                "author": "Systemshock1994"
            },
            {
                "raw_content": "This is a troll, man.",
                "author": "AscendedViking7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Mike Straw: \"The date I was told hasn't passed yet, though not being able to get at least 2 other people to verify it has me really thinking Valve did have multiple dates to \"catch leakers\". Announcement date aside, source still believes it'll be announced this year w/ Spring 2026 release.\"",
        "score": 886,
        "text_content": "https://xcancel.com/MikeStrawMedia/status/1995610043887354108",
        "comments": [
            {
                "raw_content": "![gif](giphy|ekAmtmDDCAQOQ8Uaze)",
                "author": "LollipopChainsawZz"
            },
            {
                "raw_content": "![gif](giphy|SIKtMFLpcW8IGp7Fo9|downsized)",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "Its refreshing honestly seeing another decade of Half Life 3 leaks and rumours. I’ll see you guys in 2030.",
                "author": "Dependent-Cheek7109"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cory Barlog confirmed that the statue is NOT God of War related",
        "score": 891,
        "text_content": "[https://xcancel.com/LukeStephens/status/1995578668111040811](https://xcancel.com/LukeStephens/status/1995578668111040811)",
        "comments": [
            {
                "raw_content": "It is of course going to be Hellgate London 2",
                "author": "HemisphericCommonM"
            },
            {
                "raw_content": "It’s going to be Doom TDA dlc isn’t it",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "All I know is it's absolutely doing its job, building the hype for whatever it is. Just look at these comments for a proof of that! There's going to be so many disappointed people at the game awards!",
                "author": "Key-Chemistry6625"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jason Schreier says that the statue is NOT for a Diablo 4 expansion, won't say what it is for now but says \"it's a good one\"",
        "score": 1428,
        "text_content": "Via him on Resetera [https://www.resetera.com/threads/geoff-keighley-posts-cryptic-image-with-the-caption-regal-inspiring-thickness.1368046/post-148323163](https://www.resetera.com/threads/geoff-keighley-posts-cryptic-image-with-the-caption-regal-inspiring-thickness.1368046/post-148323163) >No idea where Jez is getting that, but this statue is not teasing the Diablo 4 expansion. (I don't currently plan on reporting what it is, sorry, but it's a good one.)",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "So far I've heard; * it's Diablo, then it ISN'T Diablo * it's God of War Egypt (EDIT: @ 7:11 PM EST, now it’s apparently NOT God of War) * it's Saros * it's an Oblivion Gate therefore it's Elder Scrolls related * it's Half-Life 3 * it's Doom * it's DMC 6 * it's FromSoftware Which all leads me to believe that it's actually going to be fucking Plants vs Zombies with ultra HD 8K Graphics",
                "author": "NeverendSuperior"
            },
            {
                "raw_content": "PEGGLE 3",
                "author": "Coolman_Rosso"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Justin Lin to direct Helldivers movie for Sony",
        "score": 284,
        "text_content": "Source: https://www.hollywoodreporter.com/movies/movie-news/helldivers-movie-justin-lin-sony-1236438370/ \"Justin Lin, best known for his work on the Fast and Furious action movies, is set to direct Sony Pictures’ and PlayStation Productions’ adaptation of Helldivers, based on the popular video game franchise from Arrowhead Game Studios. Lin will also produce the feature via his Perfect Storm Entertainment banner, along with Hutch Parker and PlayStation Productions’ Asad Qizilbash and Carter Swan. Gary Dauberman, the scribe behind the hit It and Annabelle horror movies, wrote the script.\"",
        "comments": [
            {
                "raw_content": "That second part of Fast X is never getting made lmao",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "You know what? Fuck it, sure. Fast and Furious are far from ‘high art’ but a Helldiver movie doesn’t and probably shouldn’t be that. Just dumb fun.",
                "author": "Gen6V"
            },
            {
                "raw_content": "But we already have a Helldivers film. It's called 'Starship Troopers'.",
                "author": "Minimum-Can2224"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Deadline Hollywood] 'God of War' receives two-season order at Amazon Prime Video",
        "score": 287,
        "text_content": "[Deadline Hollywood has broken](https://deadline.com/2025/12/god-of-war-frederick-eo-toye-production-casting-2-season-order-1236630007/) that Amazon Prime Video has officially ordered **two seasons** of the live-action *God of War* television series from *Battlestar Galactica* creator Ronald D. Moore. Emmy-winning TV director **Frederick E.O. Toye**, who directed episodes off Fox's *Alias*, Starz's *American Gods*, FX's *Shogun* (Directing for a Drama Series winner for \"Crimson Sky\") and Prime Video's *The Boys* and *Fallout* more recently, has also reportedly boarded the project to direct the first two episodes. Pre-production is currently underway in Vancouver, B.C. where they are moving forward with casting. *God of War* will be a co-production between Amazon MGM Studios and Sony Pictures Television under the PlayStation Productions label. No comments from any of the associated parties at present.",
        "comments": [
            {
                "raw_content": "Mark Wahlberg as Kratos, Tom Holland as Atreus. TGA announcement",
                "author": "ChuckMoody"
            },
            {
                "raw_content": "Let's get this money Joe Budden /s",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Will it follow the same formula as most high concept / budget shows where there will be a REALLY BIG action scene at the beginning and end of the season, mostly characters talking, and peppering in the smallest action scenes here and there that were probably all filmed on the same day but split across multiple episodes? How soon until we can see IGN with reviews like: Episode 4: Slog of war",
                "author": "Javerage"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "According to Variety, unannounced Sonic Spinoff Movie is scheduled to release on December 22, 2028",
        "score": 237,
        "text_content": "Source: [https://variety.com/2025/film/news/sonic-spinoff-movie-teenage-mutant-ninja-turtles-live-action-film-2028-release-dates-1236596459/](https://variety.com/2025/film/news/sonic-spinoff-movie-teenage-mutant-ninja-turtles-live-action-film-2028-release-dates-1236596459/) Couple of months ago Sega filed new trademark for \"Shadow the Hedgehog\": [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o18pgk/sega\\_files\\_a\\_new\\_trademark\\_for\\_shadow\\_the\\_hedgehog/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o18pgk/sega_files_a_new_trademark_for_shadow_the_hedgehog/) Possible Shadow spinoff movie announcement at the Game Awards?",
        "comments": [
            {
                "raw_content": "This must be what that statue in the desert is teasing.",
                "author": "iamreallytonyspogoni"
            },
            {
                "raw_content": "You mean to tell me sonic 3 set up two seperate sequels and this is one of them?",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "Bow your heads low all hail Shadow",
                "author": "I-wanna-fuck-SCP1471"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "First gameplay of PUBG: Black Budget, the new first-person shooter with extraction mechanics from the franchise.",
        "score": 176,
        "text_content": "The video was originally published on BilliBilli, I only managed to get this excerpt. [https://files.catbox.moe/6dp5uy.mp4](https://files.catbox.moe/6dp5uy.mp4)",
        "comments": [
            {
                "raw_content": "This is gonna have a rough go going up against Delta Force. I don’t like to be hyperbolic and I admittedly don’t know much about either game but at first glance they look very similar in every regard.",
                "author": "Gen6V"
            },
            {
                "raw_content": "Pretty sure this is the one with an injury system, you go back in next match with pros and cons from each game, or can spend money you extracted with to repair/upgrade your equipment and character. Like if you’re concussed your controls are inverted. Or if you have a punctured lung you’ll cough and enemies can hear you.",
                "author": "meme_abstinent"
            },
            {
                "raw_content": "ohhh shit this is probably what the statue is hyping up",
                "author": "Boomspark"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel's future \"Wildcat Lake Refresh\" low-end mobile CPUs said to come in two variants",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wildcat Lake has one mission: Put a Copilot+ capable NPU in low-end laptops. No point in buying Arrow Lake or its refresh at all.",
                "author": "Starks"
            },
            {
                "raw_content": "Since it has Xe3 I figure it'll be a really decent power efficient CPU for low end gaming. Only 64-bit memory bus though I heard from Jay himself, which is going to make the iGPU starved of bandwidth, but even intel N200 isn't half bad for older games like GTA V and its contemporaries. Another exciting thing is the power efficiency. No on-die RAM, but thanks to fewer cores and more advanced node, it could be even more power efficient than Lunar Lake easily. A budget handheld system with it would be fun to imagine. Hopefully the price and volume are right.",
                "author": "Johnny_Oro"
            },
            {
                "raw_content": "Crazy naming convention Lakes plus letters :)",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "The housing crisis is also a crisis of hopelessness as young Americans give up, hustle less, spend more and make risky investments as a last resort | Fortune",
        "score": 585,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And entire neighborhoods of renters, perhaps more transient in their location in life, so schools, employers, local activities, are created. Everything temporary and changeable. The identity of entire cities is changed, all in the name of “doors in a portfolio”.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Even as a youngish homeowner, I can tell you its hard. Our property tax on a \"starter home\" doubled this year and our home insurance has doubled since I bought the house a few years back. We also moved to a small town not a huge metro, so when young people are starting to lose hope I believe it.",
                "author": "Round-Importance7871"
            },
            {
                "raw_content": "Wait until they learn about retirement crisis They have no idea how hard US is screwing them",
                "author": "1234nameuser"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida Home Prices Could Spike Up to 9% Under Ron DeSantis' Plan To Eliminate Property Taxes",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still gotta pay that insurance.",
                "author": "hung_kung_fuey"
            },
            {
                "raw_content": "Yay! Now you get income or sales tax to offset!",
                "author": "Rude_Judgment7928"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Adjusted House Prices 3.0% Below 2022 Peak",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now if only we had some inflation adjusted wages",
                "author": "gwarm01"
            },
            {
                "raw_content": "3% below, so far.",
                "author": "TX_AG11"
            },
            {
                "raw_content": "lower top",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Inventory Only Down 4.3% Compared to Same Week in 2019",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spring listings are going to be interesting regarding supply.",
                "author": "DizzyMajor5"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "For those of you who bought a home in 2020/2021, has your home value declined?",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Difficult question to answer without actually putting it up for sale and selling it. Even comps in the same neighborhood doesn’t accurately capture what a sales price may when sellers need to move.",
                "author": "ICPcrisis"
            },
            {
                "raw_content": "Considering the inflation the US experienced in the past 5 years, there will probably almost be no houses that are actually lower in value than 2020/2021. The number that will have dropped in real terms accounting for inflation though would be interesting and much higher.",
                "author": "w4ffl3"
            },
            {
                "raw_content": "Went from $490k to about $750k Atlanta GA, eastside beltline area. My house is old and tiny any new construction or homes with a driveway/garage near here are over $1M.",
                "author": "Greedy-Mycologist810"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "$114k in equity but relying on overdraft to make my mortgage payment every month. Sell or stay",
        "score": 2,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro should be posting in personal finance, holy.",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "Their principal and interest even with a 3% down payment (which seems probable based on how much they owe now after 10 years) would only be like $580 a month. Insurance is $180 a month, that makes it $760. OP said their monthly payment is around $1200. I wonder how hard they're getting reamed by PMI. Edit: Even if they retreat and sell, they probably started with a $4k down payment and will walk away with about $80-100k. Not too bad.",
                "author": "Mediocre_Island828"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Breaking: OpenAI declares 'code red' to respond to threats to ChatGPT and improve metrics, will delay ads and other initiatives",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flashbacks to December 2022 when articles said Google declared Code Red against ChatGPT...",
                "author": "spryes"
            },
            {
                "raw_content": "I guess no 12 days of Christmas?",
                "author": "f00gers"
            },
            {
                "raw_content": "They realize competitors have caught up and then some. The past 3 years they enjoyed first mover advantage when everyone was trying to adapt to the new era ChatGPT popularized,, but now they realize they have to compete seriously for the first time against powerful Al models on par with their own. However, this time they have Google's full attention and is ready to use every arsenal of their resources to be on top.",
                "author": "Abby941"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A history professor says AI didn't break college — it exposed how broken it already was",
        "score": 212,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Someone had to said it out loud.",
                "author": "Euphoric-Taro-6231"
            },
            {
                "raw_content": "Most people go to college to get a job, not to learn. Companies could just train high school graduates directly and end the farce. Imagine paying a corporation $50,000 a year for four years as an intern to learn how to reply to emails and attend meetings. Insanity? Because the only difference is where the money goes.",
                "author": "___positive___"
            },
            {
                "raw_content": "Yup. Never understood the take home essay. The internet has already made it obsolete. If college is supposed to teach people to be able to form arguments around a topic then in class discussions and the Socrates method is much more effective. It’s much much harder to form an argument on the fly in person, and requires much much more knowledge about a subject. Reading a source and just rewording it (which is basically what I did for every single “research paper”) is not really testing anything. My law friends felt unprepared for their in person classes because they actually had to know their shit for fear their professor calls on them. That shouldn’t be the case.",
                "author": "brett_baty_is_him"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI's Mark Chen reaction to Gemini 3",
        "score": 241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow. A clip of a person saying absolutely nothing.",
                "author": "BurnieSlander"
            },
            {
                "raw_content": "I have a better internal model, you just wouldn’t know him, he goes to another school",
                "author": "Ireallydonedidit"
            },
            {
                "raw_content": "Strange. He talks in exactly the same cadence as Altman. Are they the same person?",
                "author": "gustinnian"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "That is actually cheap damn",
        "score": 1315,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good, make Google and OpenAI dance",
                "author": "Buck-Nasty"
            },
            {
                "raw_content": "I tested Deepseek V3.2 Speciale and it's really very good, its design is much more refined. It's like a kind of R2.",
                "author": "Pink_da_Web"
            },
            {
                "raw_content": "Is it on par with Gemini 3.0 pro though?",
                "author": "dano1066"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The METR evals for Gemini 3.0 and Opus 4.5 are taking incredibly long--GPT 5.1 codex max was benchmarked almost instantly as well as others. Why is that?",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time horizon so big the bots are still working on their tasks right now /s",
                "author": "Spoony850"
            },
            {
                "raw_content": "Even epochAI finished their entire suite of benchmarks",
                "author": "gbomb13"
            },
            {
                "raw_content": "Anthropic and Deepmind probably aren’t giving Metr free credits so they don’t want to evaluate their models",
                "author": "jaundiced_baboon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Work culture at Deepseek",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good for them",
                "author": "DatDudeDrew"
            },
            {
                "raw_content": "Sane working hours and open-mindedness towards interns and junior workers, indicating a better work culture overall, translating into better, if not class-leading products? How unusual.",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "Source? Anyone can write some words and claim anything.",
                "author": "Cold-Programmer-2524"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Apple AI Chief John Giannandrea Retiring After Siri Delays",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Apple have royally fumbled this. Last I heard they were trying to take Mistral under their wing,they've just released an open model, there's talk of Gemini powering their devices, something about a smart lamp, all that money invested in the M series...there doesn't seem to be any kind of cohesive strategy",
                "author": "Mighty-anemone"
            },
            {
                "raw_content": "Can someone who knows more about corporate culture explain why it takes so long to get rid of an executive when they're obviously underperforming? Apple lost potentially billions of dollars.",
                "author": "Klutzy-Snow8016"
            },
            {
                "raw_content": "- Get hired - Get paid - Do nothing - ??? - Leave",
                "author": "laddie78"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Harmonic Aristotle Solves 45 Year Old Erdos Problem",
        "score": 110,
        "text_content": "Mathematical Superintelligence is in sights",
        "comments": [
            {
                "raw_content": "Oh, hey, I was the one who proved this first (I'm Acer). Aristotle produced a bit of a weird lower bound to me, but the argument essentially follows similar logic. Pretty cool stuff!",
                "author": "KStarGamer_"
            },
            {
                "raw_content": "Honestly it's pretty annoying to just get a random tweet that we can't even click to. Why not give a link to the stuff they're talking about?",
                "author": "tete_fors"
            },
            {
                "raw_content": "There should be a rule that if you post a screenshot of a post from X you must include the damn link!",
                "author": "vasilenko93"
            }
        ],
        "subreddit": "singularity"
    }
]