[
    {
        "post_name": "I still can't believe this is real",
        "score": 711,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If CNN is capitalizing \"White\" it means the Overton window has shifted",
                "author": "jsphere256"
            },
            {
                "raw_content": "Ain't nobody got time for dat!",
                "author": "mydogma8yourkarma"
            },
            {
                "raw_content": "If you're black, and you're using anything more technologically advanced than drums to communicate, you may be using 'digital white face'.",
                "author": "edxzxz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon Musk exposes MASSIVE FRAUD in blue states — using federal welfare to make “slush funds” for illegal aliens ...The scam level here is so STAGGERING.” [e.g. They were giving out debit cards for $10K!]",
        "score": 749,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This fraud exists in every single agency. The bureaucracy needs to be gutted",
                "author": "awsure"
            },
            {
                "raw_content": "I am so proud of Elon. He has so much courage.",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "Somebody Hispanic who was in America legally and could speak English and Spanish went to New York City and told them in Spanish he was in the USA illegally. They gave him one of those $10,000 debit cards. It’s that crooked and that easy.",
                "author": "ViagraFalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Elon says that “if Trump had lost, there would have never been a real election again”. Why? Because Trump is enforcing the border and deporting the illegals that the Dems use to steal elections. Most people don’t understand how severe our situation is.",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's why Europe is beyond fucked. They can not vote their way out of their situation.",
                "author": "Dem_slayer"
            },
            {
                "raw_content": "I think the majority of Americans could be living like people who end up with $100,000 a year after taxes if it wasn’t for all the corruption. This doesn’t include the lazy and incompetent, but most of us would be doing so well. It’s so hard to see and comprehend this. Maybe that number would be even higher, but really it’s just a guess.",
                "author": "ViagraFalls"
            },
            {
                "raw_content": "Nah. Most of us knew. That's why most of us voted for Trump. We still know. That's why we wholeheartedly support the deportation efforts. Whether it takes sending in the National Guard or not. We also support election reform. Fix it before it can't be fixed.",
                "author": "Boomstikchik"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: A large crowd of teens outside of the Navy Yard metro station in Washington DC have gathered once again, starting fights with members of the National Guard. 🚨",
        "score": 466,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mow them down. They're nothing but future felons",
                "author": "UCantStumpTheTrump"
            },
            {
                "raw_content": "are these actual teens or Juneteens?",
                "author": "popcycle"
            },
            {
                "raw_content": "When I was a teen we were busy playing games, drinking, hanging out with our friends, and trying to get laid. Deliberately going and trying to assault members of the military wouldn't have come up as a way to spend Friday night. If this is their idea of a good time we should skip strikes 1 and 2 and just go straight to locking them away for life.",
                "author": "9999999999"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A local news report said immigration agents were seen wearing Halloween masks in L.A. When asked about the report, a DHS spokeswoman said, “Happy Halloween!” — NBC",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based.",
                "author": "One-Man_Riot"
            },
            {
                "raw_content": "https://www.nbcnews.com/news/us-news/happy-halloween-dhs-spokeswoman-responds-report-immigration-agents-wea-rcna241105",
                "author": "hocuspocusfocusjeep"
            },
            {
                "raw_content": "The link is worth clicking on, the masks are fucking hilarious.",
                "author": "RentFree2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Political commentator Brad Todd drops a bombshell, saying, \"In fact, we know the 2020 CENSUS, the errors were almost always to the DETRIMENT of RED STATES.\"",
        "score": 1035,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am shocked!",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Old, old news. Months old. This was all over the net when it was first announced including here. It's hilarious and telling that CNN is just reporting it now.",
                "author": "JackLemon"
            },
            {
                "raw_content": "No way.",
                "author": "BidensfullAFdiaper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Linda McMahon: Trick or Treat 🤣",
        "score": 1243,
        "text_content": "",
        "comments": [
            {
                "raw_content": "based",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "and the award for scariest costume goes to...... Randi Weingarten, as \"Human\"",
                "author": "Bohemyth_2"
            },
            {
                "raw_content": "Link https://x.com/EDSecMcMahon/status/1984302275880157496",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Adam Carolla breaks down the average weight of a person receiving SNAP Food Stamps in America",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well they buy all junk food",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Is this why poor people are fat?",
                "author": "DCPower"
            },
            {
                "raw_content": "We need fat shaming more than ever. Fat acceptance is really more cruel.",
                "author": "KekistanPM"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MAHAlloween",
        "score": 637,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love it so much he is so wonderful lol",
                "author": "grannylovestrump"
            },
            {
                "raw_content": "Kek",
                "author": "RedWave26"
            },
            {
                "raw_content": "Funny!",
                "author": "LiskaEman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mad Maxine goes true form for Halloween.",
        "score": 822,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That hair actually makes her look slightly better than normal.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "Should have been medically recalled already.",
                "author": "GreyKnight"
            },
            {
                "raw_content": "Nicely done.",
                "author": "pepperonishoes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump shows he cares about Americans and WILL look into how he can give SNAP to all Americans who need it following a court ruling.",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck. I really wanted the show.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "So wait a fucking second. My wife, who is a Veteran and a Civil Servant for the Department of War, and is essential and required to work. Does not get paid. But people who don't work, are going to get paid? WTF! Thanks for fucking nothing.",
                "author": "ravonaf"
            },
            {
                "raw_content": "I was *REALLY* looking forward to Level 5 Chimpouts. Like Black Friday at Walmart on steroids, HGH, and Crack. Hey who knows, it still may happen.",
                "author": "LandscaperJuan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Pure chaos in Albany Park, Illinois as insurrectionists obstruct and terrorize DHS agents. One insurrectionist was pulled hard from his vehicle and arrested.",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Modern women. Worthless.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Insurrectionist = shrieking harpies",
                "author": "Pede45"
            },
            {
                "raw_content": "Liberal white women.",
                "author": "Overtaxed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "J.D. Vance on TikTok: Happy Halloween everyone, remember to say thank you while you trick or treat!",
        "score": 908,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Haha! I almost forgot what a normal person is like. They’re like JD!",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Meme’d into reality.🤣",
                "author": "Return_Of_EpicTrump"
            },
            {
                "raw_content": "JD gunning for that 2028 spot at light speed",
                "author": "realPhantomFuck"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Happy Halloween!",
        "score": 1422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His TP USA performance was impressive. No idea how this millenial from the mountains has the eloquence of the founding fathers.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "I have so much hope for 2028!",
                "author": "TheLivingExample"
            },
            {
                "raw_content": "Harry Sission: Cries for two weeks over a meme mocking him. JD Vance: Here’s me as a serial killer. Happy Halloween.",
                "author": "ChrisSuperDude"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Seattle far-left woman named Hannah Saunders criticises her Antifa comrades for letting a flyer for a planned violent attack get in the hands of an outsider....",
        "score": 727,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is the nose ring a dog whistle?",
                "author": "Oldman1234"
            },
            {
                "raw_content": "It's a fucking cult.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Jesus Christ. They plan a violent attack, and conservatives respond with “I’ll bring muh camera!” The weakness of the right will be the death of the right.",
                "author": "Snooptwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Imperialism",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Islam destroyed beautiful cultural garb and put shapeless black bags on women. And stones them to death for the crime of being raped.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "Great video, Miss Magenta. Very informative and excruciating. All those areas are blasé SHITHOLES now instead of exciting places to visit.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "Isn't it muslim imperialism?",
                "author": "DebunkTheLeft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "KEEP YUR POWDER DRY!",
        "score": 1295,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep saying if New Yuck falls, the rest of America is next. They will run the same playbook over and over. Exactly what the narrator of this video said.",
                "author": "Patriot4TN"
            },
            {
                "raw_content": "Lol... Can't wait for NYC to get the ultimate comeuppance that they voted for.",
                "author": "loooooof"
            },
            {
                "raw_content": "I follow a few very politically active Marxists on social media and they all view their comrade Mamdani as the first step in their \"revolution\".",
                "author": "TD_Covfefe_Crusader"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SNAP: You paid for it.",
        "score": 1142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "sigh",
                "author": "SHILL_DETECTOR"
            },
            {
                "raw_content": "are we finally done paying federal income taxes?",
                "author": "Deplorable556"
            },
            {
                "raw_content": "Does this bitch have brain damage? Can't understand a damn thing she said.",
                "author": "Pofus_Poopants"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O'Keefe's Thriller (2018? 2022?)",
        "score": 542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My God, Project Veritas was fucking EVIL to harm this man. I’m going to donate to OMG now.",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "James got the moves",
                "author": "N7fury"
            },
            {
                "raw_content": "Very entertaining.",
                "author": "libsaremental"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Feliz Halloween",
        "score": 453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A glass of water?",
                "author": "geckogreen"
            },
            {
                "raw_content": "ICE ICE baby!",
                "author": "Mortal_Wombat"
            },
            {
                "raw_content": "I NEED CONTEXT!",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD clarifies that RDNA 1 and 2 will still get day zero game support and driver updates — discrete GPUs and handhelds will still work with future games",
        "score": 363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does it mean \"clarifies\"? Was the previous claim of no day zero drivers made up by someone else?",
                "author": "None"
            },
            {
                "raw_content": "> New features, bug fixes and game optimizations will continue to be delivered as required by market needs in the maintenance mode branch. This is the statement AMD gave to TH. TH is assuming this means day-zero updates and reporting as if that is factually the case.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "This to me is just a fine example of corporate weasel wording. \"New features, bug fixes and game optimizations will continue to be delivered as required by market needs in the maintenance mode branch\" does not in any way mean that RDNA1 and RDNA2 cards will get game optimizations. AMD after all can simply deem that \"market needs\" do not include optimizations for \"insert popular game of the year number 2\" , only \"game number 1\" in 2026, and no games after that. So no, unless they fully commit to providing game optimizations and full game driver support for an architecture that launched five years ago and is still being shipped in mobile and other products in 2025, I don't buy it. It's about trust, and lack of it.",
                "author": "Nordmuth"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung sells out of 2026 HBM4 supply as memory resurgence continues",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "people like should I wait 2 months to buy ram? No! Buy now or you will not be able to buy it. I wanted 64gb of ram. It's $500 now for a decent kit. I don't absolutely need it, so I can wait. But I guarantee ram prices won't normalize until mid 2027 at the earliest.",
                "author": "theRealtechnofuzz"
            },
            {
                "raw_content": "that seems like a bad thing",
                "author": "LuminanceGayming"
            },
            {
                "raw_content": "I have lucky that i got a 32gb ddr5 6000mhz dual channel kit for 100 euros, but this price today cost now 140 euros. It is just insane! Same on DDR4 by the way. Yeah this goes worse on this date",
                "author": "AntiGrieferGames"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "A 'war room' mentality: How auto giants are battling the Nexperia chip crunch",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.reuters.com/sustainability/society-equity/us-announce-that-nexperias-chinese-facilities-will-resume-shipments-source-says-2025-10-31/ Skip the queue and just speak with the manager is the quicker way to get things resolved apparently",
                "author": "NonamePlsIgnore"
            },
            {
                "raw_content": "There is no supply shortage, because Nexperia is importing from China anyways. It is just they need time to find a new supplier in China, and current production would have to be halted while they wait.",
                "author": "TK3600"
            },
            {
                "raw_content": "I love Nexperia PMEG Schottky’s as much as the next EE, but why would these companies be single sourced to Nexperia of all things? I get it with like a TI SOC or extra fancy ADC. But this seemed like a likely issue in 2021 with Nexperia. Like why wouldn’t you have at least 24 weeks of safety stock. And why not design in Diodes Inc / Panjit / Infineon / OnSemi / Ti etc parts considering how geopolitics have been going.",
                "author": "NewKitchenFixtures"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Clarifies: USB-C Power Delivery Not Disabled on Radeon RX 7900 XTX",
        "score": 147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To think this was supposed to be used as a single universal wire for high end VR headsets…",
                "author": "MairusuPawa"
            },
            {
                "raw_content": "Usb-c pd is something I wish was more standard on GPUs.",
                "author": "samtheredditman"
            },
            {
                "raw_content": "A feature so wildly used that AMD have to confirm it still works instead of someone simply testing it.",
                "author": "Mean-Minimum1311"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nvidia strikes AI alliance with S.Korea, pledges 260,000 GPUs worth $9.8 billion by 2030",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The libraries, frameworks and software stack that Nvidia offers on top of Cuda and their GPUs are the real moat. Stuff like Omniverse, Cosmos, Culitho, TensorRT, CuDNN, Dynamo, Nemotron, Groot, Isaac, Drive, Earth-2, Arial and a lot more. The best or worst part (depending on your view)? You get locked in the Nvidia ecosystem with these.",
                "author": "From-UoM"
            },
            {
                "raw_content": "Both NVIDIA and the S.Korean gov't confirms that this brings S.Korea to the third spot in the number of GPUs after the US and China",
                "author": "self-fix"
            },
            {
                "raw_content": "\"Alliance\"? You mean theyre selling them GPUs.",
                "author": "Spright91"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung building facility with 50,000 Nvidia GPUs to automate chip manufacturing",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How does a GPU automate chip manufacturing?? Don't you need robots/machines for that, rather than solid-state devices?",
                "author": "ProjectPhysX"
            },
            {
                "raw_content": "I think that's how they started skynet tho",
                "author": "Prestigious_Sir_748"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Electronics in talks with Nvidia to supply next-generation HBM4 chips",
        "score": 19,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Mini PC maker Minisforum to hike prices on all models with SSDs and DRAM, cites 'significant increase in our overall costs'",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should be ready to send a new notification next week since RAM prices are going up 20% each week",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "If it's not GPUs, it's RAM, and if it's not RAM it's NAND. This AI bullshit cannot end soon enough. Shame the people who are running this scam are too rich to be punished.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "At least barebones aren't changing. Unless you were buying these for family/friends the barebones and buying your own storage/RAM was always a better deal anyways.",
                "author": "zeronic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Did you know there is a brand new, constantly delayed, HIGHLY ANTICIPATED Metroid Prime game coming out in a little more than a month? Yeah, apparently neither does Nintendo!",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Er duh, they already marketed it months ago 🤪 https://preview.redd.it/nw0j3a9sfjyf1.png?width=1920&format=png&auto=webp&s=6e5105b238acefdb34173a2bfb17e85ed849f113",
                "author": "TheLimeyLemmon"
            },
            {
                "raw_content": "As soon as age of imprisonment comes out the campaign will begin. Don’t worry",
                "author": "BOBBIESWAG"
            },
            {
                "raw_content": "Hyrule Warriors and Kirby Air Riders come out much sooner. I wouldn't expect much more than a overview trailer for Metroid Prime 4.",
                "author": "Jaketrix"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Games Are Set To Look Better Than Ever With This New Tech",
        "score": 504,
        "text_content": "Yes the article is five days old but a lot of UE5 games that use Lumen will need this “Irrandiance Cache” to easily be ported to Switch 2. However “Irrandiance Cache” is still in a very early state, so don’t expect any UE5 ports to suddenly be revealed for 2026. To take a shot in the dark there might be an influx of UE5 games on the NS2 in 2027. Possibly games such as Halo Campaign Evolved and Claire Obscure Expedition 33. Though take by wild guess with a lot of salt.",
        "comments": [
            {
                "raw_content": "I'll believe it when i see it",
                "author": "ambachk"
            },
            {
                "raw_content": "I‘m a bit of a sceptic when it comes to ue5 games. Seen too many digital foundry videos where performance has been criticised on all consoles.",
                "author": "lemonchemistry"
            },
            {
                "raw_content": "Let the stutter begin.",
                "author": "ResortOriginal2001"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hyrule Warriors: Age of Imprisonment demo has been added to Nintendo Switch 2 kiosks",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everywhere but as a downloadable demo for the console at home 😔",
                "author": "ExploringThisSite"
            },
            {
                "raw_content": "wish they made it downloadable at home",
                "author": "zarif2003"
            },
            {
                "raw_content": "I played it and for anyone who has the time it’s well worth it imo.",
                "author": "Rawkhawkjayhawk"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is my JoyCon cooked?",
        "score": 97,
        "text_content": "Just got a new pair of JoyCon 2s. The left one is fine. The joystick on the right one is stuck at twelve o’clock. If I rock it left and right, I can get it to go between 10 and 2, but nowhere else. In the calibration screen, it just stays dead center. I can’t get it to do anything there. Anything I can do? Or is it just bad and needs to be refurned? Thanks.",
        "comments": [
            {
                "raw_content": "You just bought them, so they are new. Just return them and get another pair.",
                "author": "RoughLifeguard6568"
            },
            {
                "raw_content": "Before trying to return them, try calibrating first. I know you said it stays stuck in the middle, but for some reason, if you leave it for up to 30s in that screen you'll be able to move it and actually calibrate it. Hope this helps.",
                "author": "okomarok"
            },
            {
                "raw_content": "cooked like a well done steak just return em",
                "author": "Reddity65"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Losing bunch of cosmetics in Star Wars Outlaws offline mode",
        "score": 12,
        "text_content": "I have to go online to go back to the delivery crate to get them all back. It's not that big of deal. But the Kessel Runner paint job for my ship and bike are timed exclusive, expired at November 3rd. I'm afraid I can't get them back after that if I ever go offline.",
        "comments": [
            {
                "raw_content": "It's tied to your Ubisoft account isn't it",
                "author": "Re7oadz"
            },
            {
                "raw_content": "Oh, I didn't realize the cosmetics were timed. I better jump on that tomorrow.",
                "author": "Fenicillin"
            },
            {
                "raw_content": "My kay rocking the same cape thing",
                "author": "RyeC77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws on sale on eshop",
        "score": 104,
        "text_content": "Already at -25% on EU Eshop ! I’m still waiting for blackfriday hoping that it will be a -40% !",
        "comments": [
            {
                "raw_content": "It's a ubisoft game so it will surely drop even lower as they traditionally have.",
                "author": "Massive_Fly_1709"
            },
            {
                "raw_content": "Very good deal! But it ends on November 11th…",
                "author": "OtherwiseEmployee202"
            },
            {
                "raw_content": "I don’t know why Ubi soft does this to themselves. Why condition consumers to wait for price drops that come so soon. I will never buy a Ubi soft game at launch. Why would I? I waited a year to play Prince of Persia. It was great. I got it for like 80% off. I feel bad because the developers deserve success.",
                "author": "peter-man-hello"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Music was released exactly 1 year ago. How are you feeling about it now?",
        "score": 232,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I use it for ambience music in the bookstore where I work. Especially the animal crossing playlists",
                "author": "lostbelmont"
            },
            {
                "raw_content": "It’s great in concept, but Nintendo has 4+ decades worth of music content, and it’s insane how slowly they’ll drip-feed content for even this. Another thing, I wish more songs had Extended Play. If a song loops in the game, then it should have an Extended Play in the Nintendo Music app.",
                "author": "PokDigi"
            },
            {
                "raw_content": "I use it almost everyday. Great app.",
                "author": "Superopticien"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Games Releasing November 2025",
        "score": 72,
        "text_content": "Definitely not as Juicy as last year but there are still quite a few Great Games coming out! If you need a better view or you see something you're interested in and want a trailer (it's at the end) check out the link! Link: https://docs.google.com/spreadsheets/d/1EbGHsJjxt4VrpD8_0jPZn2JMB7WNz945S1hFgfXWddg/edit?usp=drivesdk",
        "comments": [
            {
                "raw_content": "I’m gonna get: Hyrule Warriors Kirby Air Riders I might get Atelier Ryza I’ve never played an Atelier game before.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "I am really excited for Hyrule Warriors and Kirby Air Riders this month and then we get Metroid Prime 4 next month.",
                "author": "aPiCase"
            },
            {
                "raw_content": "This has been a great year for gaming",
                "author": "Silver_Song3692"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Jason Schreier: ‘Grand Theft Auto’ Studio Accused of Union Busting After Firings",
        "score": 1241,
        "text_content": "[https://www.bloomberg.com/news/articles/2025-10-31/-grand-theft-auto-studio-accused-of-union-busting-after-firings](https://www.bloomberg.com/news/articles/2025-10-31/-grand-theft-auto-studio-accused-of-union-busting-after-firings) Take-Two Interactive Software Inc.’s Rockstar Games fired dozens of employees in a move that a British trade union said was designed to prevent the workers from unionizing. The company said they were fired for misconduct. The *Grand Theft Auto* maker terminated between 30 and 40 staffers across multiple offices in the UK and Canada on Thursday, according to a spokesperson for the Independent Workers’ Union of Great Britain (IWGB). All of the employees were part of a private trade union chat group on Discord and were either members of the union or attempting to organize at the company, the union spokesperson said. “Rockstar has just carried out one of the most blatant and ruthless acts of union busting in the history of the games industry,” Alex Marshall, president of the IWGB, said in a statement. “This flagrant contempt for the law and for the lives of the workers who bring in their billions is an insult to their fans and the global industry.” Alan Lewis, a spokesman for Take-Two, said the firings were “for gross misconduct, and for no other reason” and that “we fully support Rockstar’s ambitions and approach.” Rockstar has doubled down on security following a massive leak in 2022 that released dozens of videos of unfinished footage from the company’s next game, *Grand Theft Auto VI*. In early 2024, the company was criticized by the union for asking workers to [return to the office five days](https://archive.ph/o/X0HLY/https://www.bloomberg.com/news/articles/2024-02-28/-grand-theft-auto-maker-tells-staff-to-return-to-office-five-days-a-week) a week. Rockstar said the return to office decision was partly for security reasons. *Grand Theft Auto VI* is slated for release on May 26, 2026 and is expected to be one of the top-selling video games of all time.",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "IIRC Jason also did a story about Rockstars crunch culture in the past. I think I heard things had gotten better but maybe this is old habits kicking back in the closer we get to launch. I think Naughty Dog was the other company with a heavy crunch culture Jason ran a story about at around the same time. Wonder how things are going over there, they are on record saying they ‘don’t want that reputation anymore’ after Tlou 2 and I want to believe things have gotten better but obviously a lot has of skepticism. Either way, watch people not care about this story because they are more concerned about getting to play GTA VI.",
                "author": "Gen6V"
            },
            {
                "raw_content": "They must have had some quite strong evidence of gross misconduct because you can’t just fire people in the U.K Ie this will more then likely be brought to a employment tribunal and investigated Workers rights are much stronger here and you have to have proper evidence if you fire someone for gross misconduct Is fully legal to organise a union in the uk and something a company can’t fire you for",
                "author": "Responsible-Cow-3548"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A former Bends Studios employee said the live service project was canceled because there was no substantial progress in the three years of development.",
        "score": 340,
        "text_content": "https://imgur.com/a/EtyEzlE Robert Morrison, who worked at Bend from July 2022 to June 2025 as a senior animator on the live service project he calls \"Mirror Pond\" on his LinkedIn profile, also stated that the project used the Decima Engine.",
        "comments": [
            {
                "raw_content": "''Bends''",
                "author": "ayyybro123"
            },
            {
                "raw_content": "I mean that’s a bend problem to be quite honest. If you have nothing to show for 3 years of work, that’s bad studio management",
                "author": "DaftNeal88"
            },
            {
                "raw_content": "Folks will likely blame the fact that it was a live service but as a 20 years game industry vet that exact story is much more prevalent then people think for all kinds of games not just live service.",
                "author": "ComprehensivePaper22"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New extended 3-minute intro cinematic leaked from Marathon Closed Technical Test",
        "score": 211,
        "text_content": "[Source](https://thegamepost.com/marathon-nda-technical-test-leak-intro-cinematic-story/)",
        "comments": [
            {
                "raw_content": "Idk man, big disclaimer I know basically nothing about the original marathon. But the story stuff/lore and videos that’s been released and teased for this game is cool as shit to me. Just hope the rest of the game turns out good, I’ve seen a fair few people say the most recent test was quite a bit more positive but we’ll see I guess.",
                "author": "Gen6V"
            },
            {
                "raw_content": "This was a very cool and unique intro! Makes me want to play the story mode. If only",
                "author": "slowclub27"
            },
            {
                "raw_content": "Sucks that this cool ass and unique artstyle belongs to a game on such a tight rope right now. Hopefully it does well. ARC Raiders is sounding to be awesome, but good god do their skins and aesthetics look dull",
                "author": "OneBadNightOfDrinkin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Full Simpsons Fortnite Battle Pass revealed - Evil Homer, Witch Marge, Stupid Sexy Flanders",
        "score": 178,
        "text_content": "https://xcancel.com/DiscussingFilm/status/1984336572075123115 https://xcancel.com/HYPEX/status/1984335207248564707",
        "comments": [
            {
                "raw_content": "Stupid sexy flanders? He's gonna solo fortnite lol.",
                "author": "Salt-Geologist519"
            },
            {
                "raw_content": "\"feels like I'm wearing nothing at all\"",
                "author": "zrkillerbush"
            },
            {
                "raw_content": "this isnt a leak",
                "author": "OperationBrokenEagle"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill 2 has been rated for Xbox Series X/S",
        "score": 614,
        "text_content": "This just showed up on the ESRB website: https://www.esrb.org/ratings/40337/silent-hill-2/ This aligns with recent claims made by NateTheHate and DuskGolem: https://www.reddit.com/r/GamingLeaksAndRumours/s/siDooiD1MC No word on a Switch 2 rating yet, though.",
        "comments": [
            {
                "raw_content": "Genuinely didnt know it wasnt on Xbox until it started being rumored",
                "author": "Waste-Reception5297"
            },
            {
                "raw_content": "would be funny if it just shadow dropped onto Xbox today, which is Halloween.",
                "author": "Game_Changer65"
            },
            {
                "raw_content": "Maybe revealed during the coming Partner Showcase. Hopefully its Play Anywhere; Silent Hill f was. Definitely gonna double dip if it is.",
                "author": "NfinityBL"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "I froze Intel’s Arc B580 to 3350 MHz. It loved it.",
        "score": 74,
        "text_content": "So, I took a Maxsun B580 iCraft and ran it like it owed me money. Using a 3D printed mount for an LGA1156 CPU water block, I ran automotive coolant through it sitting at around –15C, and pushed voltage from 25mV all the way up to 70 mV. Anything past 60 bounced it off the power limit, but 50–55 was the sweet spot, clean scaling, no throttling, no driver tantrums. Power limit stayed maxed at 120 and core +300. It took me a long time to dial it in, but once I did she was one happy Arc. Stock clock is 2850 MHz. Under ice it held 3316 MHz sustained, +466 on the core. That's a 16% uplift! While load temps hovered around 20C. It actually set the top 4 graphics score for the B580 on Time Spy, and top overall. Briefly hitting 3350 MHz during the run. Then the coolant started warming up before I could even start the game runs, it takes 48 hours to re-chill, and by the time I hit Forza, the loop was half slush, half soup. It still pulled 16 percent average uplift in games, matching the 16 percent clock uplift. Cyberpunk 107 - 120 Forza 5 158 - 174 MHW 60 - 69 This was all on a stock card, no BIOS or any Voltage mods. After the initial 1.5 hours of tuning it took me to get there, the card never freaked out, no crashes or black screens... just quiet, consistent scaling. (Unlike Nvidia, Intel doesn't just crash the driver, the whole system restarts... annoying) I didn’t expect Intel Arc to like the cold this much, especially after my last discovery with AMD. I think there’s still headroom left, contact wasn’t perfect, and the coolant was becoming a warm bath mid run. I will definitely have to give this thing another go... maybe in transmission fluid next time. There is a video if you want to see the excitement. [https://youtu.be/g9EUn-g8RBU](https://youtu.be/g9EUn-g8RBU)",
        "comments": [
            {
                "raw_content": "Try the shunt mod",
                "author": "nero10578"
            },
            {
                "raw_content": "Cool, errr... icy",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Are you in the US? If so how were you able to get Maxsun?",
                "author": "quantum3ntanglement"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Samsung Galaxy Book6 Pro to feature Core Ultra 5 338H Panther Lake CPU",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's a 10 Xe core config of PTL? I thought there were only [4 or 12 Xe cores configs](https://www.techpowerup.com/review/intel-panther-lake-technical-deep-dive/4.html)",
                "author": "Rocketman7"
            },
            {
                "raw_content": "Ooo, a reason to upgrade from my Samsung Galaxy Book 2 Pro",
                "author": "WolfishDJ"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD clarifies that RDNA 1 and 2 will still get day zero game support and driver updates — discrete GPUs and handhelds will still work with future games",
        "score": 771,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Either they backtracked or just another case of AMD having a horrible pr and marketing department",
                "author": "GenFatAss"
            },
            {
                "raw_content": "what the heck does market needs means? Only if AMD users demand such game optimizations **per title** > \"New features, bug fixes and game optimizations will continue to be delivered as required by **market needs** in the maintenance mode branch,\" an AMD spokesperson told Tom's Hardware.",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "Tom's Hardware is taking this line: \"New features, bug fixes and game optimizations will continue to be delivered as required by market needs in the maintenance mode branch\" and claiming zero day driver support. This is just PR weasel wording, it does not in any way mean that RDNA1 and RDNA2 cards will get game optimizations. AMD after all can simply deem that \"market needs\" do not include optimizations for \"insert popular game of the year number 2\" , only \"game number 1\" in 2026, and no games after that. RDNA2 launched five years ago, had a dGPU launch in 2023 two years ago and is still being shipped in mobile and other products in 2025, maintenance mode with a pinkie promise of game driver optimization support isn't enough for me, sorry.",
                "author": "Nordmuth"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD corrects error, confirms Radeon RX 7900 USB-C port still delivers power",
        "score": 443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mistake or not, a line like that making it into driver release notes in the first place certainly doesn't reflect well on AMD's driver team.",
                "author": "kb3035583"
            },
            {
                "raw_content": "...keep going AMD, you can do it... roll it all back.",
                "author": "PJBuzz"
            },
            {
                "raw_content": "Damn if that happens my whole setup would get cooked. I run a portable type c monitor with my sff build",
                "author": "mintyjad"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD clarifies RDNA1 and RDNA2 will continue receiving game optimizations based on \"market needs\"",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damage control after fucking up customer relation.",
                "author": "ColdStoryBro"
            },
            {
                "raw_content": "We need Vulkan support as well! The notes point to never getting FSR4 for Vulkan and decoder support as well. Firefox is merging with the Linux version so hardware acceleration might end up relying on it in the future. Also other apps like DXVK and other layers will be hurt by this segmentation and already dropped old GPUs.",
                "author": "ShogoXT"
            },
            {
                "raw_content": "I feel like they should have just not said anything about maintenance mode. They clearly don't know what their plan is.",
                "author": "Woffingshire"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire launches Edge AI Mini PC series, featuring Ryzen AI 340/350 and HX 370 variants",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They really haven't improved on their spotty communication, seeing that the MSRP is blank. The soft launch was in March and ended in silence. In June the product pages launched in an incomplete state and weren't fixed until a week later, along with it some B2B vendors had them listed for a short moment. In August more listings appeared before being changed to \"currently unavailable\" as well. Based on the direct email exchange I had with them. Their current launch window is set for \"end of November\", so we are still about a month away from it.",
                "author": "Baumpaladin"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Only 28 Out of Every 1,000 U.S. Homes Changed Hands This Year—The Lowest Turnover in Decades",
        "score": 286,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what does this mean exactly?",
                "author": "CharacterScarcity695"
            },
            {
                "raw_content": ">More than 70% of mortgaged U.S. homeowners have a rate below 5%, well below the current rate of 6.17%. Your home isn't just an investment, it's a golden handcuff. You bought it too low to let it go.",
                "author": "TGAILA"
            },
            {
                "raw_content": "* Just 28 out of every 1,000 U.S. homes changed hands in the first nine months of 2025, the lowest rate since the 1990s. * Affordability challenges and uncertainty about the economy are keeping buyers and sellers on the sidelines. * Homes turned over the most in Virginia Beach, VA and West Palm Beach, FL, while turning over the least in New York and Los Angeles. Only 28 out of every 1,000 (2.8%) U.S. homes have changed hands in 2025—the lowest turnover rate in at least 30 years. That’s according to a Redfin analysis of home turnover rates, based on MLS data and county records. The turnover rate is defined as the number of homes that are sold in the first nine months of the year, divided by the total number of sellable homes that exist. Our analysis examined the period between 2012-2025, but we can confidently say this year’s 2.8% turnover rate is the lowest since at least the early-mid 1990s. Existing home sales back then were similar to this year, but the number of homes that existed was smaller—meaning the turnover rate was higher. 38% fewer homes sold this year than during the pandemic peak This year’s turnover rate (2.77%) was down ever so slightly from 2.78% last year, when existing home sales fell to the lowest level since 1995. There were 37.7% fewer homes sold this year than during the middle of the pandemic buying frenzy in 2021 (44 of every 1,000) and 31.2% fewer homes sold than during the last pre-pandemic year in 2019 (40 of every 1,000). Homes are turning over at historically low rates because: * Affordability challenges have kept many buyers on the sidelines. Home prices are near record highs and borrowing costs remain elevated, causing the number of sellers to far outweigh the number of buyers. * Sellers are unwilling to give up their low mortgage rates. More than 70% of mortgaged U.S. homeowners have a rate below 5%, well below the current rate of 6.17%. While the share of mortgages above 6% is at a 10-year high, many homeowners are still rate-locked and unwilling to sell. * Economic uncertainty has made buyers cautious. Concerns about job security, inflation, and broader instability caused many would-be movers to delay major purchases, further slowing the pace of transactions. “America’s housing market is defined right now by caution,” said Chen Zhao, Redfin’s head of economics research. “Buyers are walking away from deals more often, sometimes due to affordability issues and sometimes because they’re re-evaluating whether now is the right moment to commit. Others aren’t even shopping, waiting instead for prices or mortgage rates to come down. On the other side, many sellers are staying put—either because they’re locked into low rates or unwilling to accept offers below expectations. When both sides hesitate, sales naturally fall to historic lows.” More homes are being listed in 2025 than the past two years The rate of homes being listed for sale in the first nine months of the year rose a little to 3.9%—meaning 39 out of every 1,000 homes were listed for sale. It was the third-slowest rate of homes being listed in records going back to 2012, just a fraction higher than last year’s 3.7% and 2023’s record low of 3.5%. This year’s rate is down 25.2% from before the pandemic in 2019 (52 listings per 1,000 homes) and 24.3% down from 2021 (51 listings per 1,000 homes). Sales of condos/townhouses down more than 3% from a year ago Around 30 out of every 1,000 single family homes sold in the first nine months of this year, a slightly faster clip than the roughly 22 out of every 1,000 condos/townhouses that sold. The sales turnover rate for condos/townhouses fell 3.3% year over year, while the rate for single family homes ticked up 0.6%. That’s in line with Redfin data showing how hard it is to sell condos this year, with an estimated 72.3% more condo sellers than buyers nationwide in August. Around 33 out of every 1,000 condos/townhouses listed for sale in the first nine months of the year, while around 41 out of every 1,000 single family homes were listed for sale. Homes turning over the most in Virginia Beach and West Palm Beach Virginia Beach, VA topped the list of 50 most populous U.S. metros with the highest turnover rate, with around 35 out of every 1,000 homes sold in the first nine months of the year. The next metros with the highest turnover rate this year were West Palm Beach, FL (32.6 sales per 1,000 homes), Tampa, FL (31.2 sales per 1,000 homes), Indianapolis (30.3 sales per 1,000 homes) and Atlanta (30.1 sales per 1,000 homes). Demand in the Sun Belt has softened significantly since the peak of the pandemic and the sales rate is continuing to drop fast in many of the region’s metro areas. San Antonio’s turnover rate fell to 24 sales per 1,000 homes, down -26.9% from a year ago and the biggest decline among the top 50 metro areas. Next came Charlotte, NC (-19.9%), Jacksonville, FL (-17.3%), Miami (-16.7%) and Orlando, FL (-16.1%). The only three major metros to post a faster turnover rate from a year ago were Virginia Beach, VA (+5.3%), San Francisco (+2.6%) and Indianapolis (+1.4%) Homes turning over the least in New York and Californian metros New York recorded the lowest turnover rate among the top 50 metros, with only around 10 out of every 1,000 homes selling in the first nine months of the year. Next came six California metros, led by Los Angeles (11.5 sales per 1,000 homes), San Francisco (13.2 sales per 1,000 homes) and San Jose, CA (14.8 sales per 1,000 homes). California’s low housing turnover stems in part from Proposition 13, a state law that restricts property-tax growth and creates a strong financial incentive for homeowners to remain in their homes. It’s worth noting that the increased SALT cap rate may help to unlock some of California’s housing inventory in future years.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Panic as home values plummet in half of the biggest US cities",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Plummet”",
                "author": "Nice_Razzmatazz9705"
            },
            {
                "raw_content": "If people have high levels of debt and asset prices fall, it will lead to a more severe recession. This was a dynamic during the Great Recession in 08.",
                "author": "ExceptionalGlove"
            },
            {
                "raw_content": "I would love for it to lower my taxes.",
                "author": "Ashamed-Status-9668"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "For-rent home giant accelerates buying and selling of houses",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most of these homes that are being discounted 20+% as builders seek to offload excess inventory are in less desirable, suburban locations. Rents for homes in those locales are going to be lower too! Invitation Homes will discover that in the coming months.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Fuck that company. Scum of the earth",
                "author": "Dry-Interaction-1246"
            },
            {
                "raw_content": "Continuing to make the bull case on housing. Perfect example of why no crash is going to materialize--because groups with cash know homes are in short supply and they can get a fine return buying up excess inventory and renting it.",
                "author": "zer0sumgames"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More Home Purchases Are Falling Through in an Uncertain Economy",
        "score": 56,
        "text_content": "* **Rising Cancellations**: More home-purchase deals are falling through as economic uncertainty grows. * **Buyer Concerns**: Many buyers are backing out due to worries about job security or realizing that ownership costs (mortgage, insurance, maintenance) are higher than expected. * **Market Stalemate**: The cancellations highlight a standoff between buyers and sellers in a housing market that has largely stalled. * **Personal Example**: The story of Trish DaCosta illustrates this trend—after saving for years and having her offer accepted on a $400,000 home in Nashville, she had to cancel when she was laid off just before closing.",
        "comments": [
            {
                "raw_content": "My friends are struggling to sell their house. Why? Because they bought it in 2014 for 270k and are now trying to sell it for just short of 900k. Did they make improvements? Absolutely. Did those improvements nearly quadruple the value of the home? No. They're absolutely stuck on this price too because they want to use it to finance a million dollar retirement home purchase. I do not feel bad for them at all.",
                "author": "SubnetHistorian"
            },
            {
                "raw_content": "Delisting data is suggesting that a HUGE amount of sellers are putting off sales to Spring 2026 to try and get the price they want or wait for rates to come down. I think if lower rates meets a 5 year sales backlog meets a cratering jobs market you will see a perfect storm of flash supply, no buyers and complete housing collapse.",
                "author": "Extension_Degree3533"
            },
            {
                "raw_content": "This is not a stalemate. Buyers are ahead by significant material and just need to press the advantage. No purchases for 2 years. Let the market bleed out.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Freddie Mac House Price Index Up 1.0% Year-over-Year in September",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On a year-over-year (YoY) basis, the National FMHPI was up 1.0% in September, down from up 1.3% YoY in August. The YoY increase peaked at 19.2% in July 2021, and for this cycle, and previously bottomed at up 1.1% YoY in April 2023. The YoY change in September is a new cycle low. https://www.freddiemac.com/research/indices/house-price-index The seasonally adjusted FMHPI decreased 0.04% MoM on a seasonally adjusted (SA) basis in September. This was the 6th consecutive MoM decrease in the SA index. Over the last 3 months, this index has decreased at a 0.5% annual rate and decreased at a 0.9% annual rate over the last 6 months. House prices are under pressure and might turn negative year-over-year by the end of 2025. 19 States and D.C. have seen price declines Seasonally Adjusted As of September, 19 states and D.C. were below their previous peaks, Seasonally Adjusted. The largest seasonally adjusted declines from the recent peaks are in New Mexico (-3.8%), Arizona (-3.6%), Florida (-2.8%), and Texas (-2.6%). For cities (Core-based Statistical Areas, CBSA), 182 of the 387 CBSAs are below their previous peaks. Here are the 30 cities with the largest declines from the peak, seasonally adjusted. Punta Gorda has passed Austin as the worst performing city. Note that 6 of the 9 cities with the largest price declines are in Florida. Florida has the largest number of CBSAs on the list and Texas has the 2nd most. https://calculatedrisk.substack.com/p/freddie-mac-house-price-index-up-f41",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fields Medalist Timothy Gowers tweets about how much time GPT-5 saved him in math research",
        "score": 648,
        "text_content": "Link to tweet: https://x.com/wtgowers/status/1984340182351634571",
        "comments": [
            {
                "raw_content": "The thread is worth a read, and even ignoring the recent Terence Tao and Scott Aaronson posts, I've seen multiple examples of similar posts by mathematicians. What's telling is that last quote: “So it looks as though we have entered the brief but enjoyable era where our research is greatly sped up by Al but Al still needs us.” I think many Mathematicians think this is just a small window where they have the equivalent of Centaur Chess supremacy, before what seems like the inevitable next step. To add Gowers is a Fields Medalist and just a very well respected powerhouse in the math community. It's not like, just some guy.",
                "author": "TFenrir"
            },
            {
                "raw_content": "Pretty cool part of his tweet: >So it looks as though we have entered the brief but enjoyable era where our research is greatly sped up by Al but Al still needs us. The key word here is “brief”",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "If youre an expert in an area current AI is a wonderful tool that helps you speed up and improve your ideation, refining them, and presenting them. It gives solutions you would not have easily thought of and because you know your area well you can give better and more specific prompts and then when it generates something untrue or not what you actually need call it out on it and get to the real answer. In my corner of the world it saves me hours of effort to get to a better end product. What it cant quite do yet is replace the worker and work independently. Maybe it never really will in the foreseeable future. But for right now it makes my life easier.",
                "author": "Sooner1727"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman wishes OpenAI was public just so doubters could short the stock and \"get burned\"",
        "score": 198,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So just repeating the Elon and Alex Karp playbook?",
                "author": "likwitsnake"
            },
            {
                "raw_content": "never seen satya laugh like that haha. sam is spicy. gotta love it",
                "author": "imlaggingsobad"
            },
            {
                "raw_content": "Spicy comment isn't important. What's important is that Sam claims that they are doing way more revenue than 13B, so the public numbers would be not accurate. And those numbers are a base for all projections. Projections need solid numbers to use as baseline or you can throw the performance modeling into the trash bin. Satya, Sam and Brad should all know those numbers, no? Do shareholders of private companies like OpenAI know revenue numbers well?",
                "author": "FullOf_Bad_Ideas"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "During Japan Mobility Show 2025, Toyota revealed the \"Walk Me,\" a concept autonomous wheelchair with foldable tentacle legs that can climb stairs and sit on the floor. The wheelchair should help people with reduced mobility to move around places where traditional wheelchairs aren't able to reach.",
        "score": 637,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"For Aiur!\"",
                "author": "talkyape"
            },
            {
                "raw_content": "Nute Gunray's [mechno chair](https://www.starwars.com/video/nute-gunray-and-sio-bibble) becoming a reality https://i.redd.it/2h92xd29mhyf1.gif",
                "author": "recallingmemories"
            },
            {
                "raw_content": "https://preview.redd.it/3hpj5anhzhyf1.jpeg?width=399&format=pjpg&auto=webp&s=7b81947ae54e017617e710b7b05afca01a152072",
                "author": "Aggressive_Accident1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI's got me questioning everything",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably both",
                "author": "No-Worker2343"
            },
            {
                "raw_content": "That’s the best part. It’s both!",
                "author": "Direct_Turn_1484"
            },
            {
                "raw_content": "Well it points out the more obvious cracks in our society.",
                "author": "ApexConverged"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Why the Ai hate makes sense",
        "score": 20,
        "text_content": "From the very beginning of human civilization, the existence of machines, even the most basic ones like a wheeled cart, has changed life drastically for the people of that time. But there have always been two sides to it. Some believed machines made life easier, while others believed they would no longer be needed to do the work that the machine could do. Think about it. When factories that automated the making of essential goods first came into existence, fewer people were needed to keep them running, and that caused a lot of anger because people lost their jobs. But if I were to ask you today whether you would rather those factories never existed, would you say yes? Of course not. Because without them, we wouldn’t have come this far. Technology would look completely different. But if someone from that time period were asked the same question, they would probably fight you, because they were the ones who lost their jobs. One thing to notice is that every time we have seen a major advancement in technology, some people have lost their jobs or what could have been their jobs. For example, I am an old school artist. I like to sketch on paper. I cannot for the life of me use the software people use to create digital art. So even though my art has always been a hobby, I could never really make any profit from it because most people prefer digital art unless the paper/canvass drawings are exceptionally good. This is not a rant, it is just my way of explaining how some people are bound to dislike tech because it takes away something from them, something they believe they are good at and makes them who they are and then a new technology comes along, and whatever you do becomes easier or more accessible, and you feel like you have lost what made you special. Some people adapt to change. They try to be better in ways the new technology is not. When computers were new, there were people who specialized in certain programming languages. But then new ones were introduced, and support for some of the old ones disappeared. Some people hated the change, while others learned and got good at what was new. They adapted. With the rise of AI, we see something very similar. People dislike AI because, like all new technologies, it is taking away their jobs. It makes people feel powerless. Imagine thinking you are a great artist, proud of your skills, and then one day finding out someone can wake up and use AI to create the same art you do (without even your damn permission). It would feel like fuxking shit, and yes even in the past technology has taken inspiration, or just straight up stolen things from others to advance, well, not technology, but people who made it (you get what I mean). The hate for AI is also made worse by movies showing AI taking over the world, games about machines wanting to \"be human\", and misinformation spread by the media. One day I literally had to argue with someone who read somewhere that a new OpenAI model KILLED an admin. What??????????? :/ I know this might sound obvious, but I am writing this because I have talked to many people who hate AI and refuse to admit it is because of fear. P.s Thank you if you chose to waste your time reading this. And no, I did not use AI. This would probably be better written if I did, and yes, I suck at writing.",
        "comments": [
            {
                "raw_content": "I'm an early adopter type and have loved AI but started to understand some of the hate and fear and share some myself as I watch it get better. Technology helps us do things better, or takes a difficult step and makes it easier. My biggest fear is that AI is taking *thinking* away from us. If it's easier to pump all our tasks through AI instead of actually thinking, what kind of mush are we going to become?",
                "author": "KalElReturns89"
            },
            {
                "raw_content": "I don't understand the hate at all. People celebrate automation right up until it might take their job, then suddenly it's bad, and only the automation that might effect their job. Actually the 1964 The Twilight Zone episode Brain Center At Whipple's is about that. The CEO of the company loves automation until he's replaced by a robot then he gets drunk and cries to a guy he fired how unfair it is.",
                "author": "yaosio"
            },
            {
                "raw_content": "I agree with the general premise, but what many people, including myself really despise is that companies are trying to use “AI” (meaning, for the most part LLMs) for things that it’s absolutely not suited for, wasting a lot of money that could go into using skilled engineers. The conveyor belt had been specifically designed for the purpose it fulfilled gracefully, whereas tons of startups are trying to find a problem to solve with LLMs and don’t understand the sophisticated toolset that engineers bring to the table for such a solution. That and the fact that so many people have such strong misconceptions about what LLMs do, and what they are capable of. For example the LLM saying it’s surveilling you or rumours of it killing someone. As an SWE, I love LLMs and how easy they make my job, but replacing entire teams or even just singular engineers with them? It’s just not feasible yet.",
                "author": "No_Assistant931"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Summary of the real facts surrounding OpenAIs restructuring.",
        "score": 37,
        "text_content": "There has been **a lot** of misinformation regarding the recent restructuring and other big announcements from the past 72 hours. No they did not turn a non-profit into a for-profit. No they did not change the definition of AGI to “when an AI makes $100B”. no, there isn’t any evidence of Sama getting equity in this restructure, and no the OpenAI non-profit did not previously own 100% of the OpenAI Global LLC(the for-profit/capped-profit arm that made chatGPT and all the main models). And no, I did not use AI to write any of this post. Here are the main facts that we know, summarized: - OpenAI has had a main LLC(the organization doing the main research progress and product creation) and a non-profit, for several years now, but has now converted their LLC to a PBC(public benefit company) which now has the legal obligation of ensuring AGI “benefits all of humanity”, just as the non-profit does. - The LLC had a profit cap of 100X per investor where-as the current PBC has no such cap. - The ownership of the PBC is split amongst the following: Microsoft owns 27%, The OpenAI non-profit owns 26%, OpenAI employees own 26%, and other investors/shareholders own the remaining 21%. - The non-profit is now worth $130B(It had no valuation prior, atleast not publicly) and is starting out with making an initial spending commitment of $26B towards: health, curing disease, and AI resilience (all of the things that could help society have a successful transition to a post-AGI world, including technical safety but also things like economic impact, cyber security, and much more) - Once AGI is declared by OpenAI, that declaration will now be verified by an independent expert panel. Their charter definition of AGI is still unchanged from: \"highly autonomous systems that outperform humans at most economically valuable work\" - Microsoft’s IP rights to research, defined as the confidential methods used in the development of models and systems, will remain until either the expert panel verifies AGI or through 2030, whichever is first. - Microsoft’s IP rights for both models and products (excluding hardware products) are extended through 2032 and now includes models post-AGI, with appropriate safety guardrails. Extra details about safety and who controls what: - The non-profit board-level safety and security committee will have the power and authority to require mitigation measures—up to and including halting the release of models or AI systems—even where the applicable risk thresholds would otherwise permit release. - PBC directors will be required to consider only the mission (and may not consider the pecuniary(financial) interests of stockholders or any other interest) with respect to safety and security issues related to the OpenAI enterprise and its technology. - Within one year of the recapitalization, the non-profit board will have at least two directors (including the Chair of the Safety and Security Committee) who will not serve on the PBC Board. Extra details about long term roadmap: - OpenAI has announced their research plans of having automated AI research interns running on hundreds of thousands of GPUs by September 2026, and having fully automated AI researchers by March 2028. - OpenAI now has committed plans of about 30GW of compute totaling $1.4 Trillion over the next few years(this could be over 5 years, 10 years or more, it’s not specified), with a long term goal of eventually building an “AI factory” that can produce 1GW per week (52GW per year) Sources: All of my information above is derived from a combination of direct public data from government sources like Delaware.gov, as well as direct public data from OpenAI themselves: Delaware.gov official restructuring commitments for OpenAI, October 28th: https://news.delaware.gov/2025/10/28/ag-jennings-completes-review-of OpenAI official info on their new company structure: https://openai.com/index/built-to-benefit-everyone/ and their new arrangement with Microsoft: https://openai.com/index/next-chapter-of-microsoft-openai-partnership/ OpenAI official info about their previous company structure: http://openai.com/our-structure/",
        "comments": [
            {
                "raw_content": "Thanks so much for taking the time to do this.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "Couldn’t they have kept the return cap even as a PBC?",
                "author": "steakavecalface"
            },
            {
                "raw_content": "The members of both boards today are the same correct?",
                "author": "GamingDisruptor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is how Apple representatives give press briefings about their new Vision products",
        "score": 317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like they gathered all Vision Pro users in one meeting with this briefing LOL",
                "author": "puzzleheadbutbig"
            },
            {
                "raw_content": "I will probably never get Vision Pro and I’m generally iffy about VR tech but I gotta say, this type of 3d rendering looks pretty great as technology goes. I’m not sure if it should be used to solve VR meetings but I can totally see it in gaming or assistant AI avatars.",
                "author": "ridddle"
            },
            {
                "raw_content": "It looks like a shitty ghost sitcom effect from the early 2000s.",
                "author": "vwboyaf1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "When AI takes over all our jobs even panhandlers won't need to do their own panhandling.",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "2050: Owners upgrade to new robot models, but can't bring themselves to sell their old ones to assholes on Ebay who will mistreat them, nor will they throw them in the landfill. So a roving band of homeless robots start to wander the streets, with them begging for extra cash so they can purchase time on the tesla electrical charging stations. The AI in them is locally generated and not from the cloud: their survival skills downloaded from hugginface.",
                "author": "TinySmolCat"
            }
        ],
        "subreddit": "singularity"
    }
]