[
    {
        "post_name": "WOW James O’Keefe has a Democrat insider revealing on hidden camera Gavin Newsom is funneling the money donated to his Prop 50 Redistricting Election into a Presidential Campaign fund for himself This is money laundering",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank God we have a Federal Bureau tasked with Investigating such things.",
                "author": "Iremembermypassword"
            },
            {
                "raw_content": "That’s alright, I’m sure Pam will take action. It’ll only be about 2 weeks or so.",
                "author": "Femprep"
            },
            {
                "raw_content": "Nobody ever dared something like that before 🙄",
                "author": "Votingnerd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brought to you by the letters U, S, and A.",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AH AH AH AH (in my best The Count laughter)😂",
                "author": "Purple_Drank"
            },
            {
                "raw_content": "you'd think they'd learn after the first two or three",
                "author": "Raetchel"
            },
            {
                "raw_content": "Imagine all the lives saved. We've had the greatest military in the world for decades. Yet, you're going to tell me that we couldn't detect and deal with vessels transporting illegal narcotics to our shores prior to 2025? Maybe all we really needed was a new president.",
                "author": "DonsChair"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No mind to change",
        "score": 972,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rinos included.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Democrats want America to fail regardless of Trump. They just hate him because he's in the way.",
                "author": "bidensmissingbrain"
            },
            {
                "raw_content": "\"An evil man will burn his own nation to the ground to rule over the ashes.\" -Sun Tzu",
                "author": "friedchicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I am thrilled to announce an incredible Trade and Economic Deal between the United States and Uzbekistan.",
        "score": 740,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Unless I’m missing something, the common thread between all of these trade deals is the rare earth minerals, i.e., “critical minerals”. It’s the way to keep China from holding the US hostage because we were so reliant on",
                "author": "Baconb_breakfast"
            },
            {
                "raw_content": "The chess pieces are moving. Rare earth mineral deals. Investment in nuclear power. Domestic chip production. The race to super artificial intelligence. Whoever wins controls the fate of humanity. It's *all* about this.",
                "author": "Zskills"
            },
            {
                "raw_content": "Hey President Trump, can we get a trade deal for Pam Bondi?",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trust no truck. No Driver's License, no registration, no DOT, no CDL, half the truck is broken.",
        "score": 1200,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd love to know what state. The guy thought he could just get on the road with no markings at all and nobody would notice? Are states like CA so bad that you can actually get away with that?",
                "author": "BrianOfNazareth"
            },
            {
                "raw_content": "What's important here is for you to not be racist. Everything else, like the family of four this would would likely kill isn't important. Nor is worrying about the fact that he can just flee to another country to avoid any punishment. Doesn't matter at all. Not being racist is more important.",
                "author": "_Sully_"
            },
            {
                "raw_content": "Pete Buttgauge standards met.",
                "author": "USMC6541E5"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Woke Portland Politician Who Demanded “Unhoused Neighbors” Be Given a Place to Sleep Has Home Torched by Homeless Person",
        "score": 1181,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Actual homeless, or \"homeless\"?",
                "author": "Yawnz13"
            },
            {
                "raw_content": "She tried to claim it was political when it first happened. She is a commie POS!",
                "author": "Beaverstatemilitia"
            },
            {
                "raw_content": "WOMP WOMP",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🇺🇸 On THIS DAY in 1984, U.S. President Ronald Reagan won re-election in a LANDSLIDE victory over Democratic candidate Walter F. Mondale...",
        "score": 704,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On this day in 1986, Reagan signed the Immigration Reform Act into law, giving millions of illegal aliens citizenship, and making it illegal for businesses to discriminate against immigrants. https://www.congress.gov/bill/99th-congress/senate-bill/1200",
                "author": "corporateshizer"
            },
            {
                "raw_content": "I miss this America and I wasn’t even alive to experience it. I feel fucking robbed of something so great and wonderful. That era, culture, ethics, and positivity for America could’ve lived on and on forever for all I care. Thinking about it makes me wanna cry.",
                "author": "Redpilled2Depression"
            },
            {
                "raw_content": "And then he turned around and opened the flood gates granting mass AMNESTY to hordes of illegal aliens. https://guides.loc.gov/latinx-civil-rights/irca",
                "author": "24601"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Socialist Hypocrite Mamdani Jets to Luxury Puerto Rico Resort",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"it's for the people!'",
                "author": "Bullet3250"
            },
            {
                "raw_content": "His family lives in a private compound in Uganda. The cars they drive are worth more than the local village earns in a lifetime.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "Didn't he just say 6 months ago he's not going anywhere he's going to stay in New York City? 2 days after getting elected he's jetting to Puerto Rico- at a time that airlines are canceling flights because of the democrat shutdown. Can't make this shit up 😭😭😭. Another prime example of you get what you vote for.",
                "author": "Midsouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No ship for you",
        "score": 1185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Inbred filth that needs to be removed from our country. All somalis need to be sent back home.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "Looks llike Frylock's retarded cousin.",
                "author": "CovfefeVideo"
            },
            {
                "raw_content": "# 𝙈𝘼𝙍𝙎 𝘼𝙏𝙏𝘼𝘾𝙆𝙎 ***!***",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A gay man and drunk walk into a bar...",
        "score": 880,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# HOMOSEXUALITY # IS A # S I N",
                "author": "RomanCatholicPatriot"
            },
            {
                "raw_content": "Anyone who has a 100M+ net worth working in government is a corrupt pos.",
                "author": "Genericwhitemale"
            },
            {
                "raw_content": "For almost four decades Nancy Pelosi has served herself and worked to make herself richer. No one was more skilled at insider trading and screwing over the American people. Americans will be forever furious for her part in passing Obummercare. She made us ashamed to be Americans, and will go down in history as the biggest disgrace to ever walk the halls of congress. Fuck you for everything you've done. The American people and I will be hoping you die a slow, painful death. There, fixed that for ya.",
                "author": "dr_gonzo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Can you stop at the camera, please?\" RUBIO: “I didn’t talk to you guys when I worked here, why would I talk to you NOW?\"",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If a republican talks to the MEDIA - they will just lie about what he says. Republicans should have stopped engaging with the MSM 30 years ago.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "He’s been my favorite surprise in this entire administration. RFK as well.",
                "author": "BeekeepingPatriot"
            },
            {
                "raw_content": "Based little person",
                "author": "EgregiousPhilbin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RFK Jr. calls on nations to remove mercury from vaccines at global summit - Patrick Lewis",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is mercury in vaccines in the first place?",
                "author": "FreshMemes"
            },
            {
                "raw_content": "Oh dear God. Democrats are going to start guzzling mercury now...",
                "author": "HillarysFUPA"
            },
            {
                "raw_content": "They keep lying and saying they don't use it in shots.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "What TX tells (legal) truck drivers to do to protect their cargo.",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish the entire country adhered to the 2nd amendment as well as Texas does. Nationwide truckers should be allowed to cross state lines with guns.",
                "author": "LolOkFBI"
            },
            {
                "raw_content": "All truckers should be armed. That is allowed by the 2nd Amendment, as well as reciprocity. States need to be fined and officials arrested for violating these laws.",
                "author": "Fresnor"
            },
            {
                "raw_content": "The officer is mistaken here. Your truck cab is your “home” and is legally protectable. Your trailer, that is not a fifth wheel or camper, is not legally recognized as your home in this situation. If the paperwork gets filed wrong you are going to prison if you shoot someone for breaking into your trailer full of overly insured consumer goods. Not worth it trucker bros.",
                "author": "pickleball_jones"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FAFO: Violent Trans Student Arrested at University of Iowa After Flipping TPUSA Table",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really want to see the per capita for college trans violence for the last year compared to normal people",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Of course it's a tranny. Who else here is tired of this?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Should have throw a sub since that's not a crime anymore",
                "author": "IvIA6A"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If it’s legal to hit people with sandwiches now I’ve got an idea.",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its not precedent, its 2 tier justice",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Subway Sandwich of Peace",
                "author": "OTher55"
            },
            {
                "raw_content": "Club sandwich! I like it!",
                "author": "Covfefe_Commando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Supreme Court allows Trump administration to limit gender passport markers",
        "score": 1400,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, Of course... The state department determines what will be on the passport not a retarded troon.",
                "author": "Pyroth5687"
            },
            {
                "raw_content": "No one has to pay along with these people's unchecked imaginations.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Cool. Now invalidate the active ones that already have them. Catch some of those faggots overseas as they try to come back and before the holidays.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "You know it's coming. They will try this in every state now.",
        "score": 1000,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imma need some context for this meme.",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "Insane asylums. Red flag laws. They're the same picture.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "She can actually shoot",
                "author": "ohwell316"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: President Trump says FOREIGN INTERESTS are trying to get him to lose the tariff case so they can take advantage of us again",
        "score": 1634,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever is currently talking in Trump's ear is not MAGA.",
                "author": "24601"
            },
            {
                "raw_content": "Scalia was murdered",
                "author": "Stanwyk74"
            },
            {
                "raw_content": "The courts need to give President Trump deference in conducting foreign policy",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Because, why not? DC jury finds DC man, not guilty of assaulting federal agent with Subway sandwich.",
        "score": 1099,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does this case establish judicial precedent legalizing throwing subway sandwiches at federal law enforcement officers?",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "Something about indicting a ham sandwich seems appropriate.... However, maybe we need a new AG. Blondi ain't cutting it.",
                "author": "24601"
            },
            {
                "raw_content": "If I threw a piece of fried chicken at a black guy... would that be assault? Curious minds want to know.",
                "author": "warlord30"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rape Averted",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's a shame he lived. Hopefully she will make better use of her range time in the future. Or get a Sig",
                "author": "gillonba"
            },
            {
                "raw_content": "muslim men :/",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "I've used but not fired a gun three times to stop crimes. Never reported any. Happens millions of times",
                "author": "MAGALADON9"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[News] SanDisk: NAND Undersupply Extends Beyond 2026 as Customers Seek 2027 Supply",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "First GPUs, then RAM, and now SSDs? What will be the next victim of AI?",
                "author": "jecowa"
            },
            {
                "raw_content": "I hate AI. I hate it so much. I hate NVIDIA. I hate oracle. I hate corporations. I hate that I can’t have an ounce of fun in the one hobby that brings me joy so we can kill the environment faster and the 1% get richer. I hate all of this.",
                "author": "JustHereForCatss"
            },
            {
                "raw_content": ">Notably, SanDisk remains bullish on the long-term data center market, highlighting a major NAND shift. According to the company’s remarks from the transcript, 2026 will likely mark the first time data centers overtake mobile as the largest NAND segment, driven by faster growth and a more diverse customer base. >Meanwhile, per Yahoo! Finance, SanDisk’s fabs are operating at full capacity, with production maxed out to replenish sharply reduced inventories.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Engineers have developed a passive evaporative cooling membrane that dramatically improves heat removal, it managed 800 watts of heat per square centimeter",
        "score": 209,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From reading the article, it sounds like this is just a proof of concept to incorporate evaporative cooling into a normal heat exchanger so as to take advantage of the large amount of energy needed to cause the phase change from liquid to vapor. The big problem I see is that the boiling point of water at 1 atm pressure is 100C, higher than GPUs and CPUs should operate at for long duration. Meaning to incorporate this concept would require either a closed primary loop using another coolant that can boil at a lower temperature or a closed primary loop that operates under a vacuum to reduce the boiling point of normal water. Either way seems costly and a lot more complex when expanded to hundreds of thousands of processors in a server facility, when compared to existing cooling methods. A closed primary loop under vacuum with water would be a nightmare that would require a lot pumps to maintain a vacuum in a system intended to undergo vaporization, so there goes efficiency, and alternative coolants to water are almost always toxic, corrosive, expensive or have some trait that has thus far prevented their widespread implementation.",
                "author": "RGrad4104"
            },
            {
                "raw_content": "OK, but where does it go from there?",
                "author": "MicksysPCGaming"
            },
            {
                "raw_content": "Still, 800W/cm2 sounds waaay too much. That would be 3.2kW on a typical 4cm2 die…",
                "author": "csory"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Spreadsheet to keep track of all the recent AMD and Intel mobile CPU rebrands",
        "score": 63,
        "text_content": "Made a spreadsheet to keep track of all the rebrands and equivalent SKUs of AMD and Intel laptop CPUs released recently going back to Zen 2 and Alder Lake. For the sheet, any CPU SKU considered equivalent has the same key specs, those being CPU cores and architecture, iGPU cores and architecture, and L3 cache capacity, while things like TDP and boost clock can vary for each individual SKU Some interesting take aways: \\- the AMD CPUs with the most \"equivalent\" SKUs are the Ryzen 7 7840U (most recently released as the Ryzen 9 270) and Ryzen 7 6800U (most recently released as the Ryzen 7 170), each with 12 respectively. \\- the Intel CPU with the most \"equivalent\" SKUs is the i7 12700H (most recently released as the Core 9 270H) with 9. Given the complete mess of naming, it's likely I missed a few SKUs, so the numbers for the two above may even be higher; these are mostly just the CPUs I could find on Intel and AMD's websites. Also, the sheet excludes PRO and desktop-class chips like AMD's Dragon Range at the moment, might add them at some point in the future.",
        "comments": [
            {
                "raw_content": "AMD should release a new cypher with 5 wheels to define their product SKUs",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Thank you for including the GPU Arch and Die Codename. I don't have enough mental capacity provisioned to always keep this on the top of my head and this will help get a \"Birds eye view\" of the landscape when it comes to this kind of smuggling in of older architectures.",
                "author": "Legitimate_Prior_775"
            },
            {
                "raw_content": "Only AMD could have it where if you buy something today from an OEM it could have Zen 2 with RDNA2 inside, Zen 3 with GCN5 inside, or be some random variation of Zen 4 or 5 while Strix Halo is still mostly vaporware a year after launch. Dell apparently has plenty of Zen 2 laptops models to still offload, but trying to find 300 series parts is a mess. The cheaper 380 and 385 laptops still cost more than the full fat 395 ones too.",
                "author": "Kougar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra 300 “Panther Lake” SKU lineup leaked, up to 16 CPU cores, 5.1 GHz boost and Arc B390 Xe3 graphics",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why can't they have a low core count CPU but still keep the full iGPU?",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "While this has pretty much been known for a while, you really do get the feeling when looking at these frequency and power stats that Intel hoped for more from 18A. It's a good node and a good chipset, I think it's targeted and designed well and will do well in the market, but it doesn't seem like it improved on N3 and I know that they were targeting better frequency and lower power than they got.",
                "author": "grumble11"
            },
            {
                "raw_content": "6 different top models with just 100mhz between them is so stupid, that should be 1 or MAYBE 2 models for that core configuration But just hope the 356H is cheap then",
                "author": "Mech0z"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen AI Max+ 392 detailed as a cut-down Ryzen AI Max+ 395 with powerful Radeon 8060S iGPU",
        "score": 139,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two \"leaked\" Strix Halo products, both with 8060S iGPU but 12C24T (392) or 8C16T (388).",
                "author": "work-school-account"
            },
            {
                "raw_content": "Finally, locking the best igpu to monster chips always felt like a waste, most who needs a 16 core cpu is going to want bigger than a 8060s anyway",
                "author": "Vodkanadian"
            },
            {
                "raw_content": "388 sounds really nice but kinda too late. Feels like Medusa Halo with RDNA5 will be the \"real\" one to go with.",
                "author": "Dangerman1337"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ID-Cooling Launches New Affordable FX360 Series AIO Coolers",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Advertises an \"affordable\" cooler, doesn't say what the price is",
                "author": "Yebi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "HUB - 47 AMD B850 Motherboards Tested - Nearly Every Board!",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: Recommendations: - Asrock mobos only recommended if you don't intend to use an X3D CPU - **Best value**: ~ $130: Asrock B850M Pro RS ~ $160: Gigabyte B850 Gaming X WiFi6E or MSI B850M-A WiFi ~ $210: MSI B850 Tomahawk Max WiFi - **Micro-ATX**: ~ $180: Asrock B850 Steel Legend WiFi, Gigabyte B850 Aorus Elite WiFi7 Ice if you want a white mobo - **Mini-ITX**: ~ $200: Asrock B850I Lightning Wi-Fi (best VRM thermal performance of all boards tested) ~ $290: MSI MPG B850I Edge Ti Wi-Fi (offers 5GbE LAN) - **Expensive B850 boards that don't make sense due to X870E boards**: ~ $320: Gigabyte B850 AI Top (only one to offer Dual 10GbE LAN)",
                "author": "Antonis_32"
            },
            {
                "raw_content": "Quite a few boards to avoid if you want to later upgrade to Zen 6 as it's allegedly moving to 12 cores CCDs instead of 8. A 24 cores top of the line Zen 6 is likely to draw more juice than the 16 cores 9950X.",
                "author": "AnechoidalChamber"
            },
            {
                "raw_content": "People with functioning systems are looking to swap off asrock because even if everything seems fine they live in fear of a ticking time bomb resulting in a huge waste of time with warranty replacements just to play the same game again when replacements arrive. Nobody informed is buying Asrock new.",
                "author": "Klaritee"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why's everyone so quiet about Age of Imprisonment? It's a great game IMO.",
        "score": 369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s been 24 hours. Most people are probably still waiting on deliveries.",
                "author": "justunclegary"
            },
            {
                "raw_content": "They’re fairly niche but I love Warriors games, I’m playing and enjoying it a lot.",
                "author": "poopstoodamnbig"
            },
            {
                "raw_content": "As someone who adores the Musou franchise with all of my heart and can pick up basically any of them and have a good time, I'm just going to tell you straight up they're not for everybody. Some people go slack jawed and their brain runs out of their ears when even try to think about playing a Musou game due to their hack and slash repetitiveness. Now I do think more people need to give them a chance but that's just a personal take I have about a lot of games in general because some people really restrict themselves to what games they play. Tapping into new genres every now and then is a good thing imo",
                "author": "just_someone27000"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I haven't seen anyone talking about this feature, even in reviews, but it's a lifesaver.",
        "score": 161,
        "text_content": "If you switch 2 ever runs out of battery the gane will still open after it charges",
        "comments": [
            {
                "raw_content": "Didnt Switch 1 do this also?",
                "author": "entwickelnn"
            },
            {
                "raw_content": "It’s been there since the switch 1 that’s why no one talks about it.",
                "author": "SuperSaiyanIR"
            },
            {
                "raw_content": "If you plug it in on top then you can still play it in stand mode.",
                "author": "phylter99"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So true. 🤭",
        "score": 866,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, PS5 catching strays",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "I thought this was r/simpsonsshitposting for a minute",
                "author": "AwesomeKalin"
            },
            {
                "raw_content": "The haters are a loud minority. There's not denying that.",
                "author": "GroceryConscious7155"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "In depth previews of Metroid Prime 4 coming Nov 14",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So excited and nervous at the same time for this. Anyway it's my most anticipated game of the year and already pre-ordered.",
                "author": "danimepi"
            },
            {
                "raw_content": "The demo I played at PAX with Mouse controls felt so damn smooth. Extremely hyped for this.",
                "author": "Bombasaur101"
            },
            {
                "raw_content": "Ets goooooooo",
                "author": "Bootychomper23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Do you think we’ll get an NS2 update for any of these games by the end of the year?",
        "score": 216,
        "text_content": "Or do you think we’ll get an NS2 update for any of these games eventually? 😭",
        "comments": [
            {
                "raw_content": "Hoping for xenoblade",
                "author": "Fresh-Chemical-9084"
            },
            {
                "raw_content": "I don't understand why the Xenoblade games aren't getting a resolution and FPS increase. It makes no sense.",
                "author": "GoreGaming"
            },
            {
                "raw_content": "Astral chain.",
                "author": "_Rvvers"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Really glade that DK bananza sales seem to be great.",
        "score": 25,
        "text_content": "Dk is like my 5th favorite video game franchise second favorite nintendo franchise behind only zelda. Going 11 years from the master peace tf to master peace bananza was killer. Both in my top 6 all time favorite games. I was worried about how its sales where. Seeing the first sales report and seeing in just its first 3 months that it has already sold like 75% of tropical freeze life sales and like over 50 of return sales makes me very happy. With sales being great hopefully we dont have to wait to 2036 for next dk game lol. I get games take a long time now days and days of 1-2 years for a new game are dead but taking like 11 years compared to say 5/6 is a lot worse lol.",
        "comments": [
            {
                "raw_content": "10m life time sale is very likely.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "It's a fantastic and super fun game for sure, really liked how the Odyssey team was able to make the gameplay feel so smooth regardless of what DK is doing (jumping, punching, breaking rocks, throwing stuff etc) DKC2 is still the best in the franchise for me but Bananza is definitely within the top 3",
                "author": "reevestussi"
            },
            {
                "raw_content": "Game was very good haven't tried the dlc yet though but I did 100% the game otherwise",
                "author": "QuestionOk8524"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Todays pick up!",
        "score": 148,
        "text_content": "Really excited for this game !! And this amibo has sick detail!",
        "comments": [
            {
                "raw_content": "Man that amiibo is HUGE.",
                "author": "Pristine-Brush-1052"
            },
            {
                "raw_content": "So excited for Metroid",
                "author": "uptothemountains7"
            },
            {
                "raw_content": "I have to wait for Santa for both games 😑",
                "author": "BobaF4t"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sonic Racing: CrossWorlds Nintendo Switch 2 Edition - Announcement Trailer",
        "score": 55,
        "text_content": "Launches on the 4th of December. Physical release coming early 2026. Upgrade path from Switch 1 possible for $10.",
        "comments": [
            {
                "raw_content": "I’m waiting until the physical version releases, but the upgrade pack being $5 for a limited time sounds too good of a deal. I don’t know if I should buy the upgrade pack then get the physical copy anyways or just wait.",
                "author": "waxy15"
            },
            {
                "raw_content": "PSA there will be a discount for the upgrade path until dec 10th",
                "author": "skyblade960"
            },
            {
                "raw_content": "Given how a lot of Switch 2 ports so far have been a bit underwhelming when it comes to performance (looking at you, Persona 3 Reload, but the number of games that have been 1080p in handheld and docked has also been disappointing), it's really refreshing to see one that's running on par with Nintendo's output for Switch 2 so far, even if it's obviously helped by having been developed with Switch 1 in mind (performance details were confirmed here: https://www.sega.com/news/sonic-racing-crossworlds-nintendo-switch-2-faq)",
                "author": "PikaPhantom_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rockstar Games Employee posts about recent union-busting efforts (verified by GTAForums Mod)",
        "score": 2049,
        "text_content": "Link to comment: https://gtaforums.com/topic/1004182-rockstar-games-alleged-union-busting/?do=findComment&comment=1072605777 Text: > Hey everyone, R* Employee of many years here! > Understandably I want to remain anonymous due to retaliation from the Company, but I may be willing to verify I'm an employee with @Spider-Vice via DM (if required). I am also a member of the Union. > I've been reading a lot of the discussion on here and elsewhere about the firing of more than 34 of my colleagues last week (31 in the UK + 3 in Canada) and have seen a lot of disinformation and lies that are really concerning. Particularly concerning how so many folk are willing to believe the Company's excuses. > Last week, my colleagues who were in the studio were each individually messaged by HR for a short friendly meeting, under the friendly guise of \"Hey, are you free for a quick chat?\" > Upon attending this meeting they were handed an envelope with a short letter stating that their employment had been terminated for \"gross misconduct\" regarding posts made in Discord. > They failed to provide any evidence when asked, nor was any stated in the letter. And did not divulge any other information or reasoning - \"and no other reason\" > They refused their right to Union representation in the disciplinary meeting (which is against UK employment law) and were frogmarched out of the studio with the meeting lasting less than 5 minutes. > For colleagues who were not in the Studio that day, they received a phone call from HR that lasted less than 2 minutes telling them they were fired and that they'd receive the same letter as above. I am aware of one employee who had a panic attack at this moment, and HR hung up on them during this panic attack not caring at all about their wellbeing. > These colleagues of mine were hard workers who have spent many many years at R* in critical roles. With colleagues who have been at R* for more that 18 years and none of them have ever had a disciplinary in that time. They are not easily replaced and will certainly affect us in making our project deadlines. > These are very senior artists, animators, QA testers, designers, programmers and producers. Including Leads. All super talented people who were proud of their work over multiple R* titles, and all they wanted was the best for R* and their fellow colleagues. > Some of these members were off sick, recovering from surgery or on paternity leave. Fired without pay, losing their careers and putting them into hardship in the lead up to Christmas, and even potentially losing their VISAs to work in the UK. > Let me make this clear! I never saw any discussion/leaking of Rockstar projects in the Union Discord. The only ever discussion was around unionisation efforts and the working conditions at R*. The Discord wasn't public. It was a private Discord group that only contained R* employees and the IWGB Union officials. > This was Union Busting and nothing else! Everyone fired was a Union Member, they were also predominantly from those who were on the Union Organising Committees of each UK studio. > Just one week before, the Union had reached ~200 members taking us over the 10% threshold required to seek recognition and begin engaging in collective bargaining. Allowing us to negotiate directly with management on the key issues that affect us: worsening crunch, inadequate pay and inflexible working arrangements. > They have fired over 34 of us now. There were over 250 of us in that Union/Employee Discord group. There is the fear that if they get away with this, they'll have nothing stopping them from doing this again and again. > Those of us who are lucky and remain for now work in fear! Fearful when talking to each other at the tea prep, fearful that we're next in line and are easily got rid of, too scared to go outside the studio and talk to (or even acknowledge) our colleagues outside protesting in fear of reprisals. Morale in the studio is at rock bottom. When we should be excited about what's to come over the next year we are now totally deflated and our trust and confidence in others is totally shot. > Which is the truly heartbreaking part, as for us in the Union, all of our ambition was to make R* a happier, fairer, safer and more equitable place. That's all. What has happened clearly shows that we care more about the wellbeing of our colleagues at Rockstar than the Company does. > The union remains unbowed and is fighting to win the reinstatement of every dismissed member of staff at Rockstar through legal means and campaigning. > This fight is critical, if Rockstar can get away with this, they will keep treating their workers with disdain, disrespect, and subjecting them to continued illegal treatment. > Thanks for your time, and I hope this is some truth that helps you all understand what's going on here at the moment. > I you would be so kind, you can contribute to the fundraiser to support those fighting their dismissal here: https://actionnetwork.org/fundraising/support-rockstar-workers-fighting-unfair-dismissals/ > It would be really appreciated if you could also share the above link. I won’t be cross posting this to other forums, but please feel free to share. > Cheers x",
        "comments": [
            {
                "raw_content": "A year out from launch and they pull this shit, AND they decide to announce a delay whilst this shitshow is going on. What the hell was the game plan here?",
                "author": "Ihatenickstreltsov"
            },
            {
                "raw_content": "The most anticipated game in the world and will probably make more money than some federal governments, and they refuse to give their employees some rights, goddammit R*...",
                "author": "NotSoSmart_Sideswipe"
            },
            {
                "raw_content": "Man I really hope they get their jobs back. Just before Christmas seems particularily ruthless. And losing so many talented people with 1 year to go before the biggest gaming launch ever sounds like such a horrible idea. No wonder they're delaying the game. All that just to prevent unions, as if their demands were going to ruin their business which they wouldn't.",
                "author": "Aaronon2200"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "billbil-kun says tomorrow's Rockstar announcement is something much people won't care about",
        "score": 556,
        "text_content": "[https://xcancel.com/billbil\\_kun/status/1986557144536146276#m](https://xcancel.com/billbil_kun/status/1986557144536146276#m) >It's something probably much people won't care about (and it's not a remaster) please do not say what I didn't say",
        "comments": [
            {
                "raw_content": "Man wtf is 😭",
                "author": "Claude_0283"
            },
            {
                "raw_content": "\"GTA + members get to purchase Jason & Lucia costumes.\"",
                "author": "Arcade_Gann0n"
            },
            {
                "raw_content": "Considering billbil-kun gets data from retailers backends, it's probably some re-release or repackaging. So I'll guess they've probably re-packaged GTA Trilogy and V in a single box for PS5 and Xbox for a \"new\" retail release",
                "author": "s7ealth"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Chris Avellone] Avowed 2 is going to be a thing.",
        "score": 470,
        "text_content": "https://xcancel.com/ChrisAvellone/status/1986510753025704307?t=CQ6ZOPS62lVkmTTtq5uf8g&s=19",
        "comments": [
            {
                "raw_content": "Where did he get this info? Are there people at Obsidian who still talk to him?",
                "author": "Arumhal"
            },
            {
                "raw_content": "If they could somehow bottle up that feeling from the first 6-7 hours and extrapolate that out to a full sized rpg, it would be one of my favorite RPGs of all time. Avowed really fell off fast for me after that first zone",
                "author": "scoobs0688"
            },
            {
                "raw_content": "I really liked Avowed. It didn't set the RPG world on fire, but I really enjoyed it.",
                "author": "mighty_mag"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Leaked image of Rogue and Gambit in Marvel Rivals",
        "score": 88,
        "text_content": "NetEase appears to have accidentally uploaded the image as an ad on TikTok: [https://xcancel.com/X0X\\_LEAK/status/1986491569122299996](https://xcancel.com/X0X_LEAK/status/1986491569122299996)",
        "comments": [
            {
                "raw_content": "Recently got into this game and I've been waiting for this. Love these two together.",
                "author": "HarknessLovesUToo"
            },
            {
                "raw_content": "Fuck dude both remy and rogue are in my top 10 characters of all time this is like the superbowl for me",
                "author": "InosukeEnjoyer"
            },
            {
                "raw_content": "Dang both look cool!, though I have to ask where is Cyclops lol",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC: Square Enix announces more layoffs as part of US and Europe restructuring",
        "score": 233,
        "text_content": "[Source](https://www.videogameschronicle.com/news/square-enix-announces-more-layoffs-as-part-of-us-and-europe-restructuring/) Square Enix announced layoffs across “nearly all areas” of its Western business in an all-hands meeting on Thursday, VGC understands.",
        "comments": [
            {
                "raw_content": "And this is right after Squenix said they want 70% of debugging and quality control to be done by AI. FF7 Remake Part 3 gonna play like Big Rigs at this rate.",
                "author": "CarbVan"
            },
            {
                "raw_content": ">*Thursday’s layoffs announcement arrives on the same day that Square Enix shared its intention to have the majority of its QA and debugging work handled by generative AI within the next two years.* There it is",
                "author": "Cubelock"
            },
            {
                "raw_content": "[In a minor step forward, it looks like a bill may be passed mandating that companies explicitly disclose to the Department of Labor how many jobs are being culled and replaced by AI operations](https://www.pcgamer.com/software/ai/no-more-hiding-the-impact-of-ai-the-us-government-is-looking-to-force-companies-to-report-how-many-folks-have-been-fired-because-of-artificial-intelligence/) I want to be hopeful we can actually hold these companies accountable regarding their substitution of human labor for gen AI but especially in these times it's getting increasingly difficult, especially the bigger a company is",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Images from the set of the Resident Evil movie",
        "score": 346,
        "text_content": "https://xcancel.com/SilentKatS/status/1985738760705745005#m https://imgur.com/a/hvNlFnz The film is co-produced by Sony’s TriStar Pictures, Constantin Film, and PlayStation Productions, and is slated for theatrical release on September 18, 2026. Dariusz Wolski (Alien: Covenant, The Martian, Pirates of the Caribbean) serves as director of photography.",
        "comments": [
            {
                "raw_content": "Please let this one not suck",
                "author": "Mr_Nobody0"
            },
            {
                "raw_content": "Dariusz Wolski? I'm already seated.",
                "author": "scott1swann"
            },
            {
                "raw_content": "Is this the one from Cregger?",
                "author": "kodan_arma"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI Claw A8 launched in Asia months ago, but there is still no US release",
        "score": 26,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It has a bad cooling solution apparently.",
                "author": "VisceralMonkey"
            },
            {
                "raw_content": "The Z2E performance is very disappointing and price has increased like crazy over Z1E. I initially wanted to buy one, but seems like AMD totally lost the plot in terms of pricing. Things are even worse with HX370 and Ryzen 395 devices. AMD is too greedy and trying to inflate their CPU revenue numbers. We really need Intel to get back in the game.",
                "author": "WorstRyzeNA"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "3mdeb Achieves Good Progress Porting Coreboot+OpenSIL To AMD Turin Motherboard",
        "score": 16,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Homebuilders Bet on 1% Mortgage Rates to Wake Up US Buyers 🤣🤡",
        "score": 279,
        "text_content": "Lower your f-ing home prices! Your stupid *temporary* interest rates don't mean shit if the home itself is overpriced for dogshit quality. Buyers can boycott longer than bagholder sellers can keep paying carrying costs. **The buyer is always right**, not whatever Zestimate you see. **Builders Offer Ultra-Low Rates** * With average mortgage rates hovering around 6%, some homebuilders are offering rates as low as 1% to attract buyers. * These deals are typically available only on new homes, giving builders a competitive edge over existing home sellers. **How It Works** * Builders use mortgage rate buydowns, where they pay upfront to lower the buyer’s interest rate for a set period. * This strategy significantly reduces monthly payments, making homes more affordable despite high base prices. **Market Context** * The housing market has cooled due to rising interest rates and affordability challenges. * Builders are trying to stimulate demand and move inventory by offering financial incentives. **Long-Term Implications** * These promotions may reshape buyer expectations and pressure traditional sellers to offer similar incentives. * However, experts caution that buyers should understand the terms and duration of these buydowns to avoid surprises later.",
        "comments": [
            {
                "raw_content": "this seems... like a bad idea? if I can't afford a monthly mortgage payment now, a temporary 1% rate just means in 3-5 years when the new rate kicks in I won't be able to afford it. This just seems like you're asking for folks to buy homes they can't afford, and then default on them later, and we've seen how well that worked out.",
                "author": "SpareManagement2215"
            },
            {
                "raw_content": "Relying on A temp buydown means you can’t afford the house. Only buydown worth shit is a permanent one. Combining a shitty arm with a 30 year note makes no sense",
                "author": "These-Brick-7792"
            },
            {
                "raw_content": "Someone calculate what the dollars spent to buydown from prevailing 6% mortgage rates to 1% would be on a 30 year note, $450,000.",
                "author": "HartbrakeFL21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fannie Mae removes minimum credit score requirements from DU",
        "score": 72,
        "text_content": "https://www.housingwire.com/articles/fannie-mae-credit-score-update/",
        "comments": [
            {
                "raw_content": "LMAO this should end well",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "I feel like we’ve been here before",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "\"This didn't work last time, but this time it's different\" policy",
                "author": "knight_prince_ace"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Layoffs in October surge to 2 decade high",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If the AI bubble pops anytime soon, this economy is toast. Assume crash positions.",
                "author": "mlody11"
            },
            {
                "raw_content": "PSA: The chat bots are not taking over those jobs, no matter what the press releases say. They may say the jobs are lost to AI, but that’s misleading. The MBAs are probably just deploying the chat bots, laying off the workers, increasing outsourcing overseas, and letting the remaining employees in the trenches figure out how to make it work. So-called AI (a misnomer, it is artificial but not intelligent) cannot do those jobs, these are not efficiency gains.",
                "author": "SnoopsBadunkadunk"
            },
            {
                "raw_content": "So many businesses/restaurants that have been open for over a decade are closing. Absolutely wild to see, we’re all toast tbh. Prepare your tents and canned food. Going to be a rough few years.",
                "author": "ProbablyCamping"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Barely Budge, As Buyers Stay Cautious Despite Lower Mortgage Rates",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish this “but rates!” narrative would just die. We’ve got prices that are waaaaay over their skis, and we’ve got an economic backdrop that doesn’t inspire confidence to spend a single dollar, for most of working class America. For now, the wealthiest bunch will continue to swap assets.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "The same stale talking point *over and over and over* in countless articles. This isn't about rates, it's very much still about *PRICES*. *Especially* when people are deathly afraid of losing their jobs in this stagflationary economy.",
                "author": "WrongThinkBadSpeak"
            },
            {
                "raw_content": "How about them prices ?",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More home listings, fewer buyers in Washington",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Condos in Seattle are getting hit badly my colleague landlord is starting to sell his condos as he facing rising vacancies. His landlord offered the current unit to him for the same price as what neighboring identical unit went for in 2019.",
                "author": "Dmoan"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Builders Are Offering Mortgage Rate Discounts. Home Buyers Aren’t Biting.",
        "score": 161,
        "text_content": "**Demand Slump Despite Discounts** * Builders are offering mortgage rates as low as 4%—far below current market rates—to attract buyers. * Even with these deals, sales remain weak, signaling that rate cuts alone aren’t enough to revive the housing market. **Inventory Pile-Up** * The number of completed but unsold new homes is at its highest since 2009, according to data from the Federal Reserve Bank of St. Louis. * Builders had ramped up construction in late 2024, expecting a rebound in 2025—but that demand hasn’t materialized. **Implications** * This trend suggests deeper affordability issues: buyers may be deterred by high home prices, economic uncertainty, or tight lending conditions, even if rates are temporarily lowered. * It also reflects broader hesitation in the housing market, despite efforts to stimulate activity.",
        "comments": [
            {
                "raw_content": "Yeap large home builders are offering huge incentives and free upgrades while maintaining the list price. Sellers who are trying to sell their recently purchased home due to RTO or job loss are having to compete with their builder and are unable to sell their home..",
                "author": "Dmoan"
            },
            {
                "raw_content": "Everyone is worried about their jobs.",
                "author": "ClusterFugazi"
            },
            {
                "raw_content": "> Builders are offering mortgage rates as low as 4%—far below current market rates—to attract buyers. Can someone tell me why they don't just lower prices 15%???? Isn't that functionally identical to a mortgage rate buy down? I'm just not seeing the logic behind this financial fuckery. Are they just trying to keep home prices inflated?",
                "author": "Cold_Specialist_3656"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What it would take for mortgage rates to dip below 6%—and what to expect in 2026",
        "score": 42,
        "text_content": "Here’s where recent forecasts see the average 30-year fixed mortgage rate in 2026: Mortgage Bankers Association: 6.4% by the end of 2026 National Association of Home Builders: average of 6.23% in 2026 National Association of Realtors: average of 6% in 2026 Fannie Mae: 5.9% by the end of 2026",
        "comments": [
            {
                "raw_content": "Oh, I’ve no doubt we will go below 6%, maybe even 5%, sometime during the economic downturn that appears to be coming. It’ll be at the bottom, and demand will still be rekt. Blame will shift onto the Fed for “doing too little too late”. Economies are meant to have cycles. They needn’t be quite so dramatic, but we’ve chosen policy of boom/bust. That is somewhat on the Fed, but also on Wall Street investment.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "I don’t want to go back to bidding wars lol",
                "author": "SectorAdditional9110"
            },
            {
                "raw_content": ">What would it take The fed to mass buy 10y bonds",
                "author": "MrToboggann"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Japan's debt is 234% of GDP but stable. US debt is 120% and showing cracks. I analyzed the $970B interest payment difference [6:01]",
        "score": 3,
        "text_content": "I broke down why Japan can sustain 234% debt-to-GDP while the US struggles at 120%. The key isn't the debt size—it's who holds it: **Japan's closed-loop system:** • 88% domestically owned • Bank of Japan holds 46% • Interest payments circulate back into their economy • Effective rate: \\~0.3% on domestic portion **US open-market system:** • 25% foreign-owned ($9.5T) • Japan holds $1.15T, UK $899B, China $731B • $970B annual interest (19% of federal revenue) • Rate jumped from 2.4% to 3.4% in 5 years **The historical pattern:** When interest payments hit 30% of revenue, crises follow: • Spain 1557: 40% → default • France 1789: 50%+ → revolution • Britain 1947: 32% → lost reserve currency status US is at 19% today, projected to hit 25%+ by decade's end. Full breakdown: [https://youtu.be/owKsdcmJx3U](https://youtu.be/owKsdcmJx3U) What's your take—is the US trajectory sustainable or are we approaching a fiscal cliff?",
        "comments": [
            {
                "raw_content": "Gov and businesses always make the citizens feel it. So yeah we'll sadly probably have a revolution. Even if Ds made everything so easy that we only had to do 2 amazom shifts a month people would blame suit on others and vote for hate mongers",
                "author": "Agreeable-Comfort390"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The chinese did it, KIMI K2 surpassed GPT-5.",
        "score": 682,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Has anyone reading my comment used agentive tools with K2? If so, please share your experience. (I specifically want to know because I've started seeing people again saying that people are overestimating Chinese LLMs.)",
                "author": "Inspireyd"
            },
            {
                "raw_content": "Wtf is r2 bench",
                "author": "dwiedenau2"
            },
            {
                "raw_content": "The biggest threat to Google, OpenAI and X-ai is the existence of open source models that can be locally run, potentially pulling the floor out from the proprietary models in terms of profitability. If you can get 70% of the performance on your local device, without subscription or giving away your data, it would be a very attractive alternative.",
                "author": "lolwut778"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XPENG IRON - some thought she was one of us. So they cut through her skin fabric",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Could be an amputee /s",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Somewhere realdoll execs are having emergency meetings.",
                "author": "Lazy_Jump_2635"
            },
            {
                "raw_content": "\"Now listen to me \\*very\\* carefully...\"",
                "author": "markhughesfilms"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "XRoboHub / What’s Under IRON’s Skin? Inside XPeng’s Humanoid Robot#xpeng #humanoidrobot #ai #robotics",
        "score": 1067,
        "text_content": "[https://www.youtube.com/watch?v=Jdh9cnBDQe0](https://www.youtube.com/watch?v=Jdh9cnBDQe0)",
        "comments": [
            {
                "raw_content": "I love the fact that these humanoids robots are starting to look exactly how they were envisioned to look in so many works of science fiction.",
                "author": "heart-aroni"
            },
            {
                "raw_content": "I am kind of blown away that they can get motors to work in such an elegant way. I assumed it was soft body mechanics. Wow.",
                "author": "randomrealname"
            },
            {
                "raw_content": "This is beautiful. Truly an inspiring piece of engineering.",
                "author": "NoAlbatross7355"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I will PROVE you can access Gemini 3 Pro in CLI, because people don't believe",
        "score": 106,
        "text_content": "# 4 Reasons it is real 1. **Entering a random model name** or misspelling, for example **\"gemini --model gemini-4.5-pro-ultra-max-preview\"** **does not let you prompt** and you will get the error code \"request entity not found\" aka **it's not a real model**: https://preview.redd.it/c34ql9682qzf1.png?width=1812&format=png&auto=webp&s=bdc9aa1314ba46154bae0a91522f2f93fedf293b 2. Entering **\"gemini --model gemini-3-pro-preview-11-2025\" DOES let you prompt**. I have been rate limited now but this screenshot below shows **the model thinking and then me being rate limited** on it, which you **can't do for fake models.** [Thinking](https://preview.redd.it/wpur8xlp3qzf1.png?width=1839&format=png&auto=webp&s=e752ab80c2e52536cacb98e7a04c9d74109ce5f3) [Rate limited](https://preview.redd.it/6lccilhr3qzf1.png?width=1596&format=png&auto=webp&s=f9ae74096244b99cbd5bd137a297e9b4966c1542) 3. You can **only prompt the model with a US VPN**. The screenshot below shows me trying to prompt it with the VPN off, all images above have it on, as you can see I am **\"forbidden\":** [Forbidden](https://preview.redd.it/50ityk4d4qzf1.png?width=1451&format=png&auto=webp&s=3b323a0ac976a8ed8ff3039f5b85f7dacd110503) 4. The quality of this model compared to gemini 2.5 pro is MUCH better. The first images below are from 2.5 Pro, and the 2nd lot are from earlier prompts from 3 Pro using exactly the same frontend prompt, I think it's pretty clear they are different models. [2.5 pro](https://preview.redd.it/yhj9jloy5qzf1.png?width=1656&format=png&auto=webp&s=bc709b76a5656e3de050b69bff7b2e755418d268) [2.5 pro](https://preview.redd.it/7bgkvnd26qzf1.png?width=1739&format=png&auto=webp&s=bd9b565b6464f51e88bd5edc9e789fd0ee001faf) [2.5 pro](https://preview.redd.it/a29qmh146qzf1.png?width=1620&format=png&auto=webp&s=3e7694ab54904fba7a4d641ee3a124f4a030c640) [3 pro](https://preview.redd.it/etgcvyi56qzf1.png?width=2525&format=png&auto=webp&s=7a6cf6343142c8a590f176812f547930a39052ad) [3 pro](https://preview.redd.it/7amcus476qzf1.png?width=2525&format=png&auto=webp&s=dc2ba6fc96e8f6e04d3f770684c4c7477b182650) [3 pro](https://preview.redd.it/svpwgv686qzf1.png?width=2532&format=png&auto=webp&s=64e25d7b9412b267aaac5f60896e203dec2299e3) https://preview.redd.it/s59wc5v96qzf1.png?width=2522&format=png&auto=webp&s=767742c9d95ed25b2eab569e217683b3e0399216 # Conclusion As much as you might not want to believe it, it 100% is Gemini 3 Pro. The rate limiting, the model only working on a vpn, fake models not working at all and finally the quality difference. EDIT - in the time it took me to post this it seems google have blocked it, hearing the same from other people too.",
        "comments": [
            {
                "raw_content": "`gemini --model gemini-3-pro-preview-11-2025` isn't working for me. And to be clear I am in the US. Edit: It works with a US VPN.",
                "author": "thatisagoodrock"
            },
            {
                "raw_content": "The quality difference is difficult to overlook.",
                "author": "Far-Telephone-4298"
            },
            {
                "raw_content": "> Entering \"gemini --model gemini-3-pro-preview-11-2025\" DOES let you prompt What if you change the numbers, as opposed to entering something entirely different? i.e does gemini --model gemini-3-pro-preview-12-2028 work, for example? If not, then I'd say it's pretty much guaranteed.",
                "author": "McKing_of_spades"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google is finally rolling out its most powerful Ironwood AI chip, first introduced in April, taking aim at Nvidia in the coming weeks. Its 4x faster than its predecessor, allowing more than 9K TPUs connected in a single pod",
        "score": 540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s absolutely insane Not the 4x part, that’s boring. The 9k TPUs in a pod part. I don’t think most people understand the implications of that. If it can do an all-reduce across 9k TPUs, it can run MUCH larger models than the Nvidia NVL72. It would make really big 10T param size models like GPT-4.5 feasible to run. It’d make 100T param size models possible. This is the last big push to prove that scaling works. If Google trains a 100T size model and demonstrates more intelligence and more emergent behavior, the AGI race kicks into another gear. If 100T scale models just plateau, then the AI bubble pops. This announcement is the beginning of Act III.",
                "author": "DistanceSolar1449"
            },
            {
                "raw_content": "Google is very undervalued in AI market in many ways ...",
                "author": "FigureMost1687"
            },
            {
                "raw_content": "its incoherent how google is not selling these if they're better than nvidias chip. i get people always say it helps their cloud business, but nvidias market cap is like 40% large than googles if they have a chip thats actually a peer competitor that would be worth an absurd amount as a stand alone product.",
                "author": "Healthy_Razzmatazz38"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.1 Thinking spotted in OpenAI source code 👀",
        "score": 437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gemini 3 vs GPT-5.1 will be a fun showdown to watch 🍿",
                "author": "backcountryshredder"
            },
            {
                "raw_content": "Yesterday i got lucky and made A/B test. There was a banner in Chatgpt saying \"You are testing a new version of ChatGpt\". I selected the emoji version, of course",
                "author": "Sockand2"
            },
            {
                "raw_content": "Ah shit, here we go again",
                "author": "Ken_Sanne"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman says OpenAI could have an AI CEO, with departments mostly run by AI in a few years",
        "score": 137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/nc4s3hi6gpzf1.jpeg?width=1066&format=pjpg&auto=webp&s=f085390fdac55b9dbac4ca3b1d6d1eba2222b432 After that, I wouldn't dismiss any idea, as outlandish as it may seem. My general stance is: It's within the realm of possibility, we'll see what happens.",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "If that was the case, would it go back to being nonprofit?",
                "author": "Ok-Improvement-3670"
            },
            {
                "raw_content": "Someone take microphones away from him forever, cuz at this point he's just full-time trolling.",
                "author": "plasma_dan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Kimi K2 Thinking, A Chinese Open-Source Trillion-Parameter Thinking model, surpass Grok 4 and GPT-5 on HLE",
        "score": 312,
        "text_content": "https://preview.redd.it/f0w7obudjnzf1.png?width=1920&format=png&auto=webp&s=4181cc1e5937735739b961f2fb8c18db24c635b2 That's huge!",
        "comments": [
            {
                "raw_content": "Just released model. I didn't know this.. jeez people. Be kind and include links [https://moonshotai.github.io/Kimi-K2/thinking.html](https://moonshotai.github.io/Kimi-K2/thinking.html)",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "I noticed its reasoning was shockingly good when I first started testing it earlier today.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "This is indeed huge if live up to the claims. Will try it later today.",
                "author": "TheInfiniteUniverse_"
            }
        ],
        "subreddit": "singularity"
    }
]