[
    {
        "post_name": "💀 An 8-year-old girl was 𝘒𝘐𝘓𝘓𝘌𝘋 in Boise, Idaho when she was struck by a truck on Nov. 11. The apprehended driver is an 𝐈𝐋𝐋𝐄𝐆𝐀𝐋 𝐀𝐋𝐈𝐄𝐍 named \"𝙀𝙡𝙫𝙞𝙣 𝙍𝙖𝙢𝙤𝙨-𝘾𝙖𝙗𝙖𝙡𝙡𝙚𝙧𝙤\". He had an outstanding federal warrant involving U.S. Immigration and Customs Enforcement...",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Love is Love shirt - good chance her parents voted for this. Sad.",
                "author": "DeepStateParasite"
            },
            {
                "raw_content": "Did her parents dress her in an LGBT propaganda shirt?",
                "author": "hansgruber7"
            },
            {
                "raw_content": "And what's an illegal alien with an outstanding federal warrant doing with a driver's license? You should see the bleeding hearts online defending this POS \"because he cooperated with police.\"",
                "author": "mateus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Toyota CEO goes full MAGA at NASCAR event as carmaker unveils $912M investment in US manufacturing",
        "score": 1077,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool story, bro. Now terminate all turbocharged engines in what used to be reliable trucks. Because you just destroyed your brand. Your traditional customers won't buy the stuff you are making now. We want 300k mile vehicles.",
                "author": "HelluvaEngineer"
            },
            {
                "raw_content": "I’m just waiting to see leftists smashing their Camrys any minute now on Bluesky. Oh wait, most of them can’t afford decent cars.",
                "author": "goldkeyboardwarrior"
            },
            {
                "raw_content": "MAGACAR",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump tapped Elon Musk on his way in to the White House dinner tonight",
        "score": 429,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm still convinced all that feud shit was to take the heat off Elon and Tesla. Anyone else notice how the fire bombing of random people's cars waiting for service at the Telsa service centers stopped almost immediately after the feud hit the news cycle?",
                "author": "yummy_yumm_yumms"
            },
            {
                "raw_content": "I thought this theory was retarded at the time, but what if that Epstein tweet by Elon about Trump was a trap to setup democrats? He got them all hot and bothered and frothing. Now it seems to be snaring democrats more than anything. And surprise surprise, Elon is back. Did they play a trick on the whole world?",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "United we are unstoppable.",
                "author": "RonPaulWasRight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Larry Summers opened his class today by addressing the shame he feels because of what he did with Epstein “Some of you will have seen my statement of regret, expressing my shame, with respect to what I did in communication with Mr. Epstein.”",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only shame when he's been caught. Chris Hansen has it right, give no quarter for pedos.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Early life check again ?",
                "author": "Justlooking250"
            },
            {
                "raw_content": "This guy is about as Deep State as it gets… Fmr Clinton Treasury Sec, Fmr President of Harvard, Economic Advosor under Obama, Sr Fellow at Open Society/Soros controlled Center For American Progress and Soros’s “Project 2029”, Board Member of OpenAI. His wife’s “Non-Profit” was being Funded by the National Endowment for The Arts, and the list goes on and on.",
                "author": "Tcrlaf1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ouch! That will leave a mark",
        "score": 1191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Fuck Joe Biden 👏🏼 Fuck Joe Biden 👏🏼 Fuck Joe Biden 👏🏼*",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "And why was he giving 7-year-old girls titty twisters at the swearing in ceremony?",
                "author": "leakmouth"
            },
            {
                "raw_content": "That shit is genuinely vile and I have no idea why he hasn't been investigated and imprisoned for it.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: ELON MUSK spotted at the White House for President Trump's dinner with the Saudi Crown Prince THE BOYS ARE BACK! I love this! We last saw the two reunite at Charlie's memorial.",
        "score": 1141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bro is there just for Saudi deals, like...it's not really a mystery.",
                "author": "assblast"
            },
            {
                "raw_content": "Our best run was that first 100 days. Daily DOGE bombs. It was waking people up, fast.",
                "author": "DingDongDitch"
            },
            {
                "raw_content": "👍",
                "author": "SpaceWizard"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scott Turner Secretary of HUD: \"Years of reckless, open-border policies have pushed our housing market to its limit — it was not meant to withstand MILLIONS of illegal aliens flooding our country. Deport the Millions of Illegal Aliens In OUR Country, FREE UP The Housing Market\"...",
        "score": 1267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Simple supply and demand. Reduce the demand is the only way back to affordability. Trump needs to 10x the deportation numbers, it's the only thing that really matters.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "They got loans for houses somehow and they got approved for apartments. The people making this possible are the real problem. I always blame the migrants last, and everyone that is part of creating and managing this system gets blamed first. BTW, the housing market is just starting to really go down. Expect quite the correction in the next few months. Overpriced housing bubbles can rarely withstand layoffs and a weak employment market.",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Not just housing, also the schools. Schools are getting so fucked over thanks to mass immigration and foreigners its not even funny. There will be who ghost town schools if we actually get rid of the third world thanks to the unnatural growth.",
                "author": "invalid_data"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LFG!",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's hard to believe there are posters here who still don't understand the game and reverse psychology games President Trump plays. Yes, this is real life, folks, stop giving up on shit so easily or go back to fucking Reddit.",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "Can somebody help me understand why a freaking act of Congress was required to just release some criminal investigation files?",
                "author": "STRONGLYWORDEDLETTER"
            },
            {
                "raw_content": "People still belive the 5d chess thing. Never mind that what we'll get will be blacked out harder than Ukraine in winter.",
                "author": "LordCommissarYarrick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trump attending a White House state dinner tonight welcoming Saudi Crown Prince Mohammed bin Salman 😍🔥",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lovely lady.",
                "author": "dataonly"
            },
            {
                "raw_content": "Beats the slipcovers Jill used to wear.",
                "author": "26magarat"
            },
            {
                "raw_content": "I like my First Ladies without dicks. Nice to have a proper woman representing the White House.",
                "author": "mmmpillsaregood"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 HAPPENING NOW: Christian and Islamic protesters are clashing in Dearborn, Michigan. Qurans have been hit with bacon and burning attempts of the Quran have happened. This could get ugly…",
        "score": 1509,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, the fucking Crusade has to start somewhere. Let it start here.",
                "author": "Datamancer"
            },
            {
                "raw_content": "This is such an obvious happening. Leftists just don't understand ANYTHING about history or humans.",
                "author": "MagaJay02"
            },
            {
                "raw_content": "Deus Vult!",
                "author": "Wizard_Glick"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - IT'S OFFICIAL: U.S. Senate passes by UNANIMOUS CONSENT forcing the release of the Epstein files, sending the House bill straight to PRESIDENT TRUMP once it arrives. Trump said he will sign it. Could happen VERY soon.",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Anyone who thinks there's gonna be anything earthshattering released in these files needs to stop and think back a few months and recall if there was anything earthshattering released in the JFK files. Powerful people don't allow incriminating stuff to just sit around in file cabinets for years.",
                "author": "briantrash"
            },
            {
                "raw_content": "that was the quickest they've done anything, in all my years of living.",
                "author": "here2red"
            },
            {
                "raw_content": "How many times have we seen “full transparency” on Epstein? I feel like this is the 10th time the “files” are being released",
                "author": "HunterBidensPC"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Indiana House Speaker Todd Huston fully backs President Trump and the redistricting efforts to draw a 9-0 map: “I've made it clear that House Republicans have the necessary votes to address this issue, and we stand ready to get the job done.”",
        "score": 952,
        "text_content": "",
        "comments": [
            {
                "raw_content": "PROVE IT!",
                "author": "saltyviewer123"
            },
            {
                "raw_content": "Good, now make it illegal to be a faggot in Indiana.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "You got to understand there are 3 Indianas. Indianapolis which is it's own creature. Fort Wayne which may as well be Chicago. The rest of us , red pilled and trying to claw back the republic from the abyss. Democrats are fighting hard to steal it.",
                "author": "friarfox"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wife material?",
        "score": 751,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I liked her better in The Green Mile.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "Perhaps she could be more \"woman\"-like?",
                "author": "ancillasedet"
            },
            {
                "raw_content": "> I am the table Fact check: true.",
                "author": "bidensmissingbrain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Woman, 26, is set ablaze on Chicago train by male passenger months after Ukrainian refugee died at hands of subway rider",
        "score": 981,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, I still remember when an illegal did this and stood around to watch while metro police ignored everything.",
                "author": "Scipio_Americanus"
            },
            {
                "raw_content": "There was a since-deleted Reddit thread where someone asked what can be done to reduce crime on transit in Chicago after this attack. Some of the people there were downright dismissive of what happened, calling it an isolated incident or saying that crime isn’t that big of a problem.",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Get away from the blacks. Scott Adams was right.",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ONSERVATIVE PROTESTER ARRESTED AT ANTI-MUSLIM PROTEST IN DEARBORN Officers refused to give reason or their name/badge number. Dearborn police have witnessed several violent acts by Muslims and have refused to make those arrests. Reason for arrest remains unknown",
        "score": 721,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is 100% because of Mayor Abdullah H. Hammoud. He's an anti American anti Christian pile of pig shit. Let's deport this motherfucker too.",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "I watched this on Cam's livestream. The interesting observation is that during the daytime, all of the cops were Muslim. They changed shifts as it got dark and a bunch of white cops came in and brought barricades.",
                "author": "War_Hamster"
            },
            {
                "raw_content": "It's lost. Once the police start carting away victims, tyranny is established. If you want to get it back you have to create your own justice.",
                "author": "AngeredKabar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING — IT’S OFFICIAL: The Epstein Files Transparency Act has PASSED the House of Representatives, 427-1",
        "score": 1508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's see if the Democrats, and a few RINOs in the Senate kill it.",
                "author": "airborne3502"
            },
            {
                "raw_content": "We're getting the same binders they gave out to the grifters aren't we?",
                "author": "fortyfive4fourmore"
            },
            {
                "raw_content": "Can we finally get this all done so \"muh epstein\" can stop being a talking point?",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨Ratskin is now THREATENING anyone who votes to CENSURE Stacey Plaskett. \"Beware of your answer here... there's a lot more about to come out.\" US House Reps currently debating HR888 to censure Rep Stacey Plaskett and remove her from the Intel Committee.",
        "score": 1138,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nobody cares what that faggot says, it's already done. House votes to PROCEED with censuring and stripping committee assignments of Stacey Plaskett (D) for her collusion with Epstein to harm Trump https://x.com/EricLDaugh/status/1990882218797875574",
                "author": "Sea_Still"
            },
            {
                "raw_content": "lol. The early life strikes again. Sorry white girls who got kidnapped raped and probably murdered, we can’t punish his accomplice bc reasons.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Weren't there prison guards feeding this Ratskin Maxwell intel so he could Speech and Debate Clause false info",
                "author": "GodKingHarambe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nolte: Report Says Trump to Announce Long Overdue Dismantling of Education Dept. The utterly destructive and useless U.S. Department of Education is about to be dismantled, according to a report in the far-left Washington Post.",
        "score": 1448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Long overdue.",
                "author": "Yignuced"
            },
            {
                "raw_content": "Reagan wanted to eliminate it, but Congress did not. Now after decades of fail can we get this done?",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "Get ready for every teacher to bitch saying they are going to lose their jobs when this won't affect them at all and blame Trump still because some cunt in administration said so.",
                "author": "LaVaughnRobinson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Texas Wants To Be Reimbursed For Biden Open-Border's Cost",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I want to be reimbursed for Biden open-border's cost",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "The best thing you could do for Texas is DEPORT ALL THE ILLEGALS!",
                "author": "FBIAREFAGGOTS"
            },
            {
                "raw_content": "Sue Biden personally, and Mayorkis... drain their bank accounts.",
                "author": "Koikatrose"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump-Appointed Judge May Have Just Cost Republicans Nearly Half A Dozen House Seats",
        "score": 882,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It goes to the 5th circuit. No worries.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "Lazy ass reporting doesn't actually name the judges. Who were they?",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Well, California can't wipe out every red district then, either. They can't have it both ways.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NVIDIA Says We're \"Fake News\" | Gaslighting, GPU Bans, & Export Controls Update",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*Nvidia : We dont know whats going on, even tho deep inside we actually know, but money keep rolling in. So we wont admit it; therefore it is fake news.*",
                "author": "hackenclaw"
            },
            {
                "raw_content": "Remember everyone, Steve is not suicidal. Just like the Boeing whistleblowers. (Palantir's CEO was happy to repeatedly publicly announce that his products are used to intimate and even kill people.)",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "What's with all the Nvidia shareholder bots swarming this thread lol. Ye Steve bad , Nvidia Good God.",
                "author": "SlightAspect"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Reportedly Planning GPU Price Increase as Memory Costs Spike",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't get why usually like a $20 increase of a cards parts cost usually ends up at a $50 increase to a cards sale price. Why does Asus, Gigabyte, etc, get to make $30 more profit when they spend $20 on memory?",
                "author": "bubblesort33"
            },
            {
                "raw_content": "Perfect. Exactly what we wanted to hear.",
                "author": "spicypixel"
            },
            {
                "raw_content": "Sounds like our lengthy current era of affordable, powerful, and plentiful GPUs might finally be coming to an end!",
                "author": "kkyqqp"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ASRock posts about “FidelityFX Super Resolution (FSR) 4.1”",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Might be launching on the 10th alongide FSR Redstone.",
                "author": "Firefox72"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Microsoft announces Azure Cobalt 200, its next-generation Arm-based CPU",
        "score": 97,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Need some benchmarks against graviton",
                "author": "spicypixel"
            },
            {
                "raw_content": "Lmao at them using Teams as a benchmark",
                "author": "Slasher1738"
            },
            {
                "raw_content": "[Just two months ago](https://www.reddit.com/r/hardware/comments/1nepk8e/comment/ndqjdcg/), I thought, \"Huh, nobody launched Neoverse V3 in the datacenter.\" Cobalt 200 remains sizable, 66 V3 cores per chiplet, 132 total cores per SoC, mentions the \"latest TSMC 3nm\" so likely TSMC N3P. |CPU|\\# of cores|uArch| |:-|:-|:-| |Microsoft Cobalt 200|132|Neoverse V3| |Microsoft Cobalt 100|128|Neoverse N2| |NVIDIA Grace|72|Neoverse V2| |Amazon Graviton 4|96|Neoverse V2| |Amazon Graviton 3|64|Neoverse V1| |Google Axion N4A|64|Neoverse N3| |Google Axion C4A|72|Neoverse V2| // >When designing Cobalt 200, our benchmark workloads and design simulations revealed an interesting trend: several universal compute patterns emerged – compression, decompression, and encryption. Over 30% of cloud workloads had significant use of one of these common operations. >Optimizing for these common operations required a different approach than just cache sizing and CPU core selection. **We designed custom compression and cryptography accelerators** – dedicated blocks of silicon on each Cobalt 200 SoC – solely for the purpose of accelerating these operations without sacrificing CPU cycles. These accelerators help reduce workload CPU consumption and overall costs. For example, by offloading compression and encryption tasks to the Cobalt 200 accelerator, Azure SQL is able to reduce use of critical compute resources, prioritizing them for customer workloads. This is one reason why Intel, AMD, Ampere, Qualcomm, et al could license their ***cores*** to hyperscalers. Let hyperscalers add the accelerators directly to the dies → you still win (part of) the socket + reap license fees, instead of losing to Arm's Neoverse. **And** that adds competitive pressure across the whole ecosystem: now you're not just competing on \"Can I add my accelerators?\" but \"Everyone lets me add my accelerators. Who has the fastest microarchitecture? Who has the lowest power? Who has the best caching?\" Intel hinted at this with the NVIDIA tie-up. Of course, maybe hyperscalers just replace merchant silicon wholesale (e.g., NVIDIA's Vera CPUs), but hyperscalers have the balance sheet & the need to optimise their silicon. Once they've taped out a major SoC like this, they'll probably fab as many as they can to amortize the cost. It is genuinely not cheap to ship your own silicon (even with someone else's microarchitecture). EDIT: Cobalt 100 is N2, not V2.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Galaxy S26: Samsung officially discusses performance and efficiency of first-ever 2nm chips. Manufacturing yield has reached 60%",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">As noted by an industry insider, Samsung has opted for the standard ARM Lumex architecture, whilst Qualcomm and Apple have adopted their own chip designs with superior optimisation. Why didn't Samsung think to just magically wave into an existence an ARM architecture license? Anyways, 2nm isn't a proper new node for Samsung anyways, right? Just a sort of mild evolution of 3nm?",
                "author": "Seanspeed"
            },
            {
                "raw_content": "Does every phone have to be the same shade of god-awful orange now? Edit: I’m annoyed at Samsung continuing to copy Apple",
                "author": "JustHereForCatss"
            },
            {
                "raw_content": "I thought yield would be a lot higher than that, on a chip that small.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD FSR \"Redstone\" Is Coming - December 10th",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean its technicaly already out in Black Ops 7 and it works. Its not quite as good as Nvidia's Ray Reconstruction tech but its a significan't step up from the baseline denoiser and improves the quality of RT reflections across the board. [https://i.imgur.com/td0Vqqm.png](https://i.imgur.com/td0Vqqm.png) [https://i.imgur.com/rxexoDm.png](https://i.imgur.com/rxexoDm.png) On the plus side it appears to be cheaper to run than Nvidia's solution.",
                "author": "Firefox72"
            },
            {
                "raw_content": "So what IS it exactly? A new version of FSR? 4.1?",
                "author": "Ramongsh"
            },
            {
                "raw_content": "Just in time for AMD GPU price increases",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD & NVIDIA Reportedly Consider GPU Cuts, ASUS and Others Slow Motherboard Plans Amid Memory Shortage",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice! Scarcity to drive prices up again. They just don't quit.",
                "author": "IgnorantGenius"
            },
            {
                "raw_content": ">Korea Economic Daily says NVIDIA, AMD, and other GPU makers are considering dropping some mid-to-high-end gaming cards where memory now makes up an unusually large share of total cost. My predictions: 6060 9GB @ 96-bit. 6070 12GB @ 128-bit. 6070 Ti 15GB @ 160-bit. 6080 18GB @ 192-bit. I see little reason for DRAM foundries to continue producing 16 Gbit GDDR7 chips.",
                "author": "GenZia"
            },
            {
                "raw_content": "So no one is planning to investigate this memory cartel?",
                "author": "Working_Sundae"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Pro-Consumer Case for Using Harmonic Mean to Calculate FPS Averages",
        "score": 24,
        "text_content": "tl;dr: If someone is buying a GPU with a particular frame rate experience in mind (e.g. 4k @ 60 FPS, 1440p @ 144 FPS), the Harmonic Mean, which is designed for calculating averages of rates/frequencies, is a better representation than the Geometric Mean (used by, for example, Hardware Unboxed). Geometric Mean exaggerates FPS by \\~10% compared to Harmonic Mean, so a consumer targeting a specific \"general\" frame rate will unknowingly be buying an underpowered card for their use case. I get that choosing how to represent data always involves tradeoffs. If someone only cares about how strong one card is relative to another, whether you use the arithmetic, geometric, or harmonic mean generally won't make much of a difference (they will all be within a few points of each other), but if someone is targeting a specific \"experience,\" it does. Many reviewers already recognize that using Geometric Mean is more \"representative\" of the card's general performance than arithmetic mean. That is true, because geometric mean effectively reduces the influence of outliers (e.g. high FPS competitive games like CS). But mathematically, geometric mean is designed for use with growth rates (e.g. interest rates, stock returns). There is an even better kind of mean that is specifically designed for use with frequencies/rate (e.g. frames *per second*): the harmonic mean. If you are looking for a specific \"experience\" with games, like \"I want to enjoy my story-driven RPGs at *at least* 60 FPS @ 4k\" or \"I want to consistently max out my 144 Hz monitor,\" then harmonic mean will be the most helpful statistic for you. These \"experiences\" boil down to average frame time (smoothness) and/or average latency (responsiveness), which correspond to the inverse of FPS and happen to be exactly the kind of thing that harmonic mean is meant to calculate for. For instance, many console games have a mode that targets 40 FPS, because in terms of frame time and latency, 40 FPS is the average of 30 FPS (the \"quality\" mode) and 60 FPS (the \"performance\" mode). You can verify this by taking the average of 1/30 and 1/60 and comparing it to 1/40. In this case, the arithmetic mean of 30 and 60 is 45, the geometric mean is \\~42, and the harmonic mean correctly comes out to 40. I pulled from the [TechPowerUp ASUS RX 9070](https://www.techpowerup.com/review/asus-radeon-rx-9070-tuf-oc/) data to create a [spreadsheet](https://docs.google.com/spreadsheets/d/e/2PACX-1vTubyThpayiBdQLk-dgk6iyRvgEJc43cy0WFBxRmFE371wEJ1Q4JZieMc2WOGjG7eyJtpvHdU-dNFj9/pubhtml) showing how the different methods of calculating the mean might affect someone's buying decision. (notes: 1. I know the formatting is garbage, but I highlighted the most important bits. 2. I only realized that cards launched after the RX 9070 aren't represented after I made it. Oh well. 3. I only used the first 20 of the 24 games, so that's why my averages differ slightly from theirs. It doesn't really affect the conclusion). If you are after a \"4K @ 60 FPS\" experience, the arithmetic mean would lead you to purchase something similar in power to an RX 7900 GRE/4070 Super. If you go by the geometric mean, you would purchase something about as powerful as an RTX 5070. But with both of these options, you would likely find yourself having to turn down settings or accept a lower frame rate more often than you anticipated. In reality, you would need something closer to a 3090 Ti/4070 Ti Super to achieve that goal. If that class of card is financially out of reach, then at least you have that data and can adjust your expectations or decide to wait until the next generation. Obviously upscaling can alleviate the issue, but the point still stands: if you are targeting a specific performance level across a variety of games, harmonic mean is more helpful to you as a consumer than geometric mean. When many reviewers are already using the more complicated geometric mean, I don't see much of a downside to switching to a metric that is even more pro-consumer. I don't even expect reviewers to go back and update previous reviews, I'm just suggesting to use this metric going forward. People who are looking to buy the most expensive card they can afford, or the \"best value\" card, or a card that is x times as strong as their current card will not be affected at all. But people looking for specific frame rates will be better equipped to make a decision.",
        "comments": [
            {
                "raw_content": "It might be helpful to show how hamonic mean is calculated, and an example how how it leads to better results. The claim that console games target 40fps because it's the mean of 30 and 60 doesn't sound like a plausible reason - they can tune to any FPS they want. It's likely it has more to do with 120hz being a common high refresh tv setting, anf 40hz being exactly 1/3 of that.",
                "author": "CaptainMonkeyJack"
            },
            {
                "raw_content": "40 Fps is the arithmetic mean of the frametime of 60 fps (16.67 ms) and 30 fps (33.33 ms), (33.33+16.67)/2 = 25 = 40 fps. But more importantly, 40 fps is chosen because it is an integer multiple of 120, so 120hz tv's can display a vsync'd 40 fps signal without frame stuttering. 40 fps modes are normally (and should not) be exposed to 60hz tvs.",
                "author": "Your-Paramour"
            },
            {
                "raw_content": "I don't know the math, but can't you discern what you're implying by simply using the numbers available? If a card can run x at 150fps, you already know it can run y at 40fps.",
                "author": "ClerkProfessional803"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung set to become Nvidia's leading HBM4 supplier as Micron stumbles",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "what happened to hynix",
                "author": "Scy_Nation"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Shadow drop of the tomb raider games on switch 2 and 1 60 fps on switch 2",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Aspyr is so hit or miss. Its wild",
                "author": "Mattolsen96"
            },
            {
                "raw_content": "How do the GTA remasters play on the Switch 2. Are they still jenky or did they get patched up since launch?",
                "author": "AgentSkidMarks"
            },
            {
                "raw_content": "It looks so extremely horrible with the flat lighting. PS4 version looks 3 times better. So sad.",
                "author": "OfficialShaki123"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "One of the console releases with the most variety ever.",
        "score": 1587,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I still haven't purchased everything I want, games are coming out faster than I can afford/finish them.",
                "author": "MapleGiraffe"
            },
            {
                "raw_content": "Still crazy to think the Switch 2 has only been out in the market for less than 6 months.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "The PSP and 360 launch lineups will remain unmatched.",
                "author": "bogohamma"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomb Raider: Definitive Edition on Switch 2 just runs the Switch 1 port with better resolution and 60 fps, but at least it has a mouse mode.",
        "score": 171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not too surprised. Saw someone point out in the trailer she doesn’t have the better hair from the PS4/Xbone version.",
                "author": "SomeBoxofSpoons"
            },
            {
                "raw_content": "Yeah I can tell why this was a shadow drop with a discount on day 1.",
                "author": "zarif2003"
            },
            {
                "raw_content": "Hey At least it has an update. I hope more devs update their games And shadow drop titles too",
                "author": "zaadiqoJoseph"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Tomb Raider (2013) Definitive Edition is out for Switch and Switch 2!",
        "score": 387,
        "text_content": "So random! Shadowdropped.",
        "comments": [
            {
                "raw_content": "Wow zero marketing",
                "author": "Sandy12315"
            },
            {
                "raw_content": "Took them long enough! Hope they release Rise and Shadow as well. Very curious to see how good this port is.",
                "author": "linkling1039"
            },
            {
                "raw_content": "WARNING: The \"Switch 2 Edition\" is just the downgraded Switch version but running at 60fps. Yeah, the game was downgraded to run on the Switch 1. And they're using THAT version to sell as a \"Switch 2 Edition\". It is NOT a true Switch 2 Edition. So the game on Switch 2 looks like a lesser version of the PS4 DE version. Just wanted to give you peeps a heads up before you buy. Basically, it's a cheap Switch 2 port. Literally.",
                "author": "Garamenon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Titans of the Tide has both a performance and quality mode under video settings",
        "score": 103,
        "text_content": "From what I’ve seen so far I’d very much recommend using performance if you’re going handheld to play this, I haven’t tried it docked yet but moving the camera in quality mode is horrific lol. So atleast if you’re doing handheld stick to performance.",
        "comments": [
            {
                "raw_content": "How’s the game as a whole? Looks pretty fun",
                "author": "Ok_Piece_5020"
            },
            {
                "raw_content": "This game doesn’t look graphically intense enough to warrant this option imo",
                "author": "Meta13_Drain_Punch"
            },
            {
                "raw_content": "Still salty they disabled the capture button, again…",
                "author": "alpacapoop"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Don't know if this was confirmed before, but Final Fantasy VII Remake is going to be running at 2K resolution, said by the director in an interview.",
        "score": 119,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If they're able to do 1440p/30fps (which I'm assuming is what he means by 2k) it would be awesome if they offered 1080p/60fps docked as well. One of the biggest upgrades going from the PS4 to PS5 version was how much better the animation in combat looks at 60fps.",
                "author": "MXC_Vic_Romano"
            },
            {
                "raw_content": "Well, as he says, 1440p via DLSS when docked - so it'll probably be around 720-900p native and 540-640p in handheld mode (upscaled to 1080p)",
                "author": "GamePitt_Rob"
            },
            {
                "raw_content": "Fantastic!",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Cannot Make Me A Sandwich",
        "score": 231,
        "text_content": "I went away this weekend with some friends and I brought my Switch 2 as well as items to make myself a peanut butter sandwich. When I got home, as I was taking my bread out to make myself the sandwich I noticed one of my friends must have taken my peanut butter, because it was missing. While I was fuming at the peanut butter that was missing, my dock must have been loose still in my bag and ended up slipping out onto my plate and in between the bread. Still hungry, I tried to move the dock around and spread it on the bread but I found that the dock was too heavy, not spreadable and ultimately not very peanut-butter-like. I can't seem to get it to work the way my stomach wants it to. If I send it to Nintendo, do you think they would take my Switch 2 dock in and maybe send me some tasty peanut butter before supper time? At this point I assume the whole dock needs to be replaced because I would like a whole jar of peanut butter.",
        "comments": [
            {
                "raw_content": "Now do it with the actual console",
                "author": "honeymoonblackstar"
            },
            {
                "raw_content": "The dock is too cold to be spreadable. Heat it up in the oven until it gets soft.",
                "author": "SwashNBuckle"
            },
            {
                "raw_content": "What can even go past this. I would have never thought a third would come so soon",
                "author": "Mrjonnyisabed"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Understanding Virtual Game Cards (VGC) and how to share your digital games",
        "score": 91,
        "text_content": "So, in the following weeks, millions of persons will get a Nintendo Switch 2: Black Friday in the USA (and the equivalent in other countries), Christmas/Holidays, and so on, and I want people to understand how the Virtual Game Cards system works, but some people are confused on how it works. I will give you a detailed explanation on how they work, and how to share your games with a second console, so feel free to ask any questions if you have any doubts. For this explanation, we will use the following scenario: * Switch-A * Switch-B * Profile-A (this profile will be the one purchasing the digital games) * Profile-B To start, forget anything you know or anything you read/listen about a Primary/Secondary console. That system is legacy and it is not valid anymore on the Switch ecosystem. If you see something about this on the Internet, it is no longer valid. Think of Virtual Game Cards as physical cards. This is the most important thing you should do... just picture the VGC as a real physical card and how a physical card would work. **Physical Games** If you have a physical game inserted in a console, any profile in that console can play the game. Example: If you insert a physical card into Switch A, then Profile A, and Profile B (and even a Profile C, D, E and so on) can play the game. And if you remove the physical cart from Switch-A insert the same physical card in Switch-B then Profile-A and Profile-B (and Profile C, D, E and so on) can also play the game in that Switch-B. That physical game will always work, with or without an Internet connection. Are we clear here, right? This is how a physical card works. Pretty simple. Well, it's the same situation with Virtual Game Cards. **Virtual Game Cards (VGC)** Like I said before... think of VGC as physical games. If you have a VGC game inserted in a console, any profile in that console can play the game. Example: If you insert a VGC into Switch-A, then Profile-A, and Profile-B (and even a Profile-C, D, E and so on) can play the game. And if you remove the VGC from Switch-A and insert the VGC in Switch-B then Profile-A and Profile-B (and Profile C, D, E and so on) can also play the game in that Switch-B. That VGC will always work, with or without an Internet connection. Just like a physical game. **Online License** But, you can also play the game with Profile-A (the profile that purchased the game) without having the VGC inserted in the system, but you need to turn on the Online License setting (you can find this setting by selecting your profile on the top left corner and then in the account settings). When this setting is enabled, you can play the VGC without inserting them first. You just need a small online verification before launching the game (no need to have a constant internet connection, just needed to launch the game). This way you can leave all your VGC inserted in Switch-B, so any profile in that console can play the games. And in Switch-A (your personal Switch), use the Online License check. You can even go to the VGC tab on the Switch's main menu, select a game, and instead of pressing the **Load on This System** button, press the **Options** button, and then press the **Download Data** button. This way the game will downloaded to the console without loading the VGC in. Keep in mind that you can't play the same game at the same time together in any scenario. For this, you need each a copy of the game (just like if it was a physical card). **Lend Games** Now, one huge advantage of VGC is that you can lend games to other person just like if they were physical cards. Remember: always think of VGC as if they were physical cards. You can lend the VGC to other persons just like if they were physical cards, but they need to be in your family group and you need to be in close proximity to lend the game for 14 days. The advantage of this method is that you don't need to leave your account on their Switches. There's no other system (PSN and Xbox for example) that let's you lend digital games to your friends/family. **Initial Console Linking** Keep in mind that only two systems can be linked together (in this example Switch-A and Switch-B) to use the VGC of any particular Profile. So, the VGC of Profile-A can be loaded into Switch-A, and Switch-B. If you have a Switch-C, Switch-D, and so on, you can use the Online License check in those systems. If you have a Switch console already and get a new one, both consoles will need to be in close proximity in order to get linked. If you do not have the first console with you (example, it got stolen, you sold it without formatting it, it's broken, or any other reason where you can't get the console back), you can deactivate the console from here: [https://accounts.nintendo.com/portal](https://accounts.nintendo.com/portal)",
        "comments": [
            {
                "raw_content": "This is nicely explained, but to be clear about something that is tossed in at the end: This is pretty unwieldy for a family with more than two switches. You can only do this between two switches at any given time, so you have to unlink (which will un-share/\"eject\" the virtual game cards being loaned) and then link to a different system. The systems have to be in close physical proximity to link together for the initial sharing. Again, like sharing a physical game card. You would have to be in close physical proximity to hand someone your game, right? The problem arises when you want to loan a game to one person, then another game to a different person. You are only allowed to share to one switch at a time. So imagine if you were sharing your physical library, but in order to share a game to Person C, you have to get all your games back from Person B, and you're only allowed to loan to Person C until that sharing is over. Then you unlink from C, re-link to B (remember, close proximity!), and share again. This system, again, is garbage for a family where multiple people have switches. But it is well explained above!",
                "author": "withgreatpower"
            },
            {
                "raw_content": "So with this I understand the online license setting. Can’t say I took my time to search for this info myself since I don’t have the need to do it but it’s nice to know",
                "author": "zenru"
            },
            {
                "raw_content": "This doesn't work when u try to lend game 1 to friend 1 and game 2 to friend 2.",
                "author": "vixgdx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - Week Beginning 11/18/25",
        "score": 98,
        "text_content": "[https://e7.pngegg.com/pngimages/666/956/png-clipart-gabe-newell-half-life-2-episode-three-dota-2-peter-parker-face-video-game-thumbnail.png](https://e7.pngegg.com/pngimages/666/956/png-clipart-gabe-newell-half-life-2-episode-three-dota-2-peter-parker-face-video-game-thumbnail.png) **Small Sub Update: Going forward, we're going to limit Jez Corden's content to only his official reporting i.e. windowscentral links. No twitter replies/etc. Tiers will be recalibrated when you guys will get to do tier votes soon-ish around TGA.** Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Valve is still aiming for 2025 for Half-Life 3 announcement, according to GabeFollower](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ox5bv6/valve_is_still_aiming_for_2025_for_halflife_3/) * [Insider Gaming Weekly - Valve's Next Announcement Won't be at TGAs, Tom Henderson Says Big Game Coming In March](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1oxa8r2/insider_gaming_weekly_valves_next_announcement/) * [GOTY nominees have leaked before the official reveal](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ozkhni/goty_nominees_have_leaked_before_the_official/) * [Valve's Steam page shows 2 \"Upcoming Releases\" - only 1 of them - Deadlock - is currently publicly visible](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ovegnd/valves_steam_page_shows_2_upcoming_releases_only/) * [Mike Straw says \"Valve isn't done with the big announcements.\"](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1otecxa/discussion_news_and_request_thread_week_beginning/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "Small Sub Update: Going forward, we're going to limit Jez Corden's content to only his official reporting i.e. windowscentral links. No twitter replies/etc. Tiers will be recalibrated when you guys will get to do tier votes soon-ish around TGA.",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "KOTOR Remake that leads to a KOTOR 2 Remake",
                "author": "seceralnof"
            },
            {
                "raw_content": "Ok so this thread got nuked about not allowing vague posting but there was good replies so I assume this is a better place to say “if a source doesn’t actually say anything it shouldn’t be posted”. If someone says “A WTF moment will happen next year” that’s not a leak or a rumor. IMO. https://www.reddit.com/r/GamingLeaksAndRumours/s/LfsjUOZmzL",
                "author": "GoldenTriforceLink"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shpeshal_Nick: \"Last week I got a DM that Valve was showing off hardware “this week” (last week) and software “next week” (this week)\"",
        "score": 630,
        "text_content": "https://xcancel.com/Shpeshal_Nick/status/1990890439633682499 > Probably deep enough into the week to know this isn’t happening right now > > Last week I got a DM that Valve was showing off hardware “this week” (last week) and software “next week” (this week) > > This software was allegedly Half Life 3. Hence my caution with my tweet. “Big if”",
        "comments": [
            {
                "raw_content": "It’s tueday, the hardware was announced last wednesday, how is it deep enough into the week?",
                "author": "N0th1ng5p3cia1"
            },
            {
                "raw_content": "Just end my misery already",
                "author": "aRandomBlock"
            },
            {
                "raw_content": "Seems like Valve is feeding everyone different times to catch leakers",
                "author": "pie_-_-_-_-_-_-_-_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate acknowledges he has heard about HLX/HL3",
        "score": 879,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1990853805462757825](https://xcancel.com/NateTheHate2/status/1990853805462757825) inb4 ~~\"Yes I heard HL3 is cancelled again.\"~~ UPDATE: [https://xcancel.com/NateTheHate2/status/1990856520909631978#m](https://xcancel.com/NateTheHate2/status/1990856520909631978#m) \"Working to get consensus on info & extract the truth from it all.\" UPDATE 2: [https://xcancel.com/NateTheHate2/status/1990859068118798540#m](https://xcancel.com/NateTheHate2/status/1990859068118798540#m) \"Announcement timing is one of the things I'm trying to get a consensus on. Have heard very mixed things on timing.\" UPDATE 3: [https://xcancel.com/NateTheHate2/status/1990877937948561881](https://xcancel.com/NateTheHate2/status/1990877937948561881) \"Some is similar, some differs. Some info has already aged poorly.\" in regards to his information being similar to current rumors UPDATE 4: [https://xcancel.com/NateTheHate2/status/1990879872751735291](https://xcancel.com/NateTheHate2/status/1990879872751735291) Nate heard one bit of info that it would happen at noon today, but it has come and gone and that's why he won't share anything until he has a consensus UPDATE 5: Nate is replying people on twitter with what we already know from above updates, I won't be updating anymore until there is new info from him.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I think we've all heard about Half Life 3 at this point.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "In both rhythm and substance, some of these leaker statements have the same vibe as that scene in Seinfeld where Kramer is pretending to be a professor and another character is asking him about his work. \"Tell me professor, is it your contention that Shakespeare was an imposter?\" \"My contention?\" \"Your contention.\" \"Well, yes, that's my contention.\" (Jerry then chimes in and says, \"I heard him contend that.\")",
                "author": "AfraidoftheLark"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Sean Hollister @ The Verge: \"Valve didn’t announce Half-Life 3, so why all the secrecy? I told you security guards lined the halls during my Valve visit.\"",
        "score": 1303,
        "text_content": "https://www.theverge.com/games/820533/valve-secrecy-security-guards-steam-machine-valve-hq-no-hl3 \"Sean Hollister Valve didn’t announce Half-Life 3, so why all the secrecy? I told you security guards lined the halls during my Valve visit. CNET’s Scott Stein can back me up. But I’ve never seen guards during previous Valve trips — and maybe they were only there that day. Steve Burke (Gamers Nexus) told me he didn’t see any when he visited.\"",
        "comments": [
            {
                "raw_content": "Getting my shit blown smoove off by a Valve security guard because I tried to go the bathroom and accidentally stumbled into the Half Life 3 room.",
                "author": "SecretTraining4082"
            },
            {
                "raw_content": "They're actually working on Half-Life 4 now.",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "No way, the Combine was at Valve headquarters?",
                "author": "Paper2440"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KiwiTalkz: \"2026 is the year the floodgates for third parties open for Switch 2\" and \"[t]here is 1 game in particular next year, that will be a wtf moment\", but it's not GTA 6",
        "score": 245,
        "text_content": "https://xcancel.com/kiwitalkz/status/1990864921584902584 https://xcancel.com/kiwitalkz/status/1990889044348219866",
        "comments": [
            {
                "raw_content": "You KNOW these leaks are BS when they say, \"There is 1 game in particular next year that will absolutely blow your socks off!\" then not say the game's name. Alright, Kiwi, tell us. If you know what game this is, tell us.",
                "author": "JAGD21"
            },
            {
                "raw_content": "At this point I would actually be quite happy if this subreddit banned all leaks and rumours that didn't actually specify the name of the topic of interest Getting very fed up of the, \"I know things 👀👀 can't tell you though 👀👀👀\" posts",
                "author": "MrEpicFerret"
            },
            {
                "raw_content": "\"there will be one big third party game on switch 2 but i wont tell you anything haha\" Dude is literally saying nothing and baiting engagements",
                "author": "junttiana"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dusk Golem: “There’s definitely at least one DLC for RE9 in-development right now, I’ve heard about it a few times, believe it stars Alyssa”",
        "score": 29,
        "text_content": "https://xcancel.com/aestheticgamer1/status/1991047135551500624?s=46",
        "comments": [
            {
                "raw_content": "#DuskGolem is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Not now Dusk. This is Half Life season",
                "author": "paintp_"
            },
            {
                "raw_content": "How long before he starts saying Leon isn't actually in the game anymore and he got moved into the DLC",
                "author": "Penwingss"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The previous PlayStation leadership was reportedly indifferent to the market shrinking in Japan",
        "score": 414,
        "text_content": "According to the report made by TV Tokyo, prior leadership within the company had developed the sentiment that “it is acceptable if the PlayStation market in Japan continues to shrink.” The decision to sell a Japan-only PS5 model began when Sony executives saw that Nintendo was preparing a Japan-only Switch 2. They decided \"we should do the same\", and the price cut was approved in only four months. the new president Nishino, feels a strong sense of crisis about the decline of the PlayStation brand in Japan, this sense of urgency shared by Nishino and the Japanese team helped push forward the Japan-focused measures. Source: https://txbiz.tv-tokyo.co.jp/original2/vod/post_329817 English Source: https://twistedvoxel.com/sony-was-indifferent-to-playstation-market-shrinking-in-japan-under-prior-leadership/",
        "comments": [
            {
                "raw_content": "I wouldn't be surprised if one of the reasons why the PS handheld exists is to get some of the market share back in Japan.",
                "author": "oilfloatsinwater"
            },
            {
                "raw_content": "Makes sense. The latest State of Play kind of came across as a desperate plea to market the PS5 more favorably in Japan. That said, I think it is positive news that they are taking Japan seriously again. I hope it means they are developing titles that appeal to the region. For example, I know Astro Bot made headlines for featuring an Ape Escape level, and Sony has previously stated they want to expand in the family game space. As for that handheld, it’ll need to be priced aggressively to compete with the Switch 2, so I’m curious to see how that turns out. If it delivers on all the rumored features, I could see it becoming a potential hit.",
                "author": "Ok_Hospital4928"
            },
            {
                "raw_content": "If that's the case then I like Nishino leading the brand.",
                "author": "UntamedRonin"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VKD3D-Proton 3.0 brings AMD FSR4 to Proton, with an experimental support for older GPUs",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Linux has never been more appealing than now",
                "author": "Creeper4wwMann"
            },
            {
                "raw_content": "awesome",
                "author": "Mercennarius"
            },
            {
                "raw_content": "Valve will port FSR 4 to RDNA 3 and 2 (Deck and Machine) before AMD does.",
                "author": "stinky_sock123"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD to present FSR Redstone on December 10th, only for Radeon RX 9000",
        "score": 366,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here I am stuck with a 7900 XT until next gen of GPUs",
                "author": "Aheg0d"
            },
            {
                "raw_content": "While still performant, RDNA 3 has maybe aged the worst as far as feature sets go lol. RDNA 2 being able to run fsr4 is impressive, and slightly less impressive, but more mindboggling is why it isn't supported on Navi 3X",
                "author": "a_zoojoo"
            },
            {
                "raw_content": "\"Only for Radeon RX 9000\" https://i.redd.it/mpvgahcf532g1.gif",
                "author": "RedRoses711"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Super X gaming tablet to feature AMD MAX+395 APU, 128GB RAM and liquid cooling",
        "score": 106,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's really getting tiring seeing EVERYTHING BUT LAPTOPS announced with these chips.",
                "author": "Agentfish36"
            },
            {
                "raw_content": "128GB RAM with these prices ? This tablet is gonna cost 5999$",
                "author": "Mexetudo"
            },
            {
                "raw_content": "Omfg... I don't get the target audience here. If I'm that into gaming, I'm unlikely to want a fricken tablet form factor, Jesus. Give us some decent >14\" laptops FFS.",
                "author": "Soggy-Camera1270"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9060 non-XT has been tested, 13-14% slower than RX 9060 XT 8GB",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "28 CUs instead of 32. 12.5% less GPU, so understandably about that much slower.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "[Here's the original video](https://www.youtube.com/watch?v=XafOubcjLdU) instead of a VideoCardz article regurgitating said video.",
                "author": "InevitableSherbert36"
            },
            {
                "raw_content": "might be decent if they ever sell this stand-alone (unless I misunderstood the vid and they are selling this separately from prebuilts) at 10-20% off the price of the XT. Cheapest way to get dedicated FSR4 hardware.",
                "author": "AroundThe_World"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9060 Review, Gaming Benchmarks 1080p & 1440p",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly im into it as long as pricing is good, for 250 its a good budget card though id like to see it for less as a 9060xt 8gb can be had for 275atm. 220 would be amazing and would help bring people into gaming for a much cheaper price, theyd have access to fsr4 too. Itd drive down b580 pricing also. Rising tide lifts all boats situation",
                "author": "PollShark_"
            },
            {
                "raw_content": "Actually impressive for the price",
                "author": "Zealousideal_Side987"
            },
            {
                "raw_content": "5050 is a better card in my opinion",
                "author": "Jazzlike-Ad-8023"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches Pro WS 850M-ACE SE board supporting both AMD Ryzen 9000 and EPYC 4004 AM5 CPUs at $359",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally another MB option that has a BMC",
                "author": "Slasher1738"
            },
            {
                "raw_content": "I own an Asus WS board- the c246 WS ace pro. It’s so awesome. 8/8/4/4/1/1 PCIE from a 20 lane cpu, amazing amounts of stability, expandability, configurability. As it aged it has become my big beautiful overkill NAS board. Runs 24/7 for years in end.",
                "author": "jhenryscott"
            },
            {
                "raw_content": "It's already on my shelf waiting to replace my main PC, waiting for my GPU thermal pads replacements to arrive. And I just figured 2 days ago it lacked M.2 E key for my WiFi+BT module. Not a big deal as I'm already wired.",
                "author": "Xajel"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD launches AMDGaming community hub for PC, console and handheld gamers",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why are companies putting out crap that no one wants..",
                "author": "_Gobulcoque"
            },
            {
                "raw_content": "THIS. IS RADEON. DOT COM",
                "author": "jhenryscott"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The U.S. Housing Market Is Stuck, With Sales and Listings Barely Budging",
        "score": 353,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People who are trying to sell a desirable, correctly priced home are having success. Most of the homes just sitting are undesirable and/or overpriced. This market is discerning and that is healthy.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "And it’ll stay stuck until home sellers lower their prices to reasonable prices. Nobody wants to become a bagholder, with rising carrying costs, worsening economic prospects, in order to fund someone else's retirement bailout.",
                "author": "McFatty7"
            },
            {
                "raw_content": "There’s a 1400 sqft home listed for 750k near me, it’s worth it because its ’charming’ and in an area of historic interest. Oh and they added pavers, that alone is 100k to the value. The other 1400 sqft homes in areas without minor historic interest are reasonably listed for 350k. I just don’t understand why they’re not selling. I toured a home listed at 365 for ~1500 sqft and a nice yard, the agent said that it really was worth 390k but they needed to sell it super fast. The thing was a time capsule from the 60’s. Things are pretty silly at the moment. Really really silly. Our median income around here is 38,000.",
                "author": "poorat8686"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Tampa becomes foreclosure epicenter as Florida tops nation in housing distress",
        "score": 29,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Florida is always the bellwether when it comes to real estate. Let’s see if the trend continues throughout the rest of the nation.",
                "author": "Few-Lawyer3707"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Goldman Sachs: Over 1.1 Million Layoffs in 2025 Push 15% of ‘Unemployed’ into Gig Work on Uber, DoorDash, and Instacart",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And the gig work/part-time jobs inflate the job numbers. The problem isn't the lack of jobs, but the elimination of white collar jobs.",
                "author": "beardko"
            },
            {
                "raw_content": "Glut of Uber and Doordash workers.. When do prices go down due to the cheap labor? 🤔",
                "author": "rentvent"
            },
            {
                "raw_content": "Can confirm. I used to drive for DoorDash and now every single restaurant I go to has new dashers on the regular. That’s a race to the floor for their pay by the way .",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Remember when we were told August 2022 wasn't the peak?",
        "score": 163,
        "text_content": "There's a whole sub dedicated to pretending we aren't on a major downswing right now. Reality is market after market is going red. Only ones that are holding out are places where building new supply is illegal.",
        "comments": [
            {
                "raw_content": "This table only contains 10 or so states",
                "author": "Cautious_Midnight_67"
            },
            {
                "raw_content": "I’m sure that three of the top four being hit by a major hurricane at almost exactly their peak has nothing to do with their places on the list 😑",
                "author": "np8790"
            },
            {
                "raw_content": "Now sort ascending and post that.",
                "author": "NostrilLube"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home value declines spread, but losses since last sale are rare",
        "score": 93,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“But these “losses” are not realized until a homeowner sells their home.” Perfect example of why you buy when you’re in a stable situation and can comfortably afford it, obviously life can happen though. Just like stocks going down, you don’t lose money until you sell.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "If you live near a major metro, buy for the best central location you can afford and you’ll probably be fine. But if that best location is out in the burbs, or anywhere near a lot of new construction, then think twice about buying at all unless you know you can stay put for 5+ years.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Losses since the last sale will increase gradually",
                "author": "gk_instakilogram"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Depot cuts earnings outlook as home improvement demand falls short of expectations",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, I thought I was the solo guy that was supporting home Depot with the thousands I spend every week on shit to fix this goddamned house.",
                "author": "Moobygriller"
            },
            {
                "raw_content": "The canary in the coal mine just wheezed.",
                "author": "PorgCT"
            },
            {
                "raw_content": "Ain't no jobs, what do these companies expect?",
                "author": "Lead_resource"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Rose 0.3% in October",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To what? A bazillion dollars? None of the math works anyway. Go nuts boomers.",
                "author": "Skilletmasterx"
            },
            {
                "raw_content": "So its still going up",
                "author": "Best_Dream_4689"
            },
            {
                "raw_content": "* U.S. home prices rose 0.3% from a month earlier in October on a seasonally adjusted basis. * Home prices increased 2.9% year over year, down from 3.1% in September and the slowest growth since 2012. * Prices fell in 14 of the 50 most populous U.S. metros, down from 37 metros posting drops in July. The biggest declines were in Fort Lauderdale, FL (-1.4%) and Philadelphia (-0.6%). U.S. home prices climbed 0.3% month over month in October on a seasonally adjusted basis, following a 0.2% gain in September. Prices rose 2.9% from a year earlier, ticking down from September’s 3.1% year-over-year increase and continuing the gradual slowdown from earlier in the year, when prices were rising more than 5% annually. This is according to the Redfin Home Price Index (RHPI), which uses the repeat-sales pricing method to calculate seasonally adjusted changes in single-family home prices. The RHPI measures how sale prices of homes have changed since their previous sale, similar to the S&P Cotality Case-Shiller Home Price Indices, but is reported about a month earlier. October data covers the three months ending October 31, 2025. Read the full RHPI methodology here. Home price growth slowed earlier this year because active listings were rising considerably, giving buyers more options and power to negotiate. Inventory growth has slowed in recent months, however, which has in turn helped push prices slightly higher. “Home prices are ticking up as the market continues to move sideways,” said Redfin Head of Economics Research Chen Zhao. “With demand still historically low, the slowdown in fresh supply and the shortage of buyers are largely offsetting each other. Fewer metros are seeing month-to-month price declines than they were over the summer, but that doesn’t signal a pickup in demand. Sales are still slow, and many buyers who don’t need to move are staying on the sidelines. The sellers who are listing now often need to move, but it’s hard to attract buyers in a market where affordability is stretched and uncertainty remains high.” Home prices falling in fewer metros than earlier in the year Home prices fell in 14 of the 50 most populous U.S. metros on a seasonally adjusted basis in October, down from 20 in September and 30 in August. That marks the third straight month in which fewer metros posted declines. The share of metros with falling prices has swung sharply in recent years as borrowing costs and buyer demand have shifted. Virtually no metros saw declines in 2020 or 2021, when low mortgage rates fueled record-breaking competition. The trend reversed in mid-2022 as rates surged, with nearly four in five metros recording monthly price drops by September of that year. The market steadied through 2023, only to see another soft patch in mid-2025, when a surge in inventory led to 37 metros posting declines in July. Home prices fell the most in October month over month in Fort Lauderdale (-1%), Philadelphia (-0.6%) and Dallas (-0.3%), while prices climbed most in San Francisco (+1.7%), Chicago (+1.4%), and West Palm Beach, FL (+1.1%). Cleveland (+10.1%), Chicago (+9.8%), and Milwaukee (+9.4%) posted the largest year-over-year gains, while Tampa, FL (-3.6%), Austin (-3.4%), and Dallas (-2.4%) recorded the biggest declines.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Google is likely to win the AI race",
        "score": 705,
        "text_content": "Google is likely to win the AI race. And it is not even due to high benchmarks of Gemini 3.0 Pro which is the best model right now. Google is the only major lab which tries to progress towards actual AI rather than just scale up the LLM architecture. Google is going after vision/language/action models. Gemini 3.0 Pro has vision capabilities far superior to any other LLM right now (e.g., see https://dubesor.de/visionbench). Gemini + Genie + Sima combination has a potential to advance towards AI which actually understands physical world, can match it to language it uses to think, and can take meaningful action in such physical world. Model which achieves these three can be finally called \"AI\" as such capabilities prove that it truly understands reality rather than merely generates plausibly-looking language, and is thus truly intelligent. I do not see any other lab doing any such work.",
        "comments": [
            {
                "raw_content": "I always look at it like: OAI is a great product company pretending to be a research company, and Deepmind is a great research company pretending to be a product company.",
                "author": "Interesting-Let4192"
            },
            {
                "raw_content": "Gemini just helped me fix a very complicated UI issue in a react-native app where a bottom sheet position was being globally shared via context to a few other elements that track its position and position themselves accordingly. Claude & GPT had no fucking clue what was going on and kept trying to just add padding everywhere. Gemini immediately understood how the system worked and all the relevant code-points and then identified the root cause of the issue instead of just trying to patch it immediately. Its suggestion wasn't in line with what I wanted (it wanted to remove something I needed to maintain) but I told it this and it came up with another more satisfying solution. It's a bit slow because it thinks a lot - but I am incredibly impressed.",
                "author": "CedarSageAndSilicone"
            },
            {
                "raw_content": "Google will 'win' only in the sense that they're already a large corporation and thus won't go bankrupt even if AI doesn't turn a profit.",
                "author": "MasterDisillusioned"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "So \"we hit a wall people\" .... isn't looking good",
        "score": 1390,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Average human baseline is 60%, so just one more gridline up top ...",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "there is just no way to compete with Google. they have access to the most data out of anyone, and data is as important as model architecture, if not more. and if that's not enough, they have infinite compute resources (and proprietary TPUs, which aren't available for public purchase). it's gg for everyone else.",
                "author": "The_Rational_Gooner"
            },
            {
                "raw_content": "wdym, its approaching that wall on the top really fast",
                "author": "wi_2"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Deep Think benchmarks",
        "score": 1169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "45.1% on arc-agi2 is pretty crazy",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "Look at the full graph 😮 https://preview.redd.it/pgborctrk12g1.png?width=1059&format=png&auto=webp&s=f025c723cf7eb9e5df054ee7eaaf3e8171eca1da",
                "author": "raysar"
            },
            {
                "raw_content": "From 4.9% to 45.1% . Unbelievable jump",
                "author": "CengaverOfTroy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "From the developer experience lead at Deepmind",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna guess nanao bana 2, Genie 3, and maybe next veo? Although I would be very surprised with veo 4 this week. But I imagine Google will pepper the week with announcements",
                "author": "TFenrir"
            },
            {
                "raw_content": "DeepMind = GigaChad",
                "author": "Formal_Context_9774"
            },
            {
                "raw_content": "Ja they are releasing Genini 4 tomorrow. God bless thank you google I can't wait.",
                "author": "x0y0z0"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 Pro gets 76.4% on SimpleBench",
        "score": 481,
        "text_content": "That's the biggest jump we've seen in a while. GPT-5 barely moved the needle why does google cook so hard? Edit: For the doubters, the main site has been updated -> [https://simple-bench.com/](https://simple-bench.com/)",
        "comments": [
            {
                "raw_content": "The human baseline is only 83.7%. This was the one I was looking forward to.",
                "author": "LukeThe55"
            },
            {
                "raw_content": "[https://simple-bench.com/](https://simple-bench.com/) The site is now updated as well. Just 7.3% left. Now I wonder what Gemini 3 Deepthink would score.",
                "author": "Profanion"
            },
            {
                "raw_content": "We should get a new AI explained soon going over the results, hopefully.",
                "author": "Ancient_Bear_2881"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.0 Pro benchmark results",
        "score": 2296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some of these numbers are insane (Arc AGI, ScreenSpot)",
                "author": "rag_n_roll"
            },
            {
                "raw_content": "Man I was happy with GPT 5.1 and all that improvement and was expecting for gemini 3 to be the same. This is fucking incredible, what a conclusion to the year.",
                "author": "UstavniZakon"
            },
            {
                "raw_content": "No way this is real, ARC AGI - 2 at 31%?!",
                "author": "user0069420"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Why pick a stupid long name like Google Antigravity?\" .. \"Oh.\"",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://xkcd.com/353/](https://xkcd.com/353/)",
                "author": "IReportLuddites"
            },
            {
                "raw_content": "this is just like disney frozen",
                "author": "send-moobs-pls"
            },
            {
                "raw_content": "I saw someone say they shoulda just called it Google Gravity and now i cant unthink it. its not an entirely better name, but it sure rolls better than what they chose.",
                "author": "Mr_Hyper_Focus"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3 solved IPhO problem I gave it",
        "score": 240,
        "text_content": "So, there's this rolling hexagon problem from the International Physics Olympiad. I described the problem using completely different wording and it managed to solve it. Either it memorized the solution and realized it was the same problem or it actually just used it's intelligence to just solve it. Either way, this was my personal AGI test since GPT 4 released. I am feeling the AGI, pretty close. The problem is IPhO 1998 problem 1, rolling hexagon. I'm a IPhO silver medalist just to tell you my qualifications.",
        "comments": [
            {
                "raw_content": "I asked it to check an undergraduate level quantum physics paper written by hand that was 4 pages long. The hand-writing was also not very good. Not only did it fully read and understand everything it also pointed out a mistake in the maths.",
                "author": "The_proton_life"
            },
            {
                "raw_content": "I also asked it questions 4.1/2 on the Theoretical paper of the International Chemistry Olympiad 2023 with the prompt \"Identify elements E\\^1, E\\^2, E\\^3, and E\\^4 in the three species 1, \\[2\\]\\^–, and \\[3\\]\\^– in the attached first image. Then, also choose which elements E\\^5/E\\^6 and E\\^7/E\\^8, respectively, would display the given molecular geometry, including E-F bond distances close to those in 1 (see table 1) in the second image.\" 2.5 Deep Think failed this, but Gemini 3 Pro aced it first try [https://gemini.google.com/share/ed54cf13cc6a](https://gemini.google.com/share/ed54cf13cc6a) https://preview.redd.it/1pxu8g66o32g1.png?width=988&format=png&auto=webp&s=2250f7c7e2830864e35307105103b3249295a4a8",
                "author": "KStarGamer_"
            },
            {
                "raw_content": "have you guys tried asking it real questions like curing CANCER ?",
                "author": "SatisfactionLow1358"
            }
        ],
        "subreddit": "singularity"
    }
]