[
    {
        "post_name": "The DSA now has 250+ elected officials nationwide, including Zohran Mamdani ... If you spend all day warning that Trump is compromised by Russia but ignore concerns about DSA ties to regimes like Cuba, China, or Venezuela, you’re not defending democracy, you’re playing favorites",
        "score": 376,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We need to reanimate Joe McCarthy.",
                "author": "stormdraintrooper"
            },
            {
                "raw_content": "Except it is happening in all Western Countries. Not just the United States.",
                "author": "Roadcruiser2"
            },
            {
                "raw_content": "A local DSA chapter \"advertises\" where they meet. Sadly it's a local Eagles club which I had always assumed to be a conservative organization. But they refuse to do anything. \"Free speech\".",
                "author": "Lower"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is scary and serious. FBI, Metro Police find more than 1,000 samples at alleged illegal bio lab. Metro confirmed the house was owned by the same individual, Jia Bei Zhu, connected to a prior investigation of the alleged illegal biological lab in Reedley, California, in 2023.",
        "score": 351,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is he still here, after the first incident??",
                "author": "Awan-CIA-Car-Lot"
            },
            {
                "raw_content": "China is not our friend.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "LOL well evidently not that scary for the judge presiding over the case: >Judge releases man connected to ‘bio lab’ found inside Las Vegas home https://www.fox5vegas.com/2026/02/06/judge-releases-man-connected-bio-lab-found-inside-las-vegas-home/ Judges don't care about bio-terror!",
                "author": "Bythrfruitsyknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Days before the FBI’s raid of Fulton County’s election facility to seize 700+ boxes, the former head of the Atlanta FBI warned election officials about the raid and explained what they were looking for. As a result, only 656 boxes were found. What happened to the missing 44+ boxes?",
        "score": 369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so sick of this crap. The FBI has been compromised from day 1. They need to use the military.",
                "author": "SevenThunders"
            },
            {
                "raw_content": "And he was arrested right, right?!?!",
                "author": "KamamblaToe"
            },
            {
                "raw_content": "That \"former head of the Atlanta FBI\" is named Paul Brown. He tipped off Fulton County on what specifically was going to be seized, so they had time to start destroying evidence. That isn't just obstruction: That's being a material accomplice in fraud. Here's my problem: He hasn't been arrested. And he won't be. Because everyone here is a bunch of weak spineless armchair quarterbacks that won't call their Representatives or Senators or state representatives or senators. Seriously, you who's reading this, ask yourself before you start going NYUHHH REEEE and throw downvotes: *When is the last time you called a politician, or even sent them a letter, about jack shit?* I'll for one say that I have only sent two certified letters, both were received and unresponded to, and I am personally ashamed I havent done more and will try to do better as a citizen. Have you? I seriously doubt it. And that's why Paul Brown felt comfortable doing what he did, and why he's sitting with a shit eating grin right now.",
                "author": "heightnoise"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fernando Baquera Ochoa, who is a DACA recipient, is a teacher at US Grant High School in Oklahoma City Public Schools. He spends his spare time doxxing ICE’s live locations to help criminal illegals hide and evade ICE.",
        "score": 335,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tell us you want to be deported without telling us you want to be",
                "author": "cherbui"
            },
            {
                "raw_content": "Looks like a diddler",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Deport this motherfucker and his entire fucking family and all his friends too.",
                "author": "IAmDisappoint"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Files confirm Donald Trump BLEW THE WHISTLE on Jeffrey Epstein's disgusting activities in a 2006 phone call with the police. \"TRUMP was one of the very first people to call\"",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They will keep lying. We must keep repeating this.",
                "author": "Skogin"
            },
            {
                "raw_content": "Watch democrats call him a snitch. 🍿🍿🍿",
                "author": "OPsMom"
            },
            {
                "raw_content": "Link https://x.com/EricLDaugh/status/2021039707984101393?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT'S GETTING WORSE FOR ILHAN: Fox News is doing their own investigation into the sudden wealth accumulated after she got into Congress: \"I was doing a bit of research into Tim Mynett, Ilhan Omar's husband's various businesses, and his investment firm, it has no known clients\"",
        "score": 1158,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, no shit. We're just waiting on those mythical arrests. But, I fear I will see a unicorn prance through my yard before this bitch gets deported.",
                "author": "45fan"
            },
            {
                "raw_content": "Why are only civilians investigating things? Defund the FBI.",
                "author": "CovfefeVideo"
            },
            {
                "raw_content": "lmao. An \"investigation\" of a criminal without consequences is like witnessing your fucking another man and then doing nothing. We have two choices: conservatives either pull out the chair and sit in the corner or grab your guns and line 'em up.",
                "author": "Trumpwon306"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security : This entire story is a lie. We provide COMPREHENSIVE medical care from the moment an alien enters ICE custody. This includes medical, dental, and mental health intake screening within 12 hours of arriving at each detention facility, a full health assessment within 14 days, and",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't care if they're stored outside with a barrel fire to keep warm. Send them all back.",
                "author": "Mudbutt"
            },
            {
                "raw_content": "This entire story is a lie. We provide COMPREHENSIVE medical care from the moment an alien enters ICE custody. This includes medical, dental, and mental health intake screening within 12 hours of arriving at each detention facility, a full health assessment within 14 days, and access to medical appointments and 24-hour emergency care. Candidly, this is the best healthcare many aliens have received in their entire lives. On December 9, 2025, ICE took Kheilin Valero Marcano, Stiven Arrieta Prieto, and their daughter Amalia Arrieta-Valero into custody, and they were detained at the Dilley Facility that is retrofitted for families. During their time in detention, Amalia Arrieta-Valero became ill with a respiratory illness. She IMMEDIATELY received proper medical care and was admitted to the Methodist Children’s Hospital in San Antonio, Texas for treatment. She remained in the hospital for eight days before being cleared for release by a pediatric doctor and returned to the Dilley facility — where she was in the medical unit and received proper treatment and prescribed medicines. Being in detention is a choice. We encourage all parents to take control of their departure with the CBP Home App to receive $2,600 and a free flight to self-deport.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "Why do they get all that but I don't even get that and I have paid literally hundreds of thousands in taxes.",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Homeland Security@DHSgov Horrendous crimes such as the distribution of child pornography, drug trafficking, burglary, fraud, human smuggling, even being in a gang like MS13 or Tren de Aragua or being a known or suspected terrorist are considered “non-violent crimes” by the media.",
        "score": 707,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t care if they have a violent criminal record. Yes, even the sweet abuelita that has been here illegally for 40 years. She has to go back. ¡Adios, muchacha!",
                "author": "m0ntsta"
            },
            {
                "raw_content": "Soooooooooo yeah fuck Israel",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "That’s a demon",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Attorney General Ken Paxton : BREAKING: I'm announcing an investigation into a potentially illegal \"sharia city\" development in Kaufman County. While you’re on American soil, you will obey America’s laws.",
        "score": 543,
        "text_content": "",
        "comments": [
            {
                "raw_content": "get them off Texan soil. Martha’s Vineyard could use some Sharia",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Why not raid it like Waco?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Where are the deportations Trump?",
                "author": "MemeLawd"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If there were ever an argument against “dual citizenship,” here it is. There is no such thing as being “half American.” You are either American or you’re not.",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "he didn't pee that - come on",
                "author": "Crazyteeth"
            },
            {
                "raw_content": "Faggot used AI, something otherwise the dumb shits will gnash their teeth at 😂",
                "author": "HieronymusRekt"
            },
            {
                "raw_content": "AI slop",
                "author": "Ligersrule1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bad Bunny show was so awful, Democrats resorted to fake news about 5 year old boy.",
        "score": 840,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"meet me backstage after the show\" probably is what Bunny said",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "I noseticed there are countless fake bot posts on reddit pimpin up bad Benny's halftime performance...",
                "author": "HillaryRodhamCunton"
            },
            {
                "raw_content": "THE BOY IN THE SHOW WAS A CHILD ACTOR.. LOOK IT UP. NOT THE KID THAT ICE TOOK OUT OF THE -10 DEGREE WEATHER WHEN PAPA DITCHED HIM!",
                "author": "equiv222"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Call your representatives and tell them to pass the SAVE Act NOW!",
        "score": 769,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Really don’t understand why they don’t just call it the Require ID to Vote Act. Make democrats vote no on that instead of voting no on the vague “save America” act which they will easily just misportray as them standing against Trumpian fascism",
                "author": "ModsAreSchmucks"
            },
            {
                "raw_content": "Majority Leader Thune: https://www.thune.senate.gov/public/index.cfm/contact (his phone number is on the thankyou page after you send your message, so call his office too) Acting Majority Leader Schumer: https://www.schumer.senate.gov/contact/message-chuck u/RuprechtThaMonkeyBoy Special thanks: u/LostElf, https://scored.co/c/TheDonald/p/1ASFcqOWsX/dont-forget/c Edit: Alt Link: https://xcancel.com/RepGregSteube/status/2021012150043521057?s=20",
                "author": "TrancePhreak"
            },
            {
                "raw_content": "Been saying this for months Call email and keep it up. They won't do crap unless enough of us make noise about it",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When are we’re going to start suing Netflix? - You know there will be an adaptation that looks just like this one day… Are we really going to let them keep doing this? They’re evil bad actors and they must be put down legally and morally.",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, they already made a show about a violent black rapist and in the \"adaptation\" of the story made the attacker a White teenager",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "They've been doing this way before Netflix. \"A time to kill\" was based on a true story but the author switched the races.. lol",
                "author": "mty_green_go"
            },
            {
                "raw_content": "If Netflix isn't stopped and wins the bidding war for Warner Bros they'll own: - Adult Swim - Cartoon Network - Cinemax - DC Comics - Dirty Harry (franchise) - Final Destination (franchise) - Hanna-Barbera Cartoons, Inc. - HBO/HBO Max - Lethal Weapon (franchise) - Looney Tunes - Mad Max (franchise) - Ocean's (franchise) - Police Academy (franchise) - Turner Classic Movies I wonder if Elon will step in, and make an offer (so massive) Warner Bros can't refuse. He's vowed to end the woke mind virus, if Netflix owns these ip's, they'll wokeify every single one of them. Netflix also excluded CNN from the deal, not even woke Netflix wants it. Elon should buy it for a bargain, walk into CNN HQ with a sink, and fire everyone except Scott Jennings.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daeja Baker, a school board member for Shaler Area School District in PA, is begging for money so she can go to Cuba to learn \"progressive\" ways to address \"LGBTQ rights and education.\" (send her to Africa)",
        "score": 790,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where the fuck is my checkbook. This shits important.",
                "author": "brutustyberius"
            },
            {
                "raw_content": "I'll donate. She just can't come back.",
                "author": "lustmorden"
            },
            {
                "raw_content": "what the fuck is that? When you're so fat and ugly your fat fold around your mouth makes it look like you have a mustache.",
                "author": "Bythrfruitsyknow"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal Judge Blocks California Effort to Demask ICE Agents",
        "score": 916,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get wrecked commies.",
                "author": "nakedjay"
            },
            {
                "raw_content": "Normally, federal agents are the biggest faggots and shouldn’t be allowed to wear masks, but these ICE agents have no choice when them and their families are threatened.",
                "author": "Donger-Lord"
            },
            {
                "raw_content": "I have a bag of my dog's shit we can leave on Gavin's desk if anyone would like to pick it up.",
                "author": "CaptainWinston"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tulsi Gabbard did not violate the law",
        "score": 875,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their attempt to impeach has failed before even getting started.",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "https://x.com/ODNIgov/status/2020887807321919789?s=20",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "She may not have violated federal law but Tulsi did violate Sharia law! She inspires lust in my heart! No burka, even! Although I can't hold her directly responsible as I have a soft spot for hot Hawaiian surfer chicks and strong women who demolish Kamal Harris in a debate as Tulsi did.",
                "author": "jerrymesa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Kid Rock’s rendition of “‘Til You Can’t” with his added verse about giving your life to Jesus has SURPASSED Bad Bunny on the charts. It’s now at NUMBER ONE, post-Super Bowl. WE ARE WINNING! 🔥🇺🇸",
        "score": 1682,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Bunny thing was forgettable as was the Super Bowl. A lost Sunday if there ever was on.",
                "author": "Bullet3250"
            },
            {
                "raw_content": "retarditt coping hard by saying the Kid Rock performance was bad and Fag Bunny was \"groundbreaking\" and \"empowering\"",
                "author": "blueeyephoto"
            },
            {
                "raw_content": "Only people who ever cared about Bad Bunny: - Ricans - friends of Ricans who want to \"fit in\" and/or \"not look racist\"/virtue signal - people who found out who he is and listen to him out of spite to \"own the MAGAs\" No one else ever knew who the fuck he was",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She certainly has a way with words.... LOL!",
        "score": 1229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“Look at me. I’m the launcher of a thousand ships now.”",
                "author": "Slugbert"
            },
            {
                "raw_content": "Hell-nah of Troy",
                "author": "SkullLeader1"
            },
            {
                "raw_content": "Nobody is going to war for an ugly bald headed black bitch.",
                "author": "AstroBenny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Daeja reached her fundraising goals and is now training in Cuba",
        "score": 623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LONG PIG",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Looks like the Cubans are gonna have steak tonight :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Wrong end",
                "author": "WhoMeTwo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nancy Pelosi’s Net Worth vs. Her Salary. This is absolutely INSANE!",
        "score": 399,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put her in prison",
                "author": "Jnicolet4431"
            },
            {
                "raw_content": "Here I am scalping pennies on the dollar day trading. Pelosi is really good for long holds. That old bitch has diamond hands. It's almost like she knows a stock won't shit itself.",
                "author": "Giant_Schwartz"
            },
            {
                "raw_content": "Crime pays",
                "author": "RegisteredDem4Trump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Taiwan rejects possibility of transferring 40% of the island's semiconductor capacity to U.S. — production on Taiwan expected to increase in lockstep with increases in U.S.-based production",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Demand to bring back domestic production grows every year. Crpto, COVID, AI, TSMC price hikes, looming Taiwan war. I am willing to bet Intel gets another check cut to help them expand further if TSMC refuses to bring more leading edge production over. The whole mismanagement of the CHIPS act continues to age even worse.",
                "author": "siazdghw"
            },
            {
                "raw_content": "I kinda get why there's so much Korea-hate in Taiwan. If Samsung ever catches up with TSMC, not only is Taiwan's economy screwed, their sovereignty is at stake. But this hatred is directed at the wrong country imo. China will eventually catch up and they'll bankrupt UMC and slowly creep into TSMC's market share along with Intel, Samsung, and Japan's Rapidus + TSMC's 3nm factory Happened with the DRAM market, LCDs, and HTC already. In an ideal world the two should really be working together",
                "author": "snowfordessert"
            },
            {
                "raw_content": "Good; more production is guuder.",
                "author": "DougChristiansen"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leak suggests Apple's M5 Pro and M5 Max may be the same chip",
        "score": 110,
        "text_content": "",
        "comments": [
            {
                "raw_content": "According to the leak Apple will do chiplet GPUs, 2 chiplet GPUs for MAX, 1 for Pro. Pro has base die with stuff turned off for yields",
                "author": "DerpSenpai"
            },
            {
                "raw_content": "This is from Vadim. So it can be taken with a grain of salt",
                "author": "CalmSpinach2140"
            },
            {
                "raw_content": "This is a standard practice where different SKUs are built from the same chip to maximize yields, and even apple did this in past already disabling some cores etc, don't see anything wrong with it?",
                "author": "defcry"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "JustJosh - Lenovo Legion 7a Review – A Premium Laptop With an AMD Problem",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember MLID claiming Gorgon Point would be something like 18% faster, lol. In reality this is the laziest refresh imaginable. Just a tiny, non-consequential overclock. Still interesting to see actual benchmarks comparing it with the previous gen.",
                "author": "heylistenman"
            },
            {
                "raw_content": "where Panther Lake at",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Windows 11 vs. Ubuntu Linux Performance For Intel Core Ultra X7 Panther Lake | Phoronix",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDR: - Considerable lead in CPU performance on Linux. - ANV (Intel’s Vulkan Driver on Linux) still sucks.",
                "author": "Boxing-Enthusiast"
            },
            {
                "raw_content": "I'm all for Linux and hope to transition to Linux distros on all my home computers at some point soon but did anyone see the glaring issue with the test? Multiple times they state that this test was better in Linux than \"Windows 11 **as installed by MSI on this laptop**\". Yeah, they could quite possibly get higher performance if they had just wiped the laptop and installed windows 11 fresh. Who knows what junk MSI have installed from the factory.",
                "author": "kcajjones86"
            },
            {
                "raw_content": "As always, CPU related, linux just destroys windows with the exception of WebP related tests (3 draws and 1 win for windows). and ofcourse, GPU related, we'll have to wait for the vulkan patch for Linux to get parity or win.",
                "author": "battler624"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Snapdragon 8 Elite Gen 6 Pro to feature LPDDR6 RAM, powerful GPU, primarily for ultra-premium flagships",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is ultra-premium code word for 3000+ usd foldables? At the rate snapdragon flagships keep increasing price, the high/middle tier might be all mediatek devices.",
                "author": "upbeatchief"
            },
            {
                "raw_content": "So they are skipping N2 and going straight to N2P? Interesting. Well, that'll pave the way to hit 5 GHz on mobile. But TSMC A14 isn't expected until 2028, so the 8 Elite Gen 7 will also have to be on N2P.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "What generation are we currently on? Since they keep changing the numbers.",
                "author": "Creative_Purpose6138"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CPUs are Back: The Datacenter CPU Landscape in 2026",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let’s goo!!! More component shortages!!! Fuck yeah cant wait for the new grok model that lets me generate epsteins le epic island!",
                "author": "UnkeptSpoon5"
            },
            {
                "raw_content": "> Over the last 6 months this has changed massively. We have posted multiple reports to Core Research and the Tokenomics Model about soaring CPU demand. The primary drivers we have shown and modeled are reinforcement learning and vibe coding’s incredible demand on CPUs. lol got downvoted for basically saying the same thing few days ago. https://www.reddit.com/r/hardware/comments/1qxdrlb/intel_amd_notify_customers_in_china_of_lengthy/o3wh7oh/ AMD's Forrest Norrod basically said the same thing. But r/hardware knows better. I think there is a possibility of a CPU shortage on the horizon. It would just be the next thing after Memory, GPUs and SSDs.",
                "author": "noiserr"
            },
            {
                "raw_content": ">Despite a two-year gap with new core micro-architecture, new node, new advanced packaging and higher cost, Intel showed Clearwater Forest as being only 17% faster than Sierra Forest at the same core counts. Even worse is that this is almost iso power too (450 watts for CLF and 500 for sierra forest). > To reduce the number of mesh stops and reduce network traffic, two cores now share a common L2 cache in each DCM, (DMR) Interesting that Zen 6 and DMR both look like they will have \\~32 stops on their mesh for each tile/chiplet. >While this means Diamond Rapids has 256 cores in total, it seems only up to 192 cores will be enabled for the mainline SKUs, with higher core counts presumably reserved for off-roadmap orders due to lower yields. This sounds improbable. Having to disable 25% of the cores on each tile is insane. Surely 18A yields are not that poor.... And even if they were, what are the chances they don't just include it in their main lineup anyway and just price them incredibly high, just so they can show it off? The Sierra Forest 288C model of reserving it for hyperscalers and being non public only seems to have happened because demand for the product was *that* low. >As AMD already enjoys significantly higher performance per core than Intel (96c Turin matches 128c Granite Rapids) Don't think this is the case in general. >the performance gap between AMD Venice and Intel Diamond Rapids will widen even more in the 2026 to 2028 generation of datacenter CPUs Hard to tell IMO. In GNR vs Turin, AMD has a per-core perf advantage, and a 50% core count and node advantage with Turin Dense. For DMR vs Venice, AMD will have a node advantage across the entire lineup, but Intel may be able to close the per-core perf advantage, and AMD \"only\" has a 50% thread count advantage from HT vs the 50% core count advantage before.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] US Reportedly Mulls Tariff Exemptions for Amazon, Google, Microsoft on TSMC-Made Chips",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "make the king happy and you wont have any problem.",
                "author": "pesca_22"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "New Devices Might Scale the Memory Wall",
        "score": 20,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Mario Kart World is truly a magnificent game.",
        "score": 1437,
        "text_content": "*Mario Kart World* is truly a magnificent game. I don’t understand the people who criticize this game; I find it very representative of a next-gen title. In fact, the game is so beautiful that I spend more time stopping and taking photos of everything I see than actually racing. The immense open world turns out to be less anecdotal than what everyone says. What do you think of image 11?",
        "comments": [
            {
                "raw_content": "You can tell who actually scrolled through the images based on who’s taking this post seriously",
                "author": "WimpBeforeAnchorArms"
            },
            {
                "raw_content": "I think image 11 is wonderful because it means the game has been carefully optimized so I can nail my routes",
                "author": "overtunerfreq"
            },
            {
                "raw_content": "Its still crazy to me that they created this big beautiful world with all of these unique areas and gave you barely anything to do in it",
                "author": "Old_Management_1997"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How do you feel about dk banazna ?",
        "score": 657,
        "text_content": "I still haven't finished it, but it's a fun game with super satisfying sound effects when breaking stuff. It's kind of on the easier side, but there is some challenge from time to time",
        "comments": [
            {
                "raw_content": "Really fun and the ending was really thrilling! I've never been a Donkey Kong fan but this game sold me on him. Might get back and complete some of the things I missed.",
                "author": "moominesque"
            },
            {
                "raw_content": "Absolutely loved it. It was my game of the year last year.",
                "author": "Robbitjuice"
            },
            {
                "raw_content": "It got super repetitive, like dont get me wrong.......it's a fun game but it's not challenging by any means and i think that's where my main problem with it lies.",
                "author": "beatthedookieup"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lexar 1TB micro as express card",
        "score": 96,
        "text_content": "[https://www.costco.com/p/-/lexar-play-pro-1-tb-microsdxc-express-card/4000399472](https://www.costco.com/p/-/lexar-play-pro-1-tb-microsdxc-express-card/4000399472) Costco is currently selling the 1TB card for $150. I don’t have the Switch 2 yet, but planning on getting it when a limited edition one is released. What do you think is a fair price for a 1TB size card? Express cards are so much more costly then regular sd cards. Do you all think the availability of these will get worst and the price staying high for the next two years?",
        "comments": [
            {
                "raw_content": "It's a comparatively terrific price all things considered.",
                "author": "rgumai"
            },
            {
                "raw_content": "That’s a great price for 1TB. I paid $183 for that card back in July. Prices might get lower eventually, but I wouldn’t expect MicroSD Express to decrease at the rate MicroSD UHS-1 cards did for a variety of reasons. 1. Very few devices use SD Express compared to UHS-1 SD. 2. Flash storage prices in general has been going up recently 3. The rate of progress on SD capacity increases has slowed in recent years.",
                "author": "gaysaucemage"
            },
            {
                "raw_content": "i’m tempted to jump on this but i’d hate to end up getting a 2tb later on considering the size of these games. for my peeps that have been holding out for the 2tb, are y’all skipping this sale to keep waiting? i can see the 1tb holding me over until the 2tb is released and comes down to a good sale",
                "author": "x-twigs"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Joined the family",
        "score": 409,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Welcome!",
                "author": "ICantEvenDolt"
            },
            {
                "raw_content": "grats and welcome bro",
                "author": "Deplayzzz"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Pragmata - how many times have you played through the demo?",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just once, because I’m planning on playing the full game at some point. Usually I don’t even finish demos, just try them to see if it’s something I want to play or not then save the experience for the full thing.",
                "author": "crono333"
            },
            {
                "raw_content": "Too many. I absolutely love it.",
                "author": "LawfulnessPractical"
            },
            {
                "raw_content": "Twice in docked mode 👍",
                "author": "Western-Mammoth2340"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can’t believe how well this runs in handheld",
        "score": 361,
        "text_content": "Looks absolutely stunning",
        "comments": [
            {
                "raw_content": "It’s been so fun replaying this again in handheld, would love RDR2 on Switch 2 as well",
                "author": "polaroidicvision"
            },
            {
                "raw_content": "The good thing about being \"old\" is having played RDR on an Xbox 360, a gigantic console the size of a PC, in 2010, and now, in 2025/26, being amazed that a portable console thinner than a Nokia phone from the 2000s runs the game hundreds of times better than the Xbox 360 did, lol. It's mind-blowing, you guys have no idea! This is so cool!",
                "author": "Internal-Judgment737"
            },
            {
                "raw_content": "Brother it's a 16 year old game",
                "author": "boomerkangaroo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FF7R - Completed on PS4, again on PS5 and now doing so for a third time on SWITCH 2!",
        "score": 290,
        "text_content": "I am so impressed with how this game runs and looks on the Switch 2 - Especially in handheld mode! I know it’s 30fps but it’s stable which I honestly don’t mind! I also own a PS5 Pro and decent gaming pc but there’s something about the Switch 2 that I love and I’m not sure if anyone else understands when I say that the Switch 2 just feels more like a console than a console has felt for a very long time. I’ve not been this obsessed with a platform since the PS2!",
        "comments": [
            {
                "raw_content": "Same boat as you, beat it plenty of times on the 4 and 5 and the switch 2 amazes me in handheld. It’s don’t getting to sit back and get immersed in the story and character dynamics all while taking a shit on a flight.",
                "author": "RogersTreasure"
            },
            {
                "raw_content": "Then do it again via steam deck.",
                "author": "Ottawa_gamer"
            },
            {
                "raw_content": "Love the background to let us know you have a full setup too lol",
                "author": "Snowbunny236"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Mario Kart World vs Kirby’s Air Riders",
        "score": 14,
        "text_content": "I’m considering picking up a racing game. I loved Kirby’s air ride as a kid but World seems really cool too. What are your takes? Anyone played both?",
        "comments": [
            {
                "raw_content": "I played both. The general consensus is that Kirby is the better game however not for me. People describe it as “chaotic fun” but for me it was just chaotic, without the fun. Maybe I’m getting too old but I way prefer the slower pace of Mario. I did like the top down mode in Kirby though.",
                "author": "Remarkable-Ice6354"
            },
            {
                "raw_content": "I’ve played way more air riders than MK World. I like both, but I’m not much of a racing game player. Very little time compared to other games put into them for me",
                "author": "navidee"
            },
            {
                "raw_content": "Mario Kart is a proper kart racer. If you just want to do races online or with up to 4 people locally, MKWorld easily beats out Kirby. Kirby Air Riders is sort of an action-party-racing game. You can race, you can do mini-games, etc etc. It has more unique modes and stuff to do than MKW, and in this respect absolutely beats out MKW.",
                "author": "PieceAfraid3755"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Marvel Tokon Steam's page updated before State of Play. 20 character launch roster, single player mode, 64 player lobbies",
        "score": 512,
        "text_content": "\"Assemble your team of legendary Marvel characters in the ultimate 4v4 tag team fighter from PlayStation Studios, Arc System Works and Marvel Games. It’s time to build your dream team and break some spirits in blistering 4v4 fighting action. Choose from an expanding roster of 20 iconic Marvel characters at launch, each rendered in a bold new anime-inspired art style and members of their own unique teams of equally impressive heroes and villains. Face off against a friend locally or join the fray with up to 64 players in the online* lobby, including standard VS modes. Plus, dive deep on each team with the single player Episode Mode to learn more about team dynamics and lore.\" Source: https://store.steampowered.com/app/3787240/MARVEL_Tkon_Fighting_Souls/?snr=1_5_1100__1100&utm_source=steamwidget",
        "comments": [
            {
                "raw_content": "A roster like that was fine for Strive, I don’t think 20 characters holds up in a tag fighter, let alone a 4v4 tag fighter.",
                "author": "Ratchet2332"
            },
            {
                "raw_content": "I played the beta and it’s not really a 4v4 tag game. It’s a 1v1 game with assists. With shared health bar there is not a lot of inherent gain from tagging out. At most levels of play I think optimizing one character will go further than playing 4 to get certain character matchups. But from the perspective of it being 1v1, 20 characters at launch isn’t too bad.",
                "author": "ninjupX"
            },
            {
                "raw_content": "I don’t consider this a 4v4 truly. Even the gameplay doesn’t encourage you to switch like that It’s 1v1 with playable assists",
                "author": "Poetryisalive"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PlayStation State of Play announced for 12th February",
        "score": 1430,
        "text_content": "Source: https://xcancel.com/PlayStation/status/2020845405362163855?s=20 > Tune in for 60+ minutes of news, gameplay updates, and announcements from game studios across the globe Will feature news from first party PlayStation studios, third parties and indies https://blog.playstation.com/2026/02/09/state-of-play-returns-this-thursday-february-12/ Previous Rumour: https://old.reddit.com/r/GamingLeaksAndRumours/comments/1qyr6ar/mihir_sheth_sr_product_development_director_at/ https://old.reddit.com/r/GamingLeaksAndRumours/comments/1qne5s0/sony_state_of_play_coming_this_february_according/",
        "comments": [
            {
                "raw_content": "For reference, this is the longest showcase they have held since the 2023 PS Showcase.",
                "author": "oilfloatsinwater"
            },
            {
                "raw_content": "seems they’ve officially dropped the showcase branding",
                "author": "Olly754321"
            },
            {
                "raw_content": "Time for my bimonthly cope of MGS Master Collection 2 (I feel like there's some weight to it now because they delisted Peace Walker a week ago) and a remaster of the Lightning Saga",
                "author": "LadyValtiel"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Some new Witcher 3 DLC leaks: NateTheHate claims he's heard things about the new Witcher 3 DLC, and a former Polish journalist and a former project lead on the Witcher 1 have both heard that a new DLC is happening.",
        "score": 32,
        "text_content": "From NateTheHate: https://xcancel.com/NateTheHate2/status/2021090282050289783 From the Polish journalist and Witcher 1 project lead: This one is admittedly and older [source](https://www.youtube.com/watch?v=gqcPJeESnN8&list=LL&index=8&t=5071s), but both UV o grach (former editor-in-chief of Polish gaming site Gry-online) and Ryslaw (project lead for Witcher 1) have both heard that a new Witcher 3 DLC is coming.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "DLCs for old games is something that should happen more. Specially DLCs like The Witcher 3 ones, properly sized. I would love a Fallout 4 DLC.",
                "author": "Extreme-Purchase-512"
            },
            {
                "raw_content": "I'm craving more witcher content",
                "author": "Davve1122"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi602: A Santa Monica Studio reveal [at the SoP] \"wouldn't be super surprising\" given the current target release window",
        "score": 470,
        "text_content": "[source](https://www.resetera.com/threads/playstation-studios-ot48-has-ot48-been-hijacked-by-ot47-ot46-and-ot45-to-the-detriment-of-48-ots-of-history.1329010/post-151107211) >*\"Oh shit Cory is potentially on the menu?\"* >Shinobi: \"Wouldn't be super surprising given the target release window **(this isn't a confirmation it'll be there lol)**\" Maybe 2027/28? 🤔",
        "comments": [
            {
                "raw_content": "Rumoured GOW 2D game more likely than the next big game from Cory",
                "author": "noggs891"
            },
            {
                "raw_content": "\"Known upcoming game might get shown, it might also not.\" Great scoop, guys.",
                "author": "iiniVijuY"
            },
            {
                "raw_content": "Honestly PlayStation needs anything from their colossal FP studios, I really hope Intergalactic has a gameplay tease or more of what we can expect with the story and world",
                "author": "ballviewer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prince of Persia: The Sands of Time Remake 2021 appears on hidden place.",
        "score": 323,
        "text_content": "https://hiddenpalace.org/Prince\\_of\\_Persia:\\_The\\_Sands\\_of\\_Time\\_Remake\\_(Jan\\_9,\\_2021\\_prototype)",
        "comments": [
            {
                "raw_content": "If you're looking for more info about this: The build came from a user's hard drive. They had downloaded the build when Ubisoft enabled PS4 pre-downloading of the game by mistake for a brief amount of time, prior to the game's original release date in 2021. The user had saved the game on their external HDD, from which it was only recently recovered. The archive contains a PKG file about 13gb in size. Most of the files are encrypted. The hidden palace page contains all the files that are not encrypted, including an image which suggests the game supported remote play through the PSVita. Without the passcode, it is impossible to decrypt… …unless someone bruteforces it.",
                "author": "LiesOfLif3"
            },
            {
                "raw_content": "Maybe mention is encrypted and unplayable in the post? But it’s good that it’s “out there” at least",
                "author": "DWRedd"
            },
            {
                "raw_content": "Praying this gets cracked, it went gold before they cancelled and changed it so I'm hoping we can at least get to play this build",
                "author": "thepowahypahbomb"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "GFuel teasing something with DMC 6",
        "score": 160,
        "text_content": "https://fxtwitter.com/GFuelEnergy/status/2020875980525498820",
        "comments": [
            {
                "raw_content": "I can't believe capcom made a deal with gfuel to replace the orbs with different flavors of gfuel",
                "author": "Walnut156"
            },
            {
                "raw_content": "Gfuel S tier leaker??????????????",
                "author": "Gabrielhrd"
            },
            {
                "raw_content": "What tier is Gfuel",
                "author": "BomberBlur070"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Shinobi602 says that more starfield news, including the PS5 port, will be announced next month",
        "score": 277,
        "text_content": "source: https://www.resetera.com/threads/state-of-play-returns-this-thursday-february-12-with-60-min-show.1429804/page-7#post-151099405",
        "comments": [
            {
                "raw_content": "So don't expect it at the state of play",
                "author": "SpyroManiac36"
            },
            {
                "raw_content": "Dammit Todd, just announce the damn thing lol",
                "author": "Lord_Greedyy"
            },
            {
                "raw_content": "Why does Shinobi, who working at a studio, leaks other people work? Very odd.",
                "author": "achtungjamie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st: Pictures from Eidos-Montréal's cancelled Lord of the Rings game",
        "score": 245,
        "text_content": "[source](https://mp1st.com/news/report-cancelled-lotr-game-by-eidos-montreal-with-a-telltale-like-story-first-look) The game had a top-down view, and the setting was the city of Umbar.",
        "comments": [
            {
                "raw_content": "Leaks of cancelled games depresses me.",
                "author": "soronprfbss"
            },
            {
                "raw_content": "A LotR game cancelled, and an Eidos game cancelled. Two pains at once.",
                "author": "Trainbe"
            },
            {
                "raw_content": "![gif](giphy|OAthVeXHlBnFK)",
                "author": "SnappyDesh"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel 900-series chipset spcs leaked: B960, Z970, Z990, Q970, and W980 for Nova Lake-S",
        "score": 79,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope W980 board more readily available In my Region DDR5 UDIMM non ECC cost as much as the ECC one, so I'll just grab the ECC version",
                "author": "heickelrrx"
            },
            {
                "raw_content": "The return of Zx70? Wow.",
                "author": "realPoxu"
            },
            {
                "raw_content": "Oh thank goodness, I was terrified my current motherboard might accidentally remain compatible for a third year.",
                "author": "Korra228"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "JPMorgan's nationwide home price forecast hides a SunBelt full of pain. Watch out, Florida and Texas",
        "score": 74,
        "text_content": "Supply and demand in the housing market will combine to keep home prices flat this year as President Donald Trump’s efforts to improve affordability barely move the needle, according to JPMorgan Global Research. In a year-ahead forecast published Jan. 27, analysts said price growth will stall at 0% in 2026 after nearly doubling over the past decade, with a slight improvement in demand likely neutralizing a supply uptick. Helping buyers is an expected dip in adjustable-rate mortgages as the Federal Reserve continues to lower borrowing costs later this year, even as the 30-year fixed rate stays above 6%. On top of that, homebuilders will keep offering rate buydowns to lower mortgages to clear unsold inventory. “We think this could be enough, along with a rising wealth effect, to shift demand higher while supply increases subside,” John Sim, head of securitized products research at JPMorgan, said in the note. Read more: [https://fortune.com/2026/02/09/housing-market-outlook-forecast-home-prices-0-percent-growth-2026-trump-mortgage-rates/](https://fortune.com/2026/02/09/housing-market-outlook-forecast-home-prices-0-percent-growth-2026-trump-mortgage-rates/)",
        "comments": [
            {
                "raw_content": "The next 18 months we'll see a very large exodus of residents moving out of these states heading back to the blue states for higher wages and more opportunities",
                "author": "Fresh-Piglet2500"
            },
            {
                "raw_content": "TXFLREBubble",
                "author": "zorg-18082"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Cheap Private Loans Backfire on Rookie Home Flippers",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a garbage article, title is about flippers, first paragraph opens talking about home builders. If someone buys land, and builds a home, they're not a \"rookie home flipper\"",
                "author": "DumpingAI"
            },
            {
                "raw_content": "That title is very misleading considering the article is basically describing home builders and not flippers.",
                "author": "projektvertx"
            },
            {
                "raw_content": "Archive article - https://archive.ph/CdQcp Pereonal anecdote, there’s at least a few people using this type of loan as mortgages. So, not for flipping as described in the article, but for riding the 2020s price appreciation wave. I know someone that lost two houses from failing this. Southern California city with minimum entry price of $1m. This happened just after sales started stalling. I don’t understand how they obtained the loans, because the numbers I saw shouldn’t have qualified them for even this financing. I also don’t how these loans are considered cheap. Theirs were not.",
                "author": "everything_is_polys"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lower Rates Lift Mortgage Activity at Start of the Year",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is getting ARMs post 2008?",
                "author": "anticharlie"
            },
            {
                "raw_content": "Mortgage application activity rose sharply in January, driven primarily by a surge in refinancing activity as mortgage rates declined to a new low. The Mortgage Bankers Association’s (MBA) Market Composite Index, a measure of total mortgage application volume, increased 12.9% from December on a seasonally adjusted basis and was 61.3% higher than a year earlier. The average contract interest rate for 30-year fixed mortgages dropped 13 basis points (bps) to 6.2% following the announcement of $200 billion in mortgage-backed securities (MBS) buybacks by the GSEs. Compared with January 2025, the 30-year fixed mortgage rate was 81 bps lower. The decline in rates supported month-over-month gains in both purchase and refinance activity. Purchase applications increased 2.9%, while refinance applications surged 19.8%. Relative to January 2025, purchase activity increased 16.2%, while refinance applications jumped 143.8%. By loan type, applications for fixed-rate mortgages (FRMs) and adjustable-rate mortgages (ARMs) increased 12.9% and 7.9% month-over-month, respectively. On a year-over-year basis, FRM applications were up 57.8%, while ARM applications more than doubled, rising 113.1%. As of January 2026, ARMs accounted for an average of 7.1% of total applications on a non-seasonally adjusted basis, down 0.4 percentage points from December but 1.7 percentage points higher than a year earlier. For loan sizes, the average loan amount across the total market increased by 1.1% to $402,000. Average purchase loan sizes increased 2.5% to $435,400, while the refinance loan size increased modestly by 0.2% to $378,000. In contrast, the average ARM loan size continued to decline, falling 4.4% to $925,600.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How Mortgage Lending Inflates Home Prices Beyond Construction Costs",
        "score": 55,
        "text_content": "One aspect of the housing bubble that doesn’t get enough attention is how mortgage credit itself inflates prices. Beyond interest payments, the expansion of mortgage lending increases purchasing power without increasing housing supply, pushing prices further away from construction costs and fundamentals. This post looks at mortgages not just as personal debt, but as a systemic driver of housing inflation.",
        "comments": [
            {
                "raw_content": "Governments need to stop insuring these absurdly over valued loans so that Banks themselves wear it when they go wrong.",
                "author": "omegaphallic"
            },
            {
                "raw_content": "Definitely agree on this, there's a ton of corruption in this process too. When I bought my house during the pandemic bubble there was a bidding war and price moved up by 60k. Mortgage lender cancelled the appraisal and subbed in some person who they knew and worked with a lot and magically the house was appraised at the exact sale price. On one hand we have realtors overpricing homes to maximize their commission and lenders manipulating appraisals to increase lending and thus driving housing inflation. They have everything to gain from doing this, more interest, higher commissions, larger loan volumes. There’s no truly independent layer in the process. It’s turtles all the way down.",
                "author": "mountainlifa"
            },
            {
                "raw_content": "If this is true, then it should be easy to increase housing supply by building new homes.",
                "author": "CautiousMagazine3591"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Seedance 2.0 Generates Realistic 1v1 Basketball Against Lebron Video",
        "score": 1757,
        "text_content": "Just acouple months ago these models couldn't handle acrobatic physics. Insane. No floatiness, accurate physics, incredible body stability and contortion, realistic cloth simulation. We are COOKED!",
        "comments": [
            {
                "raw_content": "Just one flaw: All players on the field are Lebron :D",
                "author": "ecnecn"
            },
            {
                "raw_content": "This is crazy",
                "author": "D2MAH"
            },
            {
                "raw_content": "This is impressive, but is this original game film that is overlayed and edited by AI? Like to get rid of players from the original and clone lebron and the overlayed girl onto another player? If not, and it’s just generated, that’s insane Edit: OP if you could clarify where you got this from it would be nice to know",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree G1 is subjected to harsh stress and emerges from it bravely",
        "score": 1112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What would be more impressive is if they would demo it doing things I actually care about, like vacuuming, doing dishes, sweeping the floor, doing laundry, etc. I don't expect to get invaded by ninjas, so I do not care how well it can jump around.",
                "author": "eggbert74"
            },
            {
                "raw_content": "I'm not laughing now and I'm not going to be laughing when the tables turn.",
                "author": "Kl1ntr0n"
            },
            {
                "raw_content": "When ai becomes sentient, someone’s going to get a real ass kicking.",
                "author": "Lead_weight"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ai girlfriend is expensive",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expensive? Wait, until you experience a divorce.",
                "author": "Relative_Picture_786"
            },
            {
                "raw_content": "Didn't they do that in the second blade runner movie but with hologram?",
                "author": "K_Dragon77"
            },
            {
                "raw_content": "This is really inspiring… im gonna make an AI girlfriend bot that whispers “your rocket is so huge” whenever I launch a new spaceship in factorio.",
                "author": "xiaopewpew"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Seedance 2.0 can do animated fights really well",
        "score": 463,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/vtoln9d0eiig1.png?width=712&format=png&auto=webp&s=a485a08abc777d42fc7b1999a45a0fca73062f4f Impressive, but looks like things went a little sideways at the end.",
                "author": "xirzon"
            },
            {
                "raw_content": "That’s amazing",
                "author": "Ok-Association_"
            },
            {
                "raw_content": "That's dope. I wonder why we're still stuck with a 15 second limit in 2026. When will we be able to generate videos longer than five minutes? lol",
                "author": "junior600"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Looks like Kling is not the only one with Motion Transfer",
        "score": 213,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's... Actually not bad. Damn.",
                "author": "Terrible_Scar"
            },
            {
                "raw_content": "The color is better on the AI. Lol",
                "author": "Extreme-Rub-1379"
            },
            {
                "raw_content": "... these look similar to the point of one being referenced off of the other --- what's this supposed to be demonstrating?",
                "author": "IEC21"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "One of the cofounders of xAI leaves the company",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "with the merger between spacex and xai, i guess most employees will now get shares of the combined entity which should be getting listed soon. Probably expect more exits at that time. Standard for most IPO-ing companies.",
                "author": "Ska82"
            },
            {
                "raw_content": "I would too if it took 4 delays to ship a .1 update.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Not many co founders are still there",
                "author": "cloudone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "De Masi: Quantum systems will be far more energy efficient than classical AI",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alternatively, they will never be any practical use. Both are possible.",
                "author": "MrMrsPotts"
            },
            {
                "raw_content": "anything else would be absolutely unfeasible for the future",
                "author": "NiviNiyahi"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta’s Next-Generation LLM ‘Avocado’ Surpasses Top Open-Source Models in Pretraining Alone",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I remember the LLama 4 pre-release marketing hype.",
                "author": "Arcosim"
            },
            {
                "raw_content": "![gif](giphy|jH6s9HMMi53dSdI73r)",
                "author": "Tobxes2030"
            },
            {
                "raw_content": "I'll believe it when I see it",
                "author": "BITE_AU_CHOCOLAT"
            }
        ],
        "subreddit": "singularity"
    }
]