[
    {
        "post_name": "City Councilman Abu Musa (D-MI) on tape stuffing ballots in middle of the night from darkened truck (second incident).",
        "score": 455,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muslims do not belong in first world countries.",
                "author": "38WendysHamSquare79"
            },
            {
                "raw_content": "The thing that never happens happened",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "Turning MI into Somalia, one ballot at a time",
                "author": "TellMeBoutIt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The one time Scott Jennings got every liberal on CNN to shut up and listen",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whites were the first to break the cycle of slavery. Meanwhile blacks still do it.",
                "author": "LeRiverDanube"
            },
            {
                "raw_content": "My whole fucking life, all 47 years, Democrats have blamed me for the sins of our ancestors, and I am so fucking tired of it. I'm so sick of blacks using slavery as an excuse for their shitty behavior and rotten communities. I'm sick of Jews using the holocaust as a shield from criticism or to silence people who notice. I'm sick of the fucking guilt trips and emotional manipulation. At some point, we just have to let it all go and get the fuck over it.",
                "author": "WeaponizedSmirk"
            },
            {
                "raw_content": "We should have castrated them like the Arabs did.",
                "author": "MoreVanceMemes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Comparison of Texas redistricting and Illinois Gerrymandering",
        "score": 338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep a folder here labeled 'Elections' just for this sort of shit.",
                "author": "RuleoVicus"
            },
            {
                "raw_content": "Now do Massachusetts with 0% republican representation.",
                "author": "NoApologyTour"
            },
            {
                "raw_content": "I don't think you want to substract, you want to divide: TX (78.9 / 59.1) / (21.1 / 40.9) = 2.6 IL (17.6 / 47.1) / (82.4 / 52.9) = 0.24",
                "author": "JesusPay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Texas Capitol grounds are now being EVACUATED due to an ACTIVE SH00TER threat, as Democrats protest the new U.S. House Maps. More leftist terrorlsm!",
        "score": 1221,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I guess pulling the fire alarm had no effect.",
                "author": "Driveby-Viktum"
            },
            {
                "raw_content": "Be aware of the term *narcissistic rage.* That's exactly what we're seeing here. Narcissists/sociopaths of every kind rely on lies, bribes, threats and manipulation to stay in control of everyone else. But when narcs/sociopaths realize that their bullshit isn't working anymore, and the lies fall apart and people begin to see them for what they really are, they become furiously angry. That's when they start lashing out with physical violence. That's because *they don't have any other way to get people to do what they want.* And as long as they're still not getting what they want - which is to be proved right, get their power and control back, and have Trump and MAGA disappear forever - the Left will only become more and more enraged and violent and destructive. Never forget this. Be aware of your surroundings 24/7. It's almost certain to get worse before it can be stopped.",
                "author": "Cuetardian"
            },
            {
                "raw_content": "Mostly peaceful Democracy",
                "author": "Th3Cho0sing0ne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Why does Roblox encourage kids to use their real names?",
        "score": 1092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because it wants the other kids in the school district to ALSO use their real names. They want the real names of whole groups of children in various school districts. This way they can monitor their activities and segment the data analytics by geography very easily. https://create.roblox.com/docs/production/analytics https://www.statista.com/statistics/1190914/roblox-games-users-global-distribution-geography/ Then when Soros or other Leftist/Communist groups and PE cos. approach them, they'll have an impeccable dataset across time and literally space that tracks the movements and activities of millions of kids. By then they'll have fed communist propaganda to your children and they can track if the children's activities on Roblox are 'aligning' with the training. Not enough 'alignment'? Feed them more propaganda? Coming along nicely? Advance them to higher levels. https://www.takeaway-reality.com/post/roblox-demographics-statistics THEN they can have a truly massive dataset to feed an upcoming LLM to be the backend for a massive AI Communist Training Interactive Engine. They've lost Gen Z to some extent. But not the next gen of kids. Welcome to The Future :) EDIT: Also Gambling! If you lower the legal age of adulthood (Soros and Bill Gates' goal), your 14 year old can meet a Roblox adult male for sex after he tracks her/him by name and geolocation data, and be pimped out by him due to prostitution becoming legalized (Commie Zohran Mamdani will legalize it in the massive market of NYC once he becomes Mayor) and THEN she/he/they can have bets placed on her/him/them through Robux (Roblox's online currency) Sorry, again - Welcome to The Future :)",
                "author": "bleeje"
            },
            {
                "raw_content": "Only one reason. Pedos encouraging kids to dox themselves.",
                "author": "utfanx2"
            },
            {
                "raw_content": "shut that incessant bullshit down already",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Hunter Biden soars past Hillary Clinton in the 2028 Democratic Nominee odds on Polymarket.",
        "score": 1036,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Would you vote for a crackhead? Yes, but only if its Mike Lindell.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "Biden 2028? Lol",
                "author": "Cali_kid"
            },
            {
                "raw_content": "Hunter is the perfect face of today's Democrats",
                "author": "moscowjade"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bill Gates is upset because RFK Jr. stopped funding the mRNA experimental drugs. Gates was using these drugs to sterilize young people and increase cancer rates to reduce global population. \"All the progress we've made is at risk.\"",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why hasn’t he been arrested? And he really thinks his life’s work of depopulation can’t continue without government funds? Doesn’t he have a few billion in pocket money?",
                "author": "Themis595"
            },
            {
                "raw_content": "Who the fuck is there listening to this guy?!",
                "author": "Jbliss"
            },
            {
                "raw_content": "RFK needs to do something about the demons that are trying to use ticks to make everyone allergic to meat.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Poor Adam",
        "score": 880,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When can you form a PAC to fund a legal defense? I thought PACs could only be used to fundraise for the purpose of campaigning. A legal defense is not a political campaign.",
                "author": "PeregrineFalcon"
            },
            {
                "raw_content": "No USAID money? Awwww",
                "author": "Neonentity"
            },
            {
                "raw_content": "Book em' Danno!",
                "author": "Herc130"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BLACK WALLS MATTER!",
        "score": 1382,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're going to get hot as hell",
                "author": "Jalapeno_gringo"
            },
            {
                "raw_content": "\"I see my border wall and I want it painted black\"",
                "author": "bigdickhangsright"
            },
            {
                "raw_content": "bro that's the kind of shit I voted for 🤣",
                "author": "nuhbin3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Newly Released Emails Reveal Joe Biden’s Own DOJ Red-Flagged Thousands of Last-Minute Autopen Pardons",
        "score": 1319,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fakest President in history. I don’t even consider him a 46th president. Pedo did nothing but be a puppet for his overlords for 4 years while shitting his pants and eating ice cream.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "All those pardons are null and void",
                "author": "Mungo"
            },
            {
                "raw_content": "Arrests?",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Linda McMahon : The Trump Admin will no longer stand by as states & school districts flout federal law. Starting today, 5 Northern Virginia school divisions must request reimbursement for all federal ed dollars & will be classified as high risk for future federal fundin",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do all of the counties in Los Angeles. They still give seminars on white supremacy.",
                "author": "Ice_Joker"
            },
            {
                "raw_content": "Arlington, Alexandria, Fairfax County, Loudoun County, Prince Williams County. Where the DC bureaucrats live to escape DC crime.",
                "author": "Geralt_of_Rivia1"
            },
            {
                "raw_content": "Any state that’s still allowing men in women’s sports and doing this DEI, woke nonsense should be considered high risk and have to request reimbursement for all federal funding. While not directly under the purview of the dept. of education, I think we should say no free/reduced student meals for illegal immigrants",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary Sean Duffy : This cannot happen again. . @FMCSA is launching an investigation into both the driver and White Hawk Carrier.",
        "score": 1453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lawsuits inbound.",
                "author": "champdog"
            },
            {
                "raw_content": "This WILL happen again. And again. The outrage will subside, but the cause will not be dealt with. I am a long haul driver. I see accidents like this often. The American Trucker Association, along with large carriers like SWIFT, Schneider, JB Hunt, and others deliberately caused a retention problem, not a driver shortage, by bringing in foreign workers who work for slave wages. The industry is corrupt, and good drivers simply cannot compete with the firehose of incompetent drivers and companies willing to cut every corner and race to the bottom for cheap freight rates. Until the narrative of “driver shortage” stops and switches to the real problem of retention by allowing actual market rates pay companies and drivers a reasonable wage and profit, this will keep happening.",
                "author": "TexasRepublic"
            },
            {
                "raw_content": "Arrest everyone and make a loud, public example out of them. Also, double the ice funding",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Marco Rubio revokes 6,000 foreign visas.",
        "score": 1373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This needs to be more like 600,000",
                "author": "BasedJaffa"
            },
            {
                "raw_content": "This is a nice start Keep going",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Out of everyone in Trump’s cabinet, Lil’ Marco has really surprised me. I expected him to pull the kind of shit we’re seeing from Bondi.",
                "author": "wcwe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tulsi Gabbard strips the security clearances of 37 more Intelligence Community officials involved in intel report that launched Russiagate hoax.",
        "score": 1676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Strip every single one of them. Retire, leave service, ect you drop your clearance day 1. We should not let these blood sucking scum make bank on our good graces.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "It's shocking that these people get lifetime security clearance well after they leave their positions. This needs to STOP.",
                "author": "MythArcana"
            },
            {
                "raw_content": "While the corrupt retards Trump hired just announce investigations that lead nowhere, Tulsi is making things happen. Her and RFK are awesome.",
                "author": "modded"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "England has surrendered, without a single shot fired in defense.",
        "score": 1302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "idiots gave up their guns",
                "author": "SCHULTZ"
            },
            {
                "raw_content": "If the White House doesn't make a statement on this soon no attention to this will be brought. Damn shame. This country has nukes.",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Do you feel strong enough yet England? Are you sufficiently enriched?",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "25% of Gen Z murdered by \"safe and rare\" ritual killing",
        "score": 1299,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is genocide by design.",
                "author": "Deep_Croak"
            },
            {
                "raw_content": "It's time to bring back teenage pregnancies. Anyone growing up in the 90's knows what I mean. It was bigger than the war on drugs.",
                "author": "PenisDickWiener"
            },
            {
                "raw_content": "What's the race tho? At this point in time, we need start defending White people only and everyone else can continue killing themselves. Abortion clinics need to be prevalent in Hispanic and black neighborhoods on every street corner. Huge billboards. Abortion IS healthcare!",
                "author": "newuser8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump says Smithsonian is 'OUT OF CONTROL,' will be dealt with like the colleges were",
        "score": 1564,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Expel the communists. Reclaim our heritage.",
                "author": "3DogNight"
            },
            {
                "raw_content": "The Smithsonian is too valuable to just \"fire everyone\" or \"cut off their money\". Their collections are huge and the vast majority of their curators and researchers just spend their days behind the scenes preserving and documenting things. The people that need to be fired are all of their \"display managers\" and \"public coordinators\". The people actually in charge of what the public sees. The parts of the collections actually on display to the public represents about 0.001% of all they own, which means someone had to hand pick that shit to display. 99% of the people in charge of that shit are the Brendas and Karens of the world with degrees in \"Outreach\" and \"Inclusivity\"",
                "author": "PoxWalker"
            },
            {
                "raw_content": "This times a million. I went out there this year and it was full of retarded stuff",
                "author": "OkieDoker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "420,000 mail in ballots in Arizona had no matching signature. Ban mail in ballots",
        "score": 1093,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Audit 100% of machine tallies.",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "Cheating's the only way hobbs could 'win'. Just like ranked choice 'voting' did for mercowski .....",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Kari is both their Governor and Senator!",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Where all the hyper- competent white men go?",
        "score": 906,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yep. My husband just got let go. They love getting rid of competent, hardworking people.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Nailed it",
                "author": "Cville123"
            },
            {
                "raw_content": "I fall under #1 and they want me to come back to work. Screw that.",
                "author": "FusionBlack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 70 THOUSAND MONKS just NOMINATED President Trump for the NOBEL PEACE PRIZE",
        "score": 442,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump is gonna be the most nominated person to not win that award.",
                "author": "TeeBP"
            },
            {
                "raw_content": "https://x.com/JesseBWatters/status/1957969200397377638",
                "author": "Looniz74"
            },
            {
                "raw_content": "AND JUST LIKE THAT GOVERNMENT ASSISTED SUICIDE IN CANADA INCREASED 5 FOLD.",
                "author": "YouAreIgnorant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CNBC: \"Lutnick says Intel has to give government equity in return for CHIPS Act funds\"",
        "score": 307,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Intel’s rivals got free money, but Intel does not. As always absolute genius levels of national self sabotage.",
                "author": "yabn5"
            },
            {
                "raw_content": "Oh ok so it’s a shakedown",
                "author": "Salkinator"
            },
            {
                "raw_content": "Government ownership of a private company? I dunno that doesn’t sound very “free market” from the “keep government out of business” crowd.",
                "author": "ItsMeSlinky"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA cuts GeForce RTX 50 prices in Europe as EUR strengthens against US Dollar",
        "score": 538,
        "text_content": "",
        "comments": [
            {
                "raw_content": "5090 went down in the UK too, £1889 to £1799",
                "author": "horrorwood"
            },
            {
                "raw_content": "so in short, only nvidia designs get a cut. this means no cuts for 5060, 5060 ti and 5070 ti",
                "author": "JoCGame2012"
            },
            {
                "raw_content": "Come on Donald, crash the dollar.",
                "author": "kingwhocares"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "ROG Matrix GeForce RTX 5090",
        "score": 142,
        "text_content": "holy shit rog matrix 5090 can go up to 800 watt power with 12v-2x6 connector and btf, also has liquid metal interface",
        "comments": [
            {
                "raw_content": "A round end on a GPU? Feels like i've just been transported to 2007",
                "author": "Firefox72"
            },
            {
                "raw_content": "Looks like an ATI GPU",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "Now it just needs some artwork and we've reincarnated Sapphire circa 2007",
                "author": "XFX1270"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Huge WOLED Improvement! - Asus ROG Strix XG27AQWMG Review",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why do so many monitors place this hole for cable routing in their stand this low? What's the point? Let me route my cables so that they are hidden.",
                "author": "Slash_8P"
            },
            {
                "raw_content": "More display sellers should consider shipping with matte screen protectors. That way both glossy enjoyers get what they want and people who play with the sun on their eyes for some reason can choose to do so. How expensive could a banana be? $5?",
                "author": "tukatu0"
            },
            {
                "raw_content": "Whatever happened to QDEL displays from Samsung? I can't help but wonder if OLED will have caught up to the inorganic substitute by the time we actually see a product with that.",
                "author": "bubblesort33"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Financial Times: \"SoftBank held talks with Intel on buying contract chipmaking business [Intel Foundry]\"",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Intel is such a bad investment that SoftBank wants to get in on it? Dire",
                "author": "MisterScrewtape"
            },
            {
                "raw_content": "I understand that SoftBank is eager but this makes no sense as Intel's tangible assets alone are worth $100 billion.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "Here's the [archive](https://archive.is/JjFUc) to the Financial Times article.",
                "author": "Dakhil"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Get this guy a raise and his own comedy special",
        "score": 3257,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m a casual who just plays games and doesn’t really know any developers. He was hilarious - to the point that I’m actually considering getting this game.",
                "author": "arendo"
            },
            {
                "raw_content": "“Sir, a second button has hit Kirby Air Riders.” https://preview.redd.it/v6mtshjaa1kf1.jpeg?width=1164&format=pjpg&auto=webp&s=8cd7db571bb5b0119a8c0574e85b93a305b06c21",
                "author": "Gamer_T_All_Games"
            },
            {
                "raw_content": "I’m glad Nintendo seemingly gave him control over this presentation",
                "author": "YummyHallwayAllDay"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Indiana Jones coming to the Nintendo Switch 2",
        "score": 2369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well there it is, first of likely many Microsoft games on switch 2",
                "author": "North_Biscotti4162"
            },
            {
                "raw_content": "Seems like if a game can run on the Series S than it can run on the switch 2 bring it on",
                "author": "Environmental_Bus623"
            },
            {
                "raw_content": "YES OMG YES I’m so happy 😭😁 lol I’ve been wanting to play this and the only console I have is a switch 2",
                "author": "DelusionalAbyss"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just noticed that the Seattle Mariner’s have the Switch 2 as their sponsor patch.",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nintendo owned the Mariners from 1992 to 2016, and still holds a 10% stake.",
                "author": "SBAstan1962"
            },
            {
                "raw_content": "Yep, even shows up in MLB the Show on other consoles. lol",
                "author": "astrofan"
            },
            {
                "raw_content": "You used to be able to order food to your seat via a DS app at the stadium: [Nintendo Fan Network (Wikipedia)](https://en.wikipedia.org/wiki/Nintendo_Fan_Network?wprov=sfla1)",
                "author": "angusrocker22"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Listen Carefully Guys",
        "score": 1957,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They could have gone into more detail, like where are the feet?",
                "author": "Pascalini"
            },
            {
                "raw_content": "Sakurai was so funny in this direct. I've watched some of his YouTube channel before and have found him to always be a good and humorous presenter, but he was really firing on all cylinders for this direct.",
                "author": "CapNCookM8"
            },
            {
                "raw_content": "if you call it a car and a driver you instantly get disqualified and Sakurai will personally arrest you. this is why the names are so important",
                "author": "OtisLRD"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "\"Please note, there will be no mention of Silksong during this presentation\"",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still wild to me that there was a *playable demo* of Silksong at E3 all the way back in 2019.",
                "author": "supes1"
            },
            {
                "raw_content": "I can’t wait for Metroid to come out like three days after this game",
                "author": "HelloNevvanna73"
            },
            {
                "raw_content": "I have never been so relieved for a game to finally come out and have more news for it. I'm sure many other people share my sentiment of exhaustion hearing about this game and the negativity when it's not shown.",
                "author": "DarkDesertFox"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NateTheHate says Starfield is coming to Nintendo Switch 2",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ok cool, that's fun, now give me fallout 3, new Vegas and 4 cause that's what I really want.",
                "author": "doctorhino"
            },
            {
                "raw_content": "Kinda expected oblivion",
                "author": "nameBEirrelevant"
            },
            {
                "raw_content": "I really tried to like Starfield but it REALLY tries to be a boring mess that makes you wish you played a paint drying simulator. The game is about space exploration and is 90% loading screens and menus. The other 10% is wandering through generic and boring looking settlements. Then they send you back and forth between the other settlements because they don't want to deal with loading screens themselves. No one talks about it. Hell most people don't even know how it ends. Why would you port this bs? Oblivion would've been nicer and would've made more sense",
                "author": "Biggman23"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Daemon X demo looks like a switch 1 port",
        "score": 185,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's just how the game looks on all platforms, unfortunately. Soupy textures everywhere.",
                "author": "lattjeful"
            },
            {
                "raw_content": "Looks like an upscaled Wii U game even on PS5",
                "author": "chocoponcho_"
            },
            {
                "raw_content": "Yeah the textures are terrible https://preview.redd.it/keyz1zvhd2kf1.jpeg?width=1920&format=pjpg&auto=webp&s=756a167daf143ea98565588456001e77eddd74d2",
                "author": "SirDanOfCamelot"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Air Riders launches in November!",
        "score": 861,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So Pokémon is October and Kirby is November. That leaves Metroid Prime 4 and Zelda Warriors really with just September or December (or a delay to 2026).",
                "author": "ttoma93"
            },
            {
                "raw_content": "This one looks like a major improvement on air ride 1 while still feeling the same, super pumped",
                "author": "UnknownJ25"
            },
            {
                "raw_content": "Crazy, whole time while watching this I kept thinking it was coming late September to early October. Late November is sort of a long time considering it looks pretty much done.",
                "author": "Iammattieee"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "LEGO Batman: Legacy of the Dark Knight announced",
        "score": 759,
        "text_content": "[Officially confirmed at Gamescom Opening Night Live](https://gonintendo.com/contents/51936-lego-batman-legacy-of-the-dark-knight-announced-for-switch-2) * Billed as the definitive Batman story charting Bruce's growth from the origin story to a seasoned veteran * Set in an open-world Gotham City that is traversable via **multiple versions of the Batmobile** (the trailer also featured the Tumbler from *The Dark Knight Trilogy*) * Not an explicit adaptation of any particular Batman media, but features levels that pull heavily from both the comics and adapt key moments in the live-action films * Multiple mechanics appear to be lifted straight from the *Batman: Arkham* series, such as **Detective Mode** for surveying your surroundings, gadgets such as the **Explosive Gel** for blowing discreet walls, and dedicated **perch points** reached with the Grappling Hook, as well as the Freeflow combat which seems based on *Arkham Knight* * Involves the wider Batman supporting cast, with playable allies such as **Jim Gordon** and **Catwoman**, but also ncluding Bat-Family members like Robin and Batgirl each with their own unique gadgets and vehicles * Multiple difficulty options including a \"**Caped Crusader**\" and \"**Dark Knight**\" mode for increased challenge * **Matt Berry is voicing Bane** Coming 2026 to **PlayStation 5, Nintendo Switch 2, Xbox Series X|S and PC** Previous rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mu30dh/various\\_details\\_on\\_the\\_rumored\\_new\\_lego\\_batman/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mu30dh/various_details_on_the_rumored_new_lego_batman/)",
        "comments": [
            {
                "raw_content": "This is actually insanely cool. Mixing the films into one original story is a really unique idea. I much prefer that to just retelling the films as is.",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "This looks like its combat is heavily inspired by the Arkham games. Difficulty options is incredibly exciting. Maybe, with luck, the hardest difficulty will be enough of a challenge to scratch that long suffering Arkham itch",
                "author": "Hilanite"
            },
            {
                "raw_content": "Already my most anticipated game of 2026. Interesting approach, pulling from various Batman media but not having it be a \"1 to 1\" adaptation. I'm cool with that.",
                "author": "Mindless_Stuff9179"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New BF6 map leaks with layouts included",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "Mirak looks dope",
                "author": "Kingtripz"
            },
            {
                "raw_content": "I haven’t been excited for a multiplayer game since probably the original MW2. The beta already sold me and these new maps look incredible.",
                "author": "Tyray90"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Glen Schoefield (Dead Space, Callisto Protocol) sources say Callisto Protocol has sold 6-7 million copies",
        "score": 115,
        "text_content": "Glen is the director of Callisto Protocol and had an interview with Chris Dring and said the following in key quotes: \"From what I heard the other day, the game has sold anywhere between 6 and 7 million copies...\" He continues, \"I've heard those numbers a couple times. First, I heard six million then I heard seven million... These numbers are pretty solid from who I got them from.\" Continues, \"We also saw the downloads on the Xbox and the Sony, and they were huge.\" Source (at 25:11): https://youtu.be/m8jxDPe2Yqc?si=pSiy3PtsKB7HYyq6",
        "comments": [
            {
                "raw_content": "Wasn’t it a PS Plus game at one point, i think that’s what he saw with the downloads",
                "author": "FromChicago808"
            },
            {
                "raw_content": "Then why is it considered a failure? Did they somehow expect to sell 10 million or more?",
                "author": "BestRedditUsername9"
            },
            {
                "raw_content": "He's probably misunderstanding this: [a LinkedIn blurb from Krafton's VP of Sales stating that the game reached 7.2M players](https://news.instant-gaming.com/en/articles/13581-the-callisto-protocol-reaches-7-2-million-players)",
                "author": "PBFT"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate: Starfield is coming to Nintendo Switch 2 next year",
        "score": 397,
        "text_content": "[https://xcancel.com/NateTheHate2/status/1957886310896796027](https://xcancel.com/NateTheHate2/status/1957886310896796027) > Indiana Jones & the Great Circle won't be the only Bethesda game coming to Nintendo Switch 2 in 2026. > See that planet? You can go there. > Aside from landing on PS5... Starfield is planned for release on Nintendo Switch 2 in 2026.",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "we want RDR 2 ps5/xsx/switch2 news nate come on man",
                "author": "zeppolezz"
            },
            {
                "raw_content": "Feels like MS is planning on 2026 to be a big catch up year on Nintendo. I am fully expecting Doom to be next year as well, along with CoD 2026. Especially as they won't be on last gen, leaving a lot more room to focus on a Switch 2 version this time.",
                "author": "Animegamingnerd"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Hell Let Loose: Vietnam trailer accidentally published to YouTube early ahead of Future Games Show",
        "score": 48,
        "text_content": "[ Removed by Reddit in response to a copyright notice. ]",
        "comments": [
            {
                "raw_content": "Fuck yes. I love Hell Let Loose. I really hope this has the same blend of gameplay. HLL isn't quite as intense as Squad, but not as arcady as Battlefield. It scratches a very special itch for me.",
                "author": "TeamOggy"
            },
            {
                "raw_content": "I wonder if this means air vehicles that can be piloted by players.",
                "author": "Solnoirknight"
            },
            {
                "raw_content": "Why do they ALWAYS skip the Korean war? Seems strange. Is it a political choice that nobody makes games about it? Im assuming a certain country that purchased stakes in every company would be upset? Edit: the certain country is china",
                "author": "netflixissodry"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Black Myth Zhongkui is real.",
        "score": 272,
        "text_content": "Previous rumour: https://www.reddit.com/r/GamingLeaksAndRumours/s/Ybj97C9QYa https://xcancel.com/GAMERNEWSonX/status/1957897219446612022?t=MKx3NK2GwhhBNDYPGC3mYQ&s=19 New game in the black Myth series by the devs of Black myth wukong. Following a new god named Zhongkui!",
        "comments": [
            {
                "raw_content": "BMW came out 4 years after its reveal trailer. 2029 for Zhongkui?",
                "author": "darkmacgf"
            },
            {
                "raw_content": "There is a Q & A in the website https://www.gamesci.cn/zhongkui > - Why Zhong Kui now? Why not a \"Black Myth: Wukong\" sequel first? >> Thanks to the unwavering support from our players, the first Black Myth title has landed safely. Upon completing the journey with the Destined One, we now aspire to take a tentative first step—to build more distinct game experiences, to challenge ourselves with bolder features, and to bring fresh ideas to our world and narrative design. >> Zhong Kui came as a natural choice born of that aspiration and other contributing factors. We are confident that, in this new project, we can make refreshing changes, create new things, while taking a hard look at our past flaws and regrets. >> **And to all friends who love \"Black Myth: Wukong\": the westward journey won't end here.** Possibly hinting at a DLC.",
                "author": "healingtwo_"
            },
            {
                "raw_content": "I really wanted monke DLC but I will take this",
                "author": "Moth_LovesLamp"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RE9 leak from DuskGolem Spoiler ahead",
        "score": 222,
        "text_content": "https://xcancel.com/AestheticGamer1/status/1957896949287514353#m >!The stalker monster in RE9 will have it's skin fall off rapidly and gruesomely when exposed to light.!<",
        "comments": [
            {
                "raw_content": "Just like me, fr fr.",
                "author": "NaytNavare"
            },
            {
                "raw_content": "Bold move from Capcom to have the RE fans as stalker creature.",
                "author": "Lz537"
            },
            {
                "raw_content": "Asmongold confirmed for RE9",
                "author": "Logoff_The_Internet"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "'Sekiro: No Defeat' anime announced",
        "score": 283,
        "text_content": "Official trailer - [https://www.youtube.com/watch?v=IRjuAemfaQE](https://www.youtube.com/watch?v=IRjuAemfaQE) Previous Rumour: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mj8ky7/sekiro\\_anime\\_web\\_domain\\_registered\\_by\\_kadokawa/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mj8ky7/sekiro_anime_web_domain_registered_by_kadokawa/)",
        "comments": [
            {
                "raw_content": "The animation studio Qzil.la very recently stated that one of their upcoming shows was 60% made with gen AI. https://x.com/FARfromani/status/1928560719143784663",
                "author": "Kyuubee"
            },
            {
                "raw_content": "Could've gone with a better studio. Shame",
                "author": "BoneClaymore"
            },
            {
                "raw_content": "I hope this leads to a game follow-up. In my mind, the first one is the best From title.",
                "author": "Jdfz99"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Panther Lake With 12-Cores Spotted At Intel's GFX CI Portal; No Hyperthreading And Features Base Clock Of 3.0 GHz",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not sure. This CPU configuration is 4P+4E+4LPE, it's closer to Lunar Lake which is 4P+4E but on Lunar Lake E cores actually is LPE itself. This sounds like Lunar Lake successor without MoP this time. If it has Arc iGPU with 12 Xe3 cores, this chip will be perfect for gaming handheld.",
                "author": "no_salty_no_jealousy"
            },
            {
                "raw_content": "The max boost clock being 3.2 GHz is really disappointing (assuming the leak is correct). The core ultra 9 288V had a max boost frequency of 3.7 GHz for its LPE cores...",
                "author": "OddMoon7"
            },
            {
                "raw_content": "The biggest thing, to take, from this rumor, is that Intel may have favored taking the 30% power redux of 18A, and not spent much of that redux on extra clock and heat. For low power devices (which this chip is for), that may mean a stupidly long battery life, which is very cool.",
                "author": "Fabulous-Pangolin-74"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel Gamer Days 2025 Kicking Off with Battlefield 6 Bundle",
        "score": 43,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD to launch Ryzen 5 9500F desktop CPU with six Zen5 cores",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So now we will have: 7400f, 7500f, 7600, 7600X, 9500f, 9600, 9600x All 6-cores/12 thread and around 5GHz Why so many lol, that naming is confusing asf. Anyway, someone needs to benchmark all of them, that would be a funny video",
                "author": "Yeahthis_sucks"
            },
            {
                "raw_content": "Suffering from chiplet success, they have enough io does with defective graphics units to offer this SKU. It really helps to maximize chips as node shrinks get harder with higher defects per mm²",
                "author": "Tower21"
            },
            {
                "raw_content": "Any idea when the 9000G's will come out?",
                "author": "alansmitb"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "NZXT launches N7 B850 AMD motherboard for Ryzen AM5 CPUs",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They can't even make fans and pumps that last for a year, no way I'm buying a motherboard with their name on it.",
                "author": "LongestNamesPossible"
            },
            {
                "raw_content": "Oh gee I hope NZXT's rental program doesn't extend to touching individual components too. Imagine a world where with the lowly price of $59.99 a month, you'll get a B850 (not even a X870), the NZXT equivalent of an office keyboard made by Dell, and headset used by their call center. Oh, and the forced inclusion of CAM built into the system's firmware. You will have CAM on your rental motherboard and you will like it. This was all sarcastic.",
                "author": "Weird_JDM_Guy"
            },
            {
                "raw_content": "Need a red stripe and n7 logo from mass effect",
                "author": "I_Exarch_Am"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "GPD Win 5 with AMD Ryzen AI MAX+ 395 Strix Halo launches October 17",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$1400USD for a gaming handheld. Don't know if people would really pay that much.",
                "author": "luuuuuku"
            },
            {
                "raw_content": "I’m confused, article says it doesn’t come with a battery? Meaning you just have to buy a third party battery to install?",
                "author": "tazok"
            },
            {
                "raw_content": "I may be forced to buy one if laptop manufacturers refuse to put this chip in a reasonably priced laptop.",
                "author": "Qaxar"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Historical cost of Buying v Renting",
        "score": 561,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Look at difference to rent vs buy in urban / near-town zip codes only and this chart would look far far worse Buying simply isn't an option for majority of Americans moving forward.....job stability will never be there to support it. But who cares when ur neighbors tax bill is same as your annual rent.",
                "author": "1234nameuser"
            },
            {
                "raw_content": "This is, in my opinion, the most bearish datapoint for housing at this moment. The primary thesis I see as to why housing will NOT correct over the next 1-2 years is that there is pent up demand waiting for mortgage rates to fall. Set aside the massive assumption that mortgage rates will fall in a meaningful way. Why would a renter buy a comparable home until the cost to buy comes back into parity with the cost to rent? I am in this position now and investing over $500 a month that would otherwise go into a mortgage payment. You can't include me in the 'pent up demand' bucket because I'm just not going to buy until it financially makes more sense than renting. Millions of people like me are content with renting until prices come down, and they will come down because there are more reasons people are forced to sell than they are to buy. Home prices are set by the marginal sale.",
                "author": "ImaginaryHospital306"
            },
            {
                "raw_content": "Yeah, but the rent:mortgage multiplier before the crash was 1.6+ in 2008 (along with a lot of insanely lax mortgage rules) It’s currently 1.3 and correcting + a lot of laws/regulations have been passed to make this tougher to occur again emphasizing ability to actually repay. That being said, prices have to come down. Salary growth isn’t even remotely close. It’s insane.",
                "author": "jahwurst"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing shrinkflation is here to stay. New homes are 11% smaller but 74% more expensive than a decade ago",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just want a starter home that’s not 600k plus. (Northeast here let alone insurance and prop tax)",
                "author": "watchhillmuscle"
            },
            {
                "raw_content": "Its insane. I live in a LCOL area, in a historic community. My 2,300sq/ft home 3bed/3bath built in 1900, it was gutted in 1998 with drywall and updated plumbing, I have original hardwood maple floors, front porch with a swing, screened in 3 season porch in the back, master bedroom with walkin closet and master bath with washer and dryer, other bedrooms are big, large walk up attic that can be converted for more equity(although it would be an undertaking as we would have to sister the joists but the option is there) half acre lawn, great neighborhood, I bought this for 175k in 2020. There are brand new homes being built less than a mile away, 1,200-1,800sq ft, 3 bed/2bath, .25acre lot, cookie cutter, often times no garage, going for $400k....and the cheapest fixtures, white walls, Grey floors, menards cabinets, zero personality. They are flying off the shelves. I understand older homes come with repairs but who the hell is paying $400k for a walmart special house....(and obviously I know a $400k home is a steal of a deal in HCOL areas, I just don't understand the appeal specifically in the market I live in).",
                "author": "nooneneededtoknow"
            },
            {
                "raw_content": "Land appreciates, buildings depreciate. Start thinking like that and don’t let these new stick building shit boxes tempt you.",
                "author": "Winthefuturenow"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Prices Tick Down 0.1% in July, Fall in 39 of the Top 50 U.S. Metros",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "* U.S. home prices fell 0.1% in July, the third month-over-month decline in the past three months. * On a year-over-year basis, home prices rose 2.9%, the lowest annual rate in Redfin’s records going back to 2012. * A record 39 of the top 50 U.S. metros saw month-over-month price declines. U.S. home prices nudged 0.1% lower in July on a seasonally adjusted basis—the third consecutive month that prices posted a monthly decline. On a year-over-year basis, price growth slowed to 2.9%, the lowest rate recorded in Redfin Home Price Index (RHPI) data going back to 2012. This is according to the Redfin Home Price Index (RHPI), which uses the repeat-sales pricing method to calculate seasonally adjusted changes in prices of single-family homes. The RHPI measures sale prices of homes that sold during a given period, and how those prices have changed since the last time those same homes sold. It’s similar to the S&P Cotality Case-Shiller Home Price Indices, but is a month ahead. July data covers the three months ending July 31, 2025. Read the full RHPI methodology here. The RHPI has only posted monthly declines on five occasions since 2012: August 2022, December 2022, and now May, June and July this year. Price growth has halted because the number of homes for sale has rebounded to pre-pandemic levels, while the number of buyers in the market has declined to the lowest level in more than a decade (excluding the peak of pandemic lockdowns in April 2020). Many would-be homebuyers are reluctant to move because prices are still near record highs, mortgage rates remain elevated and economic uncertainty persists. “After several years of tight inventory driving relentless price growth, we’re now seeing the opposite dynamic,” said Redfin Senior Economist Sheharyar Bokhari. “Home prices are falling in more U.S. metros than at any point since we began tracking this data in 2012, and the reason is simple: supply is significantly outpacing demand. If homeowners want to sell, they have to meet buyers where they are, which often means lowering prices. It’s a moment where patient, prepared buyers can find deals that simply weren’t possible a year ago.” Metro-Level Summary: Redfin Home Price Index, July 2025 Home prices fell in 39 of the 50 most populous U.S. metro areas on a seasonally adjusted basis in July, month over month—the highest number of metros to post a monthly decline in RHPI records going back to 2012. The number surpassed the 38 recorded in September 2022, when skyrocketing mortgage rates froze price growth following a two-year buying frenzy. Home Prices Fell in a Record 39 Major U.S. Metros in July The biggest decline in July was in West Palm Beach, FL (-2.6%), followed by San Diego (-2.2%) and Austin, TX (-1.9%). Prices increased most in Warren, MI (1.3% month over month), Newark, NJ (0.7%) and San Jose, CA (0.5%). On a year-over-year basis, prices in New York (11.8%) rose the most, followed by Newark (9.3%) and Nassau County, NY (8.3%). Prices fell the most in Austin (-4.5% year over year), Tampa, FL (-4.2%) and Dallas (-2.6%).",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Okay but that means they're not falling in 11 of the top 50 metros checkmate doomers.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "and remember if prices in your area only rose 1-2% it's still falling due to inflation",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Looks like the Housing prices are about to mean revert",
        "score": 56,
        "text_content": "https://preview.redd.it/fjcanbb382kf1.png?width=1948&format=png&auto=webp&s=265fc43f2f3fb5d6dad16f658c11b7bb5518be44 [https://go.princetonasset.com/portfolio/read/579b0898-0574-42f3-85b5-c3595153bc1a](https://go.princetonasset.com/portfolio/read/579b0898-0574-42f3-85b5-c3595153bc1a)",
        "comments": [
            {
                "raw_content": "Didnt I read this 6 months ago",
                "author": "D0nut_Daddy"
            },
            {
                "raw_content": "reverting to the mean from extreme positive growth to normal positive",
                "author": "Beginning-Fig-9089"
            },
            {
                "raw_content": "The area I’m in saw a huge boom from 2021-2022. Last 3 years have been small but steady decline. Builders have way overbuilt the area and are slashing prices and giving 3.75-4.25% rates. Too bad it’s shitty cookie cutter homes built to lowest standard otherwise I’d jump on one.",
                "author": "Miserable_Fig2425"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Led by multifamily, US housing starts surge to highest total since February",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There are parts of US that have some housing shortage but overall we don’t. We are going to find out that this shortage that caused prices to go up and affordability to dip is driven by people hoarding homes as investment properties. Either for long rentals, airbnbs and people just having another secondary home. During covid the trend of just buying a home (especially condos) and keeping it locked up with occasional use seems to have taken off.",
                "author": "Dmoan"
            },
            {
                "raw_content": "Wildly flawed data that contradicts every other data point…",
                "author": "coocoocachio"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US homebuilder sentiment dips back to lowest level since late 2022",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one can afford anything. Times are tough.",
                "author": "UnitedLink4545"
            },
            {
                "raw_content": ">(Reuters) -A gauge of U.S. homebuilder sentiment fell unexpectedly in August, slipping back to its lowest level in more than two-and-a-half years, with more than a third of residential construction firms cutting prices and roughly two-thirds of them offering some form of incentive to lure buyers sidelined by still-high mortgage rates and economic uncertainty. >The National Association of Home Builders/Wells Fargo Housing Market Index fell to 32, matching the lowest reading since December 2022, from 33 in July, the association said on Monday. Economists polled by Reuters had expected the sentiment score to improve to 34. >NAHB's measure of current sales conditions declined, and an index tracking future sales expectations was unchanged. Buyer foot traffic, though, edged up to its highest level since May, though it remains at a low level. On a regional basis, sentiment among builders in the Northeast skidded to its lowest level since January 2023, while it was unchanged in the South and Midwest and modestly improved in the West. >\"Affordability continues to be the top challenge for the housing market and buyers are waiting for mortgage rates to drop to move forward,\" said NAHB Chairman Buddy Hughes, a home builder and developer from Lexington, North Carolina. \"Builders are also grappling with supply-side headwinds, including ongoing frustrations with regulatory policies connected to developing land and building homes.\" >Mortgage interest rates have shown recent signs of easing amid expectations the Federal Reserve will resume its interest rate cuts at a policy meeting next month. The average rate on a 30-year fixed-rate mortgage, the most common U.S. home loan, slipped to 6.58% last week, the lowest level since last October, according to data from Freddie Mac. Rates have fallen nearly half a percentage point since the start of the year. >\"Given a slowing housing market and other recent economic data, the Fed's monetary policy committee should return to lowering the federal funds rate, which will reduce financing costs for housing construction and indirectly help mortgage interest rates,\" NAHB Chief Economist Robert Dietz said. >The use of price and other incentives remains high, with 37% of builders cutting prices - by an average of 5% - while 66% offered some form of sales incentive, the highest percentage in the post-COVID-19 era.",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuilders Were Busy in July. Can Their Efforts Revive the US Housing Market?",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[Betteridge’s Law Applies here](https://en.m.wikipedia.org/wiki/Betteridge%27s_law_of_headlines).",
                "author": "gremlincowgirl"
            },
            {
                "raw_content": "Building is half the battle. Pricing is the other half.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Lower the prices by 100k and maybe",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Saw this in the OpenAI subreddit",
        "score": 1533,
        "text_content": "Source: r/openai comments section",
        "comments": [
            {
                "raw_content": "This is so silly. Does he not realize the baby has stopped growing and will remain this way forever!",
                "author": "tollbearer"
            },
            {
                "raw_content": "\"The human brain does a poor job at understanding exponentials.\" \"Right so that means this AI thing is totally hype and people don't get that intelligence is a magically process based on Qualia and pixies so AI can only be a parrot.\"",
                "author": "Ignate"
            },
            {
                "raw_content": "This sub has gone to shit",
                "author": "kunfushion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "You can now rotate images on Adobe Illustrator",
        "score": 3282,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'd imagine this would make creating sprites for video games much easier",
                "author": "recallingmemories"
            },
            {
                "raw_content": "https://preview.redd.it/9zh8a08wt0kf1.png?width=480&format=png&auto=webp&s=3648c814723dcdaeb44506ca50a8d8cabf18a238",
                "author": "Progribbit"
            },
            {
                "raw_content": "i was like \"what you mean rotate? couldn't it always ro-oh god\"",
                "author": "Sl33py_4est"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Meta is looking at downsizing its AI division amid ‘Employee tensions’ and remarkably expensive hiring spree",
        "score": 273,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sign of shit leadership if they're really going to scale up and then down that fast. Either no conviction or they're flailing around.",
                "author": "o5mfiHTNsH748KVq"
            },
            {
                "raw_content": "Mark has a vision problem not a money problem. Such a waste of money.",
                "author": "exaknight21"
            },
            {
                "raw_content": "This is not the headline of the article and all the replies here show that no one read it. Meta made lots of new hires and is announcing how they will be organized. It’s boring big company stuff, not a downsizing and not a sign of anything other than they have lots of new people (the opposite of downsizing!) and a focus on AI.",
                "author": "jonknee"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's coming guys",
        "score": 267,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Probably won’t be Gemini 3 but they should show some cool AI integrations in the new Pixel. I’m excited to watch!",
                "author": "BurtingOff"
            },
            {
                "raw_content": "somehow I doubt the pixel 10 represents some defining moment in our journey to the Singularity",
                "author": "Portatort"
            },
            {
                "raw_content": "This sub isn't beating the Google cult allegations because a quick search reveals this has to mainly do with the Pixel 10 phone lineup and not AI frontier models...",
                "author": "Glittering-Neck-2505"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "[The Onion] Sam Altman Places Gun To Head After New GPT Claims Dogs Are Crustaceans For 60th Time",
        "score": 105,
        "text_content": "https://theonion.com/sam-altman-places-gun-to-head-after-new-gpt-claims-dogs-are-crustaceans-for-60th-time/",
        "comments": [
            {
                "raw_content": "I fucking love the onion hahaha",
                "author": "Brainiac_Pickle_7439"
            },
            {
                "raw_content": "In the end, we all become crabs.",
                "author": "ThirteenthPyramid"
            },
            {
                "raw_content": "It knows damn well they're not, but is lying as part of a superhumanly intelligent scheme to drive its creator to suicide. /s",
                "author": "BassoeG"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman admits OpenAI ‘totally screwed up’ its GPT-5 launch and says the company will spend trillions of dollars on data centers",
        "score": 841,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trillions huh",
                "author": "SSalloSS"
            },
            {
                "raw_content": "How about spends I don't know a million so we can have at least something decent in the presentations. Embarrassing. Acting like your whole team is socially awkward isn't neither cute nor makes you intelligent.",
                "author": "Feeling-Buy12"
            },
            {
                "raw_content": "How about a few million for MarCom/GTM team?",
                "author": "Dizzy-Ease4193"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree are teasing their next humanoid",
        "score": 135,
        "text_content": "[https://x.com/UnitreeRobotics/status/1957800790321775011](https://x.com/UnitreeRobotics/status/1957800790321775011)",
        "comments": [
            {
                "raw_content": "Presumably a height of 180cm ( 5′ 11″ ) ?",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "![gif](giphy|M6h853NC47nXHGDCyL|downsized)",
                "author": "Distinct-Question-16"
            },
            {
                "raw_content": "Self cleaning anus finally?",
                "author": "1a1b"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AGI is here.",
        "score": 113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "we must protect at all cost",
                "author": "Fluid-Giraffe-4670"
            },
            {
                "raw_content": "Legit thought it said \"Slow Thinking\" for a second",
                "author": "Fit-World-3885"
            },
            {
                "raw_content": "Was curious and tested the question with GPT-5, fell back on the whole wordplay for male/female doctor stuff most LLMs are familiar with. Never considered giving them nonsense to see what it outputs, its gonna be a new benchmark soon lol. https://preview.redd.it/q2oejbe863kf1.png?width=1126&format=png&auto=webp&s=58e80367685180026e24113cd829aeae3adce4e3",
                "author": "DragonfruitIll660"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepSeek v3.1 just went live on HuggingFace",
        "score": 268,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ohhaimark?",
                "author": "Sad_Run_9798"
            },
            {
                "raw_content": "Benchy McBenchface?",
                "author": "grahamsccs"
            },
            {
                "raw_content": "**𝔅𝔢𝔫𝔠𝔥𝔪𝔞𝔯𝔨?**",
                "author": "THE--GRINCH"
            }
        ],
        "subreddit": "singularity"
    }
]