[
    {
        "post_name": "She should be in jail, or even a worse punishment, sent back to Somalia, considered one of the absolutely worst countries in the World.",
        "score": 701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can't JUST send her back. She will be every bit as powerful back there. I'd say the most rational thing is to have her buried at sea TODAY. Nogs don't understand fire and sure as hell can't swim.",
                "author": "TennesseeRepublic"
            },
            {
                "raw_content": "So fucking do it‼️",
                "author": "awsure"
            },
            {
                "raw_content": "You keep bitching but we see no action. So .......... fucking push to get her out tomorrow. 🤓",
                "author": "drmrboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NATO has been telling Denmark, for 20 years, that “you have to get the Russian threat away from Greenland.” Unfortunately, Denmark has been unable to do anything about it. Now it is time, and it will be done!!! President Donald J. Trump",
        "score": 566,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We have domestic problems; NONE of your base voted for this Greenland, Venezuela, or Iran shit.",
                "author": "friedchicken"
            },
            {
                "raw_content": "Holy shit man, can you spend 5 minutes doing something about the civil war in America please?",
                "author": "Mango_Loyd"
            },
            {
                "raw_content": "# LFG!",
                "author": "sum1else"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Building a “New York Stock Exchange” in Dallas is an UNBELIEVABLY BAD THING FOR NEW YORK. I can’t believe they would let this happen. A big test for the new Mayor!",
        "score": 512,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think it's brilliant!! If NYC goes full-Marxtard, we've got to be able to keep the country's business environment running.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "Sad to see that the President's hometown is losing this business/ organization, but New York deserves this. It is no longer the symbol of America and free market capitalism from Pres. Trump's youth. Edit: It is the Chicago Branch of the NYSE moving to Texas, that one in NYC since 1792 is still there. At least it is hurting Pritzker and Chicago.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Fuck New York",
                "author": "RustySheckelford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley: Welcome to Hopkins Child Care Center in Minnesota they received $2.25M in 2025 for their “daycare”",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They poured out that door like angry hornets🤣",
                "author": "RealWomenLoveTrump"
            },
            {
                "raw_content": "Typical Muslim arrogance when caught.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "Just to be 100% clear, there's not one Somali man alive who'd ever be seen doing a \"woman's job\" of raising small children. If 3 raging banshees in hijab came screaming out the door, maybe there's the slightest possibility of legitimacy. But 3 dudes did. And the first thing they did was call the guy racist. These dudes are guilty af and they know it.",
                "author": "Moose_Antlers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Today Don Lemon and a group of leftist agitators stormed a church service to protest ICE. This is a direct and flagrant violation of the FACE Act, which the Biden Administration used to throw pro-lifers in federal prison for years. Don Lemon and his co-conspirators should be facing federal pris",
        "score": 986,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nothing ever happens",
                "author": "Mango_Loyd"
            },
            {
                "raw_content": "Beyond that. They abused power against innocent people when they had it and promise to get worse when they get it again. We just want legitimate action against actual criminals, and understand the extent of force required to accomplish this is near military scale.",
                "author": "Dangerous"
            },
            {
                "raw_content": "\"Demon\" is literally in his name.",
                "author": "LBTrumplican2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump will not tolerate the intimidation and harassment of Christians in their sacred places of worship.",
        "score": 1012,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh yes he will. Nothing will happen to any of those people.",
                "author": "Tookens"
            },
            {
                "raw_content": "arrests or shut the fuck up",
                "author": "PunishedOrange"
            },
            {
                "raw_content": "Dom Lemon was the leader or that.",
                "author": "GunToast"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE ADDRESS REGISTERED TO NICK SORTOR’S ATTACKER’S CAR IS A CHILDREN’S AUTISM CENTER",
        "score": 1117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Registered Owner : SUBEYDA MOHAMED NPI 1225860836 Behavior Technician in Spring Lake Park, MN",
                "author": "Quiznos585"
            },
            {
                "raw_content": "Are they seriously all scammers?",
                "author": "Coprolite"
            },
            {
                "raw_content": "She’s a Somali scammer. I could easily have predicted that.",
                "author": "JBlaze056"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Arrest The Leaders Of Insurrection",
        "score": 750,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Make examples of them.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "You forgot the third picture, the photo of congress.",
                "author": "FiresideRant"
            },
            {
                "raw_content": "For some reason he thinks it's not bad enough to drop the hammer. Whatever it takes to crank up, WAY UP, the mass deportation of the illegal alien replacement population is the issue - not tampon and tampon jr. They should absolutely be thrown in the clink, however.",
                "author": "NoMoreShinesBilly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AGAIN. HOW IS THIS BEING PERMITTED TO GO ON WITH NO ACCOUNTABILITY? Left-wing domestic terrorists are ... terrorizing U.S. citizens, U.S. businesses, and U.S. law enforcement officers. And why not? No one is stopping them.",
        "score": 714,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about… stay open. Have armed guards or officers in the lobby… and shoot any cunt who tries to break in.",
                "author": "DJTXLV"
            },
            {
                "raw_content": "so many fucking people need vanished from this country its mind boggling. just sick mentally ill garbage everywhere you look",
                "author": "Zarlino"
            },
            {
                "raw_content": "Hilton is bad news, totally avoiding this chain forever.",
                "author": "Covfefebrulee"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Somalian in Minneapolis just stole Nick Sortor’s $1,000 camera, committing a felony, and nearly killed him by dragging him with their vehicle when he tried getting it back.",
        "score": 1300,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Somalis demand Americans stop judging them by the content of their character.",
                "author": "kwakkles"
            },
            {
                "raw_content": "Get the fuck out! I am fucking done! GTFO!",
                "author": "NotADemThang"
            },
            {
                "raw_content": "The police in Minneapolis are worthless. Sad.",
                "author": "Maxmax"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They always had empty businesses.. but now they found a way to blame it on the Right.. You just can't make this shit up. Round these fucking shit monkeys up and ship them out.",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Don't care. We're basically at the flash point. There's literally nothing that can be said or shown that will make me care about my enemies. I've already made a commitment that if the left steals federal power again I'm not paying taxes. The only reason I'm still paying taxes is because Trump is president and I live in a red state. I'm never again going to pay for government controlled by my enemies. I know this sounds like fluff. Internet tough guy. No. I get physically ill knowing my hard work was enriching these people.",
                "author": "90sKid"
            },
            {
                "raw_content": "Empty business means their fraud checks didn't come in the mail this month.",
                "author": "duckduck"
            },
            {
                "raw_content": "When your entire culture is based on lying and liars and lying liars, lying becomes pretty easy.",
                "author": "MocksFordComma"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Democrat Party",
        "score": 708,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# FUCK MINORITIES!",
                "author": "IndianaRepublic"
            },
            {
                "raw_content": "You forgot pedophiles",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Russian Agents? Try Ukrainian Grifters.",
                "author": "Doritalos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This cycle needs to be broken, burned down and thrown into the dust bin of history, starting at the top.",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why aren't leftists approaching the muslim treatment of women with the same consistency as they do everything else remotely similar",
                "author": "magaspif"
            },
            {
                "raw_content": "- Indians hire other Indians - Blacks hire other Blacks - Mexicans only hire other Mexicans - Woke Liberals make sure to 'hire diverse people'",
                "author": "try4gain"
            },
            {
                "raw_content": "Only problem with this comic is the immigrants look sad. Irl these fuckers must wake up laughing knowing they're scamming the richest country in earth.",
                "author": "KnoxHarrington"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Um, Sir, I’m gonna need to see some ID…",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So disrespectful... didn't even wear a suit to get into the beggars' line.",
                "author": "Everyonelovesblacks"
            },
            {
                "raw_content": "for those unaware, look at the 2nd guy in the line",
                "author": "atomisten"
            },
            {
                "raw_content": "Require a bacon test first. 👺💦 🥓",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Word of the day: Denaturalization.",
        "score": 1377,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is going to be a very long list.",
                "author": "Somebody157"
            },
            {
                "raw_content": "Good! We never should have made them citizens to begin with but they don't get to hide behind that as a shield to keep getting all the benefits the U.S. has to offer while robbing us blind.",
                "author": "Smurfection"
            },
            {
                "raw_content": "Ilhan Omar #1",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats are protecting these criminals, its way past, getting old",
        "score": 1127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# IMPRISON # ALL DEMOCRATS **NOW**",
                "author": "UtahRepublic"
            },
            {
                "raw_content": "Bet they were labelled \"white\" on the report",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Wanted out, wouldn’t join, or he was killed to punish someone else. Thanks, Auto-pen.",
                "author": "EvensoAmen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat Rep. Angie Craig just demanded Americans to call 911 en masse on ICE AGENTS so local police can oppose ICE \"If ICE comes to this parking lot, business? Call 911! We're gonna send local police!\"",
        "score": 842,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats in 2020: *Defund the police*! Democrats in 2026: *Where are the police*?!",
                "author": "FromTheTopRope"
            },
            {
                "raw_content": "They are trying to start Civil War, plain as day. Treason. Execute them.",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "Sorry your toddler is choking to death, we're busy helping invaders call back later",
                "author": "Sea_Still"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Matt Walsh: \"I want Don Lemon dragged out of his house by a SWAT team at gun point.\"",
        "score": 453,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No worries, Blondi is one the case, right after she gets her hair and nails done.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "Make sure it's at 4AM with CNN cameras",
                "author": "perma-maga"
            },
            {
                "raw_content": "Won't happen. Bondi's a Larper amd Don is too much of a puss to replace her.",
                "author": "CrispyCracker2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bill & Hilary Clinton To Be Held In Contempt. No one is above the law.",
        "score": 1590,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bannon was jailed for less egregious behavior.",
                "author": "eclectic22"
            },
            {
                "raw_content": "I would *hate* to be the Clinton’s mailbox. The letter they are about to get from Congress is going to be an absolute *scorcher*.",
                "author": "asdrubael_was_right"
            },
            {
                "raw_content": "Democrat judges are above the law. After King AutoPen and King Tim Walz, democrat judges are the closest things we have to Kings.",
                "author": "NotYourMan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Flaming black faggot says these protests and these kinds of things are what the civil rights movement was about?",
        "score": 919,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's see him do that in a mosque",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Invading a church is what the civil rights movement was about? Then the civil rights movement is a 1st amendment violation. Infringement on others right to religion",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "So he wants all of the illegals here taking jobs from black Americans? That's what it was all about?",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Data Centers Will Consume 70 Percent Of Memory Chips made in 2026, RAM Shortage Will Last Until Until Atleast 2029 As Manafacturing Capacity For RAM In 2028 That Hasnt Even Been Made Yet Is Already being Sold",
        "score": 1091,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really hope this article shows up in r/agedlikemilk soon.",
                "author": "Secure-Tradition793"
            },
            {
                "raw_content": "I do ponder: for ever gigabyte of memory that the average person posesses, how many gigabytes do all the data centers have?",
                "author": "gomurifle"
            },
            {
                "raw_content": "\"The reason why RAM has become four times more expensive is that a huge amount of RAM that has not yet been produced was purchased with non-existent money to be installed in GPUs that also have not yet been produced, in order to place them in data centers that have not yet been built, powered by infrastructure that may never appear, to satisfy demand that does not actually exist and to obtain profit that is mathematically impossible.\" - Unknown",
                "author": "MrLyle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD argues against emulated FP64 on GPUs",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fwiw should be noted that AMD owns the (small) market for scientific computing that needs that level of precision. Blackwell basically can’t do FP64.",
                "author": "a5ehren"
            },
            {
                "raw_content": "Note: I've provided a descriptive title because the original title completely failed to convey what the article is about.",
                "author": "NamelessVegetable"
            },
            {
                "raw_content": "Can’t wait for AI to find a cure for cancer using FP4",
                "author": "Sosowski"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "SK Hynix Unveils 5-Bit NAND That Splits Cells, Delivers 20× Faster Reads",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Blocks & Files notes that the breakthrough showcases SK hynix’s 4D 2.0 technology, in development since 2022. We are now entering 4D NAND",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "increases chip capacity by 25% but decreases durability 2X factor. basic math guys there is no way to get around it. every time you increase the cell voltage state by 1 bit, you decrease durability by 2X.",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "Do note the \"20× Faster Reads\" claim is comparing to traditional PLCs, so realistically its performance should be close to QLC drives. An [article](https://blocksandfiles.com/2026/01/15/sk-hynix-developing-split-cell-5-bit-flash/) from Blocks and Files briefly explores this technology in technical terms. Perhaps the \"PLC SSDs\" are finally coming within few years.",
                "author": "Horizonspy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Insane engineering of Digital Micromirror Device Chip (DLP projectors) in electron microscope",
        "score": 40,
        "text_content": "It's a DMD (digital micromirror device) taken out of the DLP technology projector. It shows almost 1 000 000 microscale mirrors that act as a pixels when the light bounces off of them. Images are taken on the scanning electron microscope.",
        "comments": [
            {
                "raw_content": "Very cool stuff, how do they attach the springs and the mirrors though? So the base is just silicone right? It looks like it's 3 parts, the base, the spring, and the mirror, I can't imagine any machine even being able to place those springs in there. It's incredible what chip engineers can do.",
                "author": "kakashihokage"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Russian Modder Builds DIY RAM, Saves $600–$800 on a Single DDR5 Module",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its just laptop memory soldered onto blank desktop pcbs. Yes they saved money this time, but those prices will be going up too for the same reason this worked... the memory is what is in high demand, not the PCBs.",
                "author": "Canadian_Border_Czar"
            },
            {
                "raw_content": "There's nothing new from when this was posted as a VideoCardz article [a week ago](https://www.reddit.com/r/hardware/comments/1q9bgr9/russian_modder_makes_his_own_ddr5_memory_saving/).",
                "author": "InevitableSherbert36"
            },
            {
                "raw_content": "this was posted before, this is wrong. they saved about 40 dollars total and got worse memory for it.",
                "author": "Strazdas1"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I knew they could make sound but i did not expected to be that good",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wait this is so cool. I want them to make more stuff like this",
                "author": "ArcheryAlaska"
            },
            {
                "raw_content": "Wait what",
                "author": "Ryansmelly"
            },
            {
                "raw_content": "Wish more games used hd rumble",
                "author": "Erik_REF"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Excited.",
        "score": 276,
        "text_content": "Looking forward to seeing what the fuss is about! Long standing fan of the franchise but going into this one with an open mind, would like to have played 3 first but not had a chance :(",
        "comments": [
            {
                "raw_content": "I’m having a good time. About 10hrs in (contrary to other commenter, game isn’t that short for everyone). It seems like the dogpile game of the month, but it’s a Metroid Prime game through and through - which is exactly what I wanted when I bought and booted it up.",
                "author": "TeamLeeper"
            },
            {
                "raw_content": "I’ve really enjoyed the game, granted I’m a 51yr old grandma and haven’t played the other games in the series. I have since added Dread and Prime remastered to my wishlist to pick up if I get past this dang ole lava dragon thing and make it through to the end 🤣",
                "author": "Available_Second_400"
            },
            {
                "raw_content": "Same here. I'm about to start playing mine today.",
                "author": "FatBoyDiesuru"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "One of the great things about handhelds",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you not do this with a regular console and holding the controller?",
                "author": "Mango-Vibes"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Now this is a JOYcon",
                "author": "Phos-Lux"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Joycon shell swap",
        "score": 15,
        "text_content": "wanted to make my switch more unique. this shells were a little more difficult than the switch 1 joycon shells.",
        "comments": [
            {
                "raw_content": "Looks great :) Is Skyrim any good now or does it still have massive performance and lag problems?",
                "author": "Superskstron"
            },
            {
                "raw_content": "Did you do the full rail or just the outer shell? Any more wobble than stock?",
                "author": "1112e"
            },
            {
                "raw_content": "Hello! Welcome to r/NintendoSwitch2! Your post has been sent to the moderators for review. To help manage spam, trolling, and repetitive posts, we restrict new posts from accounts that do not have much comment karma earned in this subreddit. Please contribute through comments on other posts in the meantime. If you are trying to ask about an issue with your Switch console or otherwise seeking help, you may want to check out the peer support community at r/NintendoSwitchHelp. You can find our rules here: https://www.reddit.com/r/NintendoSwitch2/wiki/rules *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/NintendoSwitch2) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Xenoblade Series ☺ (From V1 to Switch 2)",
        "score": 431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If only they looked good on the S2 and had the resolution bumped in the least",
                "author": "FlipCup88"
            },
            {
                "raw_content": "In case you aren’t aware, you don’t have to buy a new console for each game. /s",
                "author": "cixelsyd"
            },
            {
                "raw_content": "Really want to get into this series. Which one to start with?",
                "author": "DaveSinghSwitch"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why switch 2 games have eur-0 code while switch 1 have eur code at the end ?",
        "score": 87,
        "text_content": "What does that 0 means ?",
        "comments": [
            {
                "raw_content": "It would be reasonable to think that they want their cartridge codes to be distinguishable. So the 0 just means it’s a switch 2 game. So Metroid prime 4, for example, probably has the same cart code for both the switch 1 and switch 2 versions, and the 0 tacked on at the end means switch 2 version.",
                "author": "Ok_Literature3138"
            },
            {
                "raw_content": "Revision, most likely. GB codes worked that way.",
                "author": "AdalbertJ"
            },
            {
                "raw_content": "I’m assuming it’s cartridge revision number",
                "author": "Tommy_Gun10"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GTA 6 - Leak Compilation",
        "score": 1037,
        "text_content": "We've recently gotten lots of leaks, somewhat verified thanks to declarations from Rockstar. Two of the big ones are lists of details posted by user u/Snowk32 (now deleted) on two [different ](https://www.reddit.com/r/GamingLeaksAndRumours/comments/17ad683/gta_vi_plot_mechanics/)[posts](https://www.reddit.com/r/GTA6/comments/16st1vu/predictions_about_the_game/), as well as the known details from [GameRoll](https://xcancel.com/GameRoll_/status/1931398779669712944). Another list of leaks that holds some credibility is [LegacyKillaHD's ](https://xcancel.com/LegacyKillaHD/status/1833191000543506604)list, since he shared some details that ended up matching the second trailer. This list compiles every detail posted by them through posts in Reddit, X, or Discord messages. # Story: * The game has chapters like RDR2, 5 chapters in total. Shots from Trailer 2 were all from Chapters 1-3. * Jason served some time in the army. * Lucia is the central character of this story, as Michael is to 5. * Lucia/Jason have separate intro missions. * Lucia has a baby that she abandons at a delicatessen before heading out to a bank robbery and then getting arrested for doing such an act. * Lucia's baby is only shown in a cutscene as a flashback. There's no information about what happens to the baby after this point. * After a few years, Lucia gets released on probation, and she's picked up at the prison by Jason, who plans a robbery with her. They fell in love with each other after some time. * Lucia gets rid of its ankle monitor pretty early on. * The part where they jump off the bike into the truck is from Chapter 3. * Donnie, Jason's friend who works for Brian and is described as a \"freak\". # Gameplay: * The character wheel has three options: Solo Jason, Solo Lucia, and Dual Protagonist Control, where Lucia/Jason can be controlled simultaneously to team up in the open world. Some missions are also started using both at the same time. * Jason has a dead-eye-like ability, slows down time, and reveals weak spots. Lucia can do it too, but only on one shot. * Limited weapon system returns. Stored in the trunk. * 6 star wanted level returns. * Rectangle GPS with pink waypoints. * Driving is \"the best it's ever been\". * Greet and Antagonise is in the game. * Weight mechanics are a thing. * Gore/dismemberment is being built off of RDR2. * Lucia's ankle monitor doesn't affect exploration. * The cover system has been completely overhauled, and it’s now much more realistic. * Trailer 2 scene where Jason buys beer is gameplay. You can go buy a six-pack from the shop as seen. * The relationship bar mentioned in the 2022 leaked clips still exists. Works like honour in RDR2. # Missions: * In the very first mission of the game, you control Jason, and you have to follow a plane that is about to land and carries a Russian drug dealer. Apparently, Jason meets this guy and plans a mission to steal drugs. * In this drug-stealing mission, they are chased by the police, and the drug ends up falling into the ocean. There is a following mission where they will have to dive to retrieve it. * The majority of the planning for the missions takes place at a nightclub. * There's a mission where you shoot a shark with a speargun. * Lucia sneaks into a bodybuilding gang. * There's a mission where cops betray each other, but the context is unknown. # Map: * The map is once again an Island. * No panhandle. * Besides Miami and its surrounding areas, there will be three islands in the game, one of them being heavily inspired by the Bahamas. (Note: this is from 2023, so keep that in mind) * Ambrosia and Port Gellhorn are nothing compared to the size of Vice City. Still big obviously, but VC is the biggest by far. * There’s a “Fort” city inspired by Fort Knox, where they “stashed” gold. * There’s a bike trail around Lake Leonida. # Open world: * 700+ shops and most interiors of a major open-world game. There are shopping malls with shops in them, and there are skyscrapers with lifts in them. * Explorable underwater areas with treasure and secrets. * People do react if you have your gun out, and Jason and Lucia will try to hide their gun if they're walking with it out. * NPCs will call the police when you trespass into their houses, and they’ll try to arrest you. * Basketball minigame. * You’ll be able to rent hotels and motels in the game. * Male strippers are in the game. # Cut content: * One of the ideas that didn't go too far was voiced protagonists in Online. * Prone was cut a while ago. * The random encounter from the leaks, where the NPC talks about Jay Norris, got cut ages ago. # Non-existent content: * Listening to music outside of a car apparently isn't a thing, but that could change before launch. * You can't buy pets, but Jason does have a pet iguana that you can feed. * Dual-wielding weapons isn't in the game. * Chainsaw won’t be a weapon, as it has been previously reported. * No fully nude sex scenes. * No Disney World parody. * No burglary mini-game.",
        "comments": [
            {
                "raw_content": "I’m so happy they’re bringing back Greet and Antagonize, I love going around in RDR2 doing that",
                "author": "SuperTristan2017"
            },
            {
                "raw_content": "NPCs will show up to defend their home",
                "author": "BeastMsterThing2022"
            },
            {
                "raw_content": "> Besides Miami and its surrounding areas, there will be three islands in the game, one of them being heavily inspired by the Bahamas. (Note: this is from 2023, so keep that in mind) this is the first i'm hearing of this particular detail. neat.",
                "author": "soulreapermagnum"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon release date trailer leaked (5th March)",
        "score": 109,
        "text_content": "- Releasing on 5th March - Preorders opening and the deluxe edition gives you \"Midnight Decay bundle and more\" with two weapon skins - Voiceover in the trailer sounds like Ben Starr or Rahul Kohli almost Trailer: [https://streamable.com/b6u0um](https://streamable.com/b6u0um) HD look at the deluxe skin: https://ibb.co/602DyLy9",
        "comments": [
            {
                "raw_content": "Voice in the trailer is 100% Ben Starr since he is the voice in the gameplay trailer from April last year (I think he is the voice of the Durandal AI)",
                "author": "UrdnotShadow"
            },
            {
                "raw_content": "Sorry... But Pokopia...",
                "author": "Ok-Confusion-202"
            },
            {
                "raw_content": "It's Ben Starr. We've known since the cinematic trailer that he'll be the voice of Durandal, but the real question is, which Durandal is it? The one from the original trilogy or the one from this new timeline?",
                "author": "Midnight_M_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Stellar Blade 2 potentially to feature post=apocalyptic Chongqing as one of the locations (the mindbending '8D' Chinese city)",
        "score": 94,
        "text_content": "[https://i.imgur.com/33akHiG.png](https://i.imgur.com/33akHiG.png) [https://i.imgur.com/iRc5Yv8.png](https://i.imgur.com/iRc5Yv8.png) It's the [**Kiuxing Building**](https://www.youtube.com/watch?v=VkTeg6xEEho) on the left This time, the main filming location is likely the Yuzhong Peninsula. Not surprising given the large Chinese audience of the game. Let's see which spots will be included. Better not miss [**Bai Xiang Ju**](https://www.youtube.com/watch?v=wQyVMy6_n1k) and [**Hongya Cave**](https://www.youtube.com/shorts/fYzY38thtTE) or else.",
        "comments": [
            {
                "raw_content": "I actually enjoyed the story and gameplay. Music was pretty good too",
                "author": "Loud_Examination_138"
            },
            {
                "raw_content": "8D gives me early consoles bits vibes. 32 bits sure sounds cool. Just like 5D cinema. Yet nobody knows the meaning.",
                "author": "DarukoSooru"
            },
            {
                "raw_content": "Stellar blade might be one of my favorite 8/10 games Great creature design, very fun combat, lots of fun collectibles and exploration. The obvious downsides are the boring looking open world and the basic story but the rest is a an amazing action game",
                "author": "Stubbs3470"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon release date discovered on Xbox Store",
        "score": 175,
        "text_content": "https://www.reddit.com/r/Marathon/s/WDyNQqwfAv March 5th",
        "comments": [
            {
                "raw_content": "beta weekend Feb. 27th-March 1st then edit: nevermind it’s an “open preview weekend” before launch, so any weekend between now and then",
                "author": "chopsfps"
            },
            {
                "raw_content": "Lately I've been playing Arc Raiders and really enjoying it. I think I'll be giving Marathon a go. These extraction shooters are pretty fun, especially with friends.",
                "author": "Ok_Hospital4928"
            },
            {
                "raw_content": "No interest in the game but it will be a very interesting game to follow. It will either be successful or fail, i don't think it has margin to just be ok. This game will break some parts of the industry, for better and worse. This game will decide bungie's fate.",
                "author": "Saranshobe"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "We’re probably getting Black Flag by April, and Prince Of Persia later",
        "score": 59,
        "text_content": "According to Ubisoft’s last investors call, an unannounced title is due out by April. Which means either Black Flag OR Prince Of Persia is coming first quarter, not both. And while it very well could be Prince Of Persia, I doubt that game is big enough to move the needle for investors, or to end the fiscal year on a particularly high note. Eurogamer seems to think it’ll be Black Flag: [ https://www.eurogamer.net/long-rumoured-assassins-creed-black-flag-remake-could-set-sail-before-april ](https://www.eurogamer.net/long-rumoured-assassins-creed-black-flag-remake-could-set-sail-before-april) Couple all this with Ubisoft uploading Black Flag music to YouTube and there seems to be more movement with that IP than PoP.",
        "comments": [
            {
                "raw_content": "Prince of Persia isn’t unannounced. So technically both could happen.",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "I figure between sony and nintendos conference both games gotta get dates or at the very least release windows soon",
                "author": "Possible-Potato-4103"
            },
            {
                "raw_content": "If you actually read the article you’re linking to, you could see the unannounced title (Black Flag Resynced) is supposed to come out BEFORE April (the fiscal year ends March 31st), and the Prince of Persia remake is also scheduled to release in the fiscal year. Also, in the image that appears in the article the PoP remake is listed before the unannounced title, which seems to indicate it will release before that, as at least the first half of that list is ordered by release date, with Anno 117 releasing first on November 13, then the Mirage DLC on November 18, and Avatar’s DLC arriving in December.",
                "author": "Carwillat901"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PC market to shrink by up to high single digit percentage due to memory shortage in 2026;Nvidia-Intel partnership not for gaming but for server AI.",
        "score": 686,
        "text_content": "Source: [Full Nerd Network (PC World)](https://youtu.be/v7_D9UBh6rk?t=398) PC World interviewed a technology industry analyst and revealed some interesting points: 1. Nvidia and Intel are partnering up for server AI because customers want x86. This is bad for ARM because it takes away share that used to be maintained by Nvidia's ARM server CPU. 2. The partnership wasn't done for gaming because gaming and laptops are not Nvidia's priority and they already control laptop gaming through their discrete graphics. 3. Analyst heard that another reason for lack of interest in gaming products is the decline of PC market by up to high single digit percentage due to memory shortage in 2026. Chip manufacturers are less interested in launching new products for PC because that is a declining market in the short run. E.g. [Asus is going all in on AI.](https://videocardz.com/newz/asus-goes-all-in-ai-and-stops-new-smartphones-chairman-jonney-shih-confirms) Conclusion: PC market about to suffer decline. Do not expect Intel to launch products with big Nvidia integrated graphics for gaming. Manufacturers are all turning to AI to chase the money.",
        "comments": [
            {
                "raw_content": "Did anyone think Intel partnership was for gaming?? It was clearly an AI announcement from the start. Nvidia was not investing 5 billion into Intel for gaming",
                "author": "renhaoasuka"
            },
            {
                "raw_content": "Pop the bubble",
                "author": "nuttageyo"
            },
            {
                "raw_content": "When this bubble pops it’s going to be apocalyptic lmao",
                "author": "Both-Pack7114"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Leaked footage from Project Blackbird, a cancelled MMO from ZeniMax",
        "score": 227,
        "text_content": "[https://xcancel.com/eXtas1stv/status/2012971422679765352](https://xcancel.com/eXtas1stv/status/2012971422679765352)",
        "comments": [
            {
                "raw_content": "Looks like the original Prey 2 footage",
                "author": "Federal_Cook_6075"
            },
            {
                "raw_content": "It’s just an environmental showcase…. There’s no sense of gameplay, what we do as players. It’s pretty but I still don’t understand how this is able to mean the game would have been good lmao",
                "author": "swagomon"
            },
            {
                "raw_content": "That looks like “The Ascent”",
                "author": "Zombienerd300"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Procyon Studio is recording music for a unspecified project with Xenoblade series composers, Yasunori Mitsuda And Yoko Shimomura",
        "score": 217,
        "text_content": "[Source](https://www.reddit.com/r/Xenoblade_Chronicles/comments/1q9vgl7/im_sorry_if_this_was_mentioned_already_but/)",
        "comments": [
            {
                "raw_content": "For clarification here, Procyon is Yasunori Mitsuda's own studio, he's the founder and boss. And the linked post speculates that the scope of the recording sessions would be too big for the *Delicious in Dungeon* anime soundtrack, but season 1 of that anime actually had 78 tracks in its official soundtrack release, it's pretty huge. Procyon works on various projects in games and anime, so it's hard to say what this could be, but I would say most likely it's for *Delicious in Dungeon* season 2.",
                "author": "KalamariKnight"
            },
            {
                "raw_content": "Both composers are not affiliated with a game studio (Mitsuda is an employee of Procyon and Shimomura is at Brave Wave Productions), this means nothing in terms of Xenoblade",
                "author": "BomberBlur070"
            },
            {
                "raw_content": "I see Xenoblade, I click",
                "author": "ElkFeisty3823"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PassMark listing puts Intel Core Ultra 9 290HX Plus close to Core Ultra 9 285K",
        "score": 21,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS shows first look at new AMD 800-series Neo UEFI BIOS with HD redesign and 64MB ROM",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Challenge to the Lenovo Legion: XMG Core 16 VE (M25) gaming laptop review",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Outrageously priced for a 7840HS rebrand + 5060.",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Oooooh lord he comin'",
        "score": 1145,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What about 2008-2010?",
                "author": "UnfortunateUs"
            },
            {
                "raw_content": "Waiting for the realtors to chime in....",
                "author": "ComingInSideways"
            },
            {
                "raw_content": "How can you realistically quantify prospective buyers?",
                "author": "TheGongShow61"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Escrow payments rising nationwide with homeownership less attainable",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What did people expect? Houses going up in value is a Negative, not positive. You're not richer. When you sell your house, and turn around, the same house costs the exactly as the house you sold, but the taxes and fees are paid off of the higher number. Escrow fees will go up. USA was always setup as a trap. Fiat money losing value over time due to 2% per year. Chasing \"assets\" THEY sell to you is an engineered modern day slavery. Only thing that ever worked in America was to be in Mafia, or a criminal, or hide somewhere in a rural area with lots of land, no mortgage, no credit cards, no consumption, no idiotic college, no legal wife. Everything else was always a misery.",
                "author": "aw33com"
            },
            {
                "raw_content": "WTF? Escrow is a service that makes payments on your behalf so you dont have to remember to do it yourself. Weve been complaining about taxes and insurance going up so this in another way of complaining about the same thing but getting more clicks to your website.",
                "author": "Topseykretts88"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Share of U.S. Homeowners With Mortgage Rates Above 6% Continues to Rise - Outstanding Mortgages by Interest Rate in the U.S.",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well yes, everyone who moves home is going to move to a higher rate.",
                "author": "True_Grocery_3315"
            },
            {
                "raw_content": "InsuranceDimes.com = AI SLOP",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I mean, duh? If that's the prevailing rate then there's no way for anything else to happen. It still stands that 40% of homeowners have no mortgage. 50% or the remaining homeowners who have a mortgage (which translates to 30% of all homeowners) have a rate of less than 4%. So that makes 70% of homeowners who either have no mortgage or a mortgage of less than 4%.",
                "author": "Quixlequaxle"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Multifamily Rents Finish Flat in 2025",
        "score": 4,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Flat if you ignore the 3 months free rent",
                "author": "Beginning_Abrocoma86"
            },
            {
                "raw_content": "KEY TAKEAWAYS: - Multifamily rents ended 2025 unchanged from the start of the year, with December rents falling $5 to $1,737 nationally. - The Midwest and select coastal markets outperformed, while Sun Belt metros posted the weakest rent growth due to excess supply. - National occupancy rates held steady at 94.6% in November, as retention strategies offset softening demand. - Single-family build-to-rent rents recorded the sharpest year-over-year drop in over a decade, falling 1.0% in December. Flat Performance as 2025 Closes The US multifamily sector ended 2025 with advertised rents back to where they began the year, closing at $1,737 per unit in December according to Yardi Matrix. The fourth quarter saw a notable downturn, with national rents dropping 0.9% quarter-over-quarter—marking the sector’s weakest showing since the global financial crisis. National year-over-year rent growth fell to 0.0%. Market disparities persisted, with the Midwest and coastal gateway cities seeing modest growth, while Sun Belt markets led declines. Noteworthy growth occurred in New York (5.8% YoY), Chicago (3.6%), and the Twin Cities (3.2%), while Austin (-5.2%), Phoenix (-4.1%), and Denver (-3.9%) posted the largest declines. Occupancy Holds Despite Rent Headwinds Despite soft rent growth, multifamily occupancy rates remained stable at 94.6% nationally in November, virtually unchanged year-over-year. Renter retention strategies and fewer renters transitioning to homeownership helped cushion occupancy. Lifestyle occupancy ticked up 0.2% while Renter-by-Necessity occupancy dipped 0.2%, reflecting divergent renter price sensitivity. Midwestern markets, in particular, helped buoy national occupancy performance, continuing to show relative strength even as other regions softened. Owners continued to use lower renewal hikes and concessions throughout 2025 as demand moderated and rent growth normalized after 2021–2022’s historic 22% surge. Regional Shifts and Supply Pressure Strong Midwest and coastal metros contrasted sharply with Sun Belt markets, which absorbed large new deliveries. Only six of the thirty largest metros recorded positive month-over-month rent growth in December, mostly in the Midwest. Affordability and restrained supply were key supports for these outperforming regions, while the Sun Belt remained soft as new supply outpaced demand. Multifamily Transaction Activity and Cap Rates Multifamily sales volume edged up in 2025 to $83.2B, led by Dallas, Seattle, Phoenix, and Miami. Despite high growth in secondary markets, investors continue paying the lowest cap rates for gateway assets—San Francisco’s South Bay (3.8%) and Manhattan (4.1%) among them—highlighting sustained appetite for prime-market multifamily. Cap rates remain tight against mortgage rates, underscoring intense competition and ample capital seeking multifamily exposure. Single-Family Rental Segment Trends Single-family build-to-rent (BTR) properties saw national advertised rents fall 1.0% year-over-year to $2,180 in December—the lowest growth rate in a decade. Occupancy, though, held firm at 94.9% driven by stalled homebuying activity. BTR operators moderated rent increases to keep occupancy steady, especially in markets with new inventory pressure. Outlook for Multifamily in 2026 Looking ahead, modest rent growth is expected in 2026 as economic stability returns and GDP growth strengthens. Ongoing supply challenges in some metros and affordability constraints in gateway regions will remain key factors shaping multifamily rent performance over the coming year. Multifamily operators are likely to keep prioritizing retention and competitiveness amid ongoing market normalization.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ben Affleck casually predicting Spotify and Netflix in a 2003 interview. Nearly spot on about subscription economics, the rise of online streaming, and how Napster paved the way.",
        "score": 797,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You hear interviews from him and Matt when they were younger and it's clear how they were able to write Good Will Hunting and organize it into production. They are wicked smart",
                "author": "StuckInMotionInc"
            },
            {
                "raw_content": "He was the singularity all along 🤖",
                "author": "Late_Supermarket_"
            },
            {
                "raw_content": "You're nuts... Napster after being legally treated launched its subscription service in 2003 (that same year). Before Spotify, Spotify came in 2006.",
                "author": "Distinct-Question-16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Aged like fine wine",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wasn’t Dune set in a world after a massive AI war? To the point where they no longer trust computers.",
                "author": "fluffywabbit88"
            },
            {
                "raw_content": "You misspelled “The Duke”",
                "author": "axiomaticdistortion"
            },
            {
                "raw_content": "Real life dune is playing out for sure, but this isn't quite it tho.",
                "author": "Zathras_Knew_2260"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SpaceX now operates the largest satellite constellation in Earth orbit",
        "score": 536,
        "text_content": "**Starlink today:** • ~65–70% of all **active** satellites around Earth and 9,500+ active satellites in orbit, 8,500+ fully operational, delivering real broadband worldwide. • **Speeds:** 200–400 Mbps typical with ~30 ms latency. **Tonight:** Falcon 9 adds 29 more satellites. Feels like a start as the FCC **approved** 7,500 additional Gen2 satellites, bringing the total to 15,000. This means better global coverage, higher speeds **and** support for direct-to-cell connectivity. From remote villages to oceans and skies, Starlink is **reshaping** global connectivity at a scale never seen before. **Source: SpaceX** [SpaceX Tracker Tweet](https://x.com/i/status/2012940344745513165)",
        "comments": [
            {
                "raw_content": "This graphic doesn't show the Starlink constellation. Starlink operates in a low orbit.",
                "author": "Calm_List3479"
            },
            {
                "raw_content": "Now? Did this happen today? What is the next biggest constelation?",
                "author": "Economy-Fee5830"
            },
            {
                "raw_content": "Oh they've been operating the largest constellation for years, their constellation is just getting bigger with every launch.",
                "author": "Choice_Isopod5177"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "41 data center projects have been cancelled in the past 6 weeks alone, up from 15 from June to November 2025",
        "score": 82,
        "text_content": "How will this impact AI development? source: [https://x.com/DonMiami3/status/2012761147137528101?s=20](https://x.com/DonMiami3/status/2012761147137528101?s=20)",
        "comments": [
            {
                "raw_content": "\"And postponements.\" This just means the supply chains can't handle the demand. And most of that isn't what you think (RAM and GPUs); it's actually transformers, switches, and other basic infrastructure components and materials.",
                "author": "Karegohan_and_Kameha"
            },
            {
                "raw_content": "I would be cautious about over-interpreting this Just like the \"AI layoffs\" -- which can have reasons other than AI (like companies wanting a layoff to sound better on paper) -- these data center postponements could also include things like not enough grid power / materials available In other words there could still be a lot of plans and demand for data centers and AGI isn't cancelled, it's just not being met by current supply",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "Clearly this graph is exponential and we'll see 1000 data center cancellations per month soon",
                "author": "Vortrox"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Cursor AI CEO shares GPT 5.2 agents building a 3M+ lines web browser in a week",
        "score": 717,
        "text_content": "**Cursor AI CEO** Michael Truell shared a clip showing GPT 5.2 powered multi agent systems building a full web browser in about a week. The run **produced** over 3 million lines of code including a custom rendering engine and JavaScript VM. The **project** is experimental and not production ready but demonstrates how far autonomous coding agents can scale when run continuously. The **visualization** shows agents coordinating and evolving the codebase in real time. **Source: Michael X** [Tweet](https://x.com/i/status/2012825801381580880)",
        "comments": [
            {
                "raw_content": "wouldn't a video of the actual browser be better?",
                "author": "Valnar"
            },
            {
                "raw_content": "this animation is cooler than the browser feat 😝😝",
                "author": "MohMayaTyagi"
            },
            {
                "raw_content": "If you want similar animations from your git repos this uses gource quite a fun tool https://medium.com/the-bug-shots/visualizing-your-git-repository-history-with-gource-b4702a86fa3d",
                "author": "homezlice"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI now reports annualized revenue of over $20 billion",
        "score": 231,
        "text_content": "",
        "comments": [
            {
                "raw_content": "From Epoch https://x.com/i/status/1978877320283984214 Given about 5 months since August, it appears they are perfectly on track with the revenue growth since the end of 2023. Tripling every year. Edit: Some more analysis by Epoch https://x.com/i/status/1978496866624176507",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "And how much are the expenses?",
                "author": "BarisSayit"
            },
            {
                "raw_content": "20B in revenue and they need ads so that they aren't losing as much money.",
                "author": "YakFull8300"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI launches its own translate website",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "laziest openai app so far - i think they started vibe coding internally edit - the code comments arent even in spanish! https://preview.redd.it/ijcaty2hh7eg1.png?width=2366&format=png&auto=webp&s=cab943c376de8d53be0e2ab6cb95b7900ffc1787",
                "author": "a300a300"
            },
            {
                "raw_content": "Yeah, they are now competing with 1 person startups.",
                "author": "__Maximum__"
            },
            {
                "raw_content": "Waiting for OAI bidet.",
                "author": "Informal-Fig-7116"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anyone else feel like this is the only place that gives your life hope and meaning.",
        "score": 40,
        "text_content": "The progress with AI and robotics are literally the only thing that keep me going everyday.",
        "comments": [
            {
                "raw_content": "I mean, hoping for an awesome future is definitely one of the big things that keeps me going! If I didn’t believe things would improve, the world would be a very depressing place.",
                "author": "Sams_Antics"
            },
            {
                "raw_content": "Yes. I pretty much quit all other social media and mostly just read on a few subreddits, x, and listen to podcasts. I’m wondering if maybe it’s an unhealthy obsession or if I’m just replacing my old dopamine addiction with a new one",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "I feel similarly to you, yes. The status quo right now is sick and not sustainable. I’m hoping AI shakes things up.",
                "author": "BrennusSokol"
            }
        ],
        "subreddit": "singularity"
    }
]