[
    {
        "post_name": "Gov. Walz' free school lunch program expose halted due to arson at investigators offices.",
        "score": 773,
        "text_content": "",
        "comments": [
            {
                "raw_content": "walz turning out to be an obvious gotham villain",
                "author": "Covidrrhea"
            },
            {
                "raw_content": "People are thrown off from insane mafia style corruption by a folkies guy who acts kind of dumb.",
                "author": "footinmouth"
            },
            {
                "raw_content": "This is why leftists are so supportive of “free” school lunches and breakfasts. It’s all a massive scam to steal tax dollars. Nobody in America can’t afford to feed their kids, it’s a total lie.",
                "author": "WheresMyStimmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "2025 WILL FOREVER BE THE YEAR TRUMP TOOK AMERICA'S BORDERS BACK!!! MAGA 💯",
        "score": 663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It will only be remembered as such if the next election isn’t stolen and the next usurper president undoes everything President Trump has achieved. 3 years of 8 remain.",
                "author": "Wexit-Delecto"
            },
            {
                "raw_content": "Thank you PRESIDENT TRUMP for saving America from the radical left lunatic democrats! Boarders secure ✅️ lower taxes ✅️ tariffs ✅️ and 12 ended wars ✅️. TRUMP is Making America Great Again!",
                "author": "Robert_Finewell-TN"
            },
            {
                "raw_content": "Time to liberate Minnesota from Somalian and muslim scum",
                "author": "Cyber1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Governor Gavin Newsom : As families come together to light the kinara, Jen and I wish all those celebrating a joyful Kwanzaa. May the seven principles of Kwanzaa, in particular community, purpose, and unity, guide our way toward a better future.",
        "score": 184,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You never see Kwanzaa decorations because they can't be stolen from white people.",
                "author": "FuzzAldrin"
            },
            {
                "raw_content": "Wasn’t Kwanzaa invented by a black guy who kidnapped and beat a woman with an electrical cord?",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "The seven principles of Kwanzaa: 1. Get two girlfriends. 2. Order them to remove their clothes. 3. Whip them with an electrical cord and karate baton. 4. Place a hot soldering iron in their mouths and on their faces. 5. Tighten one of their big toes in a vise. 6. Put detergent and running water hoses in their mouths. 7. Bonk them on the head with toasters. https://en.wikipedia.org/wiki/Maulana_Karenga",
                "author": "wisconsingunner"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "No, no, no, no, no, no...",
        "score": 1199,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He truly is the greatest journalist we have right now with O'keefe of course.",
                "author": "Treatt"
            },
            {
                "raw_content": "The media is the propaganda arm of the democrat party. They cover for all of their crimes. They should be shut down.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Link https://x.com/C_3C_3/status/2004687768635801741?s=20",
                "author": "I-am-Orlando"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI permanently closing HQ at J. Edgar Hoover Building, Kash Patel announces",
        "score": 580,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So he's moving all the deep staters to a more modern, nicer building, with no firings?",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "We only need the first three words here: FBI PERMANENTLY CLOSING",
                "author": "C00gsHouse281"
            },
            {
                "raw_content": "# They're going to find so many bugs planted by our \"allies\" when it's demolished.",
                "author": "redditadminssuckit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "IT'S OFFICIAL: A jaw-dropping 40% PERCENT of deep-blue Baltimore city high schools have ZERO students who are proficient in math.",
        "score": 1011,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The students surely would get mad if only they knew what those numbers meant.",
                "author": "FromTheTopRope"
            },
            {
                "raw_content": "They aren't schools, they're zoos. And I doubt the ones they're saying have no math proficiency actually have no proficiency. Just ask them what a kilo is.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "what is the racial makeup of the student body?",
                "author": "Above_Reproach"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It's been exposed Minnesota doesn't even require SITE VISITS for the Somali organizations defrauding taxpayers to the tune of BILLIONS of dollars",
        "score": 937,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The American people want something done about this.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Link https://x.com/EricLDaugh/status/2004713182405775452?s=20",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Shocking! Said absolutely no one here.",
                "author": "DrBJTester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats are not well",
        "score": 584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They never mentioned that the guy that created this said Jesus was a psychotic & Christianity is a white man's religion and then he was prosecuted after he kidnapped and tortured two women. Kwanzaa doesn't sound like anything to be happy about. It sounds like it a holiday for racist, anti-Christian, and misogynists.",
                "author": "Nipplebuddy"
            },
            {
                "raw_content": "Kwanzaa seems like the African version of Hanukkah. The first thing I thought of when I saw the \"kinara\" was, \"Oh. That's just a menorah.\"",
                "author": "Appeal2Heaven98"
            },
            {
                "raw_content": "Wasn’t this Kwanzaa thing a product of a satanic Black Panther dude?",
                "author": "Easzq8"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Apocalyptic Shortage That Never Happened: Democrats' Tariff Doomsday Narrative Imploded",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you haven’t figured it out, the tax and retirement schemes are all very elaborate traps to make sure you work until you can’t and then take it all away due to medical debts. Owning capital or real estate is the only escape from this rat trap. People are always shocked to find out what all deductions business owners get and how they pay very little. Our entire society is geared around the making of money from money and not labor. This is in the Bible and it’s sinful.",
                "author": "Viewer01"
            },
            {
                "raw_content": "jokes on you if you take a person that looks and dresses like the thumbnail or article insert seriously.",
                "author": "Above_Reproach"
            },
            {
                "raw_content": "I was told by NPR and CNN that I would have to fight someone to the death in a Kumite Blood Sport competition to get a Paw Patrol Mighty Pups Lookout Tower.",
                "author": "footinmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New York City 2026",
        "score": 688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't the palisades fire also happen under a lesbian fire chief?",
                "author": "Tyscribz"
            },
            {
                "raw_content": "Makes no sense these dykes want to look and act like the men they hate.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "fire_girl_meme.jpg",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Merry Christmas!",
        "score": 499,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love Nativity scenes that include a chicken.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "It’s still Christmas until Monday morning! 🎄⛄️❄️",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "I, said the donkey shaggy and brown I carried his mother To Bethlehem town I carried his mother uphill and down I, said the donkey, Shaggy and brown.",
                "author": "semblanceofsanity"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NY Judge Blocks Deportation of UK Censorship NGO Chief Who Tried to Blacklist Breitbart",
        "score": 683,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish we'd known being a judge mattered more in 2016. Truth.",
                "author": "Welfare_Warmongers"
            },
            {
                "raw_content": "\"Imran Ahmed\" is not a UK anything. He is a fucking invader, whether he is in the United States or in Europe. The only place he belongs is in Imranahmedland.",
                "author": "RootLevelPrivilege"
            },
            {
                "raw_content": "Deport the judge too",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Now 1,000,000 more pages on Epstein are found.... Release all of their names, embarrass them, and get back to helping our Country!",
        "score": 811,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire Pam plz Mr President.",
                "author": "Agent_86"
            },
            {
                "raw_content": "Man, he's out of touch with his base. The release of the Epstein files was intended to start to eliminate a multi-tier justice system having a protected political power class. If not by judicial process, via court of public opinion. I'm not sure why he had to make it about himself in the first place :|",
                "author": "mandarb916"
            },
            {
                "raw_content": "Almost like the actual base always backed this, before it was just a 'democrat inspired hoax' and doesn't give two shits who it exposes as pedos, even if they are large donors or GOP adjacent.",
                "author": "Above_Reproach"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A grand jury refused to indict Jacob Lee Bard over a December 9, 2025, shooting on the Kentucky State University campus, which resulted in one person dead and another person injured.",
        "score": 602,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you can find a more detailed report, read it. The grand jury ruled the father was justified in order to save the life of his son. Sounds like it was gang violence and the family was moving their sons away from the school.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": ">Nineteen-year-old De’Jon Fox of Indianapolis was killed in the incident. Joggers shouldn't jog in Kentucky. Breitbart did a piss poor job on this article. Edit: This story is still developing. The parents of the punk that got blasted were just arrested for trying to stir up the mob against the father. https://www.wdrb.com/news/parents-of-student-killed-in-shooting-at-kentucky-state-university-arrested-for-intimidation/article_0c1dda99-8edf-429e-9bb8-360672810ba2.html >Bard and his wife were at KSU to move their two sons back home over safety concerns. >Frankfort Police said security was escorting the family into the dorm when another group attacked them, and it moved outside, which is where the shooting happened. >The statement from Bard's lawyers claims there were 20 to 30 people in the group and a majority were not students at the school and wore ski masks, hoods and other clothing to hide their faces. >Bard reportedly noticed the mob forming and armed himself with his wife's gun, but once his family reached the entrance of the dorm, the mob attacked, the statement from his lawyers said. >Danks and Danks said Bard's son had his dorm room burglarized on Oct. 11 by a group that pulled a fire alarm and used fire extinguishers to disable security cameras. When he reported the incident to the resident assistant, the attorneys said Bard's son began receiving threats. >Bard's lawyers said that three days before the shooting at KSU, the same son and his three friends were assaulted by 15 to 20 people. They also claim the son was attacked with baseball bats and weapons in his dorm room by 20-30 people the day before the shooting. Given all of this this sounds like the jury did its job and protected the accused from government bullshit considering that all of this stemmed from the father's sons telling the campus police who pulled the dorm fire alarm to clear the building out so the mob could loot it. This is straight up gang retaliation and the DA that charged the farther is an unflushable turd.",
                "author": "CLF3"
            },
            {
                "raw_content": "> he was justified in shooting two people who were beating his son. Good kill",
                "author": "TheRedPike"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mamdani's new lesbian FDNY fire chief never worked as a firefighter",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to bet against the insurance carriers.",
                "author": "chicagoindustrial"
            },
            {
                "raw_content": "Remember what a disaster california was with lesbians in charge? Just deport this foreign election thief and punish the cheaters. Then this stupid, destructive shit will stop.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Going as planned. Fill these high positions with DEI to cause chaos.",
                "author": "PeaceMakerDJT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House Press Sec Karoline Leavitt Expecting Baby Girl in May",
        "score": 1030,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah now watch some leftist loon kick her in the stomach on the street.",
                "author": "CLF3"
            },
            {
                "raw_content": "Don't worry, I'm sure her replacement will also be a woman, for reasons nobody can quite explain.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "It's mine.",
                "author": "Emodius"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Property taxes",
        "score": 1573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Property taxes in blue hellholes like New Jersey and Illinois are absolutely insane and they're only going to get worse with their massively underfunded public pensions.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "You can't own a home in America, you can only lease them from the government and yes, that's extremely fucked up.",
                "author": "LokiHelmsdeep"
            },
            {
                "raw_content": "The only true non-profit is the primary homestead where you thrive and rest.",
                "author": "WakeUpPlease"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@TheBabylonBee: Check out these amazing features on the new Trump-class battleship...",
        "score": 965,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That Gaydar will become unbearable anywhere near EU shores",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "I think the flux capacitor will give this ship a clear advantage...",
                "author": "KungPaoMcChicken"
            },
            {
                "raw_content": "But where's the Covfefe dispenser?",
                "author": "briantrash"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "If you're an actual American, democrats hate you.",
        "score": 1489,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate to break it to you people, but it isn't just the democrats who hate us. Republicans only say they like us, but you need to judge them by what they do, not what they say. In this respect, I can appreciate the dems. They tell us they hate us so I know they are the enemy. The republicans tell us they are our friends but then stab us in the back and talk shit about us behind closed doors. Both parties hate America and Americans.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "Meanwhile, my friend who was born here, is a White man, and was disabled when a car accident crunched up his spine doesn't qualify for SNAP.",
                "author": "TwoArizonaPedes"
            },
            {
                "raw_content": "Of Course They Do...It's All About The Benjamins!",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The quickest and most efficient way to deport 15 million people is to simply debank them...",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hard to pick out individuals. Now eliminating welfare in its entirety would have a similar effect .....",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "Takeover their shitty countries, privatise their assets and promise a share to anyone who returns. Boom. Homegrown UBI.",
                "author": "Welfare_Warmongers"
            },
            {
                "raw_content": "Our gov't only debanks conservatives.",
                "author": "residue69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[Gamers Nexus] It's An Active Choice to Lie This Much | Micron's \"Commitment\" to Gamers",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't fully blame the RAM manufacturers. I blame corporations making up fantasy amounts of money and then throwing them at real products that they might not even need because they got to invest in *something* to keep the wheel turning. And normal consumers simply can't compete with the insane amount of made up corporate AI money.",
                "author": "Sudden-Grape3467"
            },
            {
                "raw_content": "You know what, this long-haired bearded fellow is right. Those gamers should absolutely stand together and boycott Microns consumer memory products, that'll show them. Wait.",
                "author": "GhostsinGlass"
            },
            {
                "raw_content": "If there are no affordable RAM who is going to buy CPU'S? Or GPU'S? Or MOBO'S? Even the power supply? I know about the big tech thing, but how there are not a balance over the declining sales?",
                "author": "milyuno2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AI Reportedly to Consume 20% of Global DRAM Wafer Capacity in 2026, HBM and GDDR7 Lead Demand",
        "score": 291,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interestingly the article notes HBM uses 4x the production resources of standard RAM, and GDDR7 uses 1.7x, which has actually driven Samsung to reallocate some HBM production lines back to regular DRAM.",
                "author": "StarbeamII"
            },
            {
                "raw_content": "The shittiest part of it is that those degenerates don't even need that RAM, since they don't have enough capacity to use them in the first place. It's a fucking hoarding.",
                "author": "Aggravating-Dot132"
            },
            {
                "raw_content": "Are there any sectors that actually use LLMs to make money?",
                "author": "nailgardener"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "No, Asus isn't going into memory manufacturing — Taiwanese tech giant issues statement smashing rumor",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What if we ask really nicely?",
                "author": "Choreboy"
            },
            {
                "raw_content": "Hello imaginary_num6er! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Taiwan spent a lot bailing out its memory makers during the last crash.",
                "author": "ahfoo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD RDNA5 rumored to launch in mid-2027",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will it come with vram",
                "author": "loozerr"
            },
            {
                "raw_content": "I thought this was gonna be UDNA, not RDNA5.",
                "author": "SEI_JAKU"
            },
            {
                "raw_content": "Makes sense why sony want release ps6 in the end 2027,iirc rdna2 released in fall 2020 as ps5",
                "author": "quiteman999"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Korean news] Huawei Korea: \"We will launch AI chips in Korea next year…Nvidia is not the only option.\"",
        "score": 64,
        "text_content": "Huawei is set to intensify its expansion into the Korean market by introducing its latest AI chip, 'Ascend,' domestically next year. Balian Wang, CEO of Huawei Korea, stated at the 'Huawei Day 2025' press conference held at The Plaza Hotel in Jung-gu, Seoul, on the 26th, \"Huawei Korea plans to officially launch AI computing cards and AI data center-related solutions next year,\" adding, \"We intend to provide Korean companies with a second option besides Nvidia.\" The chip to be released is expected to be the latest AI chip, the 'Ascend 950.' CEO Wang remarked, \"Unlike Nvidia, we plan to sell in cluster units rather than selling chips individually,\" adding, \"Huawei's strategy is not simply providing AI cards and AI servers, but accelerating industrial applications.\" To this end, the company plans to secure competitiveness by providing 'End-to-End' (E2E) solutions that encompass infrastructure hardware, such as networks and storage, as well as software. CEO Wang added, \"In this case, partner companies (for supply and sales) might not be necessary,\" noting, \"We will formulate a strategy so that Huawei can directly integrate and provide services.\" It is reported that Huawei Korea is currently in discussions with companies regarding potential supply agreements. Furthermore, Huawei Korea plans to supply its self-developed open-source operating system (OS), 'Harmony,' to domestic companies next year to promote the creation of an ecosystem. CEO Wang explained, \"Ownership of Harmony no longer belongs to Huawei, and open-source related organizations are now responsible for its operation and upgrades,\" adding, \"It can be utilized not only in smartphones but also in various smart home devices.\" However, he stated that there are no plans to launch smartphones in Korea next year.",
        "comments": [
            {
                "raw_content": "I have the impression that the translation (maybe even the quotation) of the HarmonyOS part is confusing. But if HarmonyOS becomes open source, or at least source available, it would be a very interesting thing as it is basically the only competitive OS released since maybe Android, and it has some technically very interesting design aspects.",
                "author": "EloquentPinguin"
            },
            {
                "raw_content": "again, again, again, again, the problem is not the hardware existing or not, the problem is that Nvidia has 10+ years, decade+ of software stack development, and NOBODY so far has bothered to challenge that, they all try to make some sort of a compatibility layer or something and it all doesn't work as well. the industry is too lazy to start a new stack and put the resources into it to challenge Nvidia. you wont dethrone or put a dent in Nvidia as long as you make an alternative to CUDA stack, there is plenty of hardware out there that theoratically is very good, the software is nowhere tho",
                "author": "Quatro_Leches"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron Reveals Three Culprits Behind Memory Crunch—and Why It Won’t Ease Soon",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DR: - Data Center Surge Drives Memory Crunch: To begin with, Micron said that customers’ accelerating AI data center build-outs over recent months have sharply boosted demand forecasts for memory and storage. The trend was also evident in Micron’s latest earnings. CNBC reported CEO Sanjay Mehrotra saying that server unit shipments grew in the “high teens” in 2025. Meanwhile, Micron posted $5.28 billion in cloud memory sales, more than doubling year over year. - HBM Demand Surges, Micron Warns of DDR5 Resource Bottleneck: Micron also notes a crucial fact: the dramatic increase in HBM demand is further challenging the supply environment due to the 3-to-1 trade ratio with DDR5, and this trade ratio only increases with future generations of HBM. - Cleanroom Constraints: Micron also highlights a key factor behind tight memory supply: while additional cleanroom space is essential to meet soaring demand, construction lead times are stretching longer across regions. There are a few more interesting details/numbers in there",
                "author": "Balance-"
            },
            {
                "raw_content": ">Micron also notes a crucial fact",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "I am still happy with my current Ryzen based system but do hope that memory prices eventually come down by the time I decide to upgrade from my current build. The last near decade has been tragic for enthusiasts and amateurs alike with constant surges in various product category pricing.",
                "author": "U3011"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LG Unveils UltraGear evo lineup, including 27” 5K miniLED and 39” 5K2K",
        "score": 99,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That 5k Mini-LED with more zones sounds really good, especially due to the 1440p dual mode. High resolution for work, medium resolution for games, would be perfect for my usage. Doesn't seem to say the panel type, but TFTCentral seems to speculate that it's IPS, which also sounds good because I don't like black smearing and perhaps the >2k zones are good enough to alleviate the IPS typical blooming.",
                "author": "Fusifufu"
            },
            {
                "raw_content": "Said it before and I'll say it again: I am so happy to see high-refresh 5K+ panels finally being pushed. I won't be getting one until they reach 240Hz, but I don't think I'll be having to wait too much longer for that. They damn well better come with DP2.1 UHBR20 or HDMI 2.2, though.",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "That 5K miniLED looks like an indicator to Apple Studio Display 2",
                "author": "bazhvn"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Core Ultra 9 285H offers almost no benefits over the Core Ultra 7 255H",
        "score": 175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What do you expect from an identical core configuration that has the same maximum turbo power limit but is clocked slightly higher?",
                "author": "EJ19876"
            },
            {
                "raw_content": "Yeah, the difference is more in marketing - 285H often goes into more premium laptops with higher power/thermal budget, and therefore seems more performant, and 255H would perform practically the same when it ends up in similar chassis.",
                "author": "Shadow647"
            },
            {
                "raw_content": "TLDR: \"Now that we've tested at least two dozen individual laptops sporting the CPUs, we can safely show that opting for the Core Ultra 9 285H would hardly be worth the extra investment in most cases. The comparison graph below shows that the average laptop with the **Core Ultra 9 285H is only 6 percent faster than the average laptop with the Core Ultra 9 255H**.\"",
                "author": "Antonis_32"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Honor Win and Win RT go official with 10,000mAh battery, active cooling fan",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The company also confirmed IP69K rating for excellent dust and water resistance, **despite the extra aperture for the fan.** \\^\\^ That is pretty impressive, even after the nearly 40 WHr battery in a smartphone weighing 229g.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Thought the title was talking about windows runtime...",
                "author": "NotFixingYourPCAgain"
            },
            {
                "raw_content": "How does this compare to laptop batteries, anyone able to eli5",
                "author": "theregoesmyfutur"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "What on Earth is happening with the Switch 2 predictive text???",
        "score": 1445,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah I was searching for “Megaman 9” and it predicted “9/11 was an inside job”????",
                "author": "suentendo"
            },
            {
                "raw_content": "Yes, I know that words and phrases you’ve typed before come up in the predictive text. It should also go without saying that I have never typed this phrase on my Switch 2, or ever in my life. Edit: can someone else with a Switch 2 see if this is on your console too? Go to any place that lets you enter text - easiest way is either by editing a screenshot and entering text or just searching on the eShop. You may have to go to the second “tab” of suggestions. Please let me know what autocompletes just by typing “x”",
                "author": "NinBendo1"
            },
            {
                "raw_content": "![gif](giphy|iOm1xOSfAtPzmPXJqH)",
                "author": "skag_boy87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Screw it, I'm painting my joycons green",
        "score": 163,
        "text_content": "I disassembled my Joy-Con 2's and spray painted all the coloured accents green. I've been using them like this for a few months and the paint's been holding up really well. It still snaps into the Switch 2 and the grip perfectly. This can absolutely be made to look nicer, I was impatient and didn't give the paint enough days to harden before using it so it looks a bit smushed in places. Some general tips if you want to also attempt this: * Be super careful when taking apart the joy-cons. They're full of tiny parts that will vanish if you don't keep track of them (oh god the springs). * Sand down surfaces really well. Paint adds thickness and these joy-cons already have really tight tolerances. * Be patient. Apply many thin layers of paint instead of a few thick and wet layers. Also let the paint harden for about a week before reassembling and using them in your switch. * Don't bother painting the straps. They are really tight-fitting and will remove the paint from your joy-cons unless you sand down the plastic heaps and trim the little nub on the inside. * This will definitely void your warranty (maybe do this on a second pair? I didn't lol). Feel free to ask any questions, I'd be happy to answer them since I wanted to keep this post short.",
        "comments": [
            {
                "raw_content": "I feel obligated to bring this up, granted this isn't a switch cartridge. [https://www.thegamer.com/donkey-kong-bananza-card-sprayed-yellow-breaks-nintendo-switch-2/](https://www.thegamer.com/donkey-kong-bananza-card-sprayed-yellow-breaks-nintendo-switch-2/)",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "You did a good job 👍",
                "author": "demoicfireenergy"
            },
            {
                "raw_content": "Dude that looks sick I want official colors wtf are they doing",
                "author": "RickyWinterborn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "MKW in a nutshell",
        "score": 1178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The game does a pretty poor job of teaching you how to do the things on the left. I don't blame all the players who will never even get close to that.",
                "author": "gundabad"
            },
            {
                "raw_content": "Yeah there is a big skill gap, these two players would say the reverse if the skill gap was small.",
                "author": "Zebra500mcg"
            },
            {
                "raw_content": "World is great it's just that the small issues that it has adds up, and the 80 dollar price tag made people look into it with a bigger critical eye",
                "author": "TyleNightwisp"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Guys, I think I found my new favorite console",
        "score": 440,
        "text_content": "Back in the summer, the switch two launched and in December I finally got one",
        "comments": [
            {
                "raw_content": "If i notice even a spec of dirt in my nail ill delete a photo and redo it. Idk how yall take these nasty pictures and see nothing wrong lol",
                "author": "No-Difference8545"
            },
            {
                "raw_content": "That poor switch 2 is about to live a rough life",
                "author": "DredgenGrey"
            },
            {
                "raw_content": "the more i look at the keyboard, the more odd it gets",
                "author": "Unfair-Translator394"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The size of Nintendo Switch 2 box compared to the OG Switch Box.",
        "score": 108,
        "text_content": "Switch 1 box is so massive for a console smaller than its successor.",
        "comments": [
            {
                "raw_content": "The OLED box is closer to the Switch 2 box. https://preview.redd.it/ldg7zch91p9g1.png?width=1500&format=png&auto=webp&s=f7eccaf730a6aca18aacdf3c86585ef60a1459d9",
                "author": "JetstreamGW"
            },
            {
                "raw_content": "The switch 2 packaging is really quite impressive in its efficiency. Everything nests together beautifully. I actually pointed it out to my wife. The joycons are staggered in a way that the deeper shoulders dip down into voids in the lower level, and the grip controller is set at an angle to fit around everything. They put a ton of thought into that box design.",
                "author": "Goodleboodle"
            },
            {
                "raw_content": "This is because the original Switch box had all hardware layed out horizontallly aka layers. The Switch was on the right and the controllers / dock were on the left. With the Switch 2 the console / controllers are on top (left) and the remainder of the contents are layered underneath which means the box is more square instead of rectangular. The contents were spread out more in the original - Switch 2 box is more condensed despite a larger device. This would also have an impact on shipping overseas as all products are shipped based on weight not volume, so per pallet the shipping would be cheaper as the physical box / packaging is smaller -more boxes per pallet. Not to mention this means less cardboard used per box as well and Nintendo can get more boxes from the same amount of cardboard as less is used per box.",
                "author": "AussieAmazeBalls"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My cousin got a Switch 2 for Christmas. Now we are both having a blast on Sparking Zero.",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who trying to play online",
                "author": "Marcqui_Blvck"
            },
            {
                "raw_content": "Just sent mane",
                "author": "Marcqui_Blvck"
            },
            {
                "raw_content": "This looks awesome. I've been wanting to try a Dragonball game but I'm not sure where to start.",
                "author": "Battery6030"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Either broke my eshop or they really want me to buy this game",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s like… spreading mold",
                "author": "The_Pepper_Oni"
            },
            {
                "raw_content": "I think their begging buy it",
                "author": "Technical_Device2513"
            },
            {
                "raw_content": "It might be on sale not sure Not even signs",
                "author": "jrpbateman"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "GameStop B2G1 free on preowned games for Pro members.",
        "score": 97,
        "text_content": "Glad I waited. Titles to add to my collection. Have an amazing holiday!",
        "comments": [
            {
                "raw_content": "$65 for a used game is fucking insane.",
                "author": "lubeinatube"
            },
            {
                "raw_content": "If someone can check, I don’t know if you’re required to have a Pro Membership for this deal. I know sometimes it is required but after reading the disclaimer, this one could be available to everyone. Please and thank you. Update: You do NOT have to be a Pro Member to take advantage of the deal! Sorry for the misinformation.",
                "author": "Ttm-o"
            },
            {
                "raw_content": "Neither Air Riders or Metroid Prime in stock within 100 miles of Columbus. You must be in a great metro area!",
                "author": "ExcellentGur5760"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Upcoming Dual V-Cache 9950X3D2 Gaming CPU from AMD leaked, to feature 192MB of L3 Cache",
        "score": 111,
        "text_content": "Source: https://xcancel.com/Olrak29_/status/2004502876731965677 https://xcancel.com/x86deadandback/status/2004495963101258058",
        "comments": [
            {
                "raw_content": "Might as wait for 12core on one ccd generational upgrade.",
                "author": "Forward-Manager4930"
            },
            {
                "raw_content": "All im saying is: https://www.pcgamer.com/hardware/processors/a-few-redditors-faked-the-recent-ryzen-7-9700x3d-benchmark-leaks-and-explain-why-you-cant-trust-online-bench-databases/",
                "author": "quinn50"
            },
            {
                "raw_content": "I mean thats great but.. we've got to have reached the point of diminishing returns after somewhere with Cache no? or am I wrong?",
                "author": "XxZedlingxX"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "High on Life 2 for the Nintendo Switch 2 has been listed on several European Online Shops.",
        "score": 47,
        "text_content": "A High On Life 2 poet has yet to be announced, but the first game not only received a Switch 1 port, but also received a Switch 2 version of the game as well on top of that over the summer. The listings state how High On Life 2 is being published by Clear River Games and will be a Game Key Card. \\[Netgames Link\\](https://netgames.de/nintendo-switch-2/switch-2-spiele/shooter-2168/high-on-life-2-switch-2.html?search\\_id=) \\[Gameware Link\\](https://www.gameware.at/info/space/High+on+Life+2+f%FCr+PS5+und+Switch+2+kaufen) \\[World Of Games Link\\](https://www.wog.ch/en/index.cfm/details/product/233387-High-on-Life-2)",
        "comments": [
            {
                "raw_content": "Read this title very differently and got excited.",
                "author": "HydraTower"
            },
            {
                "raw_content": "Fuck i thought this said half life 2.",
                "author": "RuanauR"
            },
            {
                "raw_content": "Saw that as \"half life 2\" for the Switch and was like \"huh??\"",
                "author": "LuigiWarrior"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Unreleased RE9 interview video showcases the games theme.",
        "score": 366,
        "text_content": "https://www.youtube.com/watch?v=6pempD1tE1s 1:04",
        "comments": [
            {
                "raw_content": "Is it the same guy that sang \"Saudade\" from RE2R? If yes, then he sang in the beginning of Leon's fight against bioterrorism and his (according to the devs) end.",
                "author": "InsomniacLtd"
            },
            {
                "raw_content": "Siiiick.",
                "author": "AscendedViking7"
            },
            {
                "raw_content": "My Body is Ready",
                "author": "therealyittyb"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Core Ultra 5 245KF Drops To Just $170 With A Free 240mm AIO And Intel Holiday Bundle; More Amazing Arrow Lake CPU Deals Available",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is considerably slower in gaming than a 14600k, right?",
                "author": "zakats"
            },
            {
                "raw_content": "This is probably because Panther Lake is being announced Jan05.",
                "author": "Busy-Explanation4339"
            },
            {
                "raw_content": "Need a good deal on a motherboard, preferably an ITX kind. Also, these naming/model changes is not making it easy for me to figure out which line it is. Stupid.",
                "author": "Gears6"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Ryzen 9 9950X3D2 16-core CPU with 192MB L3 cache finally leaks out - VideoCardz.com",
        "score": 836,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "This will actually run Windows 98 without additional expensive DDR5 ram :)",
                "author": "dontuseliqui"
            },
            {
                "raw_content": "I really wish people would benchmark modern use cases like having your game on one monitor and on the second monitor a browser open with 12 tabs one of which a video you are looking at in between stuff ingame. Then possibly also being connected to voice chat in discord the whole time? I can’t be the only one that has this scenario a lot of the time.",
                "author": "Pugnaxa"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire confirms RX 9070 XT NITRO+ Phantom Link specs and price",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If Sapphire used the standard 3x8pin connectors instead, they would have sold way more Nitro+ than they have now.",
                "author": "Big-Rip2640"
            },
            {
                "raw_content": "Sapphire needs to fuck all the way off with using the 12v HPWR connector.",
                "author": "Veighnerg"
            },
            {
                "raw_content": "$828 for burning my connector?? I'd much rather burn a 5070Ti at least I'll have better performance and features.",
                "author": "BedroomThink3121"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD RDNA5 rumored to launch in mid-2027",
        "score": 393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "80% faster but top end card has 2gb memory due to shortages.",
                "author": "TwoBionicknees"
            },
            {
                "raw_content": "Looks like I won't be buying any computer parts next. With new GPUs coming in 2027 (i have a rx7800xt current gen doesn't offer enough of an upgrade). Memory is too expansive to justify upgrading to AM5 or Intel. SSDs are expansive, monitors are atleast somewhat interesting though i got a 4k monitor 165hz monitor last year. Well I guess AI has killed cosumerism in the PC space. The only thing affordable is peripheals.",
                "author": "Shadow-Nediah"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Thermalpad Thickness - AsRock Phantom Gaming RX7900XTX OC Edition",
        "score": 23,
        "text_content": "Hello everyone, I hope I don't violate any rules by making this post, but I needed to know the thicknesses of the thermal pads of my AsRock PG RX7900XTX. After not finding anything online that helped me I decided to contact AMD directly - they provided the following picture to me: [Radeon RX 7900 XTX Phantom Gaming 24GB OC Thermalpad Sizes \\/ Thicknesses for GPU \\[picture received via E-Mail from AMD Support Germany \\/ Europe\\]](https://preview.redd.it/nwyw0lw86l9g1.png?width=1377&format=png&auto=webp&s=26393eeafc2b7ee5bd5700577dca07e47c65e201) The \"T\" unit is the thickness of the pad in millimeters \\[mm\\] - I specifically asked that in another E-Mail to AMD. I hope this is helpful in any way - it was for me.",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire launches Radeon RX 9070 XT GPUs and X870 NITRO+ Phantom Link motherboards",
        "score": 85,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Its great to see more white options.",
                "author": "Tekn0z"
            },
            {
                "raw_content": "Is this to fix the issue their Nitro cards have with the 12v6x2 cable? Clearly not a BTF competitor since the board isn't Back-Connect. I guess I just don't understand where this setup is supposed to slide into the market.",
                "author": "illicITparameters"
            },
            {
                "raw_content": "Can we just get an industry standard for these GPU power connectors on the motherboard? I rarely buy from the same GPU as motherboard manufacturers",
                "author": "Slasher1738"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Zillow expects home values to rise 1.7% in 2026 amid soft demand and accumulating inventory.",
        "score": 42,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Did they come to these forecasts/ conclusions from their Zestimates?",
                "author": "Self_Serve_Realty"
            },
            {
                "raw_content": "So as more inventory comes on the market prices go up? Economics 101 tells me as more inventory comes, buyers have more options and sellers drop prices to compete for buyers.",
                "author": "Zestyclose-Finish778"
            },
            {
                "raw_content": "Sorry that I'm not an economist or anything, and please pardon me if I'm wrong, but if home valuations rise by less than inflation, that means homes are losing value, doesn't it?",
                "author": "og_aota"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How do you just get rid of a house?",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Long story short, ***my mom has a 460k house*** she has had listed since August that hasn't sold. Hilarious. Clearly she doesn't have a $460k house if it hasn't sold for 4+ months on the market.",
                "author": "fatfiremarshallbill"
            },
            {
                "raw_content": "Have you tried increasing the price?",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "Some greedy boomer tries to be Mr. Potter and buys a **second house** (5 bedrooms in fact) that consumes 75% of her income and forces her to live check to check? Almost sounds fake. My deepest sympathies to her if true.",
                "author": "_Z-"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Deadline to Submit Claims on the Opendoor $39M Settlement Is in This Saturday",
        "score": 14,
        "text_content": "Hey guys, if you missed it, Opendoor settled $39M with investors over issues tied to its pricing algorithm and profit margins. And, the deadline to file a claim and get payment is December 27, 2025. In a nutshell, in 2020, Opendoor was accused of misleading investors about how its algorithm priced homes, its ability to keep stable margins, and how it would perform in a housing downturn. As disclosures rolled out between 2022 and 2023, the stock fell nearly 90%, and investors filed a lawsuit for their losses. After this news came out, the stock dropped sharply, and investors filed a lawsuit for their losses. Now, the good news is that the company agreed to settle $39M with them, and investors have until December 27, 2025 to submit a claim. So, if you invested in OPEN when all of this happened, you can check the details and file your claim [here](https://11th.com/cases/opendoor-investor-settlement). Anyway, has anyone here invested in OPEN at that time? How much were your losses, if so?",
        "comments": [
            {
                "raw_content": "Are you not bullish on Opendoor?",
                "author": "Self_Serve_Realty"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "How many of you are currently homeless / living in your vehicles while putting everything into retirement and savings accounts?",
        "score": 0,
        "text_content": "I realize this is likely a pretty sensitive topic. Many places in the country aren’t conducive to surviving like this—whether due to crime; law enforcement; inhospitable climate; etc. But those of you who are several years down the road and primed to purchase when it becomes viable—how are you fairing? Mentally, physically, socially… Obviously it’s quite the sacrifice, but I’m sure most of you realize what it takes to get ahead. Did your career stay on track? Did you make a friend or meet a partner? What’s your story?",
        "comments": [
            {
                "raw_content": "No I’d rather live in an apartment than be homeless. Why should the arbitrary goal of owning property trump the actual life necessity of shelter?",
                "author": "Jung1e"
            },
            {
                "raw_content": "You’ll probably achieve more at work if you had a hot meal and a good night of rest.",
                "author": "Purple-Investment-61"
            },
            {
                "raw_content": "I dated someone briefly who was living this way and honestly the stress of having to constantly move your vehicle around, maintenance, repair, using the restroom, showering, laundry mats, cooking, parking tickets etc etc it didn’t really seem to make it worth it to me!",
                "author": "vegangoat"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Last 2 yr humanoid robots from A to Z",
        "score": 59,
        "text_content": "This video is 2 month old so is missing the new engine.ai, and the (new bipedal) hmnd.ai",
        "comments": [
            {
                "raw_content": "It's time for an annual rewatch of 'The Creator'. The time is nigh....",
                "author": "SleepingCod"
            },
            {
                "raw_content": "Last 2 years of staged demos you mean.",
                "author": "ThenExtension9196"
            },
            {
                "raw_content": "There are still 0 usefull humanoids for domestic use unfortunately. All we have are highly curated demo's.",
                "author": "Tobxes2030"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej Karpathy: Powerful Alien Tech Is Here---Do Not Fall Behind",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The major issue I see is the tools are evolving faster than we can reasonably learn them. Even apps like Cursor change the design and add / modify features weekly while at the same time the underlying API models are not deterministic, they can be good one week and bad the next if throttling or other changes are being made by the vendor or middlemen. You can develop an AI programming workflow that can be made obsolete in a few weeks or months by the tool vendors. It causes burnout as it is mentally taxing to work in high levels of abstraction that are constantly changing.",
                "author": "SailTales"
            },
            {
                "raw_content": "I'm a Site Reliability Engineer with nearly 10 years experience. I'd like to share my own opinion and first hand experience with the last 3 years of tech, and explicitly say I have no financial incentive to blindly agree with what Andrej is saying here. LLMs have legitimately changed the way I approach problems and tasks. Yes - these models hallucinate and have their quirks and pitfalls. They are not perfect. Not even close. But something I've noticed over the last few years, being closely involved with deploying some of these tools across my org, and using them extensively in my free time, is that they allow me to go from \"idea\" to \"demo/mvp/test\" in a fraction of the time. That example is very programming-centric. The concept applies to any domain. At its core, to me, these models have made it easier to brainstorm, explore ideas, challenge my own assumptions, and rapidly prototype in a way that was not possible for me prior to 2022. We have access to a new type of tool, and it's going to take time to learn what types of problems these tools are good for. If we have a tool that, in the right context, makes it easier to navigate through various ideas quicker - to me it is clear that this will have an impact downstream for so many things. I'm happy to hear any critiques or opinions on my experience here. I have no incentive to support these AI companies, and I am actively opposed to a lot of the abuse and misuse these tools are allowing. But to blindly ignore the positives is setting us up for failure.",
                "author": "Zokrar"
            },
            {
                "raw_content": "As a 40 year old i really envy the teen right now that has a ton of time and gets to play with all this stuff... Gosh the ability is massive right now compared to what i could do.",
                "author": "djamp42"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Software Agents Self Improve without Human Labeled Data",
        "score": 325,
        "text_content": "[Tweet](https://x.com/YuxiangWei9/status/2003541373853524347?s=20) [Paper](https://arxiv.org/abs/2512.18552)",
        "comments": [
            {
                "raw_content": "Who is he and what does it mean?",
                "author": "Sockand2"
            },
            {
                "raw_content": "I would love to see the error bars",
                "author": "MaxeBooo"
            },
            {
                "raw_content": "Someone is the comments shared an analysis of the paper by GPT 5.2 Pro, the title may be overhyping this. [Paper review self-play SWE-RL](https://chatgpt.com/share/694e95dc-e574-8001-ace3-99015278a034)",
                "author": "Trigon420"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It's too lonely in this future.",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "people keep parroting this, but i find it so sad that people jump to blaming technology and dont even consider why they might be so lonely to begin with clearly its a bandaid for something much deeper and i find it worrisome that barely anyone is looking into the root causes of this",
                "author": "SameLotus"
            },
            {
                "raw_content": "ya acting like lots of people have awesome relationships with friends and lovers but are willingly deciding to go the digital route...",
                "author": "DisastrousAd2612"
            },
            {
                "raw_content": "Post is more like the present than future",
                "author": "Ok-Mathematician8258"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "METR's Benchmarks vs Economics: The AI capability measurement gap – Joel Becker, METR",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank you. This is great. I wasn’t aware of all the caveats of METR. On the surface it sounds very impressive. But they compare to humans with no task context. And the tasks are well defined. So even if a model gets a notable score/time, it’s still not going to compare well with a human who has specific context doing an ambiguous task - which is most office work.",
                "author": "RipleyVanDalen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Is going into robotics as a CS student a good move?",
        "score": 13,
        "text_content": "First and foremost I am genuinely interested in the field but another reason why I is because I feel like it’s more ‘ai-proof’ then other CS jobs // other jobs in general. Due to physical constraints of robots and the liability risk with robots (needs human over sight). Is my logic sound here?",
        "comments": [
            {
                "raw_content": "AI-proof? Nothing is. But robotics right now is where Tesla and Waymo were 5-7 years ago. You've got enough runway to get through your CS work and find a place that is exploding in growth. If you have a passion for it you're already ahead of many.",
                "author": "ken-bitsko-macleod"
            },
            {
                "raw_content": "From my perspective as a high school teacher, I don't know any field that is safe from AI. I have no answer to any questions my students ask about what they should study at university because by the time they're done and ready to join the workforce, I have no freaking idea what AI would be capable of by then. I would imagine robotics and then nano technology would come after the software side of AI dominance, but then again if they've created an AI that can do AI research, I see no reason why they can't create an AI that researches robotics or nano technology. All I *can* recommend is to study what you enjoy doing. If AI takes over everything then it doesn't matter what you studied. But if you studied something just for money and you hated it and it doesn't pan out, then you just wasted years of your life. If you enjoyed what you studied, at least you wouldn't consider it as your life wasted. And if AI *doesn't* take over it all, then you have a career that you love. Since you are interested in it (and the other software jobs seem much less secure), I'd say why not?",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "Well once robots can do anything I guess that’s when there will be little to no more jobs so it’s probably the best future proofing you can do. Would probably need some experience in mechanical engineering.",
                "author": "LessRespects"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Who Will Recharge All Those Robotaxis? More Robots, One CEO Says.",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "bruh what a dumb question lol driving is obviously orders of magnitude more difficult than connecting a plug to a socket or swapping a battery, geez",
                "author": "JoelMahon"
            },
            {
                "raw_content": "My Roomba already charges itself.",
                "author": "marlinspike"
            },
            {
                "raw_content": "Wireless charging",
                "author": "atehrani"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot, Did You Read My Mind? Modelling Human Mental States to Facilitate Transparency and Mitigate False Beliefs in Human–Robot Collaboration",
        "score": 9,
        "text_content": "[https://dl.acm.org/doi/10.1145/3737890](https://dl.acm.org/doi/10.1145/3737890) Providing a robot with the capabilities of understanding and effectively adapting its behaviour based on human mental states is a critical challenge in Human–Robot Interaction, since it can significantly improve the quality of interaction between humans and robots. In this work, we investigate whether considering human mental states in the decision-making process of a robot improves the transparency of its behaviours and mitigates potential human’s false beliefs about the environment during collaborative scenarios. We used Bayesian inference within a Hierarchical Reinforcement Learning algorithm to include human desires and beliefs into the decision-making processes of the robot, and to monitor the robot’s decisions. This approach, which we refer to as Hierarchical Bayesian Theory of Mind, represents an upgraded version of the initial Bayesian Theory of Mind, a probabilistic model capable of reasoning about a rational agent’s actions. The model enabled us to track the mental states of a human observer, even when the observer held false beliefs, thereby benefiting the collaboration in a multi-goal task and the interaction with the robot. In addition to a qualitative evaluation, we conducted a between-subjects study (110 participants) to evaluate the robot’s perceived Theory of Mind and its effects on transparency and false beliefs in different settings. Results indicate that a robot which considers human desires and beliefs increases its transparency and reduces misunderstandings. These findings show the importance of endowing Theory of Mind capabilities in robots and demonstrate how these skills can enhance their behaviours, particularly in human–robot collaboration, paving the way for more effective robotic applications.",
        "comments": [
            {
                "raw_content": "We all need therapy. We need an army of psychiatrists.",
                "author": "Plane_Crab_8623"
            }
        ],
        "subreddit": "singularity"
    }
]