[
    {
        "post_name": "🚨 BREAKING: Mass amounts of Virginia voters are furious at elected Democrats after their electric bills SURGE by as much as 300% in a short time \"I'm crashing the F out bro, I can't afford this sht!\" TRUMP WARNED THEM!",
        "score": 497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Communists want to destroy the middle class, middle class voting for communists is like cockroaches voting for Raid bug spray.",
                "author": "dankai420"
            },
            {
                "raw_content": "Insert Trump Snake Poem",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "They didn't bother to show up and vote in the election, thoae are the consequences.",
                "author": "texas4ever"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "He's Not Little Marco Anymore!",
        "score": 398,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know if we're being played hard, but Rubio has been among Trump's best and most based picks. It's a tough choice between him and Vance for 2028. Both are brilliant men. Rubio is scary intelligent. One of the best at destroying the globalist media and their fake narratives. I find it myself leaning toward him as the heir apparent, but it's hard to forget his advocacy for amnesty of illegals. Rubio is a fierce anti-commie and may have finally realized what the globalists end game is.",
                "author": "JackLemon"
            },
            {
                "raw_content": "Marco 2028. Vance is great, but Rubio is just plain better, especially in the international arena, which will be more important after Trump to make sure they know that Trump wasn't a one-off and that we really are going to force them to stop being faggots. Also Greenland will be ours.",
                "author": "DepartmentOfOffense"
            },
            {
                "raw_content": "Garrison: https://grrrgraphics.com/from-little-marco-to-big-hands-statesman/",
                "author": "Capoditutticapi1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "OH, NO: Investigation underway after California high school seniors posed for a photo spelling out \"F*GGOTS\". Students rearranged themselves to spell a slur, which the principal (and lead school faggot) called \"unacceptable.\" All students pictured will now never be able to run for President.",
        "score": 431,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> the principal called unacceptable That ship already sailed when you cover every spare bit of space with the actual faggot flags at your school, doofus.",
                "author": "impera"
            },
            {
                "raw_content": "They certainly can run for president and I'm glad to see this shit because I thought kids were all just utterly brainwashed into being utterly compliant. Shame on the school for letting it become a national thing and I hope the students involved doing this can make something from it, unless it was all a sham to cause an uproar in the first place. If that's the case then fuck them",
                "author": "UltimatePistachio"
            },
            {
                "raw_content": "Trump should appoint them as federal judges",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The odds of Jesus Christ returning this year have surpassed Kamala Harris’s chances of winning the next election.",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blowout election losers don't generally get another chance.",
                "author": "jamesbcrazy"
            },
            {
                "raw_content": "isn't Camilla Harris unqualified for running for president since she isn't a native born American citizen?",
                "author": "BigMikesBlackDick"
            },
            {
                "raw_content": "The democrats love their empty suits. All they need is a dummy and an autopen so they can do their bidding.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Senate has passed two (2) bills this year and voted an average of less than one time per day. The Senate has more than enough time to exhaust a Democrat filibuster on the SAVE Act and enact it into law.",
        "score": 770,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh you sweet summer child, you think their job is “voting on bills” and not looting the treasury for doing nothing and getting benefits no one else gets. It’s all a grift.",
                "author": "lefty295"
            },
            {
                "raw_content": "We are not represented by this Congress. They represent something else.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "And what they vote on is stupid shit that’ll never go anywhere like “limiting the a president’s tariff powers”",
                "author": "Marianasoctober"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nearly 100% PERCENT of all Minnesota counties are now notifying ICE about when a criminal illegal alien is being released, so they can be deported Tom Homan made sure of it. \"This is an unprecedented level of cooperation.\"",
        "score": 741,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But when will Walz be arrested for fraud? Does he plan on paying back the billions of tax dollars he stole or what?",
                "author": "MythArcana"
            },
            {
                "raw_content": "Why is Ilham Omar not in jail? Why is Tom Walz not in jail? Why is Keith Eliison not in jail? Why are we protecting all the pedos in the epstein files?",
                "author": "M-m-m-my-corona"
            },
            {
                "raw_content": "Don’t care. Not good enough. No mass deportations = mass amnesty and that’s unacceptable.",
                "author": "wcwe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. State Department is developing an online portal that will enable people in Europe and elsewhere to access content banned by their governments including \"hate speech and terrorist propaganda,\" the site will be hosted at freedom.gov",
        "score": 1055,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Watch, it's just a redirect to this site. Kek.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "In before the EU will banned that link.",
                "author": "DT170x"
            },
            {
                "raw_content": "I would have also accepted fuckcommies.net",
                "author": "blockchain-the-vote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Another deadly truck crash in Indiana at the hands of a suspected illegal immigrant.",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The employer should be charged as an accessory.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "ILLEGAL ALIEN, YOU FUCKTARDS",
                "author": "MAGAGIRL69"
            },
            {
                "raw_content": "You'd think the Teamsters Union would have something to say about all these. Oddly silent for someone not in on it, somehow.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Double spaced. No less than 2,000 words.",
        "score": 695,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop fucking with countries on the other side of the planet at behest of Jews. I don't give a shit what they do to each other.",
                "author": "SwedishChainsaw2"
            },
            {
                "raw_content": "Times New Roman... and not gaylord Calibri.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "As if this has nothing to do with with Israel's demonic plans of World Domination thru *Shabbos Goys*.",
                "author": "rapskull"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HORROR: Michigan Man Mows Down Family with His Car, Fatally Shoots Couple’s 3-Year-Old Girl",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">\"\"\"Michigan Man\"\"\"",
                "author": "Questionable"
            },
            {
                "raw_content": "Bring back public hangings.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Hate crime. Just ran down a white family who were out for a nice family walk and then when they were still alive he pulled out a gun to finish them off. Um huh, not even shocking anymore since I lived through it. You'd think it's national crisis by now but it still isn't.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epstein was meeting with Obama's lawyer-fixer Kathy Ruemmler to discuss \"NSA, signal intelligence\" & What’s this? Brennan and Epstein having a lunch?",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmmm IDK but it definitely had nothing to with $65,000 HOT DOG PARTIES WITH WALNUT SAUCE.",
                "author": "CMDRConanAAnderson"
            },
            {
                "raw_content": "I wonder how one person can be so implanted into so many powerful people's spheres.",
                "author": "BidenShowerDrool"
            },
            {
                "raw_content": "Completely not shocked that Brennan and Epstein were having lunch in 2015 over a discussion about the NSA with the White House lawyer. Keep in mind, this is September 9th, 2015. Trump announced his run in June of 2015.",
                "author": "anotherthing"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "US citizens who break the law are separated from their families every single day. You don't deserve special treatment.",
        "score": 1460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WE all voted for this. Keep it going!",
                "author": "GA_Logic"
            },
            {
                "raw_content": "28 years to be legallized. Probably expedited timeframe if he woulda been an informant.",
                "author": "dres6"
            },
            {
                "raw_content": "What are the odds she's lying?",
                "author": "derpstater"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I have never seen anything so absurd. Stockholm’s ANTIFA HQ, “Cyklopen”",
        "score": 1123,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The faggotry is over 9000!",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Trannie fuck fest going on inside there 7 days a week.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "James once again showing how easy it is to make people talk. The international man of mystery. They legit train terrorists there and places like that around the world. It would be very interesting if they could infiltrate there meetings. They probably have FBI agents recruited on the west coast.",
                "author": "ElectionMeddler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Vatican officially rejects Trump's offer to join the Board of Peace",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Vatican rejects the 10 Commandments as well, so there is that.",
                "author": "MeMargie"
            },
            {
                "raw_content": "Only political when spouting Leftist garbage.",
                "author": "Zennblack"
            },
            {
                "raw_content": "They have chosen their fate.",
                "author": "Coprolite"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE TRUMP CRUSE STRIKES AGAIN: Team USA skater Amber Glenn trashes America abroad, says Trump is attacking LGBTQ, then lands in 13th place at the Winter Olympics and cries on camera.",
        "score": 1203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe just shut your mouth and do the sport stuff.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "Watching these libs fail because of their weak minds is glorious.",
                "author": "mynameisdonald"
            },
            {
                "raw_content": "Learn how to put makeup on too she looks like a drag Queen whore with whatever she did to her face",
                "author": "dontsteponsnek"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec. of War Pete Hegseth has arrived at Boeing.",
        "score": 922,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Boeing has sucked off the tax tit too long.",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "end the fucking contract and put boeing out of biz",
                "author": "Rerun1Central"
            },
            {
                "raw_content": "Calling this a \"Freedom Tour\" is meme worthy and gay.",
                "author": "Thrilly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THE UNITED STATES TRADE DEFICIT HAS BEEN REDUCED BY 78% BECAUSE OF THE TARIFFS BEING CHARGED TO OTHER COMPANIES AND COUNTRIES. IT WILL GO INTO POSITIVE TERRITORY DURING THIS YEAR, FOR THE FIRST TIME IN MANY DECADES. THANK YOU FOR YOUR ATTENTION TO THIS MATTER!",
        "score": 439,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I saw gas for $2.16 in Tulsa today. Just sayin.",
                "author": "madeaprofilejustforu"
            },
            {
                "raw_content": "OK, that's not bad, but we gotta see big arrests: Election stealing, J6, Fraudsters, and especially.... Epstein. btw, I'm talking about winning elections, not otherwise more important things.",
                "author": "freedom-thinker"
            },
            {
                "raw_content": "Lolbertarians in shambles. Who could have predicted that we could shift trade imbalances by leveraging US consumer spending and tariffing imports. Its almost like businesses and nations will predictably do what profits them most.",
                "author": "dunkeaters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fulton County Files Lawsuit to Claw Back Election Evidence – Some Major Issues with Filing Revealed by Board Member",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Major issues meaning that they conclusively show fraud?",
                "author": "Washington_Redskins"
            },
            {
                "raw_content": "Well it’s been two weeks since they raided them, only two more weeks to go until we see some results.",
                "author": "CocaineShark"
            },
            {
                "raw_content": "What about the 6 missing boxes of real evidence that those ass clowns hid somewhere else?",
                "author": "Rudy_DankMemer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sean Strickland: “I don’t even wanna say that f*****s name. The NFL used to be the standard of being a man. Now think they get together every year and say how do we f*****g ruin this sport, how do we gay it up”",
        "score": 490,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're ok with not having any fans.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "So true. The NFL is gayer than a San Francisco bathhouse and anal warts! Eeeewww!",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "\"Politics is downstream from culture,\" a phrase coined by Andrew Breitbart, means that societal culture—comprising art, media, entertainment, and social values—shapes political outcomes, rather than politics shaping culture. It suggests that long-term political change is driven by shifts in societal attitudes, narratives, and storytelling, which ultimately dictate government policies and leadership",
                "author": "Cc1005"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Female ICE agent fake car problems to lure illegal aliens out of their homes to help...",
        "score": 1220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Modern problems require modern solutions",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Are you old enough to remember when law enforcement would send letters to bail scofflaws and their ilk informing them they won the lottery? They would arrest them when they showed up to collect.",
                "author": "InfidelBaconEater"
            },
            {
                "raw_content": "I didn’t vote for this… …I voted for the wife and six children to join him.",
                "author": "Nurrun"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Micron has announced an investment plan of up to $200 billion to expand production capacity and address the most severe memory chip shortage in the last four decades",
        "score": 927,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We won't see the effect for years",
                "author": "Slasher1738"
            },
            {
                "raw_content": "“Most severe memory shortage in the last four decades” was there a bigger one before??? Otherwise, it’s the worst in _history_.",
                "author": "TRKlausss"
            },
            {
                "raw_content": "Here is a more interesting one on the same subject. CEO of the company that makes NAND controllers (not NAND itself) says industry may not survive 2026. What he doesn't say is that same applies not only to consumer stuff, but industrial and all kinds of embedded too - literally everything with NAND (or DRAM) in it. When governments suddenly find out their stuff can't be made because of shortages, emergency **culling** of overgrown AI companies would not look like a radical idea. [https://www.tomshardware.com/pc-components/storage/phison-ceo-thinks-nand-shortages-could-shut-down-entire-consumer-electronics-companies-in-2026-claims-at-least-one-foundry-demands-three-year-cash-payment-upfront](https://www.tomshardware.com/pc-components/storage/phison-ceo-thinks-nand-shortages-could-shut-down-entire-consumer-electronics-companies-in-2026-claims-at-least-one-foundry-demands-three-year-cash-payment-upfront)",
                "author": "x7_omega"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Phoronix: \"More ISA Differences Come To Light With The New AMD GFX1170 \"RDNA 4m\"\"",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes sense, RDNA 4 was designed to only scale down to 32CUs. Backporting some of the key features to RDNA 3.5 is probably easier than redesigning RDNA 4.",
                "author": "spazturtle"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Could Tap Chinese CXMT and YMTC for Memory and Storage",
        "score": 139,
        "text_content": "> Recently, the U.S. Government's Bureau of Industry and Security reportedly removed CXMT and YMTC from the list of restricted Chinese companies. This move could benefit Apple, which may now utilize products from both firms. CXMT offers LPDDR5X and DDR5 memory, which aligns with Apple's needs for its products. Since Apple's iPhones and M-series SoCs primarily use LPDDR5X memory, CXMT's 12 Gb and 16 Gb LPDDR5X capacities could serve both the smartphone and computer sectors effectively.",
        "comments": [
            {
                "raw_content": "Weren't Apple already interested in their SSDs before they got smacked with a restricted hammer?",
                "author": "pythonic_dude"
            },
            {
                "raw_content": "If you're worried about quality, know that apple tests BOE screens every year and has turned them down almost every time for not meeting standards. That being said, I would not be surprised if the industry as a whole relaxed requirements given how dire the situation is.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "I have a 2TB Ssd from ymtc on the ps5 and it's fine. Apple still ask for some quality so I'm not that worried",
                "author": "MissionInfluence123"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA GTC 2026: Jensen Huang promises a chip reveal meant to “surprise the world” - VideoCardz.com",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "RTX GPU that can take DDR2 DIMMs",
                "author": "dparks1234"
            },
            {
                "raw_content": "He is almost certainly talking about their desktop SOC/CPU.",
                "author": "Agloe_Dreams"
            },
            {
                "raw_content": "Likely an inference chip to compete with Cerebras.",
                "author": "hitsujiTMO"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AVX2 is slower than SSE2-4.x under Windows ARM emulation",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Emulation of complex hardware is slower than simpler hardware. Wonder why they are going to discover next? Maybe software rendering is slower than GPU based rendering?",
                "author": "reveil"
            },
            {
                "raw_content": "I don’t get the point or do don’t understand what they’re surprised about? Isn’t it kinda obvious that an ARM CPU without Vector extensions (comparable to AVX,Apple Silicon CPUs don't have SVE implemented (yet), Neon is much closer to SSE) in hardware doesn’t run AVX2 code significantly faster than SSE code? SSE has been around much longer and SSE emulation on ARM is a lot more mature than AVX emulation. Edit: About SVE/Neon",
                "author": "Jumpy-Dinner-5001"
            },
            {
                "raw_content": "While there's a lot of snark in the comments here, I must say that the article is certainly a large word salad around an obvious concept with a single set of (obvious) results.",
                "author": "mavere"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Switch 2 is starting to baffle me as someone who works with video games",
        "score": 503,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah I too hate the fact that:",
                "author": "TheRigXD"
            },
            {
                "raw_content": "is the other half of your post on the way?",
                "author": "barbietattoo"
            },
            {
                "raw_content": "I sooo wanna pull the trigger on the S2 version. This image from docked? Looks so good",
                "author": "Sloth7-_-7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Just got a Duskbloods ad on reddit. New trailer soon?",
        "score": 506,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would be something to get it released before we get Elden Ring on Switch 2.",
                "author": "NoirSon"
            },
            {
                "raw_content": "Reddit's got Duskbloods Fever today",
                "author": "ntwild97"
            },
            {
                "raw_content": "Hopefully we are going to see it soon between this and it being listed on the eshop",
                "author": "gothamz77"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Duskbloods has appeared today on the australian eShop.",
        "score": 612,
        "text_content": "The Australian eShop today (18.02.26) started listing The Duskbloods in its catalog of future releases with a planned release for 2026 - the game was not listed there until now",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/9ad7nmowzakg1.png?width=1080&format=png&auto=webp&s=02593ea517d40865b5125c503968c39291856f4f Australia eshop you say... couldn't tell",
                "author": "Lyrick_"
            },
            {
                "raw_content": "Little bit of smoke? Could mean fire?!",
                "author": "MunkyMan33"
            },
            {
                "raw_content": "![gif](giphy|JwjBy94VzDd6)",
                "author": "Glittering-Job4016"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Was Nintendo on to something?",
        "score": 2263,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t think Discord’s huge popularity is just because it has voice chat. The feature is an initial selling point, but I think Discord’s server structure is Discord’s true most important feature. I think most people are in multiple servers where they’ve never entered a voice channel. Text chat across a wide range of community aggregated and moderated interest servers. Servers hosting hundreds of individuals acting as a next level group chat. Game chat has none of that stuff. Not even close. Now if Nintendo were to bring back Miiverse and integrate Game chat into that in a smooth way, then maybe we’d be onto something.",
                "author": "MichaelMJTH"
            },
            {
                "raw_content": "to me the c button is a godsend since I can remap it to the \"-\" button. The original position is so damn hard to press.",
                "author": "kok3995"
            },
            {
                "raw_content": "That requires me to have friends that own Nintendos.",
                "author": "Expelleddux"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I need a studio to revive the forgotten IP",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Damn, this is giving me so much nostalgia.",
                "author": "Loenter_13"
            },
            {
                "raw_content": "God please, I loved this game.",
                "author": "Arky_Lynx"
            },
            {
                "raw_content": "I always feel like we remember this series way better than it actually was.",
                "author": "BambooCatto"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Animal Crossing: New Horizons Version 3.0.1 is now available",
        "score": 101,
        "text_content": "The following updates have been made when playing the game on Nintendo Switch 2 and Nintendo Switch: * Fixed an issue where the game would run slower than normal after exiting the island hotel to an outdoor area. * Fixed an issue where, when asking Resetti to clean up the island, fences that were put away or in storage could change into different customizations or be duplicated, and some cleaned-up items could disappear. * Fixed an issue where Timmy and Tommy would sometimes stop following the player inside Nook’s Cranny. * Fixed an issue where items could pop out of a rock before the shovel made contact when hitting it. * Fixed an issue where, after playing with another player on a slumber island, home remodeling or relocation could become unavailable on the slumber island. * Fixed an issue where the Camera app installation sequence could play when redeeming the Island Designer license at Nook Stop. * Fixed an issue where some items were displayed in incorrect positions in the catalog used for photo studios and hotel decorating. * Other adjustments and corrections were made to improve the game play experience. The following updates have been made when playing the game on Nintendo Switch 2: * Fixed an issue where clouds near the horizon could appear misaligned outdoors on the island, causing parts of the sky to show unnaturally. * Adjusted controller vibration intensity to match the level when playing on Nintendo Switch.",
        "comments": [
            {
                "raw_content": "Ah, I was getting used to that controller vibration intensity",
                "author": "cardiffman100"
            },
            {
                "raw_content": "The guy on my youtube algorithm who posts an ACNH \"news\" video nearly every day despite there being nothing new to talk about, is probably ecstatic even for just some bug fixes to discuss.",
                "author": "LunchPlanner"
            },
            {
                "raw_content": "Cmon, nintendo, you can get that 60fps running.",
                "author": "Kabelly"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Stardew Valley - Nintendo Switch 2 Edition update out now, patch notes",
        "score": 27,
        "text_content": "Fix for bug where crafting certain items could remove incorrect ingredients from the inventory. Improved mouse mode on Switch 2, with the option to disable it entirely. Fixed some graphics corruption in Switch 2 GameShare. Ensure network maintenance messages appear on co-op startup. -Obey parental controls when joining Switch 2 GameShare sessions.",
        "comments": [
            {
                "raw_content": "This time also for EU users or is this US only again for some weird reason?",
                "author": "Bloodwalker09"
            },
            {
                "raw_content": "Finally..",
                "author": "Afc_josh12"
            },
            {
                "raw_content": "Does it improve graphics and performance?",
                "author": "mzatariz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A Finnish website shows The Duskbloods release date to be March 27th",
        "score": 186,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Feels awfully soon for it to be releasing with no media about it other than the initial direct announcement.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Holdplacer date something something",
                "author": "Medd-"
            },
            {
                "raw_content": "It has now also appeared on the Australian eShop so clearly something is coming.",
                "author": "Zyvyn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So... this confirms doom the dark ages?",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wish we could get S2 enhancements of Doom 2016 and Enternal. 120FPS in portable mode would be amazing",
                "author": "TTBurger88"
            },
            {
                "raw_content": "Either that or the intern f*cked up lol",
                "author": "ApprehensiveCoat9587"
            },
            {
                "raw_content": "Doom games exist on the switch 1 and they will use that image on all the storefronts so no lol",
                "author": "Dry-Cod9127"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Christopher Judge (Kratos) says GoW remakes will have TC Carson and new combat system, new SSM game reveal late summer",
        "score": 615,
        "text_content": "https://streamable.com/baiuju",
        "comments": [
            {
                "raw_content": "He’s gonna get a very angry call from Sony soon lol",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "Christopher Judge might have to be instantly bumped to a tier 1 leaker after this",
                "author": "STMTowardsDatATM"
            },
            {
                "raw_content": "Is Christopher Judge the Tom Holland of gaming?",
                "author": "MechaSeph"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ashhong suggests that Sony Santa Monica's next game isn't a God of War mainline entry",
        "score": 68,
        "text_content": "Source: [https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151517563](https://www.resetera.com/threads/playstation-studios-ot49-hunters-gathering-on-tau-ceti.1433161/post-151517563) >User: It'll have been 5 years since Ragnarok in 2027, perfect time as any to release the next mainline entry 👀 >Ashhong: Don't hold your breath.. Reminder that the legitimacy of this person has been backed by Jason Schreier.",
        "comments": [
            {
                "raw_content": "I mean sounds like he could just be saying it’s a ways off",
                "author": "Arkhamguy123"
            },
            {
                "raw_content": "Cary Barlog has been working forever on his game since 2018. It's baffling that they're still not ready to even show a teaser.",
                "author": "RedIndianRobin"
            },
            {
                "raw_content": "I refuse to believe it's going to be 5 years since Ragnarok released next year",
                "author": "idkimhereforthememes"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "John Harker claims Chrono Trigger remake is already in development",
        "score": 321,
        "text_content": "Link to ResetERA post: [https://www.resetera.com/threads/square-enixs-asano-team-conducts-survey-gauging-interest-on-which-squeenix-titles-peeps-would-like-to-see-remade-in-the-future.1437067/page-3#post-151415515](https://www.resetera.com/threads/square-enixs-asano-team-conducts-survey-gauging-interest-on-which-squeenix-titles-peeps-would-like-to-see-remade-in-the-future.1437067/page-3#post-151415515) FYI John Harker is Tier 3, 50/50. EDIT: my bad, they didn't specify whether it is a remaster or a remake. Something is in the works tho.",
        "comments": [
            {
                "raw_content": "#John Harker is a Tier 3 - 50/50 as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "'John Harker' in the big '26?",
                "author": "scott1swann"
            },
            {
                "raw_content": "Don't do this...don't give me hope",
                "author": "PootBooster"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New datamine for Monster Hunter Wilds shows more evidence of Switch 2 port (image of local multiplayer between Switch 2 devices)",
        "score": 279,
        "text_content": "https://www.reddit.com/r/monsterhunterleaks/comments/1r8c00w/tempered_gogmazios_and_zoh_shia_sw2_version/ Capcom removed all previously discovered text indicating a Switch 2 version within the game... except they left this image behind https://i.imgur.com/2hHPV7c.png The Switch 2 version is real",
        "comments": [
            {
                "raw_content": "actually burst out laughing once i saw the attached image lmao capcom stop fucking around",
                "author": "TiocStudios"
            },
            {
                "raw_content": "at some point they're gonna push an update and dataminers will find a jpeg with a release date on it",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "I could see it being announced at the next Nintendo Direct. They don't want to overshadow RE9 for now, but they announced quite a bit of stuff at the State of Play.",
                "author": "VistaVick"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident Evil Requiem Leaks Round-Up",
        "score": 406,
        "text_content": "Floodgates have opened people. Leaks are everywhere now per r/ResidentEvilRequiem and Dusk Golem on Resetera. Link: [https://www.resetera.com/threads/resident-evil-requiem-spoiler-thread.1438951/](https://www.resetera.com/threads/resident-evil-requiem-spoiler-thread.1438951/) Here's What We Know So Far: Per Dusk Golem: \\-Grace is Spencer's daughter. Alyssa was forced to adopt her by Spencer in exchange for an interview and important info. \\-Spencer has been manipulating the events of RERequiem as a final plan after his death. Got some updates and clarity on Grace and Spencer. On Grace Being Spencer's \"Daughter\" and Spencer's Final Plan \\-(Per Dusk Golem): \"Spencer's protoge, so here's vaguely how this works from how I understand it. Grace is actually not related to any past character by blood, but she was as a young kid used by Spencer in experiments in ARK, which ARK is a hidden facility that was underneath the orphanage in RE:2. She was a random kid taken from the orphanage from RE:2 for the ARK underneath it, with the goal to create Elpis. Victor and the Connections all think Elpis is some great final virus, but it's actually Spencer's failsafe. Elpis is an anti-viral agent that eradicates all progenitor based viruses. Victor and the Connections think it's the ultimate virus, but it's an anti-virus Spencer made. We'll get more into it and why the children were important in the game. Spencer did an interview after some period of time after Raccoon City, he predicted how things would go with Umbrella's downfall, with the Connections of the peers who betrayed him stealing his life long work, and that they'd want Elpis. To spread the false story of what Elpis was, and he was fond of Grace as a child. But he knew he was too evil to have this sort of attachment, and his plans wouldn't work anyway if Grace was in his custody, so he entrusted Grace to Alyssa (see more on why as a whole other tangent for that one), and he revealed everything to Alyssa when he agreed to do an interview with her. He both selfishly didn't want anyone to have what he views is his, rather it all go down with him, but also he did care for Grace, though he knew she needed better than him. Kinda' similar to Spencer dismissing his lifelong servant before he died by Wesker actually. With the optimal path being that one day things could be resolved peacefully with Grace and Alyssa, but he predicted the Connections would be after Grace as long as they knew about her, and she was the key to taking down the Connections if they ever tried, thinking she housed a great virus, but it's actually a great cure. Victor is working for The Connections btw I should mention. Emily btw is a clone of Grace made by the Connections who tried to \"make their own Grace\", but failed because they \"didn't have Elpis,\" is what they believe.\" \\-Victor's boss is actually Zeno - A CLONE OF ALBERT WESKER. He has his own personality and in a funny twist of fate, he has his own narcissism that forces him to prove he's better than the OG Wesker. \\-Victor kills Zeno some time in the game. Victor really is the true villain of RE9. \\-There are multiple endings. UPDATE: Dusk just revealed Leon dies in the bad ending and he gets Jill'd in the good. He gets cured of his infection and becomes younger. Not joking... UPDATE 2: DEAR GOD ITS REAL. FOOTAGE JUST LEAKED OF YOUNGER LEON - [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8bcbl/leak/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8bcbl/leak/) Then here's the other crazy returns... \\-MR. X is back! \\-HUNK returns and fights Leon in a boss battle. Leon apparently kills him. \\-NEMESIS returns too! He's the final boss if you go for the good ending. \\-UPDATE: So Nemesis's body isn't in the game. What happens is Victor injects himself with the Nemesis parasite that transforms himself in Nemesis's final mutation. Leon says to Victor: \"A Nemesis. No wonder you´re so damn relentless.\" \\-A GIANT SPIDER similar to Resident Evil 1 is a boss battle for Grace! Who's Not in the Game: \\-No Jill, Claire, or Ada... Zeno's model: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r86sxu/more\\_leaked\\_images\\_of\\_resident\\_evil\\_requiem/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r86sxu/more_leaked_images_of_resident_evil_requiem/) Sherry's Model: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89m6t/sherry\\_leaked/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89m6t/sherry_leaked/) HUNK: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89ru0/leon\\_boss\\_fight\\_leak/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89ru0/leon_boss_fight_leak/) GIANT SPIDER: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89spr/mr\\_death\\_and\\_spider\\_4th\\_survivor/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r89spr/mr_death_and_spider_4th_survivor/) MR. X: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8a5bm/more\\_leaked\\_images\\_of\\_resident\\_evil\\_requiem/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8a5bm/more_leaked_images_of_resident_evil_requiem/) NEMESIS: [https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8awbr/can\\_anyone\\_explain\\_to\\_me\\_what\\_the\\_hell\\_nemesis\\_is/](https://www.reddit.com/r/ResidentEvilRequiem/comments/1r8awbr/can_anyone_explain_to_me_what_the_hell_nemesis_is/) Dear god Capcom went full WTF with this game lol. The Final Cutscene was leaked:: [https://streamable.com/j3hxzq](https://streamable.com/j3hxzq) \\-Doesn't seem like Leon's retiring and Sherry may get de-aged now too. Chris was helping Leon behind the scenes. Bad Ending: Bad Ending just got posted. It's def non-canon. Leon gives Grace a chance to escape from Zeno, gets destroyed, and then Zeno blows his head off. It's like an extended bad ending if Jill doesn't shoot Nikolai in time in RE3 Remake.",
        "comments": [
            {
                "raw_content": "Hey! It looks like you've posted a twitter/x link. Please replace the \"x\" or \"twitter\" part of the link with \"xcancel\" and resubmit your post. Thanks! *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Apparently according to Dusk, there are two endings, one where Leon dies (bad) and one where Leon survives/gets cured and ends up getting younger LOL (Capcom found a way to milk Leon content for beyond now)",
                "author": "SEBASTlANVETTEL"
            },
            {
                "raw_content": "Leon becomes younger??? ![gif](giphy|tgdgn2XP9RFVLwKyf9)",
                "author": "No_Pie465"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Finnish site shows March 27th 2026 release date for Duskbloods",
        "score": 260,
        "text_content": "[https://en.konsolinet.fi/product/36809/the-duskbloods-switch-2?variation\\_id=52030](https://en.konsolinet.fi/product/36809/the-duskbloods-switch-2?variation_id=52030) \"Release date: 27.3.2026\" Edit: multiple users have pointed out this is likely a placeholder, and they are correct. There's at least one other instance of a 2026 dateless title having the same release date here. Though oddly enough, some games have Dec 31st 2026. The fact that the site has both means both are valid placeholders IMO",
        "comments": [
            {
                "raw_content": "Feels like a placeholder considering it's the last Friday before the end of the fiscal year.",
                "author": "LorDeus71"
            },
            {
                "raw_content": "No way the release is this close while Nintendo and Fromsoft are yet to reveal anything about the game. I think this is just a placeholder.",
                "author": "Loose_Society9485"
            },
            {
                "raw_content": "I really think we'd know if this game was like a month away",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel delivered and executed with Pantherlake",
        "score": 16,
        "text_content": "Contrary to the rather muted expectation many of us had, Pantherlake is showing lots of hidden surprises: \\-The bandwidth is 30% higher due to the memory side compression, despite memory speed only going up less than 15%. \\-The 4 Xe core performs rather well. It's close enough where a mediocre configured 8 Xe core Lunarlake would be equal to a decent 4 Xe Pantherlake. 10-20% difference. This makes sense. 1/2 the unit, but 70% faster. 0.5 x 1.7 = 0.85. \\-The LPE core is significantly faster per clock compared to LPE in Lunarlake. 3.3GHz Pantherlake LPE outperforms 3.7GHz Lunarlake LPE by \\~10%. \\-The above means the memory subsystem has improved in all areas, including latency(which tests show) and Memory Side Cache is no longer useless performance wise. \\-Despite that LPE keeps it's power efficiency advantage. \\-Both Cougar Cove and Darkmont is 5-8% faster per core than the predecessor. While not really faster due to lower clocks, it's not slower either. This is progress. 22nm, 14nm, and 10nm either barely clocked higher or regressed. Remember Icelake? It lost all uarch advancements in Sunny Cove due to being noticeably lower clock.",
        "comments": [
            {
                "raw_content": "You mean pat delivered",
                "author": "empty_branch437"
            },
            {
                "raw_content": "Panther Lake GPU cores are not 70% faster than lunar lake cores",
                "author": "ChainedBack"
            },
            {
                "raw_content": "It's not a bad chip, but it's not a real M4 Pro/M5 competitor some people expected. It's also slower in CPU compared to the Snapdragon X2E (and this is Qcom's only 2nd iteration in the PC market). Good product overall, could've been more competitive in the CPU aspect.",
                "author": "Daydream405"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "The \"Cash on the Sidelines\" narrative is officially dead. 29% cash buyers + massive seller surplus.",
        "score": 147,
        "text_content": "Just saw this data from Kobeissi. The scariest part isn't the cash drop, it's the 47% spread between sellers and buyers. Smart money is clearly sitting on their hands. if you’re trying to offload property right now, good luck competing with that much inventory. the leverage cycle is breaking.",
        "comments": [
            {
                "raw_content": "Am I the only person that thinks using U.S. wide stats is fucking useless? housing markets are all very different. Even at a state level it does not work. There are areas where prices are climbing and the market is still very competitive, and others experiencing the opposite. there's no way to capture that in a nationwide chart.",
                "author": "French87"
            },
            {
                "raw_content": "Is it though? Aren't people just refusing to buy at these inflated prices whether they have cash or not? Wouldn't a substantial drop cause that cash sales number to jump again?",
                "author": "stoli80pr"
            },
            {
                "raw_content": "Huh? The share of homebuyers paying in cash peaked at nearly 35% in late 2023 because mortgage rates peaked in the high of nearly 8% range around that time. Rates have come down significantly since then to 6% and 5% range. The 29% of cash buyers is still quite high.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates sink to the lowest level in a month, sparking more refinance demand",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The “date the rate” club has been loving it the past year, lol",
                "author": "SnortingElk"
            },
            {
                "raw_content": "KEY POINTS * The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $832,750 or less, decreased to 6.17% from 6.21% * Applications to refinance a home loan rose 7% for the week and were 132% higher than the same week one year ago. * Applications for a mortgage to purchase a home dropped 3% for the week and were just 8% higher than the same week one year ago. Mortgage interest rates dropped last week to the lowest level in a month, prompting more current borrowers to seek savings in a refinance. While lower rates didn’t give potential buyers much incentive, the run on refinances was enough to push total mortgage demand 2.8% higher compared with the previous week, according to the Mortgage Bankers Association’s seasonally adjusted index. The average contract interest rate for 30-year fixed-rate mortgages with conforming loan balances, $832,750 or less, decreased to 6.17% from 6.21%, with points remaining unchanged at 0.56, including the origination fee, for loans with a 20% down payment. “Treasury yields ended the week lower as weaker data on retail sales and home sales outweighed better-than-expected readings on the job market for January,” said Joel Kan, vice president and deputy chief economist at the MBA, in a release. As a result, applications to refinance a home loan rose 7% for the week and were 132% higher than the same week one year ago. Last year, rates were 76 basis points higher. While that annual jump may seem large, refinancing was at extremely low levels at this time last year. “Refinance applications increased across all loan types, marking the strongest week for refinancing since mid-January,” Kan added. Applications for a mortgage to purchase a home dropped 3% for the week and were just 8% higher than the same week one year ago. While lower mortgage rates are making homes slightly more affordable, new supply is not coming onto the market fast enough, and concern over the broader economy has consumers sitting on the sidelines. Mortgage rates didn’t move at all to start this holiday-shortened week, but economic data set for release this week could impact the current trajectory. In general, however, mortgage rates have been hovering in a pretty narrow range, between 6% and 6.25%, since the start of this year.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Wake me when it drops to sub 3% otherwise it's still not affordable with high property prices",
                "author": "mountainlifa"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "All-Cash Home Purchases Ended 2025 at Five-Year Low of 29% [Redfin]",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wild how low FHA loans are in the bay area but I suppose that makes some sense given how expensive it is and how old the properties are.",
                "author": "UnitedLink4545"
            },
            {
                "raw_content": "Most of your cash buyers are investors. Working stiffs aren't buying properties all-cash. Right now in the short-term, investing in a rental property or a flip is a sucker's bet. Mortgage payments are comfortably higher than rents, so you can't cover your costs if you *do* take out a mortgage, and prices are declining, so you cant play for appreciation. Long term, I think RE will be a strong investment as inflation continues to run away. I just don't know if it will be stronger than gold or stocks, and it will need to out-perform them long term to overcome this short term decline.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "It’s such bullshit. These Wall Street firms are still buying with debt. But because they can leverage millions of dollars for short term loans, they get to outcompete us with “cash”.",
                "author": "LaneKerman"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida homeowners are getting shortchanged on their mortgage escrow accounts",
        "score": 10,
        "text_content": "Florida mortgage lenders don't have to pay interest on your escrow account funds, while many other states require it. They're also not required to tell you that you might be able to eliminate your escrow account entirely if you qualify. I started a petition asking the Florida legislature to change this. When lenders hold thousands of your dollars for property taxes and insurance without paying interest, they're profiting off your money while you get nothing. Plus, most homeowners don't even know they might have options. This affects every Florida homeowner with an escrow account - we're talking about real money that could be going back into families' pockets instead of padding lender profits. Anyone else think it's wild that we're just accepting this when other states have figured out how to protect homeowners? If this matters to you too, consider signing and sharing. https://www.change.org/p/ensure-fairness-in-florida-mortgage-escrow-accounts?utm\\_campaign=starter\\_dashboard&utm\\_medium=reddit\\_post&utm\\_source=share\\_petition&utm\\_term=starter\\_dashboard&recruiter=24770101",
        "comments": [
            {
                "raw_content": "Well, just don’t escrow your taxes and insurance then. Not all but a lot of borrowers have that option.",
                "author": "zorg-18082"
            },
            {
                "raw_content": "Florida legislature doing what's best for **average** homeowners.....god speed, sir.",
                "author": "Educational_Report_9"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Demand Is Picking Up, Toll Brothers Says. But the Builder Isn’t ‘High Fiving’ Yet.",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The builders are so full of crap. Demand drops from 100 to 20, and then they claim demand has skyrocketed by 10% when it goes to 22 LOL",
                "author": "LatiBerg"
            },
            {
                "raw_content": "My subdivision has been going crazy starting last week. More homes went pending in the last 7 days than I have ever seen. It's pretty crazy considering everything just sat the last 3 months. Noting was selling than all of a sudden, everything is. 70-80% of all the inventory in my subdivision is pending now. I think the serious buyers came out early thinking rates are going to go down, prices up etc..... I doubt it will last. Most likely the busy season will end early this year. But houses are still selling, people have money, life doesn't stop etc....",
                "author": "Janus9"
            },
            {
                "raw_content": "Last year, I heard commentary that Toll Brothers had investments in multi-family apartment living that weighed on their earnings. Since then, Toll Brothers is sticking to the \"Affluent Buyer\" because this is where the money is for housing. I looked up this info and this is what I got.... In 2025, Toll Brothers initiated a strategic exit from the multi-family apartment market selling a significant portion of its Apartment Living portfolio to Kennedy Wilson for roughly $380 million, with plans to fully divest remaining interests. This pivot allows the company to refocus on its core, high-performing luxury for-sale home business. Key developments in 2025: * **Portfolio Sale:** The company sold approximately half of its apartment portfolio, including the operating platform, to Kennedy Wilson, with the deal expected to close in late 2025 or early 2026. * **Strategic Shift:** The move is intended to reduce exposure to the \"choppy\" multifamily market and redirect capital toward growing its for-sale community count, which is projected to increase by 8% to 10% in FY 2026. * **Market Focus:** While exiting apartment rentals, the company continues to focus on luxury for-sale homes, capitalizing on strong demand from affluent buyers. * **Finalizing Projects:** Despite the exit strategy, the company continued to manage and develop certain projects in 2025, such as a 348-unit luxury community in Charlotte, NC.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI leaders in India raising and holding each other hands in solidarity(except dario and sam)",
        "score": 371,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An irl cringe masterpiece",
                "author": "gridoverlay"
            },
            {
                "raw_content": "That's hilarious 😂",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "Lmao. Gotta be awkward, Dario takes a lot of shots at Sam/openai without outright saying his or OpenAI’s name",
                "author": "socoolandawesome"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Gemini model imminent",
        "score": 372,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can tell because he said “Gemini”.",
                "author": "TheAerial"
            },
            {
                "raw_content": "Damn dude, they are getting real token efficient with their hype posting",
                "author": "VeganBigMac"
            },
            {
                "raw_content": "Gemini 3.1 almost certainly",
                "author": "CallMePyro"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Breaking: Elon Musk shares new delusions",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like he has no idea what he's talking about, as usual.",
                "author": "Mindrust"
            },
            {
                "raw_content": "In a recent podcast Nathan Lambert said that Cursor's custom model Composer is being updated every 90 mins. So maybe this type of thing is possible now, and even xAI is doing it. [https://cursor.com/blog/tab-rl](https://cursor.com/blog/tab-rl) >**Nathan Lambert** [(03:39:02)](https://youtube.com/watch?v=EV7WhVT270Q&t=13142) They’re in such a good position because they have so much user data. And we talked about continual learning and stuff; they had one of the most interesting blog posts. They mentioned that their new Composer model was a fine-tune of one of these large Mixture of Experts models from China. You can know that from gossip or because the model sometimes responds in Chinese, which none of the American models do. They had a blog post where they said, “We’re updating the model weights every 90 minutes based on real-world feedback from people using it.” Which is the closest thing to real-world RL happening on a model, and it was just right there in one of their blog posts.",
                "author": "Inevitable_Tea_5841"
            },
            {
                "raw_content": "Bro is just surrounded by yes men that tells him what he wants to hear",
                "author": "Worldly_Expression43"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bloomberg reports OpenAI close to finalizing first phase of a new funding round likely to bring in more than $100B, valuation could exceed $850B",
        "score": 112,
        "text_content": "Link to tweet: https://x.com/AndrewCurran\\_/status/2024310964632637852 Link to article: https://www.bloomberg.com/news/articles/2026-02-19/openai-funding-on-track-to-top-100-billion-with-latest-round",
        "comments": [
            {
                "raw_content": "Investors still trying to get in before an IPO, OAI milking it for what it's worth. I suspect though that there are internal models beyond gpt-5.3 that are too expensive to serve the public with current levels of compute but have enough capability to still wow investors. And there is surely an internal roadmap as to what they have planned for the next 5/10/15 years.",
                "author": "Infninfn"
            },
            {
                "raw_content": "People here are like others have better products, they don't make any money, this is crazy! I mean they have over a billion freaking users, grandmas knows what chatgpt is, it's THE synonym for AI for 100% of non tech savvy people. It took Amazon 10 years to start turning real profit. I have no idea what will happen with OpenAI but being surprised investors are throwing billions on the world's most famous and most used AI is just funny to read.",
                "author": "just_a_random_guy_11"
            },
            {
                "raw_content": "At this point the valuation feels less about current products and more about a long-term bet on compute, infrastructure, and strategic positioning.",
                "author": "Secure-Address4385"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elysium is a real representation of a possible AI future",
        "score": 279,
        "text_content": "I can’t help but think a future like Elysium is far more likely than the optimistic scenarios people talk about with AI and the singularity. Most people assume that once AI becomes advanced enough, it will benefit everyone, that it will create abundance and improve life across society. But technology has never automatically distributed itself equally. It tends to concentrate around the people who own and control it. If AI reaches the point where it can replace most or all human labor, then those who control that AI will no longer depend on the general population to maintain their wealth or systems. And once that dependency disappears, the incentives to maintain widespread prosperity disappear with it. For those who haven’t seen the movie, Elysium takes place in a future where Earth has become overcrowded, poor, and unstable. Most people live in harsh conditions, working dangerous jobs just to survive. Meanwhile, the wealthy live on a massive space station called Elysium, which is clean, safe, and filled with advanced technology. Their entire world is maintained by machines. They have access to medical devices that can cure any disease instantly, fully automated systems, and complete comfort. They don’t rely on the people on Earth for labor or survival anymore. Earth becomes something separate, almost irrelevant to their existence. What stands out is that the technology to help everyone already exists, but it isn’t shared. The people on Elysium don’t come back to fix Earth. They don’t reinvest in humanity. They simply live separately, because they can. The people on Earth are left competing for whatever jobs remain, even if those jobs are dangerous or meaningless, because human labor is no longer truly needed. They’ve lost their economic value in a system now run primarily by machines. This is why it feels relevant when looking at where things are going today. Wealth inequality continues to grow, and ownership of critical assets is concentrating into fewer hands. Firms like BlackRock and other massive asset managers are buying up housing, infrastructure, and large portions of the economy. The people making decisions at that level are already insulated from the day to day realities most people face. AI will amplify that insulation. It will allow fewer people to control more output, more systems, and more wealth, without needing large numbers of workers. People assume the singularity will uplift everyone, but if AI replaces the need for human labor entirely, then most people lose their economic leverage. And when the system doesn’t depend on you, there’s no built in reason for it to prioritize your well being. No one is required to step in and fix things. The system can continue functioning without you. That’s why Elysium feels less like science fiction and more like a logical endpoint. Not because of the space station itself, but because of the separation. A small group whose lives are fully maintained by AI and advanced technology, completely disconnected from the rest of humanity, while everyone else is left to fend for themselves in a world that no longer needs them.",
        "comments": [
            {
                "raw_content": "I just rewatch this movie over the weekend out of the blue and it's so good.",
                "author": "be-ay-be-why"
            },
            {
                "raw_content": "I remember thinking how absurd this scenario was. Like, why wouldn't they just give the tech to everyone? Why wouldn't they just create a livable earth for everyone, rather than spending all their money on a completely absurd space station. But the longer I live, the more I realize this is probably where we're headed. Maybe not a literal space station, probably more likely island countries, maybe a space station for tourism. But either way, the dynamic seems the most likely way AI will play out.",
                "author": "tollbearer"
            },
            {
                "raw_content": "So the people on Elysium simultaneously withhold AI tech from Earth while Earth has no jobs? The buildings in the image look like crap, why don't any humans tackle that?",
                "author": "Xemxah"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude after /Compact",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's pretty funny. I can definitely hear the family resemblance in his voice.",
                "author": "TurbidusQuaerenti"
            },
            {
                "raw_content": "sounds like he's not the only one who doesn't prepare",
                "author": "orangotai"
            },
            {
                "raw_content": "Vocal fry is in the family. I wonder what the mom sounds like. Probably the same timbre and pitch too.",
                "author": "MAGAHATESTHEUSA"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Lyria 3 Google Deepmind's music generator",
        "score": 425,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tell your son to go wash the dishes: No ❌ Compose a music for him telling him to go wash the dishes: yes ✅",
                "author": "mr_scoresby13"
            },
            {
                "raw_content": "I can't wait for Big Music to come after Big Google with their lawsuits and see who comes out on top.",
                "author": "SeaBearsFoam"
            },
            {
                "raw_content": "I've been able to use it for like an hour so far. In terms of audio quality, it is slightly ahead of Suno. Less artifacts, no noise, high fidelity even on tricky instruments (such as distorted guitars). However, in terms of composition and creativity, it does not perform very well. It is just ... boring.",
                "author": "Individual-Offer-563"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 3.1 Pro is now live on Vertex AI",
        "score": 20,
        "text_content": "Gemini 3.1 Pro is now live on Vertex AI, spotted on API of vertex, might be releasing today. **Source:** Vertex",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/psphshqm0fkg1.png?width=1604&format=png&auto=webp&s=f7ad2e28a2e0c828bd8ecc298f806ffe1feaf21c",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "nice. let us see benchmarks tomorrow",
                "author": "Wise-Direction9671"
            }
        ],
        "subreddit": "singularity"
    }
]