[
    {
        "post_name": "🚨🇦🇺 You cannot bring an apple into Australia because the government is afraid it will have a permanent effect on our ecosystem. But 550,000 third world immigrants per year is perfectly fine.",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Of course it is. That kind of rot has voting benefits. Apples can't vote. Yet.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "The murderous elite which currently administer the west",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Because our crops are the best in the world",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "STEVEN CROWDER: H-1Bs...if they're so great and 'the best,' why does INDIA still look like INDIA? LIBERAL: Look like India? What do you mean? CROWDER: Why aren't the 'best and brightest' turning INDIA into America number two?",
        "score": 94,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Keep the Indians in India. We don't need the third world street shitters.",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "And if you took any village in India, made everyone leave, and sent some good ole boys in, it would be thriving in months.",
                "author": "IPMang"
            },
            {
                "raw_content": "We’re being colonized by the Third World.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is how Hamtramck, Michigan became Gaza, America’s first Muslim-majority city.",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Time to send them back to their shithole country of origin",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "Gaza's kind of a convoluted example to use at the moment.",
                "author": "Account"
            },
            {
                "raw_content": "Block the roads in and out, cut the power, cut the water, stop all deliveries.",
                "author": "indefatigable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I really love how Egypt decorated their wall! We should do the same! We should decorate ours with red and green barbwire for Christmas! 🎄",
        "score": 23,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Add Christmas lights. Make it an electrifying experience.",
                "author": "benjovikenobi"
            },
            {
                "raw_content": "Some dead illegals, caught in the concertina wire, being picked at by birds would be festive",
                "author": "Chuj"
            },
            {
                "raw_content": "Add high voltage to increase the festive mood",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar’s net worth…",
        "score": 971,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# D E P O R T *...but only AFTER confiscating all this chimp's wealth!!!*",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "Evil America and the White Man must not be that bad...She is also currently banging a White Man... Just like AOC, Kamel Toe, and a bunch of other liberal non White women who supposedly hate Straight White Men... yet they can't get enough White Cock :p",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "Hasn't done a damn thing to be worth that fucking much. Like nancy Pelosi, aoc, Schumer....",
                "author": "giggitybooped"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Classic",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfection lol",
                "author": "Mamapedia"
            },
            {
                "raw_content": "Those are just soy boys. Predditors are gender confused, commie faggots.",
                "author": "godgoldnguns"
            },
            {
                "raw_content": "I was just reading a Franklin thread on Reddit from 3 days ago, it's crazy how these guys don't understand that they are the bad guys lol",
                "author": "JohnyBlaze99"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FREE TINA!",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grow a set Trump! Send the Marshall's to get her. You can just DO THINGS! Just leaving a Hero Patriot Gold Star Mother in Prison for exposing Election Fraud in Dominican Machines isn't a fucking option",
                "author": "ACActual"
            },
            {
                "raw_content": "Polis isn't even his real last name, and he is a fag. He also has something in common with Jena Griswold, SOS of CO. Some people are a real problem.",
                "author": "Givesgunstogrannies"
            },
            {
                "raw_content": "Eventually even the die hard boomers on this site will have to admit that jews as governor are working against Trump. Pennsylvania, North Carolina, and Colorado. All share allegiance to th same and it isn’t America.",
                "author": "DefenderDad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Reason Food Is Expensive",
        "score": 1420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Same reason as tuition fees and insurance rates, government with infinite money will pay any price.",
                "author": "utfanx2"
            },
            {
                "raw_content": "Not only that but ever since self checkout became a huge thing at many stores. A huge amount of theft happens now. And rather than addressing the theft the stores are compensating by raising the price to those of us who pay for stuff.",
                "author": "SaltyInvestor"
            },
            {
                "raw_content": "That, and the government forcing the destruction of food",
                "author": "Fresnor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRANNYIZIM. TIME TO PURGE THESE PSYCHOS...",
        "score": 657,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about no, none of these TSA people should be touching anyone.",
                "author": "Roadpower"
            },
            {
                "raw_content": "The TSA's very existence violates every single one of my rights, particularly my 4th Amendment ones.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "What the fuck? Maybe this will lead to the dissolution of the TSA",
                "author": "EastTexasMadLad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe we’ll get a Car with some Soul again",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Get rid of the start-stop button!",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Next thing he needs to do is get rid of mpg requirements and let us get a car with less than 10 gears.",
                "author": "Viewer01"
            },
            {
                "raw_content": "Drop the chicken tax so I can get a $13000 Toyota. Fuck these $50k+ base trim cars, even if they are American",
                "author": "LogicCircuits"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS Issues Rule to End Automatic Renewals for Work Permits",
        "score": 1009,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm sure this will only be landscaping people, but for the love of God please clear out the townhomes near me that are full of jeets on expired visas.",
                "author": "HelluvaEngineer"
            },
            {
                "raw_content": "Oh no who will pick muh lettuce? -- John McCain.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Every government program gets abused. They're not leaving on their own. Make them appear in person for renewals and board them on a plane back to where they came from.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It is RACIST to not let foreign terrorists kill Americans in order to make a little money!",
        "score": 674,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They are independent owner operated pharma companies.",
                "author": "bringbackthe80s"
            },
            {
                "raw_content": "He's on the cartel payroll.",
                "author": "WhatsFappening"
            },
            {
                "raw_content": "Undocumented pharmacists",
                "author": "SpaFixr"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House Dems Release 'Selective' Never-Before-Seen Epstein Island Pictures, Video",
        "score": 555,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">never before seen https://scored.co/c/TheDonald/p/1ARd8Rqq0H/",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Now...the Republicans should release the un-redacted photos along with the rest of them.",
                "author": "Moebius"
            },
            {
                "raw_content": "O'Keefe and Bobert have something to say about this \"never-before-seen\" claim - https://patriots.win/p/1ARd8Rqq0H/hey-oversightdems-nice-try-steal/c",
                "author": "CatalystForChange"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Constitutional Observers 😂😆😅😭🤣 What a bunch of larping faggots",
        "score": 1006,
        "text_content": "",
        "comments": [
            {
                "raw_content": "By all means, record and post that shit. Please. Look what a goldmine body cams turned out to be.",
                "author": "skuts"
            },
            {
                "raw_content": "They're probably not even doing anything. Just collecting phone numbers and email addresses from suckers, to build a fundraising list.",
                "author": "Deplora"
            },
            {
                "raw_content": "I really... don't like to hate people... especially fellow Americans... and these people make it hard. Are they so illiterate that they actually believe everyone has some enshrined right to enter the US and stay here indefinitely, even though they are not a citizen and / or they came in illegally? Further, NO ONE HAS AN INHERENT RIGHT TO ENTER THE UNITED STATES WHEN THEY ARE NOT A CITIZEN. How the fuck did we get to a place where people think someone's rights are being violated just because we don't want a bunch of freeloading criminals who hate us to be allowed to stay here? OR TO EVEN ENTER IN THE FIRST PLACE? This is the United States and it belongs to UNITED STATES CITIZENS NOT TO THE ENTIRE FUCKING WORLD. Go the fuck home and show some initiative to do something to change your own fucking countries so they don't fucking suck! If you are sincere, maybe we'll even throw you some help. And maybe we won't! Either way, it's up to you to fix your fucking country, NOT US!",
                "author": "HeavenlyTrumpets"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is the greatest accomplishment yet, because that shit bag in the senate wont get stuff done.",
        "score": 408,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That button was the covid mask of the car industry. Fucking idiotic and annoyance to everyone.",
                "author": "invalid_data"
            },
            {
                "raw_content": "???",
                "author": "BidensPrisonWallet"
            },
            {
                "raw_content": "Our October chimp out is paying dividends bros. My one regret is that Trump is alone in this and the gop is awful.",
                "author": "Viewer01"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This winter, the forecast calls for ICE.",
        "score": 646,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# I C E # I C E # B A B Y",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "kudos to their social media team. american military and adjacent orgs were trying to cater to gay faggots under obama and biden and the world laughed at us while recruitment shriveled up. men don't want to serve their country if they're not going to look cool as shit while doing it.",
                "author": "stargunner"
            },
            {
                "raw_content": "I voted for this!!!",
                "author": "jeb_is_a_mess"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MyPillow CEO Mike Lindell has filed paperwork to run for governor of Minnesota as a Republican, potentially facing off against Tim Walz if nominated.",
        "score": 2014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Godspeed Mike Lindell! He's been through Hell and now it's his turn to give them Hell. Minnesota needs you badly. President Trump has to make sure the election isn't rigged, like it has been for decades!",
                "author": "TheAftermath"
            },
            {
                "raw_content": "They get Lindell and we get Ramaswamy in Ohio...not fair.",
                "author": "Hambonemcgee"
            },
            {
                "raw_content": "[Archived Article](https://archive.is/qmM1d) MyPillow CEO Mike Lindell has filed paperwork to run for governor of Minnesota, creating a campaign committee that will allow him to raise money. The Mike Lindell for Governor committee was registered with the state’s Campaign Finance Board on Wednesday. In an interview Wednesday morning, Lindell told the Minnesota Star Tribune that his run for governor “isn’t 100% yet,” but he intends to announce his decision at a news conference next week. “I am going to announce either way on Dec. 11,” Lindell said. Lindell told the Star Tribune in October that he had polled hypothetical matchups against Walz and other Republicans running for governor. “If there was someone to win, it would be me,” Lindell said of the GOP field.",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Under The Sea! Narco Boats! Garrison",
        "score": 666,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Patrick can't get any higher...",
                "author": "barwhack"
            },
            {
                "raw_content": "Garrison: https://grrrgraphics.com/under-the-sea/",
                "author": "Capoditutticapi1"
            },
            {
                "raw_content": "Missed opportunity to draw Cocaine Mitch as a sea turtle",
                "author": "Salt_n_Pepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I’m sure it’s a coincidence",
        "score": 1328,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When foreigners fly their flags over your land you have been conquored.",
                "author": "Bythrfruitsyknow"
            },
            {
                "raw_content": "Something Mike Lindell could run on, deporting Somalians and bringing back Minnesota's original flag.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Their new flag is shit regardless of its origin. Should be put back as it was.",
                "author": "HeavenlyTrumpets"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It hurts them to be reminded of what they are meant to be 🧐",
        "score": 576,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Islam is a cancer and Muhammad was a child rapist. 2. I agree with Pepe. 3. Why are we pinning Islamic sand turds? ... a broken clock is correct twice a day you know.",
                "author": "24601"
            },
            {
                "raw_content": "Boy imagine if patriots.win had location information on posters.",
                "author": "Than0sIII"
            },
            {
                "raw_content": "I think my favorite explanation is, “women aren’t supposed to be able to do everything a man can do, they’re supposed to do the things a man can’t do”.",
                "author": "Hckyhillbilly"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don't Build a PC Right Now. Just Don't",
        "score": 309,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Or read the writing on the wall: The best time is now as it’s only getting worse for the next two years!",
                "author": "Justhe3guy"
            },
            {
                "raw_content": "Buy a prebuilt and re-case it if you want. Grabbed the g729 at microcenter for $1432 (open box) and priced out it would have been almost $2,100",
                "author": "imdabesss"
            },
            {
                "raw_content": "Or if you can somehow get deals or used stuff. Do it right this second because prices will likely go nuts for the next few years.",
                "author": "Yourdataisunclean"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Micron to exit ‘Crucial’ consumer memory business",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Us consumer peasants are going to have to scrounge for parts in the data center scrapyard pretty soon.",
                "author": "VeritasLuxMea"
            },
            {
                "raw_content": "There goes 99% of the laptop memory upgrade market. Now everyone will have to dig through scraps to try to find something that will work, since Crucial was the only one who would include all intermediate JEDEC profiles on their kits, which, for example, would allow a 3200 kit to run at 2933, 2666, 2400, etc. Now it's back to the wild west days where you have no idea what profiles are included and will probably have to find the exact speed your system uses rather than a \"universal\" SO-DIMM that can work regardless of the speed bin required by the system. Glad I sold my shop and don't have to deal with this crap directly anymore.",
                "author": "ThisAccountIsStolen"
            },
            {
                "raw_content": "Holy shit. They exited Ballistix and now this? No wonder their DDR5 offering was so pathetic",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel to Retain Networking and Edge Division After Spinoff Review as Financial Outlook Improves",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bet they regret selling their NAND production division to SK Hynix, too.",
                "author": "AK-Brian"
            },
            {
                "raw_content": "So they're keeping the same division that still can't seem to design a solid reliable multi-G NIC?",
                "author": "Kougar"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA 590 Linux drivers drop GeForce GTX 900 “Maxwell” and GTX 10 “Pascal” support",
        "score": 229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This wouldn't really be a problem if these cards didn't require proprietary firmware to use properly unless you want them stuck at the lowest clock speed. It makes them near enough the *only* cards on Linux that will be entirely unsupported by any updated driver.",
                "author": "levelstar01"
            },
            {
                "raw_content": "Those cards were always in awkward middle ground for Linux. Too recent for Nouveau, too old for the proprietary drivers. Either way you were giving up performance and having a buggier experience, especially with Wayland. Not surprising to see them end feature support given they're a decade old.",
                "author": "Pugs-r-cool"
            },
            {
                "raw_content": "I'm outraged! These cards are only, **checks notes**, 11 years old! And why are modern games so unoptimized that my GTX 960 (which I'm *\"ROCKING\"*), can't run them? Unacceptable. Putting an /S here. Just to be sure.",
                "author": "IshTheFace"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Dell Pro Max no more: Leak reveals Dell Pro Precision 7 16 laptop with Intel Panther Lake processors",
        "score": 9,
        "text_content": "> A new leak has revealed that Dell will soon be rebranding its professional laptops again. Despite ditching its Latitude, Inspiron and Precision brands less than a year ago, it looks like Dell will soon replace the Pro Max 16 Plus with the Dell Pro Precision 7 16.",
        "comments": [
            {
                "raw_content": "Literally every computer product naming convention is a clusterfuck these days...except Apple I guess. Why do they do this?",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "Hello Balance-! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "We'll see whether AMD has more reserves with soldered RAM on their Strix Halo CPUs or if Intel is screwed having OEMs and customers purchase their own RAM upgrades from 16GB",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core 5 210H vs. AMD Ryzen AI 5 330: Budget performance battle",
        "score": 48,
        "text_content": "> As shown by our benchmarks below, the Core 5 210H outperforms the Ryzen AI 5 330 by roughly 50 percent when it comes to raw multi-threaded operations and between 10 to 30 percent for integrated graphics performance. The data is pulled using the same Lenovo Ideapad Slim 5 16 model which can be configured with either Intel or AMD CPUs for a fairer comparison. > > The main drawbacks to the faster performance of the Intel is that power consumption is slightly higher and it lacks an integrated NPU. When running Prime95, for example, the Intel model would draw 68 W or almost 50 percent more than on the AMD model running the same test. Thus, performance-per-watt isn't necessarily higher even if raw performance is noticeably greater. Fortunately, battery life is still quite long at over 11 hours of web browsing despite the higher power demands when running demanding loads. > > Users who can exploit the integrated NPU on the Ryzen AI 5 330 may also prefer it over the Core 5 210H. The Raptor Lake-H family of processors lacks an integrated NPU meaning poorer support for AI-driven features like Co-Pilot+ and local AI-enhanced photo editing.",
        "comments": [
            {
                "raw_content": "Laptop CPU naming scheme is a real mess",
                "author": "FitCress7497"
            },
            {
                "raw_content": "I LOVE LAPTOP CPU NAMING SCHEMES THAT MAKE 2 GEN OLD CHIPS SOUND MODERN!!!!",
                "author": "EnglishBrekkie_1604"
            },
            {
                "raw_content": "I don’t understand why they pit them together: sure 10-30% more performance, _at 50% more power consumption_. Why not comparing it to an AMD with the same power consumption? It may give better performance… Edit: I also like that they say “Intel consumption is _slightly higher_”, and on the next sentence “…would draw 68W or _almost 50% more_”. Article is clearly written by Intel PR…",
                "author": "TRKlausss"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Launches SU45P and SU60P Spartan UltraScale+ FPGAs",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The FPGA have a Gen4x4 interface. A short summary from the article: >Enable high-speed connectivity through 16.3G transceivers and PCIe Gen 4 interfaces, delivering fast data transfer and low latency for machine vision and networking systems >Support mixed-voltage I/Os including 3.3 V and lower-voltage standards, allowing easy integration of both legacy and high-speed I/Os on a single device >Simplify system integration and accelerate design cycles by allowing engineers to seamlessly connect and synchronize diverse sensors, optical modules, and control interfaces >Spartan UltraScale+ SU45P and SU60P FPGAs will have early access Vivado tool support in 1H'26 with silicon availability in 2H'26.",
                "author": "narwi"
            },
            {
                "raw_content": "I’m really curious how much these cost. The data rate is high end but the logic amount attached to it is not super high. Would AMD sell these to you for $60 each if you were a customer they cared about?",
                "author": "NewKitchenFixtures"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Teases Exynos 2600 Chip With Refined Cores For Galaxy S26",
        "score": 25,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I've owned a Galaxy S22 and now a S25, the problem with Exynos hasn't been performance. Hell, even battery life was getting okay, not great but workable. What kills Exynos is the dogshit modem. It's super slow to switch networks and has worse reception. When crossing over the border (Europe, so that's easy, I do it daily) with my S22 I had to manually change networks. And just searching available networks took 30 seconds or more. Galaxy S25 with Snapdragon and the network search takes like 5 to 10 seconds max. And usually it manages to switch on its own without issues. I also got signal now deeper in the store where my S22 refused to work. Same Android version etc. it's really the chipset. I'll never again buy an Exynos phone.",
                "author": "Vlyn"
            },
            {
                "raw_content": "First 2nm chip to be released. I am curious about thermal performance.",
                "author": "Regular_Eggplant_248"
            },
            {
                "raw_content": "As always, the true value of Exynos can only be known through actual performance. If this node fails, Samsung Foundry is truly finished. They know this as well.",
                "author": "No-Needleworker-8071"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Steam Machine today, Steam Phones tomorrow [Valve interview]",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "tl;dr > **Will there be SteamOS phones? Will you bring non-gaming apps into the store in a big way?** > We have done things around phones with the Steam Link app. I don’t know if that’s going to be a big focus for us to develop local content or try to develop SteamOS for devices like that. I mean, I’m not discounting any possibility, but I think with just living room, handheld, and desktop, trying to have a good outcome for gaming applications and everything else you’d want to do in a desktop, we have a ton of work to do.",
                "author": "No-Improvement-8316"
            },
            {
                "raw_content": "[Full article.](https://web.archive.org/web/20251202195552/https://www.theverge.com/report/820656/valve-interview-arm-gaming-steamos-pierre-loup-griffais)",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "Somehow FEX still isn't notable enough to be allowed on [wikipedia](https://en.wikipedia.org/wiki/FEX-Emu).",
                "author": "anthchapman"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Stunned how good Prime 4 looks within first hour",
        "score": 403,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It really does. Retro is a master of using mostly baked plus some tasteful dynamic lighting to achieve great visuals. Only one small note for the Switch 2 version in particular: the shadows aren't quite dynamic enough. Self-shadows are only there for the cutscenes, and dynamic shadows are only for Samus and enemies. Furthermore, the shadows' position never moves, as if the light source is always directly above the characters. I'm a actually a bit disappointed Digital Foundry didn't cover this in their review. There are so many interesting technical choices Retro made that deserve to be broken down in detail.",
                "author": "threeinacorner"
            },
            {
                "raw_content": "Im excited to hear player reviews kf this game.",
                "author": "Fresh-Chemical-9084"
            },
            {
                "raw_content": "Am I preloading games wrong? I thought I have the preorder downloaded but every time it takes an additional 30 min to download data after the game card is inserted.",
                "author": "Rob62"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Turned up a day early",
        "score": 292,
        "text_content": "Sadly I won't get to play it until tomorrow anyway ☹️ (ordered from John Lewis UK)",
        "comments": [
            {
                "raw_content": "Nice! Mine was supposed to be same day delivery but it just got changed to FedEx shipping so I expect one of my neighbors to receive it sometime next week.",
                "author": "Fit_Buy_889"
            },
            {
                "raw_content": "Got mine about an hour ago, which is actually on time as I’m in Australia 😅👍",
                "author": "KRiSX"
            },
            {
                "raw_content": "Lucky, mine’s gonna be a day late",
                "author": "TFS0ul"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The only way I'm playing Metroid Prime 4",
        "score": 42,
        "text_content": "I bought this for work a while ago but it doubles as a great way to enjoy mouse mode on the couch.",
        "comments": [
            {
                "raw_content": "I lied, it's not the only way I'm playing. Handheld mode is so fire, 120fps is insane wow",
                "author": "Time_Substance_7829"
            },
            {
                "raw_content": "I really need to order one of these and a mouse grip.",
                "author": "DistilledWonder"
            },
            {
                "raw_content": "Lol I put my tablet on a pillow and use it for that (not on the screen, it has a book cover)",
                "author": "4-l8qZ0tJ2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Sonic Racing Crossworlds Switch 2 Edition + Upgrade Pack available now!",
        "score": 112,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Upgrade pack is 50% off until Dec 12!",
                "author": "jordanbelinsky"
            },
            {
                "raw_content": "They did such a good job with this port, it looks so clean, even after having played the PS5 version for a while. Genuinely looks better than some other Switch 2 games.",
                "author": "YoAnts"
            },
            {
                "raw_content": "Ooo maybe this will be a new turning point for Sega and allow other games to have upgrade packs.",
                "author": "Rozenxz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metriod prime 4 will be my first metriod game.",
        "score": 105,
        "text_content": "I typical hate first person shooters i just dont like first person camera views always perfer 3rd person and feel like shooters typical play the same. How ever from trailers and such this looks really good dont get the talk of people saying the marketing is bad. Highly looking forward to it. Anyone else looking forward to metriod tomorrow has your first metriod game?",
        "comments": [
            {
                "raw_content": "This would be my 7th Metroid game but what a great intro getting into the prime series. Would be cool to get your opinion on this game and if you like a lot to maybe play prime remastered to get a feel for the first game that started the trilogy.",
                "author": "laguilar90"
            },
            {
                "raw_content": "Sweet. Hope it turns you into a fan of the series! Metroid has some of the best games ever made imo",
                "author": "logica_torcido"
            },
            {
                "raw_content": "You should buy Metroid Dread and Prime remastered when you’re done with this",
                "author": "froot_loop_dingus_"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Metroid Prime 4: Beyond NSO icons are now available",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man but I just put up my Metroid II icon lol",
                "author": "The-student-"
            },
            {
                "raw_content": "unironically want to choose myles lmao",
                "author": "Jaraghan"
            },
            {
                "raw_content": "Chose Myles so the fans never forget.",
                "author": "Nos9684"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Special Release: Metroid Prime 4: Beyond - Nintendo Music",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The main theme is insane, holy shit.",
                "author": "linkling1039"
            },
            {
                "raw_content": "I’m going to need some new Metroid Metal of this!",
                "author": "Tarancholula"
            },
            {
                "raw_content": "I kind of saw it coming since they didn't release any music this Monday.",
                "author": "Williekins"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin's creed shadows tech review by digital foundry",
        "score": 126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Portable is impressive, but docked needs work? Thats the exact opposite impression I've heard from people online smh. Which is it?",
                "author": "lastblackman"
            },
            {
                "raw_content": "Definitely something to let them work on some more and consider grabbing in a sale. Post launch updates for SW Outlaws has been great. It's a good sign that we're getting bigger AAA ports like these on the Switch 2 so early in its lifecycle.",
                "author": "gladexd"
            },
            {
                "raw_content": "I find it a bit bizarre they went with porting shadows, when they could’ve gone with Mirage which already has last gen versions",
                "author": "SuicideSkwad"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kurakasis: Big Star Wars game announcement is coming very soon. (not Star Wars: Zero Company or Eclipse)",
        "score": 662,
        "text_content": "[https://xcancel.com/Kurakasis/status/1996337045921493050](https://xcancel.com/Kurakasis/status/1996337045921493050)",
        "comments": [
            {
                "raw_content": "3rd Jedi Survivor game teaser?",
                "author": "arteg489"
            },
            {
                "raw_content": "Kotor, please? 🙏",
                "author": "Green_J3ster"
            },
            {
                "raw_content": "Star Wars Battlefront III (Just guessing, and yes I know it's not that non existent game) 😔",
                "author": "Keevin-Rabbit"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prince of Persia: The Sands of Time Remake is NOT going to be shown at The Game Awards",
        "score": 284,
        "text_content": "Tweet by the official Prince of Persia account confirming their absence from The Game Awards: [https://xcancel.com/princeofpersia/status/1996323369080250412?s=20](https://xcancel.com/princeofpersia/status/1996323369080250412?s=20) Link to the original post about NateTheHate stating that he thinks the Prince of Persia: The Sands of Time Remake won't be shown at The Game Awards: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p944xq/natethehate\\_states\\_he\\_doesnt\\_think\\_prince\\_of/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1p944xq/natethehate_states_he_doesnt_think_prince_of/)",
        "comments": [
            {
                "raw_content": "I mean... It's only a remake and it's only been delayed like a dozen times and it's only supposed to come out next month.. they have no reason to show the game, right? This means they are super confident in their product. For sure!",
                "author": "mighty_mag"
            },
            {
                "raw_content": "A shadow drop during an Xbox developer showcase in January, with it being available on Gamepass and PS+ games catalogue day 1 seems like a very Ubisoft thing to do tbh",
                "author": "Sambadude12"
            },
            {
                "raw_content": "You heard it here first, it'll be a mystery game at the Xbox dev direct and it'll shadow drop",
                "author": "Brokenbullet14"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson/Insider Gaming - Eidos Montreal Was Working on a Legacy of Kain Reboot Before Embracer Buyout",
        "score": 384,
        "text_content": "[https://insider-gaming.com/legacy-of-kain-reboot-eidos-montreal/](https://insider-gaming.com/legacy-of-kain-reboot-eidos-montreal/) Never played LoK but damn bad news because such cool shit getting canned and people being laid off.",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Why can't we ever have nice things?",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "![gif](giphy|goQ4bc8X0Lh6w)",
                "author": "Mindless_Stuff9179"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Possible ARG for Control 2 or tease for Control 2 announcement at TGA in latest Jesse Cox video.",
        "score": 359,
        "text_content": "latest video from Jesse Cox about the Siren Society ARG in the Alan Wake 2 FBC DLC. The code: (8ecEe) is shown at the end of the video. [https://www.youtube.com/watch?v=VLS-NFKoOdY](https://www.youtube.com/watch?v=VLS-NFKoOdY) Might be teasing something for Control ahead of the TGAs",
        "comments": [
            {
                "raw_content": "I see a vision rising, dreary",
                "author": "DeadlyDY"
            },
            {
                "raw_content": "Would we see something for Control before the Max Payne remake though? Edit: I will fucking lose my shit if we see Control 2 here. Been replaying it/playing the DLC and it has pushed its way into my top 10 games ever. The edibles help.",
                "author": "Mindless_Stuff9179"
            },
            {
                "raw_content": "I've got an email from hello@officialpoe.com with a link for the site. It says something about a chance of working with POE and Sam Lake. Basically a giveaway",
                "author": "s0rses"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"LEGO Batman: Legacy of the Dark Knight\" is targeting an April-May release",
        "score": 245,
        "text_content": "[source](https://xcancel.com/zayinpriv/status/1994878118096507036) This according to the admin of Lego Game News. It's also claimed that TT Games next title is in early development, and that it'll be similar to Batman.",
        "comments": [
            {
                "raw_content": "\"Oh man, I booked time off from work to play GTA 6 in May! What am I gonna do now?\" Lego Batman: ![gif](giphy|l0ErK5H6exTmBN7ri)",
                "author": "Spider-Fan77"
            },
            {
                "raw_content": "![gif](giphy|W4cPZ2lCcVTbphhzj9)",
                "author": "FransD98"
            },
            {
                "raw_content": "Haven’t played a Lego game in a while. Can’t wait.",
                "author": "Ornery-Tonight1694"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "During Horii’s latest “KosoKoso Hōsō Kyoku” talk show livestream, Yuji Horii was asked whether there were any developments coming after the 2026 Chrono Trigger celebrations: “Wait, if I say that, you’ll figure it out!”, “Don’t ask!”, “Asking is off-limits!”, and “I’ll get in trouble!”",
        "score": 224,
        "text_content": "> During Horii’s latest “KosoKoso Hōsō Kyoku” talk show livestream, the series’ interviewer mentioned she was curious about the current buzz surrounding Chrono Trigger and whether it was “foreshadowing” for something bigger. When Horii asked what she meant by “buzz,” former Shonen Jump Kazuhiko Torishima (another regular member of the talk show) cited a few recent Chrono Trigger-related projects, such as character popularity polls and orchestral concerts planned for 2026. After Horii acknowledged that the concerts would take place next year, he was then asked by Torishima if there were going to be any developments in the franchise after the celebrations. > To this, Horii replied with “I can’t talk about that,” before immediately becoming flustered, jokingly adding comments like, “Wait, if I say that, you’ll figure it out!,” “Don’t ask!,” Asking is off-limits!,” and “I’ll get in trouble!”. The whole panel then burst out in laughter and moved on with the show. Before the topic was switched, however, Torishima cheekily comments “There’s something,” signaling his belief that a potential remake may be on its way. Source: https://www.youtube.com/watch?v=nq1II1jaiuA&t=6628s https://automaton-media.com/en/news/chrono-triggers-original-supervisor-yuji-horii-says-i-cant-talk-about-it-dont-ask-and-ill-get-in-trouble-when-asked-about-new-developments/",
        "comments": [
            {
                "raw_content": "call me a pessimist, but this feels more like after the mistranslation thing a few months ago, he got some kind of directive from Square higher-ups to just avoid talking about it altogether rather than like, a playful hint",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "They really are just teasing after that whole debacle at the comic con he was at earlier this year with the translator making up stuff aren't they...?",
                "author": "LoneWolfTifa"
            },
            {
                "raw_content": "I know it's probably an unpopular opinion, but I would like a 3d remake of Chrono Trigger, I've played the original so many times, if I wanted the same thing I would play it again, a 3d remake would feel more like a new experience.",
                "author": "powerhcm8"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Double Black Client partnering with Toys for Bob as a client. Game is listed as an Adventure game",
        "score": 172,
        "text_content": "Seems we have some idea of what Toys for Bob’s next game is going to be. The website for Double Black Client is listing the company as a client and it says it’s for an adventure game. https://doubleblackcap.com/#Clients",
        "comments": [
            {
                "raw_content": "Who is double black?",
                "author": "Brokenbullet14"
            },
            {
                "raw_content": "Hoping it’s either Crash 5 or Spyro 4. Also hoping that, regardless of what it is, they improve the game’s 100% requirements",
                "author": "Content_Detail1467"
            },
            {
                "raw_content": "I hope we don’t have to wait too long for an announcement. Even if it’s still a ways off, it’d be nice to know if the Spyro series is still alive or not, given how long it’s been since both the remakes and especially a new game. A Spyro 4 reveal at The Game Awards would more than justify watching the event for me.",
                "author": "Spinjitsuninja"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Sakura Wars announcement possibly coming next year for the 30th anniversary as the official SEGA's Japanese Twitter account for the series has once again became active",
        "score": 109,
        "text_content": "About a year ago Tom Henderson has reported that Panzer Dragoon, Neon Genesis Evangelion, and Sakura Wars will be part of Sega's ‘New Era, New Energy’ where they bring back beloved series. -- previous discussion regarding that on this sub is present here: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1949f59/3_more_sega_classics_are_set_to_make_their_return/ The official Japanese Twitter acount (xcancel link: [link](https://xcancel.com/Sakura_Taisen)) hasn't really been active for years beside retweeting tweets related to Sakura Wars (Famitsu's release anniversary posts, etc.) or tweeting out about two specific voice actors who recently sadly passed away. The last time account saw major activity was during the 25th anniversary and when the Sakura Wars cast joined Super Robot Wars series. Since September 27th, the account saw major rise in activity. On 27th they officially posted the 29th anniversary tweet (xcancel tweet: https://xcancel.com/Sakura_Taisen/status/1971681184762810673) and have since then regularly posting Happy Birthday tweets for Sakura Wars characters (examples: xcancel links: https://xcancel.com/Sakura_Taisen/status/1980378496569675915, https://xcancel.com/Sakura_Taisen/status/1974942677608141112, https://xcancel.com/Sakura_Taisen/status/1987988634872545678, and more on the official account). They haven't been doing anything like that previously by the way. I think Sega is getting ready to announce the new game soon (and I personally hope HD remasters of original games. If anyone is interested in checking out the series, original Sakura Wars has been fan translated for the Sega Saturn years ago and the sequel got fan translated this year - also for the Sega Saturn).",
        "comments": [
            {
                "raw_content": "Neon Genesis Evangelion, eh? perhaps they'll be handling the long awaited Western release of [Misato Katsuragi's Reporting Plan.](https://www.giantbomb.com/katsuragi-misato-houdou-keikaku/3030-26612/)",
                "author": "scott1swann"
            },
            {
                "raw_content": "Would be pleasantly surprised. The reboot probably underperformed and then their Hail Mary gacha game bombed. Trying again in so short a time would be rather bold in and of itself.",
                "author": "Rozwellish"
            },
            {
                "raw_content": "Latest game was kind of K-Pop Demonhunters before K-Pop Demonhunters",
                "author": "jordanleite25"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD confirms EPYC Embedded 2005 \"Fire Range\" and Embedded Venice series with up to 96 Zen6 cores",
        "score": 29,
        "text_content": "",
        "comments": [],
        "subreddit": "amd"
    },
    {
        "post_name": "The wannabe real estate moguls going bust",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "***From Business Insider's James Rodriguez:*** While the average American submits to a financial colonoscopy en route to their dream home, wannabe real estate moguls have found a way to sidestep the hassle. With the help of a once-obscure type of loan, they've built mini-empires ranging from a few homes to a few hundred — without the usual scrutiny from lenders. These landlords include small-time investors eager to expand their portfolios, TikTok tycoons seeking new streams of real estate revenue, and seasoned property managers looking to make smart bets. In recent years, they've taken out billions of dollars' worth of \"debt-service coverage ratio\" loans — often abbreviated as DSCR — to hoover up homes. The loans enable income-seeking owners to quickly purchase rental properties while dodging annoying questions about their job history or outstanding debts. DSCRs may sound complicated, but obtaining one is relatively straightforward: A landlord just has to show their lender that the desired property will generate enough rent to cover the monthly payments and other basic expenses, such as taxes and insurance. The lender focuses on the property's cash flow, not the borrower's personal creditworthiness. For some of these landlords, the cash isn't flowing as planned. Serious delinquencies on DSCR loans have nearly quadrupled in the past three years, data from the real estate analytics firm Cotality shows. Although the troubled loans account for only a small fraction of the total dollar amount of outstanding DSCR loans, they're a sign that debt-laden landlords face shakier economics amid a rental market slowdown. And while people in the industry defend the idea behind the loans — \"It's still a great product,\" one lending veteran tells Business Insider — they acknowledge the spread of some sketchy practices that contributed to the spike in bad debt, including ambitious rent targets, hasty approvals, and loans for properties where the rental income wouldn't even cover the basic monthly payments. [Read more about how real estate investors taking out DSCR loans could be in trouble here.](https://www.businessinsider.com/landlords-dscr-loans-delinquencies-real-estate-investor-trouble-2025-12?utm_source=reddit&utm_medium=social&utm_campaign=insider-rebubble-sub-comment)",
                "author": "businessinsider"
            },
            {
                "raw_content": "The riskiest thing about DSCRs is the financing cliff you face at balloon refinance. These are basically super aggressive ARMS. You may have gotten a DSCR mortgage on a rental property in 2021 for 3.9%, but now that loan has to be refinanced in 2026 for 7%+. I'm currently in that exact situation on 3 buildings I have DSCRs on, and upon refinancing they will go from being good cash flowing investments to money sinks. Luckily, I planned for this and have them going to market shortly. If I can sell them at current market rate, I got out free and clear. If I can't sell them, then I will have to refinance and then the Trainwreck begins.",
                "author": "DIYThrowaway01"
            },
            {
                "raw_content": "Why do they never give direct numbers only salacious headlines?",
                "author": "gaelorian"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Private payrolls dropped 32,000 positions in slowing sign for the economy",
        "score": 100,
        "text_content": "",
        "comments": [
            {
                "raw_content": "my very first reason for being a housing bear was that i don't think the US labor market is going to hold up long term. and that thesis hasn't changed. where is the sudden boom in employment we need going to come from? we're just going to keep bleeding jobs until it becomes a serious problem.",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "DURING THE CHRISTMAS HOLIDAY SEASON..... THAT SEEMS IMPORTANT",
                "author": "ErictheAgnostic"
            },
            {
                "raw_content": "It's okay guys! I see tons of people shopping and eating out at restaurants. Also, Amazon hired thousands of seasonal employees for the shopping season. Never mind that Amazon does this every year. Everything is fine!",
                "author": "beardko"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "House Price Appreciation by State and Metro Area: Third Quarter 2025",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "House prices continued to rise in the third quarter of 2025, though the pace of growth slowed as elevated mortgage rates, affordability challenges, and persistent economic uncertainty weighed on consumer demand. After several years of rapid growth, Hawaii and 38 metro areas saw house price declines this quarter, highlighting significant regional variations in market conditions. Nationally, according to the quarterly all-transactions House Price Index (HPI) released by the Federal Housing Finance Agency (FHFA), U.S. house prices rose 3.3% in the third quarter of 2025, compared to the same period in 2024. This represents the slowest year-over-year price appreciation since 2013, indicating a cooling in the housing market following a decade of robust price growth. The FHFA’s all-transactions HPI tracks average price changes based on repeat sales and refinancings of the same single-family properties. It offers insights not only at the national level but also across states and metropolitan areas. Between the third quarter of 2024 and the third quarter of 2025, 48 states and the District of Columbia experienced positive year-over-year (YoY) house price appreciation, with gains ranging from 0.6% to 6.8%. Hawaii was the only state to record a decline, while Florida posted no growth. New York led all states with a 6.8% gain, followed by Connecticut with a 6.5% gain and Illinois with a 6.2% gain. On the opposite end, Colorado posted the lowest house price appreciation at 0.6%. Notably, out of all 50 states and the District of Columbia, 29 states exceeded the national YoY growth rate of 3.3%. However, on a quarterly basis, home price appreciation decelerated in 45 states compared to the second quarter of 2025, highlighting a broad-based deceleration in the housing market. House price growth also varied widely across U.S. metro areas, ranging from a 7.8% decline to a 16.0% increase year-over-year. Punta Gorda, FL recorded the steepest drop, while Farmington, NM posted the strongest gains over the previous four quarters. In the third quarter of 2025, 34 metro areas, in reddish color on the map above, experienced negative house price growth, while 351 metro areas posted increases. Since the onset of the COVID-19 pandemic, house prices have surged nationally. Between the first quarter of 2020 and the third quarter of 2025, house prices climbed 54.9% nationwide, with more than half of metro areas exceeding this rate. However, 226 metro areas have seen varying degrees of decline from their post-COVID peaks, ranging from -0.1% to -12.7%. The map below presents the top ten and bottom ten markets for house price appreciation over the past five years. Among all the metro areas, house price appreciation ranged from 18.3% to 88.4%. Knoxville, TN topped the list with the highest house price appreciation, while Odessa, TX posted the lowest appreciation, ending Lake Charles, LA’s five-quarter run at the bottom. https://eyeonhousing.org/2025/12/house-price-appreciation-by-state-and-metro-area-third-quarter-2025/",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "15% of Home Purchases Fell Through in October, Up Slightly From a Year Earlier",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ill be in the November numbers. House under contract needed a new roof, gutters etc. Seller wanted 10k more to replace and at that point we decided to walk away.",
                "author": "ElCompaJC"
            },
            {
                "raw_content": "Very soon after this negative headline, there will be another headline to ‘counter’ it saying: • ⁠mortgage applications are up • ⁠pending home sales are up from ___ • ⁠refinancing activity is up after interest rates drop 0.25% etc.",
                "author": "McFatty7"
            },
            {
                "raw_content": "* Homebuyers are getting cold feet due to high housing costs and economic uncertainty. Many are convinced they’ll be able to find a home they like better because there are so many listings on the market. * Homebuyers are most likely to walk away in Texas and Florida, and least likely in Nassau County, NY and the Bay Area. Roughly 53,000 U.S. home-purchase agreements were canceled in October, equal to 15.1% of homes that went under contract that month. That’s up from 14.3% a year earlier. This is based on a Redfin analysis of MLS pending-sales data. The data is seasonal, which is why we compare this October to past Octobers. Please note that homes that fell out of contract during a given month didn’t necessarily go under contract the same month. For example, a home that fell out of contract in October could have gone under contract in September. Home-purchase cancellations remain elevated for several reasons. High housing costs and economic uncertainty are giving some buyers cold feet. It’s also a buyer’s market, with home sellers significantly outnumbering homebuyers. This means buyers in most areas have room to negotiate and the flexibility to take their time; if they decide against one home, they will likely be able to find another one that meets their needs. “Buyers know they have options, so if a seller isn’t willing to address a maintenance issue, the buyer will walk away,” said Tracy Edwards, a Redfin Premier real estate agent in Winston-Salem, NC. “A lot of sellers are having to adjust their expectations—some still think their home is worth more than the market will bear.” Redfin agents recommend that sellers price reasonably from the get-go to limit the chances of their home sitting on the market and buyers getting cold feet. San Antonio Has the Highest Rate of Home-Purchase Cancellations San Antonio leads the nation in canceled deals, with over one in five (21%) pending home sales falling through in October. It’s followed by Fort Lauderdale, FL (20%), Fort Worth, TX (19.7%), Las Vegas (19.2%) and Jacksonville, FL (19.2%). Redfin analyzed the 50 most populous U.S. metropolitan areas and included in this analysis the 47 with sufficient data. Texas and Florida have been building more homes than anywhere else in the country, prompting some buyers to back out of deals because they’re confident they will be able to find a different home that works better for them. Some buyers in the Sunshine State are also getting cold feet due to increasing natural disasters and soaring insurance and HOA fees. The lowest cancellation rate was in Nassau County, NY, where 4.4% of pending home sales fell through in October. Next came San Francisco (4.6%), San Jose, CA (7%), Oakland, CA (9.1%) and Montgomery County, PA (9.2%). Redfin recently reported that the Bay Area’s housing market has been heating up amid an AI boom and a return to the office.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Mortgage Rates Slide to 6.32%, Boosting Purchase Activity",
        "score": 80,
        "text_content": "https://www.bloomberg.com/news/articles/2025-12-03/us-mortgage-rates-slide-to-6-32-boosting-purchase-activity US mortgage rates fell last week to a one-month low, spurring home-purchase activity. The contract rate on a 30-year mortgage dropped 8 basis points to 6.32% in the week ended Nov. 28, which included the Thanksgiving holiday, according to Mortgage Bankers Association data released Wednesday. The rate on a five-year adjustable mortgage declined to 5.4%, the lowest since May 2023. The group’s gauge of home-purchase applications climbed 2.5% to the highest level since early 2023. While the weekly figures tend to be volatile around holidays, a sustained pickup in purchase activity would point to steady underlying demand for the affordability-challenged housing market. MBA’s measure of refinancing, meantime, fell for a fifth straight week — the longest stretch of declines in a year. The MBA survey, which has been conducted weekly since 1990, uses responses from mortgage bankers, commercial banks and thrifts. The data cover more than 75% of all retail residential mortgage applications in the US.",
        "comments": [
            {
                "raw_content": "I’m buying now that I can save $17 on my monthly payment",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "This is such a nothingburger \"slide\". The rates have bounced around from 6-7.5+. Don't tell me it's a slide if it's still in the 6s. Sounds like more RE lobbying association propaganda to drum up fomo",
                "author": "Moobygriller"
            },
            {
                "raw_content": "4.8 pleaseeee",
                "author": "Significant-Pen-6049"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Office Commercial Real Estate Spreads Hit 2025's Lowest Level as Lender Optimism Returns",
        "score": 34,
        "text_content": "[https://www.trepp.com/trepptalk/office-commercial-real-estate-spreads-tighten-lender-optimism-returns](https://www.trepp.com/trepptalk/office-commercial-real-estate-spreads-tighten-lender-optimism-returns)",
        "comments": [
            {
                "raw_content": "Got my financial advisor to do get these off my profile. But you have to really dial it in to the companies you want off. At least all of mine were still up in what I made on them. In Boston they have turned a few into apartments. I think it is a great idea but not sure if it is more $$ or not to do it that way.",
                "author": "DevilsAdvocateFun"
            },
            {
                "raw_content": "Lots of metro area downtowns office buildings have lost 50% or more of their value especially in states with progressive leadership where homeless drug addled zombies defecate and urinate in building entryways without fear of reprisal. The invisible hand of economics works wonders if allowed. Eventually these buildings become a viable opportunity.",
                "author": "mrktcrash"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The death of ChatGPT",
        "score": 5005,
        "text_content": "",
        "comments": [
            {
                "raw_content": "ChatGPT is showing ads on a \\*paid\\* plan? Really?",
                "author": "Universe_Man"
            },
            {
                "raw_content": "Its not showing me ads on the free plan..",
                "author": "Only-Cheetah-9579"
            },
            {
                "raw_content": "He's lucky it doesn't just give a completely off response based on one of his previous chat. Chatgpt lacking hard lately",
                "author": "hapliniste"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NVIDIA CEO: Local \"nuclear\" AI for everyone lol",
        "score": 349,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they be sayin anything now. Who can make the most outrageous statement competition if you will",
                "author": "ChonkBoy69"
            },
            {
                "raw_content": "Doubt this will happen",
                "author": "Primo2000"
            },
            {
                "raw_content": "Can't wait to get my DIY Chernobyl to power my AI waifu.",
                "author": "xcewq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure is capable of jogging now",
        "score": 300,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Smooth",
                "author": "Mindrust"
            },
            {
                "raw_content": "Brett Adcock quote-tweeted the Optimus jogging video and shared a clip of Figure doing the same thing. Source: [https://x.com/adcock\\_brett/status/1996426782590070860](https://x.com/adcock_brett/status/1996426782590070860)",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "It's getting so fucking fluid?? How is this is a real thing we've already invented in 2025?",
                "author": "Glittering-Neck-2505"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "lol",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"the single best mind for datacenter physics & finance in the world in terms of having the whole picture in his head.\" He's got to be trolling.",
                "author": "ifull-Novel8874"
            },
            {
                "raw_content": "Let's put the data centre in a vaccum, that'll help with heat management.",
                "author": "asbestosdemand"
            },
            {
                "raw_content": "this has to be a \"Sam wants to annoy Elon\" thing (they really don't like each other)",
                "author": "Tystros"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot makes coffee for entire day",
        "score": 36,
        "text_content": "New milestone for end to end robotics",
        "comments": [
            {
                "raw_content": "I bet we'll all still be paying $5 a coffee after the robot has paid for itself 10x over.",
                "author": "Newitadmin"
            },
            {
                "raw_content": "Odd how nostalgic we get for professions even when 75% of the time we had no real love for the game. I was a barista for 6 years and got reasonably decent at it(I sucked) so my first instinct when seeing this is to rage against the machine... but in truth it's only that I suffered and survived and feel sympathy for those that have to deal with this pressurized bullshit on top of working the grind right now. Luckily suffering and surviving is not limited to having whatever small skillset you have replaced by machines. It will exist in parallel with all these miraculous advances and you will still get to feel proud and nostalgic about whatever meaningless toil you ended up doing after your 50th goon-drip to AI revenge porn of Melania Trump. XD",
                "author": "Rubixcubelube"
            },
            {
                "raw_content": "Baristas won’t be protesting anymore!",
                "author": "Kind_Ad_6489"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus scores 95% on core-bench HARD. like paper bench it tests whether AI can reproduce Scientific research(AI research), code, tests and reproduce results from scratch just given paper to read. Gpt 5.1 codex max gets around 40%(paper-bench).",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a huge capability i've been waiting for. I also noticed in my testing Opus was extremely good at AI research (and I mean extremely). I was able to give it a research paper by sakana and have it copy the architecture and implement a new idea I had and get new novel results... In a day.",
                "author": "gbomb13"
            },
            {
                "raw_content": "that's cool and all, but how does this compare to gemini 3 pro preview?",
                "author": "LobsterBuffetAllDay"
            },
            {
                "raw_content": "What did stop at %95?",
                "author": "agrlekk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Micron is killing Crucial SSD and DRAM.",
        "score": 268,
        "text_content": "This is being done to put all it's production for AI and Datacenters. I don't think the RAM prices are going down anytime soon...",
        "comments": [
            {
                "raw_content": "Honestly the last half decade has been terrible in terms of quality offerings of PC hardware. With nVidia's crazy price raises, lack of competition, and the exit of some of the rare decent options in terms of how they deal with customers (E.G. EVGA), it's gone from hard to be interested in PC gaming more than casually to utterly brutal. They've turned what was already an expensive hobby into a hobby for the rich.",
                "author": "TemetN"
            },
            {
                "raw_content": "All of the money is in enterprise hardware. Maybe if we're lucky, one day our overlords will let us rent a stick of ram for a modest subscription price. /S",
                "author": "awesomedan24"
            },
            {
                "raw_content": "And what is end-user going to use?",
                "author": "Profanion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nano banana Pro can change other details without specifying it",
        "score": 118,
        "text_content": "2nd photo was the original, prompt was: Change this number to 69,420. What surprised me was that it also change the number of days from 47 to 48. I’m impressed",
        "comments": [
            {
                "raw_content": "Yea it’s Gemini 3 Pro so it’s pretty smart in that kind of thing. I read a post about transcription of old texts where it was getting results officially wrong because it was correcting the math in the notebook with the most plausible explanation instead of writing it down as it was, and how that was pretty amazing on its own, even though it was failing the test.",
                "author": "tete_fors"
            },
            {
                "raw_content": "Make way peasants! Edge Lord coming through",
                "author": "WashingtonRefugee"
            }
        ],
        "subreddit": "singularity"
    }
]