[
    {
        "post_name": "🚨 BREAKING: Protestors have TAKEN OVER the intersection outside LAX on one of the busiest travel days of the year. Travelers are desperately trying to get through, yelling “I’m going to miss my flight!”",
        "score": 734,
        "text_content": "",
        "comments": [
            {
                "raw_content": "90% of the people in the area voted for this. Source: I live in SoCal.",
                "author": "Just_a_Patriot"
            },
            {
                "raw_content": "Which brand of idiots are protesting today?",
                "author": "Hantif"
            },
            {
                "raw_content": "Run their fucking asses over.",
                "author": "Exsultate"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don't fall for the sales pitch",
        "score": 623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“A solo mom” I am a 63-year-old woman as of next month. In my day, we simply called it what it was: a whore.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Wonder why she’s a single mom. There must be a clue…",
                "author": "AstroLonghorn"
            },
            {
                "raw_content": "It's a lot more doable when you're MARRIED TO THE FATHER. Please be sure to say this whenever possible.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump ReTruth: \"The fact that Democrats won't pass a voter ID bill tells you that they CHEAT IN ELECTIONS. And they know.\"",
        "score": 805,
        "text_content": "",
        "comments": [
            {
                "raw_content": "End the filibuster and get national voter ID through then.",
                "author": "MikesDong"
            },
            {
                "raw_content": "I have been asking for decades for anyone against voter ID to present to me all the people that are legally allowed to vote that can't get an ID... Still have not been shown a single one of these unable to get ID unicorns... I means seriously who the fuck doesn't have an ID nowadays, you can't open a bank account, you can't drive, you can't buy a plethora of items at the store, you can't get SS, you can't get welfare, you can't get SNAP, you can't get a credit card or debit card, you can't legally work and the list could go on, and the Democrats want me to believe these people exist that are not illegals or foreigners?",
                "author": "AllisterTwo"
            },
            {
                "raw_content": "The fact you know they cheat and dont arrest anyone tells you more",
                "author": "Krat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller sounds the alarm that the Democrat playbook is the \"SOMALIFICATION of America,\" and Minnesota is ground zero",
        "score": 505,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well. A whole bunch of them just got their temporary protection status yanked. So I'm thinking we're about to see some de-Somalification soon. I'm thankful for Donald Trump!",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "If only we held all three branches of government. The clock is ticking motherfuckers ... and if you don't do anything about it, the only logical conclusion is that you want it to happen. Fight your overloards. 🤓⌚️🚫👃",
                "author": "drmrboy"
            },
            {
                "raw_content": "\"High trust\" 😏 Miller is based",
                "author": "Zskills"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O’Keefe undercover footage shows Government Accountability Office Director admitting they “stole & backed up” federal data to keep it outside RFK Jr HHS control",
        "score": 1233,
        "text_content": "",
        "comments": [
            {
                "raw_content": "LOCK EM UP",
                "author": "perma-maga"
            },
            {
                "raw_content": "Vaccine rules need to end forever. Vaccines should be 100% voluntary with absolutely NO mandate from the government, private businesses or other citizens. NO ONE should have the right to force you to take a vaccine to participate in modern life",
                "author": "DingleBalls"
            },
            {
                "raw_content": "O'Keefe should get the Presidential Medal of Freedom.",
                "author": "Thathurtsmyfeelings1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "wow",
        "score": 1041,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No. Let Russia just have it.",
                "author": "SCP0073"
            },
            {
                "raw_content": "what an odd thing to want",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "This change is endorsed by the entire United States Congress and Senate.",
                "author": "Trump454748"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“Nearly Every City in Germany Is Going Bankrupt”: How Globalist Mass Migration Policies Are Turning Germany Into a Third-World Welfare Colony",
        "score": 959,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every western nation is becoming a third world welfare colony.",
                "author": "Filo76"
            },
            {
                "raw_content": "# Ausländer raus",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Keep in mind, all the good Germans left the country a long time ago and moved into America... I'm not specifying North or South.",
                "author": "billybaldwin2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The DOJ will create a new office dedicated to enforcing the right to bear arms.",
        "score": 1211,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No such office is necessary. In fact, the creation of such office means the office will be used to further violate the right to bear arms.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "We don't need another office. The 2A clearly states will not be infringed. How about enforcing the Constitution?",
                "author": "iamstadter"
            },
            {
                "raw_content": "ARREST SOME FUCKING CRIMINALS ALREADY",
                "author": "donteatthat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Let’s go on social media and call for a military coup WCGW?",
        "score": 615,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Call him back to active duty and then court-martial him.",
                "author": "TexasBrowncoat"
            },
            {
                "raw_content": "traitors don’t deserve to die of natural causes",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Say what you want about leftists, but they always double down. They realize their actions have no negative consequences, and so they do whatever the hell they want. Honestly, trans people should be jealous of the men of the GOP because they all have enormous vaginas",
                "author": "Karpus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Karen Olvera De Leon, a DOJ employee, has been ARRESTED and charged with TERRORISM after she allegedly doxxed a federal agent during a livestream to a man who wanted to kill agents.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Commie judge scrapping the case in 3..2..1..",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "All justices and judges, the entire legal community needs to be under the gun to put criminals into cells. It's their sworn duty, without justice we cannot have a functioning society, and the ONLY justice for taking a life intentionally needs to be your life gets taken. Theft deserves public punishment and humiliation, that will stop 90% of them from doing it. Rapists deserve to get their genitals removed. Time to get tough on crime",
                "author": "magamagashii"
            },
            {
                "raw_content": "Keep this cretin in mind. The Fed agencies are FULL of shits like this; clearing them out while the DOJ still actively pursues its mission.",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ryan Routh, the convicted would-be assassin of President Donald Trump, has challenged President Trump to beat him up while he’s restrained, while also saying, \"Don't be a pu$sy.\"",
        "score": 742,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He looks like an old lesbian",
                "author": "mlp67"
            },
            {
                "raw_content": "This guy had his brain scrambled by the feds at some point.",
                "author": "TheSwampThang"
            },
            {
                "raw_content": "Remember he went to Ukraine to train to assassinate trump and asked for weapons too, idk why trump still entertains Ukraine",
                "author": "jdemarco2014"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maine Waters says that Trump is a “low down dirty no good filthy President”..",
        "score": 802,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who is Maine Waters?",
                "author": "cusp-of-carabelli"
            },
            {
                "raw_content": "She’s half ape and I no longer give a shit what anyone says about me saying so. Corrupt piece of shit idiot bitch chimp",
                "author": "SCP0073"
            },
            {
                "raw_content": "Go-Rilla says wha?",
                "author": "Comanche_Moon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ex-Antifa member: \"They don’t kill you because you’re a fascist...they call you a fascist so they can kill you.\"",
        "score": 1392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gun ownership is the first red pill. You don't really understand how your rights are being stripped until you buy a gun.",
                "author": "utfanx2"
            },
            {
                "raw_content": "\"Sure we'll have Fascism here, but it will come as an anti-Fascism movement.\" ~ Huey Long",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "His voice sounds exactly how I imagined it would.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WBRZ: Louisiana's surgeon general who stopped mass vaccination events moving to key post at CDC",
        "score": 1272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Do the IRS while you're at it. # TRUMP IS KING!!!",
                "author": "BeauHD"
            },
            {
                "raw_content": "Good !",
                "author": "NickAtNight"
            },
            {
                "raw_content": "Healing America! The recovery of the real crimes of Covid vax may never be addressed fully. Thankfully, a real doctor who saves people is in charge of CDC now. May his work continue to be blessed and merit the miracles of saving lives.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "James O’Keefe: What happens when the agency meant to hold the government accountable goes unchecked? Exposure is the only cure.",
        "score": 1574,
        "text_content": "",
        "comments": [
            {
                "raw_content": "KASH, BONG, PAM? Huh!",
                "author": "FaustyArchaeus"
            },
            {
                "raw_content": "I wonder if anyone will get arrested…besides James O’Keefe.",
                "author": "least_counties_ever"
            },
            {
                "raw_content": "I'm going to be shocked if government is wasting money and not holding themselves accountable.",
                "author": "TheSwampThang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Straight out of 1984 - If you’re in the party, you’re good!",
        "score": 837,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Straight for the cash register, like all thieves.",
                "author": "Liberats"
            },
            {
                "raw_content": "Well, that didn't take long.",
                "author": "thisisatestof2"
            },
            {
                "raw_content": "Gee,if they think it’s going to slow down his no doubt massive theft( think Gavin Newscum levels)while in office, they got another thing coming!",
                "author": "KarenLukasik"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America Is Full",
        "score": 846,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You're missing the most important point. Who are they going to vote for? That's why we have to let them in.",
                "author": "fskfsk"
            },
            {
                "raw_content": "Cubans that fled communism vote Republican, but their kids and grandkids vote Democrat and love socialism. Seems to always work that way with immigrants.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "That balloon popped 50 years ago. We need deportations to step up to at least a million per month.",
                "author": "ingrowntoenail"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Murderous thugs should be incarcerated so that can’t murder people. Doesn’t matter what their race is. Obviously.",
        "score": 678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Incarceration isn't the answer. Incineration is.",
                "author": "Konsaki"
            },
            {
                "raw_content": "Seems \"racist\" to not keep violent murderers off the street because of their race",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "“If they’re all black, then so be it!” That’s how I would’ve ended it lol.",
                "author": "stillbringingitback"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Will Chief Justice Roberts do anything about Judge Boasberg?",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nope.",
                "author": "HumphreyPlowjogger"
            },
            {
                "raw_content": "The process of impeachment starts with the House. Articles of impeachment have been filed in March 2025. All it takes is a simple majority vote to send it to the senate. There has not been a vote. We need to start holding congress responsible for their inaction. This is on them.",
                "author": "OlivaireBandaloo"
            },
            {
                "raw_content": "My best guess is no.",
                "author": "Returningtogod"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HUGE NEWS President Trump has ordered a mass “re-interview” of every refugee admitted between Jan 2021–Feb 2025, plus a FREEZE on all pending green-card applications.",
        "score": 536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Soon to be \"blocked\" by a federal judge who doesn't know their place",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Re interview? Were they ever interviewed in the first place? Aside from “where do you want your gibs payment sent?”",
                "author": "Filo76"
            },
            {
                "raw_content": "And those that don’t show get a deportation order.",
                "author": "Cville123"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Japan's Rapidus to build cutting-edge 1.4-nm chip plant in race with TSMC",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The gold rush AI has introduced is crazy. Companies literally buying out hardware they can't even power.",
                "author": "virtualmnemonic"
            },
            {
                "raw_content": "Just a modern-day Tulip Mania.",
                "author": "LickMyKnee"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung begins mass production of 28 Gbps GDDR7 3GB memory, faster variants now sampling - VideoCardz.com",
        "score": 290,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now watch this same highly desirable vram chips gobbled up by Open AI completely ruining the impending launch of RTX 50 super series early next year.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "Crazy how fast memory speeds keep jumping. GPUs are gonna love this.",
                "author": "smartsass99"
            },
            {
                "raw_content": "Hello KARMAAACS! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSMC sues former executive over defection to Intel, says it's highly likely he stole trade secrets — chipmaker claims Wei-Jen Lo broke non-disclosure and non-compete agreements",
        "score": 251,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn’t he work for Intel 1st then went to TSMC then back to Intel? He worked at Intel for about 18 years before he joined TSMC in 2004. After his retirement from TSMC in July 2025, he joined Intel again.",
                "author": "FewConsequence2020"
            },
            {
                "raw_content": ">TSMC says that shortly after leaving the company in July 2025, Lo became an Executive Vice President at Intel, a plan he failed to reveal to TSMC’s General Counsel during the exit interview. Based on Lo’s access to unreleased technical information, his continued contact with R&D staff from 2024 to 2025, and his immediate arrival at a major competitor, TSMC alleges that there is a strong likelihood that he may use or disclose the company’s trade secrets to Intel.\" That's some Theranos level BS. “He stole our property in his *mind*.\" \\-Balwani",
                "author": "GenZia"
            },
            {
                "raw_content": "So this dude hid the fact that he was joining intel from tsmc and took boxes of handwritten notes about tsmc's process information with him when he left the company He's even under investigation by the tw government and their economic minister had cut ties claiming that he misjudged this guy's character in a congress session Also what's up with all the angry 1 line comments in this post? Thought i was on the wrong part of reddit for a moment there. You also gotta give it to toms to get the dude's name wrong.",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] TSMC Sues Ex-SVP Lo Over Undisclosed Intel Move: Non-Compete, Trade Secrets, and What’s Next",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">After nearly a month of rumors that former TSMC senior vice president Wei-Jen Lo had jumped to Intel—and may have taken sub-2nm process documents with him—the foundry giant finally broke its silence last night. According to the Economic Daily News, TSMC confirmed that on November 25 it filed a lawsuit with the Intellectual Property and Commercial Court, accusing Lo—who recently joined Intel as Executive Vice President—of violating a non-compete agreement and misappropriating trade secrets by failing to disclose his move to the company. .... .... Industry sources told Liberty Times that in the two to three months before retiring, Lo summoned managers from R&D, production, finance, and other departments to brief him and provide sensitive data, including 2nm, A16, and A14 technologies. Some staff questioned why a soon-to-retire executive needed such reports, while others complied. After learning he may have taken confidential materials to Intel, employees felt deceived and are urging the company to take firm action, the report notes.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] The shareholders of Asetek A/S receive a premium, all-cash public takeover offer from CQXA Holdings Pte. Ltd.",
        "score": 10,
        "text_content": "Sounds like Asetek has accepted an offer to sell, hot on the heels of its latest Q3 \"[near-term market challenges](https://ir.asetek.com/news/stock-exchange-releases/release-details/2025/Asetek--Q3-2025-Firming-Up-The-Growth-Outlook-Amid-Near-term-Market-Challenges/default.aspx)\" update. I wonder how this will affect their existing OEM contracts, some of which were apparently just re-upped. \\----- >Asetek A/S (“Asetek”) has today entered into a binding agreement with CQXA Holdings Pte. Ltd. (the “Offeror”) pursuant to which the Offeror will make an all-cash voluntary recommended public takeover offer to the shareholders of Asetek to acquire all shares in Asetek (excluding treasury shares held by Asetek and shares held by the Offeror, if any) (the “Offer”). The Offeror is a wholly owned and controlled subsidiary of Suzhou Chunqiu Electronic Technology Co., LTD. (“Chunqiu”) listed on the Shanghai Stock Exchange under Stock Symbol 603890. \\----- >Background and reasons for the Offer >Chunqiu sees Asetek's industry-leading liquid cooling solutions and expertise in high-performance computing as highly complementary to its portfolio, including its innovative SimSports initiatives. This acquisition represents a strategic opportunity to strengthen Chunqiu’s position in advanced thermal management and simulation-based sports technologies, while accelerating growth in key markets. >Chunqiu is impressed by Asetek's innovation, technical leadership, and management team, and intends to maintain Asetek as a distinct business unit within the Offeror group to preserve its brand and operational independence. >Chunqiu is positive about the potential transaction and believes it will create long-term value for customers, business partners and employees.",
        "comments": [
            {
                "raw_content": "Talk about buying out damaged goods. Asetek's value was their patent that expired in May 2025 and buying them out is like buying expired produce.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RIP Windows: Linux GPU Gaming Benchmarks on Bazzite | Gamers Nexus",
        "score": 63,
        "text_content": "",
        "comments": [
            {
                "raw_content": "20XX is the year of Linux",
                "author": "sh1boleth"
            },
            {
                "raw_content": "So uhm went through the vid and where is the RIP windows part? Like shouldn't you give a performance comparison for that title?",
                "author": "FitCress7497"
            },
            {
                "raw_content": "Kinda wish he included windows numbers. Maybe next time.",
                "author": "kingduqc"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Core Ultra 9 386H flagship “Panther Lake” CPU for gaming laptops leaks on Geekbench",
        "score": 87,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hmm, it’s been a long time since Intel sold a 386, that takes me back. Somehow, I don’t think this new 386 will do nearly as well!",
                "author": "greggm2000"
            },
            {
                "raw_content": "lol a new 386, what a throwback. One of my vintage PCs has a screaming 386-20mhz. They really missed the opportunity to call the 285k the 286.",
                "author": "Culbrelai"
            },
            {
                "raw_content": "Kinda a bad time to launch a product with strong igpu due to ram shortage. I bet systems with highly clocked lpddr are gonna cost an arm and a leg in the next year at least and that's gonna blunt intel's advantage against amd's refresh point (which is really their period of weakness due to them cutting their losses with rdna4 and skipping to 5 with a delay instead).",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Pico 2026 Headset To Have 4K Micro-OLED Displays & Dedicated Chip For Passthrough",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Remind me once the Pico XR homepage is actually usable and not completely disgusting.",
                "author": "__some__guy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Nintendo added startup screens to the Game Boy NSO app.",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s really cool, I need to download the update asap",
                "author": "blueblurz94"
            },
            {
                "raw_content": "Forgot to mention but creddit to spawncast for the clip",
                "author": "JampyL"
            },
            {
                "raw_content": "This option is there for a good while now",
                "author": "Olorin_90"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Welcome Tour provided me with many hours of entertainment and information.",
        "score": 599,
        "text_content": "That is a larger number of hours of other things that cost $10, such as a meal from McDonald's, which is entertainment that only lasts for 10 minutes.",
        "comments": [
            {
                "raw_content": "My only argument is that it should still be free so more people would have enjoyed it. *I* also didn't mind to pay 10 for it and felt like I got my money's worth but I know most people just won't bother.",
                "author": "suentendo"
            },
            {
                "raw_content": "Astrobot on the ps5 was free. Shits on this",
                "author": "Timely-Bluejay-6127"
            },
            {
                "raw_content": "Let’s be real though ten years ago it would be free",
                "author": "FinestKind90"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I found it. Didn’t really put record any footage as it’s the same demo portion everyone had seen but below I’ll talk about how it felt to me.",
        "score": 244,
        "text_content": "This was at a Target. So first off it’s a gorgeous game. Clearly it was made for Switch 1 but the Switch 2 just pushes it to the extra level it needs. I toggled on and off the 4K 60fps and the 1080p 120fps modes and its take a couple seconds for it to switch between them and actually flashed to a black screen for a second before switching but it’s pretty seamless. The 4K to 1080p was noticeable but the 60-120 (to me) wasn’t that noticeable. Both modes are very smooth or maybe the tv in the target doesn’t properly show 120? Idk. The new gameplay with more modern controls took awhile to get used to (mostly because I’ve been replaying the old ones in preparation) they designated to X button as the scam visor which actually worked very well. Morph ball on Y, and muddled on RB which I kept mixing those two up for some reason. Dashing feels great in this game because you can essentially do it in any direction and the way the morph ball feels you can basically use it as a duck and it works really well. The boss fight at the end was cool because it takes some pretty precise movements which will be great with the mouse mode which I couldn’t test. Overall very fun demo. Also the music was great! Same music as that initial trailer reveal for the game. I’m even more excited the this game now.",
        "comments": [
            {
                "raw_content": "Im pretty sure kiosk tvs are only 60 hz tho",
                "author": "JampyL"
            },
            {
                "raw_content": "Great write up thank you",
                "author": "DarkCloudFan882"
            },
            {
                "raw_content": "What’s muddled? Or did you mean Missiles is on R?",
                "author": "PumasUNAM7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Picked up two more games to add to the collection!",
        "score": 308,
        "text_content": "Pretty excited for both, I think ill start with hyrule warriors tho",
        "comments": [
            {
                "raw_content": "kirby air riders has been a lot of fun! the riding is so smooth its addictive",
                "author": "Justos"
            },
            {
                "raw_content": "First I’m seeing the US box. Surprised to see happy Kirby.",
                "author": "Ameph"
            },
            {
                "raw_content": "might i suggest you go for Yakuza Zero next, its liken30 bucks, i enjoyed for way over 100 hours",
                "author": "Key-Moment6797"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "NES, Game Boy – Nintendo Classics – November 2025 Game Updates",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Game Boy Kid Icarus obviously means Nintendo is preparing us for a Kid Icarus Uprising remaster soon https://preview.redd.it/8gp14lj1ui3g1.jpeg?width=299&format=pjpg&auto=webp&s=2fd89080a3c0aab2f8d9ad15b84790b9ae1a5327",
                "author": "StarPlatinum55"
            },
            {
                "raw_content": "Battletoads sick!",
                "author": "mr_margherita_420"
            },
            {
                "raw_content": "That's a solid batch! Battletoads is a nightmare but with save states it should be more tolerable. Never tried Ninja Gaiden 2 or the GB Kid Icarus, should be fun!",
                "author": "AxLD"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch update 21.0.1 has fixed Nier Automata!",
        "score": 781,
        "text_content": "U",
        "comments": [
            {
                "raw_content": "I really want a Switch 2 upgrade for this wonderful game. A 60 fps bump would be great.",
                "author": "mr_wolf8"
            },
            {
                "raw_content": "Great, just as it goes off sale, lol",
                "author": "DogsAreGreatYouKnow"
            },
            {
                "raw_content": "Hell yeah lets goooo. Was literally gonna buy this on pc last night but now ill pick up the physical on switch :p",
                "author": "mafenide"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Ultimate Sheep Raccoon Releasing Dec 9th 2025",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "oh heck yeah. day one purchase. Ultimate Chicken Horse is such a fun party game.",
                "author": "Not__My__Birthday"
            },
            {
                "raw_content": "I had a lot of fun playing the beta, cant wait!",
                "author": "HunterHale"
            },
            {
                "raw_content": "Any idea if it’s gonna support matchmaking so I can just play with randoms?",
                "author": "infamous11"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Prediction] Nintendo will acquire Tantalus studio",
        "score": 71,
        "text_content": "For reference, Tantalus is the Australian studio that was put in charge of Twilight Princess HD, Skyward Sword HD and more recently Luigi's Mansion 2 HD. Nintendo recently stated during their quarterly report that they were intending to [acquire more development teams](https://www.nintendolife.com/news/2025/11/nintendo-states-its-intention-to-acquire-more-development-teams). Obviously, they're not taking that route on a whim. This strategy comes out of a necessity to bring players more projects and this is where Tantalus comes into play. Quick look at their [history](https://www.tantalus.com.au/games.html) will show you the only projects in partnership with Nintendo were HD ports. First, they were trusted to pursue the HD remakes as Nintendo EAD was busy developing BotW. While some considered work on TPHD and SSHD to be not as extensive as what was done on TWWHD, they are nonetheless great remasters and broadly considered the definitive editions of these games. All 3D Zelda from GameCube to Wii are now available in glorious 1080p thanks to them. Their most recent partnership with Nintendo was a 3DS game and this here caught my attention because it feels like the port kind of came out of nowhere. But what if this was just the first 3DS port of many to come? I don't have anything to back any of my claims but Tantalus is not only familiar with remaking Zelda games, they've also now tackled 3DS games and I believe Ocarina of Time 3D and Majora's Mask 3D will be next. There's a plethora of games on 3DS that would benefit from being ported (back, I guess) to television. Kid Icarus comes to mind. It just makes sense to me that Tantalus would be the one studio to do it. A week ago, I didn't think this had much credit but then I recently heard about Panic Button being selected by Nintendo to work on Switch 2 Editions and it just feels like the writing is on the wall here.",
        "comments": [
            {
                "raw_content": "Honestly I welcome it, they've already proven themselves. I do wonder if they're just going to be used to create switch 2 versions / remasters of previous games or if they'll also be a supporting team for new titles",
                "author": "Cosmic_Ren"
            },
            {
                "raw_content": "that reasoning would only imply nintendo would contract them for more work going off of the acquisitions of next level games and shiver entertainment, nintendo only buys studios when they're selling or about to be closed down and nintendo doesnt want to lose them not buying up every studio they come in contact with is a good thing, btw",
                "author": "TiocStudios"
            },
            {
                "raw_content": "I am betting on Panic Button AND Tantalus in the next few years Mercury Steam is doubtful since their current ownership is split really complicated",
                "author": "Round_Musical"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Death Stranding 2: On the Beach has been rated for PC - Published by SIE",
        "score": 768,
        "text_content": "[https://www.esrb.org/ratings/41057/death-stranding-2-on-the-beach/](https://www.esrb.org/ratings/41057/death-stranding-2-on-the-beach/) First game came out on PC 8 months after its release on PS4.",
        "comments": [
            {
                "raw_content": "Probably a game awards announcement",
                "author": "ManateeofSteel"
            },
            {
                "raw_content": "Wow no longer 505 Publishing?",
                "author": "Severe-Committee6240"
            },
            {
                "raw_content": "I know whats going to happen to elle fannings model now.",
                "author": "justtomplease1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Destiny 3 has just been leaked to be in Early Development by Reliable Bungie leaker",
        "score": 530,
        "text_content": "https://thegamepost.com/destiny-3-in-early-development-at-bungie-leaker/ leaker in Question is extremely reliable for Destiny… Hype train starts now",
        "comments": [
            {
                "raw_content": "Early development = We don’t see it this decade. Though I really hope I’m wrong.",
                "author": "RepresentativeArtist"
            },
            {
                "raw_content": "Destiny 3 is gonna be so ahead of Destiny 2, that they'll start off by immediately removing access to its original content as you start playing it. No need to wait for several expansions to lose access to old content, they're stripping it day 1. They'll also withhold lore to ensure that returning players feel as confused as new players.",
                "author": "Javerage"
            },
            {
                "raw_content": "Bungie has betrayed my trust so many times I'm not even excited for this.",
                "author": "Regigigachad67"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "132 Minutes of Marathon October playtest gameplay leaked showing improved visuals, new map, UI overhaul, and more",
        "score": 411,
        "text_content": "[Source](https://thegamepost.com/132-minutes-marathon-test-gameplay-leak-online-showing-new-map/) The YouTube vids were taken down, likely after a copyright claim from Sony. Apparently, the same user has uploaded a lot more footage on top of what was available on YouTube.",
        "comments": [
            {
                "raw_content": "why are all these videos in chinese? i tried signing up for these alphas and was told it's only available in NA.",
                "author": "Huffee"
            },
            {
                "raw_content": "If anyone's interested, here's the medical runner, which was redesigned, and another runner I have no idea what it is, and it seems to be separate from the rest, I think… https://imgur.com/a/YP0WXd6",
                "author": "Midnight_M_"
            },
            {
                "raw_content": "man locking Video Quality to 360P for not signing up is pain.",
                "author": "VOL7AGE"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dan Houser Left Rockstar Over Directional Dispute with Sam Houser",
        "score": 887,
        "text_content": "From **Tez2,** Dan Houser left Rockstar Games due to a **\"disagreement with his brother \\[Sam Houser\\] about the company’s direction.** [Insider article about it:](https://insider-gaming.com/dan-houser-left-rockstar-games-due-to-disagreement-with-brother-over-companys-direction-its-claimed/)",
        "comments": [
            {
                "raw_content": "Rumors are Dan wanted Rockstar to release single-player games more frequently like Pre-GTA V era because he wanted to write more cool stuff, but Sam preferred putting Rockstar's whole resources on developing one major game at a time which btw in process includes all of their 11+ studios",
                "author": "Familiar_Gur_347"
            },
            {
                "raw_content": "which is the writer/story guy?",
                "author": "Tatum-Better"
            },
            {
                "raw_content": "There is certainly some family feud. I found that Sam and Dan along with their wives were running a non profit company for charity purposes. Around the time Dan left rockstar, Sam and his wife also pulled out from that charity company. Very likely they had some falling out and didn't want to deal with each other.",
                "author": "irrational_kind"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Gameplay of the new Marathon map during the latest closed test.",
        "score": 286,
        "text_content": "There are more gameplay videos on this channel. [https://www.youtube.com/@01WZL](https://www.youtube.com/@01WZL) [~~https://www.youtube.com/watch?v=ydOFaYbEtps&t=584s~~](https://www.youtube.com/watch?v=ydOFaYbEtps&t=584s) Edit. Mirror: [https://files.catbox.moe/27vo9z.mp4](https://files.catbox.moe/27vo9z.mp4) [https://files.catbox.moe/fz5kwm.mp4](https://files.catbox.moe/fz5kwm.mp4) [https://files.catbox.moe/lk8emk.mp4](https://files.catbox.moe/lk8emk.mp4)",
        "comments": [
            {
                "raw_content": "For anyone wondering, last closed beta had 3 playable maps and Bungie accidently showed us the Marathon Ship map for a couple of minutes when they did a reset. Game is looking pretty good visually, theses videos don’t do it justice. Gunplay is solid as ever, I’ve had a lot of fun. They also had proxy chat and solo queue.",
                "author": "Henrraike"
            },
            {
                "raw_content": "The visuals are going to be so hit or miss for people, but I’m on the side of really really loving how this looks. Really gives me Mirror’s Edge Catalyst vibes, but much more refined and with a lot more environmental detail.",
                "author": "Aragorn527"
            },
            {
                "raw_content": "Game is definately shaping up better than what i saw way back when they first revealed it, some of my friends were playing the playtest quite a bit.",
                "author": "I-wanna-fuck-SCP1471"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Prince of Persia: The Sands of Time 2026",
        "score": 482,
        "text_content": "Since the original video was taken down. Edit : Here's the new link https://files.catbox.moe/u24sb2.mp4",
        "comments": [
            {
                "raw_content": "So the prince isn't Yuri Lowenthal anymore.",
                "author": "BrainPositive2171"
            },
            {
                "raw_content": "Never would have expected that Geralt would get into the leaker community after he retired",
                "author": "Endiaron"
            },
            {
                "raw_content": "This is the first remake that has been remade.",
                "author": "PettyTeen253"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "D3 and d2 classic (as well as other projects) confirmed in dev by known leaker rocksiza",
        "score": 15,
        "text_content": "Source: rocksiza#9919 https://imgur.com/a/LfQjxbE",
        "comments": [
            {
                "raw_content": "Finally Dishonored 3",
                "author": "rickreckt"
            },
            {
                "raw_content": "There are number of games that could be D3 and D2. Reddit needs to stop being lazy by stop shortening names to their initals without proper context.",
                "author": "Animegamingnerd"
            },
            {
                "raw_content": "Got hyped about Diablo 2",
                "author": "DezZzO"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Only Core Ultra 400K \"Nova Lake-S\" CPUs rumored to feature 144MB of bLLC (big cache) - VideoCardz.com",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nova lake will be my next upgrade - still on a 13700k cpu",
                "author": "pchappo"
            },
            {
                "raw_content": "This would be the thing to potentially have me go back to Intel if they matched or exceeded X3D gaming performance. Long overdue.",
                "author": "Wander715"
            },
            {
                "raw_content": "I was planning on building a PC early next year with a 265K or one of the new Arrow Lake refreshes, but this news makes me wonder if I should wait. I'm not a hardcore AAA gamer but it wouldn't hurt to get improved gaming performance while also being really good at non-gaming tasks, sounds like the best of both worlds. I think I read somewhere that the new socket is going to be supported for much longer too. Trouble is, I'd be waiting until at least 2027.",
                "author": "PhantomWolf83"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "TSMC Files Trade Secret Suit Against Ex-Executive at Intel",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "Ryzen AI and Radeon are ready to run LLMs Locally with Lemonade Software",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What does this do that LM Studio, GPT4All, or any other standalone based on Llama.cpp does not?",
                "author": "Dante_77A"
            },
            {
                "raw_content": "I wish literally anything was ready to run the whole LLM thing to the ground.",
                "author": "Outrageous-Log9238"
            },
            {
                "raw_content": "when will xdna support for directml? intel and qualcomm npu already supports directml",
                "author": "Awkward-Candle-4977"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Price correction \"worse than 2008\" coming to US housing market—analyst",
        "score": 248,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You could get whiplash going from one real estate projection to the next.",
                "author": "EverGreenPastures"
            },
            {
                "raw_content": "I mean, I could use the lower property taxes",
                "author": "Hav3_Y0u_M3t_T3d"
            },
            {
                "raw_content": "This analyst is not saying actual house prices will fall. Rather, she is saying that the median price of a home being sold will fall, which is a big difference. Per the article: > The only transactions that continued happening in the U.S. market at volume this spring and summer, she said, were for higher-priced homes. > “You have this bifurcated housing market, but the majority of folks transacting are in these upper tiers, so your median [home price] is going to be higher,” Wright said. > “However, what I’ve been seeing over the last three months, and this is—I get into the dirty dirty details—underneath the covers, that $100,000-$250,000 sales price, we are starting to see incremental increases in sales in that category,” she added. >”And so as it continues, it will start to drag the median down. It’s happening already and that’s where we’re seeing the deceleration,” Wright said, adding that we are going to end the year with “flat” home price growth. It doesn’t seem like she is saying the price on an individual house will fall. Rather, she is saying that the MEDIAN house price will fall, as more Low cost housing is purchased. In other words, it seems like she is saying that right now only expensive houses are being bought, so the median house sale price is high compared to median salary. Per this analyst, a lot of Lower price houses are going to start getting bought in 2026, which will then lower the median house price. But the headline makes it seem like she’s saying individual houses will lose value-which I don’t think she is.",
                "author": "WakeNikis"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Delistings Jump 28% as Sellers Pull Homes Off Market Rather Than Settle For Low Prices",
        "score": 477,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Will be interesting to see what happens during the spring market 2026",
                "author": "DocMicStuffeens"
            },
            {
                "raw_content": "If i can't have nice things nobody can ahh market",
                "author": "big-dik-rik"
            },
            {
                "raw_content": "See you and everybody else in the spring!",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "USA Today Article: Rich people are driving US spending. Everyone else is cutting corners.",
        "score": 66,
        "text_content": "[Rich people are driving US spending. Everyone else is cutting corners.](https://www.usatoday.com/story/money/economy/2025/11/25/us-economy-spending-rich/87453670007/#:~:text=America%27s%20economic%20growth%20increasingly%20relies,and%20about%2043%25%20in%202020.) I've long thought that the real estate bubble is being propped up by the stonk bubble. Many of the top 10% are just trading houses back and forth, which is why the average price is higher and the average age of homebuyers is high. You don't get the housing bubble and inflation under control until you kill the stock market bubble. However, our leaders are doing the opposite, doing everything they can to prop up the stock market.",
        "comments": [
            {
                "raw_content": "You don't get the housing bubble and inflation under control until you kill the stock market bubble.\" And the stock market bubble is/has been fueled by $25 trillion worth of debt since 2008",
                "author": "Brs76"
            },
            {
                "raw_content": "Capital sloshing around at the top for sure-- ppp loans, crypto, stocks, gold, real estate with cheap rates, fraud and political payoffs.. the parasite class is more bloated than ever and became detached from reality. Stocks don't go up when windows get boarded up. That's why we need higher taxes so that some of that goes back into the economy.",
                "author": "T-REX-BVTT-S3X"
            },
            {
                "raw_content": "No shit…..long and variable always meant however long it takes to work through, not what random people determine is long enough and it didn’t happen so it won’t. All the macro shit being baked in this cake since 2021/22 is still in the cake, that is still in the oven. The difference is now the house is starting to smell good cause that timer is getting closer to going off.",
                "author": "bigmean3434"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sellers are taking their homes off the market at the fastest pace in nearly a decade",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should try again in the spring. I hear that interest rate will finally come down 😂",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "It could be an early seasonal blip, but I suspect many homeowners have priced their homes too high and expect a recovery around the corner, which is unlikely to happen. Today's loss will be greater tomorrow. Therefore, it's better to sell now at a reduced price as the following WSJ article points out: **When Home Sellers Set Prices Too High, They're Paying for It** https://www.msn.com/en-us/money/realestate/when-home-sellers-set-prices-too-high-they-re-paying-for-it/ar-AA1R7jfc",
                "author": "FrostyAnalysis554"
            },
            {
                "raw_content": "Boo hoo. They can’t make a quick buck so they’re forced to live in the house they bought lol",
                "author": "Responsible_Knee7632"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "RealPage settles rent price-fixing suit with DOJ",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Direct link to Justice.gov official release: https://www.justice.gov/opa/pr/justice-department-requires-realpage-end-sharing-competitively-sensitive-information-and",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The algorithmic pricing software provider has agreed to limit data collection and cooperate with the agency’s lawsuits against property management companies, but admits no wrongdoing. Dive Brief: - The U.S. Justice Department and RealPage reached an agreement Monday to settle a 2024 lawsuit that claimed the software provider enabled landlords to collude to raise rent prices beyond free market levels. - The settlement, filed in the U.S. District Court for the Middle District of North Carolina, is subject to court approval. The agreement includes no financial penalties, damages or findings or admissions of wrongdoing, but puts guardrails around what data Richardson, Texas-based RealPage can collect and how it can use it. - “This resolution with the DOJ was necessary to provide certainty and finality for RealPage and its customers to avoid protracted litigation,” said Stephen Weissman, Gibson Dunn partner and former deputy director for the Federal Trade Commission, in a Monday press release from RealPage. Dive Insight: According to RealPage, the settlement boosts confidence for the housing industry and demonstrates that its revenue management software can be used in compliance with the views of federal antitrust enforcers. “This resolution marks an important milestone for RealPage, our customers, and the multifamily industry,” said RealPage President and CEO Dirk Wakeham in the release. “We are pleased to have reached this agreement with the DOJ, which brings the clarity and stability we have long sought and allows us to move forward with a continued focus on innovation and the shared goal of better outcomes for both housing providers and renters.” Per the DOJ, the proposed settlement would help restore competition in rental markets for millions of renters, according to a Monday press release. “Competing companies must make independent pricing decisions, and with the rise of algorithmic and artificial intelligence tools, we will remain at the forefront of vigorous antitrust enforcement,” said Assistant Attorney General Abigail Slater in the DOJ’s release. Specifically, the agreement would require RealPage to: - Cease having its software use competing rental management companies’ nonpublic, competitively sensitive information to determine rental prices in runtime operation. - Cease using active lease data for purposes of training the models underlying the software, limiting model training to historic or backward-looking nonpublic data aged at least 12 months. - Not use models that determine geographic effects narrower than at a state level. - Remove or redesign features that limited price decreases or aligned pricing between competing users of the software. - Cease conducting market surveys to collect competitively sensitive information. - Refrain from discussing market analyses or trends based on nonpublic data, or pricing strategies, in RealPage meetings relating to revenue management software. - Accept a court-appointed monitor to ensure compliance. Cooperate in the United States’ lawsuit against property management companies that have used its software. Several state attorneys general are also pursuing their own legal actions. Earlier this month, four AGs asked a federal judge to reject nearly $142 million in settlements between renters and major property managers, arguing that the deals could undermine their ongoing cases. On Nov. 20, nine states reached a $7 million settlement with apartment giant Greystar, which used RealPage software.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Can’t wait for my $5 in a few years!",
                "author": "Classic-Reading5695"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lowest Mortgage Rates Since 10/28 And Very Close to 3-Year Lows",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Since 10/28 is crazy lol",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "10 year is definitely testing 4%. If that definitively breaks, rates will definitely be headed meaningfully lower. 5.5% next year isn’t unreasonable to expect.",
                "author": "regaphysics"
            },
            {
                "raw_content": "I just got four offers over asking since this article was posted",
                "author": "Bigdaddyblackdick"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "When Home Sellers Set Prices Too High, They’re Paying for It",
        "score": 94,
        "text_content": "**Main Findings** * Many U.S. homeowners are overpricing their properties, hoping to cash in on recent market gains. * When homes are listed above market value, they often sit unsold for months, forcing sellers to eventually cut prices. * Overpriced listings can turn off buyers, who may assume something is wrong with the property. **Financial Consequences** * Sellers who start too high typically end up selling for less than if they had priced correctly from the start. * Price reductions signal desperation, weakening negotiating power. * Longer time on market increases carrying costs (mortgage, taxes, upkeep). **Market Context** * Rising mortgage rates and affordability challenges mean buyers are more price‑sensitive than in past years. * Real estate agents stress the importance of accurate pricing strategies to avoid costly delays. **Takeaway** * The article emphasizes that in today’s market, **overpricing is a losing strategy**: it delays sales, reduces final proceeds, and frustrates buyers.",
        "comments": [
            {
                "raw_content": "Thanks ChatGPT. But we already knew this. The people who don't know this are over in the other sub and they're not that interested in hearing it.",
                "author": "Less-Fondant-3054"
            },
            {
                "raw_content": ">Price reductions signal desperation, weakening negotiating power. It's not necessarily true. I've seen this marketing strategy. They set it high to give the buyers room to negotiate, making it seem like a bargain when they lower it. The housing price isn't fixed like in retail or grocery stores.",
                "author": "TGAILA"
            },
            {
                "raw_content": "its a self correcting problem though. An overpriced home wont sell. If it is sits unoccupied then its providing a lot of local tax revenue while losing the owner money. If it is still occupied and the seller can stay then I guess its a wash, but if they need to move they're going to have to cut the price to get a buyer.",
                "author": "PinkHydrogenFuture7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Case-Shiller: National House Price Index Up 1.3% year-over-year in September",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.spglobal.com/spdji/en/documents/indexnews/announcements/20251125-1480967/1480967_cshomeprice-release-1125.pdf - The S&P Cotality Case-Shiller U.S. National Home Price NSA Index posted a 1.3% annual gain for September, down from a 1.4% rise in the previous month. • Inflation outpaced home prices for a fourth straight month, with September’s CPI running 1.7 percentage points above housing appreciation—the widest gap since the measures began diverging in June. • All 20 metros recorded month-over-month declines before seasonal adjustment in September, underscoring broad-based weakening as elevated mortgage rates weigh on affordability and demand. ANALYSIS “The housing market's deceleration accelerated in September, with the National Composite posting just a 1.3% annual gain—the weakest performance since mid-2023,” said Nicholas Godec, CFA, CAIA, CIPM, Head of Fixed Income Tradables & Commodities at S&P Dow Jones Indices. “This marks a continued slide from August’s 1.4% increase and represents a stark contrast to the double-digit gains that characterized the early post-pandemic era. National home prices continued trailing inflation, with September’s CPI running 1.7 percentage points ahead of housing appreciation. This marks the widest gap between inflation and home-price growth since the two measures diverged in June, with the spread continuing to widen each month. “Regional performance reveals a tale of two markets. Chicago continues to lead with a 5.5% annual gain, followed by New York at 5.2% and Boston at 4.1%. These Northeastern and Midwestern metros have sustained momentum even as broader market conditions soften. At the opposite extreme, Tampa posted a 4.1% annual decline—the sharpest drop among tracked metros and its 11th consecutive month of negative annual returns. Phoenix (-2.0%), Dallas (-1.3%), and Miami (-1.3%) likewise remained in negative territory, highlighting particular weakness in Sun Belt markets that experienced the most dramatic pandemic-era price surges. “The geographic rotation is striking. Markets that were pandemic darlings—particularly in Florida, Arizona, and Texas—are now experiencing outright price declines. Meanwhile, traditionally stable metros in the Northeast and Midwest continue to post solid gains, suggesting a reversion to prepandemic patterns where job markets and urban fundamentals drive appreciation rather than migration trends and remote-work dynamics. “September’s monthly performance was uniformly weak. All 20 tracked metros posted month-overmonth declines before seasonal adjustment, with Tampa (-1.0%), San Diego (-0.9%), and Seattle (- 0.9%) leading the downturn. Even after seasonal adjustment, the National Index managed only a 0.2% gain. This broad-based monthly weakness suggests that elevated mortgage rates—which remained near 6.3% in late September—are finally overwhelming the market’s supply constraints. “A deeper look at momentum shows clear weakening. Over the past six months, national home prices have risen just 0.4%, a gain that is only marginal in nominal terms and negative in real inflationadjusted terms. The deceleration from early-2025 strength has been broad-based, with only seven of the 20 metros—Chicago, Cleveland, Minneapolis, Boston, New York, Charlotte, and Atlanta—posting positive price appreciation over the trailing six-month period. Most Sun Belt and Western markets experienced outright declines, underscoring how affordability pressures and higher mortgage rates have eroded momentum across much of the country. “For context, this represents the weakest annual price growth since early 2023, when the market was absorbing the initial shock of the Federal Reserve’s aggressive rate-hiking cycle,” Godec concluded. “Yet unlike that period, which saw a quick rebound, current conditions suggest more persistent headwinds. With mortgage rates stubbornly elevated and affordability at multi-decade lows, the market appears to be settling into a new equilibrium of minimal price growth—or, in some regions, outright decline.” YEAR-OVER-YEAR The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, covering all nine U.S. census divisions, reported a 1.3% annual gain for September, down from a 1.4% rise in the previous month. The 10-City Composite showed an annual increase of 2.0%, down from a 2.1% increase in the previous month. The 20-City Composite posted a year-over-year increase of 1.4%, down from a 1.6% increase in the previous month. Chicago reported the highest annual gain among the 20 cities with a 5.5% increase in September, followed by New York and Boston with annual increases of 5.2% and 4.1%, respectively. Tampa posted the lowest return in September, falling 4.1%. The chart below compares year-over-year returns for different housing price ranges (tiers) in Chicago. MONTH-OVER-MONTH The pre-seasonally adjusted U.S. National, 10-City Composite, and 20-City Composite Indices continued to report negative month-over-month changes in September, posting -0.3% for the U.S. National Index and -0.5% for both the 10-City and 20-City Composite Indices. After seasonal adjustment, the U.S. National and 10-City Composite Indices reported a monthly increase of 0.2% and the 20-City Composite Indices posted a month-over-month gain of 0.1%. SUPPORTING DATA The S&P Cotality Case-Shiller U.S. National Home Price NSA Index, which covers all nine U.S. census divisions, recorded a 1.3% annual increase in September 2025. The 10-City and 20-City Composites reported year-over-year increases of 2.0% and 1.4%, respectively. The chart below depicts the annual returns of the U.S. National, 10-City Composite, and 20-City Composite Home Price Indices.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "This guy was always a liar and manipulator. No one knows right now the actual home price index as everyone has completely different stats that they manipulate backwards.",
                "author": "aw33com"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Ilya has spoken",
        "score": 422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He said scaling is dead. Not LLMs are dead. Also, Yuan said LLMs are good, they just cannot reach human level intelligence.",
                "author": "vasilenko93"
            },
            {
                "raw_content": "he definitely did not say llms are a dead end",
                "author": "Curtisg899"
            },
            {
                "raw_content": "That’s not remotely close to what he said.",
                "author": "nomorebuttsplz"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Nvidia feels threatened after Google TPU deal with Meta.",
        "score": 702,
        "text_content": "",
        "comments": [
            {
                "raw_content": "edit: Someone else posted this meme, I just used AI to add the leather jacket. Dont know what happened to the original meme comment, but it was their joke 👍🏽 https://preview.redd.it/vl2yumq3vg3g1.jpeg?width=2048&format=pjpg&auto=webp&s=81d67b6ca02de036c83bd9ddfff0b7bcd91d5eea",
                "author": "GrapheneBreakthrough"
            },
            {
                "raw_content": "[https://www.tomshardware.com/tech-industry/billion-dollar-ai-chip-deal-between-google-and-meta-could-be-on-the-cards-would-involve-renting-google-cloud-tpus-next-year-outright-purchases-in-2027](https://www.tomshardware.com/tech-industry/billion-dollar-ai-chip-deal-between-google-and-meta-could-be-on-the-cards-would-involve-renting-google-cloud-tpus-next-year-outright-purchases-in-2027) Yeah, some competition at last. AMD better get in while the gettin' is good. BOM / memory prices probably won't get cheaper though.",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "This is great news. Having one company dominate the market is not good for prices and innovation.",
                "author": "_arelaxedscholar"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"OpenAI had a 2-year lead in the AI race to work 'uncontested,' Microsoft CEO Satya Nadella said Dec, 2024\". 2 years is a long time in tech. I never thought they'll lose their edge in 2025.",
        "score": 756,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t want to say it’s impossible; but those memes of the tiny OAi guy facing off against an awakening giant that is Google, they turned out to be pretty apt. Can Google be caught? I dunno. My money is pretty strongly on them going forward. Just the wealth of data is unimaginable.",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "What this really shows is there isn't much technical difficulty for tech companies to duplicate work done by OpenAI. Keep in mind, OpenAI initially leveraged Google's research to build their first models. I think this isn't really a failure on OpenAI's side... They just never actually had any technical moat other than. Once others joined in the flight, then it came down to heavy lift capability which the bigger players had an edge in. They all make enough money to pay for the infrastructure while OpenAI is limited to what they can raise or if they can convince people to build out their infrastructure off an IOU.",
                "author": "Amoral_Abe"
            },
            {
                "raw_content": "https://preview.redd.it/ln7p2mt2ug3g1.jpeg?width=1024&format=pjpg&auto=webp&s=c7a22dcc37454409900ddb894e7b8d2ea58240e7 Monthly cycle.",
                "author": "Prestigious_Ebb_1767"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ilya Sutskever – The age of scaling is over",
        "score": 501,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**TL;DR of the Ilya interview: (Not good if you came to hear something positive)** * Current approaches will \"go some distance and then peter out.\" Keep improving, but won't get you to AGI. The thing that actually works? \"We don't know how to build.\" * Core problem is generalization. Models are dramatically worse than humans at it. You can train a model on every competitive programming problem ever and it still won't have taste. Meanwhile a teenager learns to drive in 10 hours. * The eval numbers look great but real-world performance lags behind. Why? Because RL training inadvertently optimizes for evals. The real reward hackers are the researchers. * He claims to have ideas about what's missing but won't discuss publicly. So basically: current scaling is running out of steam, everyone's doing the same thing, and whoever cracks human-like learning efficiency wins.",
                "author": "LexyconG"
            },
            {
                "raw_content": "Ilya says **ASI** in 5 to 20 years",
                "author": "thisisnotsquidward"
            },
            {
                "raw_content": "Makes sense if you think about reinforcement training in biological models. More trials doesn’t necessarily mean better results past a certain point",
                "author": "Solid_Anxiety8176"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 4.5 Opus scores 62% in SimpleBench, 2% higher than Claude 4.1 Opus.",
        "score": 181,
        "text_content": "Which brings up into the third place.",
        "comments": [
            {
                "raw_content": "76.4% is nuts compared to where we were just some months ago",
                "author": "Roubbes"
            },
            {
                "raw_content": "Maybe Opus 5 will pass Gemini 2.5 Pro, that would be really exciting!",
                "author": "CallMePyro"
            },
            {
                "raw_content": "The most important thing is that the new Opus uses 1/3 of the compute that 4.1 did.",
                "author": "Grand0rk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 4.5 Opus deceptive benchmark reporting",
        "score": 196,
        "text_content": "I just noticed that for ARC-AGI-2, the score Anthropic reported was for 64k thinking tokens, whereas Gemini 3 maxes out at 32k. When they are both limited to 32k, Opus actually performs slightly worse than Gemini. This is buried at the very end of their announcement “All evals were run with a 64K thinking budget”. This is a HUGE difference that nobody is talking about.",
        "comments": [
            {
                "raw_content": "Is this really deceptive? I mean, they clearly state the amount of thinking tokens used. They're not required to stop at the same thinking tokens Gemini does. I'm not really sure what you're arguing?",
                "author": "ZestyCheeses"
            },
            {
                "raw_content": "I mean, we don't even know the size of Gemini 3 and Opus 4.5, which matters as much as how long they think. I have no idea if they're in the same size class or not. Cost per task vs. performance is the most important comparison anyway.",
                "author": "Sky-kunn"
            },
            {
                "raw_content": "Sounds like a skill issue. Why didn't Google use more than 32k tokens?",
                "author": "sebzim4500"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT voice mode now supports transcripts, message edit, maps, images",
        "score": 26,
        "text_content": "https://x.com/OpenAI/status/1993381101369458763?s=20 You can now use ChatGPT Voice right inside chat—no separate mode needed. You can talk, watch answers appear, review earlier messages, and see visuals like images or maps in real time.",
        "comments": [
            {
                "raw_content": "Man, just wish it sounded better and didn't stop at the slightest sound",
                "author": "Raiyan135"
            },
            {
                "raw_content": "OMG, the next internship project they try to sell at OpenAI. Neat, but nothing spectacular. Voice mode could have been much much better by now instead they try to sell those tiny improvements.",
                "author": "LatentSpaceLeaper"
            },
            {
                "raw_content": "The model is so small that almost everything it says is wrong. I guess it needs to be to be fast.",
                "author": "1a1b"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "$20 or $200 plan? They'll have to share this pie with a handful of other comparable models. There's no pricing power, and likely a race to the bottom",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It looks like there is too much competition for OpenAI to succeed the way they need to. Maybe they will make another big breakthrough in research but my understanding is that most of their researchers were poached, so...",
                "author": "tondollari"
            },
            {
                "raw_content": "Wasn't one of Sam Altman's goal to make \"intelligence too cheap to meter\"?",
                "author": "glanni_glaepur"
            },
            {
                "raw_content": "There are so many competing AI services, all offering free tiers and offering different specialities, and delivering amazing upgrades, that it makes no sense to pay for one service. Paying, in fact, locks you into one eco-system so you don't even know what competing AIs are offering. It makes more financial sense, and more sense in general, to keep bouncing around to the free tiers of AI service providers. That way, you keep on top of what the competing AIs are doing as well as saving money.",
                "author": "JackStrawWitchita"
            }
        ],
        "subreddit": "singularity"
    }
]