[
    {
        "post_name": "Stephen Miller's response to Zelensky today. It's just as great as you'd expect. 🔥",
        "score": 1448,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"I just want to stop the world from killing itself.\"",
                "author": "Mamapedia"
            },
            {
                "raw_content": "Stephen Miller is in a battle with Tom Homan to be my favorite person in Trump's orbit, but I think I like Stephen Miller just a little bit more. And the reason I think I like Stephen Miller even more than Tom Homan is neither give a crap about political correctness and how lefties and normies perceive things, but between the two, it seems like Tom is that way because he's very naturally that way being real old school, which is great, but Stephen strikes me as a guy who even more intellectually assesses the beliefs of the left and the normies, and the feel of things and disregards any of it and turns his dial of not giving a crap up to 11 out of pure spite for everything they represent. Everything the dude says is like a breath of fresh air and is just refreshingly raw. Tom Homan has it too, don't get me wrong, and again he's my second favorite person in Trump's orbit, but Stephen Miller takes the cake.",
                "author": "StaticNoise2"
            },
            {
                "raw_content": "I’m glad we get to see this shit in the open and not behind closed doors.",
                "author": "SCP0073"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Missing daddy",
        "score": 1360,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kek... this was posted 31 seconds before this sticky! They are side by side in NEW, I don't think I've seen that before https://r.patriots.win/p/19AdgXJ09B/he-misses-joe/c",
                "author": "Seeing_Red"
            },
            {
                "raw_content": "Reality has a very funny way of kicking you in the balls, doesn't it Zelenskyyyyyyyyyyyy?",
                "author": "GunsWithGooglyEyes"
            },
            {
                "raw_content": "Trump's your daddy now.",
                "author": "DemocratMath"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump and JD after the Zelensky meeting: “I thought you said Bad Cop Bad Cop!”",
        "score": 1017,
        "text_content": "",
        "comments": [
            {
                "raw_content": "it was pretty much good cop = trump and bad cop = jd, till shitlensky started throwing out threats",
                "author": "ewill95"
            },
            {
                "raw_content": "funny",
                "author": "spinometer"
            },
            {
                "raw_content": "I thought Trump's performance today was great! I hope he lays into all the other world \"leaders\" next.",
                "author": "WanderingPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "time to stop dying",
        "score": 1042,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is so creepy",
                "author": "CO2_Generator"
            },
            {
                "raw_content": "I read somewhere last week that Green Goblin played drums with his dick on his TV show. Would that actually surprise anyone at this point.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Moloch is still hungry and coke is expensive you Bigots!",
                "author": "TheOne1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I will be signing a complete PARDON of Pete Rose",
        "score": 886,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pete did nothing wrong",
                "author": "deletedandreacted"
            },
            {
                "raw_content": "I don’t see at all what’s wrong on betting on your team to win. You do that in every other way but using money it’s somehow illegal. If you’re betting on your team to lose is a whole nother thing because it’s so much easier to guarantee a loss than a win.",
                "author": "IvotedforTrumptwice"
            },
            {
                "raw_content": "https://en.wikipedia.org/wiki/Pete_Rose For context for those who don't follow sportsballing matters.",
                "author": "Above_Reproach"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well played, Red...",
        "score": 2321,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Subtle mockery, but mockery nonetheless.",
                "author": "KuzoKevin"
            },
            {
                "raw_content": "Isn't this piss tears guy?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "This cunt, Olbermann, does not speak for me, a citizen of the United States of America . And, if Olbermann renders fair return, it is against my will, for I desire nothing but odds with The Ukraine.",
                "author": "Protonboy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A picture of two men: A Marine, who's truly at home when the flak is flying, and a Cuban about to Channel his Inner Tony Montana.",
        "score": 1391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am liking Rubio's energy. Trump is not a sucker, he sees something in Little Marco.",
                "author": "iirc_life"
            },
            {
                "raw_content": "Rubio does look pissed",
                "author": "john9985"
            },
            {
                "raw_content": "Rubio most likely assured President Trump that the mineral deal was ready to be signed. Zelensky reneged on the deal wanting security guarantees.",
                "author": "maximus_dinosaurus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump’s treasury secretary just said that this was the 3rd time Zelensky failed to sign an agreement in the last few weeks.",
        "score": 1706,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck it, no deal ever. Let’s just be done with that place.",
                "author": "forth2win"
            },
            {
                "raw_content": "That means some groups are giving him money to continue his war.",
                "author": "rdvs34283"
            },
            {
                "raw_content": "Cut him off. Part of me thinks he did this on purpose to try and make Trump look bad so that the friendly, more pliable democrats win in the midterms. He needs to be entirely cut off. No more financial support, no more intel, no more satellite tasking, CIA out of Ukraine and all the military aid that's there starts blowing up. He has no right to make demands, whatever problems are happening in Ukraine I feel bad about but this is none of America's business and we shouldn't fight with Russia over some other country's beef with them",
                "author": "itspancakees"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: The Department of Justice has just returned the boxes that Deranged Jack Smith made such a big deal about. They are being brought down to Florida and will someday be part of the Trump Presidential Library. Justice finally won out.",
        "score": 1876,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No justice until they are in jail.",
                "author": "scrubking"
            },
            {
                "raw_content": "I can't wait to go to the Trump Presidential Library. Also, a few book suggestions for when he's retired from the Presidency: 1. The Art of the Presidency 2. The Art of the Presidential Comeback 3. The Trump Book of Mean Tweets",
                "author": "Returningtogod"
            },
            {
                "raw_content": "He should put some of Barron's socks in the library.",
                "author": "MrMcGreenGenes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Parents",
        "score": 1540,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Hunter: Can we stop at McDonald's?** Biden: Sure Jack. **Barron: Can we stop at McDonald's?** President Trump: We have McDonald's at home.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Younger frens, make sure you let your grandma know you love and appreciate her, they’re not around forever and sucks when they’re gone.",
                "author": "GoGoGadgetGringo"
            },
            {
                "raw_content": "Where McDonald's serves the *original* Coca-Cola",
                "author": "julianleroux"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zelenskyy doesnt have the cards.",
        "score": 1801,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No holographic Charizard I see. Fucking noob",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "Might be my favorite line yet.",
                "author": "HoganP"
            },
            {
                "raw_content": "You can put those cards in the binders Pam Bondi gave out yesterday",
                "author": "MAGAPlenty"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TRUMP: WITHOUT AMERICA, ZELENSKY LOSES “Zelensky didn’t want to do a ceasefire! Without us he DOESN’T win... Without us he DOESN’T win. I’m only interested if he wants to end the bloodshed.”",
        "score": 1762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm only interested if Zelensky gets the rope.",
                "author": "klunniclowns2"
            },
            {
                "raw_content": "My European friend messaged me that the oval office scene just made him sad and that he was going to bed early. These people are cucks.",
                "author": "Faithful_Patriot"
            },
            {
                "raw_content": "Spot-the-fuck on. He's not dealing with Biden any more.",
                "author": "KuzoKevin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Speaker Mike Johnson: Thanks to President Trump - the days of America being taken advantage of and disrespected are OVER.",
        "score": 2207,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not sure I agree it was “Russia provoked…”",
                "author": "awsure"
            },
            {
                "raw_content": "> Russian-provoked lol shut the fuck up Mike, Russia dindu nuffin. The west and in particular Obama started this whole thing with the color revolution and installation of puppet zelensky during Obama's 2nd term",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "I think Trump has Ladyboy Johnson right where he wants him.",
                "author": "EarlyVoter1996"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cyka Blyat",
        "score": 1467,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, he's a dead man walking.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "One has been to actual war and the other just sends others to war. Who’s the real bitch, Zelensky? Gfy",
                "author": "JanOctSept"
            },
            {
                "raw_content": "Unlike Zelensky, Vance has actually seen combat; Zelensky just wears military sweaters and pretends through his state media that he's been anywhere within 50 miles of a front line. He's a coward, and a crybully, and I suspect the calculus is being run now to just cut him and the whole country loose and leave them to their fate, while they work out something with Putin after the fact.",
                "author": "LabTech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zelenskyy: \"When they, for example say that Ukraine is almost destroyed, that our soldiers run away, that they are not heroes, that the president is a dictator, what is the reaction? It's not about me. The reaction is, where is the friendship between Ukraine and the US?\"",
        "score": 1082,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one is saying your soldiers are running away, we are saying you are running out of them.",
                "author": "charlesthehammer"
            },
            {
                "raw_content": "Ukraine is one of the most corrupt countries in the world and Hunter was like I want to work there.",
                "author": "HankScorpio"
            },
            {
                "raw_content": "Gaslighting isn’t going to work anymore lil guy.",
                "author": "john9985"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN - Ukraine's Zelensky declines to apologize for row with Trump in interview with Bret Baeir.",
        "score": 1558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still doesn’t get it. I hope Ukraine parliament replaces him and then sends him to the front lines with a rifle.",
                "author": "Grindelwald"
            },
            {
                "raw_content": "What a blessing VP Vance is. He really stepped up in that moment. Worlds apart from that cuck Pence who would’ve just sat there saying nothing like in the Pelosi/Schumer meeting",
                "author": "symptomatic"
            },
            {
                "raw_content": "Dead Man Walking.",
                "author": "1DontTreadOnMe1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Based",
        "score": 1178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I haven't had time to see then entire length of the meeting, but the crossed arms was an absolutely astonishing childish look.",
                "author": "AllahFubar"
            },
            {
                "raw_content": "This is what it feels like to have an actual AMERICAN presidency.",
                "author": "ninabobby"
            },
            {
                "raw_content": "Netanyahu won't be happy. Zelenskyy and Bibi refer to Ukraine, birthplace of the Khazarian Jews, as part of Greater Israel. *(They also see Egypt, Syria, Jordan, Lebanon, Palestine, Sudan, the United Arab Emirates, Bahrain and Saudi-Arabia as Greater Israel)* *(I suspect people like Schumer and Schiff refer to the US as Greater Israel too)*",
                "author": "redredwine"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ANYONE NOTICED? Zelensky's reaction after hearing, 'You're not winning this.'",
        "score": 1379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is what a successful intervention with an irrational addict looks like when their biggest enabler cuts them off.",
                "author": "Purebloodsupreme"
            },
            {
                "raw_content": "\"Zelensky attempted to explain Russian President Vladimir Putin’s lack of diplomacy\" Why would Putin act diplomatically to Zelensky? Does Zelensky hold any cards? No, he doesn't.",
                "author": "nylentone"
            },
            {
                "raw_content": "This was the most beautiful thing ever. I knew from the first time Zelensky addressed the camera representing Ukraine while wearing his gym clothes that something wasn't right. Such vindication. Vance backs up Trump with zero hesitation and doesn't afraid of anything. I can't believe we backed Pence there is no possible way to compare the two Vance blows him the fuck out.",
                "author": "charliesean"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨🚨🚨🚨 SALT THREAD 🚨🚨🚨🚨 ------> Oval Office Tag Team Edition",
        "score": 1441,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"How fucking dare Trump and the couch fucker...\" Whoa, whoa, whoa... why am I catching strays here? - OscarTheCouch",
                "author": "OscarTheCouch"
            },
            {
                "raw_content": "All the bots are leaking oil",
                "author": "Leucophylla12"
            },
            {
                "raw_content": "There is more unhinged rage than tears in this batch... but it is still a sight to behold.",
                "author": "OscarTheCouch"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yup",
        "score": 2313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Put a rifle in his hands and force him to the front lines like he's done to so many young men whom he ordered snatched off the streets of Ukraine.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "He’s got plenty to retire on, due to his wildly popular role in, “Honey, I Shrunk the Population!”",
                "author": "Groundpounder"
            },
            {
                "raw_content": "Well, He Acted Badly.",
                "author": "TEXinLA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AMD officially released the prices of 9000 series cards",
        "score": 777,
        "text_content": "RX 9070 - $549 USD RX 9070 XT - $599 USD AMD just finished their premiere of showcasing the 9000 Series cards, showing improvements in Ray Tracing, ML performance, FSR 4, and some architectural changes. What are we thinking?",
        "comments": [
            {
                "raw_content": "Good prices if the 9070 XT is actually near the 5070 Ti in performance. But of course, we'll see how many MSRP options there are.",
                "author": "MortimerDongle"
            },
            {
                "raw_content": "That.'s... good? Wow. If they're actually available and live up to performance leaks / rumors the XT will be downright great.",
                "author": "Belydrith"
            },
            {
                "raw_content": "9070 XT looks very compelling since it offers close to XTX raster and better RT performance than it, it also deals with 5070 Ti really well overall. 9070 at 549$ seems like a big fail, but while customers will hate the price, one also should understand that: \\* N4 yields are very good right now, so AMD doesn't want you to get the non XT cards anymore \\* Unlike 7700 XT/7900 XT, 9070 has the same memory subsystem as the XT, so it also costs almost as much to make.",
                "author": "Merdiso"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Chips & Cheese] Zen 5's AVX-512 Frequency Behavior",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD RX 9070 & 9070 XT GPU Prices, Specs, & Release Date",
        "score": 310,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waiting for reviews but I'm very optimistic about these products. Seems like AMD hit all the right notes. Better ray tracing, better performance per compute unit, reasonable power budget, reasonable price, software features continuously improving over time. They are doing everything we are asking them to do, besides giving the cards away for free.",
                "author": "_Oxygenator_"
            },
            {
                "raw_content": "This is actually sounds reasonable, the pricing here in Australia at least is 965 AUD. However I'm wary until reviews come out",
                "author": "Strykah"
            },
            {
                "raw_content": "So if we take AMD at their word (9070XT = 3090 + 26%) and make-believe MSRP is actual pricing. (back-calculating using [TPU's 3090 data](https://www.techpowerup.com/gpu-specs/geforce-rtx-3090.c3622)) * The 9070XT is 4.5% slower & 20% cheaper than the RTX5070TI. * And it's 13.7% slower & 40% cheaper than the RTX5080. If the *actual* prices of the 9070XT are *actually* near MSRP, those savings will be a lot higher. Because the Nvidia cards definitely aren't going for MSRP. **EDIT:** Huh. The 9070XT performance looks a whole lot better if you do the AMD vs. AMD comparison from their slides (9070XT = 6900XT + 51%). Using TPU's data... * The 9070XT is then 5% *better* than the RTX5070Ti. * And it's only 6% slower than the RTX5080.",
                "author": "RxBrad"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel delays $28 billion Ohio chip factory in New Albany again, to 2030 or 2031",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gives these Ohioans plenty of time to not learn how to make chips",
                "author": "Naive-Umpire-9681"
            },
            {
                "raw_content": "Ohio gave 2 billion in tax incentives & this timeline puts intel outside of the agreement and the state can start doing “claw backs”.",
                "author": "Gray_points"
            },
            {
                "raw_content": "For those who have asked why Pat was fired, it's stuff like this. Massive capital expenditure projects where there wasn't market demand. Becoming a foundry and focusing on manufacturing is good, but you need to make sure that you're actually spending money appropriately for real demand, not best case scenario.",
                "author": "BigManWithABigBeard"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Reportedly Progressing Well with 2 nm GAA Yields, Late 2025 Mass Production Phase Looms",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Please don't mess this up Samsung and make a good yielding process node. Three companies needed to sustain a healthy semiconductor market as TSMC and Intel or Samsung is not enough, If one fails for just one gen it's back to the current mess for multiple generations.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Man, this sub really doesn't give a flying fuck about Samsung huh? If this were a positive rumor about Intel 18A there would be 100 responses fellating already, but a positive about SF2? Not a single reply.",
                "author": "Tiny-Sugar-8317"
            },
            {
                "raw_content": "samsung well or real world well?",
                "author": "TophxSmash"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Hardware Unboxed] Another Fail or Great Success? - Our Thoughts on Radeon RX 9070 XT and RX 9070",
        "score": 182,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you watched the actual reveal you could hear that a lot of the performance and price data was dubbed after the fact pretty obviously. Pretty funny lol.",
                "author": "Zerasad"
            },
            {
                "raw_content": "We will see how it(9070 XT) compares to the 5070 TI in benchmarks. $150 less is quite a lot, if it can come in at a similar performance level, and if you can actually get it for that price, it could be awesome?",
                "author": "Juicyjackson"
            },
            {
                "raw_content": "I think AMD compared the 9070 XT to the 5070 Ti last minute (probably had to pay $900 /s): [https://imgur.com/a/Ncm0km0](https://imgur.com/a/Ncm0km0) **OC 4K Native** Comparison Table (so you don't have to click on the link ;) RX 9070 XT OC (340W advertised) vs RTX 5070 Ti ([287W Real power draw](https://www.reddit.com/r/hardware/comments/1iwcsoq/nvidia_geforce_rtx_5070_ti_meta_review/)) |Category|Game|RTX 5070 Ti (%)|RX 9070 XT OC (%)| |:-|:-|:-|:-| |**Native 4K Ultra**|S.T.A.L.K.E.R. 2: Heart of Chornobyl|100%|86%| ||Warhammer 40,000: Space Marine 2|100%|90%| ||F1 24|100%|90%| ||Black Myth: Wukong|100%|94%| ||God of War: Ragnarok|100%|99%| ||Final Fantasy XVI Demo|100%|103%| ||Starfield|100%|105%| ||Cyberpunk 2077|100%|105%| ||Dragon Age: The Veilguard|100%|106%| ||Assassin's Creed Mirage|100%|107%| ||Call of Duty: Black Ops 6|100%|129%| |**Native 4K Raytracing**|Cyberpunk 2077|100%|86%| ||Dying Light 2|100%|90%| ||The Witcher 3|100%|93%| ||Star Wars Outlaws|100%|95%| ||F1 24|100%|95%| ||Hitman 3|100%|96%| ||Avatar: Frontiers of Pandora|100%|97%| ||Watch Dogs: Legion|100%|100%| ||Far Cry 6|100%|113%|",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Radeon RX 9070 Series Technical Deep Dive",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">The new Radiance 2 Display Engine comes with major hardware updates that reduce **GPU idle power draw in multi-monitor setups.** The engine also comes with **hardware flip-metering support** (something NVIDIA also introduced with Blackwell, and which enables Multi-Frame Gen on the RTX 50-series). Flip-metering improves video frame pacing to the GPU and reduces CPU overhead for video playback. There is also a display engine level hardware image sharpening component that drives Radeon Image Sharpening. As for I/O, you get contemporary DisplayPort 2.1a and HDMI 2.1b, we are waiting to confirm the UHBR bit-rates. Idle power has been a topic of discssion for RDNA3 MCM cards, so it's good to hear this. Also interesting to hear they have something similar to hardware flip-metering. >Navi 48 comes a **dual media engine**, each of the **two can perform concurrent encoding and decoding**, and so the implementation resembles an NVIDIA GPU having two each of NVENC and NVDEC units. The new generation media engine offers a 25% increase in H.264 low-latency encode quality, and an 11% improvement in HEVC encode quality. AV1 encode and decode gets B-frames support, vastly improving bitrates. A B-frame is a frame that lacks image information, but instead motion-vector values, that lets the decoder reconstruct the image component using past and future I-Frames (frames with image data). The media engine posts a 50% generational performance uplift (measured in encoder/decoder frame rates), with reductions in memory overhead. FINALLY, this is big news. So many leaks and rumours on perf, but the media engine is what I've been wanting to see. Interested to see some testing especially from EposVox. Really hope split-encode/decode will take off. This is pretty much RTX 5080 HW acceleration access (5070 Ti has 2 encode, 1 decode). This is a segment of the market AMD really needs to expand upon. There's also a lot of more info. The rest, AI, RT, memory hierarchy looks greatly improved. Hopefully Chips&Cheese also does a deep dive!",
                "author": "Noble00_"
            },
            {
                "raw_content": "I love the image comparison between RDNA3 and RDNA4 low bitrate H264 streaming. They clearly admit RDNA3 is blocky and artifacting, which is basically shitty hardware to use for Live streaming ?",
                "author": "kyp-d"
            },
            {
                "raw_content": "These CUs are quite chonky. I wonder what the implications would be for future iGPUs, if a future APU keeps the 8 WGPs.",
                "author": "Earthborn92"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "9070XT's GPU Core Is Slightly Smaller than 7900 XTX's",
        "score": 28,
        "text_content": "[9070XT](https://www.youtube.com/channel/UCmMwHbw2j8LfvTKVh3O7Vdw/community?lb=UgkxaBXLii8rAh19oleXsjtz4PakLrEdLktI) Navi 48 (N5) die annotated by High Yield, GPU core area = ***186,93mm******^(2)*** [7900XTX](https://locuza.substack.com/p/radeon-n31-vs-geforce-ad102103-chip) Navi 31 (N4) die annotated by Locuza (access picture via Google Images), GPU core area = ***191,29mm******^(2)*** GPU core area (frontend + L2 + command processor + CUs etc...) from Navi 31 -> Navi 48 = ***-2.28% or -4.36mm******^(2)*** Numbers derived with pixel counting. Results should be well within margin of error. Would be interesting to see clock frequency normalized testing for gaming or other workloads.",
        "comments": [
            {
                "raw_content": "GPU core = frontend + command processor + L2 + CUs, not all the other logic on the GCD for Navi 31. Infinity cache not included on either die.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "There seems to be quite a bit of overhead for Navi 48. Might be related to a much larger L2 cache? It's hard to tell. Hopefully AMD releases a white paper or High Yield annotates this further. A smaller core is reasonable. AMD tends to go with incremental upgrades that don't increase WGP size considerably, and N4 is about 6% denser than N5, IIRC. I did wonder at the relatively large die size. Seems like the answer is that it's not the cores themselves.",
                "author": "ET3D"
            },
            {
                "raw_content": "Not sure it's entirely worthwhile, the 7900 xtx is a MCM setup, there's enough not inside the GCD I don't think it's a good like for like comparison. If the 9070 XT were MCM, the GCD would likely be a lot smaller.",
                "author": "BigSassyBoi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[VideoCardz] AMD introduces $599 Radeon RX 9070 XT and $549 RX 9070 RDNA4 GPUs",
        "score": 91,
        "text_content": "[https://videocardz.com/newz/amd-introduces-599-radeon-rx-9070-xt-and-549-rx-9070-rdna4-gpus](https://videocardz.com/newz/amd-introduces-599-radeon-rx-9070-xt-and-549-rx-9070-rdna4-gpus)",
        "comments": [
            {
                "raw_content": "Good price on XT, shit price for 9070.",
                "author": "TK3600"
            },
            {
                "raw_content": "Time to retire Radeon 7?",
                "author": "NotoriousKSV"
            },
            {
                "raw_content": "499 would have been much better",
                "author": "Aleblanco1987"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "People who think The Switch 1's Outdated specs are the reason why Pokémon ZA looks the way it does ignore these games",
        "score": 420,
        "text_content": "Also I don't think PLZA is coming to Switch 2 and might just be for switch 1 with Backwards compatibility",
        "comments": [
            {
                "raw_content": "That’s pretty obvious to me, yeah. I’m not saying that the Switch is a super powerful hardware, at all. It has a 8 years lifespan. But there’s tons of examples of better looking games on Switch. So that’s not excuse. Maybe Legends ZA is a fun game, but graphically speaking is super poor.",
                "author": "Background-Sea4590"
            },
            {
                "raw_content": "Xenoblade, still, blows my fucking mind on how incredible that world is and felt to explore. Absolute benchmark for the OG switch.",
                "author": "Mrmeeksees"
            },
            {
                "raw_content": "People need to stop saying the switch (1) isnt powerful, it's been proven to have some amazing looking games. It's just Gamefreak- they're not good at making 3D video games. If they'd allow a third party company like Monolith Soft (Xenoblade devs) to develop the next Pokemon game it would be insane.",
                "author": "donpianta"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "You think if Nintendo had a ai for the switch 2 would they call it Navi?",
        "score": 80,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only if it says \"Hey, listen!\" whenever you turn down the volume",
                "author": "darkfawful2"
            },
            {
                "raw_content": "or adam after samus's ai",
                "author": "Wolventec"
            },
            {
                "raw_content": "Probably not",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If you're upset about how PLZA looks, don't buy it.",
        "score": 330,
        "text_content": "Seriously - don't buy it. I mean it 100%. Game Freak, and by extension Nintendo, have already shown a few times now exactly how much regard they have for fan outrage - practically none. And why would they? The games continue to see absolutely massive success, selling MILLIONS of copies. They have no incentive to change anything, and won't put more effort in until they have that incentive. So, speak the only language they understand. If you're disappointed enough with the graphic fidelity and performance to post about it online, translate that to where it actually matters and don't pick up a copy of PLZA when it drops. Convince a friend, a family member, whoever - anything will make a difference. And if one of the worlds wealthiest multimedia companies rehashing the same slop every other year doesn't actually bother you that much - then do us all a favor and stop brigading comment sections. The uphill battle to sway an Internet strangers opinion is steep, and you ain't winning that battle.",
        "comments": [
            {
                "raw_content": "I would do this with any other Pokemon Game, heck I didn't buy BDSP until a year later and I haven't bought SV DLC yet. But I love the gameplay on Legends Arceus and I loved the new gameplay for Z-A. I don't want them thinking innovating and trying new things is something we don't want. I will hold off on buying Gen 10 if the quality is not were it should be.",
                "author": "Jimlarios"
            },
            {
                "raw_content": ">Convince a friend, a family member, whoever - anything will make a difference. That's a nice thought but let's be honest, if Scarlet/Violet sold over 20 million, Z-A is going to do the same if not better. Sometimes you have to know the limitation of word of mouth. I'm not interested in Pokémon, so I won't get it. Also I feel like they have already won the battle, again 26 Millon, Most of which are casual people who just want a mindless chill time, you have a better chance of convincing people not to buy the next COD or assassin's creed. If you really wanted to make a change convincing random people on the internet is not going to do shit, you need big names to spread that message, idk any Pokémon youtubers but I would try convincing them to spread the message to not buy Z-A if it looks bad or just a big name youtuber in general. I know that's easier said than done, but I'd rather people try to get the big names to spread the message, rather than delude themselves into thinking they can actually make a change themselves.",
                "author": "AnnualSudden3805"
            },
            {
                "raw_content": "My only real issue is the weird starter selection but other than that it looks pretty cool",
                "author": "SpikeTheBurger"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What did y’all think of the direct that totally happened this month?",
        "score": 54,
        "text_content": "I can’t believe NateTheHate was right!",
        "comments": [
            {
                "raw_content": "I still can't believe Silksong got shadow dropped and we got Waluigi on Smash on the same day!",
                "author": "Popple06"
            },
            {
                "raw_content": "The Pokémon part was my favourite",
                "author": "Delicious_West_1993"
            },
            {
                "raw_content": "Nate never said there was going to be a direct this month. He only said Kirby planet robobot will release for the switch sometime this year.",
                "author": "Heyoayyo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "FEBRUARY ISN'T OVER YET BOOOOOOOOOOOOYS!!!!!!!!!!!!!",
        "score": 72,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, we had a trailer today with space, different planets and aliens. Close",
                "author": "AdventurousGold9875"
            },
            {
                "raw_content": "last day, everyone start praying 🥹🤞",
                "author": "Blayze4949"
            },
            {
                "raw_content": "its the last day give up bro",
                "author": "theaterfarts"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "If Gamecube comes to NSO the controller Nintendo sells should be the wavebird with rumble.",
        "score": 12,
        "text_content": "Obviously with modern stuff like bluetooth or however controllers connect on switch, and a usb port for charging. Anybody else agree? Or would you just rather them release the regular gamecube controller but wireless now?",
        "comments": [
            {
                "raw_content": "What do you mean by the last question? The Wavebird was just a wireless GC controller, with that extra bottom bit to house the wireless link up stuff. So they could just release a GC controller with Bluetooth, it would be the same but without the bulk. The Wavebird was great but yea that extra bulk isn’t needed now.",
                "author": "MintberryCrunch____"
            },
            {
                "raw_content": "What was the difference with the wavebird? I thought it was just wireless and bigger for the battery?",
                "author": "Hugh_Jegantlers"
            },
            {
                "raw_content": "Well, you can just use any GameCube controller for Switch already, you just need the gamecube controller adapter.",
                "author": "Caciulacdlac"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shipping manifests have revealed an engineering validation board with an AMD \"Aerith Plus\" APU. 20W TDP, 3.8GHz CPU boost, 8533MHz RAM speed",
        "score": 161,
        "text_content": "Sources: * https://xcancel.com/Olrak29_/status/1895376510523187440 * https://xcancel.com/Olrak29_/status/1895381545449574527 For reference the original Steam Deck used the normal Aerith APU and the Steam Deck OLED used AMD's Sephiroth APU Contrary to what the person who posted this said, I believe this is actually for Deckard and not for a new Steam Deck. I don't think a 20W handheld would be viable for Valve nor do I think a new Steam Deck revision would use an \"Aerith Plus\" chip since they left behind Aerith with the OLED revision. Plus Aerith had computer vision bits that the original Steam Deck didn't use, so I could see that potentially being useful for VR applications. **EDIT:** [Pierre-Loup Griffais confirmed this isn't for a Deck, so now I'm definitely leaning in the Deckard direction.](https://bsky.app/profile/plagman.bsky.social/post/3ljbhm2txns2a)",
        "comments": [
            {
                "raw_content": "next APU is going to be called Cloud or Zack?",
                "author": "Inevitable_Judge5231"
            },
            {
                "raw_content": "It's definitely not for a new Deck. https://bsky.app/profile/plagman.bsky.social/post/3ljbhm2txns2a",
                "author": "shoneysbreakfast"
            },
            {
                "raw_content": "So are these going to die prematurely?",
                "author": "roosell1986"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Call of Duty 2025 still releasing on PS4 and Xbox One",
        "score": 557,
        "text_content": "[https://xcancel.com/charlieINTEL/status/1895228195471007981#m](https://xcancel.com/charlieINTEL/status/1895228195471007981#m) >Call of Duty 2025 could still release on PS4 and Xbox One, per sources. Supporting last-gen in 2025 is a wild decision, but the game is in development for the old consoles from what we've heard. This may be a reason as to why there can't be two big maps in Warzone at same time.",
        "comments": [
            {
                "raw_content": "![gif](giphy|JCAZQKoMefkoX6TyTb|downsized)",
                "author": "Djdt2E"
            },
            {
                "raw_content": "The ps5 generation is half over lol",
                "author": "randomguy_-"
            },
            {
                "raw_content": "Makes sense when you consider it's probably going to launch on Switch 2 as well.",
                "author": "dtamago"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Cancelled Twisted Metal Live Service Title Was a Battle Royale, Featuring Out of Vehicle Combat in Third-Person",
        "score": 364,
        "text_content": "https://mp1st.com/news/cancelled-twisted-metal-live-service-a-battle-royale-featuring-out-of-vehicle-combat",
        "comments": [
            {
                "raw_content": "Idk about out of vehicle combat but Twisted Metal is kind of born to be a battle royale game",
                "author": "Broad-Marionberry755"
            },
            {
                "raw_content": "Getting out the car to get a power up, seconds later to get run over by Axel and them big ass wheels.",
                "author": "WherzMyNachos"
            },
            {
                "raw_content": "Twisted Metal... Is a Battle Royale.",
                "author": "byronotron"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Trademarks for \"Once Upon a Katamari\" and \"Gekishin Squadra\" filed by Bandai Namco",
        "score": 259,
        "text_content": "[https://www.gematsu.com/2025/02/bandai-namco-trademarks-once-upon-a-katamari-gekishin-squadra](https://www.gematsu.com/2025/02/bandai-namco-trademarks-once-upon-a-katamari-gekishin-squadra) EU trademark for Katamari: [https://euipo.europa.eu/eSearch/#details/trademarks/019149143](https://euipo.europa.eu/eSearch/#details/trademarks/019149143) NA trademark for Gekishin: [https://tsdr.uspto.gov/#caseNumber=99041762&caseSearchType=US\\_APPLICATION&caseType=DEFAULT&searchType=statusSearch](https://tsdr.uspto.gov/#caseNumber=99041762&caseSearchType=US_APPLICATION&caseType=DEFAULT&searchType=statusSearch) EU trademark for Gekishin: [https://euipo.europa.eu/eSearch/#details/trademarks/019143008](https://euipo.europa.eu/eSearch/#details/trademarks/019143008) Note that this would be the first brand new entry in the Katamari franchise in over a decade, and not another remaster",
        "comments": [
            {
                "raw_content": "There should be a new Katamari game every couple years",
                "author": "weiserca"
            },
            {
                "raw_content": "Let's goooo, more katamari",
                "author": "CosmicLogem"
            },
            {
                "raw_content": "NEW KATAMARI NEW KATAMARI NEW KATAMARI",
                "author": "fluffylittleraven"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "INTEL Arc Graphics 32.0.101.6632",
        "score": 50,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dont have to worry about black screens and bricking gpus unlike nvidia. amd system is rock solid as well long live the a770 136k lols",
                "author": "intelceloxyinsideamd"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "All You Need for Gaming – AMD RDNA™ 4 and RX 9000 Series Reveal",
        "score": 864,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9070 - 549$ 9070XT - 599$",
                "author": "DariusIII"
            },
            {
                "raw_content": "Now we just need them to hit shelves at MSRP. Could actually be a good launch if there is sufficient stock. AMD are listening. 5070ti performance at 599 is promising.",
                "author": "Dronin"
            },
            {
                "raw_content": "THEY DIDNT FUMBLE THE PRICING. FIRST GOOD NEWS OF 2025!",
                "author": "nilarips"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD introduces $599 Radeon RX 9070 XT and $549 RX 9070 RDNA4 GPUs - VideoCardz.com",
        "score": 2471,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There it is. Now vote with your wallet and dont even entertain the idea of the rubbish 5070 and 5070ti.",
                "author": "patriots21"
            },
            {
                "raw_content": "I will purchase one at that price if it's in stock.",
                "author": "00k5mp"
            },
            {
                "raw_content": "Own a NVIDIA RTX 2060, first time ive felt swayed towards AMD with the 9070 XT, What are peoples thoughts? Should the trigger on a purchase be pulled?",
                "author": "Ok_Spite2501"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "First PC build. 7900XTX Sapphire Nitro + in white",
        "score": 163,
        "text_content": "MSI Pano 100r Project zero b650 mono 7 9800x3d 64g ram 6000mt Sapphire nitro 7900xtc Hitting 70fps on monster hunter wild with texture pack on high settings in native 4k",
        "comments": [
            {
                "raw_content": "how are you just going to casually drop a flex like painting your nitro+ and not give us close up pictures!?!",
                "author": "piazzaguy"
            },
            {
                "raw_content": "The yellowish ram must be annoying",
                "author": "AngusPicanha"
            },
            {
                "raw_content": "any videos of you completing this master piece?",
                "author": "National-Morning-998"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD RX 9070 & 9070 XT GPU Prices, Specs, & Release Date",
        "score": 418,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happy to have alliteration again with the 9800x3d and 9070 XT.",
                "author": "Lin_Huichi"
            },
            {
                "raw_content": "AMD actually did it.",
                "author": "blueangel1953"
            },
            {
                "raw_content": "That's splendid news for me. Will get a 9070 XT as soon as it's available. Finally leaving greener gra$$ for redder pastures .. uhh ..",
                "author": "Wifibees"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD reveals Radeon Image Sharpening 2 for RDNA 4 graphics cards - OC3D.net",
        "score": 197,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My most used feature in adrenalin, it's just too good",
                "author": "rosalind1234"
            },
            {
                "raw_content": "That's a cool feature. It alleviates the annoying blur a bit :D",
                "author": "Crazy-Repeat-2006"
            },
            {
                "raw_content": "I used radeon image sharpening and currently using nvidia card. Radeon image sharpening has no competition period. It's just too good. Can't wait to try new rdna 4 features",
                "author": "AciVici"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Introducing the ASUS Radeon RX 9070 XT and RX 9070 TUF Gaming and Prime Graphics cards with Phase Change Thermal Pads, HDMI/Display Port 2.1, Triple Axial Fans, Dual-BIOS Performance/Quiet Profiles and GPU Tweak III",
        "score": 376,
        "text_content": "https://preview.redd.it/rd50e2ifrvle1.png?width=1920&format=png&auto=webp&s=07a9a0bdf823e033da1e308433fe615be7fa0f0d The latest generation of AMD graphics cards is now upon us. If you've recently upgraded your motherboard to one of our new X870 or recently launched B850 or B840 motherboards, you might feel like it's time to continue the AMD trend and upgrade your graphics card. For those who are less familiar with the new cards, here are the new main features: * The new RDNA 4 architecture * 16GB GDDR6 VRAM * Next-gen HYPR-RX tech delivers ultra-fast gaming * New AMD AI-powered technologies, including an improved experience with ray-tracing. * Machine-learning based super resolution mode compatible with select FSR 3.1 games provide an incredible balance of detailed images and fluid frame rates. * DisplayPort 2.1 outputs give users massive bandwidth for going big on resolution while supporting high-end refresh rates On the ASUS side, we've implemented a number of new changes to our cooling design, PCB design, and optional software: **Phase-Change Thermal Pads Provide a Long-Lasting Cooling Experience** One new change for our graphics cards this year is that we're switching from standard thermal paste used on the GPU and thermal module to phase-change thermal pads. When transferring heat, the electrically non-conductive pad is a solid at room temperature but liquifies as it heats up. As it melts, it fills the microscopic gaps between the GPU and thermal module, providing superior thermal conductivity and enhanced heat dissipation, ensuring optimal performance, even for sustained, heavy GPU workloads. Additionally, the phase-change thermal pads offer exceptional longevity. They outlast traditional pastes by a significant margin, even for graphics cards that see heavy workloads on a regular basis. **ASUS GPU Tweak III Software** \\- Some gamers prefer to tune their graphics cards for all-out performance, while others insist on quiet operation. A physical Dual BIOS switch lets users choose between performance and quiet modes without installing additional software. For more performance-tuning options, easy hardware monitoring and granular control of fan behavior, users can download the free ASUS GPU Tweak III software. **ASUS GPU Guard & Bracket\\*** \\- ASUS GPU Guard applies adhesive to secure all four corners to reduce the risk of cracks, while a GPU bracket helps ensure uniform mounting pressure and extra stability. **Protective PCB Coating\\*** \\- A protective conformal coating envelops the circuit board to help protect against short-circuits caused by moisture, dust or debris. \\*Available only on the TUF Gaming Radeon RX 9070 XT and RX 9070 cards **TUF Gaming Radeon RX 9070 XT OC Edition and TUF Gaming Radeon RX 9070 OC Edition** https://preview.redd.it/4zxtc3j5nvle1.jpg?width=4160&format=pjpg&auto=webp&s=12bb410662c4cb748df61dacfc3650076364fd11 TUF Gaming graphics cards utilize an unassuming style that fits in easily with just about any components on the market. For the TUF Gaming Radeon RX 9070 XT and RX 9070, ASUS has retained the classic ruggedized aesthetic of the series. An illuminated TUF Gaming logo on the corner of the card provides a touch of personalization, and it supports ASUS Aura Sync so users can coordinate its lighting with the rest of their compatible gear. The TUF Gaming design for this series delves deep into the standard excellent cooling that a TUF Gaming card provides and makes sure that gamers are well equipped in case they want to adjust their cooling or performance characteristics. These cards sport the typical metal exoskeleton for structural rigidity that the TUF Gaming cards are known for. Wide vents on the aluminum backplate allow heat to exhaust into the main airflow channel of your chassis. It wouldn't be a TUF Gaming card if it didn't include military-grade components for solid power delivery and long lifespan, or a PCB coating to protect it against short-circuits caused by moisture, dust, or debris. TUF Gaming Radeon RX 9070 XT and RX 9070 cards feature: * 3.125-slot design with a vented exoskeleton and massive fin array optimized for airflow from three Axial-tech fans * Three eleven-blade Axial-tech fans maintain a steady high-pressure stream of cooling through a massive airflow-optimized fin array. * Dual-ball fan bearings last up to twice as long as conventional sleeve-bearing designs. * 0dB technology allows the fans to turn off at low workloads and effectively become silent. * Dual BIOS switch to toggle between Performance and Quiet BIOS profiles. * ASUS GPU Guard and bracket secure the GPU, reducing the risk of cracks and ensuring stable mounting * Subtle RGB lighting on the TUF Gaming logo on the corner of the card can be configured through Aura Sync * GPU Tweak III software is free to monitor and configure your graphics card. The software now integrates the HW Info plug-in so you can keep an eye on your graphics card and just about anything else in your system. https://preview.redd.it/bl4k27m3nvle1.jpg?width=7344&format=pjpg&auto=webp&s=8d3dabfa8757cbdf56a0956b720844daa9aae3c0 **Pricing and Availability -** Pricing – TBD (Will be updated when available) Availability – On-Shelf March 6 at 6AM PT Product Page - * TUF Gaming Radeon RX 9070 XT OC Edition 16GB GDDR6 - [https://asus.com/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070xt-o16g-gaming/](https://asus.com/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070xt-o16g-gaming/) * TUF Gaming Radeon RX 9070 OC Edition 16GB GDDR6 - [https://asus.com/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070-o16g-gaming/](https://asus.com/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070-o16g-gaming/) **ASUS Prime Radeon RX 9070 XT OC Edition and Prime Radeon RX 9070 OC Edition** https://preview.redd.it/vl3o6xsmnvle1.jpg?width=7667&format=pjpg&auto=webp&s=a22553134cc5d2da72fe23dcaf8c3c3da05ef4ee ASUS Prime graphics cards were a new addition to our lineup last year. Packing performance and cooling into a compact 2.5 slot frame, these cards help ensure compatibility with more cases. Building a card this size that can handle the demands of long hours of gaming requires attention to a number of important details. To make sure they offer excellent cooling performance compatible with a number of compact cases, Prime series cards use three Axial-tech fans, similar to the fans we use on our top-end graphics cards - but use a smaller fan hub that allows for longer fan blades. We then surround the fans in a barrier ring to increase downward pressure. The card also features: * Dual-ball fan bearings last up to twice as long as conventional sleeve-bearing designs. * 0dB technology to turn the fans off below 50C, and turn the fans back on at 55C with a speed curve optimized for cooling and noise. * Phase-change GPU thermal pads for optimal heat transfer and long-term reliability. * 2.5-slot design allows for greater build compatibility while maintaining cooling performance * Dual-BIOS switch that allows you to switch fan profiles between Performance and Quiet BIOS profiles. * Aluminum protective backplate to protect the card and provide structural integrity * GPU Tweak III software is free to monitor and configure your graphics card. The software now integrates the HW Info plug-in so you can keep an eye on your graphics card and just about anything else in your system. https://preview.redd.it/qm8x0o43ovle1.png?width=2400&format=png&auto=webp&s=c3638dcb9517bb2e28579474545c0b38d415acbe **Pricing and Availability -** Pricing – TBD (Will be updated when available) Availability – On-Shelf March 6 at 6AM PT Product Page - * ASUS Prime Radeon RX 9070 XT OC Edition - [https://asus.com/motherboards-components/graphics-cards/prime/prime-rx9070xt-o16g/](https://asus.com/motherboards-components/graphics-cards/prime/prime-rx9070xt-o16g/) * ASUS Prime Radeon RX 9070 OC Edition - [https://asus.com/motherboards-components/graphics-cards/prime/prime-rx9070-o16g/](https://asus.com/motherboards-components/graphics-cards/prime/prime-rx9070-o16g/) FAQ - Q. Will there be other models than TUF Gaming and Prime? A. No plans to offer additional models at this time. Q. Where will we be able to purchase these cards? A. Although we don’t yet have final confirmation of Day 1 availability, these are the locations that are expected to have the cards: * US – Amazon, Newegg, Microcenter, ASUS eShop, Central Computer * CA – Canada Computers, Best Buy (CA) This is what we can share for now, as we'll update pricing and availability when they become available. Let us know what you think.",
        "comments": [
            {
                "raw_content": "I still remember that Asus was the highest official scalper during the pandemic, if there is an option this is the brand I'd never buy again in my life. [https://imgur.com/a/Tb8l9Sc](https://imgur.com/a/Tb8l9Sc)",
                "author": "Alarmed-Artichoke-44"
            },
            {
                "raw_content": "how can we let you know what we think when you've yet to provide pricing",
                "author": "jetjitters"
            },
            {
                "raw_content": "What's the advantage of GPU Tweak III when I can do the tweaking in the actual AMD Adrenaline software?",
                "author": "popop143"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "12V2x6 Done Right - By Sapphire! RX 9070 XT XFX Merc Quicksilver and Sapphire NITRO+ Preview",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "video does not really discuss but apparently it is fused. That might stop fires but does not solve the flawed design. Edit: Depends if fuse is for each wire or just the whole plug...",
                "author": "chemie99"
            },
            {
                "raw_content": "XFX cards looks AWESOME!",
                "author": "Apopololo"
            },
            {
                "raw_content": "I haven't watched the video fully just yet, but I figured this might be relevant since people seem really interested in this card in particular and its implementation of 12v2x6.",
                "author": "mateoboudoir"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "“Excellent availability across all markets” AMD promises sufficient RX 9070 stock at launch",
        "score": 300,
        "text_content": "",
        "comments": [
            {
                "raw_content": "With the drought of video cards these past many months, I doubt that even \"excellent availability\" would be sufficient to meet demands.",
                "author": "mockingbird-"
            },
            {
                "raw_content": "I reckon they stockpiled what they can after the first announcement of announcement of the announcement.",
                "author": "AciVici"
            },
            {
                "raw_content": "How much will the retail prices be? The MSRPs might be as elusive as the yeti or the loch ness monster.",
                "author": "mockingbird-"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "9070XT / 9070 DP 2.1 UHBR20 80Gbps",
        "score": 27,
        "text_content": "Just wondering if anyone know whether the upcoming 9070 radeon gpu's will support the full dp2.1 80Gbps bandwdth uhbr20 as ive recently picked up a ne 4k 240hz uhbdr20 monitor",
        "comments": [
            {
                "raw_content": "I think in Linus's video he said it doesn't support the full 80Gbps, only 54Gbps.",
                "author": "jedidude75"
            },
            {
                "raw_content": "UHBR 13.5 max iirc.",
                "author": "JediF999"
            },
            {
                "raw_content": "No it won't",
                "author": "sweetchilier"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "28 February 2025 - Daily /r/REBubble Discussion",
        "score": 2,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "Holy fuck this economy sucks. I’m in B2B selling a product that everyone needs, and no ones buying anything right now. Slowest we’ve ever seen!",
                "author": "Patmcgroin303"
            },
            {
                "raw_content": "Loving this stock market correction. We need it to come down more, sellers will get motivated.",
                "author": "Love-for-everyone"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Two Bay Area tech giants announce huge layoffs at almost exact same moment",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Autodesk and HP to save a click.",
                "author": "abandonedpetrock"
            },
            {
                "raw_content": "Autodesk could make more money if they had realistic pricing.",
                "author": "ebbiibbe"
            },
            {
                "raw_content": "Autodesk and HP",
                "author": "jairamjm"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida’s Condo Owners Face Uncertain Future as Listings Surged 43% in 2024",
        "score": 188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Huh all these rich snow birds from the North who didn't want to fix their crumbling outdated condos for years now can't get rid of them? Too bad, so sad.",
                "author": "Giantmeteor_we_needU"
            },
            {
                "raw_content": "Everything is fine just fine.",
                "author": "According-Muscle9305"
            },
            {
                "raw_content": "Why is this guy on all the thumbnails?",
                "author": "PPPP4MU"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuyers in US Canceled Contracts at Record Rate for January",
        "score": 74,
        "text_content": "https://www.bloomberg.com/news/articles/2025-02-28/homebuyers-in-us-canceled-contracts-at-record-rate-for-january Homebuyers in the US canceled purchase contracts at a record pace as economic and political uncertainty gave them cold feet. About 14.3% of sales agreements fell through in January, up from 13.4% a year earlier and the highest level for the month in data going back to 2017, according to data from brokerage Redfin Corp.",
        "comments": [
            {
                "raw_content": "I work with someone who's home they were selling fell through because the buyers had missed recent credit card payments. Bank denied the loan two days before close, house is back on the market.",
                "author": "hozemane"
            },
            {
                "raw_content": "No paywall: https://archive.is/OuU5l US Homebuyers Canceled Contracts at Record Rate for January - Bloombe… Prashant Gopal February 28, 2025 at 3:56 PM UTC Homebuyers in the US canceled purchase contracts at a record pace as economic and political uncertainty gave them cold feet. About 14.3% of sales agreements fell through in January, up from 13.4% a year earlier and the highest level for the month in data going back to 2017, according to data from brokerage Redfin Corp. House hunters face an ever-growing list of pressures, from high mortgage rates and prices to concerns about how trade wars and federal government cutbacks may ripple through the economy. The high rate of cancellations casts a pall over prospects for the key spring sales season, which is just getting underway. Canceled Contracts Rise to a January High More pending home sales are falling apart as uncertainty builds 0 5 10 15 % Jan2017 Jan2018 Jan2019 Jan2021 Jan2022 Jan2023 Jan2024 Jan2025 Source: Redfin Redfin’s report followed data from the National Association of Realtors that showed contracts to buy resale homes slumped to a record low last month. “Widespread economic and political uncertainty” caused more buyers and sellers to pull out of deals in January, Redfin said. “Tariffs, layoffs and federal policy changes are among the factors contributing to an air of instability. Some people are choosing to stay put.” Atlanta had the highest rate of cancellations last month, at 19.8%. Following were Orlando, Las Vegas, Houston and Jacksonville, Florida, each at around 18%. Rising inventory in certain markets may be behind some cancellations. More supply in those areas “means buyers have license to be fickle,” Redfin said. If an issue comes up in the inspection period, buyers may back out because they see opportunity to find a better home that doesn’t have that issue. Some agents are advising buyers not to give up on homes they want, even if they’ve lost a bidding war. “It’s worth checking in with the listing agent about a week after the house goes under contract,” said Alison Williams, a Redfin agent in Sacramento, California. “Twice since the start of the year, I’ve found out the original buyer canceled the contract, and my clients were able to get their offers accepted before the home went back on the market.”",
                "author": "Active-Spinach-2047"
            },
            {
                "raw_content": "I backed out on land I wanted and could afford because of the Elon Trump pony show.",
                "author": "Hamm_Sammy13"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlanta Fed is now projecting that Q1 GDP will be -1.5%… a contraction. Last week it was +2.3%",
        "score": 370,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And Q2 won't be any better. Which means 2 Q's in a row of this = recession *(unless they change the definition yet again)*",
                "author": "RJ5R"
            },
            {
                "raw_content": "Fire sale on stocks. Get ready",
                "author": "CapitanianExtinction"
            },
            {
                "raw_content": "Recession incoming!",
                "author": "cinciNattyLight"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "1 in 7 Pending Home Sales Are Getting Canceled, the Highest Share During This Time of Year on Record",
        "score": 397,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">There are a few reasons today’s homebuyers are skittish: >Supply is rising and demand is falling. Housing inventory has risen to its highest level since 2020, giving homebuyers more options. At the same time, pending home sales fell to their lowest level on record (aside from the start of the pandemic) in January. More supply and less demand means the housing market has tilted in buyers’ favor, with some house hunters backing out during the inspection period because a better house for them has come along–or at least the promise of a better house. >Economic uncertainty. Redfin agents report that some deals are falling through because buyers (and sometimes, sellers) are getting cold feet due to widespread economic and political uncertainty. Tariffs, layoffs, and federal policy changes are among the factors contributing to an air of instability. Some people are choosing to stay put. >Sticker shock. Mortgage rates and home prices remain stubbornly high, with January’s average rate hitting 6.96%, an eight-month high (weekly average rates have since declined to 6.76%, and the median U.S. home-sale price rising 4.1%. Combined with economic uncertainty, high housing costs are causing some would-be buyers to change their minds. >“I’m seeing more homebuyers back out of deals than usual, and I’m hearing the same from other agents and mortgage lenders in the area,” said Sam Brinton, a Redfin Premier agent in Salt Lake City, UT. “Some buyers are getting cold feet with everything going on in the world. But even with more cancellations, there are also more buyers out there in general. The nice homes in desirable locations are selling quickly, and those buyers are less likely to cancel.”",
                "author": "sifl1202"
            },
            {
                "raw_content": "The record only goes to 2017. What a joke. Redfin is as misleading as the real news now",
                "author": "poiuytrewq1234564"
            },
            {
                "raw_content": "Snorting elk hasn't posed a Redfin article in a while I wonder why that is. Probably because the last few haven't been as bullish as they usually are.",
                "author": "Former_Society6492"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "St Petersburg Inventory Real Estate Active Listings is Now Interesting",
        "score": 33,
        "text_content": "I have a buddy that flips houses in Tampa, Florida. Been tracking this FRED graph lately to see how the new construction and condo situation is panning out in Florida. His new renovation hasn’t sold yet because there’s so many other options that are similar to a white spackled and cheap floor typical flip house. Listings are above pre-pandemic levels",
        "comments": [
            {
                "raw_content": "Interesting that the inventory went down during the 2020-21 mania and is back up at the pre-20 level. Is it possible that the people who owned absolute trash houses managed to offload them in 20-21 to overzealous buyers, and now the bagholders are looking to get rid of them?",
                "author": "Wonderful_Brain2044"
            },
            {
                "raw_content": "Prices only go up! Date the rate marry the house!",
                "author": "AdInternational9430"
            },
            {
                "raw_content": "Check out a map view and click any random property close to the bay. The pictures will show you a gutted house that flooded with the drywall cut halfway up the wall and studs showing. Still asking $600k.",
                "author": "Brilliant_Reply8643"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing Inventory in Florida Just Hit the Highest Level on Record",
        "score": 128,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So based on the graph it’s barely over 2019 levels when we had lower housing costs and lower interest rates. Condos are the driving force on available properties right now. They are being dumped onto the market because of the new maintenance laws. More people are moving to FL than leaving. SFH homes are still selling well, at least in my area. Days on market are 8.8% over last year. I’m sure if rates were lower days on market would level out to previous years.",
                "author": "ruskijim"
            },
            {
                "raw_content": "it is a condo bloodbath. SFH inventory is not high",
                "author": "Mediocre-Painting-33"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Housing market gained $2.5 trillion in value",
        "score": 14,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Printer go brrrrr",
                "author": "BTC_90210"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What you think? my guess is some deepmind model for medicine",
        "score": 392,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This guy is a bit of a hype-man, even by my standards. Just read his other tweets. He's an uncritical appraiser of AI all the time.",
                "author": "MohMayaTyagi"
            },
            {
                "raw_content": "I think this is the kind of stuff that makes people think this place is a cult",
                "author": "Illustrious-Okra-524"
            },
            {
                "raw_content": "Who is this guy? OpenAi has a biological model due soon too.",
                "author": "ManicManz13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "gpt4.5 is naturally funny, it doesn't feel forced or slop.",
        "score": 553,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is difficult to describe, but it definitely has something different. Many people think it is not a successful improvement, but the mere fact that they are exploring different training paths is worthy of praise.",
                "author": "wayl"
            },
            {
                "raw_content": "Prompt it to make SVG gasoline obviously",
                "author": "llkj11"
            },
            {
                "raw_content": "Hit enough parameters to tap into the patterns of the collective consciousness Best be polite",
                "author": "Own_Woodpecker1103"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "this is what Ilya saw",
        "score": 638,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I always wondered: 1) how much \"data\" humans have that it is not on the internet (just thinking of huge un-digitalized archives? 2) how much \"private\" data is on the internet? (or backups, local, etc) compare to public?",
                "author": "Noveno"
            },
            {
                "raw_content": "What's next then?",
                "author": "Borgie32"
            },
            {
                "raw_content": "Why do we need more data than what's already out there ?",
                "author": "goodpointbadpoint"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How are we possibly going to see medical breakthroughs when it takes 12-15 years from drug discovery to the point of hitting the market?",
        "score": 72,
        "text_content": "I think the one benefit all of us collectively want is better healthcare and better treatment of diseases. Collectively all these Tech guys seem to think Health is the one area of AI that will radically improve. Even if tomorrow Alphafold or Co-Scientist find a cure for Heart Disease, or nerve pain, or autoimmune disease, we are likely waiting 12-15 years to see people benefit. How can we see the medical revolution that we want with these ridiculously long timeframes? By the time these drugs hit the market they will probably already be outdated with whatever new Tech is available at that time (2037-2042). I’ve heard Demis Hassabis speak about creating a virtual cell, and maybe that could potentially shorten the trial timelines. Anyone have any thoughts to this, are we really going to have to wait 12 years before we see new therapeutics or will the revolution come quicker?",
        "comments": [
            {
                "raw_content": "I think finding the compound is a pretty big part of the trials, which is what they're automating rn, the clinical trials take make 8 years, and then 1-2 years for regulatory stuff, so yeah still up to 10 years, but if we came across something really groundbreaking, Russia, India and especially some 3rd world countries have much lower requirements and timelines, sometimes less than 6 years which they could be tested in. Yeah it will still take time, and even if we do the full 12-15 years, its a terrible shame it'll take that long, but it will still come.",
                "author": "WanderingStranger0"
            },
            {
                "raw_content": "It will take some time, but I think the solution is something for the human body similar to NVIDIAs earth 2, and virtual dojo. Where we can accurately simulate the human bodies response to drugs, etc. and then do it at 100,000x speed. 12 years of clinical trials in an hour. We are of course far from this right now.",
                "author": "weshouldhaveshotguns"
            },
            {
                "raw_content": "i hope theres good antiaging drugs availabl before my parents pass away. theyre in their late sixties",
                "author": "petermobeter"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New Deepseek report: $1.10 per 1M output tokens for v3, $2.19 per 1M tokens for r1, even cheaper during low demand. By contrast, GPT-4.5 is $150.00(!) per 1M tokens. America is being destroyed in the price war.",
        "score": 35,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now compare to Gemini 2.0 Flash and Gemini 2.0 Flash Lite? Gemini has comparable if not similar performance and is actually much cheaper than even DeepSeek's discounted price. **Gemini 2.0 Flash Lite (Vertex AI):** * **Input:** $0.075 * **Input audio:** $0.075 * **Output text:** $0.30 **Gemini 2.0 Flash (Vertex AI):** * **Input:** $0.15 * **Input audio:** $1.00 * **Output text:** $0.60 **Gemini 1.5 Flash:** * Input price was reduced to $0.075. * Output price is $0.30 for prompts under 128K.",
                "author": "ShrimpCrackers"
            },
            {
                "raw_content": "And they shouldn’t go down the price war drain.",
                "author": "budy31"
            },
            {
                "raw_content": "I think for many use cases cheap models work just fine. But I also would gladly pay the cost for GPT4.5, so say 100x, if it's 10% better than Deepseek. Intelligence works kind of exponentially I think, and I want to have access to the best.",
                "author": "Milan_dr"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "To say GPT-4.5 means winter is to act like it exists in a vacuum where reasoning models don’t exist and won’t be able to distill its vast knowledge.",
        "score": 174,
        "text_content": "The reasoning paradigm likely still has plenty of low-hanging fruit.",
        "comments": [
            {
                "raw_content": "Literally this month we had grok 3, o3 mini and claude 3.7 just because within the same month we don't have another model that crushes those benchmarks does not mean we have a winter I mean damn. No idea if GPT4.5 represents a different architecture of the attainment of some \"magic\" or whatever we can't benchmark but we should not be expecting anything within the month after the release of those previous models. Labs can release things that aren't just general improvements, if Google releases a new AI Co-scientist that bombs things like coding, writing and other benchmarks but is great at making hypothesis are we going to say OH GOD THERES A WALL IT DOESNT BEAT ALL OTHER MODELS ON EVERY BENCHMARK OH GOD",
                "author": "WanderingStranger0"
            },
            {
                "raw_content": "The best post here in days. People are turning into Gary Marcus clones like they didn't see o3 benchmarks 2 months ago.",
                "author": "BigBourgeoisie"
            },
            {
                "raw_content": "you can't distill actual knowledge down. you need parameters to store it. the exciting thing about 4.5 is a stronger reasoning model built on top of it",
                "author": "trololololo2137"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Failed prediction of the week from Joe Russo: \"AI will be able to to create a full movie within two years\" (made on April 2023)",
        "score": 620,
        "text_content": "\\*note\\* I fully expect moderators to delete this post given that they hate anything critical of AI. I like to come back to overly-optimistic AI predictions that did not come to pass, which is important in my view given that this entire sub is dedicated to those predictions. Prediction of the week this time is Joe Russo claiming that anyone would be able to ask an AI to build a full movie based on their preferences, and it would autonomously generate one including visuals, audio, script etc, all by April 2025. See below. When asked in “how many years” AI will be able to “actually create” a movie, Russo predicted: “Two years.” The director also theorized on how advanced AI will eventually give moviegoers the chance to create different movies on the spot. “Potentially, what you could do with \\[AI\\] is obviously use it to engineer storytelling and change storytelling,” Russo said. “So you have a constantly evolving story, either in a game or in a movie or a TV show. You could walk into your house and save the AI on your streaming platform. ‘Hey, I want a movie starring my photoreal avatar and Marilyn Monroe’s photoreal avatar. I want it to be a rom-com because I’ve had a rough day,’ and it renders a very competent story with dialogue that mimics your voice. It mimics your voice, and suddenly now you have a rom-com starring you that’s 90 minutes long. So you can curate your story specifically to you.” [https://variety.com/2023/film/news/joe-russo-artificial-intelligence-create-movies-two-years-1235593319/](https://variety.com/2023/film/news/joe-russo-artificial-intelligence-create-movies-two-years-1235593319/)",
        "comments": [
            {
                "raw_content": "The mods don't hate things critical of AI, we don't like highly emotional doomerism. This post is a reasonable discussion, carry on.",
                "author": "Anen-o-me"
            },
            {
                "raw_content": "Good post OP. It's important to track the outcome of predictions, to tune future ones.",
                "author": "derfw"
            },
            {
                "raw_content": "It’s still February. The claim hasn’t failed… yet. Also if he was talking about calendar years, its failure to come to pass would be on 1. January 2026, 00:00:00. Thing is, there are quite convincing looking AI generated video clips. It is foreseeable that AI generated movies will become possible.",
                "author": "Weak_Night_8937"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A new realtime voice chat: Sesame",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's very good. And clearly OpenAI can do stuff like this, but just fear the backlash 🤦🏻‍♂️",
                "author": "ShooBum-T"
            },
            {
                "raw_content": "It's jaw dropping",
                "author": "Tobio-Star"
            },
            {
                "raw_content": "huh wtf that thing is way better than AVM.",
                "author": "Silver-Chipmunk7744"
            }
        ],
        "subreddit": "singularity"
    }
]