[
    {
        "post_name": "President Trump notices the Malaysian dancers and JOINS IN as he steps off Air Force One for his arrival ceremony in Malaysia",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love DJT! Hes a good man, and i hope hes around a long long time",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "A Muslim country that is functional.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "That's my President!",
                "author": "RustySheckelford"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The face you make when you're enjoying watching the self-destruction of the Democratic Party.",
        "score": 480,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Republican congress hasn’t really offered us anything that shows them as a good alternative. I fear for the country after Trump isn’t around",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "Ad hominem. Again and again. They have used every variation of ad hominem one can think of: from words to costumes. Of course they deflect to ad hominem because they cannot win on policy.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "Democrat's imploding is like the Titan from Oceangate, comedy horror and you don't want to be anywhere near it when it happens.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW SCANDAL: a whistleblower at USAA discusses the company's collapse and how its veteran American employees are committing suicide and being replaced with Indians.",
        "score": 527,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate to say it but we need to shun these people in our personal lives. No indians. None.",
                "author": "DefineTheLine"
            },
            {
                "raw_content": "I doubt they are committing suicide. They are more likely being suicided.",
                "author": "dres3"
            },
            {
                "raw_content": "The pajeet invasion has to be stopped. I am sick of leaders in our country using it as a landing pad for every brown skin from a shithole country that can follow laws, rules and policy like a good Christian would. I am really sick of it!",
                "author": "Smurfection"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump tells Chuck Schumer and Hakeem Jeffries to SHOVE IT - he will never give illegal aliens $1.5 trillion to reopen the government because it will HURT Americans.",
        "score": 1159,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This warrants zero explanation.",
                "author": "2Clutch"
            },
            {
                "raw_content": "I keep forgetting that the gov’t is shut down",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "So... either keep the oversized government so-called \"shut down\" or give illegal aliens our hard-earned money? Gee, that's a tough one...",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LITERALLY.. THE LEFT IS WAGING A WAR ON CITIZENSHIP... THEIR BID TO DESTROY THE AMERICAN CULTURE.",
        "score": 917,
        "text_content": "",
        "comments": [
            {
                "raw_content": "War on citizenship versus war on invasion. Evil versus good. Wrong versus right.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "There should be an elected official fitness test. If they can't cut it mentally or physically they shouldn't be making decisions for anyone else. Looking at you Jelly Bean.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "The Left has already destroyed American Culture first of all, by allowing hoards of illegal foreign invaders to walk across our borders, accommodate them, tolerate them, raising them above actual American citizens who have been here for generations. Secondly, by not requiring foreigners who come here legally to assimilate into American Culture. Instead the Left has appeased these foreigners and changed American Culture to conform with their needs. All of those RAT Governors who have accommodated these foreigners, created special places, special programs, special education, etc. for them, should be rounded up and thrown in prison.",
                "author": "mass55th"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "sometimes we eat, sometimes we don’t #SNAP",
        "score": 918,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sometimes they stop eating.",
                "author": "AfterGlow"
            },
            {
                "raw_content": "Well she looks illegal so she needs to get the fuck out",
                "author": "JayKay1776"
            },
            {
                "raw_content": "She doesn't look like she's missing any meals",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Anti-ICE lunatic immediately FAFOs after trying to interfere with agents. I can watch these videos all day 😂",
        "score": 850,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for this",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "They shouldn't have to put up with any of this. Imagine if she had done this to a regular beat cop. It would of been an immediate take down, cuff, arrest, and full charges. Instead these guys have to treat them all with kid gloves because they have little to no backup and no one to fight back for them but themselves.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "she’s too top-heavy",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Actually, one more left to go! Not over yet. All gas, no brakes! Polls open at 10am tomorrow!",
        "score": 799,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well hes learned from Trump. Cant win unless you work your ass off. Gotta be out there in the 11th hour doing as many appearances as you can. Everyrhing else is secondary. People have to see you and see your commitment and hard work.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "Trump should do a few rallies in NJ and VA.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "Every day is election day from Day 1 early voting on through November 4th. Get out and vote New Jersey RED.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PLAN A / PLAN B",
        "score": 1016,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They're the same plan, I believe a meme has been made",
                "author": "ancillasedet"
            },
            {
                "raw_content": "# 2001: \"NEVER FORGET!\" # 2025: \"We forgot\"",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Even after 9/11 HRC kept MB control agent Huma Abedin as her senate and secretary of state advisor... Abedin who is closely tied to funders of 9/11. Now traitor Hegseth plans to train MB in Idaho and allow them to build facilities on our air base in Idaho. Our political class is completely compromised and fucked up.",
                "author": "perma-maga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump Takes Out 'Sacred' Trees for New White House Ballroom, Hysterical Media Loses Its Mind. Trees \"sacred\" to the memories of Presidents Warren G. Harding and Franklin D. Roosevelt. But they didn't care when historic statues were destroyed.",
        "score": 1175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck fdr That commie",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "FDR was as close as we got to having an actual dictator. Trees don't always last forever, especially when planted close to buildings. They become a risk to breaking apart from a storm or they just get too big and ruin the balance of the landscaping aesthetic. But the libtards can always try crying harder if they want, and water some trees of their own.",
                "author": "OnlyTrump20"
            },
            {
                "raw_content": "All of a sudden these retards have some emotion attachment to the White House. None gave a shit about Obama building a fucking basketball court in it, or the Clinton's stealing shit on their way out. There is no peak to Dem retardedness.",
                "author": "DJT4547"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PRICKtzer could be charged for “seditious conspiracy”",
        "score": 894,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, wake me when it happens...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Toss his fat ass in the slammer. Action time. No more empty promises",
                "author": "Speedgraphic69"
            },
            {
                "raw_content": "I like Stephen a lot but anything said on Fox News NEVER happens. Either do it or shut up please.",
                "author": "mmmpillsaregood"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I absolutely voted for this.",
        "score": 1668,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Had 10 years to learn english",
                "author": "Seruna_Kanus"
            },
            {
                "raw_content": "Best news ever",
                "author": "hughjasske69"
            },
            {
                "raw_content": "absolutely they need to read English. When the truck height is 11.5' and the bridge height is 10' it makes a REALLY big deal",
                "author": "blueeyephoto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "She's one of us now!",
        "score": 1076,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Because she obviously does not think about what she looks like or sounds like. Gag a maggot",
                "author": "MrJinxy"
            },
            {
                "raw_content": "I've noticed these people say this type of shit once and exactly once. I wonder what made them stop saying that shit? Possibly a visit from the Secret Service?",
                "author": "Testamernt"
            },
            {
                "raw_content": "Good memory. I remember a lot, too. Most of us do. It’s a requirement to get the jokes.",
                "author": "SCP0073"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👠 Kamala Harris: ‘I Am Not Done’ and May Run for President in 2028 🍷",
        "score": 753,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be honest, I almost want this to happen again, because I wouldn't mind a repeat of 2024 where the Republican candidate wins again.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "Yes, please bankrupt the DNC again, I'm sure they will love that.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I hope she does. She's a weak, dumpster fire of a candidate.",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Invader blocks a train in Paris and throws stones while shouting “Allahu Akbar”",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Run him over",
                "author": "jdemarco2014"
            },
            {
                "raw_content": "Why is he still alive? Run him over Aloha Snackbar",
                "author": "Sparks1017"
            },
            {
                "raw_content": "1. End the welfare state, ban hijab, ban signs/business/teaching in foreign language. License and control mosques. That will lead to significant self deportation 2. Review all refugee decisions with a super strict standard of proof, can't prove beyond reasonable doubt that you are personally persecuted. GTFO 3. Set a zero tolerance for noncitizen misbehavior and refusal to assimilate, parking ticket = deport, jihad talk = deport, rmistreating women = deport, spit on the street = deport",
                "author": "SuperDuperBasedMD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "10 percent",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MORE!",
                "author": "TrumpPatriot84"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115436697060819133 Canada was caught, red handed, putting up a fraudulent advertisement on Ronald Reagan’s Speech on Tariffs. The Reagan Foundation said that they, “created an ad campaign using selective audio and video of President Ronald Reagan. The ad misrepresents the Presidential Radio Address,” and “did not seek nor receive permission to use and edit the remarks. The Ronald Reagan Presidential Foundation and Institute is reviewing its legal options in this matter.” The sole purpose of this FRAUD was Canada’s hope that the United States Supreme Court will come to their “rescue” on Tariffs that they have used for years to hurt the United States. Now the United States is able to defend itself against high and overbearing Canadian Tariffs (and those from the rest of the World as well!). Ronald Reagan LOVED Tariffs for purposes of National Security and the Economy, but Canada said he didn’t! Their Advertisement was to be taken down, IMMEDIATELY, but they let it run last night during the World Series, knowing that it was a FRAUD. Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now. Thank you for your attention to this matter!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Canada can’t exist without us. I say let’s show them and force their hand to stop fucking around",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Oldest House member Eleanor Holmes Norton, 88, scammed out of $4,000, has ‘early signs of dementia’ and has a caretaker. She is still running for re-election for non-voting seat representing D.C.",
        "score": 784,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We've seen the Dems more than willing to abuse their older members...",
                "author": "FredRedd"
            },
            {
                "raw_content": "Her vote doesn't count",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "Running candidates with dementia is nothing new for the democrats",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 UPDATE: Gavin Newsom doubles down on opposing anyone from making sure CHEATING doesn't occur in California's November election - tells the DOJ they don't have \"JURISDICTION\" to prevent illegals from voting.",
        "score": 1317,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He might have been arrested by now if we had an actual AG.",
                "author": "MythArcana"
            },
            {
                "raw_content": "I remember the cardboard over the windows. I remember election observers being kicked out. Get fucked Max Shreck",
                "author": "Porkbut"
            },
            {
                "raw_content": "Actually, the feds do have jurisdiction. Non-citizens cannot legally vote, period. The DOJ should send extra election monitors as a precautionary measure",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohran Mamdani Exploits Islamophobia Narrative to Hide His Antisemitic, Communist Agenda",
        "score": 621,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hey, cool it with the anti-anti-semitism, pal.",
                "author": "Hikedelics"
            },
            {
                "raw_content": "\"anti-semitism\" lol",
                "author": "Executarian2"
            },
            {
                "raw_content": "Antisemitic? 38% of Jews support him...",
                "author": "-Evspra"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illegals Attempted ESCAPE from Detention Facility",
        "score": 690,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let them escape…back to this shit holes they came from.",
                "author": "Trump454748"
            },
            {
                "raw_content": "NEED MOAR ALLIGATORS 🏃🏾🏃🏾🏃🏾🐊🐊🐊🐊🐊🐊🐊",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "The escape attempt happened back in June and the Warden let the illegals go on about their head banging against walls. 4 took bed sheets and found a crack in a fence to squeeze out of. The Warden seemed to be in full control as he watched how they were escaping to the point of letting it happen so he could find out. They didn't get far and remained detained.",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TomsHardware - Saying goodbye to Nvidia's retired GeForce GTX 1080 Ti - we benchmark 2017's hottest graphics card against some modern GPUs as it rides into the sunset",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1080Ti, the infinite hardware content generator. Youtubers have also been drawing on it since 2017 and continue to do so. Great card with great longevity, not even that bad 8 years later.",
                "author": "jenny_905"
            },
            {
                "raw_content": "What a legendary GPU, I remember back when I build my PC for the first time I had this GPU as my dream GPU, only was able to got up to GTX 1070 before when I transitioned to the RTX GPUs. It's kind of surreal to see it being slower than even the RTX 3060 nowadays, likely due to games that requires DX12 Ultimate feature set and has Ray Tracing turned on by default, but on old fashioned rasterized focus games, this thing AFAIR is even faster than the RTX 3060 and goes head to head against the likes of RTX 2070 Super.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "I can see the GTX 1080 living on within the very low end regions for a little longer, as it is not a bad card for around £80-90 if all you want is older AAA games, esports titles or indie games, though with cards like the 2060 being in the £100 region, that may become the better choice due to DLSS, DX12U & Ray Tracing for modern AAAs",
                "author": "Vaxtez"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cybenetics Takes Action Against Gamdias for Fake Badges - Hardware Busters",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">GAMDIAS has publicly promoted the HELIOS P2-1300G, P2-1000G, and P2-850G/P-2 850W power supply units as Cybenetics Gold certified across multiple retail channels and media outlets. These claims appear in product listings (e.g., Godukkan, Microless, Allway Groups, Anfio) and launch articles (e.g., FunkyKit, The Gaming Stuff), as well as on the official GAMDIAS Brazil website. However, neither model is listed in the official Cybenetics PSU certification database, and the global GAMDIAS product pages omit any reference to Cybenetics certification.",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "They thought they could just use it like those UL stickers? lol",
                "author": "got-trunks"
            },
            {
                "raw_content": "This is like when I used to make college posters in photoshop and stick every game studio logo I could find to make it look legit lol",
                "author": "LinusDuckTips"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OCCT version 15 adds coil whine detection that doesn't require a microphone, plays a coil whine melody instead — popular stress tester gets genius new feature to silence your PC",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Detect coil whine by forcing coil whine in a specific tune.... how the hell do you even come up with such a crazy yet brilliant idea?",
                "author": "SignalButterscotch73"
            },
            {
                "raw_content": "i guess we're playing GPUs now next for Britain's Got Talent?",
                "author": "windozeFanboi"
            },
            {
                "raw_content": "That's just... music to my ears.",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Why Doesn't the PC Just Send the Address Directly to memory?",
        "score": 46,
        "text_content": "I'm currently an AS Level student studying Computer Science, and this part of the FE (Fetch-Execute) cycle is bugging me. As said in my textbook, the PC (Program Counter) stores the address of the next instruction to be fetched. This address is sent to the MAR (Memory Address Register) which stores the address so it can be sent to main memory. Here's my doubt: why not just have the PC send this address directly to the memory? Why have the MAR there at all? It seems like a simpler set up since we can remove the need for the MAR to be there. You'd just need to connect the address bus from the PC to memory, instead of from the MAR to memory. Expanding on the same reasoning, why bother having the CIR (Current Instruction Register) at all? If its only purpose is to store the instruction fetched from memory, then it doesn't have to exist because the MDR already stores that. the CU (Control Unit) just needs to decode the instruction in the MDR instead of the CIR. At the same time, I know I must be misunderstanding something. So, what is it?",
        "comments": [
            {
                "raw_content": "You're looking at some simplified, perhaps purely pedagogical, 2 or 5 stage MIPS. It's impossible to give a reason why because we don't know the full context of what your course is teaching you. There's not some singular architecture all CPUs use. In most modern machines instructions are read from an instruction cache of much greater complexity than a single intermediate instruction register.",
                "author": "not_a_novel_account"
            },
            {
                "raw_content": "> You'd just need to connect the address bus from the PC to memory, instead of from the MAR to memory. I think you're forgetting the CPU also needs to read data from memory, it's not all instructions! The MAR acts as the interface between the memory system and the PC for instruction reads *and* address registers for data reads.",
                "author": "JaggedMetalOs"
            },
            {
                "raw_content": "Your \"directly wired to things\" mentality do not work in modern design due to frequency scaling. Basically you are still thinking in terms of sequential circuits when the rest of the world moved on with synchronous logic. There is a whole concept of pipelining that divides down complex operations into smaller step pretty much like automobile assembly line. Each of these smaller steps composing of sequential logic would have fewer layers of propagation delays, thus can be run at much faster clock speed. The results are latched into registers by a clock edge. Thinking in terms of that, the \"registers\" that you are complaining about would be one of those. Also there is no longer a simple things like you concept of memory anymore. There is caches, memory controller and external memory. [Pipelining](https://www.intel.com/content/www/us/en/docs/programmable/683152/21-4/pipelining-38680.html) https://www.allaboutcircuits.com/technical-articles/why-how-pipelining-in-fpga/",
                "author": "Wait_for_BM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RX 9070 XT vs RTX 5070 vs RX 9070 - DLSS 4 vs FSR 4 Performance Compared",
        "score": 51,
        "text_content": "TL;DR: Across 23 games at native 1440p ultra the RX 9070 XT is 24% faster than the RTX 5070 and 10% faster than the RX 9070. Enabling quality up-scaling results in the RX 9070 XT being 22% faster than the RTX 5070 and 8% faster than the RX 9070.",
        "comments": [
            {
                "raw_content": "TLDW: 23 Game Average, 1440P Ultra Settings: **RX 9070 XT:** Native TAA: 88 FPS, 1% 68 FPS FSR 4 Quality: 115 FPS, 1% 87 FPS FSR 4 Balanced: 123 FPS, 1% 93 FPS FSR 4 Performance: 132 FPS, 1% 100 FPS **RX 9070:** Native TAA: 80 FPS, 1% 62 FPS FSR 4 Quality: 106 FPS, 1% 82 FPS FSR 4 Balanced: 115 FPS, 1% 87 FPS FSR 4 Performance: 125 FPS, 1% 93 FPS **RTX 5070:** Native TAA: 71 FPS, 1% 56 FPS DLSS 4 Quality: 94 FPS, 1% 73 FPS DLSS 4 Balanced: 102 FPS, 1% 79 FPS DLSS 4 Performance: 111 FPS, 1% 84 FPS",
                "author": "Antonis_32"
            },
            {
                "raw_content": "He provides good data but I find he presents it in a confusing way. Maybe it’s just me, but I find the way he jumps around between 1v1 comparisons of the graphs he’s presenting on screen makes the comparisons less effective. Also, why doesn’t he do 4K?",
                "author": "heyyoudvd2"
            },
            {
                "raw_content": "Isn’t a 5070 the incorrect comparator here?",
                "author": "deadfishlog"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[GN] Our Most In-Depth Case Test Yet: HAVN BF 360 Flow Case Review, Fan Benchmarks, & Smoke Test",
        "score": 3,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The game's a black hole. I just realized I played for six hours.",
        "score": 116,
        "text_content": "And now my spaceman is taking a break. It's funny, because it rarely feels like you've accomplished something here.😂 it's fun to explore though. And when you start unlocking more and more things at your disposal, you'll want to keep on playing even more.",
        "comments": [
            {
                "raw_content": "Is this No Man's Sky?",
                "author": "ronartest420"
            },
            {
                "raw_content": "lol no man’s sky. You should put it somewhere in the post. Love the game. Had it since the day one trash it was on PC. It’s truly a masterpiece now and being able to play it in handheld in its current form is a blessing. I’m on a break from it because if I pick it up then I won’t play any of my new games. Dying to play the corvette updates",
                "author": "ShiggyMintmobile"
            },
            {
                "raw_content": "What game?",
                "author": "aww_jeez_my_man"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I swear when I bought my DSi I thought it was big",
        "score": 58,
        "text_content": "I used to be able to pocket this thing. And I miss Street Pass on the 3DS I kept in cargo shorts just to see who I’d bump into. I know the Switch 2 isn’t as portable, but damn that was a fun feature and it didn’t NEED 3D puzzles to work. Would love to get that back so we could share Twitch channels or Discord links, etc.",
        "comments": [
            {
                "raw_content": "After Steam Deck everything is small.",
                "author": "GerbiJosh"
            },
            {
                "raw_content": "What kind of carry case is this?",
                "author": "Emperor_Zarkov"
            },
            {
                "raw_content": "I just compared my Switch 2 to my Gameboy pocket. Look how far we’ve come 🙃",
                "author": "fuckpedes"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Outlaws graphics are honestly impressive (demo)",
        "score": 88,
        "text_content": "I didn't really get the big deal about ray tracing but the realistic lighting is honestly very immersive. And the frame Rate is rock solid in this. Hyped to buy the full game. Gonna wait for Black Friday in case it goes up for a lower sale",
        "comments": [
            {
                "raw_content": "I didn’t like the gameplay but the port is indeed impressive. And I hope AC shadows delivers similar performance since I’m more interested into that one.",
                "author": "Sandy12315"
            },
            {
                "raw_content": "I think the ray tracing is why you have the realistic lighting",
                "author": "jjmawaken"
            },
            {
                "raw_content": "Some of the effects on some of the levels are pretty great for example riding your speeder through water or in the bases the smoke effects. It took two generations but we finally see some of the effects the team on that infamous watchdogs trailer taking place.",
                "author": "actstunt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So where is the Halo Switch 2 version, Phil? Why say things you don't mean?",
        "score": 524,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am 90 percent positive they will port Campaign Evolved following launch on Xbox/PC/PS5 - similar to Indy next year.",
                "author": "HyrulePolitik6492"
            },
            {
                "raw_content": "I just hope we get MCC and not this",
                "author": "EpicQuackering437"
            },
            {
                "raw_content": "Nate the hate did say the Halo MCC was coming, as well as Microsoft flight simulator. Given his track record, I’m fairly comfortable just waiting for an announcement at this point",
                "author": "ProjectPorygon"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s beautiful!",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/5svvw0nksaxf1.jpeg?width=4032&format=pjpg&auto=webp&s=c5b4c00571822de95a74d5641497f6b60aa65dea Nice, I just did the emerald green essence version, very happy with how it came out.",
                "author": "Glitch_Ghoul"
            },
            {
                "raw_content": "So cool, I wish I could make mine translucent purple and change the colors of the sticks to match",
                "author": "Cozy-Panda777"
            },
            {
                "raw_content": "Damn, that looks clean.",
                "author": "linkling1039"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Another free update for No Man's Sky. The game the keeps on giving.",
        "score": 173,
        "text_content": "I'll probably take it easy this weekend and just put some more time into this.",
        "comments": [
            {
                "raw_content": "Probs 1 of the best turnarounds in games",
                "author": "zaadiqoJoseph"
            },
            {
                "raw_content": "Oh this ship is so cute",
                "author": "solarpooldreamer"
            },
            {
                "raw_content": "Does this look noticably better than on switch 1?",
                "author": "throwraW2"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Which game should I get",
        "score": 144,
        "text_content": "Looking for something new to play",
        "comments": [
            {
                "raw_content": "They are vastly different games. Just choose what suits your gamestyle more. Edit: Grammar",
                "author": "Babinios"
            },
            {
                "raw_content": "Hades 2 is fun as fuck and cheaper",
                "author": "MIERDAPORQUE"
            },
            {
                "raw_content": "Hades 2 it is thanks for the advice 👍",
                "author": "Real_human27"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fortnite X South Park is coming very soon!",
        "score": 206,
        "text_content": "https://xcancel.com/SamLeakss/status/1982196155606786464",
        "comments": [
            {
                "raw_content": "I wonder how this one will work since the characters are so small. They can't put them all in Mech Suits.",
                "author": "Nathanyal"
            },
            {
                "raw_content": "Let me play as Towelie and I’m in",
                "author": "NewDamage31"
            },
            {
                "raw_content": "How the hell are they even gonna adapt the main characters for this? Considering their proportions and everything. Unless they use their aged up versions from Post Covid, which admittedly could work but wouldn't be the same, or just use the regular adults like Mr. Garrison or Stan's dad. Sounds like trouble unless they put Cartman in a fucking mech suit or some shit like that.",
                "author": "Heisenburgo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Early Wreckreation Gameplay",
        "score": 113,
        "text_content": "Some individuals have begun to receive their copies of Wreckreation a few days before the official release: https://youtu.be/taEd4HPhN_w?si=LwxQk0jBkjN0FGGN",
        "comments": [
            {
                "raw_content": "Is Burnout back?",
                "author": "MisunderstoodBadger1"
            },
            {
                "raw_content": "i will be buying this next week. excited to play because i miss Burnout dearly, im not expecting much but I'm cautiously optimistic. the gameplay looks decent at least",
                "author": "Neggy5"
            },
            {
                "raw_content": "Oh wow, it even has Burning Routes, this really is Burnout Paradise Trackmania lol",
                "author": "cooldrew"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Microsoft confirms program for ad-supported free access to Xbox Cloud Gaming",
        "score": 333,
        "text_content": "https://www.nytimes.com/2025/10/24/arts/halo-playstation-microsoft-xbox.html?partner=slack&smid=sl-share >A Microsoft official confirmed that the company was also conducting internal tests for free ad-supported cloud access to some games through a program separate from Game Pass. Earlier scoop from Tom Warren: https://www.reddit.com/r/GamingLeaksAndRumours/s/D3pQoXravG",
        "comments": [
            {
                "raw_content": "Only a matter of time until ads creep into the lowest paid tier, those are the most profitable tiers for streamers so mark my words.",
                "author": "Superb_Pear3016"
            },
            {
                "raw_content": "1. Increase price, BAD, 2. Add ADS that is BAD",
                "author": "SHAQBIR"
            },
            {
                "raw_content": "I wonder how this will work. Will the ads be front-loaded at the start? Or would we have pop-ups? Picture-in-picture (like you get with some spots)?",
                "author": "Mavericks7"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "I built my first AMD pc after two decades of using Intel.",
        "score": 109,
        "text_content": "I bought first AMD product back in 2013, it was a HD7750 OC (New seal) and I was playing Metro 2033 that time. It crashed a lot (BSOD), and I had to underclock the GPU to make it more stable, but in the end still crash and had to switch to an NVIDIA GT630 while promising I’ll never go AMD again (not only I couldn’t overclock the GPU but also had to underclock it) Now in 2025, Intel performance fell badly, (Oct 5, 2025) I switched back to AMD again. Man it looks like I made the right choice, it’s soooooo much better than Intel for gaming purpose, I also do video editting and heavy multitasking but it’s still good. Can’t wait for AMD GPU to catch up with Nvidia GPU so I can go full AMD (unlikely to happen lol but at least it’s getting closer and make sense enough to buy AMD gpu) Here is my new build specs: (Build date Oct 5, 2025) - Main: X870E Aorus Pro Ice - CPU: Ryzen 7 9800X3D (PBO -30, +200MHz) - Memory: 96G (2x48G) Corsair Dominator Titanium White 6600 CL32 (Running @ 6400 CL30) - GPU: Colorful iGame RTX 5070Ti Ultra White - PSU: Super Flower Leadex VII Platinum 1000W - Storage: WD Black SN850X 1TB, WD Black 4TB HDD, Samsung EVO 850 1TB - Cooler: Thermalright Grand Vision 360 ARGB White - Case: NZXT H9 Flow White - Case Fans: 7x Phanteks M25 Gen 2 White (6x reversed) - Vertical GPU: Cooler Master V3 Pcie 4.0 It was quite a journey to build this PC, the thing is I didn’t buy those parts brand new from the same store :D - I bought each part second-hand from different people in different places, I picked parts based on the condition (must comes with box, used looks clean and new,..) - After assembling everything, I run many tests with RAM (TM5 + Anta777,…), CPU (Cinebench,…), GPU (FFXV Bench,…), paying attention to thermal during idle or under stress,… - In the end, the computer is fully stable, gaming for a month with no problem. P/s: I put the Frieren on the GPU to hide the 600W power cable",
        "comments": [
            {
                "raw_content": "Himmel the Hero would be proud",
                "author": "Prizrak95"
            },
            {
                "raw_content": "where to get that frieren",
                "author": "io-x"
            },
            {
                "raw_content": "Upvoting for Frieren",
                "author": "Simbiat19"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "My modest PC 😂🤭",
        "score": 97,
        "text_content": "Full AMD 🗿 It's not the best but it still holds up like a wonder 🤭 Ryzen 5 3600x Aorus B550m Elite rev 1.3 Corsair Vengance DDR4 32gb 3200mhz PowerColor Hellhound RX 6600 8gb AeroCool 80 bronze 750w Semi modular Samsung Evo Nvme2 1tb Samsung Evo SSD 528gb WD HDD 1tb Seagate HDD 1tb (The WiFi antenna gets in the way of aesthetics, yes 🤣🤷🏻‍♂️) I play all current AAA games without problems (obviously I use FSR4 with a simple driver modification, and not all of them at maximum [Normally optimized in Medium-High-Ultra; depending on the game] at 60fps or more in 1080p) 🤌🏻🍷🗿 You can enjoy current games without having to spend a fortune; By playing the settings well and optimizing properly, everything is possible 🤭💪🏼🗿",
        "comments": [
            {
                "raw_content": "It's a Big Red Beast for sure. Have you looked at getting an X3D CPU before they all go away? Might still be able to get extra life out of the AM4 mobo with one more upgrade.",
                "author": "defaults-suck"
            },
            {
                "raw_content": "https://i.redd.it/80e6ngdlxbxf1.gif",
                "author": "122_Hours_Of_Fear"
            },
            {
                "raw_content": "That just seems like an unnecessary thing in the desk, like why so big, the case itself steals half of the desk space",
                "author": "Maxxie_DL"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Ryzen 7 5800x 6700xt PC Build",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rate my first PC build.",
                "author": "Electrical_Way8978"
            },
            {
                "raw_content": "I have the same CPU and it plays BF6 (on ultra) and only uses 50% of the CPU to do it. It's still an amazing CPU.",
                "author": "unlmtdLoL"
            },
            {
                "raw_content": "I built that same combo until my son needed a computer. Gave him the 6700XT and got myself a 3080Ti. Solid rig you got there.",
                "author": "Even-Smell7867"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Threadripper 2950x still lives!",
        "score": 11,
        "text_content": "https://preview.redd.it/6jrdwktdlbxf1.jpg?width=4000&format=pjpg&auto=webp&s=c1872a5ca52fcab7abd03649fff314bf660a4072",
        "comments": [
            {
                "raw_content": "Still have a 1950x rolling along, though now demoted to a homebuilt NAS rather than my workstation. Honestly the fact that could be replaced with a desktop part and be \"better\" in pretty much every way feels pretty good now.",
                "author": "Jonny_H"
            },
            {
                "raw_content": "Hm? I got my 2950x still rocking! (I mean its not in use but works last i tested)",
                "author": "KarateMan749"
            },
            {
                "raw_content": "My 1950x has just been relegated to my son’s PC after 8 years. He bought a 5060ti and a case and nothing else. It seemed a waste to have those sitting around and I needed and I update. I went from 1950x with Radeon vega 63 to 9800x3d and 9070xt",
                "author": "myBr41nhurts"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MaxSun B850 Terminator motherboard released: \"GPU will be (on the) back\"",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love it at first sight, but can't help to recall XKCD's comic on standards. I hope there'll bound to be some industry soft-standardization on this format/form factor. Backside-populated VRMs and GDDR chips would be rather toasty if there's no airflow in such a restrictive design, but it can be a calculated compromise (so no RTX Pro 6000 or $10,000 GPUs)",
                "author": "nguyenm"
            },
            {
                "raw_content": "Great. So why did it take 30 years for someone to notice that two parallel planes take up less space than two perpendicular planes? Was there some kind of ancient curse that prevented it?",
                "author": "Mickenfox"
            },
            {
                "raw_content": "I get why youd make this, the t1, a4, terra etc. all good cases. But I think this restricts you more than using a riser cable",
                "author": "hardlyreadit"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "25 October 2025 - Weekly /r/REBubble Discussion",
        "score": 4,
        "text_content": "What's the word on the street? Share your questions, comments, and concerns below.",
        "comments": [
            {
                "raw_content": "I have a feeling sales will still be stagnant despite rate drops. People keep taking the news of rate drops as a clear tell that houses will go flying off the market, but those prices are still going to have to come down regardless",
                "author": "allifeelisremorse"
            },
            {
                "raw_content": "It's a new paradigm, and everybody who doesn't buy, now, will be priced out forever. Anybody who does buy will be rewarded with a lifetime of riches, as their property will continue its 30% yearly price increase. Renters, and anybody born in a future generation, will not be able to afford a $15,000,000 starter hoom in 15 years. They will live in tent cities, and Hondas. This asset bubble is different than all of the others - it will never slow down, or pop. The gains are permanent.",
                "author": "rentvent"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zoom towns to gloom towns: pandemic hot spots are now full of sellers",
        "score": 210,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“From 2020 to 2023, 250,000 American workers moved to metros with a high share of homes in mild-weather climates, reports the Harvard Joint Center for Housing Studies. That is two and a half times as many as before 2020…. Austin was the fastest-growing large metro area from 2020 to 2022, with 120,000 new people moving there. This equated to a population increase of 5.3 percent, according to the US Census” So did like half of all people who moved during COVID move to Austin?",
                "author": "ouluuuuu"
            },
            {
                "raw_content": "I think in addition to the RTO the issue is the tightening labor market itself. So many opening are being eliminated and the worker doesn’t have the ability to jump and demand remote work.",
                "author": "dandykaufman2"
            },
            {
                "raw_content": "I wonder what is accounting for the exodus. Is it the return to work orders? Is it that people realized that those areas weren't all they were cracked up to be? Is it a sign the economy is about to collapse? Is it a little bit of all three?",
                "author": "Minute-Individual-74"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Other Subprime Auto lender PrimaLend goes under",
        "score": 141,
        "text_content": "A crisis in the U.S. auto loan market was signaled on October 22, 2025, when PrimaLend Capital Partners, a significant subprime auto lender with headquarters in Plano, Texas, filed for Chapter 11 bankruptcy protection. PrimaLend's demise highlights the mounting stress among subprime borrowers—those with bad credit—who depend on financing to purchase cars through \"buy-here-pay-here\" (BHPH) dealerships. https://www.msn.com/en-us/money/realestate/america-s-car-debt-bomb-goes-off-major-lender-folds-under-500-million-load/ss-AA1P6SYo https://www.wsj.com/articles/subprime-auto-lender-primalend-files-for-bankruptcy-671c71f9",
        "comments": [
            {
                "raw_content": "Headline should read, predatory lenders filling for bankruptcy.",
                "author": "andersab"
            },
            {
                "raw_content": "Classic. Somehow auto loans are a problem but housing isn’t? All them Fannie may loans must be good EDIT: the whole point behind my comment, and I should have clarified, was that if people can’t even pay an auto loan on time how do you think they pay a $1200-$2400 mortgage. And if they don’t have a house yet how they going to buy a house if they can’t even make a car payment. I’m just saying news sitting here talking about rates or that there’s pent up demand, people can’t even pay an auto loan.",
                "author": "Buttercup501"
            },
            {
                "raw_content": "Subprime borrowers + Loose underwriting + Record car prices + Sky-high interest rates = no surprises. On top of that, used car and truck prices have cratered since peaking in 2021-22 so now you have a bunch of people severely upside down in their loans. https://fred.stlouisfed.org/series/CUSR0000SETA02",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Performance Remains Strong as FHA Foreclosures Emerge",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oct. 24, 2025 – ICE Mortgage Technology, a neutral provider of a robust end-to-end mortgage platform and part of Intercontinental Exchange, Inc. (NYSE: ICE), and one of the leading providers of mortgage data, today released the September 2025 ICE First Look at mortgage delinquency, foreclosure and prepayment trends. The data shows that overall mortgage performance remains historically strong, with both delinquencies and foreclosure activity remaining below long-term averages. While some shifts are emerging among government-backed loan segments, these trends largely represent a normalization of market dynamics rather than broad-based weakness. “The mortgage market remains remarkably resilient, with mortgage performance continuing to hold up well,” said Andy Walden, Head of Mortgage and Housing Market Research at ICE. “Delinquency rates improved in September, and even as we see increases in activity among FHA loans, we’re largely returning to more typical levels following several years of artificially low foreclosure volumes.” **Key takeaways from this month’s findings include:** * Delinquencies remain well below pre-pandemic norms: The national delinquency rate fell by 2 basis points (bps) in September to 3.42%, down 6 bps from the same time last year and 58 bps below its September 2019 pre-pandemic level. * Strength across delinquency bands in September: Both early-stage (30-day) and late-stage (90+ day) delinquencies improved month-over-month, as the vast majority of borrowers remain current on their mortgage payments. * Non-current rates improved for most investors: The non-current rate (delinquencies plus active foreclosures) declined year-over-year among GSE (-3 bps), VA (-4 bps) and portfolio-held loans (-17 bps). FHA loans were the notable exception, rising by 44 bps from last year’s levels. * Foreclosure activity is returning to normal ranges: There were 103,000 foreclosure starts in Q3 2025, a 23% increase from the same period last year, but 18% below Q3 2019’s pre-pandemic levels. * Improving efficiency in resolution: The number of loans in active foreclosure rose modestly year-over-year (18%), yet overall foreclosure volume remains historically low, with Q3 foreclosure sales (21,000) at roughly half of 2019 levels. FHA loans account for the majority of that rise, making up 38% of active foreclosures, roughly half of the annual rise in foreclosure starts and 80% of the rise in active foreclosures. The resumption of VA foreclosure activity following last year’s moratorium is largely responsible for the remainder. * Prepayments are edging higher: Prepayments rose by 8 bps in September to a 0.74% single month mortality (SMM) rate, a 15% increase from the prior year, as interest rates began to ease in August.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Sam Altman: \"movies are going to become video games and video games are going to become something unimaginably better\"",
        "score": 272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And the Nintendo Switch will become the Steam Deck and the Steam Deck will become something unimaginably better",
                "author": "throwaway_p90x"
            },
            {
                "raw_content": "Game Companies when they save cost by cutting labor: \"Hell yeah\" Game Companies when AI firms use every Game in Existence to train Game GPT: Wait a minute https://i.redd.it/e9nb043lldxf1.gif",
                "author": "ConstructionFit8822"
            },
            {
                "raw_content": "i don't want to play schindler's list the video game tho",
                "author": "AdFeeling842"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Circular 💱",
        "score": 703,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GDP goes brr",
                "author": "Generic_User88"
            },
            {
                "raw_content": "I wonder what the real cash flow out of jensen is? Can't be equal. NVIDIA is making BANK on these deals.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Circularity",
                "author": "hangfromthisone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Two year throwback to a company leading the industry without relying on hype or propoganda.",
        "score": 297,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The good old days! This is was all pre-programmed though right?",
                "author": "Away_Veterinarian579"
            },
            {
                "raw_content": "This is literally a propaganda hype video. Those words are meaningless distinguishers when in all cases its just promotional footage.",
                "author": "adeadbeathorse"
            },
            {
                "raw_content": "Has Boston Dynamics ever released anything that isn't a heavily produced promo video? I'm yet to see any of their humanoids in the wild. Only marketing videos produced by teams.",
                "author": "Arcosim"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Should gaming studios cooked?",
        "score": 261,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The end of 2025 is in two months, I have not seen any evidence that makes this projection remotely possible",
                "author": "Altruistic-Mix-7277"
            },
            {
                "raw_content": "Simple games maybe but not AAA games",
                "author": "JCas127"
            },
            {
                "raw_content": "People who know what they're doing will do more. People who dont know anything will do a little.",
                "author": "LairdPeon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Insane Gemini 3 hype",
        "score": 117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think because there is so little games compared to other code, because most games have a shit ton of code, and let's be honest, a lot of code for games makes no fucking sense, it is quite difficult to vibe code games, so unless there is some agent that can play and test the game, I don't think we are getting decent size vibe coded games anytime soon, not in 2025 at least.",
                "author": "Ormusn2o"
            },
            {
                "raw_content": "So, Logan is the Chief Hype Executive at Google?",
                "author": "arko_lekda"
            },
            {
                "raw_content": "I’ll admit comments like this irk me a bit Buuut I think this just means expanding the creator base Think how hard it was to have your own show on radio or tv before, then something like podcasts or YT shows up - suddenly the creator base expands massively Sure, most of it is crap, but net benefit for everyone. There’s still AAA shows out there, but you get high-quality indies too",
                "author": "Dyurno"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI employee talks about how the company actually makes decisions",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow didnt know Lebron was so freaky",
                "author": "No-Obligation-6997"
            },
            {
                "raw_content": "Not that I know who it is but that \"professional athlete\" detail seems a little too identifying, I mean how many professional athletes can there be at an AI company lol",
                "author": "redditonc3again"
            },
            {
                "raw_content": "Lmao what",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 pro helps in solving 42 year old open problem guided by Prof. Ernest Ryu of UCLA (final thread)",
        "score": 39,
        "text_content": "Final tweet thread on the GPT-5 pro use to solve open problem by Prof. Ernest Ryu from UCLA. Some interesting excerpts (the whole thread is highly interesting, another preprint by all human authors on this will also be released soon) > NAG was introduced by Nesterov in 1983 as an accelerated improvement upon plain gradient descent, yet its point convergence remained unresolved until today. Nesterov ODE was studied as a simplified proxy, aimed at gaining insight into the behavior of its discrete counterpart. > Indeed, translating the continuous-time proof into the discrete-time setup turned out to be relatively straightforward. With one piece of feedback, ChatGPT was able to work out the proof. https://chatgpt.com/share/68fc3977-b8c8-8009-b673-48c5661fcb1b > Conclusion: > Starting from the key idea of the first tweet, we extended the convergence result to several related settings and resolved the main 42-year-old open problem, with ChatGPT doing most of the heavy lifting along the way. > Overall, this entire journey took just a week, less than 30 hours of my time. ChatGPT’s assistance provided a significant speedup, and without it, I would most likely have given up after three days of slow progress. (As I did in the past.) > Again, ChatGPT is now at the level of solving some math research questions, but you do need an expert guiding it. > I strongly encourage fellow mathematicians to try incorporating AI assistance into their workflow. It takes some getting used to, but it can be worth it.",
        "comments": [
            {
                "raw_content": "some interesting comments in that tweet. like the legwork that ChatGPT can do effortlessly, takes so much of the weight off, letting the researcher expend energy more meaningfully. like the tweeter said, he urges mathematicians everywhere to start incorporating it (or any preferred LLM) to their workflow. I mean its not perfect yet, but its already useful as a brainstorming partner. like who has time to hear you go on about narrow complex topics all while dishing out expert level bad ideas. the llm lacks critical thought and direction, like a horse pulling a carriage",
                "author": "Jabulon"
            },
            {
                "raw_content": "Some good updates here if you're interested - [https://mathstodon.xyz/@tao](https://mathstodon.xyz/@tao) Terence Tao is developing a pretty good skill set on using AI with Math and while I think he's a bit of a fanboy, he's not as bad as others. Part of the problem is a lot of money goes through him in terms of distributing grants, and a lot of that money is coming from people interested in AI and Math.",
                "author": "kaggleqrdl"
            },
            {
                "raw_content": "So this means GPT5 doesn't hallucinate?",
                "author": "Illustrious-Film4018"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5.1 incoming",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "can it code like claude though",
                "author": "Jabulon"
            },
            {
                "raw_content": "Not necessarily, could’ve been a hallucination by codex lol",
                "author": "Howdareme9"
            },
            {
                "raw_content": "I feel gpt-5-high has become dumber recently, at least for agentic coding. I have to rely on gpt 5 pro for hard problems.",
                "author": "crowdl"
            }
        ],
        "subreddit": "singularity"
    }
]