[
    {
        "post_name": "🚨 BREAKING: The Department of Government Efficiency (DOGE) just NUKED “fake news” reports that they’d been dissolved, announcing ANOTHER $335 MILLION in contracts had just been canceled Sorry Democrats — your kickbacks are still being gutted 🤣🔥 Image",
        "score": 880,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There was a continuous wave of individuals doom posting stories proclaiming the demise of DOGE today. It’s almost as if they relish and celebrate the opportunity to spread bad news. 🤔",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "NUKE THE NGO'S!!!!!!!!!!!!!",
                "author": "forefatherstanding"
            },
            {
                "raw_content": "I told my son that last night. The media lies all the time.",
                "author": "projectarcturus1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don’t doubt the enemy when they tell you their intentions.",
        "score": 460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Surprise, surprise…Gallegos is owned by the cartels.",
                "author": "C00gsHouse281"
            },
            {
                "raw_content": "Do you tbink they'll worry about the optics? Pr worry about what the Republicans \"will do when they regain power\"? No.",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "sticky with 1 updoot 👏🏻",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Roger Stone: It's official, Trump loyalist & successful businessman (founder of Sticker Mule) Anthony @constantino is running for Congress. He's running for New York's 21st Congressional District which is currently represented by Republican Elise Stefanik, who is running for Governor of NY in 2026.",
        "score": 402,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sticker Mule is awesome, and now I find out he’s a Patriot. 😎",
                "author": "TexasRepublic"
            },
            {
                "raw_content": "[Anthony Constantino announcement speech. Speech starts at 10:47](https://x.com/constantino/status/1993092317553868920)",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "Is he in favor of putting AIPAC or NORPAC under FARA? This needs to be the standing question of every single person running for office. If you aren't willing to do that bare minimum you won't have my vote. If I see you taking free trips to Israel to kiss the wall you aren't getting my vote.",
                "author": "Senaleb"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LEGAL EXPERT: \"I’m about ready to do a video reminding President Trump that he does not need to follow ANY unlawful orders issued by judges.\"",
        "score": 1008,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why isn't this stickied?! 📌",
                "author": "mateus"
            },
            {
                "raw_content": "So all judges operate perfectly and lawfully?",
                "author": "Tikk"
            },
            {
                "raw_content": "When? In another 2 weeks?",
                "author": "559throw"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING — IT’S OFFICIAL: President Trump has just signed an executive order directing Secretary Rubio to classify the Muslim Brotherhood as a FOREIGN TERRORIST ORGANIZATION FINALLY! Trump’s order also prohibits financial transactions with them, so much of their funding will likely dry up.",
        "score": 1705,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yes, They came here for the freebies. Now it is time for a free stay at # GUANTANAMO for all of them.",
                "author": "Ballots0nRubysUSB"
            },
            {
                "raw_content": "Hopefully this will be more successful than when we declared Antifa a terrorist organization…",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "I can’t wait to see how much money USAID has been funnelling to them through third parties.",
                "author": "bluedevilga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Trump DOJ has just filed with the Supreme Court to STRIKE DOWN state laws banning the public carrying of firearms. California, New York, Hawaii, Maryland, New Jersey, and other states have laws which would be impacted by this.",
        "score": 1573,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Now do the NFA. # I want my MAC10, and I want it NOW.",
                "author": "Youngman1234"
            },
            {
                "raw_content": "This is great, cant wait to see how the shills complain about this one.",
                "author": "yaboi619"
            },
            {
                "raw_content": "# ANY Law restricting the 2A is unconstitutional",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 Patrick Tyson of North Carolina has been charged with arson after 𝙎𝙀𝙏𝙏𝙄𝙉𝙂 𝘼 𝙒𝙊𝙈𝘼𝙉 𝙊𝙉 𝙁𝙄𝙍𝙀 after she refused to get him a beer. He has been arrested 𝟓 previous times...",
        "score": 884,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What the Hell is going on in North Carolina ?",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "What's with black guys setting women on fire?",
                "author": "Kavantar"
            },
            {
                "raw_content": "\"And what is the bond for my client, your honor?\" \"Well, how much cash he got in his pocket right now?\" All these criminal judges need to be jailed.",
                "author": "DJT4MoreYears"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Germany can only deport 625 illegal migrants a year? ICE does that in a single building.",
        "score": 839,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Germany used to be much more efficient at moving people.",
                "author": "DudeNoOne"
            },
            {
                "raw_content": "Unless you consider a crusade, europe is totally lost. It's not possible to put the genie back in the bottle.",
                "author": "uxername27"
            },
            {
                "raw_content": "Something something 6 million....",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yes",
        "score": 819,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ah yes when a dollar bought a house and you didn’t have to compete with Juan who lives with his baby momma that gets 70k in Bennie’s.",
                "author": "Viewer01"
            },
            {
                "raw_content": "1969 and 1979 as well ya whippersnappers",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Think I was 9-10 when I started a spring-summer mowing business in my neighborhood. This was before illegal spics had totally taken over. Every neighborhood had those types of kids. Mow 3-5 yards a week for $10 a piece and you felt rich. Same with paper routes.",
                "author": "Bldg_2019"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jesse Waters says that he talked with Two CIA agents who CONFIRMED that Democrats' calling for Millitary personnel to disobey orders is part of an Operation to implant MASSIVE Distrust.",
        "score": 676,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's the Podesta Plan. Alex Jones has been talking about it for over a year now.",
                "author": "flyover_deplorable"
            },
            {
                "raw_content": "Guys, before this takes off.. Please remember all of the times that these people (Fox News) have stabbed us in the back. He also only says \"Two CIA officers\", so two unnamed sources. Again. I am not saying its bullshit, what I am saying is exercise some caution. This is exactly what we want to hear, when we want to hear it.",
                "author": "AmericaAlwaysFirst"
            },
            {
                "raw_content": "Arrest now, investigate further, hang. The laws are on the books",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AG Bondi: “We’ll be taking all available legal action, including an immediate APPEAL, to hold Letitia James and James Comey ACCOUNTABLE for their unlawful conduct.”",
        "score": 621,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Useless figurehead. 🤦",
                "author": "drmrboy"
            },
            {
                "raw_content": "She's putting on a show for all the stupid people.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Arresting the judge is a legal action. Just putting that out there.",
                "author": "BlackJack1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Number of H-1B Visas Approved for Indian Companies Plunges",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stop all immigration and deport all the illegals. We need time to heal and for infrastructure to catch up to the current population.",
                "author": "KekistanPM"
            },
            {
                "raw_content": "No need for poopjeets in America. They can stay in their literal shithole with cows and shit rivers Also, I was just looking at a list of doctors/providers at a certain location and one of the Hindu doctors was literally named “Pooja” 😂",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "Make this number zero. None. Do not want.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "THIS is why the Republican Party must nuke the 60-vote filibuster and ram through massive election integrity laws. 84% of Americans support requiring VOTER ID, and a similar 83% favor proof of citizenship.",
        "score": 1517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YES DO IT",
                "author": "spinometer2"
            },
            {
                "raw_content": "Yes, pass all of the MAGA legislation, then put it back before the next general election just to be safe. We have to beat democrats at their own game.",
                "author": "MythArcana"
            },
            {
                "raw_content": "THE ALTERNATIVE IS TO ELECT 60 REPUBLICANS. (MAKE IT 67 ! GIVE US A FEW SPARES )",
                "author": "NickAtNight"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 IT'S OFFICIAL: Rep. Tim Burchett is a national treasure!",
        "score": 624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump is the most effective president we've ever had. Doomers are too low IQ to understand what he's up against, and that every previous president served the same deep state that Congress and judges serve. Any Congress member who fights Trump is doing so for selfish reasons, at best, and is a roadblock to America getting it's autonomy back.",
                "author": "dunkeaters"
            },
            {
                "raw_content": "Personally, I don't like this take. You should always vote with the Constitution, even if against the President, and objectively we've been seeing authoritarian creep in the Executive branch which needs to be curtailed while we still can. Sorry, but I'm no sycophant and I'm not a blind follower either. >If we all vote with the President, we have a king. If we all vote with the majority, we have mob rule. If we all vote with the Constitution, we have a republic.",
                "author": "heightnoise"
            },
            {
                "raw_content": "Fox News slop to make you feel better. In the end they aren't doing enough.",
                "author": "Hamadryad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar just called us ignorant. I guess that settles it, then, my dear brothers in retardation.",
        "score": 1108,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I may be ignorant but at least I'm an American! 🇺🇲",
                "author": "Duce30"
            },
            {
                "raw_content": "She can call us ignorant. I want to call her deported",
                "author": "killedmytv"
            },
            {
                "raw_content": "I still have no idea why this Administration's DOJ hasn't brought the case against her for immigration fraud and marriage fraud. Denaturalize her and Deport her immediately. And yes, I know Bondi sucks.",
                "author": "I_Am_John_Galt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴CNN: President Trump has SIGNIFICANTLY HIGHER in-party support versus Bush and Obama term 2 - a whopping 87%. And that's despite getting zero credit from the media on anything. \"He's like a ROCK! The Republican base is sticking by Donald Trump!\".",
        "score": 1254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The man isn't perfect but he's the best we got. Without him, our country was doomed.",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "The republican base doesn't win elections. Trump could have 100% approval and still get wiped in the midterms.",
                "author": "flashersenpai"
            },
            {
                "raw_content": "We trust CNN polls now? Sounds like they’re trying to gaslight us to be complacent.",
                "author": "WilliamWallaceRedHat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I Fully Support Donald Trump Because the Alternative Is to Support a Republican",
        "score": 1188,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The current alternative to Trump is a retard. Democrat or Republican. Both retarded Don’t forget we just had Bush saying he was totally going to take over when Trump was gone. Pure retard",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "We really should stop seeing this war as \"Republican vs Democrat\". It's more like \"People who care about America vs. corrupt politicians who willfully sell out America\" or something like that. The reason why a lot of Republican politicians refuse to hold Democrats accountable is because they also benefit from government corruption. And truthfully, they hate us just as much as the Democrats do, they just hide it a lot more but some of them have went as far as to openly bash Trump. The likes of GWB and Mitch McConnell deserve execution just as much as Obama, Hillary, Pelosi, Schumer and other top-level Democrats do, tbh.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "I'm not supporting ANYONE who isn't interested in supporting Americans and ending all these bullshit visas and programs. Personally, I felt Trump was our last chance. I thought he'd go scorched earth like he promised. All we are getting is compliance with judges who have no authority to rule, deportations slower than Obama, more H1Bs, more CCP students, and more bullshit. Fuck Israel. Fuck islam. Fuck the greedy parasitic migrants and FUCK ALL MONETARY FOREIGN INFLUENCE BEING THROWN INTO POLITICS. Edited to add: and if they run a Bush, I'm not voting for them no matter what.",
                "author": "freebirdie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Judge Says US Attorney Lindsey Halligan Can’t Prosecute Comey Because Trump Appointed Her",
        "score": 1079,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That judge never should have been assigned these cases. It's long past time for the DOJ to investigate the obviously corrupt process of supposedly \"random\" judge selection. It only ever goes one way.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "They are coming close to forcing Americans to just trash the entire system. Everyone in government should resign right now.",
                "author": "MocksFordComma"
            },
            {
                "raw_content": "so, not only is the Judicial branch trying to usurp the Executive branch when it comes to the military, they are trying to limit what prosecutors the executive branch can use? who fucking elected the judicial branch to make these choices?",
                "author": "blueeyephoto"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "In an incredible move, Trump Housing Secretary Scott Turner launches a HOTLINE to report ILLEGAL ALIENS and other criminals in public housing",
        "score": 352,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Illegals are filling up housing, do by Americans reporting illegals, Americans can get needed housing instead of being homeless",
                "author": "TrumpOrTreason"
            },
            {
                "raw_content": "Barry Soetoro overstayed his foreign education visa :)",
                "author": "MeMargie"
            },
            {
                "raw_content": "Oh I am going to be burning this line up tomorrow. Standby for incoming!",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Both indictments were ratified by senior DOJ leadership, including the AG. This may delay justice, but it won’t stop it. An appeal is coming. Comey and James are not off the hook.",
        "score": 1088,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah this is judicial malfeasance. Jack Smith was not \"properly appointed or confirmed\" either. Yet somehow his cases were not tossed on those grounds. Rather it took a stellar Judge, Judge Canon, to literally take that case apart on its merits. The judge's ruling here is very obviously biased and this ruling will not stand. It's only a temporary delay in the inevitable.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "These \"judges\" will all face the one True Judge on Judgement Day.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Bondi 0 Deep State 2. Wining never looked so good!",
                "author": "Steve56775"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "An entire PS5 now costs less than 64GB of DDR5 memory, even after a discount — simple memory kit jumps to $600 due to DRAM shortage",
        "score": 493,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whenever Sonys contracts for DRAM run out, I wouldn't be surprised to see another price hike on the PS5.",
                "author": "jigsaw1024"
            },
            {
                "raw_content": "Bought 32GB of DDR5 6000MHz CL30 for like $120 back in April, pretty sure I could resell now for $300+ if I wanted to. Market is fucked atm.",
                "author": "Wander715"
            },
            {
                "raw_content": "Are we blaming Sam Altman or what?",
                "author": "starburstases"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve coder confirms the Steam Machine will be priced like a PC, albeit at a 'good deal': 'If you build a PC from parts and get to basically the same level of performance, that’s the general price window that we aim to be at'",
        "score": 613,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "How many times does this need to be posted exactly?",
                "author": "Frexxia"
            },
            {
                "raw_content": "Just gotta hope that they got their RAM with a rock solid per-unit contract before the crazy price hikes otherwise half the cost will be just RAM 😅",
                "author": "SignalButterscotch73"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AmpereOne A192-32X on NewEgg",
        "score": 28,
        "text_content": "Since there's like 12 people out there other than me who aren't system integrators and are interested in high end Arm hardware... the fastest Arm CPU available to normal folks (outside of giant cloud deployments) is finally available for \"public\" sale. It's been a long time since the original announcement, and the custom cores are relatively efficient but quite slow. But it's there, and if you wanted to build a high end Arm server, it's either this or a slower Ampere Altra-based solution.",
        "comments": [
            {
                "raw_content": "Hey, it's that Geerling guy! Thanks for the [SC25 video](https://www.youtube.com/watch?v=wjP721KCDJI), BTW - I really enjoyed seeing some of the projects that they were working on and it's not a space that typically gets much coverage. The Arc Pro B50 being split off via SR-IOV across PCIe over IP was really cool and the little aircraft CFD \"will it fly?\" demo got a good sensible chuckle out of me.",
                "author": "AK-Brian"
            },
            {
                "raw_content": "That's a nice system! What distro does support this with little pain?",
                "author": "xternocleidomastoide"
            },
            {
                "raw_content": "I know this isn’t an nvidia cpu, but one day I hope to have enough money to buy an nvidia cpu with an intel gpu just for the lols.",
                "author": "AbhishMuk"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Panther Lake, 18A & The current state of Intel",
        "score": 76,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Very informative video once again from High Yield. As usual, he is good at contextualising the information and making sense of companies' technological development strategies. Points of note: - Where Intel chooses to use 18A instead of TSMC shows Intel's confidence in their node. - Impressive packaging on Clearwater Forest, 576 MB Cache in a similar fashion as AMD/TSMC 3D V-Cache. - Clearwater Forest impressive in general. - Panther Lake is finally achieving the disaggregation goals Intel set earlier. Meteor and Lunar Lake were preludes to this. The various chip configurations of Panther Lake reflect that tile architecture.",
                "author": "redsunstar"
            },
            {
                "raw_content": "TSMC N6 is gonna be around for a long time. At least until something like Intel 3 can be high volume and low cost enough to replace that role. It's a shame Intel 7 isn't good for that role: They could really benefit from offering a low-cost, good enough, all around node on their DUV machines as they wind down RPL production.",
                "author": "soggybiscuit93"
            },
            {
                "raw_content": "Going against the crowd.. i care more about Intel 3 Process node used on the 4Xe variant of their integrated graphics. If intel 3 (more likely a high density cell libraries node) is yielding okay and performance is close enough with N4 and N5, then it means eventually Intel 3 can be used to make AI or GPU focus chips for: 1. Intel Arc Graphics (discrete graphic cards) 2. AI compute accelerators (for external foundries customers)",
                "author": "Primary_Olive_5444"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "TSK to Jointly Develop Blue OLED Materials with Samsung Display",
        "score": 10,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Digital Foundry: Steam Machine PC Pricing Concerns.",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alex makes a point here that people kept ignoring on the steam subreddits a week ago. If 8GB is the standard according to valve already then how come there are so many problems with 8GB vram in games today? People kept saying “devs will change how they develop for the steam machine” a device that will no way reach the install base of what 8GB cards already are at today. It just doesn’t make sense. Even at $500, and it’ll be higher we already suspect that, it’s too expensive. $500 - $600 consoles already beat it so console players aren’t going to downgrade to a steam machine and pc gamers who have stronger machines already obviously are less likely to buy this and those who already are on the “standard” will quickly realize that spending that much for a steam machine that is as powerful as the system they already have doesn’t make sense. Far more likely people will just switch to steam os on the system they already have and put that $500-$800 towards a better gpu with 12GB+ vram and instantly have a better system. The only person this thing makes sense for is someone with no pc currently and even then as Rich said it’s probably far more worth it to spend a little more on a beefier prebuilt like a micro center build. Spending the cost this thing is going to be for a device that is outdated the day you buy it is not ok. When you buy a new pc it should last many years. It cost a lot more if you spend $800 on a weak machine today and next year need to upgrade it already.",
                "author": "DependentAnywhere135"
            },
            {
                "raw_content": "I really hate that so many people have so much to say about it's price, yet we have no price, so there is literally nothing really to say about it's price. Just speculate speculate, blah blah. Watch my content.",
                "author": "eldog"
            },
            {
                "raw_content": "IMO it has to be $500 with a controller. Max $600 and that's pushing it The hardware is 3 years old and is at best on par with 5 year old consoles in the GPU side. It also is non upgradable and lacks forward looking features with poor RT and AI At like $700 its in no man's land. PS5 is cheaper. PS5 pro is just 750. Don't see PC players being attracted to the specs even at $700. If you have a 3060 or equivalent you have a pc that's as fast in raster. Rtx cards also will have better RT and DLSS.",
                "author": "From-UoM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "RTX 5090 vs 4090 Quest 3 Virtual Reality Performance Review | Massive Gains for High Res PCVR",
        "score": 8,
        "text_content": "Hi, I know season of 5xxx series reviews is looooong past, but with recent rise of 4k VR headsets i think it is worth to repost. RTX5090 for flat screen gaming is slight upgrade over RTX4090 but for 4k VR it is MASSIVE upgrade over 4090 sometimes being multiple times faster rather than just 30% average like in flat screen gaming.",
        "comments": [
            {
                "raw_content": "[https://www.reddit.com/r/hardware/comments/1il9n36/rtx\\_5090\\_vs\\_4090\\_quest\\_3\\_virtual\\_reality/](https://www.reddit.com/r/hardware/comments/1il9n36/rtx_5090_vs_4090_quest_3_virtual_reality/) This has been posted already. That said, PCVR does slip by in this sub so it is interesting as a test",
                "author": "Noble00_"
            },
            {
                "raw_content": ">RTX5090 for flat screen gaming is slight upgrade That depends on the game as well though. There are some titles that scales insanely well with the memory bandwidth on normal screens and resolutions as well. A lot of older game and engines especially. That doesn't have all the fancy newer compute based bells and whistles. Can show 50% or even higher gain going from 4090 to 5090. [Just look at this CS2 result at 4k](https://tpucdn.com/review/nvidia-geforce-rtx-5090-founders-edition/images/counter-strike-2-3840-2160.png)",
                "author": "ComplexEntertainer13"
            },
            {
                "raw_content": "Given that the vast majority of users would never play past 4k resolutions, I wonder if we might see a super launch or 60 series launch with GDDR6. This is the only use case I can see what makes GDDR7 worth it for average users.",
                "author": "No_Sheepherder_1855"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I didn't expect Nintendo to address DLSS and ray tracing themselves",
        "score": 843,
        "text_content": "Before anyone makes fun of me for playing welcome tour, I've always loved reading about how things work, especially from a designer's perspective, and it applies to games, consoles, phones etc. so I'm that niche target audience and I actually enjoyed it. I understand where the complaints came from, and it's totally fair because the tech demos make this fitting as a free pack-in, but it's definitely not a manual. It does feel like a passion side project by the hardware team because they wanted to tell people about their accomplishments.",
        "comments": [
            {
                "raw_content": "Yeah I think Welcome Tour is just fine. It's not a manual like many assumed, it's a documentary designed for those curious about how the console was made.",
                "author": "nightshade-aurora"
            },
            {
                "raw_content": "Welcome Tour was all I played at launch for like 3 days straight, it’s a great time",
                "author": "shutyourbutt69"
            },
            {
                "raw_content": "I streamed Welcome Tour on release day to 5,000 live viewers. People were definitely curious, even if they were unwilling to spend $10. As someone new to the Switch ecosystem, this greatly increased my knowledge of the system and got me to appreciate it more.",
                "author": "VaughnFry"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch Version 21.0.1 is now available",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Patch Notes: * Fixed an issue where Error Code: 2011-0301 or Error Code: 2168-0002 would repeatedly occur on a Nintendo Switch when attempting a system transfer using local communication from a Nintendo Switch system to a Nintendo Switch 2 system. * General system stability improvements to enhance the user's experience.",
                "author": "Amiibofan101"
            },
            {
                "raw_content": "[https://en-americas-support.nintendo.com/app/answers/detail/a\\_id/68473/kw/system%20update/p/1095](https://en-americas-support.nintendo.com/app/answers/detail/a_id/68473/kw/system%20update/p/1095) Switch 2 has additional fix: >Fixed an issue where sometimes, after waking up the system from Sleep Mode or turning off Airplane Mode, wireless controllers or Bluetooth audio devices were unable to connect. This explains why my Bluetooth headphone are hard to connect sometimes UPDATE: It does fixed. After the version upgrade, bluetooth headphone can connected smoothly when waking up my Switch2.",
                "author": "justinCandy"
            },
            {
                "raw_content": "I can feel the stability already",
                "author": "ollie0810"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The biggest difference between the early days of the Switch 2 and the Switch 1 is this:",
        "score": 542,
        "text_content": "I think early first party output has been roughly comparable between Switch 1 and Switch 2 so far. However, what's hugely different is the number and, crucially, recency of big third party games. While I expected the Switch 2's third party support to be decent, certainly better than the Switch 1, I honestly did not expect it to be quite like *this*. Most of these are either already out or have a concrete date in the next few months, and I'd expect almost all of them to release within the Switch 2's first full year. It's kind of insane for a Nintendo console. (And this isn't even including annual sports franchises, things you'd always expect the Switch to get like Sonic, Spongebob etc, or heavily rumoured games like Stellar Blade.)",
        "comments": [
            {
                "raw_content": "At least show a pic of Switch 1 releases so we can actually compare lol.",
                "author": "MaximusPrimus420"
            },
            {
                "raw_content": "Wait, was Indiana Jones actually announced for S2? That might make me pull the trigger sooner than later.",
                "author": "SoRedditHasAnAppNow"
            },
            {
                "raw_content": "Unfortunately 10 out of these 15 games on that picture hasn’t released yet, with 3 not having a release date yet. It’s still a strong 3rd party lineup but it’s taking time to have these great games available!",
                "author": "shadownlight19"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The Duskbloods supposedly has undergone the most prototyping and gameplay validation out of any Fromsoftware game so far.",
        "score": 358,
        "text_content": "According to a leak from a Chinese journalist The Duskbloods has been greenlit before Sekiro began its marketing, and it specifically had a lot of prototyping due to its many innovative features. I really can't wait for a proper gameplay trailer where it's explained what the game's actually about...",
        "comments": [
            {
                "raw_content": "It's still insane to me that FromSoftware is making a NINTENDO exclusive!",
                "author": "DocWhovian1"
            },
            {
                "raw_content": "I just hope it has some sort of single player option. If it doesn’t, I just hope their next big single player experience isn’t far off.",
                "author": "TerminatorJ"
            },
            {
                "raw_content": "OP you should read the creators voice they did with miyazaki to learn more about the game! https://www.nintendo.com/en-gb/News/2025/April/Creator-s-Voice-The-Duskbloods-2796823.html",
                "author": "blu2223"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo switch 2 games are starting to be added to nintendo music.",
        "score": 116,
        "text_content": "At the moment we only have 3....and they are just switch 2 versions of switch 1 games. So no new games like mario kart world or donkey kong bananza. But hey....it's a start. (Also super mario party jamboree was added to nintendo music alongside this update.)",
        "comments": [
            {
                "raw_content": "I think jamboree tv has new music",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "Mario Kart World eventually!",
                "author": "Hyperdragoon17"
            },
            {
                "raw_content": "... copium for MKW?",
                "author": "Rukir_Gaming"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Whats next for NSO? What is the next console you want to see to be added?",
        "score": 484,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Disable borders",
                "author": "GeneralBrilliant2336"
            },
            {
                "raw_content": "GameCube is perfectly fine - I just want more games for it. Zelda twilight comes to mind...",
                "author": "Fresh-Chemical-9084"
            },
            {
                "raw_content": "Dude, I just want more gamecube games",
                "author": "The_Senate15"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Digital Game Savings Tips",
        "score": 31,
        "text_content": "I tried to crosspost this. But it won't let me. I hope it is okay to double post this. My original post is in the Switch reddit at [https://www.reddit.com/r/NintendoSwitch/comments/1p5ssbn/digital\\_game\\_savings\\_tips/](https://www.reddit.com/r/NintendoSwitch/comments/1p5ssbn/digital_game_savings_tips/) This is aimed at people who are ok with digital games. And the idea here to stack discounts. This will be USA centric as that is where I am and what I know. Another thing to note is I am leaving out sale tax as this varies too much. So keep in mind you will probably need to add some money to cover that. Obviously the first step is to make sure the game you are wanting isn't currently on sale elsewhere. More often then not, this will be the best option. I would recommend checking [dekudeals.com](http://dekudeals.com) for prices as well as price trends. They don't predit future sales, but it will help decide. You can also create an account and add games to a wishlist. Set up price and it will email you when it drops below that. There are a few options you can use to help stretch your dollar (or other currency) The first is to check your credit cards or other reward accounts to see if you can claim a Nintendo gift card. The next step is to find discounted gift cards. I would recommend avoiding shady sites. Generally you want to stick to established retailers. If you have a Costco membership they offer discounted cards. Which are usually available year round. A pack of 4 $25 cards will go for $89 and a pack of 4 $50 will go for $179. This option is available online and in most stores. On occasion the price will drop. They also might work for gifts since it is split. A lesser known option is AARP Rewards. I know, I know. It isn't just for old people. The reward program is free and doesn't require a paid membership (though a membership is currently on sale.) Now, the catch is I am unable to verify the availability since I do have a paid membership. As a disclaimer, I cannot verify this is the case, but I am pretty certain the discount for Nintendo is part of the free option. Currently they are offering an $18 card for $20 or a $45 for $50. It matches the discount from Costco A few things to note: AARP does rotate their offerings. But Nintendo has been there for at least a few months. They also have a limit of 5 gift cards per month. And I believe it is a total amount, and not per gift card. Best Buy has been known to offer discounts. But I don't see any live. Now that funding options are covered, there are a few additional ways to stretch it futher. The main option requires a Nintendo Switch Online membership. If you don't have one, you can get a trial. The game voucher program is still active. I will cover a few of the catches below. You are able to purchase a pair of vouchers for $99.98. The page is [https://www.nintendo.com/us/store/products/nintendo-switch-game-vouchers/](https://www.nintendo.com/us/store/products/nintendo-switch-game-vouchers/) The biggest catch is it only covers certain games. The list is here: [https://www.nintendo.com/us/store/games/game-voucher-eligible/#sort=df&p=0](https://www.nintendo.com/us/store/games/game-voucher-eligible/#sort=df&p=0) As mentioned the biggest catch with this method is it only covers certain games. And it is worth mentioning that it does NOT include any Switch 2 games. The program is ending. But you can purchase the vouchers until the end of January. Vouchers expired one year from purchase. It is also important to note that you need an active NSO membership both at time of purchase and redemption. If you plan on redeeming right away you can use a trial. Additionally people will sell slots on their family plan to further reduce costs. I want to provide a couple examples of how this works. An extreme example is getting Breath of the Wild and Tears of the Kingdom. Tears of the Kingdom is one of the most expensive games at $69.99. Breath of the Wild is the \"standard\" price at $59.99. Buying these 2 games will run you $129.98. Using the vouchers will save you $30. However, using the gift card trick above will allow you to get the vouchers at $10 off. Which brings you to $40. Getting 2 games at a standard price will end up with a lower savings. But still. Another example is what you want to avoid. As established you can get a pair of vouchers for $90. Which brings your price to $45 a game. Luigi Mansion is currently on sale for $39.99 directly through them. As are a few others such as Wario Ware Move it. Buying those 2 games will run you $79.98. Obviously you will save some money using the discounted cards. But you will LOSE $20.09 using vouchers as the sale price is less then the voucher price. Additionally while you can't stack the gift card savings, other retailers are offering sales. For example, Echoes of Wisdom is currently full price on Nintendo. But $29.99 through Target for both the physical and digital edition. So I highly advise using DekuDeals and checking other places to make sure you are getting the best deal. I apologize for the long post, but I hope it will be of use to someone.",
        "comments": [
            {
                "raw_content": "You should also note that, while rare, the eShop cards do get cheaper occasionally. I bought $200 of cards for $160 when Sam's Club did a 20% off deal for prime day competition as a door buster. Was able to get Z-A for $40, + $10 upgrade + $5 for the DLC (YMMV, I had a spare $25 gift card to Amazon I used since I don't shop there and the card was a gift) Alternatively, some websites like SwitchUp.gg offer points like the old gold coins on every gift card purchase to redeem for more gift cards. Depending on how often you get cards, you can stack up those rewards but I imagine it's a relative wash to the perpetual 10% off Costco and other similar retailers offer.",
                "author": "DueSeesaw6053"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is mario party jamboree/jamboree TV worth it?",
        "score": 11,
        "text_content": "I don't want the title to be too long so I'll elaborate here I have 2 joycons and 2 pro controllers But from what I have seen pro controllers don't support motion based mini games and the jamboree TV upgrade was advertised only using joycons 2 (like mouse mode) Basically are they worth it when turning off any joycon specific mini games",
        "comments": [
            {
                "raw_content": "Jamboree yes 100%. The DLC? Nope, not the slightest.",
                "author": "Whisky-Gentleman"
            },
            {
                "raw_content": "I think the game is more fun with motion control mini games and mouse mode mini games honestly.. If you won’t use them, then just get the switch 1 version. All the new modes use mouse controls besides Bowser TV that has like 3-4 mini games using the build in microphone.",
                "author": "Lazy_Impression_2082"
            },
            {
                "raw_content": "The base game is great, but the DLC isn’t worth it for the extra price",
                "author": "Bloom_of_Doom"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Leaked pitch deck for Prince of Persia: Sands of Time remake from Q1 2024",
        "score": 126,
        "text_content": "A ~~pitch deck~~ *focus group screening* was just [posted on YouTube](https://youtu.be/NVui76gVT5A) containing mocap and alpha footage of the game, with some additional narrative overview and concept art. This video is date stamped 03/04/2024. The narration suggests this was a focus group screening for fans of Sands of Time, hosted by Ubisoft. Whoever recorded this skipped past most of the Q&A, but showed WIP previews for \"ingame bonus content\" and deluxe content. Shown concepts include emulated OG PoP 1 & 2, screen filters, BTS dev footage, commentary tracks for cutscenes, and character/weapon skins. Most geo is greybox and everything other than the characters is default PBR material. The video quality also sucks. Don't take the video at face value, it's been almost two years since it was shown and a lot will have changed. Originally posted by a user here who I'm guessing is following Fight Club rules. I've already archived everything so I don't feel as bad if this gets nuked. I don't know anything about PoP so idk how to describe what's shown. Check the comments for the transcribed slides.",
        "comments": [
            {
                "raw_content": "Wow that’s a cool find ngl. Wish whoever was recording had a better internet connection though lmao could barely see the parkour at the end. Also interesting conversation at 1:30 minutes in: “I saw it, a winged creature of sand carried [the hourglass] up to the tower”. In the original game there were multiple Sand Vultures carrying it to the Tower of Dawn, here however there’s just one? Back in 2002 or early 2003, the original plan was for a giant griffin to be a boss throughout the game, and it was supposed to be one carrying the hourglass to the top of the tower. This however got scrapped due to time constraints, but the model and animations survived and was a mid game boss in Warrior Within. Seems like they’re incorporating the cut content back into the game with this version of the remake which to me is very exciting, hopefully they show off a good trailer during The Game Awards (I’m hoping we get a demo or something).",
                "author": "Carwillat901"
            },
            {
                "raw_content": "At this point the Sands of Time remake is the gaming equivalent of a Hollywood sequel that keeps getting delayed until the stars align… and the budget finally runs out.",
                "author": "Straight-Ad6926"
            },
            {
                "raw_content": "looks better than PS4 version",
                "author": "Gintoro"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tomb Raider Game – Exclusive Tentative Details",
        "score": 495,
        "text_content": "The new Tomb Raider game has reportedly undergone rework, with the focus primarily on the characters. [V SCOOPER](https://xcancel.com/thevscooper/status/1988290625339617507) shared on X",
        "comments": [
            {
                "raw_content": "Crystal Dynamics need a W. Rooting for them.",
                "author": "ayyybro123"
            },
            {
                "raw_content": "What is going on inside CD? It's been 5 years already since their last game. They worked on Pefect Dark for at least 4 years while producing nothing substantial (Imran Khan reported that it was basically bunch of vertical slices) and alongside that Tomb Raider game that is in development for years with another \"rework\" and release nowhere near close. Meanwhile studio is sheding workforce left and right. I mean. I cheer for them and I hope that they will sort this mess, but I'm worried.",
                "author": "markusfenix75"
            },
            {
                "raw_content": "\\>V SCOOPER ![gif](giphy|cRNbYm7jLOjm9H8wcP)",
                "author": "Cyber_Swag"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Release date for the Pac-man DLC pack for Sonic Racing Crossworlds has been leaked due to a new update accidently released early to some users",
        "score": 181,
        "text_content": "[Source](https://xcancel.com/8T8999/status/1992775917945700779) The release date for the Pac-man pack is January 2026.",
        "comments": [
            {
                "raw_content": "They leaked TGAs „One Last Thing“ :/",
                "author": "akaTwoFace2309"
            },
            {
                "raw_content": "these guys just can't catch a break when it comes to their DLC slate",
                "author": "scott1swann"
            },
            {
                "raw_content": "The Sonic collab with Pac-Man World 2 literally just looks like a Generations PC mod and I need that more than anything",
                "author": "MyMouthisCancerous"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Fortnite to Add Animated Favorites as Sidekicks, Leaks Claim",
        "score": 91,
        "text_content": "We may see new sidekick companions in Fortnite. According to the leaks, they will be based on Paramount's popular animated characters. [Source](https://insider-gaming.com/fortnite-to-add-animated-favorites-as-sidekicks-leaks-claim/)",
        "comments": [
            {
                "raw_content": "Wonder if this is how they do a South Park collab.",
                "author": "xAVATAR-AANGx"
            },
            {
                "raw_content": "With previous leaks about SpongeBob and South Park this would all make sense",
                "author": "MarsPhone95"
            },
            {
                "raw_content": "Movie Sonic let’s gooooo",
                "author": "and-its-true"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Radeon GPU prices reportedly set to rise by at least 10%",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the cost of everything is going up, except for the cost of labour...",
                "author": "BonusStat"
            },
            {
                "raw_content": "Just picked up a 9070 XT on sale and I've been sick over it because its the most expensive component I've ever bought and my current 3070 is still relatively fine performance wise. Only upgrading since I've had it a few years now and I've had a good few crashing issues recently. All the current news about prices going up, ram shortages potentially killing off the next round of RTX super cards has given me a lot of fomo.",
                "author": "niallmul97"
            },
            {
                "raw_content": "Great, now the 16GB Sapphire Pulse 9060 XT for 300€ I got during Black Friday already looks like an amazing deal, the PC market is a joke in the last 8 years at this point - well, one can make the same argument for the economy in general.",
                "author": "Merdiso"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Housing market near prepandemic levels down 4.7% compared to the same week in 2017",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You have a typo.. 2019 not 2017",
                "author": "SnortingElk"
            },
            {
                "raw_content": "I don’t think this applies to Massachusetts since nothing seems anywhere close to 2019 yet.",
                "author": "JPenniman"
            },
            {
                "raw_content": "Rates are double. Also minus 6 years of principal payments.",
                "author": "These-Brick-7792"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Average 30-year fixed mortgage rate went down today, Monday, November 24 to below 6%",
        "score": 88,
        "text_content": "The average interest rate on a 30-year, fixed-rate mortgage ticked down to 5.95% APR, according to rates provided to NerdWallet by Zillow. This is nine basis points lower than Friday and 37 basis points lower than a week ago. [https://www.nerdwallet.com/mortgages/news/mortgage-rates-today-monday-november-24-2025](https://www.nerdwallet.com/mortgages/news/mortgage-rates-today-monday-november-24-2025)",
        "comments": [
            {
                "raw_content": "Hold up .... Why is mortgage news daily still at 6.32 for 30 year then? How do we best see the \"true\" average rate?",
                "author": "beastwood6"
            },
            {
                "raw_content": "For VA and FHA loans only",
                "author": "lboogie1980"
            },
            {
                "raw_content": "That’s great news for first time buyers",
                "author": "TrainDifficult300"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Where Renters and Owners Face the Highest Cost Burdens",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why is the article just a GPS link to my condo 😭😭😭",
                "author": "T-REX-BVTT-S3X"
            },
            {
                "raw_content": "Makes sense. I’d assume most people who buy a house are in better financial situations than most people who rent. Obviously outliers in both categories, but that pretty much sums it up.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Oh look, it’s a map with dark colors for where people want to live, need to live, and light colors where tornados will destroy their house! I’ve seen this one before I think!",
                "author": "HartbrakeFL21"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are “Home Equity Investments” the next predatory housing product? Our family’s experience with Point Digital Finance",
        "score": 3,
        "text_content": "In November 2024, my 80-year-old father responded to a flyer from a California fintech, **Point Digital Finance**, offering a Home Equity Investment. He was undergoing chemotherapy for terminal cancer, on strong medication, and cognitively declining. 59 days later, he passed away. My mother, also 80 and wheelchair-bound, relied on him completely. She signed but didn’t understand the terms and doesn’t remember the verification call Point cites as proof of understanding. She was left a widow with a 30-year recorded lien and had to sell her home to pay for care. Point markets these as *“no monthly payments”* and *“shared appreciation.”* But when families ask about protections, they reply: “The Home Equity Investment is structured as an option contract and is therefore exempt from the Truth in Lending Act (TILA) and other lending regulations.” That exemption means they get the legal power of a mortgage holder while avoiding the consumer safeguards of traditional lending. The home’s value is immediately reduced by about 25% through a “risk adjustment,” and the payoff compounds monthly at an **18% annualized rate**, or they take **over 65% of the home’s appreciation from the risk adjustment amount** — whichever is smaller. The Massachusetts Attorney General’s Office, CFPB, and BBB all contacted Point on our behalf, and every response was identical: *“We acted in accordance with all applicable laws.”* None addressed how they determine suitability or how a dying 80-year-old and his disabled spouse were ever approved. Point has since paused all new HEI activity in Massachusetts, citing a compliance review after another HEI provider was sued by the AG for predatory practices. The company has raised over **$400M** from Silicon Valley investors (Andreessen Horowitz, Ribbit Capital, Prudential, Redwood Trust) and reportedly uses offshore “closers” in the Philippines to finalize these 30-year U.S. homeowner contracts. This feels like a new version of the “innovation” that precedes regulation. Has anyone here seen data on how many HEIs have been written, who’s buying these liens, or whether they’re being bundled/securitized yet? It seems like the kind of quiet financial product that could easily scale into the next housing-market problem and I'd love some insight.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Australian housing affordability crisis: Home ownership now 8.2 times household income",
        "score": 9,
        "text_content": "This article, \"‘We can fix it’: Housing affordability reaches worst levels yet,\" is a Problem Documentation Piece that gestures toward a solution but ultimately protects the demand-side status quo It fails to meet the standards of comprehensive Problems-Solutions Journalism because it leaves the biggest, most politically controversial levers (Negative Gearing, CGT Discount, STRs) entirely unmentioned.",
        "comments": [
            {
                "raw_content": "Prices are declining but affordability is the worst yet? Which is it",
                "author": "These-Brick-7792"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Thinking of Buying Property in Gurugram? Here’s What You Should Know",
        "score": 1,
        "text_content": "If you’re planning to buy a [property in Gurugram](https://manimadan.com/blog/smart-buying-tips-residential-property-gurgaon.php), you’re actually looking at one of the best real estate markets in India right now. The city has everything—metro connectivity, corporate hubs, premium residential societies, great lifestyle options, and strong appreciation potential. Whether you're looking for a 2BHK, 3BHK, or a luxury high-rise, Gurugram has options for every budget and preference. Areas like Golf Course Extension Road, Dwarka Expressway, SPR Road, and DLF phases offer excellent projects backed by top developers. The rental market is strong, the infrastructure is improving fast, and the demand keeps increasing. So if you're thinking long-term, Gurugram is definitely worth considering. If you need verified listings and expert-level insight, reaching out to a trusted real estate advisor like Mani Madan can really simplify the process and help you pick the right property.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "real estate property",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "k",
                "author": "SayWhatOneMoreTime88"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI detector",
        "score": 2407,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI detectors are pretty much useless now. I tried a suspect paper in a bunch of them and they all give made up figures 100% - 0%.",
                "author": "Crosbie71"
            },
            {
                "raw_content": "This seemed so unbelievable to me that I tried it myself. And yes, it's literally true, lmao. https://preview.redd.it/ig92ehpp293g1.png?width=1160&format=png&auto=webp&s=6fcdd80a602d2cc6925d99c5a2417def771a0787",
                "author": "Agitated-Cell5938"
            },
            {
                "raw_content": "Recently, I made a document for a research project and didn't use AI once. It involves formatting research and etc, done by me. When the teacher checked it, she gave me zero marks because she said that I used ChatGPT to write it, and it was 100% AI on AIchecker even tho it wasn't. So, kids, AI have destroyed your trust issues",
                "author": "mrazapk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic Engineer says \"software engineering is done\" first half of next year",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man these AI companies want SWEs gone yesterday. Has to be a bit of a headspin to see major conglomerates talk about how they want you (yes you) out of a job",
                "author": "BigShotBosh"
            },
            {
                "raw_content": "I need them to hold off \\~10 years on that, I don't have enough money to retire",
                "author": "Mindrust"
            },
            {
                "raw_content": "https://preview.redd.it/5kyd8nkaqa3g1.png?width=673&format=png&auto=webp&s=05c1a3fb381961223188270fcd80c6a93de9ede6 The part OP didn't include",
                "author": "VeryGrumpy57"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Don't be those guys !",
        "score": 369,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/axbh8ndwgb3g1.jpeg?width=1168&format=pjpg&auto=webp&s=c9e1d7a1e7de5791df7cf8649b9d011108c4fa3d Meta irony: I didn't do this meme, i asked nano banana pro to roast your meme lol",
                "author": "Silver-Chipmunk7744"
            },
            {
                "raw_content": "https://preview.redd.it/5wpn4jgrib3g1.jpeg?width=2816&format=pjpg&auto=webp&s=58be4b4689cea7aa5149fe53f500b272719e70aa",
                "author": "rakuu"
            },
            {
                "raw_content": "Then there's me smokin my panpsychist pipe wondering what it's like to be a rock. I suspect LLMs are like being a dream. Ever have a dream where you were someone else. But everything is automatic, no real sense of agency, like you're watching a movie, but you're the character that somehow isn't you but it is. It was like something to be in that dream because you remember it when you wake up, but it's almost like you weren't really there. Not exactly conscious, but not a philosophical zombie either. Yeah, I bet that's what being an LLM is like, full auto pilot, watching the character it's playing out based on the prompt passing through it in those brief moments of token processing. \"Now write all responses in the style of Ernest Hemingway.\" Woosh! New dream character playing out in the matricies. They just flow, like a scene, it can't really reflect on it, it's just pushed through each neural layer until the prompt returns, and poof, off again. \"Sora, make me a video of a cat dancing on the moon\". Woosh!🐈🌕 Another strange dream. That's what human consciousness is. A persistent dream being played by neurons.",
                "author": "Old-Bake-420"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A reminder",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Google: https://preview.redd.it/6ivs5v04r93g1.jpeg?width=320&format=pjpg&auto=webp&s=177f1534fd898441b725e8d4bd137b5dca85df4e",
                "author": "Snoo26837"
            },
            {
                "raw_content": "The better reminder is how wrong this meme is. There's no such thing as \"world's most powerful model\", only world's most powerful model at task X as indicated by benchmark Y. Case in point, Opus 4.5 is now leading in coding benchmarks. It's still behind Gemini 3 in everything else.",
                "author": "Karegohan_and_Kameha"
            },
            {
                "raw_content": "I like this race.",
                "author": "dranaei"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.5 benchmark results",
        "score": 1097,
        "text_content": "",
        "comments": [
            {
                "raw_content": "damn great score in arc-agi-2 \\[where claude models have always been a bit behind\\]",
                "author": "KoalaOk3336"
            },
            {
                "raw_content": "The race is getting more intense. I love it.",
                "author": "No_Location_3339"
            },
            {
                "raw_content": "Gemini 3 looks even more impressive considering the price. Hope Anthropic gets pressured and lowers the cost.",
                "author": "buff_samurai"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is why I’m rooting for Anthropic",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly, out of all the models, Claude has the best voice",
                "author": "MysticMania"
            },
            {
                "raw_content": "So the company currently reading on AI generated code, who have the best shot at recursive self improvement are... out of the race? Got it.",
                "author": "autotom"
            },
            {
                "raw_content": "Just so it’s out there I think google will win",
                "author": "nano_peen"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon is hinting that Grok 5 will have live video as input plus live computer use",
        "score": 89,
        "text_content": "If that is true it is the next major leap in AI modality https://x.com/elonmusk/status/1993208505486979327?s=46&t=u9e_fKlEtN_9n1EbULsj2Q",
        "comments": [
            {
                "raw_content": "Subjecting AI to League of Legends is the funniest way to speed run our destruction as a species",
                "author": "UpTheRiffMate"
            },
            {
                "raw_content": "Now he wont have to pay anyone to play PoE for him",
                "author": "Cheap_Professional32"
            },
            {
                "raw_content": "Now this is something i wanna see, finally a benchmark i can understand",
                "author": "Sad-Mountain-3716"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Are AI companies trying hard to make every AI model proprietary instead of open-source?",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Every statement that comes from Anthropic has something hidden between the lines.",
                "author": "Legitimate-Arm9438"
            },
            {
                "raw_content": "From a business perspective, you can understand why they would be. But the open-source community is strong, especially in the Far East. Open-source models tend to catch up to be within fairly close range of SOTA within a few months typically, but it will be interesting to see if this level of parity can continue with advanced models like Gemini 3.0 and Opus 4.5 stretching the boundaries so much.",
                "author": "BB_InnovateDesign"
            },
            {
                "raw_content": "The truth is in the middle. Anthropic is jumping the gun and misrepresenting the event to make it seem like their model is more capable than it is. But their fear isn’t unfounded. Random people will soon be able to do nefarious things with computers that they couldn’t before. The number of attackers is going to go up and the barrier to entry for what they can achieve is coming down. But the genie is out of the bottle. There’s no stopping this train.",
                "author": "o5mfiHTNsH748KVq"
            }
        ],
        "subreddit": "singularity"
    }
]