[
    {
        "post_name": "Anyone else sick and tired of media manipulations? The pic on the left is recent. The one the media/leftists are using is many years older. She appears lost/suffering perhaps mentally unbalanced. Dead eyes. Nose ring. Strained smile. Gaunt. The real tragedy is she likely needed help but too late...",
        "score": 760,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The pic on the right is before Liberalism. The pic on the left is after Liberalism.",
                "author": "China4Biden"
            },
            {
                "raw_content": "They're also quick to mention her grieving \"wife\" when they've been ramming this \"partner\" bullshit down our throats for years now.",
                "author": "TDAF"
            },
            {
                "raw_content": "Asylums save lives...of the insane and those the insane kill.",
                "author": "LaPastillaEscarlata"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: DOJ insiders tell me the new special asst AG investigating the \"sinister leftwing movement\" subverting ICE deportation ops will focus on protest organizer Indivisible, run by two former Dem Hill staffers who were trained by a Marxist organizer, as well as Dem funder ActBlue.",
        "score": 652,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds like Obama/Soros operatives.",
                "author": "thecave888"
            },
            {
                "raw_content": "MATT GAETZ",
                "author": "PensivePatriot"
            },
            {
                "raw_content": "Receipts or bullshit. Lovely as it would be, if no receipts then it is bullshit. Is everyone so quick to dismiss Trust But Verify? was that not the pepe cheerleader squad's big thing not too long ago?",
                "author": "UncleRicoAct"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Prominent Democrat Party official Randon Sprinkle was just arrested on child p**n charges. These are some of his friends.",
        "score": 641,
        "text_content": "",
        "comments": [
            {
                "raw_content": "P**n? WTF is that? Child poon charges? That is so beyond disgusting.",
                "author": "Patriot3TX"
            },
            {
                "raw_content": "His last name is Sprinkle? Anybody with a last name like that sounds like a diddler.",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "That stupid last name is no accident, either",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ilhan Omar Caught Earmarking Taxpayer Funds for Somali Organization in Must-Pass Spending Package",
        "score": 611,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# DEPORT # NOW",
                "author": "NewBrunswickPatriot"
            },
            {
                "raw_content": "George Santos didn't anything nearly as bad as this and he was removed. She's openly stealing and we're just taking it.",
                "author": "jml1997"
            },
            {
                "raw_content": "Fucking Terminate Her and Then Prosecute Her . This shit is getting old.",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Venezuelans who fled to America are sending memes to Maduro in prison!!",
        "score": 180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's hilarious, you snarky Venezuelans! Now you can all go back home, right? Since the dictator is gone... Right?",
                "author": "ImpressiveTriceps"
            },
            {
                "raw_content": "This is the way.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Translation?",
                "author": "DemPanicAtTheDisco"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: President Trump announces U.S. military LAND STRIKES against CARTELS, specifically mentions Mexico. \"We are gonna start hitting LAND with regard to the cartels. The cartels are running Mexico!\"",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FUCK YES.",
                "author": "ICET"
            },
            {
                "raw_content": "Watch that dumb bitch governor of Arizona start having a meltdown since she's owned by the cartels.",
                "author": "Azill"
            },
            {
                "raw_content": "If Claudia Sheinbaum hasn't hit menopause yet, she is about to.",
                "author": "TakingCoatsWIN"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sec. Scott Bessent is now moving to BAN Anyone that Receives Government Assistance From Wiring Money Out Of The Country after Somali fraudsters were caught in Minnesota. \"If you are wiring out of the country, you're either getting TOO MUCH or you're part of this CONSPIRACY! We're gonna find out!\"...",
        "score": 1272,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They would just find straw accounts to make the transfer. Example: A is on gibs, gives money to B, who is not on gibs, and then B makes the wire transfer.",
                "author": "fskfsk"
            },
            {
                "raw_content": "It’s insane that we ever allowed that to begin with, but how about this? Why don’t we just deport any foreigner on government assistance and then we won’t have to worry about them finding other ways of sending the money home.",
                "author": "Hikedelics"
            },
            {
                "raw_content": "Yes. Or how about no remittances at all.",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Renee Good, the woman who was shot by ICE after she attempted to run an agent over, was reportedly part of local \"ICE Watch\" groups whose mission was to disrupt ICE operations, per NYP. She was a radical anti-ICE activist.",
        "score": 1437,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuck, put a warning label on that goblin",
                "author": "PapaPepe"
            },
            {
                "raw_content": "That's a rough looking 37",
                "author": "LibtardBusterMAGA"
            },
            {
                "raw_content": "liberals all look like fucking hobgoblins",
                "author": "Brownwaterboys"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Since Trump took office, all new jobs have gone to native-born workers",
        "score": 810,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Impossible. I have heard for a good portion of my adult life that illegals are only doing jobs that American workers won't do.... If this information is true, then American politicians since at least Clinton, have been lying to me? Someone fetch my salts.",
                "author": "Taylor3006"
            },
            {
                "raw_content": "X Doubt",
                "author": "Doritalos"
            },
            {
                "raw_content": "Feel like this is statistically impossible There's absolutely no way a single foreign born person has gotten a job here. And that would include naturalized citizens.",
                "author": "Politoed"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING NEWS: Numbers released today show that the United States of America has the lowest Trade Deficit since 2009, and going even lower.",
        "score": 1474,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pray that Chief Retard Roberts and pearl clutcher ACB don't sell us down the river.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "I have to admit, everyone thought 5 percent was virtually impossible. If what he's saying is correct and we could get to 6.5-7...that's actually the kind of growth we would need to pay off the national debt. If Congress would back him, it would be even bigger. Couple that with tariff income, fraud elimination, oil from Venezuela, abd we could be solvent in years, and not decades. Honestly, America deserves what it gets if it accepts anything less going forward. Trump is literally proving the concept.",
                "author": "Madnote1984"
            },
            {
                "raw_content": "Tariffs make it generally more profitable to build in America than import foreign goods. It takes 24/7 propaganda, online shilling, and TDS to bury your head in the sand and ignore this obvious fact. Meanwhile, foreign companies trying to retain U.S. market access are forced to reduce prices to offset the tariffs. So those exporting companies absorb the tariff, effectively paying the U.S. government for market exposure, which is exactly what Trump has been saying all along. The braindead libertarians and leftists mocking that the costs would just be passed down to consumers are still in denial and will be for years to come.",
                "author": "dunkeaters"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING NOW: Radical leftists have built BARRICADED ENCAMPMENTS and blockades around the exact spot in Minneapolis where Renee Good tried to MURDER an ICE agent by running him over! This is full-on ANARCHY. Minneapolis is turning into 3rd World Trash.",
        "score": 715,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Snow plow",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "CHAZ/CHOP 2.0.",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "The administration needs to stop engaging with these agitators. Just arrest every single one that gets in the way of an ICE agent and charge them with Federal obstruction of justice. Throw them in the DC gulag where the J6ers were kept.",
                "author": "DelendaEstMarxismo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The first government building in Iran’s capital, Tehran, has been set ablaze. 🔥",
        "score": 948,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MAKE IRAN PERSIA AGAIN!",
                "author": "h203h"
            },
            {
                "raw_content": "Good.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Why is Polymarket tweeting this? Are that many people betting on it?",
                "author": "mygovisacommie"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Two people have been shot by U.S. Customs and Border Patrol agents in Portland, OR, per the FBI",
        "score": 1245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Two is better than Juan",
                "author": "SpaceWizard"
            },
            {
                "raw_content": "It’s going to get hot, but the administration can’t give in. Otherwise the country is lost. If the left rallies and ICE & CBP retreat with their tails between their legs, it will be open season on destroying the country.",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "Surprised this shit hasn't happened sooner and the left and the media are to blame",
                "author": "America_No_1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Protesters in NYC call for the hanging of Secretary Kristi Noem and the execution of ICE agents, in footage shared by @ScooterCasterNY. The mob also started chanting \"F*ck Charlie Kirk.\" \"Kristi Noem will hang... Save a life, kill an ICE... F**k Charlie Kirk.\"",
        "score": 856,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can we get this over with yet? I'm ready for these people to be un-alived.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Trump is too afraid to invoke the Insurrection Act sadly. He still thinks this can be won without thousands of deaths.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "If they think ICE are bad guys for what they are ok with doing I'd hate to hear what they think about me.",
                "author": "f_bastiat"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Winter sucks, sure, but can't you just MOVE to where there's no snow?",
        "score": 660,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Try that in a small town.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Imprison them in Greenland so all they know is ICE",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Threatening the lives of ANY law enforcement is AGAINST THE LAW AND INCITING TERRORISM",
                "author": "Justlooking250"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A Minneapolis McDonald's has posted a sign banning ICE agents from entering the restaurant, reading “No ICE,” and a hired security guard out front. Guard: “This is private property, so you can't just break the law because you're a federal agent.”",
        "score": 1258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like someone is going to lose their franchise. All to sell some shitty burgers to local retards. Edit: Yeah, ok, people. Autocorrect and I are not friends.",
                "author": "VanDeKoik"
            },
            {
                "raw_content": "Wait, rules and regulations on who can freely enter? Sounds familiar...",
                "author": "stealthboy"
            },
            {
                "raw_content": "I'd love to see that dipshit try to stop some ICE agents from entering",
                "author": "Hemlock81"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Absolute chaos in Tehran as the Iranian government cuts off internet and cell service amid uprising",
        "score": 1249,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Everyone with a pulse saw this one coming",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "Gotta love the upcoming downfall of these POS Iranian terrorist thugs who killed a lot of American troops in Iraq and bragged about it. However, I hope Israel will be the one bombing them if it happens and not us. Save our boots and bombs for Greenland, Venezuela, and Cuba, if necessary. Let the Eastern Hemisphere countries do all the fighting in the Eastern Hemisphere.",
                "author": "possibletower"
            },
            {
                "raw_content": "Currency collapse ends nations.",
                "author": "Tardigrade"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Denmark out here trying to beat Maduro's capture speedrun time...",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Interesting how last year Pepe was about family values, chocolate milk, and chicken nuggies. This year Pepe is about global conquest and a $1.5 trillion military.",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "\"America Land\" I LOVE the rename, Pede!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I want to vacation in their capitol, New Trumpland.",
                "author": "Puppy528"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "C://",
        "score": 1147,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Got the new update and talking points.",
                "author": "TaxDollarsHardAtWork"
            },
            {
                "raw_content": "Bro it's C:\\",
                "author": "Ikewin32"
            },
            {
                "raw_content": "Vehicular theyslaughter",
                "author": "RockyBalboa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sortor: JUST IN: Deranged leftists are now JUMPING IN FRONT of ICE vehicles outside the federal facility in Minneapolis",
        "score": 1470,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You do realize this will be the excuse they use to start opening fire on ICE agents. Because ramming someone standing in front your vehicle is now \"justification\" for shooting the driver, using their perversion of logic.",
                "author": "ConvergenceMan"
            },
            {
                "raw_content": "So run them over",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "This has to be some kind of suicidality. These progressives are mostly depressed and miserable so maybe they think becoming a martyr is the best they'll ever achieve?",
                "author": "c_programmer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia RTX 60 GPUs might not arrive until 2027, Jensen says neural rendering is the future | Server-first strategy could leave gamers waiting years",
        "score": 333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Plenty of time for AMD to catch up! ...sigh",
                "author": "mi__to__"
            },
            {
                "raw_content": "At this stage neural rendering is going to be imagining you're playing the game because GPU prices are obscene and the cloud model abusive. Gotta go, I'm going to neural render GTA VI.",
                "author": "SenKats"
            },
            {
                "raw_content": "It seems like the 5000 serie won’t cut it for Neural Rendering from how Jensen is talking about it...",
                "author": "MyUserNameIsSkave"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "VideoCardz: \"Exclusive: Intel readies Core G3 \"Panther Lake\" series for gaming handhelds, up to 12 CPU cores and 12 Xe3 GPU cores\"",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Could also be used in budget gaming laptops you think? Like, a $800 thing with a 1080p screen?",
                "author": "Uptons_BJs"
            },
            {
                "raw_content": "2+8+4+12 on a single compute tile is pretty much buffed Lunar Lake, or Wildcat Lake that also has IGP on compute tile. Depending on workload hinting, this looks ideal for handheld; P core for burst workload like shader compile or ST-focused game, E core clusters for sustained all core frequency at low power and LPE for anything that barely uses power. If this is derived from Wildcat Lake, there shouldn't be too much unused PCIe lanes and probably the possibility of DDR5 support rather than just LPDDR5.",
                "author": "h_1995"
            },
            {
                "raw_content": "Meh. Without TDP info and gaming benchmarks there's really nothing to see here. I'd love to see a newer, more powerful steam deck that is a sizable jump in performance, but I'm just not sure this is it.",
                "author": "lordmycal"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD claps back at Intel claims that it uses ‘ancient silicon’ in PC gaming handhelds",
        "score": 414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean… intel is not wrong. They’re still on rdna3 for their top apus. Amd used vega for so long before finally adding rdna2 to apus 2 years after rdna2 launched. They’re skipping rdna4 for apus too. Amd is always behind on the gpu tech used in its mobile chips. Intel is right. They’re putting old tech gpus in their apus. Competition is good. Panther lake looks promising",
                "author": "EnigmaSpore"
            },
            {
                "raw_content": "Amd bro, z1e and z2e have barely performance improvements",
                "author": "Liatin11"
            },
            {
                "raw_content": "> you have all this baggage that Panther Lake is going to carry around its chiplet architecture That's hilarious, Intel once mocked AMD about the Infinity Fabric being just glue and now AMD is poking fun at Intel's chiplets, oh how the turn tables.",
                "author": "X_m7"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD talks FSR \"Redstone\" plans, Linux support, and AI bundle",
        "score": 38,
        "text_content": "",
        "comments": [
            {
                "raw_content": "His statements on Linux were incoherent rambling. Literally was asked about adding adrenaline overrides or w/e and other features to Linux and said there is a library on Windows. OK then.",
                "author": "BlueGoliath"
            },
            {
                "raw_content": "Props to Adam for asking about FSR4 on RDNA3 and if they will continue to lock new features away from older GPU's. Sad by the response though as they continue to deny INT8 version of FSR4 for RDNA3 and his response did not give me confidence they will not do the same for RDNA4 when RDNA5 launches.",
                "author": "dororodo30"
            },
            {
                "raw_content": "Starting around 9min, Adam is really trying to squeeze out Andrej Zdravković (SVP for GPUs at AMD) for information regarding older RDNA cards if Redstone or even parts of it (upscaling) can be available to which his response is pretty unconvincing. Adam asks if there could be some sort of beta branch for RDNA3 to which the response was along the lines of, \"no plans but thanks for the hint... if you could help us define it as a prototype that'd be great\" lmao [FSR Redstone FG can already be enabled in Linux](https://www.reddit.com/r/radeon/comments/1pqm4iv/fsr_4_fg_works_on_rdna_3_through_the_same_fp8/), hell even before the 9min mark, the question before that, Adam asks, \"how do you feel about the hacks people or using to get FSR 4 on prev RDNA\" and he says \"all power to them\". So he's aware of it working, but can't comment further about the availability of it. Here's also another talk with him on the matter: [https://www.tomshardware.com/pc-components/gpus/amd-hints-at-officially-open-sourcing-fsr-4-upscaling-and-frame-generation-technology-in-the-wake-of-accidental-release-accidental-release-may-have-forced-the-companys-hand](https://www.tomshardware.com/pc-components/gpus/amd-hints-at-officially-open-sourcing-fsr-4-upscaling-and-frame-generation-technology-in-the-wake-of-accidental-release-accidental-release-may-have-forced-the-companys-hand) >[Chips and Cheese's](https://chipsandcheese.com/) George Cozma asked Zdravković if an open-source release was in the cards. The software head responded that the accidental public release in August was unexpected, but that it intends to release the source for the FSR4 library while keeping the core technology closed, so as not to give Nvidia engineers an advantage. >He continued by stating that AMD intends to \"work as openly as possible,\" and was then asked to be specific about FRS 4's open release. Zdravković then said \"that's the long-term plan,\" seemingly corroborating an earlier remark that \"open sourcing is in \\[AMD's heart and mind\\]\".",
                "author": "Noble00_"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inside Intel - The Future Of PC Performance, Panther Lake, Multi-Frame Gen",
        "score": 81,
        "text_content": "It’s time for a big CES 2026 interview! Intel's Tom Petersen is a legendary figure in the PC hardware space, having spent decades at Nvidia before moving onto Intel. Once again, we're talking tech with TAP, discussing Panther Lake, frame generation, multi frame generation, the actual future of PC \"performance\", Intel's new anti-stutter strategy, frame-pacing, Linux and much, much more. 00:00 Introduction: Where is Big Battlemage? 00:40 XeSS 3: Multi frame gen and the future of game performance 08:29 Stuttering: animation error, shader compilation stutter, and communicating game performance issues 19:32 Super resolution: XeSS labelling, cross-vendor SR, combined SR and denoising 24:49 Frame pacing analysis, path tracing on Arc GPUs, Linux support 28:41 The future of graphics rendering, monitor innovations, DirectStorage 35:02 Handhelds: Panther Lake, Xbox Full Screen Experience, Switch 2",
        "comments": [
            {
                "raw_content": "Seems like we're not the only ones that think FG isn't ideal rn. I really hope Intel succeeds in their efforts to pair Framegen with reprojection, but it'll prob be NVIDIA that gets there first. Might be the killer app for 60 series, but pure speculation of course. The stuff about using AI to smoothe frames is interesting as well. Things prob gonna change a lot in the coming years. We'll see if it's for the better.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "Interesting, GN usually gets Tom to do discussions like these but instead decided to publish whatever that previous video was on 'Intel pulling an Nvidia'. I bet GN will probably have their own video with Tom, but I appreciate DF a little bit more with this discussion. At around 21min, it's interesting to hear his talk on cross-vender SR, mentions how they'd like to work more on Nvidia's Streamline and a candid talk about DirectSR and how it isn't really the concrete solution for the work on cross vendor SR. At around 23min, Alex brought up something interesting about research they've published before on joint denoiser and SR. He kinda skirts around it, but continues on suggesting they have more plans on it. He also then continues on the state of PT, DXR 1.2, obviously it isn't a real focus with something on their iGPUs, but any future HW, will be their primary goal to tackle. Alex mentions Valve/Linux, and Tom says it isn't entirely their focus right now, at least for gaming.",
                "author": "Noble00_"
            },
            {
                "raw_content": "Are PC games becoming more stuttery or we're just paying more attention to it?",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exclusive: Nvidia requires full upfront payment for H200 chips in China, sources say",
        "score": 121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just in case the A.I bubble bursts midway, I imagine.",
                "author": "GenZia"
            },
            {
                "raw_content": "I thought Nvidia wasn't supposed to be selling to China.",
                "author": "airfryerfuntime"
            },
            {
                "raw_content": "That’s how transactions work yes.",
                "author": "jhenryscott"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "You can now get a the 28.2\" 4.5K 3:2 4500x3000 pixel (192 PPI) panel from the Surface Studio in a standalone monitor: Kuycon P20",
        "score": 131,
        "text_content": "Back in late 2016 the Microsoft Surface Studio launched with an eye-watering 28.2\" 4.5K 3:2 4500x3000 pixel (192 PPI) panel. You had to buy the whole computer though, while everybody wanted a standalone monitor. Basically the first reaction from everybody was: [I want a Microsoft Surface Studio monitor](https://www.theverge.com/2016/11/2/13493170/microsoft-surface-studio-monitor-gaming-potential). And now, almost a decade later, that might finally be possible: [Kuycon P20](https://clickclack.io/collections/kuycon-monitor/products/kuycon-monitor-p40k-40-inch-5k-ultra-wide-nano-ips-monitor) puts those exact specs (and maybe even the same panel, although they claim IPS Black) in a monitor. Initial review of other Kuycon monitor from [ClickClack.io](http://ClickClack.io) are great: * [https://www.reddit.com/r/HiDPI\\_monitors/comments/1pgv9l9/my\\_experience\\_with\\_the\\_kuycon\\_g32p/](https://www.reddit.com/r/HiDPI_monitors/comments/1pgv9l9/my_experience_with_the_kuycon_g32p/) * [https://www.reddit.com/r/HiDPI\\_monitors/comments/1pftxte/just\\_ordered\\_the\\_kuycon\\_g32p\\_from\\_clickclack/](https://www.reddit.com/r/HiDPI_monitors/comments/1pftxte/just_ordered_the_kuycon_g32p_from_clickclack/) * [https://www.reddit.com/r/HiDPI\\_monitors/comments/1pxzn9v/my\\_experience\\_color\\_calibrating\\_kuycon\\_g32p/](https://www.reddit.com/r/HiDPI_monitors/comments/1pxzn9v/my_experience_color_calibrating_kuycon_g32p/) $799 seems like a very fair price. It claims to have an IPS Black panel, does support 99% DCI-P3, HDR600 and includes 100 watt charging over USB-C. |**Feature**|**Specification**| |:-|:-| |**Resolution**|**4.5K UHD+ (4500 x 3000)**| |**Aspect Ratio**|**3:2 (Productivity Focused)**| |**Pixel Density**|192 PPI (Retina-Grade)| |**Panel Type**|IPS with **ATW Optical Compensation**| |**Color Depth**|Native 10-Bit (1.07 Billion Colors)| |**Color Gamut**|99% DCI-P3| |**Brightness**|500 nits (Peak)| |**HDR**|**HDR600**| |**Refresh Rate**|**60HZ**| |**Contrast Ratio**|**1500:1**| |**Connectivity**|**1x USB-C (100W PD)**, 1x DP, 1x HDMI, 2x USB-C (Data)| |**Material**|Aluminum Alloy Honeycomb Back| 192 PPI is a tad lower than the 218 PPI from recent 5K and 6K monitors, but that might make working on 200% scaling more comfortable for some. They also have 27\" 5K and 32\" 6K options: * [https://clickclack.io/collections/kuycon-monitor/products/kuycon-g27p-5k-60hz-27-inch-ips-monitor](https://clickclack.io/collections/kuycon-monitor/products/kuycon-g27p-5k-60hz-27-inch-ips-monitor) * [https://clickclack.io/collections/kuycon-monitor/products/in-stock-kuycon-g32p-6k-32-inch-ips-black-monitor](https://clickclack.io/collections/kuycon-monitor/products/in-stock-kuycon-g32p-6k-32-inch-ips-black-monitor) Anyway, it's awesome to have more aspect ratios to choose from. 3:2 is also great for a vertical monitor. Can you imagine: Two vertical 4.5K 28\" monitors on the side, and a 32\" 6K monitor center?",
        "comments": [
            {
                "raw_content": "r/monitors would be interested in this",
                "author": "lcirufe"
            },
            {
                "raw_content": "Someone tell MattKC about this. [His video](https://www.youtube.com/watch?v=RQI_NmaDU5o) where he struggles to DIY this exact thing.",
                "author": "MrAntonov225"
            },
            {
                "raw_content": "The hinge was the biggest selling point of the Surface Studio screen to me. Being able to bring it right down to the desk in order to write on it was the USP. This is a cool display but it's still just a standard/static monitor",
                "author": "alexcutyourhair"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[SEMIANALYSIS] Apple-TSMC: The Partnership That Built Modern Semiconductors",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "10/10. Great read. TSMC wouldn't be where they are today without Apple.",
                "author": "Forsaken_Arm5698"
            },
            {
                "raw_content": "Literally don't understand how they calculate the cost of switching to a different foundry. $200 million and 1 year to \"re-calibrate\" PDK? PDKs are always tuned to the needs of the customer based on feedback, and any PDK is released in a non-final state. It is a continual process. Why would Apple need to \"re-calibrate\" if they go to Intel or Samsung with their requirements and then see who comes out with a PDK that ticks more boxes than the other? Makes no sense.",
                "author": "TwoTimeHollySurvivor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Your DDR5 Memory Could be at Risk! All About DDR5",
        "score": 28,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TLDW: DDR5 runs hot, get some airflow on it.",
                "author": "ryanvsrobots"
            },
            {
                "raw_content": "Yet another problem with ASUS firmware. After several years of firmware bugs and blatant security vulnerabilities I guess it's nice ASUS still remains consistent. The video makes me glad that I've always kept a fan pointed at the memory in my desktops since the piping hot DDR2 era. One can only hope vendors will get their act together and properly design a consumer friendly DDR6 standard with full ECC and clock drivers, same as server.",
                "author": "Kougar"
            },
            {
                "raw_content": "This is really important for users of AIOs. Depending on the case and position of the radiator there could be almost zero airflow over the memory. Traditional heatsinks usually are less susceptible to this but it's a good idea for anyone.",
                "author": "FranciumGoesBoom"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Even Dbrand taking shots at Nintendo.",
        "score": 1557,
        "text_content": "The subject of the email was “Nintendo just fumbled the bag” lmao. But honestly this is what Nintendo needs to be doing rather than the all black. Thoughts?",
        "comments": [
            {
                "raw_content": "Even? It’s their whole brand lol.",
                "author": "MXC_Vic_Romano"
            },
            {
                "raw_content": "I like the slick black with just hints of color, but having the option for solid colors is nice. Just sucks that people will have to pay extra to have them. Also it still doesn't match the inside of the console which drives me nuts. I know you can't see it when playing, but I still don't like it. I gotta find a way to remove those damn stickers lol.",
                "author": "OoTgoated"
            },
            {
                "raw_content": "Nintendo is likely doing them in black primarily to avoid confusing parents who think they're buying a Joycon 1 and vice versa. Sticking to mostly black only probably helps mitigate that a little",
                "author": "Online_Discovery"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I'm going the opposite direction here. I want new joycons that matches the pro controller. Light grey accents with light grey shoulder buttons.",
        "score": 484,
        "text_content": "It'll be nice to see the joycons match the pro controller.",
        "comments": [
            {
                "raw_content": "I like these!",
                "author": "KnightRoom"
            },
            {
                "raw_content": "Yeah I’d buy a pair",
                "author": "Hyperdragoon17"
            },
            {
                "raw_content": "I want Pro Joycons that are much larger and have built in grips and back buttons and match the Pro controller like this image. I just want chonky pro joycons.",
                "author": "RetroPandaPocket"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[OC] What I think the joycons should look like. Distinguishable from Switch 1 and you can see the colors",
        "score": 1422,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s what I had in mind perfect",
                "author": "Jellybananaman"
            },
            {
                "raw_content": "\"Too much color\" - Someone at Nintendo.",
                "author": "DrKrFfXx"
            },
            {
                "raw_content": "I miss colored buttons Nintendo. I pine for the GameCube design era.",
                "author": "Treviathan88"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "new switch 2 joycon inspiration confirmed",
        "score": 2792,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I mean it's also the vibe of the Switch2 ui. A lot of pink/lavender/sea green. Somebody at Nintendo likes Vaporwave aesthetic, and/or 90s \"Jazz\"",
                "author": "hobskhan"
            },
            {
                "raw_content": "Transformers Decepticon Trypticon! https://preview.redd.it/ekgsaqbih5cg1.jpeg?width=1200&format=pjpg&auto=webp&s=459efb96f750c37bcd446a02cf910a9683a54e74",
                "author": "ThrowAbout01"
            },
            {
                "raw_content": "Think I had a windbreaker in the 90s with that same design...😂😂",
                "author": "Acceptable-Funny-245"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New joy con 2 colours finally announced",
        "score": 2623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I swiped :/ Nice colors btw",
                "author": "AnimeRobotShow"
            },
            {
                "raw_content": "You can all thank me for finally giving up waiting for new colours and ordering a pair last week",
                "author": "coletrain93"
            },
            {
                "raw_content": "https://preview.redd.it/74lqq188f4cg1.jpeg?width=1320&format=pjpg&auto=webp&s=ddd4236964e4c9c402283de82de96037f89f68a2 And it looks like this when attached to the tablet. If you're in the market for extra joycons, why not. But what the hell.",
                "author": "staleferrari"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fire Emblem Path of Radiance added to NSO",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tbh I don't think you lot are actually ready for this one.",
                "author": "Retroagv"
            },
            {
                "raw_content": "Holy shit this is huge, this game is insanely expensive",
                "author": "GooBoi1"
            },
            {
                "raw_content": "One of the most expensive video games for no reason ever Now you finally won't have to give your left kidney for this one",
                "author": "Nas160"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "New joycons",
        "score": 482,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should either make the whole controller one color, or they should use the opportunity to make dual colored Joycons. Like if the purple Joycon had a pink shell instead of black, and the blue one had a green shell.",
                "author": "ZetsuboItami"
            },
            {
                "raw_content": "They really needed to go in harder with this \"highlight\" approach to joycons. Have the buttons and analog sticks match the color too...",
                "author": "mattbattmatt_yt"
            },
            {
                "raw_content": "I'm probably the only person that likes the design, I rather have just some parts with color than the \"toy\" looking joycons in the first switch, but it's true that most of the color in the new ones is hidden if you attach them",
                "author": "Akuma-1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I made a concept of what a coloured Pro Controller 2 could've been like! Would you rather have this or the light grey it's currently available in?",
        "score": 178,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Easily the light grey version",
                "author": "Strict_Donut6228"
            },
            {
                "raw_content": "I like it, but I’d go for two separate models with each having one of the colours (cyan or orange) on all the highlights — that way, when you have two, you can easily tell them apart.",
                "author": "KnightRoom"
            },
            {
                "raw_content": "Tbh this looks tacky and cheap, the real one looks sleek.",
                "author": "nawtbjc"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Shinobi602: There's a secret fourth game.",
        "score": 458,
        "text_content": "[Xbox Game Studios + Bethesda + ABK |OT36| Oops! All Obsidian OT | Page 215 | ResetEra](https://www.resetera.com/threads/xbox-game-studios-bethesda-abk-ot36-oops-all-obsidian.1310962/page-215#post-149812867)",
        "comments": [
            {
                "raw_content": "Obviously there's a secret game, you can clearly see space on the bottom left.",
                "author": "Brokenbullet14"
            },
            {
                "raw_content": "He said it was from one of their teams who released a game last year. I’d be willing to bet money it’s Double Fine. Tim said in an interview that they broke their company into multiple dev teams to make smaller games, very similarly to what they did after Brutal Legend with releases like Costume Quest, Stacking, etc.",
                "author": "Affectionate-Ad-4174"
            },
            {
                "raw_content": "Also, i think that he said that the secret 4th game will be from a studio who launched a game past year, however, he edited the post:[Xbox Developer\\_Direct 2026 Announced for January 22 @ 10am PT | Fable, Forza Horizon 6, Beast of Reincarnation | Page 6 | ResetEra](https://www.resetera.com/threads/xbox-developer_direct-2026-announced-for-january-22-10am-pt-fable-forza-horizon-6-beast-of-reincarnation.1400404/page-6#post-149812798)",
                "author": "Amornalx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Potential GTA 6 plot leak",
        "score": 1041,
        "text_content": "An interesting detail in the [recent IGN article](https://www.ign.com/articles/union-asks-judge-to-grant-fired-gta-6-devs-interim-relief-at-preliminary-tribunal-hearing-rockstar-denies-claims) about Rockstar dismissing employees for leaking information is that one of them was fired back in **November 2023**. Just a month before that happened, someone [made a post here](https://www.reddit.com/r/GamingLeaksAndRumours/comments/17ad683/gta_vi_plot_mechanics/) claiming to know plot details. It has a pretty good chance of being real, considering that the post includes the earliest mention of Jason picking up Lucia from prison. >**Plot** >I was surprised by my source when I was told that Lucia has a baby that she abandons at a delicatessen before heading out to a bank robbery and then getting arrested for doing such an act. It is not known if the baby was a boy or a girl and obviously, there will be no kids in the game, this only happens in a cutscene as a flashback of the past, I have no information about what happens to this baby after this point. >After a few years, Lucia gets released on probation, **she’s picked up at the prison by Jason** who’s planning a robbery with her, and they’ll fall in love with each other after some time. >The majority of the planning for the missions takes place at a nightclub called “Vault”. >In the very first mission of the game you control Jason and you have to follow a plane that is about to land and carries a Russian drug dealer. Apparently, Jason meets this guy and starts to plan a mission to steal drugs. In this drug stealing mission, they are chased by the police and the drug ends up falling into the ocean. There is a following mission where they will have to dive to retrieve it. >**Mechanics** >There is a new mechanic for detecting threats and valuable items around you, this is not a special ability like Franklin’s ability to drive cars with a special handing, this is a new mechanic that seems to be somewhat inspired by the dead eye targeting from RDR2, this mechanic is revealed in the Hanks’ Waffles dining robbery, present in the leaked videos. >Rockstar has also been focusing on very detailed mechanics of searching places, this one seems to be also inspired by a mechanic from RDR2. >That’s all I can reveal for now guys. Again, please come back to this thread when the game gets released and after Rockstar releases a teaser trailer as it will potentially include some of the information I said here.",
        "comments": [
            {
                "raw_content": "It's really hilarious to see old leaks that turned out to be true but got wrecked by the comments in their time",
                "author": "Sea-Country8245"
            },
            {
                "raw_content": "I remember years ago the rumor that her story started after her kid was taken away / wanting to get her child back, but falling into a life of crime",
                "author": "Maybe_In_Time"
            },
            {
                "raw_content": "Maybe the baby is the character you go on to create in GTA Online 🤣",
                "author": "ZypherPunk"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Another Polish Site confirms new, third expansion for Witcher 3",
        "score": 569,
        "text_content": "Source: [https://www.ppe.pl/news/395072/trzeci-dodatek-do-wiedzmina-3-rozegra-sie-w-zerrikanii-ujawniono-mase-konkretnych-szczegolow.html](https://www.ppe.pl/news/395072/trzeci-dodatek-do-wiedzmina-3-rozegra-sie-w-zerrikanii-ujawniono-mase-konkretnych-szczegolow.html) (It’s the same source that first called Microsoft Flight Simulator coming to PS5 and the DOOM: The Dark Ages disc being essentially empty) Translation: Speculation regarding the return of Geralt of Rivia and his adoptive daughter, Ciri, is intensifying, with the latest reports suggesting that 2026 could be a milestone year for fans of the universe created by CD Projekt RED. It all started with a high-profile report from Noble Securities analysts, who are forecasting the release of a massive, paid expansion for *The Witcher 3* or a standalone project on a scale similar to Sony’s *Spider-Man* spin-off, *Miles Morales*. This project would reportedly serve as a narrative bridge between the third game and the upcoming new saga, while also allowing CD Projekt RED to hit key targets in their corporate incentive program. # Potential Details for the Third Witcher 3 DLC Crucially, IGN Poland has confirmed that whispers of such an expansion have been circulating behind the scenes for years, though they were kept strictly confidential until now. We at PPE can also verify these revelations - our own sources tipped us off about a new *Wild Hunt* project a year ago. In the first half of 2025, we were explicitly told that *The Witcher 3* would receive massive new content that fans \"will absolutely love.\" As of today, CD Projekt RED has not officially commented on these reports, but notably, they have not denied them either. According to information disclosed by IGN (details we hadn't personally heard, suggesting the project may have evolved over the years), developers might have planned a journey in an entirely new, exotic direction long ago. While many players are looking toward the frozen North, the studio’s original plans allegedly pointed toward Zerrikania. After the mud of Velen and the fairytale atmosphere of Toussaint, a sandy desert with a scorching sun and a distinct culture would be a massive breath of fresh air - effectively a \"Witcher in a *Dune*\\-like setting.\" The Zerrikania theory gains weight when examining clues hidden within the game and supplemental materials. One of the strongest arguments involves the Manticore School, the diagrams for which Geralt discovers in the *Blood and Wine* expansion. The school’s headquarters are located in the East, on the edge of the desert. Interestingly, lore for \"The Witcher TTRPG\" mentions that this school was the only one to experiment with the Trial of the Grasses on women. This opens a fascinating narrative door for Ciri - an expedition to Zerrikania could be her chance to undergo mutations safely, which would explain her appearance in the teaser for the new saga. Further \"seed-planting\" for this direction can be found in Letho of Gulet’s dialogue. If the Kingslayer survived in your save file, he explicitly declares his intent to leave for Zerrikania, seeking peace in its matriarchy, far from the political quagmire of the North. We also shouldn't forget the upcoming Witcher 1 Remake. The main antagonist, Azar Javed, hailed from Zerrikania. Returning to his homeland in a new DLC would be a brilliant marketing move, tying together CD Projekt RED’s legacy and future titles ahead of both *The Witcher 4* and the od-school remake. # What About Kovir and Poviss? The alternative to desert sands remains the freezing Kovir and Poviss, often called the \"Venice of the North.\" The vision of snow-covered palaces, canals, and the Northern Lights on an upgraded engine sounds like a graphical masterpiece. It would be the perfect setting for a political thriller in a land of spies and extreme wealth. However, this direction seems risky from a marketing perspective. Since *The Witcher 4* is expected to take us to frigid regions, releasing a snowy expansion for *The Witcher 3* right before the new saga could rob the sequel of its freshness and spoil the \"wow factor\" of the new location. There is also a hard technical reality weighing against Kovir. Building the complex architecture of cities like Pont Vanis from scratch on the old REDengine, only to have to recreate the same thing in Unreal Engine 5 for the new saga, seems like a waste of resources. Consequently, Zerrikania appears to be a much safer and more interesting testing ground that could offer players something never before seen in the *Witcher* world - epic encounters with massive beasts that are worshipped in that region. Regardless of whether we end up donning furs in Kovir or fighting under the desert sun, 2026 is shaping up to be a massive celebration for fans of Geralt and CD Projekt RED. Based on recent reports, the studio must release something significant in the coming months to meet its financial obligations. The fact that so many independent sources - from analysts to IGN to our own findings here at PPE - confirm that something new is in the works makes it almost certain that CDPR is preparing a return we didn't see coming. A sales target of 11 million units requires boldness, and an expedition to the exotic Zerrikania would certainly qualify as a bold move.",
        "comments": [
            {
                "raw_content": "this is genuinely so peak man just give us Iorveth and Saskia side quest in there and my life is yours",
                "author": "Mk221999"
            },
            {
                "raw_content": "I know it won’t happen but getting another set of physical gwent cards in the big boxes to go alongside with the codes for this expansion would be great",
                "author": "TNWhaa"
            },
            {
                "raw_content": "Important context: PPE is seen as the most trashy and clickbaity gaming website from the big ones in Poland. [Gryonline.pl](http://Gryonline.pl) is established website with good journalists and CD-Action still prints on paper. PPE however is focused on making as many articles as possible in short time. They publish hilarious clickbaits and have overall poor writing quality. Take a look at these: [\"Boobs and booty of Lucia in GTA 6 will be moving precisely\"](https://www.ppe.pl/news/394728/piersi-i-pupa-lucii-z-gta-6-beda-dokladnie-sie-ruszac-tworca-uchyla-rabka-tajemnicy.html) [\"Cyberpunk 2077 hits billion downloads!\"](https://www.ppe.pl/news/394843/cyberpunk-2077-z-miliardem-pobran-cd-projekt-red-goni-bethesde.html) **This report can be true because PPE tries to actively gather information. We are in Poland, after all, journalists know CD Projekt workers. But please take it with huuuge grain of salt.**",
                "author": "umotex12"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Dell XPS 2026 benchmarks (I was at CES)",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Worth noting here that 1, performance review embargo is not over yet, and 2, device manufacturers can still be tuning things. They shouldn't be, but that's still a pre-release device right there. Notice that the maximum frequency listed here is 3882mhz. 3.9ghz. Not the 4.8+ that the chip should be able to hit. It's possible an E-core was checked for maximum clocks for some reason, but between that and the fact that PTL is not appearing as a 3-cluster chip makes me think geekbench might not be detecting things quite right.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "I'm so incredibly curious to learn more about Panther Lake. Most interesting launch since Zen 3?",
                "author": "mmcnl"
            },
            {
                "raw_content": "Stop using Geekbench, it’s a rubbish benchmark. Run cinebench 2024 or r23 to actually see what it can do. Geekbench doesn’t stress the system enough, it’s literally optimised for ARM machines.",
                "author": "Crap-_"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel shows off Arc B390 graphics in games: \"playable at 1080p with XeSS\"",
        "score": 75,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wonder if Valve would be considering Panther Lake for a Steam Deck 2. It sounds like a generational leap from RDNA2 (which is what they were looking for), and can be cheap enough for valve to slightly subsidize the cost. I guess the main thing is the power envelope. I think Valve is only interested in making handhelds that deal with a 15W TDP or lower",
                "author": "SSSl1k"
            },
            {
                "raw_content": "Series 3 seems like the biggest Intel W in a long while. Plays AAA games at 45-60fps with upscaling, and all other games at native at 60+. Not to mention this is 50% faster than AMD's equivalent HX370 while being massively more power efficient. There's also already laptops listed on sites like Best Buy for reasonable prices (sub $1300). Compare this to the AI 395 from AMD that can't be found for less than $2500 while being significantly less power efficient. Granted, that APU isn't really comparable.",
                "author": "coyotepunk05"
            },
            {
                "raw_content": "the handhelds with these chips are going to slap. Also people gotta remember that using upscaling on smaller screens especially 7-9 inch screens is a lot more tolerable. and these benchmarks are of triple A titles, monster hunter wilds is a dogshit unoptimized game, and people will be playing a mixture of game from older titles, indies, emulation etc.",
                "author": "DannyzPlay"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Best bang for the buck Panther Lake cpu?",
        "score": 34,
        "text_content": "The Intel Core Ultra 5 338H has a B370 GPU with 10 Xe3 cores, and 12 CPU cores (4+4+4). How do you think this compares with higher end options like the Core Ultra X7 358H?",
        "comments": [
            {
                "raw_content": "I'm surprised it's not marked as an X5, to be honest. It has the big GPU, or rather 83% of it, and still more CPU cores than the rest of the lineup. I think this is going to be a banger chip for handhelds, and for most laptop users, but personally I'm looking at those 16-core X7s. 358H looks like what I'll probably end up with in my next laptop.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "X7 358H is more or less the go I reckon. As usual, 9-series is swinging wallet rather than really being that great of an improvement.",
                "author": "RJsRX7"
            },
            {
                "raw_content": "This is what we want [https://www.intel.de/content/www/de/de/products/sku/245527/intel-core-ultra-x7-processor-358h-18m-cache-up-to-4-80-ghz/specifications.html](https://www.intel.de/content/www/de/de/products/sku/245527/intel-core-ultra-x7-processor-358h-18m-cache-up-to-4-80-ghz/specifications.html)",
                "author": "MPHxxxLegend"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD is unfazed by Panther Lake's big integrated GPU - 'It's not even a fair fight' to compare the Arc B390 to Strix Halo, AMD exec claims | Tom's Hardware",
        "score": 104,
        "text_content": "AMD SVP downplayed Intel's new iGPU while AMD didn't deliver anything new at all. Strix Halo is in another class but it's old architecture, same as Strix Point but that is in the same league and is losing. AMD never really won the mobile market, and with this kind of attitude I think it won't catch up. What do you think?",
        "comments": [
            {
                "raw_content": "I'll believe them (either Intel or AMD) when I see the benchmarks. Until then this is all just pointless noise.",
                "author": "CatoMulligan"
            },
            {
                "raw_content": "well yeah you can't compare them because strix halo is on a signficantly larger die wheras panther lake is more comparable to something like the hx370. If amd is able to get strix halo at a competitive price then sure it will compete but the issue is that with such a large die I don't think it is possible for them to compete in price with panther lake",
                "author": "Open_Map_2540"
            },
            {
                "raw_content": "I’ll never understand why AMD is not committing to design RDNA4 based APUs and at this point I just take RDNA 3.5 as a joke because they can’t even support FSR4 on it officially nor the RX 7000 cards. It’s like they are losing on purpose",
                "author": "MrGunny94"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD introduces Ryzen AI Embedded P100 (Strix Point/Krackan) and X100 (Strix Halo) series",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So they tried to NOT release it for desktops to save their video card business and then the Chinese took the Strix Halo and put it into mini pcs which meant the big computer companies lost out to selling them to consumers. Now they are making desktop chips because everyone is upset with them. At least it will decrease the current rip off prices for the Strix halo mini pcs in the future, albeit distant future…",
                "author": "Jdpham76"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon RX 9070 XT-based ONEXGPU 3 external graphics is limited to 180W",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "9070XT with a 9070 BIOS or just 9070, -20% power limit, put in an x4 slot/mode",
                "author": "J05A3"
            },
            {
                "raw_content": "Why not just use a 9070 instead?",
                "author": "AreYouAWiiizard"
            },
            {
                "raw_content": "Not necessarily a bad thing. I tried playing with the power limit set to the minimum on my 9070XT and I was surprised how little performance it lost. And the card was dead quiet while only drawing 200W or so. Hopefully they will put a decent heatsink on it so that it will be silent.",
                "author": "VTOLfreak"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Trump drafting executive order allowing people dip into retirement to pay for homes",
        "score": 284,
        "text_content": ">President Donald Trump’s team is reportedly drafting an executive order on affordability that would push to allow people to dip into their retirement or college savings accounts, without penalties, for a down payment on a home.",
        "comments": [
            {
                "raw_content": "Any solution that involves allowing buyers to get their hands on more cash will just drive prices higher.",
                "author": "Crazyboreddeveloper"
            },
            {
                "raw_content": "Shit must be bad if they’re going to sacrifice the stock market for the housing market.",
                "author": "RealLoan8391"
            },
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Trump orders his representatives to buy $200 billion dollars in mortgage bonds",
        "score": 258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "> \"I am instructing my Representatives to BUY $200 BILLION DOLLARS IN MORTGAGE BONDS. This will drive Mortgage Rates DOWN, monthly payments DOWN, and make the cost of owning a home more affordable,\" Trump wrote. Can someone please explain to me how buying $200 billion in mortgage bonds drives down mortgage rates?",
                "author": "Aggressive_Chicken63"
            },
            {
                "raw_content": "We need more supply not more demand!!",
                "author": "stonkstogo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Everybody wants to know",
        "score": 37,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good thing that nobody filed bankruptcy before the late 00s. We should go back to that economy.",
                "author": "Loud-Change4285"
            },
            {
                "raw_content": "I mean, why not? It looks like we are past the point in America when 1- borrower buys thing, with a loan 2 - borrower works hard to pay back loan 3 - borrower owns asset outright Now, its take on as much debt as possible, enjoys spoils of the loan. If it goes bad, can’t repay the debt, run away. No repercussions. What was learned from 2008-2009, except to make the price of a thing so high, that only the 5% could even qualify to buy (and often, don’t need a loan at all to buy in the first place). What have we learned?",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Nothing ever happens",
                "author": "mattjouff"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "More than half of US metros now seeing home prices fall as national average drops below key level",
        "score": 133,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It’s progress toward a national correction down from the highs of the Covid-era zero rate policy, but not meaningful. If there’s already “panic” by anyone over dropping home values, that panic needs to be quelled STAT. A correction was and still is needed. So far, it’s been delayed and softened by all parties with an interest in keeping everything high and going higher, which only exacerbates the problem. Delays the inevitable. Slow, small, progress so far. Much more needs to be done, or allowed to be done.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "From the article: > For the first time in nearly three years, the median US listing price has also slipped below $400,000, a key psychological level that had held firm since the pandemic boom, according to Realtor.com. > While prices are down 0.6 percent nationally, that average disguises much steeper falls across large swathes of the country. > Worst is Austin, TX, where prices have plunged 7.3 percent over the past year to $462,000, the biggest drop of any major metro. > The pain is spreading well beyond Texas. Prices are down 6.7 percent in San Diego, CA slipping to just under $900,000, while nearby San Jose has seen values fall 5.5 percent to $1.19 million.",
                "author": "DustyCleaness"
            },
            {
                "raw_content": "People complained for years that housing was too high and now we are starting to see a downtrend, but they have much further to fall. Prices are where demand meets supply.",
                "author": "Darth_Thunder"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Institutional investors only own 3% of Single Family Homes",
        "score": 67,
        "text_content": "That's over 5 million homes. We have a 6 million home shortage. Talking heads keep saying that since corporations only own 3% it's not a big deal. WRONG. The market price for anything is not determined by what is owned but by what is bought. And institutional investors have bought about 40% of homes in the last few years. Those who try to distract with the 3% stat know this and the argument against is showing that they have an interest in misdirecting about it. Really pisses me off. Look at stocks. You know how many stocks it takes to establish the latest price? The last one. That's it. It's basic economics and anyone deliberately trying to direct you away from the market and toward ownership statistics is trying to fool you.",
        "comments": [
            {
                "raw_content": "I just scroll past any comments that say “institutional only owns x%!” Institutions are clustering where they buy. College towns. Vacation towns. Big cities. 6 million houses. Just releasing these back into the market has an even larger impact on everything else. Institutions have the same kind of control on that asset class that they have on common stocks. They own enough to dictate valuations overall. This is the impact of having those homes go back to the buying public. ENOUGH with the argument of the small relative percentage they own. It’s enough to sway valuations in the asset class overall.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "If you look back, proposals are out there to limit investors to 300 SFHs. The prediction is that you will just see a lot of companies owning 300 SFH each ... So I expect little impact in the end.",
                "author": "Cute-Temperature5440"
            },
            {
                "raw_content": "Source for the 40% claim nation wide?",
                "author": "MeetYouAtTheJubilee"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "About 3 in 4 millennials (72%) say homeownership is still part of the American dream, but 41% think they'll be the last generation in their family to afford a home purchase.",
        "score": 41,
        "text_content": "[https://cleveroffers.com/research/millennial-home-buyers-2026/](https://cleveroffers.com/research/millennial-home-buyers-2026/?utm_source=reddit&utm_medium=reddit&utm_campaign=millennial_homebuyers_2026)",
        "comments": [
            {
                "raw_content": "Essentially what you’re going to see are people never selling their homes- and homes will stay in within families for generations. I’m already planning to never sell my home so I can pass it down",
                "author": "Freudianslip1035"
            },
            {
                "raw_content": "I’m part of the 41%. I don’t have kids.",
                "author": "Speedyandspock"
            },
            {
                "raw_content": "Absurd. Boomers will die and younger generations will inherit, downward pressure will be put on the market. Home prices will not increase rapidly over the next decade",
                "author": "Losalou52"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The quiet housing market flip nobody is talking about",
        "score": 13,
        "text_content": "U.S. housing market may finally be showing signs of thawing.",
        "comments": [
            {
                "raw_content": "No.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Silver lining as social unrest reaches a boiling point, at least I can afford a home!",
                "author": "ThisIsntOkayokay"
            },
            {
                "raw_content": "Hilarious",
                "author": "mps2000"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "House on Market for 7 months - this has ruined my life",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When I initially read their post, I thought it was pretty reasonable. Then I saw OPs comments. She is only in so much debt because she refused to lower the price for 7 months. Now she needs that price to cover the debt she incurred due to her own greed.",
                "author": "SureMycologist4719"
            },
            {
                "raw_content": "My market has tons of rentals. No one wants to sell for a penny less in profits than they think they are entitled to. Instead they list it for rent and it sits for 6 months and counting with no occupant.",
                "author": "2manyhobby"
            },
            {
                "raw_content": "Blaming the realtor, lol",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Atlas has its own moves",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://i.redd.it/9hquzmt9d7cg1.gif",
                "author": "tired_fella"
            },
            {
                "raw_content": "Literally if they stuck with this version for 5 years and just focused on software updates I really don’t see how this wouldn’t take over a ton of warehouse jobs in small to medium sized businesses",
                "author": "ZenCyberDad"
            },
            {
                "raw_content": "Good they don't made it more human like, it would be uncanny valley maximiser",
                "author": "chlebseby"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Terence Tao's Write-up of GPT-5.2 Solving Erdos Problem #728",
        "score": 274,
        "text_content": "In the last week, me and AcerFur on X used GPT-5.2 to resolve Erdos Problem #728, marking the first time an LLM has resolved an Erdos problem not previously resolved by a Human. I did a detailed write-up of the process yesterday on this sub, however I just came to find out Terence Tao has posted a much more in-depth write-up of the process, in a more Mathematics centric way. [https://mathstodon.xyz/@tao/115855840223258103](https://mathstodon.xyz/@tao/115855840223258103). Those mathematicians among you might want to check it out as, like I stated in my previous post, I'm not a mathematician by trade, so my write-up could be slightly flawed. I'm posting this here as he also talks about how LLMs have genuinely increased in capabilities in the previous months. I think it goes towards GPT-5.2's efficacy, as it's my opinion that GPT-5.2 is the only LLM that could have accomplished this currently.",
        "comments": [
            {
                "raw_content": "well done thunder, his writeup says that you indeed did solve it with ace, but that the way you solved it with ai was alien like at first(basically blackbox moves and jumps in the ai’s writing that seemed incomprehensible to human eye at first with no explanation lee sedol move 37 in go, or the way ai chess engines make moves magnus and other grandmasters would not). said that originally mathematicians would connect the proof to its historically led literature leading up to it. you did not at first which caused confusion. but in multiple rewrites using aristotle the proof verifier and chatgpt together you on the fly added the historical context and fixed the many errors to make it more readable, understandable, and finalized into a fully compact solution. tao did still make some complaints about the “ai’ness of this approach wanting you to introduce more of your human writing your own thoughts to it, but beyond that you showed him it was indeed possible to solve unresolved math conjectures using ai. anyways treat yourself well thunder if I remember correctly each problem has a 500$-1000$ prize attached to it have a fun time with your prize money spending well earned.",
                "author": "Beautiful_Claim4911"
            },
            {
                "raw_content": "more or less autonomously, after some feedback. So it required a good mathmatician understanding the procedure and where the AI was wrong (and maybe pointing it in the right direction). Without knowing the 'dimension' of those feedbacks it's impossible to say if it is anyway impressive or not. Moreover the problem was 'previosuly misformulated', and the version that was solved appeared only some months ago. That might mean that a lof o humans who could have solved this new version simply didn't notice/hadn't time to try.",
                "author": "UserXtheUnknown"
            },
            {
                "raw_content": "This is very interesting! I'm especially surprised by the fact that you said you're not a mathematician by trade. Out of curiosity, what is your trade, if you don't mind me asking? I'm not sure if I should be congratulating you or the LLM at this point, but congrats nonetheless",
                "author": "OutrageousReindeer24"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Alphabet Overtakes Apple, Becoming Second to Nvidia in Size",
        "score": 438,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not at all surprising. I would expect to see Google really run up in to earnings. They are going to have a record quarter. Probably double digit percent over the previous record. But I do also expect Apple to have a record quarter.",
                "author": "bartturner"
            },
            {
                "raw_content": "When the Doom Loop of investing between Hardware Makers like Nvidia, The SaaS companies, and the LLM Providers quits seeing it's investment I see Google running away with it. They're already investing a ton in hardware. Soon Google's Data centers will be more than enough for the inference asked of it. I do not see Apple taking 2nd place ever again.",
                "author": "DHFranklin"
            },
            {
                "raw_content": "https://preview.redd.it/d93nfs6k76cg1.jpeg?width=822&format=pjpg&auto=webp&s=2acadbe250ceab544c1a4dc9f82740f84f9dbc5f",
                "author": "GraceToSentience"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "For how long can they keep this up?",
        "score": 95,
        "text_content": "And who are all these people who have never tried to do anything serious with gpt5.2, opus 4.5 or Gemini 3? I don’t believe that a reasonable, intelligent person could interact with those tools and still have these opinions.",
        "comments": [
            {
                "raw_content": "It's like saying computing is merely 0's and 1's, technically correct but meaningless",
                "author": "vrsatillx"
            },
            {
                "raw_content": "Until 40% of people are jobless with the rest on notice I expect this will continue. Then they’ll be pissed we didn’t take it seriously now and actually have necessary conversations around how to keep 8bn monkeys from stabbing things when no food or money makes them cranky.",
                "author": "Stock_Helicopter_260"
            },
            {
                "raw_content": "A lot of this thinking revolves around LLMs being the pinnicle of AI. It's like thinking a 14.4 modem is where connection speed tops out back in the day. We are still in the very early stages of AI. It takes time to make progress and eventually be f'd.",
                "author": "EightyNineMillion"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Official: Zhipu becomes the world’s first LLM company to go public",
        "score": 239,
        "text_content": "Zhipu AI (Z.ai), the company behind the **GLM family** of large language models, has announced that it is now officially a publicly listed company on the Hong Kong Exchange (HKEX: 02513). This appears to mark the **first time** a major LLM-focused company has gone public, signaling a **new phase** for AI commercialization and capital markets. **Source: Zai_org in X** 🔗: https://x.com/i/status/2009290783678239032",
        "comments": [
            {
                "raw_content": "**GLM-5 soon** https://preview.redd.it/w290iulu36cg1.png?width=1080&format=png&auto=webp&s=570ea2802d7fc7919324ba04a36b604d018ffa73",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "Let's see how it'll affect the quality of subsequent GLM versions.",
                "author": "Profanion"
            },
            {
                "raw_content": ">\"This moment belongs to our community... >Now watch as we cater exclusively to each and every whim of our shareholders and completely enshitify the *entire* platform! >Thank you!\" - Every newly IPO'd company ever",
                "author": "guitarguy109"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Oxford Economics finds that \"firms don't appear to be replacing workers with AI on a significant scale\" suggesting that companies are using the tech as cover for routine layoffs",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "AI is not good enough to completely replace workers yet. It is still just a tool for a human to use",
                "author": "Particular-Habit9442"
            },
            {
                "raw_content": "The trends are there. Maybe AI hasn’t replaced a lot of people yet, but it will only speed up as the “how” of automating jobs with AI matures. The real tipping point will be a recession. Firms will lay people off, then discover they can do more with less. Call it the forever recession, as this time the jobs won’t come back.",
                "author": "KidKilobyte"
            },
            {
                "raw_content": "It’s a cover, it’s too early for Ai to replace workers. At this point Ai is just helping some skilled workers. Just a cover with support from the media",
                "author": "fokac93"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "How has this prediction panned out? From a year ago?",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those are certainly words that may mean something",
                "author": "chlebseby"
            },
            {
                "raw_content": "This guy Riley brown is a YouTuber who hypes the F out of every new Claude or Gemini feature lol His video be like I built $1 billion app in 20 mins and proceeds to clone a mobile app into a half ass web app (just front end), a few prompts and anyone can do it. After yapping for 20 mins, he somehow claims he built a $1 billion app in 20 mins I won’t take him seriously",
                "author": "BitterAd6419"
            },
            {
                "raw_content": "Talking about cognitive deskilling! Also if this were available that means it’s available to everyone, aka not profitable because you’d have no edge. The future of AI is in scientific research by governments and big organizations, not dudebro shopify workflows.",
                "author": "artemisgarden"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Hyundai’s Atlas humanoid wins Best Robot at CES 2026, moves toward factory deployment",
        "score": 18,
        "text_content": "Hyundai-owned Boston Dynamics \"Atlas\" humanoid has won the **Best Robot award at CES 2026** for demonstrating real-world autonomy rather than scripted or pre-programmed demos. Judges highlighted Atlas ability to walk, balance, manipulate objects and adapt in **real time** using continuous sensor feedback and AI-driven control, even in unpredictable industrial environments. Unlike most humanoid robots focused on demonstrations or lab settings, Atlas is being built for **practical deployment**, including factory work and hazardous tasks where human labor is limited or risky. Hyundai has confirmed that Atlas is **factory-ready**, with phased deployment planned at Hyundai manufacturing plants starting in **2028**, signaling a shift from experimental humanoids to commercially usable systems. **Source: Interesting Engineering** 🔗: https://interestingengineering.com/ai-robotics/hyundais-atlas-humanoid-wins-top-honor",
        "comments": [],
        "subreddit": "singularity"
    }
]