[
    {
        "post_name": "Tariffs Save The Day, Congress Obsolete",
        "score": 662,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some people just bitch and whine about stuff, some people try to find solutions. President Trump is the latter, which is why he completely destroyed Kamala in the election. She along with all democrats are the former",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "The Democrats are so cruel in their continual votes to shut down the government that they forced the WIC program for the most vulnerable women and children to run out this week. Thankfully, President Trump and the White House have identified a creative solution to transfer resources from Section 232 tariff revenue to this critical program. The Trump White House will not allow impoverished mothers and their babies to go hungry because of the Democrats' political games. https://x.com/presssec/status/1975642840416780535",
                "author": "davidac1982"
            },
            {
                "raw_content": "Tired of welfare programs for whores. So. Fucking. Tired.",
                "author": "Dev404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: Sanctimonious Richard “Da Nang Dick” Blumenthal, perhaps the biggest “joke” in the United States Senate, is at it again! “Dick” lied until the midpoint of his political career, convincing everyone, in particular the Fake News Media, that he was a great “War Hero”",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's had more Dong inside of him than a Vietnamese bank vault.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "Dick looks like a shriveling dick.",
                "author": "OhioRepublic"
            },
            {
                "raw_content": "Why haven't they ever done dick about Dick in the Senate?",
                "author": "SavingPrivateGrace"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴Trump Truth: Wow! Jack Smith and the Biden DOJ spied on Republican Senators and a least one Republican Congressman. This is really bad “stuff.” They tried to take down the Republican Party, and got caught!!!",
        "score": 618,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah! And, so far, it looks like nothing is going to happen to \"them.\"",
                "author": "TheColonelsDaughter"
            },
            {
                "raw_content": "Literally at least 10 times worse than Watergate. Know what's even worse than that? That's not even his biggest scandal, never forget \"if you don't fire the prosecutor you're not getting the billion\" or the single worst scandal in all of American history (and it isn't even close), Autopengate",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "I legit tune this nonsense out.",
                "author": "NoahGav"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨BREAKING: The Senate just voted to CONFIRM 107 Trump nominees in one package.",
        "score": 1831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Between this and the illegal immigration issue, we could not have a better president.",
                "author": "keeponwinning"
            },
            {
                "raw_content": "So when the fuck are they gonna start doing something and holding commies accountable?",
                "author": "Schroeder09"
            },
            {
                "raw_content": "Now how about some impeachment packets for these rogue activist judges?",
                "author": "SupFrens"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blast From The Past: Matt Gaetz questions IG Mike Horowitz about his 2023 report that 3.4 million queries were done on the FISA database from 12/1/2020 to 11/30/2021, and 1 million of those were \"in error.\" That, ladies and gentlepedes, was Arctic Frost.",
        "score": 1297,
        "text_content": "",
        "comments": [
            {
                "raw_content": "PS: It was far, far more than just Trump and a few congress critters who were captured in those searches.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Almost like the fbi sucks ass",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Oopsie - 1 million times",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 WATCH: An illegal captured by ICE BEGS Kristi Noem to let him go!",
        "score": 1391,
        "text_content": "",
        "comments": [
            {
                "raw_content": "clown...talking to the woman because it knows that women are more likely to let them in.. weird fucker",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Is that the missing link?",
                "author": "MAGA_mantis"
            },
            {
                "raw_content": "No, he wasn't asking to be let go. He said in Spanish that he had seen ('mirado') her on TV ('la tele'). Translator should have spoken up. Doesn't change anything though. Time for him to go back...",
                "author": "peterthegreen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Secretary Kristi Noem tells arrested illegal pedophile from Portland that he will be prosecuted and deported to his FACE. The child molester was arrested just one hour ago.",
        "score": 1361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Team Trump is NOT messing around here.\" Why isn't the foreign pedophile dead?",
                "author": "Orlando_Doom"
            },
            {
                "raw_content": "Despite having zero law enforcement experience, Kristi Noem is a natural when she was interrogating these illegal aliens. It doesn't feel like she is reading from a script but she sounds as though she has been doing this for years.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Can't we castrate him before deportation?",
                "author": "VonArman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🏫 Far-Left Professor Charged with Violent Felonies Following Riots at Chicago ICE Facility 💥",
        "score": 1156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now there's a looker! /cat call, /wolf howl",
                "author": "bringbackthe80s"
            },
            {
                "raw_content": "Abdelhadi, Strong Irish name. Convert or deport them all. If they claim Islam, they’re claiming to be an enemy combatant.",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "Looks deportable",
                "author": "magapatriot_pa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "- 58% of the births in Texas are Medicaid births - 20 years ago, Medicaid was 3% of the Texas budget, now it's the number 2 driver of the budget - This is mainly due to illegal immigration - People come across the border, have their babies, sometimes they go back, sometimes they don't",
        "score": 1294,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tucker Carlson Show on Texas - 58% of the births in Texas are Medicaid births - 20 years ago, Medicaid was 3% of the Texas budget, now it's the number 2 driver of the budget - This is mainly due to illegal immigration - People come across the border, have their babies, sometimes they go back, sometimes they don't “We are destroying our children and grandchildren's ability to have any kind of future whatsoever. We're drilling holes in the bottom of the lifeboat.” Why does Texas love illegals so much, they let all this happen",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "This is why the ruling on the 14th amendment by the Supreme Court is so important",
                "author": "JayKay1776"
            },
            {
                "raw_content": "TL;DR, eye patch McCain is ok with all of this and needs to go.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gavin Newsom vetoes raise for state firefighters, just months after devastating LA inferno",
        "score": 1150,
        "text_content": "",
        "comments": [
            {
                "raw_content": "California's Union firefighters backed Kamala Harris in 2024.",
                "author": "airborne3502"
            },
            {
                "raw_content": "Because he was the one to start the fires",
                "author": "TRUMPMAGASUPERFAN"
            },
            {
                "raw_content": "While I absolutely despise Grusome Newsom... If you base the firefighters' raise on their past performance, they do not deserve a raise. I know there are other factors, but their performance sucked.",
                "author": "LiberalsAreMental"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨🚨 Texas National Guard troops have arrived at an Army Reserve center south of Chicago ahead of expected deployment.",
        "score": 1465,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Member when Dems deployed the National Guard from many states to occupy DC for a year? Pepridge Farms remembers Edit: 25,000 of them, even some from Guam (dont tell Sen. Johnson) https://www.nationalguard.mil/News/Article-View/Article/2474814/national-guard-troops-head-to-dc-from-as-far-away-as-guam/",
                "author": "Porkbut"
            },
            {
                "raw_content": "God Bless Texas!",
                "author": "peterthegreen"
            },
            {
                "raw_content": "I want Portland swept clean. They have deep roots there",
                "author": "Skinagrizz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stewart calls ICE a \"well-funded paramilitary group\" that is “throwing grandmothers onto linoleum and zip-tying American children.”",
        "score": 1235,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# 𝐀𝐫𝐫𝐞𝐬𝐭 𝐉𝐨𝐧 𝐒𝐭𝐞𝐰𝐚𝐫𝐭.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "They throwed grandmas on our side onto linoleum and nobody batted an eye",
                "author": "goldwater4ever"
            },
            {
                "raw_content": "Joos gonna Joo!",
                "author": "SneakyWino"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "AOC backtracks after bodyshaming short people, says \"height\" is really an internal, not physical issue. AOC says she is actually a lover of the Short King Community and says people are only big or small on the inside.",
        "score": 1083,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Talks all that shit and has a cuck ginger white guy for a spouse who refuses to marry her in 3 years.",
                "author": "PiratePatriotParrot"
            },
            {
                "raw_content": "She is lying her ass off as well. So fake. You don't have to like Andrew Tate to think that he looks like a tall man. She is going to have to backtrack for this as well because you are still associating \"bad\" with \"short\".",
                "author": "DontApologize"
            },
            {
                "raw_content": "Didn’t this broad get fat?",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "50 cent unleashes on BadBunny",
        "score": 586,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I knew i respected this man for a reason!",
                "author": "Aboveaveragebear"
            },
            {
                "raw_content": "I’m about a dolla wtf is fiddy cents?",
                "author": "usernamechecksout"
            },
            {
                "raw_content": "The funny thing is anyone can sing in English, freaking Koreans and Japanese and Europeans do it all the time",
                "author": "Papabravo12"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴POLL: A majority of Americans support nearly every one of President Trump's policies.",
        "score": 1704,
        "text_content": "",
        "comments": [
            {
                "raw_content": "no, no, no...... Jessica Tarlov keeps saying Trump is upside down and completely unpopular..... 😂🤣",
                "author": "empiretc"
            },
            {
                "raw_content": "The only thing I want different is MORE ARRESTS.",
                "author": "Rydanovich"
            },
            {
                "raw_content": "So 87% of Republican voters support eliminating government waste & fraud. I'd really like to have a conversation with the other 13%.",
                "author": "lothrop_evola"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JUST IN: MSNBC is reportedly facing calls for anchor Nicolle Wallace to be terminated after she tried to blame a South Carolina judge’s house fire on her rulings against the Trump administration.",
        "score": 1679,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sue her ass into bankruptcy",
                "author": "Sea_Still"
            },
            {
                "raw_content": "such a smarmy retarded libtard cunt",
                "author": "leakmouth"
            },
            {
                "raw_content": "Yea, but I'm also not going to pretend like I would care if that were the case. Game theory only works when both sides will conceivably chimp.",
                "author": "Throwingway22"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DHS: We’re Having An All Night Revival",
        "score": 1034,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Whoever runs the DHS twitter account is a fucking genius, that's for sure. Always posting bangers and not holding back, either.",
                "author": "brassmule"
            },
            {
                "raw_content": "TOP KEK, it's a big fuck you to Zach Bryan",
                "author": "wartooth6"
            },
            {
                "raw_content": "This is exactly what we voted for!",
                "author": "DrBJTester"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: JPMorgan CEO Jamie Dimon says the US government shutdown will not hurt financial markets.",
        "score": 1312,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So… can we just keep it closed?",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "It literally is hurting nobody, if anything is helping having the thiefs not ateal more pf your shit",
                "author": "Krat"
            },
            {
                "raw_content": "Why would it?",
                "author": "josiborg"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. Marsha Blackburn and AG Pam Bondi TAG-TEAM Sen. Dick Durbin — Remind America He’s the One BLOCKING Subpoena for Epstein Flight Logs - Jim Hᴏft",
        "score": 1241,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sure okay. It's one senator holding it up. Not the head of the Executive or the head of the Department of Justice.",
                "author": "flashersenpai"
            },
            {
                "raw_content": "New Headline...Blackburn & Bondi, Tag-Team Dick.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Needle-Dick Turban",
                "author": "HellNoKameltoe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Virginia Dems quietly fret that refusal to dump AG candidate Jay Jones is hurting party: ‘Avoid him like the plague’",
        "score": 1175,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s saying the quiet part out loud. That’s why they are mad",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "I don’t think another terrorist Democrat can damage their brand.",
                "author": "eclectic22"
            },
            {
                "raw_content": "Ohhh daaaamn, a \"Democratic strategist\" told the very right-leaning NY Post that Jay Jones should be blackballed. Their internal polling must have shown Spanberger's little Good Suburban Mommy schtick was not sufficient to counter this guy's psychopathy and her ratings must be plummeting. Tie her even more to him.",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia to Finance Musk’s xAI Chips as Part of $20 Billion Deal",
        "score": 144,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So like the OpenAI 'deal', NVIDIA is giving xAI money to rent back their chips so they can keep inflating growth numbers?",
                "author": "CatalyticDragon"
            },
            {
                "raw_content": "xAI is raising 20 billion to buy Nvidia GPUs. Nvidia is giving 2 billion here. Effectively giving xAI a 10% discount. This one is not that ridiculous. Edit - oh wait. Equity is also involved. So Nvidia will own some of xAI. Not a bad deal then",
                "author": "From-UoM"
            },
            {
                "raw_content": ">Elon Musk’s artificial intelligence startup xAI is raising more financing than initially planned, backed by Nvidia Corp. to lift its ongoing funding round to $20 billion. >The financing includes equity and debt in a special purpose vehicle that will buy Nvidia processors and rent them to xAI for use in its Colossus 2 project. >XAI’s financing would be split between about $7.5 billion of equity and as much as $12.5 billion of debt in the SPV. The vehicle will be used to buy Nvidia processors, and Musk’s artificial intelligence startup would then rent the chips out for five years, allowing Wall Street financiers to recoup their investment. >The unique deal structure, backed by the GPUs as opposed to the company, could provide a playbook for tech firms looking to decrease debt exposure.",
                "author": "SERIVUBSEV"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Jeff Geerling] Qualcomm just bought Arduino, and they're making a tiny computer",
        "score": 422,
        "text_content": "[https://www.qualcomm.com/news/releases/2025/10/qualcomm-to-acquire-arduino-accelerating-developers--access-to-i](https://www.qualcomm.com/news/releases/2025/10/qualcomm-to-acquire-arduino-accelerating-developers--access-to-i)",
        "comments": [
            {
                "raw_content": "Implications for open source community ?",
                "author": "Arnaredstone"
            },
            {
                "raw_content": "RIP Arduino! any good alternative for beginner?? I am new into microcontrollers",
                "author": "Glittering-Many4851"
            },
            {
                "raw_content": "Qualcomm could've dominated embedded OSHW long back, with minimal effort, if they didn't hide their devices behind NDAs and 100k+ quotes. Just sell them through online distributors, like RPi does with their compute modules and RP2040/2350 ICs.",
                "author": "autumn-morning-2085"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel's flagship Core Ultra 9 285K is down to its lowest price ever, at just $475— Intel's fastest current-gen gaming chip is $125 off this Prime Day",
        "score": 148,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Solid productivity chip I think, although the 265k still seems like a better value.",
                "author": "kirk7899"
            },
            {
                "raw_content": "The 265k is the only one worth considering. It's like $250 and is pretty much just as good as the 285k. By the time you're at 285k money it's 9800x3D or 9900x or 7950x territory.",
                "author": "masterfultechgeek"
            },
            {
                "raw_content": "It's a solid chip. Definitely not the fastest in gaming but for productivity use, this cpu has its place.",
                "author": "alfiejr23"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "JEDEC's UFS 5.0 standard doubles sequential performance to 10.8 GB/s with MIPI M-PHY 6.0 integration",
        "score": 51,
        "text_content": "JEDEC is finalizing the UFS 5.0 specification, targeting high-performance, low-power flash storage for mobile devices, automotive systems, edge computing, and gaming applications. The standard will deliver sequential performance up to 10.8 GB/s—double that of UFS 4.x—while maintaining backward hardware compatibility. Key technical enhancements include integrated link equalization for improved signal integrity, a separate power supply rail for noise isolation between the PHY and memory subsystem, and inline hashing for enhanced security. UFS 5.0 leverages collaboration with the MIPI Alliance, utilizing the forthcoming M-PHY 6.0 specification with High-Speed Gear 6 (HS-G6) supporting 46.6 Gb/s per lane bandwidth and UniPro 3.0 for the interconnect layer. The two-lane configuration enables the peak \\~10.8 GB/s effective throughput, positioning UFS 5.0 to address demanding AI workloads and next-generation mobile computing requirements while maintaining the power efficiency critical for battery-operated and embedded systems.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Imec launches 300mm GaN program to develop advanced power devices and reduce manufacturing costs",
        "score": 28,
        "text_content": "AIXTRON, GlobalFoundries, KLA Corporation, Synopsys, and Veeco join imec’s GaN power electronics program track on 300mm as first partners * Imec announces the launch of a new program track centered around 300mm GaN technology development for low and high voltage power electronics applications. * Transitioning to 300mm wafer sizes enables the development of more advanced power electronics devices and a reduction of manufacturing costs. * AIXTRON, GlobalFoundries, KLA Corporation, Synopsys, and Veeco are welcomed as first program partners, underlying full ecosystem development. **LEUVEN (Belgium), October 6, 2025**— *Imec, a world-leading research and innovation hub in nanoelectronics and digital technologies, welcomes AIXTRON, GlobalFoundries, KLA Corporation, Synopsys, and Veeco as first partners in its 300mm gallium-nitride (GaN) open innovation program track for low- and high-voltage power electronics applications. This program track, part of imec’s industrial affiliation program (IIAP) on GaN power electronics, has been set up to develop 300mm GaN epi growth, and low and high voltage GaN high electron mobility transistor (HEMT) process flows. The use of 300mm substrates will not only reduce GaN device manufacturing costs, but it will also allow the development of more advanced power electronics devices, such as efficient low-voltage point-of-load converters for CPUs and GPUs.*",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "How far can we push MCU power efficiency?",
        "score": 4,
        "text_content": "Reading about subthreshold operation and some of Ambiq’s designs really got me thinking how much lower can we actually go in MCU power consumption before hitting physical limits? Has anyone studied how these chips achieve ultra-low active current without major performance trade-offs? Would love to hear some technical insight.",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Google, AWS, and NASA to Keynote RISC-V Summit North America 2025",
        "score": 2,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "For anybody not convinced \"Close to You\" is a pikmin thing:",
        "score": 686,
        "text_content": "this is the second pikmin song in the video, the first one isn't as exact though.",
        "comments": [
            {
                "raw_content": "Another thing to note, this was the only song that Pikmin hum in Pikmin 4 that people couldn’t connect to any old pikmin song. Maybe they always had this planned?",
                "author": "Affectionate-Emu6609"
            },
            {
                "raw_content": "Pikmin movie",
                "author": "Curri189"
            },
            {
                "raw_content": "Spin off title coming up.",
                "author": "Ragebait_Destroyer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Um what?",
        "score": 1471,
        "text_content": "Is this like a project with Illumination? I have literally no idea.",
        "comments": [
            {
                "raw_content": "I fully expect this baby to be a new fighter in the next Smash Bros game.",
                "author": "Legoluigidude"
            },
            {
                "raw_content": "this is the most Nintendo shit I have ever seen. Drops a random short film on a Tuesday, doesn't elaborate. Wild speculation follows",
                "author": "Due_Exam_1740"
            },
            {
                "raw_content": "It plays Pikmin music. Are we getting some kind of new Pikmin thing? A show? A movie? A game? ANYTHING? EDIT: 1:38ish, you can see something walking around under the cot/crib",
                "author": "OniEclipse"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Breath of the Wild on Switch 2 proves you can improve on a masterpiece.",
        "score": 157,
        "text_content": "So I'm playing Legend of Zelda: Breath of the Wild on the Switch 2 and it's been an absolute delight to play. Now I did complete BOTW on Switch back upon it's release and there's no denying it's one of the greatest games ever made, but I could never bring myself to collect/complete everything due to the Switch's performance issues. However, on the Switch 2 with the visual/performance updates it's truly been a magical experience. It's stunning playing the game on a 4K TV with pretty much perfect performance and truly highlights the stunning art design of the world. Then taking it handheld is just as delightful. Despite the age of the game, I've constantly found myself stopping to take in the views and atmosphere. The game design is just perfect from puzzles to combat and there's always something new to discover. It truly is a masterpiece, only somehow improved on the Switch 2 hardware. I'll admit I was somewhat underwhelmed by the Switch 2 upon release, especially after Mario Kart World. But I feel like BOTW has made the purchase worth it. I never actually got around to playing Tears of the Kingdom, so I'm excited to play that at a later date. Now I know most of you already know this and have experience it for yourself. But if you haven't played BOTW yet, you must. I'm curious to know if anyone else had a similar experience with any other Switch games that have received a Switch 2 upgrade?",
        "comments": [
            {
                "raw_content": "I mean I don’t think anyone was arguing that you can’t improve a 10/10 game with higher render resolution and framerate",
                "author": "cuntpuncherexpress"
            },
            {
                "raw_content": "You’re gonna a love TOTK. It’s my all time favourite game, and it also looks amazing on Switch 2.",
                "author": "peter-man-hello"
            },
            {
                "raw_content": "I played, enjoyed, and finished BOTW on the WII U like a man.",
                "author": "My_two-cents"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Cronos new dawn update",
        "score": 95,
        "text_content": "They’re continuing to improve it just like outlaws. Give me hope for future titles. https://x.com/smetaldave64/status/1975335969537860057?s=46",
        "comments": [
            {
                "raw_content": "That’s impressive and I’m glad to see they’re continuing to improve the port. I’m really considering picking it up on Switch 2!",
                "author": "Robbitjuice"
            },
            {
                "raw_content": "I wonder if they can use rt with minimal performance hits like starwars outlaws",
                "author": "Thin_Molasses_2561"
            },
            {
                "raw_content": "I got the game the day after the patch. I waited for them to patch it before getting it and It looks far better, almost perfect, compared to release. Almost no pop ins etc now. It’s an incredible game I must say, I can’t put it down! A must buy for survival horror fans. Such is our calling",
                "author": "Infamous-Trust-2957"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "50% off Daemon X Machina Titanic Scion Limited Edition back in stock @ Amazon US!",
        "score": 11,
        "text_content": "Just got mine! Here’s the link: https://a.co/d/bsPnZoZ",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Powerwash Simulator 2 out October 23!",
        "score": 104,
        "text_content": "More great games in 2025! Ahhh!",
        "comments": [
            {
                "raw_content": "I can only imagine it will use mouse or gyro controls on the Switch 2 version (I hope).",
                "author": "chemiclord"
            },
            {
                "raw_content": "I never played the first one, what happened so far in the story that I need to know about?",
                "author": "Williekins"
            },
            {
                "raw_content": "That's my birthday!",
                "author": "RingtailVT"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Daemon X Machina Titanic Scion Limited Edition $49.91 with Amazon Prime",
        "score": 63,
        "text_content": "UPDATE: it appears TXM limited edition has sold out. The other deals still are live though. Original post: Thought I'd share Amazon has decent deals for prime members starting today, including Daemon X Machina: Titanic Scion Limited Edition for half price. Other switch 2 titles on sale include Madden NFL 26 for $36, Yakuza 0 for $37, split fiction for $39, No Sleep For Kaname Date - From AI: THE SOMNIUM FILES for $29, several first party switch 1 titles for $39.99 (skyward sword HD, super Mario Bros U deluxe, Luigi's Mansion 3), Dragon Quest III HD-2D for $38, FINAL FANTASY I-VI Collection Anniversary Edition for $44, and more.",
        "comments": [
            {
                "raw_content": "This is a great deal. I got my LE for retail price (minus pre-order discount) and didn't regret it, it's a pretty good bundle.",
                "author": "Skelletonike"
            },
            {
                "raw_content": "Just bought it. I hope I like this one lol",
                "author": "Rob62"
            },
            {
                "raw_content": "Hmm I wonder why it doesn’t show up for me",
                "author": "EmbarrassedHighway76"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "R.E.P.O and Scooby Doo confirmed for Fortnite this Halloween",
        "score": 136,
        "text_content": "[Source](https://xcancel.com/iFireMonkey/status/1975685374996312433) Previous Rumors: [Scooby Doo](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1mq9se3/scooby_doo_x_fortnite_is_happening_this_halloween/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button), [R.E.P.O](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nbwrxe/repo_x_fortnite_dropping_very_soon/) Along side Scream, Black Phone and Ghostface!",
        "comments": [
            {
                "raw_content": "god I can't wait to see how Scooby works",
                "author": "robertman21"
            },
            {
                "raw_content": "Scooby headshots Goku: \"Rahehehehehe!!\"",
                "author": "trojanreddit"
            },
            {
                "raw_content": "Ruh roh",
                "author": "Mako__Junkie"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Marathon pricing details, Deluxe edition, Season Pass, and launch weapons",
        "score": 441,
        "text_content": "[Source](https://thegamepost.com/leak-marathons-base-price-deluxe-edition-season-pass-weapons/) * Base Game: $40 * Deluxe: $60 * Season Pass: $10 (cosmetic only) * Launch weapons: 28",
        "comments": [
            {
                "raw_content": "The year is 1994. Marathon’s success or failure will determine if Bungie lives. The year is 2026. Marathon’s success or failure will determine if Bungie lives.",
                "author": "chipsnapper"
            },
            {
                "raw_content": "Honestly I think the Bungie name a lone will ensure this isn't as big or quick a failure as Concord was. Just my opinion. Now, I'm not saying I think the game is going to be good by any means but I do think a lot of people will buy it because it's Bungie. Same as Blizzard really. Sure, their newer games are a pale imitation of the glorious Blizzard of old but they still rake in the sales. This will be the same. I bet it sells fairly well at launch due to the name but if it sucks people will leave fairly quick. We will see I guess.",
                "author": "Risenzealot"
            },
            {
                "raw_content": "bungie is fucked",
                "author": "lordsaladito"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "All current circulating rumors/leaks about the future of Silent Hill:",
        "score": 476,
        "text_content": "\\- [Silent Hill Townfall releasing in 2026 and new details](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nweexe/silent_hill_townfall_releasing_in_2026_and_new/) \\- [New platform slots found on Bloober's website for SH2R (Xbox X/S - SW2 and PS5 Pro fix)](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nyr5z9/in_bloober_teams_website_silent_hill_2_remakes/) \\- [Dusk Golem reconfirming the work on the Xbox versions of SH2R along with Born From a Wish getting announced soon ](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1nzk3cz/dusk_golem_xbox_version_of_silent_hill_2_remake/) \\- [Silent Hill 1 remake in full production at Bloober Team](https://www.relyonhorror.com/latest-news/silent-hill-1-remake-in-full-production-confirms-bloober-team/) \\- [Silent Hill 2 Remake joining PS Plus Extra on October 21st](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1o0aywf/silent_hill_2_2024_is_joining_ps_plus_extra_later/)",
        "comments": [
            {
                "raw_content": "I’m just waiting for something new castlevania now",
                "author": "Ok_Canary5591"
            },
            {
                "raw_content": "It’s nice to see this franchise (and Konami) back.",
                "author": "wovengrsnite192"
            },
            {
                "raw_content": "I think there's also some speculation about SH3 remake, they announced some Bloober project codes, and I think one was rumored to be SH3 Remake (?)",
                "author": "searchshadow"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Silent Hill 2 (2024) is joining PS Plus Extra later this month",
        "score": 593,
        "text_content": "my deepest condolences to those who bought the game just before this article went up via Dealabs: https://www.dealabs.com/magazine/ce-remake-sorti-en-excluvisite-console-sur-ps5-va-debarquer-sur-le-ps-plus-extra-60622",
        "comments": [
            {
                "raw_content": "Easily one of the best months ever of PS Plus",
                "author": "ForcadoUALG"
            },
            {
                "raw_content": "Sheesh they absolutely cooked this month",
                "author": "trapdave1017"
            },
            {
                "raw_content": "Really hoping a potential PS5 Pro fix is out in time for this, would love to play it before my subscription runs out mid November.",
                "author": "coletrain93"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 9 285K drops to $475, Arrow Lake-S CPUs now up to 39% below launch prices - VideoCardz.com",
        "score": 92,
        "text_content": "",
        "comments": [
            {
                "raw_content": "265K is below 300 mostly and is *way* more bang per buck than 285K. For 500 i'd still get a 9800X3D unless i had pretty severe multi-threaded loads to handle.",
                "author": "PsyOmega"
            },
            {
                "raw_content": "got two 245KF for £140 each on amazon, nice and cheap",
                "author": "Zeraora807"
            },
            {
                "raw_content": "$475 for the 285K would almost make sense, except the maximum advantage of it is pretty slight against the 265K... Which under the Newegg promo being run comes with an adequate AIO on top of being $210+ cheaper than the 285K. Though I will say my 265K's P cores around where it's supposed to have the final E cluster run basically dead cold in comparison to those actively sandwiched.",
                "author": "RJsRX7"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD launches Ryzen Embedded 9000 series: Ryzen Embedded 9950X3D is 170W CPU with 16 Zen5 cores and 128MB L3 Cache",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For gaming hosting in the cloud? Or what",
                "author": "JamesLahey08"
            },
            {
                "raw_content": "I'd rather like to see < 10 W embedded APUs again. At some point they had SoCs that were pretty interesting for network appliances and the like. Looks like AMD has all but given up on that segment. Maybe they need an actual small core again.",
                "author": "Zettinator"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Nearly 70% of Americans think the economy is on the ‘wrong track’ and it's a bad time to buy a home, Fannie Mae survey shows",
        "score": 278,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't Fannie Mae crash the economy?",
                "author": "a5redwing"
            },
            {
                "raw_content": "Gold/silver at all time highs… nothing to see there… when was the last time happened the economy was doing great!",
                "author": "DrAtizzle"
            },
            {
                "raw_content": "The best investments are when everyone thinks they're great investments. /s",
                "author": "beastwood6"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuyers Are Canceling Deals at a Record Rate. Here's Why.",
        "score": 296,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Finally buyers are starting to slowly return to reality. I couldn’t imagine making the biggest purchase of my life without having the home inspected. Now it’s sellers turn, can’t sell a home if nobody is willing to buy it.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Articles like this attempt to gaslight buyers as the weak link in the process. Nah. It’s the overpriced home to begin with, followed by inspections that, waived for the FOMO period of 2021-2022, now suddenly show all the expensive flaws of a purchase.",
                "author": "HartbrakeFL21"
            },
            {
                "raw_content": "Deferred maintenance coming back to bite certain sellers. Before I sold in 23 I had my own inspection done and took care of the glaring issues before listing. Our buyer backed out of their last contract because of a really bad inspection and seller not willing to concede anything. Closed in 21 days.",
                "author": "Cosmic_Gumbo"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Investors are making up the highest share of homebuyers in 5 years",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"investors paid an average of $455,481 per home\" Just don't see how these \"investors\" are making any money at these prices. Even low end homes don't cash flow at today's prices much less $455,000 ones. Are they all just speculating on appreciation? US price to rent ratio is about 134.2 and this is going to be skewed by lower end properties so it's going to be worse on average for a set of properties averaging $455,000. Let's assume it is 134.2 though which means $3400 rent on this hypothetical average property. With that I get a 3.8% cap rate, 0.08% 10 year IRR, -$1100 a month cash flow, -19.32% CoC return. IRR goes up to a more reasonable 5% if you wait 40 years. You do not hit positive cash flow until YEAR 29 factoring in inflation. This assumes everything goes reasonably well and my maintenance number on this is low, I could make the numbers look worse if I wanted to. I figure 7% vacancy (national avg), 2% tax 1% ins $1500 maintenance 10% management 100% leasing fee 3 year turnover $4500 closing costs 7% interest 30 year fixed 6% selling costs 2% inflation. Inflation play? 3% inflation pushes your 10 year irr up to a whopping 4.3%. Either way you're not beating historical equity performance here and now you have a (highly leveraged) business to run. Let's be even more optimistic. 10 year turnover. 5% vacancy. 3% selling costs. Now you are 6.57% IRR. So if you have a guardian angel, maybe you can beat investment grade bonds by a couple percent, and still lose to historical stock performance. Note that with both of the above you are still deeply negative cash flow and only make money after many years of mortgage paydown plus appreciation and then selling the property. Tax benefits might help but even factoring in depreciation and committing tax fraud by lying on your taxes about your passive status (this is what they are doing) is probably not going to move the needle enough to make this profitable. And of course this is just a deferral, not savings. This also assumes a decent property in a decent area. It can get so much worse. I'm envisioning a low maintenance suburban property here. I couldn't even begin to spreadsheet the losses on this low end 100 year old rust belt stuff that a lot of investors are buying these days. Unfortunately I don't have enough data to accurately model how often your AC units will get stolen and how badly the tenants will trash the place when you inevitably have to evict someone. I used to buy this stuff at a 12 cap and it was hardly worth the trouble, I made all my money selling it at a 6 cap to some other guy after it doubled. Also for those who don't know what IRR is this is not just income - this is total return - this includes all cash flows, equity paydown and appreciation / gain on sale adjusted for time value of money and my numbers assume value tracks inflation (as it has for most of history) with no correction in home prices from here in real or nominal terms.",
                "author": "ispb2"
            },
            {
                "raw_content": "Stocks are much easier",
                "author": "DrAtizzle"
            },
            {
                "raw_content": "This morning I heard commentary on CNBC, about this issue.... Thank you Airbnb!.... **The states with the highest percentage of investor-owned homes are Hawaii, Alaska, Montana and Maine. These are also heavy tourism states.** CNBC showed a U.S. map with the hottest States where tourism is building large swaths of new homes specifically for \"short term rentals\". When any State has most of their income from tourism, this is what you get. You get a huge demand for short term housing. It's like what is happening in my West Coast State where all the coastal properties are now held by investors for vacation rentals...as we need more housing for people to live.",
                "author": "RealisticForYou"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Small Investors Dominate The Single-Family Home Market. A striking 33% of single-family homes were bought by investors in Q2 2025, a 5-year high",
        "score": 0,
        "text_content": "",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Made this in about 3 hours. Anime style mech short concept. Strung together from multiple Sora 2 prompts.",
        "score": 177,
        "text_content": "I know nothing about animation or video editing but the fact that I could string together this in such a little amount of time is crazy to me...",
        "comments": [
            {
                "raw_content": "How did you keep consistency through your prompts to get the same matching art in every generated scene. I try this and sometimes it switches things I don’t want changed. Are you using simple or more complex prompts?",
                "author": "FreeStyleSarcasm"
            },
            {
                "raw_content": "Ai generated games are going to be sweet.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "Looks really good imo, a few scenes that were a bit odd (specifically what looked like welding the floor at 00:07) but overall a great job dude.",
                "author": "DragonfruitIll660"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Figure 03 coming 10/9",
        "score": 933,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Robot with drip",
                "author": "MrAidenator"
            },
            {
                "raw_content": "each iteration looks neater. love it",
                "author": "Popular_Lab5573"
            },
            {
                "raw_content": "Holy shit, clothes for robots totally makes sense, it's easier to clean/wash waterproof shell/clothes than clean joints etc + surfaces are protected from scratches and bumps.",
                "author": "Ill_Leg_7168"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Bernie Sanders gives his concrete thoughts and proposals about AI replacing workers",
        "score": 100,
        "text_content": "I am positively surprised. His proposed solutions (Which I'll summarize at the bottom here) go beyond what the first minutes of the video might lead you to think. He also states it is realistic that AI will replace 100M American jobs in the next 10 years. He first rambles off a whole list of AI replacing workers and concentrating power to the wealthy, which really made me think \"Wow so he's a luddite\", but then he whips out \"I'm not a luddite\". He knows our lingo huh His concrete proposals: 1. Move to a 32-hour work week with no loss in pay. AI and robotics will greatly increase per-worker productivity. Workers must benefit from that increased output through a shorter workweek with no loss of pay. 2. Require large corporations to elect at least 45% of the members of the boards of directors, similar to what already takes place in Germany. Workers need a seat at the table to best determine how AI is used at their companies. 3. Greatly increase profit sharing at our nation's largest corporations. Workers should receive at least 20% in stock at the companies they work for. 4. We need to substantially expand the concept of employee ownership. When workers own their own businesses, and are more involved in the decision making processes, they will make decisions that benefit everyone in the company, not just the people on top. 5. Instead of providing billions of dollars in tax breaks to companies that are replacing workers with new technologies, we should enact a robot tax on large corporations, and use that revenue to improve the lives of workers who have been harmed in this transition. Imo, this can be an adequate reaction to the initial transitional phase of AI in the coming several years. We will need extra action after the initial phases, though. And I can't shake the feeling that Bernie having said this now subconsciously plants the seed in the mind of the current administration that these measures should be avoided.",
        "comments": [
            {
                "raw_content": "Most of reddit doesint think ai has taken even a single job yet and basically won’t in the next 20 years. So nothing will get addressed until it’s too late. Whatever happens happens I guess. I do like this guy tho he should have been president.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "He touches on what I think is going to be a perverse effect of the tariffs: Companies are forced to bring manufactoring back to US cuz it is too expensive to do it in another country US workers are too expensive to hire So companies accelerate their investment and research into using robots instead in the factories they build in the US. Trump's tariffs are basically incentivizing US companies to accelerate using robots/AI to replace their human force. In other words, the world where robots take all human jobs comes even faster. It really reminds you that so many of things in life happen because of the unintended consequences of your decisions",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "If they lay off millions and it's our problem. If they lay off 10s of millions and it's their problem.",
                "author": "omn1p073n7"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI 10000x smaller than Gemini 2.5 pro and deepseek beat them both in arc agi 1 and 2",
        "score": 229,
        "text_content": "https://arxiv.org/pdf/2510.04871",
        "comments": [
            {
                "raw_content": "So if I'm understanding correctly, this is an architecture that is specifically designed to tackle puzzles like sudoku, mazes, and the arc-agi test, and is substantially different from that of LLMs. Idk if it's fair to compare this to gemini or deepseek",
                "author": "Sextus_Rex"
            },
            {
                "raw_content": "Benchmaxxing",
                "author": "drizzyxs"
            },
            {
                "raw_content": "Yeah but we don't really care it can't even talk. Wake us up when this merges with LLM tech lol.",
                "author": "Revolutionalredstone"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "82% of ChatGPT users don’t even try other AI chatbots",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm the worst whore, I use every one of them and keep looking for more.",
                "author": "Barubiri"
            },
            {
                "raw_content": "How did they get this data?",
                "author": "Sextus_Rex"
            },
            {
                "raw_content": "I tried all of the big ones, Gemini is the only one I tried multiple times, but then I stick with ChatGPT because it seems better to me.",
                "author": "adarkuccio"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "You can already order a chinese robot at Walmart",
        "score": 639,
        "text_content": "[Source](https://x.com/geogod42/status/1975336180637221372)",
        "comments": [
            {
                "raw_content": "Walmart third party vendors are such a shitshow.",
                "author": "tacoandpancake"
            },
            {
                "raw_content": "Isn't it only $16k from Unitree? That's quite the upcharge.",
                "author": "drums_addict"
            },
            {
                "raw_content": "https://preview.redd.it/gmo1zj89nptf1.jpeg?width=640&format=pjpg&auto=webp&s=bf782f2f2c78e13974232d85937ce9fbe877f7aa",
                "author": "awesomedan24"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Hank Green just posted a 3-minute anti-AI rant about Sora 2",
        "score": 89,
        "text_content": "Hank Green (whose videos I generally like -- have been a subscriber for years) just uploaded a video titled *“Give me a single reason why Sora2 should exist”* where he basically spends 3 minutes venting about how AI is harmful and shouldn’t exist at all Naturally, the video is blowing up... 70K views in 3 hours, 12K likes, and the comment section is full of people agreeing with him. The anti-AI crowd is treating it like it's their Holy Grail lol. And I'm pretty sure the outrage is based entirely on an outdated fact since Sora 2 already put up all kinds of restrictions and you can no longer make the kinds of videos he's mad about What do you think? Personally I'm kinda getting tired of these \"AI bad\" takes from influencers that clearly fail to see the bigger picture",
        "comments": [
            {
                "raw_content": "I get what he's saying generally. The main issue I had was his remark about how \"if this is the business model\" then the company is overhyped. Yes, if this was the only business model, but it's not. They need money to do their other things, this can be a way to generate cash. It is sort of interesting that on an internet-societal scale we went from Wild West bad search and webrings, to Google curation, to social media curation (including reddit). Generating new content instead of sharing what you like because your friends might like it, is a new paradigm if it takes off.",
                "author": "JoshAllentown"
            },
            {
                "raw_content": "Something like Sora 2 can be good and bad at the same time.",
                "author": "spread_the_cheese"
            },
            {
                "raw_content": "The tone is clearly emotional and he’s annoyed. He’s also a content creator watching a feed of content where the degree of human input and effort is minimal. Sora is a pretty slop based app. However, the truth is humans make slop too. My instagram feed is filled with some decent content, but also rage bait , low effort OnlyFans ads, death videos etc. To be fair he hates all these feeds and states as much. All of this to say, the slop part of the argument is the weakest because he’s pretending most of the current internet content is good. It’s not. However, it is also naive of us to not see that this will lead to continued degrading of trust in media, images and videos. The implications of which really do seem to be brushed off by the AI crowd. I’m not sure where all of this will end up, but the discussion is good. I appreciate skeptics, even if this wasn’t Hank’s best work.",
                "author": "braclow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini 2.5 computer use",
        "score": 253,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are there any tools we can use to leverage this in our browser? OpenAI's Agent is 90% useless because every important website blocks it. Benchmarks don't matter if you can't use it lol.",
                "author": "FakeTunaFromSubway"
            },
            {
                "raw_content": "Cool but when 3.0???",
                "author": "llkj11"
            },
            {
                "raw_content": "Where did you get it from? Link?",
                "author": "Additional-Alps-8209"
            }
        ],
        "subreddit": "singularity"
    }
]