[
    {
        "post_name": "Glenn Beck: Asst. AG Harmeet Dhillon tells me that almost a YEAR into her tenure at the DOJ she's STILL fighting the Deep State within her department",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is why Dhillon should replaces Bondi. As well as getting results, Dhillon is upfront about the difficulty she encounters at her work while Bondi thinks she is doing a wonderful job.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Can these people not get fired?",
                "author": "zippy2"
            },
            {
                "raw_content": "God give us strength",
                "author": "Southernwhitebread2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former U.S. Marines cleaning and caring for President Trump's star in Hollywood. The military loves President Trump.",
        "score": 225,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# SEMPER # FUCKING # FIDELIS",
                "author": "USMC1234O10"
            },
            {
                "raw_content": "flash back to first term and videos of people defacing and destroying trump star.",
                "author": "Deplorable556"
            },
            {
                "raw_content": "I'm not impressed. I remember back in 2020 when a globalist pedophile named Biden committed an election coup and stole America. All of these uniformed military did nothing. Some turned their backs in protest during Biden's inauguration - thanks a fucking lot for your service.",
                "author": "Oliphaunt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats Approval numbers in Congress are the Worst Ever - Negative 55 Points!",
        "score": 219,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Their fraudulent mail-in ballot are the real voters with 100% approval rating.",
                "author": "Odyssey"
            },
            {
                "raw_content": "Yeah and some faggot posted a baris poll saying AOC is beating JD for 2028 president Lol, baris polls are utter bull shit.",
                "author": "Badfinz_FL"
            },
            {
                "raw_content": "So a poll shows this... we know all the polls are bullshit.... Nobody is seeing any arrests or better yet hangings? Start making examples of these fuckers and they will be just as pussified as normal law abiding citizens are. They call you a nazi, they call you a facist, they call you a communist.... while they shoot and assassinate normal people.... Start doing something about this, or you will have vigilante batman justice..... it's going to happen.... the peoples patience is running out.",
                "author": "PsychoDodo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A CIA whistleblower says the Seditious Six ran a textbook CIA-style destabilization operation, using the same tactics long used to topple foreign governments, this time aimed at overthrowing the US government itself.",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A 7th grader could see it was a CIA OP...they don't give a shit because there is absolutely no opposition or consequence.",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "good thing nobody gave a fuck",
                "author": "YodaBannon"
            },
            {
                "raw_content": "I needs me some hopium…",
                "author": "Sugz_Da_Feefth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Milwaukee Judge Hannah Dugan Found GUILTY of Obstruction For Helping Illegal Alien Evade ICE Agents – Faces 5 Years in Prison",
        "score": 926,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FINALLY! Pam, are you taking notes?",
                "author": "killedmytv"
            },
            {
                "raw_content": "Now's a good time to bring back the electric chair. ⚡⚡ # It's electric!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Ping me when shes in the orange jumpsuit behind bars.",
                "author": "MikeTruk"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The Senate just CONFIRMED *97* President Trump nominees, in a 53-43 vote",
        "score": 1161,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Almost a whole fucking year later. Useless assholes.",
                "author": "TruculentGoose"
            },
            {
                "raw_content": "All for show. Midterms are coming up so they need to make a good show for all the peasants to get them to vote for them again. Afterwards it'll be right back to being useless fucks for another couple years.",
                "author": "JimmyRussler"
            },
            {
                "raw_content": "This should have been done months ago. I'm not going to clap like a seal because they finally got off their asses and stopped obstructing Trump once the damage was already done, his momentum destroyed, the opportunity was lost, and now it's time for election season so they have to look like they're team players. I'm done being jerked around by this system. These people are traitors. They could have helped the MAGA movement. They stonewalled it. They could have actually served their voters. They chose their Uniparty allies and donors. They happily voted for money and bombs for Israel, but spend months avoiding voting for judges and US attorneys for America. It's always America last with these Congresscritters.",
                "author": "Moose_Antlers"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Michelea Ponce, the rancid bitch who cussed out and harassed the elderly Target employee for wearing a Charlie Kirk FREEDOM shirt, was CANNED",
        "score": 834,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Affluent White Feminist Liberals. The absolute worst.",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "\"Rancid bitch\".....I need to use that more often. Elucidating.",
                "author": "BadBrainsBuzzcocks"
            },
            {
                "raw_content": "Foul whore. I hope she is now unemployable for life.",
                "author": "arthur_morgan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Netflix Cancels LGBTQ-Themed Military Series ‘Boots’ After One Season Following Pentagon Calling It ‘Woke Garbage’",
        "score": 957,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They could make it just about the navy instead",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "I'm so tired of seeing Fat Faggots everywhere. Good riddance to this woke garbage.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Honestly as a Marine, and without knowing what I was getting myself into...I watched it. Unfortunately it's not super far off. The gay as fuck shit...happens in the USMC. Sad and I wish it wasn't true.",
                "author": "TearsAficionado"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐶 WTF? Officials are now reporting the Brown University shooter made a “𝙗𝙖𝙧𝙠𝙞𝙣𝙜 𝙣𝙤𝙞𝙨𝙚” before the attack...",
        "score": 698,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bala Bark Bar?",
                "author": "BritchesGetStitches"
            },
            {
                "raw_content": "Some actual news would be nice.... + Claudio Neves-Valenti (48) was found dead in a storage unit of self-inflicted gun wounds. + He was a graduate student at Brown circa 2000. + He lived in Florida. + He drove to Brown campus in rental car. + He shot up the Brown classroom in the engineering building where he was a prior student in 2000. + He then killed a former classmate who happened to be a fusion researcher at MIT. This story is very odd.",
                "author": "24601"
            },
            {
                "raw_content": "And what does \"Allah Akbar\" sound like? IT SOUNDS LIKE A GODDAMNED FUCKING BARKING NOISE! Fuck these guys.",
                "author": "Herpawinski"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Reports coming in the Brown University gunman killed himself",
        "score": 1073,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Or someone got to him first to cover it up.",
                "author": "Exsultate"
            },
            {
                "raw_content": "Two shots to the back of the head and a note saying \"nothing suspicious happened\"",
                "author": "Comingupblank"
            },
            {
                "raw_content": "Well the tranny percentage keeps going up and up",
                "author": "Winter_Is_Coming2020"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kennedy Center Board Votes to Rename It Trump–Kennedy Center",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can almost hear the liberal boomer heads explode.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "I'd prefer to leave it as is and focus on other aspects of his legacy.",
                "author": "SaltiTaralli"
            },
            {
                "raw_content": "Oh that's gonna cause a disturbance in the dark side🤣🤣🤣",
                "author": "DingleBalls"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Walz's Minnesota was such a big playground for fraud it drew 'fraud tourism'",
        "score": 1003,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I dont understand the title, minnasota is great for tourism, you can do charge back's for the bad hotel",
                "author": "TimWaltz"
            },
            {
                "raw_content": "I will say it again. Minnesota will not release SNAP data because it will show a State with 100,000 Somalis has 240,000 Somalis on SNAP.",
                "author": "footinmouth"
            },
            {
                "raw_content": "The commie democrats hate our country so much they should be labeled as terrorists.",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I'd like to believe Santa would be based.",
        "score": 1098,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know, in your heart of hearts, that he would be.",
                "author": "seeling0"
            },
            {
                "raw_content": "Saint Nicholas punched out that faggot heretic Arius at the Council of Nicaea. Yeah he was based.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Santa: (while flying over Kamala‘s house) HO HO HO!",
                "author": "leakmouth"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This video from Team Trump on TikTok is savage af! Best Christmas song of the season. 🎅🎄",
        "score": 677,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be selfish of us to hoard all of their contributions and talent. They must be returned abroad to enrich the whole world.",
                "author": "Zskills"
            },
            {
                "raw_content": "Best. President. Ever.",
                "author": "elmerecido"
            },
            {
                "raw_content": "real voice or AI? hilarious either way",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This great Trump is giving us 2 more federal holidays.",
        "score": 1313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For this year only. Presidents do it almost every year for Christmas eve",
                "author": "Schiffblower"
            },
            {
                "raw_content": "Great. Two more days that I either don't get paid for or don't get off. What's the status on Fort Knox?",
                "author": "Dallasguy"
            },
            {
                "raw_content": "How about Election Day?",
                "author": "mcoulton"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Sen. Markwayne Mullin ERUPTS after Bernie Sanders blocks a bipartisan bill to give kids fighting cancer more treatment options. I have NEVER seen him this mad. \"He's literally KILLING kids in front of us because of his political movement. And it is ridiculous. Therefore, I object.\"",
        "score": 1339,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am 100% against Bernie and 100% for Children having a chance. That being said, this video that is meant to stir emotions in zero way explained what the bill is or what Bernie did to block it.",
                "author": "USPatriot45"
            },
            {
                "raw_content": "Why is the government the one to decide which options patients get?",
                "author": "keeman"
            },
            {
                "raw_content": "I mean, it's par for the course. Leftists LOVE dead children.",
                "author": "MrCrispy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Whoopi Low-IQ-berg: Trump Giving Military Checks So They Do What He Wants⸻Yep, that's how it works. It's called *EMPLOYMENT*",
        "score": 1171,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a Christmas bonus, to veterans, you ABSOLUTE MISERABLE WOMAN",
                "author": "5DchessWatch"
            },
            {
                "raw_content": "\"Trump Giving Military Checks So They Do What He Wants\" Isn't that why ABC gives you a check you Retard?",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "As opposed to welfare? SNAP? Education handouts? Research grants? Subsidized Healthcare? Etc.",
                "author": "ThorsonTT"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kids notice things",
        "score": 776,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you ask them nicely for all of my bikes to be returned?",
                "author": "BahamaDon"
            },
            {
                "raw_content": "I'll take 'things that didn't happen for $1,000 please.'",
                "author": "sum1else"
            },
            {
                "raw_content": "Are the Krassensteins even real people? It’s like a never ending bot.",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "American shows how expensive Subway has gotten All the Chicken 6 inch subs are now $9 All of these sandwiches used to cost $5 for an entire footlong This is a 260% price increase, far outpacing inflation. Subway is owned by a private equity firm",
        "score": 191,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah I remember the catchy commercial they had about \"5 dollar foot longs\"",
                "author": "NYforTrump"
            },
            {
                "raw_content": "In the early 2000's I could get two footlongs for $7.50 on a Tuesday in Australia. Stopped buying it now it's like $15 for one.",
                "author": "ChuckthefistNorris"
            },
            {
                "raw_content": "I miss the old subway from the early 2000's when I was dangerously sick and the only thing that I ate and not vomited was a Meat-ball Sub. Now I make my own Meat-ball Subs and Its cheaper and tastes better.",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tim Walz is PANICKED now that the FBI has just RAIDED a Somali \"health services\" building after billions in Medicaid fraud was exposed. It's only getting worse in Minnesota.",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"let me ruin your city and waste your money\" - tim walz",
                "author": "abstr4ct"
            },
            {
                "raw_content": "I must say that this is promising. Asking the current FBI to make sense of anything that the Biden Administration left for them is proving to be a fool’s errand….but prosecuting the recently discovered crimes better be a damn different story. You have no excuse but to slam dunk this case.",
                "author": "brutustyberius"
            },
            {
                "raw_content": "When arresting Walz, if it ever happens, his LT. Gov needs to go with him.",
                "author": "redinmn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "G.Skill Releases Statement on Sharp Rise in Memory Prices Since Q4 2025",
        "score": 497,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> DRAM prices are experiencing significant industry-wide volatility, due to severe global supply constraints and shortages, driven by unprecedented high demand from the AI industry. As a result, G.SKILL procurement and sourcing costs have substantially increased. G.SKILL pricing reflect industry-wide component cost increases from IC suppliers and is subject to change without notice based on market conditions. Purchasers should be mindful of the pricing before purchasing. Thank you. That's the whole statement. \"Shit is fucked. You can tell because of the price!\"",
                "author": "MiloIsTheBest"
            },
            {
                "raw_content": "Spot pricing on PC components, my PC has become an appreciating asset, what a time to be alive.",
                "author": "the7egend"
            },
            {
                "raw_content": ">G.SKILL pricing reflect industry-wide component cost increases from IC suppliers and is subject to change without notice based on market conditions. Purchasers should be mindful of the pricing before purchasing. Thank you.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Critical motherboard flaw allows game cheats, Riot Games blocks 'Valorant' players that don't update BIOS — security patches pushed live by all major motherboard vendors",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hate cheaters but I'd rather not play the game than having a tech company running arbitrary code in the os kernel.",
                "author": "1mVeryH4ppy"
            },
            {
                "raw_content": "Welp, there goes their player base who is still rocking on old hardware and vendors dropped it's support long ago. Then again, I'm kinda curious on how much of that player base is left after Microsoft dropped support for windows 10 and some started to transition to Linux.",
                "author": "NomadicEngi"
            },
            {
                "raw_content": "We don't need a crystal ball to see what the next step these jackasses will demand is, do we?",
                "author": "INITMalcanis"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Significant 8 nm order at Samsung Foundry linked to futuristic Intel 900-series chipset",
        "score": 16,
        "text_content": "> Earlier in the year, Samsung's foundry business reportedly attracted a new set of orders from important clients. Instead of the \"still in-progress\" cutting-edge 2 nm GAA node process (aka SF2), key customers selected more mature production lines: 5 nm and 8 nm. Approximately seven months later, Intel is reportedly on Samsung Foundry's production order books, with semiconductor industry insiders disclosing details of a major deal. According to a two-day-old Hankyung news article, a next-gen Platform Controller Hub (PCH) design has been linked to a \"legacy-grade\" 8-nanometer node. Inside trackers reckon that Team Blue's futuristic mainboard chipset is heading towards mass production, with a \"full-scale\" phase anticipated next year. > > Speculation points to the eventual arrival of 900-series chipsets; destined to control \"Nova Lake\" desktop processors. In theory, a flagship variant—perhaps \"Z990\"—could be the first of Intel's 8 nm PCH products to reach retail by late 2026. Currently, the foundry service's Taylor, Texas-based facility—aka Samsung Austin Semiconductor—produces a selection of current-gen 14 nm chipsets for Team Blue. Back in South Korea, the Hwaseong 8 nm production line can pump out about 30,000 to 40,000 wafers per month. It is possible that Intel has favored Samsung's native operation due to a high level of node maturity and operational reliability. Isn’t the fact that Intel doesn’t manufacture these themselves - on a very mature 10 nm class node, which they should have plenty of - very alarming?",
        "comments": [
            {
                "raw_content": "> futuristic In what sense, tpu? Anyway, I think the essentially-confirmed-rumor is that in their long struggle to make 10nm/intel7 a usable node, it became *very* expensive, so using samsung is standard cost cutting.",
                "author": "VastTension6022"
            },
            {
                "raw_content": "The Intel 7 node is insanely expensive due to the extensive use of DUV multi-patterning. Low value products like chipsets wouldn’t be financially feasible on Intel 7. Samsung 8nm is fine for a chipset, very mature, and dirt cheap. It must make more financial sense to use it than to use Intel 7 or to keep a 14nm fab operating.",
                "author": "EJ19876"
            },
            {
                "raw_content": "So all of Intel's latest chips are outsourced? What's the point of having a foundry?",
                "author": "1mVeryH4ppy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600 - Samsung Semiconductor",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Samsung 2nm GAA >CPU >1x Arm C1-Ultra @ 3.8 GHz >3x Arm C1-Pro @ 3.25 GHz >6x Arm C1-Pro @ 2.75 GHz >Armv9.3 SME2 >GPU >Samsung Xclipse 960 >Memory >LPDDR5X >Storage >UFS 4.1",
                "author": "FragmentedChicken"
            },
            {
                "raw_content": "This looks surprisingly interesting. * Heat Path Block is neat [so the DRAM package doesn't fully cover the SoC package](https://www.sammyfans.com/2025/12/18/samsung-exynos-2600-chip-heat-path-block/). Samsung claims -16% lower thermal resistance. * *Actually* new Arm cores and on-time, unlike Exynos 2500. Thankfully, not a long gap after Exynos 2500 (June 2025). * 1x \"Prime\" C1-Ultra core and 9x \"Big\" C1-Pro cores sounds like a lot. Do we need that many?… * Will go into the Galaxy S26, so hopefully we'll see way more tests vs Exynos 2500. * Lower clocks vs D9500: lower perf, less power or lower perf, more power? Samsung is usually the latter. * This is likely SF2, which is Samsung's 3rd generation \"3nm\" node. Not unlike TSMC that drops a number on future iteration (e.g., N5 → N4). Except this was not planned lol because … * SF**2**[ is a renamed SF3P](https://www.tomshardware.com/pc-components/cpus/samsung-foundry-renames-3nm-process-technology-to-2nm-production-node-following-industry-trends-report), which itself was a renamed 3GAP+. So: |Old Name|Current Name|Generation|Products| |:-|:-|:-|:-| |3GAE|SF3E|1st gen 3nm GAA|Crypto ASIC Whatsminer M56S++| |3GAP|SF3|2nd gen 3nm GAA|Exynos 2500, Exynos W1000| |3GAP+|SF3P → SF2 |3rd gen 3nm GAA|Exynos 2600| [I think I have that right.](https://web.archive.org/web/20250409145548/https://www.anandtech.com/show/21444/samsung-foundry-unveils-updated-roadmap-2nm-evolution-through-2027)",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "I believe this means now only Google's Tensor G5 & Xiaomi's ORING O1 are the last two \"flagship\" smartphone SoCs with small cores (e.g., A55 and its successors). Apple is all big + medium. Qualcomm is all big + medium (on flagship SoCs). MediaTek is all big + medium (on flagship SoCs). Exynos is *now* all big + medium (on its flagship SoC). Xiaomi & Google have both maintained 2x A520 cores.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600: Official Introduction | Samsung",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Leaker Believes Samsung Exynos 2600 Mobile Chip Will Feature AMD \"JUNO\" iGPU",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It would be hilarious if a Samsung chip has newer RDNA IP compared with AMD’s own APUs.",
                "author": "Earthborn92"
            },
            {
                "raw_content": "Is Juno expected to be a mobile version of RDNA4?",
                "author": "Vb_33"
            },
            {
                "raw_content": ">PhoneArt reckons that the prime core will reach a maximum clock frequency of 3.9 GHz. A commenter, Erencan Yılmaz, reckons that this figure should be reduced to 3.8 GHz, due to power consumption considerations when looking at a 2 nm GAA-based design. What does this even mean? Are they implying that GAAFETs have poor power frequency scaling at the highest end of the V/F curve or something? Anyway, interesting to see the % Fmax gap between TSMC and Samsung based designs for the P-cores remain around the same.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "omg this is so nice looking and has music 😭",
        "score": 134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you go all the way to the bottom you can get the snowmen to pop up! Cool little Easter egg",
                "author": "JustinCaselol"
            },
            {
                "raw_content": "Ooh we're slowly getting back some personality",
                "author": "staleferrari"
            },
            {
                "raw_content": "Perhaps there is some hope for custom themes",
                "author": "Plate-Alive"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "what are you picking up this holiday sale?",
        "score": 332,
        "text_content": "Finally picked up NieR: Automata after wanting to play it for ages! Hades 2 I’ve heard great things about, and even though I’ve already played Hades being able to play it on the go will be awesome. I’m still debating getting Red Dead Redemption. What do you guys think?",
        "comments": [
            {
                "raw_content": "Nothing because I’m broke from Christmas shopping lmao",
                "author": "OneAxyboi"
            },
            {
                "raw_content": "I wish they'd add a shopping cart feature to the eshop.",
                "author": "KingBroly"
            },
            {
                "raw_content": "Just got Portal collection, super meat boy 1 and 2",
                "author": "SolidStudy5645"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Super Mario Galaxy + Super Mario Galaxy 2 Updated To Version 1.3.0, Here Are The Full Patch Notes",
        "score": 26,
        "text_content": "Super Mario Galaxy: Ver. 1.3.0 (Released December 18, 2025) General: Several issues have been addressed to improve the gameplay experience on both Nintendo Switch 2 and Nintendo Switch. Several other issues have been addressed to improve the gameplay experience on Nintendo Switch 2. Note: The software must be updated to Ver. 1.2.0 or later to play on Nintendo Switch 2. Super Mario Galaxy 2: Ver. 1.3.0 (Released December 18, 2025) General: Several issues have been addressed to improve the gameplay experience on both Nintendo Switch 2 and Nintendo Switch. Several other issues have been addressed to improve the gameplay experience on Nintendo Switch 2. Note: The software must be updated to Ver. 1.2.0 or later to play on Nintendo Switch 2.",
        "comments": [
            {
                "raw_content": "\"Here is what we've fixed: - We fixed several things.\"",
                "author": "Low-Comment-5093"
            },
            {
                "raw_content": "Least vague Nintendo Patch Notes.",
                "author": "Makosharck"
            },
            {
                "raw_content": "so, does this mean better stability?",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Starting today, both the Paddock and Skyah in Kirby Air Riders will feature a special Winter themed design for a limited time!",
        "score": 31,
        "text_content": "[Source - Air Riders Japanese Twitter Account](https://x.com/kirbyairriderjp/status/2001857524686094473)",
        "comments": [
            {
                "raw_content": "That’s pretty sick",
                "author": "Federal-Grass9880"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Holiday Sale now live in Europe",
        "score": 222,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sparks of Hope 90% off? Nice",
                "author": "REDOREDDIT23"
            },
            {
                "raw_content": "Time to buy more games I don't have time to play!",
                "author": "CalypsoSauvin"
            },
            {
                "raw_content": "Damn, £4.50 on Sparks of Hope is a steal. Don't sleep on that.",
                "author": "kahabraham"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is the Official Switch 2 Pro Controller still the only controller with wake function?",
        "score": 76,
        "text_content": "Or have third party controllers finally have this added? Recommendations?",
        "comments": [
            {
                "raw_content": "Some of the 8bitdo controllers work with the latest firmware I'm not sure which ones exactly though",
                "author": "SirDanOfCamelot"
            },
            {
                "raw_content": "The GameCube NSO controller wakes it up too I think",
                "author": "NewDamage31"
            },
            {
                "raw_content": "Gamesir clyclone 2 ,8bitdo pro 3 ,gulikit es easysmx d10? That's all i know from the top of my head my need a software update to get them working my personal favorite is the clyclone 2",
                "author": "69_pablito_69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Lord Captains! The first patch for the Nintendo Switch version is now live (but it may take a few additional hours to land in various regions). Here’s what it brings:",
        "score": 107,
        "text_content": "**Patch Notes:** * Added mouse support via Joy-Con, * Fixed a crash on the loading screen after character creation, * Corrected some localization issues, * A few minor performance updates (we will continue working on performance improvements in future updates), **Important recommendations:** * We strongly recommend installing the game on the internal system memory, not on an SD card, * Please restart your Nintendo Switch before playing to ensure the patch is applied correctly, * Thank you for your support! We hope this patch makes your journey in the Koronus Expanse more enjoyable, and we’ll keep working to make the game even better.",
        "comments": [
            {
                "raw_content": "loved the game, i’m still debating if i should buy it again on switch 2. strongly recommend tho",
                "author": "mad-suker"
            },
            {
                "raw_content": "I don't mean to be that guy, but I'm gonna, why did it get released in such a rough state to begin with?",
                "author": "TheMoonMaster"
            },
            {
                "raw_content": "Please improve the resolution, I appreciate it is a great game. I would lock it at 30 fps and try improve visuals it can be painful on the eye",
                "author": "Fun-Document7"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I just noticed the controller Nyxi used in their photo is already broken.😅",
        "score": 369,
        "text_content": "It's a little pricey too at $118. I like the shape (similar to the Mobapad M6 HD) but I don't like the light strip thing.",
        "comments": [
            {
                "raw_content": "Rgb on controllers are so useless, just to drain the battery even more.",
                "author": "kahabraham"
            },
            {
                "raw_content": "Bro that looks cheaper than a Amazon recommended phone controller. I know it might not feel as cheap made as it looks in person, but that is wild at $120.",
                "author": "QuinSanguine"
            },
            {
                "raw_content": "Nyxi is always selling cheap plastic with bright lights",
                "author": "ChaosKinZ"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Schreier: Naughty Dog Studio Orders Employee Overtime for ‘Intergalactic’",
        "score": 1312,
        "text_content": "[https://www.bloomberg.com/news/articles/2025-12-18/sony-s-naughty-dog-studio-orders-employee-overtime-on-intergalactic?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2NjA4NTY0MSwiZXhwIjoxNzY2NjkwNDQxLCJhcnRpY2xlSWQiOiJUN0hDRFNLR0lGUEUwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.jGluGdyZVa1EEBKJKLlY2aRo0tCwewmOk2TBd\\_9y2Iw](https://www.bloomberg.com/news/articles/2025-12-18/sony-s-naughty-dog-studio-orders-employee-overtime-on-intergalactic?accessToken=eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJzb3VyY2UiOiJTdWJzY3JpYmVyR2lmdGVkQXJ0aWNsZSIsImlhdCI6MTc2NjA4NTY0MSwiZXhwIjoxNzY2NjkwNDQxLCJhcnRpY2xlSWQiOiJUN0hDRFNLR0lGUEUwMCIsImJjb25uZWN0SWQiOiJCMUVBQkI5NjQ2QUM0REZFQTJBRkI4MjI1MzgyQTJFQSJ9.jGluGdyZVa1EEBKJKLlY2aRo0tCwewmOk2TBd_9y2Iw) [https://bsky.app/profile/did:plc:2mkgbhbhqvappkkorf2bzyrp?ref\\_src=embed](https://bsky.app/profile/did:plc:2mkgbhbhqvappkkorf2bzyrp?ref_src=embed) By [Jason Schreier](https://www.bloomberg.com/authors/AUvqMRVAZCw/jason-schreier) >*For the last seven weeks, Naughty Dog has enacted mandatory overtime for staff to finish an internal demo of their next game, Intergalactic. The game won't be out until 2027, leaving some staff wondering: If they're crunching now, what will next year be like?*",
        "comments": [
            {
                "raw_content": "#Jason Schreier is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": ">Earlier this year, members of the production team were each given customized metal coins that seemed to capture, purposefully or not, the current state of the studio’s workplace attitude. On one side was the company’s paw-print logo. On the other, a quote from the trailer for Intergalactic: The Heretic Prophet: “The suffering of generations must be endured to achieve our divine end.” If you wrote this as a metaphor for a story you'd be called cliched and unoriginal, but reality is dumber than fiction.",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "Intergalactic: The Heretic Prophet is targeting a mid-2027 release. >The game is slated for release in mid-2027, according to the people familiar with the schedule.",
                "author": "Zhukov-74"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bloomberg: Riot is overhauling League of Legends in 2027. Codenamed as 'League Next'",
        "score": 591,
        "text_content": "\"Riot Games is working on a major overhaul of its flagship game League of Legends, a title played by more than 100 million people every month. The upcoming version, internally called League Next, is slated to be the biggest update in the title's history, according to five current and former employees. It is planned for released in 2027.\" \"The game's visual aesthetic, including characters, the user interface and battle arenas, will be re-imagined so League of Legends can appeal to more new players. Developers are also reworking the technical underpinnings so it's easier to push out updates. Riot recently added new keyboard controls that may prove easier for newbies. Internally, a re-organization of employees has also been announced, said the people, who asked to not be identified because the plans haven't been made public. A spokesperson for Riot declined to comment.\" \"While League of Legends has fared better than some competitors in the slow-growing video-game business, its player base has dropped off, according to the people Bloomberg News spoke with. Valorant, another Riot title, makes more money.\" Source: https://www.bloomberg.com/news/articles/2025-12-18/riot-has-a-secret-plan-to-remake-its-league-of-legends-game",
        "comments": [
            {
                "raw_content": "Every character removed, except the ones from Arcane",
                "author": "ninjupX"
            },
            {
                "raw_content": "Very weird to read that Valorant generates more revenue than League.",
                "author": "Thomas6777"
            },
            {
                "raw_content": "They’re basically pulling a CS2 on League, about time, the game’s engine is super dated and the code is beyond rewriting, they basically need to start over.",
                "author": "HearTheEkko"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Rebs Gaming: Halo Studios is planning to remake the Halo trilogy.",
        "score": 418,
        "text_content": "Source: https://youtu.be/Klr-B5pd_pE?si=bhduecaeqaIcOdit After recently speaking to a former Halo Studios developer and gathering information from others, Rebs Gaming says Halo Studios is planning to remake the original Halo trilogy (Halo 1-3). Previously the Halo Leaks Twitter account started this rumor, and Rebs is confirming it. They also share evidence from another source who was right about Campaign Evolved.",
        "comments": [
            {
                "raw_content": "Remake ODST, cowards",
                "author": "TAJack1"
            },
            {
                "raw_content": "My guess is something like this: \\- one Free-to-play multiplayer game \\- Remakes of the Bungie campaigns \\- possibly all on one launcher",
                "author": "4000kd"
            },
            {
                "raw_content": "I mean, is this really a surprise? It was pretty obvious this first remake was just the start.",
                "author": "OwnAHole"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Square Enix has just released the soundtrack for Drag on Dragon 3 (Drakengard 3) on Steam.",
        "score": 243,
        "text_content": "Mysteriously, Square Enix has just released the entire Drakengard 3 soundtrack on Steam. Could this be marketing for an announcement of a port or remaster? [Source](https://store.steampowered.com/app/4165230/Drakengard_3_Original_Soundtrack/)",
        "comments": [
            {
                "raw_content": "We already got Drakengard 1 soundtrack on steam/ spotify earlier this year and no ammount of copium manifested a new Yoko Taro game so I wouldn't expect anything",
                "author": "raizeL45"
            },
            {
                "raw_content": "Major copium for a full on remake for Drakengard 3. Please, Yoko Taro.",
                "author": "coco_puffsz"
            },
            {
                "raw_content": "It looks like an effort by Square Enix Music. They've been releasing soundtracks every couple weeks including the Brave Exvius soundtracks, the original Drakengard, Nier Reincarnation, most of the Mana games.",
                "author": "astrogamer"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Reportedly Draws Interest From AMD and NVIDIA in Its 14A Process for Server Offerings, as External Customers Start to Line Up",
        "score": 98,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does intel 10A still come out as scheduled in 2027? I googled it and found out intel said the 10A will come out in 2027, but this was old news in 2024.",
                "author": "ArQ7777"
            },
            {
                "raw_content": "[deleted]",
                "author": "None"
            },
            {
                "raw_content": "GFHK also has 14a for Razor and Coral Rapids in 2H 2027, so I'm taking what they are saying with very little credibility. Plus, we had very similar rumors during 18A, and that went nowhere. Fool me once...",
                "author": "Geddagod"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Gamers and reviewers are calling AMD to revive Ryzen 7 5800X3D",
        "score": 1414,
        "text_content": "",
        "comments": [
            {
                "raw_content": "got my 5800x3d years ago best purchase ever. I was ever so hesitant from coming from the 3700x cpu but the magic that was 3d cache can not be underestimated. now if we can just get a big amd gpu i wouldn't have to worry for a while. sad fact that pc parts are getting artificial scarcity cause ram makers well we don't want to scale growing demand we just want to price gouge. Just hope this ai bubble pops in all of these companies faces",
                "author": "MassiveGG"
            },
            {
                "raw_content": "Plan to rock mine until AM6",
                "author": "throwaway123454321"
            },
            {
                "raw_content": "I feel like they won’t considering production has been shut down for over a year. The 5700x3D, 5600x3D and 5500x3D are made from already existing 5800x3D chips that failed QA. I don’t think any AM4 x3D silicon has rolled off the assembly line since last September. Maybe they could do a Rocket Lake style back port and get a newer Zen running on AM4. Again it’s probably not worth the effort unless next year’s market is catastrophic. Intel allegedly still has Bartlett Lake in the pipeline which would be a 12 P-Core DDR4 CPU with no E-Cores.",
                "author": "dparks1234"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Lenovo reportedly plans a SteamOS Legion Go Gen 2 for CES 2026, powered by Ryzen Z2 Extreme",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "I'm fine with my recently acquired legion go s z1 extreme, which I snacked for 500€. 1500€ for a handheld is... Well, a desktop already.",
                "author": "CreepHost"
            },
            {
                "raw_content": "would be nice, depending upon the price",
                "author": "WarEagleGo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Announcing the Limited Edition TUF Gaming Radeon RX 9070 XT COD BO7 Special Edition Graphics Card - Available for Pre-Order Now (US)",
        "score": 19,
        "text_content": "ASUS today announced that Pre-Orders are now available for the Call of Duty: Black Ops 7 Special Edition of the TUF Gaming Radeon RX 9070 XT graphics card, created in collaboration with AMD and Call of Duty. This unique graphics card features the Call of Duty: Black Ops 7 insignia with orange accents in signature Black Ops style. This limited-edition card - only 1000 cards will be produced - will be sold at select retailers around the world and bundled with a digital copy of the standard PC version of the game. * The new RDNA 4 architecture * 16GB GDDR6 VRAM * Next-gen HYPR-RX tech delivers ultra-fast gaming * New AMD AI-powered technologies, including an improved experience with ray-tracing. * AMD Software with the new ML-Powered AMD FSR 4 Upscaling Technology compatible with select FSR 3.1 games provide an incredible balance of detailed images and fluid frame rates. * DisplayPort 2.1 outputs give users massive bandwidth for going big on resolution while supporting high-end refresh rates # FAQ **When available for Pre-Order?** * Now. Available on the ASUS eShop. **Where else will it be available?** * US - Newegg, Microcenter * CA - Canada Computer **What's included?** * ASUS TUF Gaming Radeon RX 9070 XT COD BO7 Special Edition Graphics Card * Call of Duty: Black Ops 7 (Standard Edition)\\* * COD Black Ops TUF Gaming graphics card holder \\*Redeemable through our [COD BO7 redemption page](https://www.asus.com/events/infoM/activity_call-of-duty-black-ops-7). **Where can I learn more?** * [US product page](https://www.asus.com/us/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070xt-o16g-cod-bo7/) * [CA (EN) product page](https://www.asus.com/ca-en/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070xt-o16g-cod-bo7/) * [CA (FR) product page](https://www.asus.com/ca-us/motherboards-components/graphics-cards/tuf-gaming/tuf-rx9070xt-o16g-cod-bo7/) **Additional specs and features of the TUF Gaming Radeon 9070 XT COD BO7 Special Edition cards:** This limited, special edition graphics card is a collaboration between ASUS, AMD, and Call of Duty: Black Ops 7. Its customized chassis and backplate feature Black Ops 7 elements and iconography, including the Black Ops 7 icon and orange accents in signature Black Ops style. Inside is the venerable Radeon RX 9070 XT GPU with the latest RDNA 4 architecture from AMD, 16GB of VRAM, the HYPR-RX feature set and a super-resolution mode that leverages machine learning. **Phase-Change Thermal Pads Provide a Long-Lasting Cooling Experience** When transferring heat, the electrically non-conductive pad is a solid at room temperature but liquifies as it heats up. As it melts, it fills the microscopic gaps between the GPU and thermal module, providing superior thermal conductivity and enhanced heat dissipation, ensuring optimal performance, even for sustained, heavy GPU workloads. Additionally, the phase-change thermal pads offer exceptional longevity. They outlast traditional pastes by a significant margin, even for graphics cards that see heavy workloads on a regular basis. **ASUS GPU Tweak III Software** \\- Some gamers prefer to tune their graphics cards for all-out performance, while others insist on quiet operation. A physical Dual BIOS switch lets users choose between performance and quiet modes without installing additional software. For more performance-tuning options, easy hardware monitoring and granular control of fan behavior, users can download the free ASUS GPU Tweak III software. **ASUS GPU Guard & Bracket** \\- ASUS GPU Guard applies adhesive to secure all four corners to reduce the risk of cracks, while a GPU bracket helps ensure uniform mounting pressure and extra stability. **Protective PCB Coating** \\- A protective conformal coating envelops the circuit board to help protect against short-circuits caused by moisture, dust or debris. * 3.125-slot design with a vented exoskeleton and massive fin array optimized for airflow from three Axial-tech fans * Three eleven-blade Axial-tech fans maintain a steady high-pressure stream of cooling through a massive airflow-optimized fin array. * Dual-ball fan bearings last up to twice as long as conventional sleeve-bearing designs. * 0dB technology allows the fans to turn off at low workloads and effectively become silent. * Dual BIOS switch to toggle between Performance and Quiet BIOS profiles. * Subtle RGB lighting on the TUF Gaming logo on the corner of the card can be configured through Aura Sync What do you think about this collab and the card design? Let us know in the comments below!",
        "comments": [
            {
                "raw_content": "I rather have the Miku version",
                "author": "Bro0k"
            },
            {
                "raw_content": "That thing should be at least $50 cheaper than the regular version.",
                "author": "AincradResident"
            },
            {
                "raw_content": "Perfect for when something goes wrong ASUS will be of no help in the customer service department",
                "author": "nedockskull"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Google’s real estate listings ‘experiment’ sends Zillow shares down more than 8%",
        "score": 143,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But their stock’s Zestimate still remains +30%",
                "author": "ChadsworthRothschild"
            },
            {
                "raw_content": "Please bring on the AI agents to replace the bottom feeders.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "Where’s the link to this so called Google listing experiment",
                "author": "ICPcrisis"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pending Home Sales Fall 6%, the Biggest Drop in Nearly a Year",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "House hunters are retreating amid high housing costs and a seasonal slowdown, leading prospective sellers to pull back, too. U.S. pending home sales fell 5.8% from a year earlier during the four weeks ending December 14, the biggest decline since the start of 2025. On a metro level, pending sales declined in all but six of the 50 most populous U.S. metro areas, with the biggest drops in San Jose, CA (-35.1% year over year), Houston (-20.9%), and Oakland, CA (-17.6%). The typical U.S. home that does sell is taking 52 days to go under contract, about a week longer than last year. House hunters are hesitant this holiday season because mortgage rates are stubbornly sitting above 6%, and home-sale prices are rising, putting homes out of reach for many would-be buyers. Additionally, many prospective buyers are waiting for clearer signals on the economy before they make a major purchase; some are concerned about job security amid signals of weakness in the labor market. Another reason pending sales are declining year over year: Sales increased around this time last year after the uncertainty leading up to the 2024 presidential election had passed. Slow homebuying demand is pushing would-be sellers to the sidelines, too. New listings are down 3.1% year over year, the biggest decline in more than two years. The total number of homes for sale is up just 4.2%, the smallest increase since the start of 2024. Many prospective sellers are reluctant to list their home while the market is tilting toward buyers, with some waiting until the new year to see if demand improves. “Mortgage rates are buyers’ biggest concern. They want to make sure they’re not paying too much every month,” said Tracy Edwards, a Redfin Premier agent in Raleigh, NC. “My advice to sellers is to carefully consider the buyer’s perspective: If a buyer is taking on a high monthly payment, they want the house to be near perfect and the sale price to be fair. Be open to negotiations around repairs and seller concessions, and be realistic about the asking price. It’s better to sell a home quickly than let it linger on the market.”",
                "author": "SnortingElk"
            },
            {
                "raw_content": "“IT’s sEaSoNaLiTy!!!” Maybe it is, maybe it’s really that bad. I don’t know, and I don’t fucking care anymore. As far as I can see, Americas economy is just wealthy people trading assets between one another now.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "Rates aren’t my concern. My concern is the majority of houses on the “lower end” are shitholes the seller picked up 3 years ago for half the price, if not less.",
                "author": "myturn19"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuilder Lennar Cuts Prices by 10% as CEO Admits Buyers Face an ‘Affordability Crisis’",
        "score": 375,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's impressive how quickly some home builders have dropped their prices.",
                "author": "WufBro"
            },
            {
                "raw_content": "I use to work for a Texas home builder. The constant feedback from sales was potential buyers even with good credit didn’t like the price or the mortgage they were getting and would easily compromise for our competitors. During our monthly PM meetings I would bring up these issues, you know because I thought it was my job to let my bosses know how people on the ground level were feeling, and what they were saying. I was then randomly terminated for performance with several other PMs. From the looks of it, they continue to cut people, not willing to budge on price. Once the price went up after these few years, they don’t want to go back.",
                "author": "gocoogsgo"
            },
            {
                "raw_content": "An affordability crisis caused by shitty builder practices. Hey! Buy a generic, garbage, new construction house for 40% over market, then immediately spend $100k fixing all of the sub code issues where said builder skimped and cut corners.",
                "author": "Moobygriller"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Lennar Further Cuts Average Sales Price of New Homes, to Lowest since 2017, -25% from Peak: That’s what this Housing Market Needs",
        "score": 29,
        "text_content": "https://wolfstreet.com/2025/12/17/lennar-further-cuts-average-sales-price-of-new-homes-to-lowest-since-2017-25-from-peak-thats-what-this-housing-market-needs/",
        "comments": [
            {
                "raw_content": "If Lennar drops new come prices, used (occupied) home prices will drop as well. This is a good sign.",
                "author": "blehbleh1122"
            },
            {
                "raw_content": "You’d have to be more like 75% off for me to be interested in a lennar home.",
                "author": "regaphysics"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "November consumer prices rose at a 2.7% annual rate, lower than expected",
        "score": 56,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does anyone actually still believe this? The lies are absurd, flagrant and an insult to everyone’s intelligence at this point.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Those numbers don't mean shit anymore.",
                "author": "subZro_"
            },
            {
                "raw_content": "Read the report and see how many components were excluded 🤦‍♂️",
                "author": "Wbcn_1"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Why new home listings are falling sharply and what it means for buyers and sellers",
        "score": 24,
        "text_content": "Latest housing market data shows that new home listings in the U.S. fell about 1.7 percent from a year ago, marking the largest drop in more than two years. At the same time, pending home sales also declined, and homes that do go under contract are taking longer to sell. This suggests both buyers and sellers are hesitant heading into the end of 2025. From an investor or buyer perspective, a few points stand out: Supply is tightening, even as demand is lukewarm, which helps support prices. Many sellers may be waiting for a clearer market before listing, especially with economic uncertainty and mortgage rates still above 6 percent in many areas. Homes that do sell are taking more time to move, meaning buyers may have more negotiating room if they are patient. All of this points to a market where buyers are cautious and sellers are holding back, creating a sort of stalemate that could keep prices more stable than dropping sharply. For those watching 2026 trends, this kind of data might mean key housing themes will be pricing stability, selective demand, and slow listing activity rather than a big crash or surge. Anyone seeing this pattern where you live?",
        "comments": [
            {
                "raw_content": "The only pattern I’m seeing is the same seasonality that happens every year. Supply and demand decrease in the winter and increase in the spring every year. Nothing new to report. It’s clearly visible on Redfin Data Center’s 4 year chart: https://www.redfin.com/news/data-center/",
                "author": "drst0ner"
            },
            {
                "raw_content": "supply isn't actually tightening, all those delisters will be back in spring 2026, creating a glut of supply and a big pool of motivated sellers",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "That makes sense, supply tightening is the most rational conclusion considering the last two years we're record years for the number of sales of homes. Oh wait.",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Most Splendid Housing Bubbles in America: Price Drops & Gains in 33 Large Expensive Metros in November 2025",
        "score": 6,
        "text_content": "https://wolfstreet.com/2025/12/16/the-most-splendid-housing-bubbles-in-america-price-drops-gains-in-33-large-expensive-metros-in-november-2025/",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inflation Came in Lower Than Expected; A Surprisingly Strong Slowdown in Housing Inflation Drove It.",
        "score": 12,
        "text_content": "\\>The CPI’s housing inflation measure, the shelter index, increased 3% year over year in November. \\>That was a significant pullback from the 3.6% year-over-year gain reported in September and a large deceleration from the 4.8% annual growth logged in November 2024.",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Makeup is an art",
        "score": 2117,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You want me to give you an „exploded-view“ of a real person?? It’s not gonna be pretty either.",
                "author": "Altruistic-Skill8667"
            },
            {
                "raw_content": "https://preview.redd.it/qujcb213q18g1.jpeg?width=736&format=pjpg&auto=webp&s=2b3bf7eca74cc17b3a96ea6f80d51f3cbbb84228",
                "author": "flirt-n-squirt"
            },
            {
                "raw_content": "https://preview.redd.it/ubnim6wps18g1.png?width=500&format=png&auto=webp&s=0149ab6c206a4bf7ac627734c061ea73cdcdfa7a",
                "author": "PobrezaMan"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "It’s over. GPT 5.2 aces one of the most important benchmarks and it’s not even close!",
        "score": 1570,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Alright this got me",
                "author": "Sekhmet-CustosAurora"
            },
            {
                "raw_content": "i don't think google can catch up on this one...",
                "author": "ArtArtArt123456"
            },
            {
                "raw_content": "RIP the old version. Long live the new version.",
                "author": "LucidOndine"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "sell me this pen",
        "score": 1313,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Note: No AI was used in the production of this meme.",
                "author": "BarrelStrawberry"
            },
            {
                "raw_content": "They’re not lending it, they’re making an equity investment. Open AI doesn’t have the cash to make the capital investments that they need to scale up. They have two realistic options: (1) sell shares on the market, pay fees to an underwriter, incur risk on pricing and fulfillment, Open AI pays fees, investors pay fees, take additional time and then use that money to make the capital investment or (2) quickly get the investment in kind at favorable terms immediately from one investor at a time, each an eager supplier. Because the investment is ultimately in-kind, Nvidia is no doubt giving them much better terms than outside investors buying through a broker and an underwriting investment bank. Not to mention this has the added benefit of making their suppliers and their customers dependent on their success. It’s win-win for Open AI and their supplier/customer investors. How you and the market price this is important, as the equity price that Nvidia is willing to pay may not be the same as independent investors.",
                "author": "Ok-Improvement-3670"
            },
            {
                "raw_content": "Taking this at face value, it's not particularly weird. It's exactly what a car company does when you finance a car.",
                "author": "NNOTM"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Big Collab: Google DeepMind and OpenAI officially join forces for the \"AI Manhattan Project\" to solve Energy and Science",
        "score": 523,
        "text_content": "In a historic and unexpected move, the two biggest rivals in AI have just officially joined the same team. Both **Google DeepMind** and **OpenAI** have signed on as lead industry partners for the U.S. Department of Energy’s (DOE) **Genesis Mission**. **Why this is a \"Singularity\" moment:** The DOE is calling this a national effort comparable to the **Manhattan Project**. Instead of fighting over chatbots, the world’s top labs are now combining their reasoning models with the government’s **17 national laboratories** and supercomputers to double American scientific **productivity by 2030.** **The Unified Mission:** * **Google DeepMind:** Bringing Gemini 3’s reasoning to **fusion plasma simulation**, climate modeling and exploring new search spaces for materials. * **OpenAI:** Integrating their frontier models with massive federal datasets to automate complex research workflows and test new scientific hypotheses. * **The Goal:** Achieving breakthroughs in **sustainable fusion power**, quantum computing algorithms and national security through a unified AI platform. **Sources:** * [Google DeepMind Blog](https://deepmind.google/blog/google-deepmind-supports-us-department-of-energy-on-genesis/) * [OpenAI Blog](https://openai.com/index/us-department-of-energy-collaboration/)",
        "comments": [
            {
                "raw_content": "Surprisingly, the government is doing a good job of bringing siloed efforts together. (The Manhattan Project was publicly funded. What's new here is that convergence of company-specific efforts). That should speed up implentation, which may result in novel discoveries. I do not think either company will disclose its secret sauce to make better AI, AGI or ASI itself.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "Push for fusion. We get fusion largely everything else does fall into place. Yes, I’m hugely simplifying it, but it’s that big a deal that it should be of national importance to do so.",
                "author": "MC897"
            },
            {
                "raw_content": "Seeing DeepMind and OpenAI on the same side is wild. Your thoughts guys?",
                "author": "BuildwithVignesh"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Santa is back for something special",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kino",
                "author": "stinkyjim88"
            },
            {
                "raw_content": "Amazing",
                "author": "TheHimalayanRebel"
            },
            {
                "raw_content": "AI slop, just what we all want. Fantastic post!!",
                "author": "testaccount123x"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Robot Learns 1,000 Tasks in a Single Day, Researchers Demonstrate",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I fear not the man who has practiced 1000 tasks. I fear the robot that can simulate practicing each of 1000 tasks 10,000 times an hour and works 24 hours a day for no pay or benefits and a rich person owns 100,000 of them. -Bruce Lee…?",
                "author": "AndrewH73333"
            },
            {
                "raw_content": "I successfully figured out how to operate my new coffee maker today. So there.",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "*\"I fear not the man who has practised 10000 kicks once* but I fear one who has practised one kick 10000 times\".",
                "author": "Normaandy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "2 Weeks ago I had a late-night conversation with Grok who got me to demand the CT scan that saved my life from a ruptured appendix (December 2025) Life is now a Dream.",
        "score": 525,
        "text_content": "",
        "comments": [
            {
                "raw_content": "yeah i regularly use gemini for reports analysis and it's diagnosis is on point. LLMs are great at finding patterns and analysis",
                "author": "kvothe5688"
            },
            {
                "raw_content": "Doctors can be terrible. I remember being examined and told that I probably just needed a poo when the lining of my stomach was torn. I was describing how eating was causing me a load of pain. They felt my stomach and said \"yep, you just need a poo\". Fuck those cunts. I'm so fucking tired of people being shit at the job. Honestly, thank fuck for AI so we can sense check the bullshit answers they give us.",
                "author": "Morazma"
            },
            {
                "raw_content": "Had you had the late night conversation with an EM Fellow you would have likely arrived at the same conclusion.",
                "author": "valuat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI likely to displace jobs, says Bank of England governor",
        "score": 16,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Shocker",
                "author": "socoolandawesome"
            },
            {
                "raw_content": "So we’re telling graduates to spend 4 years and £50k on a degree just to be told they’re overqualified for an internship that was replaced by a Python script? Makes perfect sense",
                "author": "jravi3028"
            },
            {
                "raw_content": "He meant AI is likely to change the job market, but in the medium term more jobs will be created than destroyed; Especially as the UK spends more capital on defense while rolling back social spending.",
                "author": "Any_Pressure4251"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Mistral releases OCR 3: A new frontier in document AI with a 74% win rate over competitors and handwriting support",
        "score": 198,
        "text_content": "Mistral AI just dropped a major upgrade to their document intelligence stack. **Mistral OCR 3** is a much smaller, faster model that is specifically optimized for **enterprise documents** like scanned PDFs, complex tables, and handwritten text. **The Headline Stats:** * **74% Win Rate:** Mistral reports a breakthrough performance increase over OCR 2 and competing enterprise solutions on forms and low-quality scans. * **Speed:** Capable of processing up to **2,000 pages per minute** on a single node. * **Cost:** Industry-leading pricing at **$2 per 1,000 pages** (or $1 per 1,000 via Batch API). **Key Capabilities:** * **Native Handwriting Support:** As shown in the \"Santa Letter\" demo, it can extract structured text from messy handwriting with high fidelity. * **Structural Accuracy:** Unlike traditional OCR that just dumps text, OCR 3 reconstructs. **HTML-based tables** and markdown, preserving the original document layout. * **Multilingual Mastery:** Outperforms most global competitors in non-English/complex script document processing. We are moving from models that just \"read text\" to models that **understand structure**. This model is small enough to be incredibly cheap but smart enough to turn millions of \"dead\" paper documents into structured, AI-ready JSON data instantly. **Availability:** * **Developers:** Available now via API (`mistral-ocr-2512`). * **Users:** Try it out in the new **Document AI Playground** on Mistral AI Studio. **Source:** [Official Mistral AI Blog](https://mistral.ai/news/mistral-ocr-3)",
        "comments": [
            {
                "raw_content": "Looks like this would be very useful in the humanities, at least to make large volumes of hand-written manuscripts, letters, etc. easily searchable.",
                "author": "Practical-Hand203"
            },
            {
                "raw_content": "Honestly,I felt that 3rd slide is impressive. **Your thoughts guys?**",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "why not compare it against gpt 5.2 or gemini 3 pro, they'd be pretty good at that, no?",
                "author": "Evening_Archer_2202"
            }
        ],
        "subreddit": "singularity"
    }
]