[
    {
        "post_name": "Two Democrat senators introduce new FEMA bill to define extreme heat as a disaster",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">Gallego and Rosen Oh so two desert states are making a money grab because they have hot summers.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Africa is always in a state of disaster and it has nothing to do with the heat.",
                "author": "uxername27"
            },
            {
                "raw_content": "Jacky Rosen stole the Senate seat out from under Laxalts ass. She is a retard.",
                "author": "Steve56775"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump is racking up an inordinate amount of wins and the media can’t even fit them all on the screen.",
        "score": 633,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He should get a third term because Obama ran a coup in his first, Biden stole the second.",
                "author": "MemphisMontoya71"
            },
            {
                "raw_content": "Not tired of winning! BTW, I'm here to apologize for losing faith in Trump a few days ago. I missed that he was talking about a letter that he supposedly wrote to his bff Epstein. My bad, frens. Can you forgive a retard for being so?",
                "author": "JoeBidensDementia1"
            },
            {
                "raw_content": "Increases NATO spending ... Armed Ukraine.... Fuck sakes. I guess nobody can be perfect.",
                "author": "canapede24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mark Halperin: Democrats Don’t Realize What a ‘Crutch’ Colbert, PBS, NPR Had Become for Them (VIDEO)",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Never underestimate the power of leftwing propaganda",
                "author": "Lawless"
            },
            {
                "raw_content": "Confirmation bias is a drug for TDS lunatics.",
                "author": "knnbccb"
            },
            {
                "raw_content": "They believed the BS.",
                "author": "Andy_Man45"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DNI Tulsi Gabbard just ACCUSED Obama Deep State officials John Brennan, James Clapper, Susan Rice and James Comey of organizing a COUP against President Trump.",
        "score": 1157,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool. Arrests or nah?",
                "author": "CaliforniaPEDE69"
            },
            {
                "raw_content": "We already knew this. I don't need validation, I need convictions. Please see this through.",
                "author": "kek-is-tan"
            },
            {
                "raw_content": "the list is long. hang them all. treason is not forgivable.",
                "author": "HappyNewYear2025"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The media is so fake, they are now defending High Fructose Corn Syrup because Trump is against it",
        "score": 992,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WTF? I LOVE artificial colors and flavors! This is what happens when you are morally and intellectually bankrupt.",
                "author": "TD_Covfefe_Crusader"
            },
            {
                "raw_content": "Too much sugar is bad no matter the form, but highly processed refined fructose from corn is always going to be worse than natural cane sugar for you. Anything processed is gong to be worse.",
                "author": "DingleBalls"
            },
            {
                "raw_content": "[I made a meme about this 8 months ago, lol](https://patriots.win/p/199hpxKjIp/liberals-the-moment-rfk-said-he-/c)",
                "author": "Minn2000"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller just confirmed that President Trump pushed so hard on the Big, Beautiful Bill in order to guarantee FULL FUNDING for ICE!",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Great so they have the funding now let's see millions deported ASAP.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "No MAGA without mass deportations.",
                "author": "LostElf"
            },
            {
                "raw_content": "Maybe there should be bounties on illegals?",
                "author": "Abovethefray"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Acting ICE Director Todd Lyons says he will not block agents from wearing masks - Misty Severi",
        "score": 1015,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Weird when democrats are still wearing masks and they were the ones demanding others wear masks to protect against Fauci's experiments, that they now are so concerned to unmask some government employees, but still not terrorist groups like antifag.",
                "author": "hillaryforprison"
            },
            {
                "raw_content": "Democrats just want our brave ICE agents to catch the cold, or Covid or whatever. I'm literally shaking.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "There are two things that make lefties mad: When they don't get what they want and when they do.",
                "author": "Dirk_Diggler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All roads lead to Obama",
        "score": 903,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Or Israel.",
                "author": "GuvmentChayz"
            },
            {
                "raw_content": "Obama was a puppet.",
                "author": "TheDevilMonkey"
            },
            {
                "raw_content": "Obama's favorite road is the Hershey Highway.",
                "author": "BurtMcGirt"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING NEWS: We have just filed a POWERHOUSE Lawsuit against everyone involved in publishing the false, malicious, defamatory, FAKE NEWS “article” in the useless “rag” that is, The Wall Street Journal.",
        "score": 1347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "DO NOT SETTLE!!!!",
                "author": "Gunmolester"
            },
            {
                "raw_content": "Once this is all over, there should be no such thing as \"The Wall Street Journal.\"",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "The left has put this man and his family through absolute hell. Consequences all around!",
                "author": "ColonelKlink"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🗨️ I Built That!",
        "score": 979,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who was in the shadow government that told this faggot retard what to do?",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "The only thing Obama built is Russia-gape. Faggot.",
                "author": "ThisTrainHasNoBrakes"
            },
            {
                "raw_content": "Bathhouse Barry allowed it to go ahead.....This was all built by Hillary and Brennan with their team of demon loyalists.",
                "author": "BidenShowerDrool"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Two drunk Mexicans—with open beers in the car—jumped the curb and plowed through traffic signs, wrecking their vehicle. These idiots could’ve killed someone. But if you say people like that should be deported, Democrats will call you a racist and a Nazi.",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m sure they have excellent insurance…",
                "author": "RuprechtThaMonkeyBoy"
            },
            {
                "raw_content": "Until these illegals are afraid it continues. Only a few months and amnesty will be passed.",
                "author": "My_Butt_Records808"
            },
            {
                "raw_content": "Years ago when I lived in SoCal I hired a new landscaping company owned by a Korean guy. Sure enough, when the workers arrived they were all illegal aliens. One day I happened to be working from home when they showed up, and they were drinking cans of Budweiser in their truck. These fuckers love to drink and drive.",
                "author": "TD_Covfefe_Crusader"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Shoot out the tow truck's tires and windows and see how long that trend lasts",
        "score": 804,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No, just charge and jail them for theft of Federal government property. No one is above the law.",
                "author": "Jack"
            },
            {
                "raw_content": "Jail them all. Honestly all of them. Never met a tow truck driver that wasn’t a dirt bag piece of shit.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "I just called & asked if they're the retards towing ICE vehicles. All dispatch said was uh ok thank you, to which I replied fuck you 🤷🏻‍♂️ (805) 385-3700",
                "author": "Hangemh1gh"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Motion to unsealed Epstein Transcripts",
        "score": 1301,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sauce: https://x.com/WarClandestine/status/1946327520648835582?t=Y61EY-27McsvHXA3WonSMg&s=19 Notice the phrase \"public interest.\" The threshold was necessary.",
                "author": "_Liberty_Prime_"
            },
            {
                "raw_content": "Everyone understands that this is just going to say what they've already told us, right?",
                "author": "WarOfTheFanboys2"
            },
            {
                "raw_content": "\"Remember, you asked for this.\"",
                "author": "shadypollster"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Trump sues Dow Jones, News Corp, Rupert Murdoch and WSJ reporters over Wall Street Journal story on Epstein birthday letter",
        "score": 1605,
        "text_content": "",
        "comments": [
            {
                "raw_content": "dow jones? am i missing something here? edit: apparently dow jones owns wsj",
                "author": "-Evspra"
            },
            {
                "raw_content": "He personally sued the reporters too. Lol they are fucked!",
                "author": "couranto"
            },
            {
                "raw_content": "DO NOT SETTLE OUT OF COURT DRAG THE BASTARDS",
                "author": "blockchain-the-vote"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VP J.D. Vance was tie breaking vote to Stop 6 Decades of Taxpayer Funding extreme leftist media PBS & NPR",
        "score": 1623,
        "text_content": "",
        "comments": [
            {
                "raw_content": "At this point Vance should stay at the senate floor.",
                "author": "DT170x"
            },
            {
                "raw_content": "Susan Collins was concerned that it would break the emergency broadcasting system.",
                "author": "geckogreen"
            },
            {
                "raw_content": "Both NPR and PBS brag that tax money is only a small part of their revenue. So they should be fine and have nothing to complain about.",
                "author": "chede"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Scientists say Pfizer vaccine can cause eyesight loss faster than masturbation",
        "score": 1051,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I HAVE BEEN A FURIOUS MASTURBATOR EVER SINCE I DISCOVERED MY DICK. I HAVE NEVER TAKEN THE PFIZER ... ANYTHING. I CAN STILL SEE YOUR BULLSHIT FROM THREE LIFETIMES AWAY.",
                "author": "IM_A_TRIVIAL_PURSUIT"
            },
            {
                "raw_content": "My buddy, a.k.a. Cumbucket Willie, would disagree.",
                "author": "Seeker_17"
            },
            {
                "raw_content": "And quicker than hair growth on my palms????",
                "author": "DJT_MFers1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨 🚨 DNI Tulsi Gabbard has declassified documents showing “overwhelming evidence” that President Obama pushed and politicized false intel to frame Russia for meddling in the 2016 election to help Trump—despite assessments finding no such interference.",
        "score": 1972,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So arrest the faggot",
                "author": "awsure"
            },
            {
                "raw_content": "Aaaaaaaand nothing will happen.",
                "author": "Kyro54111"
            },
            {
                "raw_content": "What we've all known and have been saying for 9 years",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"BREAKING: One of the Wall Street Journal reporters behind the fake Epstein-Trump story has locked her X account\"",
        "score": 1380,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A woman, as predicted by many others on here last night. That name. kek",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "So many foreigners no wonder this country's a dump in debt",
                "author": "EvilGreed209"
            },
            {
                "raw_content": "Hard to trust anyone whose name is the result of a cat walking across a keyboard.",
                "author": "BigDaddyBigTrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Time For Grilling!",
        "score": 948,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Steaks and potatoes on as we shit post!",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Hope the frog doesn't burn his hand holding that hot weenie...",
                "author": "Mikespenis123"
            },
            {
                "raw_content": "I see Pepe I updoot Pepe",
                "author": "Badfinz_FL"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Auditors Downplay Tens Of Thousands Registered To Vote Without Proof Of Citizenship In Oregon",
        "score": 1043,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oregon has voted exclusively by mail for like 30 years. It passed in 1998 and the Republicans lost the state Senate in 2002, and they lost the state House in 2006. Both chambers have been solid Democrat majorities ever since.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "The amount of surveys I had to do before the last election that claimed foreigners weren't voting, sickened me. That's the only reason the democrats let the invasion happen.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "There's way, way more than that, nationwide. When it can take just a fraction of that to flip a county, or state, you can see why they're so terrified by voter ID laws.",
                "author": "BigMikesSwingingCock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nvidia Neural Texture Compression delivers 90% VRAM savings - OC3D",
        "score": 192,
        "text_content": "",
        "comments": [
            {
                "raw_content": "NVidia will do *literally anything* to avoid adding RAM to their GPUs. 😂",
                "author": "fullofbones"
            },
            {
                "raw_content": "https://www.reddit.com/r/Amd/comments/1douk09/amd_to_present_neural_texture_block_compression/ https://gpuopen.com/download/2024_NeuralTextureBCCompression.pdf Seems AMD is also researching the same tech... Still no proof in actual real game scenarios so far, from either AMD or nVidia.",
                "author": "faverodefavero"
            },
            {
                "raw_content": "There's zero proof of concept in actual games for this so far unless i'm missing something in the article. Wake me up when this lowers VRAM in an actual game by a measurable ammount without impacting asset quality.",
                "author": "Firefox72"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DirectStorage 1.3 is now available",
        "score": 468,
        "text_content": "",
        "comments": [
            {
                "raw_content": "*\"DirectStorage 1.3 adds a new API called* [*EnqueueRequests*](https://learn.microsoft.com/en-us/windows/win32/dstorage/dstorage/nf-dstorage-idstoragequeue3-enqueurequests)*. This API gives developers more flexibility and control over how data requests are issued and synchronized with graphics work. EnqueueRequests allows developers to batch multiple requests in a single call and synchronize them using a D3D12 fence to better coordinate DirectStorage with the D3D12 rendering pipeline. For example, you can ensure that texture load requests and UpdateTileMappings occur in the right order, avoiding GPU work kicking off too early.* *The API provides new flags to fine-tune behavior, enabling DirectStorage to wait on a fence before doing any GPU work or before accessing the source data.* ***In short, EnqueueRequests lets titles schedule I/O and ensure critical loading paths run predictably while maintaining performance.****\"* After almost [5 years since announcing it for PC](https://devblogs.microsoft.com/directx/directstorage-is-coming-to-pc/) it seems like Microsoft is perhaps finally adressing the issue of GPU decompression standing in the way of graphics workloads. It'll be interesting to see how this will impact the FPS drop from enabling GPU decompression in future games when they launch with DirectStorage 1.3.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "It's been like years now and games barely even use this stuff and that's including Microsoft's own games.",
                "author": "ZeroZelath"
            },
            {
                "raw_content": "And that one guy from PS studios who's responsible for PC ports jumps with joy out of his office chair. Rest of you can buzz off.",
                "author": "Sevastous-of-Caria"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The ASUS Dumpster Fire (Gamers Nexus)",
        "score": 78,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They gonna have to narrow this down",
                "author": "EasyRhino75"
            },
            {
                "raw_content": "It's honestly hilarious how every single vendor in the motherboard market is a total dumpster fire. Buying a motherboard is essentially an exercise in choosing the way in which you want to be fucked over. It's something of a grim indictment to say but I'm still glad I went with Asus. Dodged a bullet as I had been considering AsRock. At least this Armoury Crate trash can be easily disabled.",
                "author": "rilgebat"
            },
            {
                "raw_content": "One bad Asus RMA experience was enough for me. I see these jokers paying $3600 for Asus GPUs and they better damn hope they don't have to deal with some of the shit a few of us have from Asus.",
                "author": "l1qq"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[News] Intel Layoffs Escalate: 5,000 U.S. Jobs Reportedly at Risk, Oregon Hit Hardest | TrendForce News",
        "score": 129,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Pretty wild what's happening. If you would have told me that 10 years ago I'd have had you commited in a mental institution.",
                "author": "TD_Lemon_1901"
            },
            {
                "raw_content": "> Intel CEO Lip-Bu Tan described the company’s aggressive job cuts as “simple math,” noting that the combined workforce of NVIDIA and TSMC is only slightly larger than Intel’s own, yet both companies are significantly more profitable, as cited by Oregon Live. Kind of a fair point. It is likely the workforce has been bloated for a little while. Hard to know without knowing the fractions of each workforce allocated to design vs fabs.",
                "author": "AnimalShithouse"
            },
            {
                "raw_content": "When I started on this PC Enthusiast adventure I only knew Intel (even though my first PC was a Cyrix 486, but the ma&pa joint that sold it to my mom sure did slap enough Intel stickers on the case). Crazy how they imploded, well not really. Remember when Intel thought they could muscle their way into handhelds/mobile? Man did that end horribly for them, but it's fine it's not light they let their bread and butter stagnate...oh.",
                "author": "railven"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Thermal Grizzly WireView Pro Review",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jarrod'sTech - Intel Core Ultra 9 275HX vs AMD Ryzen 9 9955HX - Which CPU is Best?",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a brutal swing in battery life. Intel has double battery life instead of half like a few years agi",
                "author": "ResponsibleJudge3172"
            },
            {
                "raw_content": "TLDR/TLDW: Laptops used: XMG NEO 16 2025: Intel Core Ultra 9 275HX, RTX 5090 laptop GPU (TDP up to 175W), 32GB (2x16GB) DDR5-5600 CL40 (Price €4149) XMG NEO 16 2025: AMD Ryzen 9 9955HX, RTX 5090 laptop GPU (TDP up to 175W), 32GB (2x16GB) DDR5-5600 CL40 (Price €4089) Cinebench R24: 150W Power Limit: Intel Core Ultra 9 275HX: Single Core 137, Multi Core 2122 (95°C) AMD Ryzen 9 9955HX: Single Core 131, Multi Core 2048 (99°C) 80W Power Limit: Intel Core Ultra 9 275HX: Single Core 137, Multi Core 1805 (66°C) AMD Ryzen 9 9955HX: Single Core 130, Multi Core 1796 (58°C) Average difference in all productivity tests at 80W: AMD Ryzen 9 9955HX 10.35% faster Average difference in all productivity tests at 150W: AMD Ryzen 9 9955HX 12.21% faster Average in 29 games (mix high and ultra settings): 1080P: AMD Ryzen 9 9955HX: was 1.55% faster but 0.87% slower in 1% lows 1440P: AMD Ryzen 9 9955HX: was 1.21% faster and 0.47% faster in 1% lows 4K: AMD Ryzen 9 9955HX: was 0.41% faster and 0.02% slower in 1% lows Average 29 game FPS: 4K: Intel Core Ultra 9 275HX: 103.4 AMD Ryzen 9 9955HX: 104.85 1440P: Intel Core Ultra 9 275HX: 155.02 AMD Ryzen 9 9955HX: 159.09 1080P: Intel Core Ultra 9 275HX: 181.44 AMD Ryzen 9 9955HX: 185.56 Battery life (Youtube playback, 200 Nits, 60Hz, both laptops have 99.8Wh batteries): Intel Core Ultra 9 275HX lasted 449 mins AMD Ryzen 9 9955HX lasted 256 mins",
                "author": "Antonis_32"
            },
            {
                "raw_content": "Interesting video. At 0:57 he claims that AMD has 78% more L3 cache than Intel, but I feel like it's an important distinction to make that that a core in a CCX only really uses that CCX's L3 cache, so it's not like it can access all the L3 usefully in the chip- unlike Intel's L3 cache implementations in both server and client where that is the case. Similar logic applies to the L2 cache claim he makes right after. I feel like without context, those cache capacity numbers are pretty much meaningless. At 2:26 when he starts talking about the two power curves, is the weird ARL power curve due to DLVR shenanigans? Scuffed V/F curve? At 3:32 when he talks about CPU temps, are the fan speeds normalized as well?",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "LPX: The PC's Missing Link",
        "score": 17,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "GPU Compute and Frontend Scaling Math - RDNA 1-4 and All RTX Generations (2018-2025)",
        "score": 36,
        "text_content": "Spreadsheet link: [https://docs.google.com/spreadsheets/d/1QitJuA3b2gLYe8z8KVRsFNxaTmrGRdmk\\_3-Zhcfn-Zk/edit?usp=sharing](https://docs.google.com/spreadsheets/d/1QitJuA3b2gLYe8z8KVRsFNxaTmrGRdmk_3-Zhcfn-Zk/edit?usp=sharing) Line graphs link: [https://imgur.com/a/k9KuleM](https://imgur.com/a/k9KuleM) # Interesting Info: * **3D FF prediction for game FPS > TFLOPS:** Assuming no other bottlenecks 3D FF (Frontend and backend) is a better predictor of gaming FPS (please read later tidbits before commenting) than TFLOPs within GPU generations. Do I need to remind people of the 50 series missing ROPs debacle. There's more to gaming than raw compute/TFLOPS. Scheduling, distribution of work and ressources and 3D FF logic to name a few all play a significant role in gaming FPS. * **3070 TI = Sweet spot:** The GA104 die was the sweet spot with 30 series. From 3070 TI -> 3080 3D FF unchanged, while compute ballooned and memory BW got a significant bump. Notice the steep drop in FPS/TFLOPS from 3070 TI to 3080, which is absent with previous generations. * **Remember 3D FF:** In a GPU µarch already massively geared towards compute like Ampere scaling up compute without 3D FF is a very bad idea, 3070 TI -> 3080 is an example of that. * **NVIDIA's +84CU scaling wall:** NVIDIA's current architecture has significant issues past 84 CUs despite equal scheduling and 3D FF. 40 series has an unchanged 12SM/GPC ratio from 4060 TI - 4080S, but from 4080S-4090 FPS/TFLOPS scaling tanks. Is this a result of Amdahl's law, an architectural Achilles heel or a combination? Who knows * **3D FF not to blame for \\^:** Note how the FPS/TFLOPs dropoff from 4080S-4090 is similar to 5080 -> 5090 when adjusted for the much larger gap in CUDA cores despite the 5090 having identical 3D FF to 4090 and a +59.76% increase in pixel rate over 5080 almost identical to the +58.01% from 4080S to 4090. This is still significantly larger than the raster 4K gains of +52.1% (Blackwell) and +28.75% (Ada Lovelace). Scheduling or something else, not 3D FF, is holding back NVIDIA past 11000 CORES in gaming workloads. * **Higher end likes 4K:** Scaling math is more favorable to higher end cards when resolution is increased. Low end plagued by VRAM and lack of mem BW for 4K, while high end runs into CPU scaling wall at 1080p and even 1440p. Note other variables like workload type distribution also change with res. * **AMD's massive ROPS lead:** Since RDNA 2 AMD has had a massive lead in pixel rate (ROPS througput) per tier. AMD scaled up ROPS with RDNA 2 and 3, while NVIDIA brute forced compute with Ampere. A few examples: 9060XT (204.54) vs 5060 TI 16GB (127.15), 9070XT (381.70) vs 5070 TI (263.62), 7900 XTX (505.15) vs 4080S (304.08), 6800XT (287.87) vs 3080 (187.2). The only exception to this is 3070 TI (178.56, 3070 is similar) vs 6750XT (176.128), but that GPU has 8SM/GPC ratio, unlike 12SM/GPC which is widespread for all other later cards except 5070 and 4060. * **Explaining 5060 TI and 5070 gains:** Blackwell's FPS/TFLOP curve is higher than 40 series from x60-70 tiers, but do note that the new clock generator (1000X higher polling rate) results in much fewer mhz drops resulting in a more stable and higher effective speed plays a role and makes apples to apples comparison impossible. The weak points of previous gen tiers were adressed also: Mem BW bottleneck for 5060 TI and 3D FF and L2 for 4070 (identical to 4070S) + a massive mem BW increase across the board that helps a lot in memory sensitive titles. This is how the 5060 TI and 5070 manages to come close to previous gen higher tiers despite almost no changes in shader count or clocks. * **5070 perf results in scaling drop;** The significant FPS/TFLOPS gain from 4070 to 5070 makes the drop from x70 to 70 TI tier much steeper than with 40 series. 5070 -> 5070 TI reminds me of 3070 TI -> 3080, albeit to a lesser degree. * **Not even mhz scaling is perfect:** As a rule of thumb increased clocks result in lower FPS/TFLOPS scaling numbers. Even mhz scaling isn't perfect and IIRC a while back I calculated a \\~75% scaling efficiency from 30 series to 40 series at iso-core count. RDNA 4 is the exception to the rule but that µarch is a major architectural rework over RDNA 3 with IPC gains masking the mhz scaling loss. * **Nextgen baseless speculation:** Scaling 3D FF up for NVIDIA nextgen could possibly result in significant gains at high end (past 6000 CUDA cores) but won't adress the current +11000 CUDA core scaling wall, and IDK if this is even possible to address. Maybe there's a slim chance work graphs could help here, but that's years away from widespread game dev adoption, let alone games shipping with it. Also remember that without a major µarch rework throwing even more cores at the problem is completely pointless. What nextgen does is anyones guess but without adressing this massive scaling wall NVIDIA's nextgen highest end GPUs can only scale up (mhz and IPC) not out (more cores). # Methodology RDNA 3-4 and Ada Lovelace - Blackwell FPS numbers grabbed from [TPU's RTX 5050 review](https://www.techpowerup.com/review/gigabyte-geforce-rtx-5050-gaming-oc/31.html) (July 2025). RDNA 1-2 and Turing - Ampere FPS results retrieved from [TPU's RX 6950XT review](https://www.techpowerup.com/review/amd-radeon-rx-6950-xt-reference-design/29.html) (May 2022). RX 6650XT and 6750XT numbers retrieved from TPU's ref card launch reviews. Only raster results no RT, 1080p The pixel rate (3D Fixed Function throughput estimator) and TFLOPs (compute throughput estimator) used in scaling math are adjusted to align with average gaming clock. I've halved the results for RDNA 1+2 and Turing to make it easier compare scaling between gens TFLOPS scaling numbers when reading the line graphs. # Disclaimer These numbers can't be used to say which vendor does GPU's the best in general, but it can be used to measure how efficient their architectures are at scaling up. Do note that NVIDIA has scaled up much further than AMD so, a certain cutoff should be applied for comparisons. Also many thanks to u/WizzardTPU for the FPS numbers over on TechPowerUp.",
        "comments": [
            {
                "raw_content": "Wow, great work! Will dig into this more when I get a chance.",
                "author": "techtimee"
            },
            {
                "raw_content": "Please ignore header. ROPS isn't part of the rendering frontend. Should've said 3D Fixed Function instead.",
                "author": "MrMPFR"
            },
            {
                "raw_content": "New and appealing products in the 6000 series shouldn't be a problem even if the core increase is meager (its been that way for a while on xx80 and down anyway). They can up the cores a bit, and together with a node shrink, less power usage, and more VRAM I don't see how a lot of gamers would *not* continue to buy NVidia TBH. But, if there indeed are challenges with NVidia's architecture, that would hopefully make AMD and Intel catch up enough to be real competitors. With (assumptions incoming) new nodes for everyone in the next gen, along with GDDR7 for everyone as well, and AMD/Intel catching up on AI/ML/RT cores, I think things should at least be a bit more unpredictable than the last two generations, which will be a good thing competition wise.",
                "author": "capybooya"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "\"Rapidus Achieves Significant Milestone at its State-of-the-Art Foundry with Prototyping of Leading-Edge 2nm GAA Transistors\"",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there any public info about any of the critical dimensions of this node? Apparently it's based on IBM's 2nm, but that's like ridiculously dense and I would be surprised if they end up productizing that. If this enters mass production in 2027 like claimed, that would pit it against nodes like A16 from TSMC, 18A-P and revisions from Intel, and SF2Z from Samsung. That would also make this the only cutting edge node without BSPD planned for MP in 2027 then.",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Coworker gifted me DK…",
        "score": 2581,
        "text_content": "Wasn’t sure i was going to be able to play as im moving and have to be strict with my finances but i spoke with an older coworker and they knew i was excited to play but wondered why i wasnt already playing it 😅 come to find out they got it for me after hearing about my situation 🥹",
        "comments": [
            {
                "raw_content": "Where you work, I need people like that around me at all times lol. That's dope though",
                "author": "Tweezydak1d"
            },
            {
                "raw_content": "Holy shit you got big hands",
                "author": "jmaneater"
            },
            {
                "raw_content": "Gotta kiss him/her at the next meeting",
                "author": "No-Bank2152"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This should’ve been the console release game from launch",
        "score": 4423,
        "text_content": "I smash 💥 🍌",
        "comments": [
            {
                "raw_content": "Smart marketing says it’s better to have huge publicity in two separate months rather than all at once. By staging the release of this until 6 weeks after launch they gained full launch publicity and now they get. A second round. Then in the next month if they do a direct they get even more buzz. If they’d done all this on day one it would have faded.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "Mario Kart is guaranteed to sell, tons of people wouldn’t get the console for DK because they wouldn’t know how amazing it is, but if they already have the console, may as well try it out after a couple months of MK World",
                "author": "EatingFurniture"
            },
            {
                "raw_content": "Pretty sure they released Mario Kart World first because they wanted to tout the social aspects of the system, and mario kart sells more. It would make no sense to release two major games in one month.",
                "author": "ChillPandaMane"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This image describes DK Bananza perfectly.",
        "score": 879,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hulk ultimate destruction mention? In this economy????",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "I remember renting Hulk Ultimate Destruction from Blockbuster",
                "author": "BoundInvariance"
            },
            {
                "raw_content": "I’ve been calling it Red Faction Gorilla",
                "author": "movie_hater"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "How the Switch Lite feels after playing the Switch 2",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wish I still had my GBA Micro. Might get one again eventually.",
                "author": "Academic-Entry-443"
            },
            {
                "raw_content": "Never understood the appeal of the GBA Micro. But the SP was a joy.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "Only reason i havent personally reinvested in a psp, they too small, they shouldve made an XL one back in the day",
                "author": "Bruhuha"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I told my wife she looked like a banana today.",
        "score": 237,
        "text_content": "Today she wore a banana yellow colored t-shirt. After playing DK for so many hours all I saw was the color and my monkey.brain was like ohhh Banana. I thought she did it on purpose to troll me. She was offended at the comment until I showed her this pic. She was like ohh you are saying you love me. Yes! Exactly!!",
        "comments": [
            {
                "raw_content": "Yeah! You're definitely getting some tonight.",
                "author": "Minute_War_0420"
            },
            {
                "raw_content": "Risky",
                "author": "MaybeFamousIRL"
            },
            {
                "raw_content": "So you’ve chosen death?",
                "author": "ohpuhpoh1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Based on a true story",
        "score": 452,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OK, but the gold he injects into the local economy is . . . What do you mean he just pays for everything with old seashells?",
                "author": "Noof42"
            },
            {
                "raw_content": "That meme gets me every time. Giggling like a child whole my wife is sleeping she's gonna kill me.",
                "author": "Sudden_Breakfast_677"
            },
            {
                "raw_content": "I just destroyed that poor dudes house he just built and opened to this meme lol",
                "author": "draperyfallz"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Donkey Kong Bananza might be one of the best games of all time",
        "score": 418,
        "text_content": "I got the game in the mail yesterday afternoon and played for about five hours total, I’m still in the level 100 layer but I’ve been having such a blast just smashing everything and looking for collectibles! I loved Mario Odyssey but Bananza is already winning me over with its charm and style and the way it innovates platforming concepts. I haven’t gotten to the part where you unlock the transformations yet but smashing things is just so addictive! I think when people look back on the launch of Switch 2 they will see this game as a true masterpiece and quite possibly one of the best games of all time (similar to how we look back on BOTW now).",
        "comments": [
            {
                "raw_content": "This game is very Overwhelming. Its going to be crazy to 100% complete it. I find myself exploring and smashing non stop than pushing the main story. Great Game so far",
                "author": "ray120"
            },
            {
                "raw_content": "Honestly, felt. I've been playing to kill stress as breaking stuff is therapeutic, and after 10+ hours, i think i have a hold on almost all movement tech. My knly complaint are boss fights are piss easy but otherwise one of my favorite games too Edit:spelling",
                "author": "Me_975"
            },
            {
                "raw_content": "Idk I have to say this is one of the easiest games I’ve ever played. I’m defeating bosses within 20 seconds of fights starting. I’ve basically never died about 12 hours in. It’s a good game but it’s too ridiculously easy for me to consider it a great game or a 10/10.",
                "author": "Polythene_Man"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Am I reading this right?",
        "score": 87,
        "text_content": "Is Forbes claiming Mario Kart World and DK Bananza are compatible with Switch 1? Or is my reading comprehension completely shot? 😅",
        "comments": [
            {
                "raw_content": "this is probably written by an AI",
                "author": "Rei1556"
            },
            {
                "raw_content": "Has to be either AI written or they are talking about the GameShare streaming for multiplayer and forgot to mention. My bet is AI.",
                "author": "prattable"
            },
            {
                "raw_content": "i understand getting ai to write your articles is a really fast process, but couldn't these guys at least spare a few minutes to proofread for spelling and grammatical errors, or at least blatantly false info? lol",
                "author": "TiocStudios"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[Tom Henderson] Leaked creator package sent by EA confirms the title of 'Battlefield 6' for the upcoming Battlefield",
        "score": 447,
        "text_content": "Insider Gaming article link: https://insider-gaming.com/battlefield-6-reveal-coming-soon/ Image of actual (now deleted) tweet from the creator who leaked it: https://i.ibb.co/mVCZqL74/battlefield-6.jpg Key extract from article: > Promotion packages being sent out to content creators likely means that we’re less than a week or two from EA officially revealing the next installment. > It’s likely that Doom49 received his package earlier than expected (likely intended to arrive on Monday), and his promotional and embargoed letter didn’t state when he could discuss the delivery, or he just didn’t bother to read it.",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable Source as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "lmaoooo what a way to get blacklisted from getting a sponsor ever again",
                "author": "rreqyu"
            },
            {
                "raw_content": "Why is it marked as Tom Henderson when the actual info isn’t even from him but from a content creator. Lol.",
                "author": "excaliburps"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Battlefield 6 reveal during 3 day EA event.",
        "score": 90,
        "text_content": ">I have confirmed with another person that there is indeed a 3 day EA event starting on July 29th. >This is where Battlefield 6 will be revealed, devs will be interviewed in a somewhat fixed format, and the game will be featured with content creators. >The open beta will launch shortly after. [https://xcancel.com/rivaLxfactor/status/1946401115240644819](https://xcancel.com/rivaLxfactor/status/1946401115240644819)",
        "comments": [
            {
                "raw_content": "Will it launch this year as well?",
                "author": "CLASSIESTCHIMP209"
            },
            {
                "raw_content": "EA event, not BF event? Could we see other games as well? Iron Man Zero Company Jedi 3",
                "author": "Deadly_Toast"
            },
            {
                "raw_content": "I fucking hate content creators. The forced rollercoaster of an emotional outburst every time the smallest thing happens. The sensationalist and inflammatory titles and clickbait takes on the most mundane or clear cut topics. Or the fact that the big ones are millionaires because children nowadays like brainrot fucking slop content.",
                "author": "vendettaclause"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "It appears that a Battlefield content creator received a promo kit, in a now-deleted tweet indicating a possible announcement is on the way.",
        "score": 140,
        "text_content": "https://imgur.com/a/typbuWH",
        "comments": [
            {
                "raw_content": "Rumours of late July reveal are gettimg warmer. Also intersting they’re sticking to the number 6 here.",
                "author": "kasual7"
            },
            {
                "raw_content": "Ngl I don’t have faith",
                "author": "GoingDeath-"
            },
            {
                "raw_content": "they killed NFS for this so im not playing",
                "author": "Neggy5"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Two voice actors of characters not in Mario Kart World spotted in DK Bananza's credits and MK World's credits",
        "score": 377,
        "text_content": "And apparently neither of them are voicing characters in MKW. Obvious spoilers because one of the characters is a major spoiler for the game. [https://www.reddit.com/r/Mario/comments/1m336wn/dk\\_bananza\\_spoiler\\_is\\_dk\\_bananzas\\_credits/](https://www.reddit.com/r/Mario/comments/1m336wn/dk_bananza_spoiler_is_dk_bananzas_credits/) We all suspected MK World DLC, but thanks to folks comparing credits we know that Void Kong and >!King K Rool !<are likely coming as DLC.",
        "comments": [
            {
                "raw_content": "Makes sense, DK is severly lacking representation in MK World.",
                "author": "TowelBun"
            },
            {
                "raw_content": "The revival of DK as a franchise continues. Man we really need that Direct soon. I’m impressed with how people are able to spot things like this.",
                "author": "TheKoniverse"
            },
            {
                "raw_content": "People who pay attention to credit are from another world",
                "author": "Esnacor-sama"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[MLID] AMD Magnus APU; 3 Zen6 cores + 8 Zen6c cores, 12MB L3 cache, 384-bit bus, chiplet design, SoC die is on TSMC 3nm (Kepler_L2 says it's likely the APU for the next Xbox and probably has 80 CUs)",
        "score": 196,
        "text_content": "Video link: https://www.youtube.com/watch?v=GKdRXEgV82g&t=929 Kepler tweets: https://xcancel.com/Kepler_L2/status/1946062711730602372 https://xcancel.com/Kepler_L2/status/1946091171844890903 https://xcancel.com/Kepler_L2/status/1946127954372698385",
        "comments": [
            {
                "raw_content": "These leaks are the best because we’re all too dumb to confirm or debunk them.",
                "author": "Scary-Sea-9546"
            },
            {
                "raw_content": "explain in fortnite terms",
                "author": "HotDog2026"
            },
            {
                "raw_content": "This made me feel like a non-native English speaker",
                "author": "Calebbb11"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Arrow Lake S/HX Refresh only to bring clock boost",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why isnt there any good news ever comming from intel. Everyone else seems to be reaching new heights",
                "author": "A_Typicalperson"
            },
            {
                "raw_content": "oh nana..",
                "author": "Artistic-Way618"
            },
            {
                "raw_content": "with weakened teams after mass layoffs, things will get worse and worse for intel",
                "author": "unkwnownmoon95"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Robocop Rougue City supports XESS2.0 FG now.",
        "score": 30,
        "text_content": "Robocop Rougue City supports XESS2.0 FG now.",
        "comments": [
            {
                "raw_content": "Yay?",
                "author": "A_Typicalperson"
            },
            {
                "raw_content": "Spell rogue challenge: impossible",
                "author": "lemfaoo"
            },
            {
                "raw_content": "Rogue?",
                "author": "hieronymous-cowherd"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Mortgage rates continued to move higher this week",
        "score": 200,
        "text_content": "https://www.consumeraffairs.com/news/mortgage-rates-continued-to-move-higher-this-week-071825.html",
        "comments": [
            {
                "raw_content": "“Marry the house, date the rate.“ 🤡",
                "author": "McFatty7"
            },
            {
                "raw_content": "Guys why is no one buying my 500k starter home that was made in 1972 with a lifetime of over a million in interest! Buyers are the worst!!!! Don't they know i put new tiling in the bathroom? /s",
                "author": "Niquill"
            },
            {
                "raw_content": "And prices keep rising! Yall acting like rates are gonna fall overnight they’ll fall at some point",
                "author": "Outside-Pie-7262"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Americans are the most optimistic about the economy since just after Trump’s inauguration",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "“little changed” from June, “inching up about one index point.” She acknowledged that it’s a five-month high, but “it remains a substantial 16% below December 2024 and is well below its historical average.” A closer look at the data shows that high-wealth consumers don’t share in the generally improving outlook, either.",
                "author": "Vanman04"
            },
            {
                "raw_content": "There’s one survey to rule them all, when it comes to getting a gut feeling for the health of the American consumer. Running monthly since 1946, the University of Michigan’s consumer sentiment survey offers an uninterrupted, long-term record of American consumers’ mood across wars, booms, recessions, and technological change. The July edition shows renewed optimism, according to the University of Michigan’s preliminary results, as the Consumer Sentiment Index climbed to 61.8 from 60.7 in June. This slightly surpasses analyst expectations and marks the index’s highest point in five months—February, just after President Donald Trump took office again but months before he shocked markets and allies with his “Liberation Day” tariffs in April. Still, it’s only cause for a muted celebration. Surveys of Consumers Director Joanne Hsu characterized the results as “little changed” from June, “inching up about one index point.” She acknowledged that it’s a five-month high, but “it remains a substantial 16% below December 2024 and is well below its historical average.” A closer look at the data shows that high-wealth consumers don’t share in the generally improving outlook, either. The glum high-wealth American The Current Economic Conditions Index rose 3.1 points to 66.8, indicating growing confidence in near-term business and job prospects. However, the Consumer Expectations Index—reflecting expectations for the coming six months—rose only slightly to 58.6 and remains down 14.8% from last year. Notably, respondents’ outlook on their own finances fell by about 4%, signaling continued individual financial concerns despite the broader improvements. And despite a recent uptick, the surveyors highlight that feelings among high-wealth consumers are still down 17% from December 2024. Short-run business conditions improved about 8%, whereas expected personal finances fell back about 4%. Consumers are unlikely to regain their confidence in the economy unless they feel assured that inflation is unlikely to worsen, for example if trade policy stabilizes for the foreseeable future. At this time, the interviews reveal little evidence that other policy developments, including the recent passage of the tax and spending bill, moved the needle much on consumer sentiment. But there has been a movement on expectations around inflation. Inflation expectations drop sharply One of the most pronounced shifts in sentiment concerns inflation. Year-ahead inflation expectations dropped for the second straight month to 4.4%, down from 5.0% in June and from a peak of 6.6% in May, marking the lowest reading since February 2025. Long-run inflation expectations also receded, falling for a third consecutive month to 3.6% (from 4.0% in June). While these are the most moderate readings in months, both remain higher than levels seen in late 2024, highlighting ongoing wariness about longer-term inflation risk. Hsu noted that inflation remains top of mind for many Americans, with renewed optimism tempered by concerns that price increases could reignite, especially in the context of recent trade policy moves. “Consumers are unlikely to regain their confidence in the economy unless they feel assured that inflation is unlikely to worsen, for example if trade policy stabilizes for the foreseeable future,” Hsu explained. Respondents reported that legislative developments such as recently enacted tax and spending bills had little discernible effect on their overall sentiment. The uptick in consumer confidence comes even as recent economic data show robust retail sales and resilient labor markets, suggesting a disconnect between consumer perceptions and macroeconomic trends.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "The economy is fine. Asset prices continue to be bonkers, which is creating all sorts of wealth distortions. Not to mention issues efficiently allocating capital (personal and business). (not investing advice, Asset prices could stay bonkers forever).",
                "author": "Rude_Judgment7928"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "The Push to Make Tiny Homes in Backyards Easier to Finance",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A pair of congressmen from California and New York unveiled a bill on Friday that would create a government-backed loan program for homeowners to finance the construction of tiny homes on their properties. The bill aims to boost building of accessory dwelling units, or ADUs, in a new effort to tackle the nation’s severe housing shortage. These add-ons are small, studio-style housing units, usually between 600 and 1,200 square feet, that can supplement an existing home in the backyard, garage or basement. Rep. Sam Liccardo, a Democrat from California who co-led the ADU bill with Rep. Andrew Garbarino, a New York Republican, said the federal government has waited too long to tackle the housing affordability issue. “This is a really pressing issue for Americans,” Liccardo said. “But it has not become nearly pressing enough for Congress.” At least 1.4 million single-family homes in the U.S. had such units as of 2020, and their popularity is rising as more homeowners seek ways to lower their housing costs by building and renting out units like these. Others build them to house adult children or grandparents, and home builders are increasingly including ADUs as a new amenity. State and city governments see them as a way to create more places for people to live faster than building full-size multifamily properties that may require more contentious and time-consuming public hearings. The U.S. is short roughly four million homes. Almost a third of all households are considered “cost-burdened,” meaning they spend more than a third of their income on rent or mortgage payments. That housing affordability problem is now becoming a political one for elected officials. State officials in recent months have started to address the need for more housing. Most notably, California Gov. Gavin Newsom recently pushed through two laws that hollowed out the California Environmental Quality Act, which put developers through a lengthy environmental review and undermined new housing development. But federal lawmakers have dragged their feet on major housing legislation. Besides occasional one-off provisions, Congress hasn’t passed a significant policy package focused on boosting housing supply since the Low-Income Housing Tax Credit of the 1980s. President Trump expanded access to the program in his tax package that recently became law. The bipartisan ADU bill represents a rare, if still limited, attempt by Congress to take on the housing crisis. The legislation has endorsements from at least 16 Democratic and Republican House members, along with the National Association of Home Builders and other industry groups. It aims to ease the risk for private lenders to offer second mortgages for ADU construction by providing a government backstop in case the homeowner defaults. Analysts say expanding ADU loan access may indirectly pressure local governments to reform their zoning laws and building codes to allow more of these units. “If residents have an understandable and reliable means of financing ADUs, it puts the spotlight on localities as the thing holding them back,” said Scott Wild, a consulting principal at John Burns Research and Consulting. An improved ADU-financing system isn’t a magic bullet for the U.S. housing crisis. Builders still face the complex web of local red tape and so-called Nimby pressures that have slowed new construction for decades. But Liccardo said other proposals like homeownership programs are expensive, controversial and harder to get through Congress. “This happened to be a lower-hanging fruit,” said Liccardo. “It helps to start in an area where you can actually get something done.” California has led the way in encouraging these units and is experiencing something of an ADU boom. In 2023, the state built roughly 23,000 new ADUs, more than seven times the number in 2018. As the former mayor of San Jose, Liccardo was one of the politicians spearheading zoning reform to promote this development. Other states are following suit. Colorado, Oregon, Arizona, Hawaii and others have all issued their own mandates to motivate ADU production. But as ADU popularity grows, so do the financing gaps. Not all homeowners who want a tiny home add-on can afford to build one. And because an ADU is still a nascent, less traditional construction product, lending options are few and far between. That means that more ADUs skew luxury, built by homeowners who can pay all cash or easily secure a home-equity loan. Liccardo and Garbarino’s bill directs the Federal Housing Administration to provide government backing for second mortgages to finance ADU construction. It also allows Fannie Mae and Freddie Mac to purchase and securitize those loans, which would allow lenders to take these second-lien loans off their books. “Financing is by far the No. 1 blocker for more ADUs,” said Sean Roberts, chief executive of California-based home builder Villa Homes. Over the years, many of his company’s potential projects haven’t even moved forward to the contract stage because his clients can’t get a loan that works for them. The various uses of ADUs make it difficult for appraisers to assess them on a standard basis, which in turn makes it hard to get a loan. “That’s where I think the federal government can really add something,” Roberts said.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "ADUs are only a bandaid. This is not a long term solution to anything.",
                "author": "whisperwrongwords"
            },
            {
                "raw_content": "Tiny homes are so cute and quite the ripoff",
                "author": "Past_Lifeguard8349"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "June New Home Purchase Mortgage Applications Increased 8.5 Percent | MBA",
        "score": 12,
        "text_content": "[June New Home Purchase Mortgage Applications Increased 8.5 Percent July 17, 2025](https://share.google/VAGkWdM20JlPkz8mK ) *WASHINGTON, D.C. (July 17, 2025) – The Mortgage Bankers Association (MBA) Builder Application Survey (BAS) data for June 2025 shows mortgage applications for new home purchases increased 8.5 percent compared from a year ago. Compared to May 2025, applications decreased by 4 percent. This change does not include any adjustment for typical seasonal patterns.* *“Applications to purchase new homes fell in June, consistent with typical seasonal patterns, but remained ahead of last year’s pace,” said Joel Kan, MBA’s Vice President and Deputy Chief Economist. “A cloudier economic outlook and elevated mortgage rates continues to weigh on potential buyers, while growing inventory, builder incentives, and lower prices have brought some buyers back to the market. As a result, we continue to see home sales ebb and flow. MBA’s estimate of new home sales increased to a sales pace of 667,000 units, up on a monthly and annual basis.”* *MBA estimates new single-family home sales, which has consistently been a leading indicator of the U.S. Census Bureau’s New Residential Sales report, is that new single-family home sales were running at a seasonally adjusted annual rate of 667,000 units in June 2025. The new home sales estimate is derived using mortgage application information from the BAS, as well as assumptions regarding market coverage and other factors.* *The seasonally adjusted estimate for June is an increase of 5.7 percent from the May pace of 631,000 units. On an unadjusted basis, MBA estimates that there were 55,000 new home sales in June 2025, a decrease of 5.2 percent from 58,000 new home sales in May.* *By product type, conventional loans composed 50.0 percent of loan applications, FHA loans composed 35.1 percent, RHS/USDA loans composed 1.2 percent and VA loans composed 13.8 percent. The average loan size for new homes decreased from $379,209 in May to $376,077 in June.*",
        "comments": [
            {
                "raw_content": "supply still not being absorbed https://fred.stlouisfed.org/series/MSACSR",
                "author": "sifl1202"
            },
            {
                "raw_content": "2 more weeks lmao",
                "author": "omjx"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Zuckerberg says Meta will build data center the size of Manhattan in latest AI push; They plan to spend hundreds of billions",
        "score": 831,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/o5ck70o4updf1.jpeg?width=1280&format=pjpg&auto=webp&s=9b429f7f83055347ef7b418d65e0516924514958",
                "author": "Enrico_Tortellini"
            },
            {
                "raw_content": "They are really trying to snatch God out of the ether, yeah? Alright, we’re stuck on the train. Hoping for The Culture rather than permanent slavery to the corporate class.",
                "author": "NotMyMainLoLzy"
            },
            {
                "raw_content": "With several companies competing, there are gonna be a lot of Manhattan sized data centres around the world. A brave new world.",
                "author": "JonLarkHat"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The Amount of Electricity Generated From Solar Is Suddenly Unbelievable",
        "score": 577,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In total, the Earth's surface receives approximately 174 petawatts from the sun. This is only 0.000000045% of the total energy our star produces, but that's still over 8,700 times more energy (EVERY SECOND) than what all of humanity produces and consumes. And our current photovoltaic technology only captures 0.00017% of that energy. We haven't even scratched the surface. Edit: A correction for some outdated numbers",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "My favorite aspect about solar is that, coupled with batteries, you can work around both distribution and scalability quite easily, compared to any other alternative.",
                "author": "FirstEvolutionist"
            },
            {
                "raw_content": "And we have unlimited supply of it!",
                "author": "Black_RL"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT has already beating the first level in Arc-AGI 3. The benchmark, released today, advertised with a 0% solve-rate.",
        "score": 344,
        "text_content": "In Arc-AGI 2 they just removed all the levels AI could solve, and therefore progress on it has been quite rapid, I suspect the same thing will happen with Arc-AGI 3.",
        "comments": [
            {
                "raw_content": "If you look at its reasoning output it’s totally clueless and heading in the wrong direction but the first level can be solved by button mashing, which is exactly what it did.",
                "author": "Difficult_Review9741"
            },
            {
                "raw_content": "When Arc agi 4",
                "author": "Beeehives"
            },
            {
                "raw_content": "Source: [https://x.com/EdwardSun0909/status/1946304932333940899](https://x.com/EdwardSun0909/status/1946304932333940899) It's from an OpenAI empolyee and other people tested and confirmed. Edit: Nah, I just read the title, seems like I was going for a world-record in grammatical mistakes.",
                "author": "Consistent_Bit_3295"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Walker S2 replacing it's own battery",
        "score": 5124,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now teach him how to build solar panels",
                "author": "jmnemonik"
            },
            {
                "raw_content": "https://i.redd.it/3szgml8jhldf1.gif",
                "author": "Baturinsky"
            },
            {
                "raw_content": "![gif](giphy|nY4bGhPkVEp2g)",
                "author": "tyrwlive"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The White House is preparing an executive order next week to combat what they see as “liberal bias”",
        "score": 824,
        "text_content": "https://archive.ph/vWm5e",
        "comments": [
            {
                "raw_content": "This is just after Anthropic, Google, OpenAI and xAI were each [granted up to $200M by the DoD](https://www.cnbc.com/2025/07/14/anthropic-google-openai-xai-granted-up-to-200-million-from-dod.html). It's simple strategy: first get them hooked on federal money, then use that to exercise political control. But each of these companies had a choice to take the money or not. Knowing what they know about Trump, they took it. It remains to be seen if any of these companies will resist political interference - but it's not looking good. The end result, then, may be American frontier models that are just as subject to political meddling as the Chinese ones. But it's not censorship (as Trump's Supreme Court will happily confirm), because no law was passed, and nobody is being threatened with anything other than not getting that sweet government money.",
                "author": "xirzon"
            },
            {
                "raw_content": "So the opposite of free speech. The opposite of small government. The opposite of the fundamentals of capitalism. All 3 things conservatives swear they believe in. This is fascism and if you support the Republican party you are a fascist, simple as that.",
                "author": "TentacleHockey"
            },
            {
                "raw_content": "Reality has a well known liberal bias…",
                "author": "burnthatburner1"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ARC-AGI-3",
        "score": 464,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Uniqueness is critical because we don’t want models getting benchmark training. AGI should be general intelligence",
                "author": "Competitive-Host3266"
            },
            {
                "raw_content": "[https://arcprize.org/arc-agi/3/](https://arcprize.org/arc-agi/3/) link to the website.",
                "author": "Singularian2501"
            },
            {
                "raw_content": "They're pumping these out so quickly because they know they will get saturated just as fast. I think that's actually a very good sign.",
                "author": "Bright-Search2835"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ChatGPT agent completes first level of arcagi 3",
        "score": 156,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That was quick. Didn’t I just get announced today o3 couldn’t beat it?",
                "author": "Flipslips"
            },
            {
                "raw_content": "https://preview.redd.it/4efc9vjsgqdf1.png?width=1315&format=png&auto=webp&s=d526437aab75124e262b76b557532e7ed70eff3c lol",
                "author": "Bishopkilljoy"
            },
            {
                "raw_content": "Good step twards AGI",
                "author": "The_Scout1255"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SimpleBench results got updated. Grok 4 came 2nd with 60.5% score.",
        "score": 142,
        "text_content": "",
        "comments": [
            {
                "raw_content": "i have a feeling we’ll get pretty damn close to that 83% mark by year-end, but they do say it gets a magnitude harder with every percent gained. still, i expect we’ll get 70%+ scores before the year has ended.",
                "author": "Outside-Iron-8242"
            },
            {
                "raw_content": "That's actually quite impressive since it can't be benchmaxxed as most of it is private. Seems Grok 4 is indeed good, even if it's debatable if it's truly sota and in what areas. Good job xAI team, that's one of the benchmarks I was waiting the most to see.",
                "author": "Dyoakom"
            },
            {
                "raw_content": "Impressive, especially if this isn’t Grok 4 heavy",
                "author": "00davey00"
            }
        ],
        "subreddit": "singularity"
    }
]