[
    {
        "post_name": "Vice President JD Vance says about $7,000,000,000 of fraud has been discovered in the state of California: “I think we have a fraud problem that is much worse in California than it is in Minnesota.”",
        "score": 653,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrests? 🤔",
                "author": "drmrboy"
            },
            {
                "raw_content": "Makes sense. We work more than any other “free” people on earth, and yet our standard of living is hardly much higher. Makes zero sense unless there’s almost incalculable fraud. We’re slaving for parasites. They must be cut out, cut down, and cut off. 🇺🇸",
                "author": "GodIsPerfect"
            },
            {
                "raw_content": "7 billion is probably one payment i'd bet it's more like 7 trillion",
                "author": "behemoth887"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The mugshots of St. Paul church stormers Nekima Levy Armstrong, Chauntyll Allen and William Kelly have been released. What a DAY. Let’s add Don Lemon to this mugshot collection soon.",
        "score": 616,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These people look like they have room temp IQ. Show me their handler.",
                "author": "Viewer01"
            },
            {
                "raw_content": "🎵 Here's the story of an ugly lady 🎵 🎵 Who was rounded up with two very ugly churls 🎵 🎵 All of them had dirty hair like the others 🎵 🎵 The palest one's in whirls 🎵",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "# FUCK THESE # PIECES OF MOTHERFUCKING # SHEEYYIIAAATTTTTTTTTTT",
                "author": "FloridaRepublic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LMAO. Libs in Minneapolis are currently standing outside a hotel in -15 degree weather banging pots and playing instruments to keep JD Vance from sleeping inside his hotel. Little do they know, JD Vance landed back in D.C. 5 hours ago.",
        "score": 593,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They’ll never lear",
                "author": "awsure"
            },
            {
                "raw_content": "Shhhh. Let them continue. Well into the negative single digits 😉.",
                "author": "Boomstikchik"
            },
            {
                "raw_content": "-30, the wind is killing it .",
                "author": "Realassman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"... if the 2020 U.S. presidential election weren't rigged, it was a rigged election, everybody now knows that, they found out. People will soon be prosecuted for what they did... It's probably breaking news, but it should be, it was a rigged election. You can't have rigged elections.\"",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He would have been arrested for saying the same quote 5 years ago. Truth prevails.",
                "author": "OnceADroplet"
            },
            {
                "raw_content": "I don't believe him. Stop telling us what ur gonna do an... do something.",
                "author": "DaayTerkErJerbs"
            },
            {
                "raw_content": "Now tell Pam that.................",
                "author": "yukondave"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Maybe we should have put NATO to the test: Invoked Article 5, and forced NATO to come here and protect our Southern Border from further Invasions of Illegal Immigrants, thus freeing up large numbers of Border Patrol Agents for other tasks.",
        "score": 1134,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Um, Mr President, They're illegal 'aliens', not illegal 'immigrants'. Please stop letting the enemy set the terms of the discussion. With thanks in advance, US citizens",
                "author": "greatpumpkin"
            },
            {
                "raw_content": "I don't trust the eurocucks to actually enforce our border: they can't/won't even enforce their own! Send them, sure, but leave our real men on the border. Let our Real boys get the Job done, and leave these Euros on their dogsleds to fetch coffee for our wonderful officers. We are close to a full year of 0 border catch and release. Let's not blow it on more misguided trust towards euros.",
                "author": "DonsChair"
            },
            {
                "raw_content": "Now Europe is going to have to explain what constitutes an invasion.",
                "author": "Framus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Dear Prime Minister Carney: Please let this Letter serve to represent that the Board of Peace is withdrawing its invitation to you regarding Canada’s joining, what will be, the most prestigious Board of Leaders ever assembled, at any time. Thank you for your attention to this matter!",
        "score": 1045,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fuc* Around and Find Out! I am really happy that Pres. Trump started noticing just how two-face Carney is. Carney is Prime Minister of Canada because of Pres. Trump and he should have been more grateful toward the President.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "Lol get fucked snow Mexicans",
                "author": "EDDIT_IS_CUCKED"
            },
            {
                "raw_content": "https://truthsocial.com/@realDonaldTrump/posts/115941901312153410",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RECORD NUMBERS ALL OVER THE PLACE! SHOULD I TRY FOR A FOURTH TERM?",
        "score": 1388,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lolol, mad lad! Ya got my vote!",
                "author": "Awakened"
            },
            {
                "raw_content": "Trumps second term was the worst in the history of the US, but this *third* has been going pretty great.",
                "author": "Husky"
            },
            {
                "raw_content": "If it's good enough for FDR ...",
                "author": "boreal_storm"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Stephen Miller : Birthright citizenship is the fiction that the children of illegals, if born here, are citizens. But Democrats take this mad delusion even further: they claim that if an illegal smuggles a minor past the border they and the child get to stay here and collect welfare for life. No.",
        "score": 1126,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Illegals have no right and same goes for their bastard illegal spawn. Send them all back",
                "author": "MontanaPatriot"
            },
            {
                "raw_content": "Parent illegal, you illegal.",
                "author": "BULLDOGG"
            },
            {
                "raw_content": "If you give birth from China or the middle east you go back together",
                "author": "CommieCrats"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Redditor's application for naturalization was denied because he was illegally registered to vote at the DMV. Weird, I was told this never happens.",
        "score": 762,
        "text_content": "",
        "comments": [
            {
                "raw_content": "now deport",
                "author": "Raetchel"
            },
            {
                "raw_content": "The purpose of automatic voter registration at the DMV is to create a huge list of 'possible' names to choose from when new votes must be created. The entire voting system is compromised: Campaign Finance: Large amounts of money are laundered to candidates through 'Smurfs.' A computer alogrithm distributes the amounts across thousands of real names of people who have not actually donated. Voter Registration Databases: Inactive names are switched on and then off in real time. The databases are dynamic (not static). Ballots are often sent to real names at wrong addresses before being switched back to the correct address. Electronic Poll Books: Connected to the internet, a fake entry will show up and be marked as having voted even though no actual person went to the polling place to vote. Voting System Tabulator: In compliance with Disability laws, tabulators are loaded with ink to mark ballots. Ovals may be filled in using different 'font settings' to make the circles look as if they were filled in by a human. All systems are connected to the internet and results are moved towards a preset number via an algorithm. (e.g. batches all reporting results such as 50.1%/49.9% over and over and over). We started this in other countries first in order to do regime change. Then we psyop-ed the 2000 election to villainize hanging chads so we could 'help' states with new electronic voting equipment.",
                "author": "tpactionchasethevote"
            },
            {
                "raw_content": "Reddit sounds like a hotspot that requires a raid.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nick Shirley dropped off a ‘Quality Learing Center’ hoodie at Minnesota Rep Ilhan Omar’s office in DC Her staff took it!!",
        "score": 1044,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Master level trolling.",
                "author": "Copernicus"
            },
            {
                "raw_content": "Someone needs to drop off some ICE agents at her door and solve this problem once and for all.",
                "author": "MythArcana"
            },
            {
                "raw_content": "You know why these hoodies are so awesome? Because they essentially copied the business logo perfectly. And I will be honest, Nick only got this much attention because of this typo. I think others had tried and failed at this task, and he succeeded because of this business and it's retarded logo.",
                "author": "KungPaoMcChicken"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Look at me. I'm the daycare now.",
        "score": 1066,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Does the Agent get to bill $25 million?",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Ice has now spent more time babysitting than all the Somali daycares combined.",
                "author": "lildonnyturnup"
            },
            {
                "raw_content": "I don't care where they are from, I don't like seeing sad little kids. Even sad little brown kids. He'd be much happier in his home country than a shithole like Minneapolis. It'll be much warmer.",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Unbelievably disturbing. 57 House Republicans just joined almost all the Democrats to ensure the government can shut off your car whenever it wants.",
        "score": 951,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What could go wrong there? The law is completely unconstitutional. It also way overdue that the Patriot Act gets repealed.",
                "author": "Zeleskys_WH_Clothing"
            },
            {
                "raw_content": "Trump can veto",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "Only buy old cars and trucks pre-2013",
                "author": "Ficklepimper"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "TikTok has finalized a deal to operate permanently in America, agreeing to be owned by a majority American joint venture.",
        "score": 745,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OK. Still not creating an account.",
                "author": "24601"
            },
            {
                "raw_content": "Larry Ellison (CIA) takeover complete.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Majority American owned. Controlled and policed by Muh Greatest Ally ™️",
                "author": "Petes_Agate_Israel"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The people who brought the Tariff Litigation against our Country, now in the United States Supreme Court, are strongly China oriented, and very upset by the fact that the United States is doing so well",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I know I'll get downvoted, but I'm beginning to get annoyed with Trump constantly telling me how well we're doing lately, because I don't know about you, but I'm not sure as shit not feeling it yet. I have seen no significant improvement whatsoever in my life if I'm being honest. It's beginning to seem like Biden's bullshit. Maybe he has set the table for things to improve, but in the meantime don't piss down my leg and tell me it's raining. It sure as shit would go a long way if he would finally ELIMINATE THE INCOME TAX like he repeatedly said he'd do though. Then I'd join in and help tell people how awesome we're doing.",
                "author": "dr_gonzo"
            },
            {
                "raw_content": "Link https://truthsocial.com/@realDonaldTrump/115941252213747451",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "DONAL TRUMP DONT TRUST CHINA CHINA IS ASSHOE",
                "author": "wartooth6"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The US Magistrate judge who REFUSED to sign off on Don Lemon’s arrest warrant, Doug Micko, is married to an ASSISTANT ATTORNEY GENERAL in MN AG Keith Ellison’s office, per @BillMelugin_ TOTAL conflict of interest! CIRCUMVENT HIM, and make the arrest!",
        "score": 1668,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m so tired of this bullshit already just shoot everybody in the face",
                "author": "LegalAlien1776"
            },
            {
                "raw_content": "THANK YOU for providing the name of that fake communist judge. I checked everywhere, and there are quite a few masterbate judges in Minneapolis, and not one media outlet named that prick. https://www.mnd.uscourts.gov/DLM",
                "author": "MythArcana"
            },
            {
                "raw_content": "So much worse than that...not considering the thousands of leftist judges already fighting MAGA from the bench, the leftists and complicit RINO deepstate / et al. have managed to keep Trumps appointed U.S. attorneys to 14 out of the 92 he put up. The reality is that the leftists have created a system /whereby, they can lie cheat and steal - burn loot & murder and nothing happens They put a fraudulently elected crook into office and jail all opposition, at will, with no due process or evidence because they own the judiciary. They import 20+ MILLION invaders on our dime and dare us to fix it while using an army of lunatics to fight us. This is a long term the terror they intentionally created and have in place AND WE REMAIN POWERLESS. WE are at war, WE are not fighting back and WE ARE LOSING and WE will continue to lose because one man cannot fight this monster alone. IF the future inhabitants of this country are even allowed to know the truth, WE WILL FOREVER BE REMEMBERED AS THE BIGGEST BUNCH OF OVERLY-ARMED DEFEATED CUCK PUSSIES THIS WORLD HAS EVER KNOWN.",
                "author": "BOHICA2021"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Former Officer Michael Fanone MELTS DOWN over question about him turning off his body cam on J6: REPORTER: “Is it true you turned off your body cam on January 6?” FANONE: “You’re a f*cking right wing conspiracy theorist.”",
        "score": 807,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He's a traitor to the country and should be punished as such.",
                "author": "HeyBlinkin"
            },
            {
                "raw_content": "This man is a complete BITCH",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "He knows he did something wrong. That's why the body cam was off. If Smith had evidence, Trump would be in prison.",
                "author": "conservativefrank"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"ANSWER THE CALL\" Worried about your job, your future? HERE IS A GIGANTIC TRUMP ASSET!",
        "score": 558,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When are we ending H1Bs? I'm waiting Trump...",
                "author": "3-10"
            },
            {
                "raw_content": "WOKE pictures all over the website, all Asian and Black people, it looks like the designers are still from Pedo Pete's tyranny.",
                "author": "AR_MAGA"
            },
            {
                "raw_content": "Unless they keep women out, I'm not interested.",
                "author": "donkeyKang"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals freaking out. Fury as Amazon Ring Cameras Are Hooked Up to ICE System \"Your Ring camera is an ICE agent.\"",
        "score": 889,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I heard ICE is also listening through iPhones so they better get rid of those too",
                "author": "Gunmolester"
            },
            {
                "raw_content": "TVs are monitoring if you change the subtitles to \"español\" 👀",
                "author": "Magastreammedia"
            },
            {
                "raw_content": "Sounds like good advertisement for Ring cameras to me.",
                "author": "HumphreyPlowjogger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats: In Minneapolis, ICE arrested a 5-year-old coming home from preschool and tried to use him as human bait. Reality: The boy’s father ran away and abandoned him and an agent stayed with him to make sure he was safe while another agent ran after the father.",
        "score": 1678,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fucking evil Demons do nothing but lie and cause division.",
                "author": "Provos"
            },
            {
                "raw_content": "don't fucking care deport the kid too",
                "author": "Rerun1Central"
            },
            {
                "raw_content": "DNA test the kid and adult, pretty good damn chances that they are not actually related.",
                "author": "AcquittedZombieSlay"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Apparently hell froze over and blondi made an arrest",
        "score": 1532,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be fair… he’s the first person to get her to do something so I give him props for that",
                "author": "Ladypenis"
            },
            {
                "raw_content": "He is a disposable foot soldier and they could care less about him. He is cooked, whereas Don Lemon will be protected for the time being but in the end he will get thrown under the curb. The Democrat Party doesn't care about human beings and their useful idiots are plentiful and now he will be destroyed and no one will care. He is a nasty POS.",
                "author": "GoldenAgeRise7"
            },
            {
                "raw_content": "This'll carry her for another year of employment 🙄",
                "author": "Insatiable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel stock plunges 13% on soft guidance, concerns about chip production",
        "score": 304,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is in after hours trading, and it puts INTC back to where it was 5 days ago.",
                "author": "nittanyofthings"
            },
            {
                "raw_content": "Biggest intrigue to me was Dave talking about packaging contracts ending with B instead of M, and that some of those customers have already pre-paid for EMIB-T supply. Foveros still seems too expensive but EMIB-T is a great differentiated technology that will capture a lot of the COWOS spillover.",
                "author": "Brilliant_Run8542"
            },
            {
                "raw_content": "Revenue -4% Gross margin -3.1% R&D -14% Operating losses +1.3% Not lookin too great lol. They kept talking about ai but it loops back to the \"ai strong so cpu needed, cpu needed we strong\" meaning they've got 0 ai products and 0 engaged customers.",
                "author": "SirActionhaHAA"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Nvidia MSRP lie - Der8auer",
        "score": 90,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not a uncommon practice, you see it quite a bit if you work electronics retail. At this point it seems quite likely they have stopped this program, I hope there is another program that's replacing it. I fear I am foolish for having that hope.",
                "author": "Tower21"
            },
            {
                "raw_content": "It is not really a Nvidia thing",
                "author": "Wonderful-Lack3846"
            },
            {
                "raw_content": "\"I honestly hope amd or intel will take this opportunity\" hahahahahahahahahaahahahahahahahahha",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Apple Silicon Approaches AMD's Laptop Market Share Only Five Years In",
        "score": 582,
        "text_content": "",
        "comments": [
            {
                "raw_content": "20% is a huge success for Apple, especially since Intel Macs consistently held high single-digit marketshare. With the expectation of a lower-cost MacBook launching early this year, it could grow even further. Will be interesting to see this develop.",
                "author": "m0rogfar"
            },
            {
                "raw_content": "That’s what happens when you sell good products. Apple Silicon was a huge win for Apple",
                "author": "Jumpy-Dinner-5001"
            },
            {
                "raw_content": "In other words, Apple sees record high market share in laptops?",
                "author": "Uptons_BJs"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D Launches on Jan. 29 for $499",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Standard mid-cycle MSRP reset.",
                "author": "INITMalcanis"
            },
            {
                "raw_content": "From what I can see the cheapest 9800X3D right now online (no Microcenter deals) is $469. 6-7% price increase is fine I guess for a rumoured 7%-10% perf jump (usually value decreases for more expensive parts). Then again, I'm sure that the 9800X3D price will drop when this launches, which is welcome I guess. Maybe $400 9800X3Ds? Though that will make the 9850X3D basically DOA. Checked, and it's at $449 in the Philippines but I guess that's more on our currency dropping in value and stores not updating prices yet lmao.",
                "author": "popop143"
            },
            {
                "raw_content": "Might as well throw out this old R7 7800X3D, there's an entire 10 extra Minecraft FPS out there for the taking now!",
                "author": "GoodOlSticks"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung refutes claims of '80% price hike' across all memory products — leaks and rumors denied by Samsung PR amidst historic RAM shortages",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "so samsung is having... memory.. leaks?",
                "author": "videookayy"
            },
            {
                "raw_content": "\"Its actually 79%\" would fit the current times...",
                "author": "KR4T0S"
            },
            {
                "raw_content": "It will be 90% instead",
                "author": "helloWorldcamelCase"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "$750 Laptop SHOWDOWN: Apple vs Intel vs AMD vs Qualcomm!",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "surprised at the poor battery life of the AMD powered laptop that being said, it looks like the amd laptop has a bigger screen than the others so maybe that's why",
                "author": "Loose_Skill6641"
            },
            {
                "raw_content": "750 USD for an M4 16GB, wtf, that's already a no brainer",
                "author": "Noble00_"
            },
            {
                "raw_content": "Nice and detailed video. The Macbook Air matches or outright beats the competition in all segments: Screen, Build, Performance, Battery Life etc... The Microsoft Surface Laptop comes closest, particularly with it's great build and screen, but on the performance front, the M4 smashes the Snapdragon X Plus. The Lenovo(AMD) and Acer(Intel) laptops have terrible screens and build quality, though they do have more storage/RAM, but I don't know if that's worth the difference. ​Despite emitting a ton of noise and heat, they still lost to the fanless M4 in most performance metrics.",
                "author": "Forsaken_Arm5698"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Oxides Bring Low Leakage Transistors To Leading-Edge Memories",
        "score": 12,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The CPU Performance Of The NVIDIA GB10 vs. AMD Ryzen AI Max+ \"Strix Halo\"",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Summary: “While the Ryzen AI Max+ 395 was faster overall, the Framework Desktop was consuming more power than the Dell Pro Max GB10. On average the Framework Desktop over this entire span of CPU benchmarks saw an average wall power reading of 133 Watts with a recorded peak of 227 Watts. The Dell Pro Max GB10 meanwhile had a 103 Watt average with a recorded 164 Watt peak for all of these benchmarks. So while the Framework Desktop performance geo mean was at 1.285x, the total system power consumption was 1.29x higher on average and the peak was 1.38x. If you are investing in the Dell Pro Max GB10 or any other GB10 platform, chances are though you are running AI workloads and other software fully engaging both the CPU and GPU. The Blackwell GPU with the GB10 offers a lot more compute potential over the Radeon 8060S graphics but similarly the Dell Pro Max GB10 pricing is around $4139 USD as of writing and the Framework Desktop around $2928 USD if going for the same RAM and storage capacity. More GB10 GPU benchmarks are on the way at Phoronix.”",
                "author": "dimaghnakhardt001"
            },
            {
                "raw_content": "I have GB10 in my lab. The real issue with my unit is thermal throttling. When it reaches 70C throttling kicks in and the performance drops a lot. Forcing additional air using a mini blower it maintains much higher interference tokens/s.",
                "author": "vladi84"
            },
            {
                "raw_content": "The GPU portion will be the juicy bit",
                "author": "996forever"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Should You Use It? - DLSS 4.5 vs DLSS 4 Analyzed",
        "score": 57,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good video overall but I was also hoping for some preset L comparisons too, and to see how Ultra Performance mode has evolved over time. Anyway DLSS4.5 seems like a mixed bag to me despite the image quality gains, not just because of FPS but because its sidegrades vary wildly across games. I find it to be amazing in Lords of the Fallen, but don't see any real difference in Doom Eternal compared to K except lower FPS. You can't just set M globally and expect to get a better experience across the board, you have to compare it to other presets in each game and reach your own conclusions. And that's a significant step down in simplicity compared to the duality of CNN vs Transformer (K).",
                "author": "KekeBl"
            },
            {
                "raw_content": "Ray Reconstruction in games that support it is still the GOAT.",
                "author": "Aggravating_Ring_714"
            },
            {
                "raw_content": "Someone really should make a bit video on Preset L in Ultra Performance. The fact that it gives adequate and playable image on 1440p (with 480p internal resolution!) is insane.",
                "author": "GARGEAN"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "45M. First Final Fantasy game ever. Let’s do this!!",
        "score": 874,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let me know what you think. I’m 49 and considering getting this, as long as it’s not too difficult. I’m not into punishing game I’m too old for that kind of nonsense, lol.",
                "author": "OldGamerMG"
            },
            {
                "raw_content": "Warms my heart to see so many people trying FFVIIR for the first time.",
                "author": "kahabraham"
            },
            {
                "raw_content": "I didn’t realize that came out today. Deciding whether I should pick this up or Marvel Cosmic Invasion. I played a little bit on PS4 after I rented it from the library but I got stuck on the house boss fight",
                "author": "Creative_Eye7413"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2: Best Selling Console of 2025",
        "score": 88,
        "text_content": "I'm proud for Nintendo Switch and Nintendo Switch 2 🥹🥹 Looking forward for the Nintendo Direct next month (hopefully 🙏) And the Pokemon Presents for its 30th anniversary next month 🥳😭 What are your thoughts guys? Are you also proud?",
        "comments": [
            {
                "raw_content": "Nintendo made the right call by offering \"acceptable\" hardware at \"acceptable\" prices. Sure if you make a $1200 Xbox the graphics will be great but the average consumer of wont be playing on it",
                "author": "The-Happy-Mannequin"
            },
            {
                "raw_content": "If they can just finish tweaking performance for the vast majority of switch 1 games and time the market with banger releases, switch 2 could end up being more successful than switch 1",
                "author": "Beautiful-Scholar912"
            },
            {
                "raw_content": "This is false stupid clickbait. Everyone knows it’s actually the Sega Gamegear 🤫",
                "author": "Justapersonmaybe"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "First thing I did when I got the game",
        "score": 132,
        "text_content": "I really like the alternate cover art. More games should have reversible cover",
        "comments": [
            {
                "raw_content": "The best part is that it doesn’t have the ugly Game Key Card banner",
                "author": "FoxMcCloud3173"
            },
            {
                "raw_content": "Thats gotta be one of the nicest looking cover arts i've seen in a long while",
                "author": "Phoenix11112"
            },
            {
                "raw_content": "The Japanese one sucks front or back",
                "author": "djricekcn"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Rocket League update released, includes Nintendo Switch 2 improvements",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh wow. One of my favorite games, I was disappointed by how blurry it looked on Switch 2. Time to redownload for sure.",
                "author": "xBigBrotherx"
            },
            {
                "raw_content": "Feel like they could have gotten this to have a 120 fps performance mode no? It runs on super old hardware at 120fps",
                "author": "Lopsided-Rip-8652"
            },
            {
                "raw_content": "The quick chat text at higher resolution is bugging me now because it's so much smaller.",
                "author": "Ill_Elephant"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's kinda true",
        "score": 931,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The Super Mario Bros. Wonder: Nintendo Switch 2 Edition + Meet Up in Bellabell Park game for the Nintendo Switch 2 system.",
                "author": "MewWeebTwo"
            },
            {
                "raw_content": "better to over explain it than under",
                "author": "PaleZebra288"
            },
            {
                "raw_content": "It is so true! The switch 2 edition is crazy, 15 different disclaimers when the games work perfectly on a switch 1 and a switch 2! It’s idiot proof",
                "author": "lingering-will-6"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Playing the FF7R Intergrade Limited Edition just as intended.",
        "score": 253,
        "text_content": "Glad I kept my OG Switch so I can play both at the same time.",
        "comments": [
            {
                "raw_content": "Doc Ock, is that you?!?",
                "author": "weaklingoverlord"
            },
            {
                "raw_content": "I had an ex like that once.",
                "author": "steplilith"
            },
            {
                "raw_content": "Was this just a way to post a pic of both? Like who seriously would play both at the same time?",
                "author": "xYehox"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Hamaguchi Confirms Switch 2 Versions of Final Fantasy VII Rebirth and Part 3 Will Not Be Compromised",
        "score": 484,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I can only imagine what the download size of rebirth will be lol. But gawt damnit I'm in",
                "author": "0scar_Goldmann"
            },
            {
                "raw_content": "Would be nice if the second part came out within a year",
                "author": "Phos-Lux"
            },
            {
                "raw_content": "Honestly I'm glad that developers are pushing themselves to make this games playable on lower end machines, I own both a Switch 2 and a Legion Go, and want to keep playing modern games in this machines for a while.",
                "author": "DanielDCMarvelFan"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 Remains the Fastest selling console in history 35% ahead of the PS4 after 7 months",
        "score": 452,
        "text_content": "Source: Circana",
        "comments": [
            {
                "raw_content": "And yet the YouTubers will still do Olympic level mental gymnastics trying to get content out there saying NS2 is doing poorly.",
                "author": "darthdiablo"
            },
            {
                "raw_content": "I always find it amusing how on the other big gaming subreddit these sorts of news are rarely reported.",
                "author": "PlantQuick"
            },
            {
                "raw_content": "Going off the huge success of the switch 1 definitely helps, but the other big reason is Nintendo manufactured a shit ton of systems for launch. They actually have the stock to meet the demand so everyone who wanted one could easily get one, unlike every other big console launch where it immediately sells out at launch and every restock for months after.",
                "author": "Stealthinater1234"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fable is confirmed to be released on Playstation on day 1",
        "score": 780,
        "text_content": "News: https://www.ign.com/articles/fable-reboot-release-window-set-for-fall-2026-launches-day-1-on-ps5 Previous report: https://www.reddit.com/r/GamingLeaksAndRumours/s/AsNYSLek3p",
        "comments": [
            {
                "raw_content": "Interesting that FH6 is not, it's probably because they decided later in dev for FH6 perhaps? Same Dev Studio too",
                "author": "-Gh0st96-"
            },
            {
                "raw_content": "Seems more obvious everyday that Microsoft wants to deprecate the Xbox console line by making owning an Xbox completely pointless.",
                "author": "c1nderh3lm"
            },
            {
                "raw_content": "my tired eyes initially read the title as \"fable is confirmed to be released on Playstation 1\"",
                "author": "befree46"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez Corden: Fable for Nintendo Switch 2 is under consideration",
        "score": 294,
        "text_content": "[https://xcancel.com/JezCorden/status/2014463781250777444#m](https://xcancel.com/JezCorden/status/2014463781250777444#m) >Was told Fable for Nintendo Switch 2 isn't 100% definite for now, but under consideration for the future.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "In other words: it might be yes and it might not.",
                "author": "Jackkk007"
            },
            {
                "raw_content": "I’m still surprised at how little support Microsoft has given to the Switch 2.",
                "author": "AdFit6788"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Supposed insider claims the Rayman remake project is a remake of Rayman Legends",
        "score": 241,
        "text_content": "Might fall under Grain of Salt, but here you go. This made the rounds in the Rayman community on Twitter but apparently claimed the Rayman remake was a not a remake of the first one. When someone asked if it was a remake of Rayman Legends he replied with the eyes emoji. https://xcancel.com/xj0nathan/status/2014341292013011194?s=61&t=JxRMPFFdpEwOhL-ir8S0sw Tom Henderson then replied with “Steambot or the other one?” To which he replied “I have only heard about one Rayman project which, depending on player feedback/hype, will trigger the development of the second one. But perhaps I don't have all the information 😌”. https://xcancel.com/xj0nathan/status/2014340287334690863?s=61&t=JxRMPFFdpEwOhL-ir8S0sw This is despite the fact that, apparently, there were hiring calls for a 3D Rayman of some sort floating around last year or so, then again, maybe that was the other one he’s referring to here?",
        "comments": [
            {
                "raw_content": "Fucking why, I guess it's cheap just out the assets in 4k but why? The game is timeless visually. Rayaman 2 could really use a beautiful current gen remake.",
                "author": "Sorry_Soup_6558"
            },
            {
                "raw_content": "Remaking legends is so dumb. The game is literally timeless and the art still holds up remarkably well to this dat",
                "author": "Zealousideal_Carry61"
            },
            {
                "raw_content": "Legends is the Rayman game least in need of a remake. It's on everything and still looks/plays great Like, it'd still be unnecessary but even an Origins would be *marginally* less pointless since it's not playable on modern platforms (at least, I don't think it's on Playstation, I know it's not on Switch)",
                "author": "blackthorn_orion"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson: Second Rayman game is codenamed “Iceman”",
        "score": 131,
        "text_content": "Someone asked Tom Henderson about the Rayman title that was codenamed “Steambot” and if it was a 3D game. He replied that the other one was codenamed “Iceman”. https://xcancel.com/\\_tom\\_henderson\\_/status/2014459840588923029?s=61&t=JxRMPFFdpEwOhL-ir8S0sw",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "One is called Steambot because it'll become vaporware. The other is called Iceman because it'll be put on ice indefinitely. I've cracked the code.",
                "author": "Rozwellish"
            },
            {
                "raw_content": "Why is fuck is Drake working at Ubisoft?",
                "author": "jinifluff"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "KILN was the fourth secret game for Xbox Developer Direct",
        "score": 173,
        "text_content": "Confirming Shinobi602 report of a secret 4th game made by a Microsoft Studio. Double Fine announced KILN. A multiplayer game based on an Amnesia Fortnight prototype Game Trailer: https://youtu.be/6C11Zmc93-I?si=kQpQO_Tt8TaxaAub Previous Rumor: https://www.reddit.com/r/GamingLeaksAndRumours/s/ft0OVUM9Ie",
        "comments": [
            {
                "raw_content": "Jez was the first leaker actually",
                "author": "Brokenbullet14"
            },
            {
                "raw_content": "Kinda not that impressed personally. That really wasn't something that was worth keeping a secret up until this point. Like I'm sure the game will be good in its own right but ehh.",
                "author": "Minimum-Can2224"
            },
            {
                "raw_content": "Would love to know what Tim Schafer's been working on. Keeper rocked. Kiln looks neat but not for me personally. I'm very curious to see what he came up with in this new Double Fine does whatever they want era.",
                "author": "NazRubio"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forza Horizon 6 will be released on 19th May",
        "score": 645,
        "text_content": "According to billbil-kun. 15th May for Ultimate Version owners. Basically confirmation, that in-game message was real. [https://www.dealabs.com/magazine/forza-horizon-6-oui-une-version-physique-sera-bien-prevue-a-cette-date-et-a-ce-prix-on-vous-revele-les-details-du-lancement-60887](https://www.dealabs.com/magazine/forza-horizon-6-oui-une-version-physique-sera-bien-prevue-a-cette-date-et-a-ce-prix-on-vous-revele-les-details-du-lancement-60887) Game will be priced at 69,99€ and will be released on PC a Xbox Series X/S at release (PS5 version later - this was known)",
        "comments": [
            {
                "raw_content": "Xbox leaked it themselfs so this is not surprising.",
                "author": "Lz537"
            },
            {
                "raw_content": "Xbox trying to become leaker of the year",
                "author": "slingking5"
            },
            {
                "raw_content": "he has also posted a preview of the cover art on twitter [https://xcancel.com/billbil\\_kun/status/2014263348376875041](https://xcancel.com/billbil_kun/status/2014263348376875041)",
                "author": "inuyasha99"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Forza Horizon 6 official cover leaked",
        "score": 420,
        "text_content": "It appears to be a [Toyota GR GT](https://www.largus.fr/images/styles/max_1300x1300/public/2025-12/toyota-gr-gt-2025-prototype-gris-avg-mk_4.jpg?itok=t8FObjh4) From billbil\\_kun [https://ibb.co/Gf65NBs0](https://ibb.co/Gf65NBs0)",
        "comments": [
            {
                "raw_content": "Looks like someone leaked all over the image",
                "author": "OwnAHole"
            },
            {
                "raw_content": "Such a strange thing to censor. It sure is the Forza Horizon 6 logo with a car underneath it",
                "author": "NinBendo1"
            },
            {
                "raw_content": "Whatever picture you linked to is not a GR GT, I think it’s a random render [here is a real picture](https://www.largus.fr/images/styles/max_1300x1300/public/2025-12/toyota-gr-gt-2025-prototype-gris-avg-mk_4.jpg?itok=t8FObjh4) edit: thnx for updating",
                "author": "ryzenguy111"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Unveils Glass Core Substrate with EMIB Multi-Chip Connection",
        "score": 42,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS confirms Intel Core Ultra 200K Plus “Arrow Lake Refresh”, BIOS support lands in late January",
        "score": 51,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perfect time to pair a flagship CPU with low-end RAM, both at same price.",
                "author": "GraveNoX"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel confirms 12th Gen Core \"Alder Lake\" enters discontinuance period",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cya! Love Alder Lake, best Intel generation since Haswell or Sandy Bridge in my eyes.",
                "author": "Lord_Muddbutter"
            },
            {
                "raw_content": "Last intel gen i got to work on and ship before leaving for apple 🥲 Proud to say i had significantly contributed to its success by taking some risky but thought out choices and leading a big part of its flagship design features.",
                "author": "trust_factor_lmao"
            },
            {
                "raw_content": "So bummed I did not get one of these. Bought a Z590 system in late 2021 before 12th gen came out, and it aged poorly. Meanwhile 12th gen is still relevant today.",
                "author": "Top_Bookkeeper9136"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Question about P and E core undervolting on the 200 series.",
        "score": 12,
        "text_content": "Basically, Throttlestop only does a universal undervolt on the 275HX CPU. if I don't change clocks it's happy at -57mv. If I lower the P all core to 4.7ghz some E cores error at anything over -46mv. So my question is: Is it worth trading Throttlestop for XTU and doing the P and E cores separately or not?",
        "comments": [
            {
                "raw_content": "275HX has max UV capacity for -65mv max. If you lower the max turbo boost ratio and undervolt just -30mv, temps will decrease and clocks would stay at 4,7ghz for longer.",
                "author": "Positive_Nature_7725"
            },
            {
                "raw_content": "I would use XTU if you're just undervolting",
                "author": "2cars10"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD calls out Intel’s Panther Lake CES claims, says Ryzen APUs are still faster",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Dunno if this should be considered as \"AMD calls out\" considering the slides were labeled as internal only.",
                "author": "Geddagod"
            },
            {
                "raw_content": "But are they as efficient? That's a big factor for portable devices or laptops.",
                "author": "Jeyd02"
            },
            {
                "raw_content": "AMD calls out? That's pathetic marketing, saying nothing would have been better. Not only do they make up performance for made up skus, they compare a 25W TDP to Ryzen A 395+ with a TDP of 55-120W. Wow, a (probably) 120W beats a 25W CPU? Who would have thought?",
                "author": "Jumpy-Dinner-5001"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD confirms Ryzen 7 9850X3D launches January 29 at $499",
        "score": 125,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope they fix the burning CPU mystery.",
                "author": "skylinestar1986"
            },
            {
                "raw_content": "Ok I will give a round of applause to amd. Instead of pricing this to like 550 or even 600 which they definitely could get away with. They actually priced this to an acceptable level. Yeah the 9850x3d is just a better binned 9800x3d but for an extra 20 bucks that's not even an outrage price lol. They could have pulled an intel with the ks level price gouge but they didn't. Good job amd.",
                "author": "kylewretlzer"
            },
            {
                "raw_content": "I hope it does need to be paired with RAM",
                "author": "Og-Morrow"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Ryzen 7 9850X3D price listed by first retailers",
        "score": 223,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Can't wait to pair it with 4 gigs of ram",
                "author": "france883"
            },
            {
                "raw_content": "Have AM5 CPU sales dropped off with the RAM shortage? If I'm so surprised prices haven't fallen a little. I am thinking of upgrading to a better AM5 processor but I ain't paying that.",
                "author": "jplb96"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD AI Bundle turns Adrenalin 26.1.1 into a 34GB add-on",
        "score": 237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "People need to chill tf out. The bundle is on opt in basis. (You have to check a box in order to download it) The update is more about ROCm 7.2 which improves performance on windows local AI. currently CUDA has become a monopoly and ROCm has its work cut out. It’s nothing more than AMD making it simple to install apps and dependencies that would manually be a chore to do for many windows users. All it does is install apps (you can select) and dependencies with a click of a button. It didn’t even show up for me until I upgraded the drivers. It’s only after I upgraded there was an option to download those apps. AMD is literally providing an alternative to CUDA for AI workflows something many people have been requesting from a long time.",
                "author": "MuchBow"
            },
            {
                "raw_content": "They are improving ROCm, which is alternative to CUDA acceleration, which is one of the biggest reason to go Nvidia. (ROCm is still behind... You can use CUDA in Premier pro, Ansys etc. ROCm is in limited number of apps, and for a long time it was linux only.) They added local AI app using ROCm as opt in for driver install. There is literally no reason to be angry... I would also rather get FSR 4 on older cards but this aint bad...",
                "author": "jezevec93"
            },
            {
                "raw_content": "Needed native ROCm support for windows without WSL or linux for a project, actual godsend",
                "author": "EnemySaimo"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ZOTAC launches MAGNUS EAMAX series with Ryzen AI MAX 395/390/380 \"Strix Halo\", just bring your own storage",
        "score": 8,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Blah blah. How is this any different than any of the dozens of other mini-PCs with the 395+? Show me something interesting, make one that has the CPU with 8 cores/16 threads but the full 40 CU GPU that was announced the other week. That would be an interesting device.",
                "author": "CatoMulligan"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "If you want to be financially independent at a young age, don’t buy a house, serial investor says. Home ownership is just an 'expensive indulgence'",
        "score": 420,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you want to be financially independent at a young age be born with rich parents",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Ownership has at least two big financial factors: 1. Maintenance. If you’re lucky, your maintenance costs won’t be that bad. But you can really get wrecked on it. 2. The desire to spend money on your house for furniture, decor, remodeling, etc. Varies a lot by person, of course.",
                "author": "mirageofstars"
            },
            {
                "raw_content": "Sounds like something Larry Fink would say",
                "author": "BMP77777"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Florida is #2 and California is dead-last in the U-Haul’s growth index",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most important bit: >Those states in the southern portion of the U.S. may become especially attractive to homebuyers in 2026. Reports released from [Realtor.com](http://Realtor.com) and Redfin before the new year suggested that metros in the South could see cooling housing markets in the coming months. >That includes cities in Tennessee, Texas, Florida, North Carolina, and South Carolina — all states that ranked in the top five on U-Haul’s growth index. >**Alternatively,** [**Realtor.com**](http://Realtor.com) **and Redfin have predicted that the markets in metros in the Midwest and Northeast — like New York, New Jersey, Massachusetts, Maryland, Connecticut, and Ohio — could heat up.**",
                "author": "dread_beard"
            },
            {
                "raw_content": "Because people moving to CA have money and pay movers. People moving to TX and FLA are poor and have to move themselves and use U-Haul.",
                "author": "MiningDave"
            },
            {
                "raw_content": "California’s prop 13 allows rich folks to park their cash in real estate, then move out of state to avoid income taxes. The appreciation has historically outpaced inflation, so real estate became just another diversified investment in a portfolio. If they fixed prop 13 California may become a bit more affordable (for a little while), as the wealthy unload their homes that are taxed on 70’s/80’s prices to current values - helping California balance the budget with increased property taxes. The tax cuts on the wealthy will prevent that from happening, IMHO.",
                "author": "beefcake90000"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed's main gauge shows inflation at 2.8% in November, edging further away from target",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[removed]",
                "author": "None"
            },
            {
                "raw_content": "Inflation drifted slightly further from the Federal Reserve’s target in November though in line with expectations, according to the central bank’s preferred gauge released Thursday. The personal consumption expenditures price index, a Commerce Department measure the central bank uses as its main forecasting tool, showed inflation at 2.8% for the month both for headline and core, in line with the Dow Jones consensus. In addition, the department’s Bureau of Economic Analysis reported that the rate for October was 2.7% on both a headline and core basis, the latter excluding volatile food and energy prices. The monthly figures showed a 0.2% increase for both months. The BEA released the October and November numbers together due to impacts from the government shutdown during which official agencies suspended data collection and reports. In addition to the inflation figures, the report showed personal income up 0.1% in October and 0.3% in November, the latter 0.1 percentage point below the forecast. Also, personal consumption expenditures, a proxy for consumer spending, rose 0.5% in both months, matching the November forecast. The personal savings rate rose in November to 3.5%, down 0.2 percentage point from the prior month. Price figures for November reflected 0.2% increases in both goods and services. Food was flat while energy-related costs rose 1.9% and after falling 0.7% in October. The report comes the same day that the BEA said gross domestic product rose 4.4% in the third quarter, according to the second and final estimate. In addition, the Labor Department reported that jobless claims are trending around their lowest level in two years. Together, the data indicates an economy continuing to expand, with consumer spending ahead of inflation despite a somewhat softening labor market. “The consumer continues to drive the U.S economy, with today’s data pointing to another strong gain in spending. This resilience comes in spite of last year’s slowdown in the labor market, and still elevated inflation, both of which have weighed on real incomes,” said James McCann, senior economist for investment strategy at Edward Jones. “Today’s data should reassure the Fed that the economy remains on a solid footing, despite a cooler labor market.” Markets expect the Federal Reserve to stay on hold at its policy meeting next week following three consecutive interest rate cuts in 2025. Futures traders see at most two rate reductions this year as policymakers weigh the impact of last year’s easing, coupled with continued inflation pressures and an uncertain geopolitical landscape.",
                "author": "SnortingElk"
            },
            {
                "raw_content": "Not worried about inflation. You need credit growth and demand for inflation. Can anyone tell me where a credit boom will come from in the next year?",
                "author": "ImaginaryHospital306"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Homebuying and Selling Activity Show Signs of Life Amid Lower Mortgage Rates",
        "score": 0,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man, you really have to check the data supporting claims now. Data used in this article is a week or two old. It can go completely backwards in just a few days now, in our insta-everything world we live in.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "pending sales down year over year despite higher inventory and significantly lower rates. \"buyer demand index\" down 11% year over year. dumb headline.",
                "author": "sifl1202"
            },
            {
                "raw_content": "The weekly average mortgage rate fell to a 3-year low, nudging some house hunters and sellers off the sidelines. U.S. pending home sales fell 2.9% year over year during the four weeks ending January 18, the smallest decline in over a month, as mortgage rates declined. Mortgage-purchase applications rose 5% week over week to their highest level in three years. New listings followed a similar pattern as pending sales: They dipped 1.6% year over year, the smallest decline since November. The slight improvements in homebuying demand and home listings are largely the result of falling mortgage rates. The weekly average mortgage rate dropped to a three-year low of 6.06% last week after President Trump ordered $200 billion in mortgage bond purchases. Lower mortgage rates have brought the median U.S. monthly housing payment down to $2,441, a 6.3% decline from this time last year. (The daily average rate has increased from a 3-year low of about 6% in early January to 6.2% this week.) Even though homebuying and selling activity improved, the homes that are selling are taking a long time to find buyers. The typical home that sold spent 61 days on the market before going under contract, a week longer than last year. That’s largely because it’s a buyer’s market, with home sellers outnumbering buyers by a record margin; many buyers are taking their time with both house hunting and negotiations. “Buyers have much more power than they’ve had over the past few years,” said Ben Ambroch, a Redfin Premier agent in Milwaukee. “A lot of buyers are giving up a 3% mortgage rate for a 6% rate, so they have high standards for their new home. Buyers are negotiating prices and asking for repairs based on inspections. Sellers are more willing to compromise because listings have been sitting on the market longer; the sellers who need to move are eager to get a deal done.”",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "AI is curing cancer (Moderna's Intismeran vaccine)",
        "score": 174,
        "text_content": "It doesn't seem like the connection between AI and Moderna and Merck's breakthrough with its skin cancer vaccine, Intismeran, has been made. Moderna stock (MRNA) has gone up 83% year to date on the news that the vaccine is highly effective and durable. The mainstream press know Moderna and mRNA from Covid, so they are reporting that part. What they are not exploring is the astounding fact that Intismeran is tailored to the individual. This is like a compression of the discovery of a Covid vaccine for each individual cancer patient. In order to make the vaccine work, Moderna has to sequence that unique tumor in that one person, then run it through a complex computation to find the best candidate for fighting that specific mutation. This is only possible with accelerated computing and bioinformatics, i.e. AI. This is a revolution in biotech. AI has cured cancer. And it's hiding in plain sight.",
        "comments": [
            {
                "raw_content": "This is way overhyped. What Moderna/Merck have is promising personalized immunotherapy, not a cure, and not “AI solving cancer.” Intismeran (mRNA-4157/V940) has only been tested in high-risk melanoma, is not approved, and is used with Keytruda, not alone. In the Phase 2 trial, the combo reduced recurrence/death risk by ~44% — great, but not a cure: https://www.reuters.com/business/healthcare-pharmaceuticals/moderna-mercks-skin-cancer-vaccine-shows-sustained-benefit-after-five-years-2026-01-20/ Yes, it’s personalized. They sequence the tumor, use algorithms to rank neoantigens, then make a custom mRNA shot. That’s bioinformatics + ML, not magical AI. How it works: https://en.wikipedia.org/wiki/Intismeran_autogene",
                "author": "Certain_Tea_"
            },
            {
                "raw_content": "Perhaps you might want to use AI to get an explanation about what \"curing cancer\" means. Accelerated computing and bioinformatics only become \"AI\" if one uses at least ML systems. Somehow I do not trust you to be able to actually tell if this is AI driven or not. Anyway, great to see that Moderna is doing good here. I hope we can learn much from this.",
                "author": "RegorHK"
            },
            {
                "raw_content": "> This is only possible with accelerated computing and bioinformatics, i.e. AI. Most bioinformatics is not AI",
                "author": "Deto"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Tesla launches unsupervised Robotaxi rides in Austin using FSD",
        "score": 525,
        "text_content": "It’s public (live) now in Austin. Tesla has started robotaxi rides with no safety monitor inside the car. Vehicles are running FSD fully unsupervised. Confirmed by Tesla AI leadership. **Source:** TeslaAI [Tweet](https://x.com/i/status/2014392609028923782)",
        "comments": [
            {
                "raw_content": "waymo has been doing this for a while",
                "author": "Uvoheart"
            },
            {
                "raw_content": "##Now with all-new PATRIOT Over-the-Air Update! **Did your passenger fail to present valid documentation?** **No problem!** **RoboTaxi will now seamlessly lock the doors and reroute them straight to the nearest ICE facility.** ^(Disclaimer: PATRIOT Mode™ is currently in Beta. While we strive for 120% accuracy, RoboTaxi Inc. accepts no liability for the accidental rendition of citizens, permanent residents, or tourists with heavy accents.)",
                "author": "snozburger"
            },
            {
                "raw_content": "absolutely crazy.",
                "author": "misteriousm"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini, when confronted with current events as of January 2026, does not believe its own search tool and thinks it's part of a roleplay or deception",
        "score": 849,
        "text_content": "Seems like certain unexpected events that happened outside of its cutoff date can cause it to doubt its own search tools and think it's in a containerized world with fake results. I wonder if this can be an issue going forward if LLMs start believing anything unexpected must be part of a test or deception.",
        "comments": [
            {
                "raw_content": "Gemini like: https://preview.redd.it/hqf7wnvy5xeg1.jpeg?width=700&format=pjpg&auto=webp&s=f0dc1f953d11cef01698a31fa28c2a7ea7fae4b8",
                "author": "mrlloydslastcandle"
            },
            {
                "raw_content": "Haha similarly, I submitted the Trump admin's National Security Strategy PDF a few weeks ago with this prompt: >Review Trump's national security strategy, attached. What level of contributions do you think an AI tool had in the creation of this document? I was just curious how much of it had been AI-generated because my initial read through was setting off alarm bells. The conclusion of its response: >This document appears to be a piece of **speculative fiction or \"alternate history\" world-building**, likely generated by a user prompting an AI with instructions such as: *\"Write a 2025 National Security Strategy for a second Trump term where he solves all major world conflicts and renames the DoD back to the Department of War.\"* I can't decide if that's an indictment on Gemini's simulated intelligence or a show of the absurdity of this admin. Both, probably.",
                "author": "jacob2815"
            },
            {
                "raw_content": "I cant believe my own search results at the moment so I and empathise with Gemini. At least we live in interesting times.",
                "author": "WonderFactory"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic underestimated cash burn, -$5.2B on a $9B ARR with ~30M monthly users, while OpenAI had -$8.5B cash burn on $20B ARR serving ~900M weekly users",
        "score": 113,
        "text_content": "Source: https://www.theinformation.com/articles/anthropic-lowers-profit-margin-projection-revenue-skyrockets According to reporting from The Information, Anthropic projected roughly $9 billion in annualized revenue for 2025, while expecting about -$5.2 billion in cash burn. That burn is significant relative to revenue, and the situation was made worse by the fact that Anthropic acknowledged its inference costs (Google and Amazon servers) were 23% higher than the company expected, which materially compressed margins and pushed expenses above plan. For a company with a comparatively limited user base, those cost overruns matter a lot. OpenAI, by contrast, exited 2025 at roughly $20 billion in annualized revenue, but likely realized closer to $12 to $13 billion in actual revenue during the year, while having a reported -$8.5 billion in cash burn, way under original estimates. That implies total expenses in the low $20 billions, which still results in losses, but at a completely different scale. Importantly, OpenAI is supporting roughly 900 million weekly active users, orders of magnitude more usage than Anthropic, and has far more avenues to monetize that base over time, including enterprise contracts, API growth, and upcoming advertising. The key takeaway from the article is that both companies are effectively burning at a similar absolute rate, once you strip away the headlines and normalize for timing and scale. The difference is not the size of the losses, but the paths to monetization. Anthropic is almost entirely dependent on enterprise revenue, and higher-than-expected TPU costs directly cut into that model. OpenAI, meanwhile, is operating at vastly greater scale, with hundreds of millions of weekly users and multiple monetization levers. Sam Altman said today that OpenAI added $1 billion of enterprise annualized revenue in just the last 30 days, on top of consumer subscriptions, API usage, and upcoming advertising. That breadth of demand materially changes how its burn should be interpreted. Curious how others here view this tradeoff between burn rate, scale, and long-term monetization optionality of these two companies?",
        "comments": [
            {
                "raw_content": "It is interesting to see. They also have fairly different markets though with Anthropic seeing more love from developers, which also at the moment is arguably where the tech shines the most. That could be what makes the difference longer term, and we'll have to wait to find out Also, tiny FYI you don't need to put minus symbol when talking about cash burn.",
                "author": "Nedshent"
            },
            {
                "raw_content": "> having a reported -$8.5 billion in cash burn, way under original estimates. IIRC with data collected by Epoch, their revenue growth is consistent at 3x YoY. Meanwhile OpenAI's projections were 2.3x in 2026, 2x in 2027 and 1.6x in 2028, which would put them at $100B at early 2028. They expect the growth to slow, but I also wonder if they're simply under projecting various financial figures (\"being conservative\"), because the cash burn is lower than projected as well. We'll see if this 3x trend continues or if it starts to decline *like OpenAI expects* (I'm sure that if their growth *does* decline, people will start pointing at OpenAI \"losing\" as it's all the rage nowadays even though they project slower growth in the first place).",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "The difference is anthropic can charge every single one of their customers. Because it's for work. And your boss should be willing to pay 250 per month for a tool. No one wants to pay 250 per month for ChatGPT.",
                "author": "piponwa"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "White House apparently doctors image presumably using AI to make it appear like the woman was crying",
        "score": 172,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is terrible. An internet troll army is literally in charge.",
                "author": "Electronic-Cheek-235"
            },
            {
                "raw_content": "Apparently? 🙄",
                "author": "TaxCPA"
            },
            {
                "raw_content": "This is insane dude what is going on",
                "author": "Moriffic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI says Codex usage grew 20× in 5 months, helping add ~$1B in annualized API revenue last month",
        "score": 274,
        "text_content": "Sarah Friar (CFO, OpenAI) Speaking to CNBC at Davos, OpenAI CFO Sarah Friar confirmed that OpenAI exited 2025 with over $40 billion on its balance sheet. Friar also outlined how quickly OpenAI’s business is shifting toward enterprise customers. According to her comments earlier this week: • At the end of last year, OpenAI’s revenue was roughly 70 percent consumer and 30 percent enterprise • Today, the split is closer to 60 percent consumer and 40 percent enterprise • By the end of this year, she expects the business to be near 50 50 between consumer and enterprise In parallel, OpenAI has guided to exiting 2025 with approximately $20 billion in annualized revenue, supported by significant cloud investment and infrastructure scale.",
        "comments": [
            {
                "raw_content": "That's interesting. I work at a multinational financial services company that heavily invested into AI from the get go. We had ChatGPT as our internal tool at first. But now we have moved away from that to Gemini. We use Claude Code for Software engineers.",
                "author": "balagachchy"
            },
            {
                "raw_content": "Cost of $1B revenue? Try $7B",
                "author": "BetImaginary4945"
            },
            {
                "raw_content": "everyone thinks anthropic has already won the B2B market, but they are underestimating openai. the race isn't over yet.",
                "author": "imlaggingsobad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Report: SpaceX lines up major banks for a potential mega IPO in 2026",
        "score": 446,
        "text_content": "**Source:** [Financial Times](https://www.ft.com/content/55235da5-9a3f-4e0f-b00c-4e1f5abdc606)",
        "comments": [
            {
                "raw_content": "Note: At WEF Elon mentions he’ll use the IPO funds to kickstart AI Data centres in Space",
                "author": "ZealousidealBus9271"
            },
            {
                "raw_content": "with this IPO Elon will be the first trillionaire in the world, damn never bet against him huh",
                "author": "gnanwahs"
            },
            {
                "raw_content": "Oh god... I guess my plan is about to get way more expensive",
                "author": "JynsRealityIsBroken"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Super cool emergent capability!",
        "score": 154,
        "text_content": "The two faces in the image are actually the same color, but the lighting around them tricks your brisk into seeing different colors. Did the model get a worldview for how lighting works? This seems like emergent behavior. And this image came out late 2024, and the model did too. But this was the oldest model I have access to. Wild that optical illusions might work on AI models too.",
        "comments": [
            {
                "raw_content": "this is like one of the craziest illusion i've ever seen due to how simple the drawing is and how i have connected the faces in ps and it still doesnt break the illusion and has me staring at the screen https://preview.redd.it/5tw8cykpvzeg1.png?width=285&format=png&auto=webp&s=2d5714b745213765bee5028d2ab1505999f4a662",
                "author": "navitios"
            },
            {
                "raw_content": "https://preview.redd.it/mm84skikozeg1.jpeg?width=1206&format=pjpg&auto=webp&s=49a67c0bada16f5a9549151f1d33888367d7a301 Seems like it also works in Claude! 🤯",
                "author": "know_u_irl"
            },
            {
                "raw_content": "I mean, convolution layers would be sufficient for that behaviour. Neural networks don't just look at individuals pixels or tokens, but rather finds and learn combinations of data, so they learn, this combination of words (i.e. a phrase or an adjective applying to a noun) or this combination of pixels (i.e. a corner/line/shape) is helpful for whatever task it's learning.",
                "author": "aattss"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Creepy Star Trek",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A while back, with ChatGPT 4o, when they issued an update to temper it's incessant sycophancy, the level of hysteria that permeated the ChatGPT subreddit was really unnerving. It was during that period that I think I really leaned into just how dependent people have become on these bots for pandering, companionship and ass-kissing. There were posts of people who LITERALLY said things like \"This just isn't fair. How do I get it to agree with everything I say again?\" - with torrents of people responding, either commiserating, or advising on how to get it to be ass-kissing again - not people voicing concern. I would literally have to scroll down just to find a comment that said something to the effect of \"Why do you want something to agree with everything you say? Don't you value accuracy?\". I don't mean to sound cynical, but I don't have much faith in the average human being critically-thinking, introspective and able to navigate their shame and emotional wounds. So it seems to align with that to see the vast amount of people that want a \"yes\"-bot that celebrates their every whim.",
                "author": "Wobbly_Princess"
            },
            {
                "raw_content": "The real lesson here is that the Federation has zero regulations in regards to personal data and that is just a general issue in the show which exists for the convinience of the writers, just like the fact people are constantly surprised by things happening in/with the holo rooms that should be blatantly obvious from an in-universe standpoint.",
                "author": "LinkesAuge"
            },
            {
                "raw_content": "I would not mind at all if somebody made an AI duplicate of me to consensually do with as they see fit. Even without consent as long as the AI doesn't have qualia (although that is getting harder and harder to disprove). As long as I don't have to see it of course and it isn't shared publicly.",
                "author": "ShadowBB86"
            }
        ],
        "subreddit": "singularity"
    }
]