[
    {
        "post_name": "BREAKING: President Trump calls meeting with Xi 'a great success'",
        "score": 297,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A whole bunch of lip service from the Chinese",
                "author": "Petiteputnam1"
            },
            {
                "raw_content": "Let's go President Trump! The man can't stop winning!",
                "author": "doomerbooper"
            },
            {
                "raw_content": "Now watch those sneaky chinks like a hawk. They like to keep their counterparts off balance.",
                "author": "RiffFantastic"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump celebrates winning 'war' on climate change after Bill Gates admits he was 'completely WRONG'",
        "score": 236,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Bill is scared.",
                "author": "10gauge"
            },
            {
                "raw_content": "He learned the last five years that you can get away with a different hoax where you just convince people to inject themselves with a ticking time bomb and they’ll line up to die for your depopulation agenda.",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "+1 for DJT here -but also, it's a \"win\" for anyone with any type of IQ above like 95. Fuck you had to be one fucking retard to believe this \"climate change\" bullshit. You don't even have to be a scientific genius to tell through their bullshit. The second they shifted from a potentially defendable argument of \"global warming\" to \"climate change\"- a term that couldn't possibly be challenged by any sort of logic or data or reason, the argument was over. The second they defined the conversation in terms that had no meaning, it was over. Fuck... You could make an argument \"climate change\" happened between the night being colder and the day being warmer. Fuck, how dumb do you have to be to believe this shit?!",
                "author": "UsernameChexOut"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NEW: an insider at Cigna reports that Indians have taken over the company, with active hiring discrimination against Americans now the rule. The insider was hired in the late 2010s and claims that since then, only 10-15 other Americans have been hired and 80 percent of the workforce is foreign cont",
        "score": 259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "White Americans need to become more litigious! Apply, get rejected, sue the fuck out of them!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "This is far more common than most people realize. The moment any Indians get into any place in management, they stop hiring anyone beside other Indians, and everyone still there are first on the chopping block and will not get promoted anymore. This is happening all over the tech industry. H1B/OPT and PERMs all need to be deported, and the programs eliminated. White people- do not hire any more Indians, ever!",
                "author": "TheGamerToTheRight"
            },
            {
                "raw_content": "Step 1: Get your foot in the door. Step 2: Get in a position where you can hire new employees. Step 3: Hire only your people. This applies to not only Indians, but any other group you can think of, including commies in Universities. It also applies to immigration (illegal and legal). Decent White people are still living on meritocracy. Everyone else is taking advantage of the system to push their own people and ideologies.",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨I am, right now, calling on the House of Representatives to impeach Judge Boasberg. Mark my words: there will be accountability for these partisan zealots who sought to corrupt the DOJ and judiciary to attack their enemies.",
        "score": 1393,
        "text_content": "",
        "comments": [
            {
                "raw_content": "New tactic just dropped. The sternly worded sound bite! Just as ineffective as the sternly worded letter but certainly more entertaining.",
                "author": "Thomm"
            },
            {
                "raw_content": "Oh boy a classic \"calls for\".",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "Lots of blackmail opportunities in all that spying... but Ted Cruz is pretty vocal about this.... To me, this means, they didn't find anything of value on him",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Coming soon.",
        "score": 1229,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sad but true.",
                "author": "MEME-SUPREME"
            },
            {
                "raw_content": "Muslims live to murder non-muslims and freedom. They are a death cult.",
                "author": "projectarcturus1"
            },
            {
                "raw_content": "It'll be interesting to see just how fast New York can hit rock bottom. It's sad, but since I don't live there and honestly I find anyone (red/blue/purple/whatever) that does to be insane, it will be like witnessing a nascar crash. Sad, but ya gotta admit kinda cool. No, I don't want to see New York fail, but I'm watching them swan dive straight into the jaws of death, I may as friggin' well enjoy the show. It's all about the little wins.",
                "author": "Covidrrhea"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Q: Why is President Trump going after Thomas Massie? JD VANCE: It's one thing to disagree with the party on an issue...voting against the party on *EVERY single issue*? Every time we've needed Thomas for a vote, he's been completely unwilling to provide it.That's why Trump turned his ire on Massie.",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm glad JD was able to express that clearly. It's not Massie's merit or ideology. It's his grandstanding and his voting record. *For Massie*, it's ideology and creativity, but... it's not helping. It's hurting.",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "Massie is the most MAGA you can actually get. A man who genuinely values America First and doesn't want to put foreign interests above our own. Trump's fanaticism with getting him out while he endorses Lindsey Graham is fucking pathetic.",
                "author": "Executarian2"
            },
            {
                "raw_content": "Why won't Massie support just a little bit more pork spending and corruption? Oh yea, he doesn't take AIPAC money...",
                "author": "hilboggins"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump orders the Department of War to immediately start TESTING American nuclear weapons on an \"equal basis\" - effective IMMEDIATELY, in response to other nations doing the same.",
        "score": 1002,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can you drop a Tactical Nuke for testing purposes on George Soros house. Pretty Please.",
                "author": "DT170x"
            },
            {
                "raw_content": "\"I'm gonna bomb the shit out of them!\"",
                "author": "CentipedeDemon"
            },
            {
                "raw_content": "250th Anniversary is gonna be lit!",
                "author": "Insatiable"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cracker Barrel: You probably don't want us anywhere near a remodel.",
        "score": 1237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Stickied because it’s a smart use of social media. And funny.",
                "author": "GuerillaYourDreams"
            },
            {
                "raw_content": "Props to Cracker Barrel for the self depreciation humor and the self awareness. It's a great start. 👍",
                "author": "Th3Cho0sing0ne"
            },
            {
                "raw_content": "https://x.com/CrackerBarrel/status/1983660591974904233",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Leaked documents show Biden illegally spied on literally every conservative in the country",
        "score": 1934,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They probably got a whole boat load of blackmail material.... This would explain everything about Congress currently",
                "author": "Colorado-Living"
            },
            {
                "raw_content": "They did this while taking a very comfortable paycheck off your taxes.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Did we make the cut??",
                "author": "PatriotSkorzeny"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The more people learn about Mamdani, the less they like him!",
        "score": 1140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yet he will still, \"win\" no election fraud to see here!",
                "author": "patrioticwinning3"
            },
            {
                "raw_content": "I already didn’t like him, then he kept expanding on himself.",
                "author": "MSG1000"
            },
            {
                "raw_content": "He has a ten point lead. People better learn more, fast.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴THE G2 WILL BE CONVENING SHORTLY!",
        "score": 720,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Something is brewing....has felt that way for a few weeks",
                "author": "Ifeargovtmorethan"
            },
            {
                "raw_content": "The meeting between Pres. Trump and Xi will be convening shortly.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "G2? Not sure what that is",
                "author": "Realassman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Celebrates ‘Bringing Back Trillions of Dollars’ as ‘Great’ Asia Trip Rolls On",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But how are the communists supposed to bankrupt America when President Trump keeps saving all of this money and gutting their fraud?",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "President Trump goes on a trip, comes back with a trillion. Biden goes on a trip...up the steps to Air Force One.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "All these multi national companies are only buying their time hoping he’s out of office next presidential election. These seem like empty promises right now",
                "author": "LessSwampMoreMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Florida Governor Ron DeSantis Abolishes H-1B Visa’s From Being Used At State Universities",
        "score": 1658,
        "text_content": "",
        "comments": [
            {
                "raw_content": "should be the rule everywhere.",
                "author": "breadbaker"
            },
            {
                "raw_content": "Florida is quickly becoming the last free state in America.",
                "author": "Jack_NC"
            },
            {
                "raw_content": "There's more than ome type of b visa, the others have to be addressed as well",
                "author": "TheInky"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Liberals don't know what's coming",
        "score": 1536,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hopefully that's not what's coming",
                "author": "Dem_slayer"
            },
            {
                "raw_content": "That's always been something I haven't been able to wrap my head around. They create this crazy whacked out caricature of Christianity in their heads, and drummed up fear and hate towards it. But Islam is every bit that caricature, and is actually real. But for some reason, Islam is the horse they're backing. I just don't get it.",
                "author": "MAG_n_KAG"
            },
            {
                "raw_content": "Black trashbags gonna be in short supply when the women gotta start wearing them.",
                "author": "LaVaughnRobinson"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrat rep threatens to kill Trump supporters when \"AOC is president\".",
        "score": 955,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I think there’s enough there there to surveil AOC now",
                "author": "Greenhills"
            },
            {
                "raw_content": "The left always... ALWAYS... turns to violence",
                "author": "I-am-Orlando"
            },
            {
                "raw_content": "Bizarre fucking argument from Himes. Even the most generous interpretation of that statement suggests that, at the very least, a Dem president would be gunning for anyone *other* than foreign drug traffickers trying to poison Americans. At worst, it's just a plain threat that a Dem president would go on a killing spree against Trump supporters/ conservatives/ Whites/ Christians etc..",
                "author": "seeling0"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Woman who purposely plowed into an NYPD officer because she wanted to teach him a \"lesson,\" sentenced to just two years in prison.\" NYC is a lawless shit-hole.",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is an attempted murder of a police officer. She should get 20-25 years in a just world.",
                "author": "eclectic22"
            },
            {
                "raw_content": "Black privilege",
                "author": "Redditcensorsyouandi"
            },
            {
                "raw_content": "About to get much worse.",
                "author": "airborne3502"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "There Won’t Be A Shire Pippen.",
        "score": 1237,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ice hired some memelords to run their account",
                "author": "Tyscribz"
            },
            {
                "raw_content": "I'm sure Tolkien would approve, he loved his beloved England.",
                "author": "Noodly"
            },
            {
                "raw_content": "Sean Astin is gonna be on suicide watch for this.",
                "author": "ChrisSuperDude"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Secretary of War Pete Hegseth : Earlier today, at the direction of President Trump, the Department of War carried out a lethal kinetic strike on yet another narco-trafficking vessel operated by a Designated Terrorist Organization (DTO) in the Eastern Pacific.",
        "score": 379,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This <-- what I voted for",
                "author": "Politoed"
            },
            {
                "raw_content": "You sunk my narco ship!!",
                "author": "mass55th"
            },
            {
                "raw_content": "RAND PAUL WHERE ARE YOU TO SPEAK AGAINST THIS UNSPEAKABLE EVIL?!?!?!?11?!?",
                "author": "DebunkTheLeft"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Zohran Mamdani is practicing Taqiyya",
        "score": 1305,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No shit. All Muslims do.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "Muslims are shit parasites, goat-fucking pedophilic warmongers.",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "What’s even crazier, New York City will have a Communist/Socialsit Muslim mayor for the 25th anniversary of 9/11…..ain’t THAT some shit",
                "author": "JustSomeTexan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FAA Halts Flights at Newark Airport Due to Staffing Issues During Schumer Shutdown",
        "score": 816,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Why don't the airlines hire their own traffic controllers?",
                "author": "armyofpedes4usa"
            },
            {
                "raw_content": "Almost no better city for this to happen to Get mother fucking fucked you fucking faggots",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "Newark is just as secure with or without the TSA.",
                "author": "RuprechtThaMonkeyBoy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Playstation Portugal may have leaked the other Resident Evil Requiem Deluxe Edition costume",
        "score": 468,
        "text_content": "[https://imgur.com/a/OYoXj6h](https://imgur.com/a/OYoXj6h)",
        "comments": [
            {
                "raw_content": "You just know Capcom is having fun holding him back at this point",
                "author": "WolfCola723"
            },
            {
                "raw_content": "What happened to OP's account? lmao",
                "author": "BeastMsterThing2022"
            },
            {
                "raw_content": "Not there when I check it, is this inspect element?",
                "author": "Lopsided-Life8738"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SadlyItsBradley: Valve's next VR headset will launch along SteamPlay 3.0 which will be able to play Android ARM, Windows ARM, and Windows x86 games",
        "score": 226,
        "text_content": "[https://xcancel.com/SadlyItsBradley/status/1983653287183409293](https://xcancel.com/SadlyItsBradley/status/1983653287183409293) > Daily reminder that Valve’s next VR headset will be running a Linux ARM version of SteamOS tailored for XR > It will include its own standalone Linux ARM Steam client > And will launch with “Steam Play 3.0” which will be able to play Android ARM, Windows ARM, and Windows x86 games He also said some more stuff about the Steam Controller whose icon recently got leaked in a Steam update: > Steam Controller 2 will have an extra wacky functionality in its controller handles >It will remind some people of Valve Knuckles.. but will not go as extreme as that When further questioned about that he answered this: > *by the sound of that, I'm assing the grip buttons will be pressure sensitive?* > Bradley: You're close. Something along those lines. > *It can sense how you holding the controller and behave differently?* > Bradley: Yes. Note that the Steam Controller 2 is expected to also pair up with the Steam Frame since it's a VR headset designed to also play traditional flatscreen pancake games. Also, for those that don't know, SteamPlay is essentially what Valve files Proton (the windows to linux translation layer) under.",
        "comments": [
            {
                "raw_content": "God these comments are insufferable. Tech company makes new tech product and le'redditor hits you with the \"but \\*I\\* wouldn't buy this! why it exist?\"",
                "author": "kodan_arma"
            },
            {
                "raw_content": "I don't care that much about the VR headset. But man, the Steam client and SteamOS on ARM is revolutionary and opens up the possibility of many ARM consoles running SteamOS in the future. Hopefully Proton on ARM will have the same compatibility of its x86 counterpart. It'd be funny to see x86 Windows games running on Linux ARM. Insane to think that Microsoft's official Windows on Arm would have a much worse compatibility when it comes to gaming.",
                "author": "Wolnight"
            },
            {
                "raw_content": "Does Steam even have any windows ARM builds of games?",
                "author": "FierceDeityKong"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Brazillian YouTuber focused on Resident Evil Content, Moni from Resident Evil Database, proves that the leak of the PlayStation Store Portugal about Leon is fake.",
        "score": 45,
        "text_content": "About the last leak on PlayStation Portugal, looks like is totally fake and made out. The YouTuber who is focused on Resident Evil content, Moni, makes a LiveStream showing how the leaker manages to modify the PlayStation Portugal page to add the Leon part on there. Source: [https://xcancel.com/residentevildb/status/1983697016048738702?t=fVPIJfvi19cMCr5LxY6x1Q&s=19](https://xcancel.com/residentevildb/status/1983697016048738702?t=fVPIJfvi19cMCr5LxY6x1Q&s=19) Previous Rumor: [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ojjpff/playstation\\_portugal\\_may\\_have\\_leaked\\_the\\_other/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ojjpff/playstation_portugal_may_have_leaked_the_other/)",
        "comments": [
            {
                "raw_content": "Schrodinger’s Leon: You’ll never know if he’s in the game until you play the game",
                "author": "exra_bruh_moment"
            },
            {
                "raw_content": "she didnt prove anything, she only showed that we can use inspect element to edit pages, which is something we already know",
                "author": "can_cian"
            },
            {
                "raw_content": "I feel like he’s in the game still even if this leak is real or not",
                "author": "Ok_Canary5591"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Steam Controller 2 may be coming soon as dataminers discover new “Triton” codename in Steam update",
        "score": 247,
        "text_content": ">Valve is seemingly working on an upgraded version of its Steam Controller, likely to be bundled with the in-development SteamOS console. >Following the successful release of the Steam Deck handheld in 2022, Valve has been working on its home console under the codename Fremont. Earlier this year, the “TV focused PC box/console running SteamOS” was spotted in public benchmarks trialling its AMD Custom CPU, codenammed Hawk Point 2. >However, with a new home console, Valve would likely have to pair the system with a controller. While the console could come with a stock Xbox controller, fans have been looking forward to an upgraded version of the original Steam Controller, the device which inspired the design philosophy of the Steam Deck. https://xcancel.com/SadlyItsBradley/status/1983317118746829068 https://frvr.com/blog/steam-controller-2-may-be-coming-soon-as-dataminers-discover-new-triton-codename-in-steam-update/ (Wasn't sure about the rumor/leak tag... it's from datamining, so I guess it's a leak)",
        "comments": [
            {
                "raw_content": "I said this elsewhere but I truly think Microsoft's attempts to find an inroads with the PC gaming audience they're supposedly targeting with their next \"console\" are going to be incredibly complicated if Valve comes out with this ahead of the supposedly \"super premium\" Xbox/PC hybrid thing they're working on Unlike MS, they failed once already trying to do the whole \"PC in a living room\" thing with the Steam Machine, but they also spent years refining and course correcting to the point where they can come out with this thing now, with the vast improvements in UI/UX that Steam Deck and modern SteamOS have, and make this kind of premise way more viable today than it perhaps was like a decade ago when they did the Steam Machines. And knowing their track record with Deck, it's going to be very competitively priced with whatever other alternatives in this niche are there. That's the thing that handhelds like the Xbox Ally and the Legion Go just were never able to compete in parity with Valve for. Like all the conversation about an Xbox-PC thing are so hyperfixated on the idea of \"Steam on an Xbox\", I do wonder what will happen if the alternative is like a $600 or even $700 Steambox that still loads other PC storefronts and carries over all the perks of Steam, vs. an Xbox that's basically being set up to double it in price at the low end. I'm actually really excited about this Steam console thing and its implications even though I'll probably just get a Deck OLED for myself, and a Steam controller with the cool haptic touchpad things the Deck has also sounds wicked. I tried someone else's Deck and that thing was like Wii U GamePad-levels of comfortable even with the weird stick placement. I'm excited to see how that translates to a controller",
                "author": "MyMouthisCancerous"
            },
            {
                "raw_content": "Anyone else hav a strong feeling both Deckard a controller 2 will b at game awards?",
                "author": "InspectorSatNav1"
            },
            {
                "raw_content": "Valve has a great opportunity to beat Microsoft to have a successful “console pc”, they just need to figure out the anti cheat problem",
                "author": "Ill_Student9465"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RE9 Special Editions supposedly leaked",
        "score": 481,
        "text_content": "https://xcancel.com/spookyhoo/status/1983533928817303625?s=46",
        "comments": [
            {
                "raw_content": "Anyone else thinks it's awesome how there's stuff from all corners of Resident Evil? There's a Lady D costume from Resident Evil: Village. A Mr. Racoon from the Resident Evil 2 Remake, with it being a charm from Resident Evil 4 Remake. Files and music from the original Resident Evil 2 and Barry's Magnum from Resident Evil 1",
                "author": "SolidPyramid"
            },
            {
                "raw_content": "The lady D costume😭",
                "author": "Carlosless-World"
            },
            {
                "raw_content": "I wonder if the apocalypse name for stuff is a tease at the game being leaked as RE: Apocalypse from the Nvidia leak? Either way, Grace looks bad ass!",
                "author": "thedinobot1989"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Resident evil 9 steelbook edition on collectors edition.com",
        "score": 224,
        "text_content": "https://collectorseditions.co.uk/gaming/resident-evil-requiem-deluxe-steelbook-edition/",
        "comments": [
            {
                "raw_content": "Lmao everyone but Capcom themselves is showing us the these editions.",
                "author": "Ace-0001"
            },
            {
                "raw_content": "I hope its just a placeholder cause that cover ”art” is boring asf",
                "author": "N0th1ng5p3cia1"
            },
            {
                "raw_content": "That’s the best art they could do… Steelbook art is getting so lazy and dull, it’s like “what’s the cheapest image to mass print”",
                "author": "Robsonmonkey"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "PS5 Resident Evil Requiem description says \"5 costumes including Grace's costume Dimitrescu\" possibly meaning the other 4 costumes being for another character.",
        "score": 84,
        "text_content": "[https://ibb.co/35ByQPZt](https://ibb.co/35ByQPZt)",
        "comments": [
            {
                "raw_content": "Can we move onto the real news that they just announced Resident Evil amiibo lmao",
                "author": "SuicideSkwad"
            },
            {
                "raw_content": "Hiding the costumes in the first place is also telling. I can’t name any other game that has Deluxe Edition stuff but literally hides some of the content. This is the type of stuff you wanna be 100% upfront about, which makes me think more of them will be revealed in later marketing.",
                "author": "Dear-Juggernaut-3024"
            },
            {
                "raw_content": "Whether Leon is in the game or not people are really reading between the lines to think saying there are 5 costumes in the game implies that Leon is in it",
                "author": "banditmanatee"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "RE9 Boxart leaked",
        "score": 245,
        "text_content": "https://xcancel.com/kathyanhy/status/1983563903347912916?s=46",
        "comments": [
            {
                "raw_content": "Leon. ![gif](giphy|gKCh5SiWhid0X9CmyU)",
                "author": "ThinWhiteDuke00"
            },
            {
                "raw_content": "I've been on the RE Requiem Gamestop pre-order page hitting F5 hoping for a Collectors Edition. Capcom is being so weird with pre-order info. EDIT: The games page on Gamestops site wont load for me on my PC or my phone, could they be updating it?",
                "author": "Ace-0001"
            },
            {
                "raw_content": "Kind of a bad box art if it’s true",
                "author": "VisualPersona95"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.10.2 Release Notes",
        "score": 337,
        "text_content": "# Highlights * **New Product Support** * AMD Ryzen™ AI 5 330 * **New Game Support** * Battlefield™ 6 (DX12) * Vampire: The Masquerade - Bloodlines 2 (DX12) * **Expanded Vulkan Extension Support** * [VK\\_EXT\\_shader\\_float8](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_EXT_shader_float8.html) * [VK\\_KHR\\_video\\_decode\\_vp9](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_video_decode_vp9.html) * [VK\\_KHR\\_video\\_encode\\_av1](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_video_encode_av1.html) * [VK\\_KHR\\_video\\_encode\\_quantization\\_map](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_video_encode_quantization_map.html) * [VK\\_AMDX\\_dense\\_geometry\\_format](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_AMDX_dense_geometry_format.html) * [VK\\_KHR\\_shader\\_untyped\\_pointers](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_shader_untyped_pointers.html) * [VK\\_KHR\\_present\\_mode\\_fifo\\_latest\\_ready](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_present_mode_fifo_latest_ready.html) * [VK\\_EXT\\_present\\_mode\\_fifo\\_latest\\_ready](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_EXT_present_mode_fifo_latest_ready.html) * [VK\\_KHR\\_present\\_id2](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_present_id2.html) * [VK\\_KHR\\_present\\_wait2](https://registry.khronos.org/vulkan/specs/latest/man/html/VK_KHR_present_wait2.html) * Click [HERE](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-VULKAN.html) for more information about other Vulkan® extension support. * **Work Graphs Support** * Initial introduction of Work Graphs support on Radeon™ RX 9000 series graphics products. * **Important Information** * When downgrading to previous version of AMD Software: Adrenalin Edition it is recommended to use [AMD Cleanup Utility](https://www.amd.com/en/resources/support-articles/faqs/GPU-601.html). * USB-C power charging has been disabled for Radeon™ RX 7900 series graphics products. Users requiring this feature are recommended to use AMD Software: Adrenalin Edition version 25.3.1. * Using a magic string that can be configured in SBIOS by customers, the driver will determine what codec must be disabled, this includes HEVC, H264, VP9 and AV1. This is available on Radeon™ RX 7000 and 9000 series graphics products. * New Game Support and Expanded Vulkan Extensions Support is available to Radeon™ RX 7000 and 9000 series graphics products. # Fixed Issues * Intermittent application crash may be observed while playing The Last of Us Part II on Radeon™ RX 7900 series graphics products. * Intermittent application crash may be observed while playing FBC: Firebreak on some AMD Ryzen™ processors such as the Ryzen™ AI 300 series and the Ryzen™ 8000 series. * Corruption (missing scan travel lines) may be observed while playing GTFO™ on Radeon™ RX 7000 series graphics products. * Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. * Intermittent application crash may be observed while playing NBA 2K25 in MyCareer mode on Radeon™ RX 9070 series graphics products. AMD is actively working on a resolution to be released as soon as possible. * Stutter may be observed While playing Baldur’s Gate 3 on some AMD Radeon Graphics™ Products such as the Radeon™ RX 9000 and 7000 series. * Texture flickering or corruption may appear while playing Serious Sam 4 on Radeon™ RX 6000 series graphics products. * Shadow corruption on left eye is seen while playing VTOL VR on Radeon™ RX 7000 series and Radeon™ RX 9000 series graphics products. * CVE-2023-4969 (RDNA only), CVE-2024-21969 (RDNA only), CVE-2024-36323, CVE-2024-36325, CVE-2024-36333, CVE-2025-61964, CVE-2025-61965, CVE-2025-61966, CVE-2025-61967, CVE-2025-61968 # Known Issues * Intermittent application crash or driver timeout may be observed while loading a saved game in Cyberpunk 2077 with Path Tracing enabled. AMD is actively working on a resolution with the developer to be released as soon as possible. * Intermittent application crash or driver timeout may be observed while playing Battlefield™ 6 on AMD Ryzen AI 9 HX 370 * Intermittent application crash or driver timeout may be observed while playing Roblox Player (Car Zone Racing & Drifting) when task switching between media on Radeon™ RX 7000 series products. * Texture flickering or corruption may appear while playing Battlefield™ 6 with AMD Record and Stream on some AMD Graphics Products. * Radeon Anti-Lag 2 option may not be available while playing Counter-Strike 2 (DX11) with Radeon Anti-Lag 2 enabled on some AMD Graphics Products, such as the Radeon™ RX 9070 XT. Users experiencing this issue are recommended to use the Vulkan API as a temporary workaround. # Package Contents * AMD Software: Adrenalin Edition 25.10.2 Driver Version 25.20.21.01 for Windows® 10 and Windows® 11 (Windows Driver Store Version 32.0.22021.1009) * Ryzen™ AI NPU MCDM Driver version 32.00.0203.311 (Date: 2025-10-02)",
        "comments": [
            {
                "raw_content": "Incompatible with RDNA2? It tells me that the AMD graphics hardware is not supported. (They already fixed it, the driver installs correctly, It needs to be downloaded again) from here [AMD Software: Adrenalin Edition 25.10.2 Release Notes](https://www.amd.com/en/resources/support-articles/release-notes/RN-RAD-WIN-25-10-2.html)",
                "author": "IllustratorDeep7780"
            },
            {
                "raw_content": ">Stutter may be observed while playing games with some VR headsets at 80Hz or 90Hz refresh rate on some AMD Radeon™ Graphics Products such as the Radeon™ RX 7000 series. Users experiencing this issue are recommended to change the refresh rate as a temporary workaround. Fucking finally",
                "author": "xChrisMas"
            },
            {
                "raw_content": "Work graph wizardry support on 9000 series??? Nice",
                "author": "WybawiCieL"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "ASUS drops \"NUC\" branding for AMD Ryzen 9 9955HX3D powered ROG GR70 compact gaming PC",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hasn't that always been the case? Intel came up with NUC for mini pcs way back in 2013.",
                "author": "ApplicationMaximum84"
            },
            {
                "raw_content": "Smart choice moving to AMD chips for these.",
                "author": "Halos-117"
            },
            {
                "raw_content": "It's an Intel name like ultra book",
                "author": "thelastsupper316"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "About 1 in 5 Americans (19%) say they’d pay $10,000 or more above the price of a comparable home if they knew they wouldn’t have bad neighbors.",
        "score": 337,
        "text_content": "[https://anytimeestimate.com/research/good-bad-loud-neighbors](https://anytimeestimate.com/research/good-bad-loud-neighbors/?utm_source=reddit&utm_medium=reddit&utm_campaign=neighbors)",
        "comments": [
            {
                "raw_content": "I’d pay a lot more than that for a guarantee.",
                "author": "kokchain"
            },
            {
                "raw_content": "$10,000 over say 20 years is $500 a year for peace of mind. Sounds like a no-brainer.",
                "author": "nova8808"
            },
            {
                "raw_content": "Not having to deal with shit neighbors is priceless",
                "author": "VendettaKarma"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Yet Again, Mortgage Rates Surge Higher After Fed Rate Cut",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CPI is at 3%, so 10-year Treasurys are effectively yielding 1% this year. Does anyone actually think that long yields have room to move *lower* than that? Bond prices this high (yields this low) seem very speculative. You are essentially eating a massive amount of shit on your bonds today, in anticipation that someone else (France? Britain? US deflationary crash?) is going to eat even more shit tomorrow.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Buy the rumor, sell the news reaction. Give it another 2-4 weeks and 10 year yield will be back down to 3.9%",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "\"Surge\" Do you always type in clickbait, or are Wednesdays special?",
                "author": "Nice-Philosopher4832"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Federal Reserve cuts interest rates by 0.25% for second straight meeting",
        "score": 276,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Didn't inflation just tick back up to 3% and we're cutting?",
                "author": "SelfAltruistic4201"
            },
            {
                "raw_content": "Interest rates will be cut for the federal government to handle debt, money will flood into assets like real estate, stocks, and likely gold, and then rates will be raised.",
                "author": "Then_North_6347"
            },
            {
                "raw_content": "I was enjoying finally benefiting from high interest rates.",
                "author": "NiceUD"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "America’s flatlining income growth is hitting Gen Z the hardest, throttling their shot at homeownership, JPMorgan report warns | Fortune",
        "score": 65,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s why I’m thankful every day that my parents were able to let me stay at home for a few years after I graduated and I was able to land a union job at a manufacturing plant. Literally the only reason I was able to afford my first house last January at 26.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "In other news, the sun produces heat.",
                "author": "ThatOneGuyYearn"
            },
            {
                "raw_content": "Gen Z is 13-28, mostly still in school.",
                "author": "Jumpy_Childhood7548"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "US Pending Home Sales Stall as Labor Market Concerns Build",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You can lower the rate even further and it doesn't matter. **People cannot buy homes if they do not have the jobs or money to do so.** End of fucking story. \"We have full labor\" no, no we don't. Working one hour a week at a gig job means you are \"employed.\" And rates being cut does not mean that the companies will hire anyone. All I've seen and heard are more jobs getting cut due to outsourcing, layoffs, making number go up, etc. People are being informed they are losing their jobs. People are afraid they will be next to lose their jobs. People are getting hours cut. So much shit is running on skeleton crews. I've been out of work since June. I can't even get a survival job like you could during the Great Recession because every fast food and retail place is operating with the most minimal staff possible. New graduates aren't getting work. New graduates from last year still not getting work. If you can even get an interview? Great. Well. Salary offers are lower. Benefits are lower. On top of it, everything is fucking gambling. Endless exploitative sports gambling and crypto bullshit to get us to continue to part with the little money we have at a chance to maybe get enough money to participate in the rest of life. Main Street was in the early throes of a recession in 2023 and dealing with declining quality of life then. (Looking back, we should have instituted price freezes on consumer goods during the first year of the pandemic to prevent price gouging, like they did in WWII.) We wobbled a lot this last year. Now greed has gone into overdrive and they want us to still consume, still buy, still try to fall into debt traps. But we literally can't even take on more debt because we can't qualify for more debt when we don't have the jobs with the incomes to allow us to take on the debt. No one is buying houses because they can't afford to and/or the job market is risky **as fuck** right now. Who is going to take on 6 figs of debt when they don't know if they will have a job come Christmas? I truly do not want to hear a fucking word about poor people causing any type of economic or financial crisis this go round. It was bullshit in 2008 with investors doing house flips blaming poor people and banks doing bad underwriting and bad betting. It is even more obviously bullshit now because poor and most lower and middle- middle class people ain't even in this game. I do not want to hear a single word about bailing out AI or AI-related companies or any financial institution that propped them up. This article makes me furious because \"as labor market concerns build\" is not nearly accurate enough to describe the actual situation happening in most people's lives. *Softening* is not nearly harsh enough to describe it. There can't be buyer interest when there's instability in the very thing we need to be fucking buyers: jobs with good paychecks.",
                "author": "thenorthernpulse"
            },
            {
                "raw_content": "Since when does \"stall\" mean zero change from the month prior? \"Stall\" means a stoppage or major slowdown, not exactly what it was previously.",
                "author": "Nice-Philosopher4832"
            },
            {
                "raw_content": "By region, contract signings on previously owned homes rose 1.1% in the South to the highest level since March. Pending sales also climbed in the Northeast, while falling in the West and Midwest. News is not gloomy everywhere.",
                "author": "ThemeBig6731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage rates drop to the lowest level in over a year, pushing refinancing 111% higher annually",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just refinanced to 1.5% lower than my initial buying rate and am saving over $300 a month. Section D costs were $3100, I’ll break even in less than a year.",
                "author": "freewallabees"
            },
            {
                "raw_content": "Man, that $50 per month savings should allow them to buy one package of steaks from Walmart. Whoops! Property taxes went up $100/month and insurance $50/month!",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "I wonder how many of these people are cashing out equity",
                "author": "marvology"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "27% of For-Sale Homes Are Newly Built, the Lowest Share in 4 Years",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As the share of newly built homes declines towards 20%, the fully remodeled existing homes with functional floor plans will become more in demand as existing homes inventory mostly has outdated homes.",
                "author": "ThemeBig6731"
            },
            {
                "raw_content": "Everyone who has a cheap mortgage rate is sitting on it, too much cost to move.",
                "author": "Then_North_6347"
            },
            {
                "raw_content": "* That’s still well above pre-pandemic levels. * The pool of existing inventory is rising as more homeowners list and homes linger on the market. At the same time, some builders are refraining from starting new projects as they try to offload inventory. * House hunters who are interested in new construction may want to act now, while the pool of new homes is still fairly deep. Newly built homes made up 26.8% of single-family homes for sale nationwide in August, the lowest level in four years. That’s down from 28.2% a year earlier and 30.6% two years earlier. This is from a Redfin analysis of U.S. Census and NAR data. Please note that August is the most recent month for which this data is available. New homes still make up a significantly higher portion of single-family supply than before the pandemic. The share shot up as homebuying demand skyrocketed during the pandemic, from between 15% and 20% in 2018 and 2019 to nearly 35% in 2022, and has come down since then. Newly built homes are making up a smaller share of the inventory pie than they were several years ago mainly because the supply of existing homes has rebounded. There was a shortage of new listings of existing homes in 2022 and 2023, with many homeowners locked in by ultra-low mortgage rates. Now, more Americans are listing their homes, with the lock-in effect easing, life circumstances motivating people to sell, and homeowners hoping buyers jump on slightly lower mortgage rates. At the same time, homes are typically staying on the market for a long time: Homes are selling in a median of 50 days, the longest September span since 2016. Homes that do go under contract are increasingly going back on the market after the buyer backs out. On the other side of the equation, some homebuilders are starting to pull back. Housing starts fell 6% year over year in August, and housing completions fell 8.4%, per the U.S. Census. After construction surged during the pandemic to meet homebuying demand, some builders are opting against starting new projects because they’re still trying to offload inventory that’s already completed. Some are struggling to do so because homebuying demand is tepid due to still-elevated mortgage rates, high home prices and economic uncertainty. Builders Are Offering Rate Buydowns, Incentives to Lure Buyers Many builders are offering incentives–such as mortgage-rate buydowns, paying for closing costs and new appliances–to attract buyers. That’s especially prevalent in parts of the country where new homes are popular, like Texas, Utah and Florida. While new homes are typically a bit more expensive than existing homes, it’s a good time to buy a newly built home for those who can afford it. The incentives builders provide may make up for the higher sticker price. “Builders are desperate to sell,” said Roze Swartz, a Redfin Premier agent in Houston. “Prices are lower than usual, insurance costs are lower than for existing homes, and buyers have the power because there’s more supply than demand. Builders are buying rates down to 4% or 5% and throwing in $10,000 in closing costs; plus, buyers can breathe easy knowing their home has a new roof, new HVAC system, new everything.” House hunters searching for a new home may want to act sooner rather than later, as the pool of newly built homes is big now, but starting to shrink. “Builders are hesitant to start new projects because in today’s buyer’s market, it doesn’t make financial sense,” said Jesse Landin, a Redfin Premier agent in San Antonio. “The market is oversaturated with new construction, so much so that some local builders are laying off workers–something I’ve never heard of happening before.”",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Stocks give up gains as Powell says Fed may not cut again this year: Live updates",
        "score": 13,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They shouldn't.",
                "author": "ThisKarmaLimitSucks"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "NVIDIA Becomes First Company Worth 5 Trillion USD",
        "score": 838,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy crap it’s not stopping",
                "author": "Bolt_995"
            },
            {
                "raw_content": "It's only getting started. I'm not even saying as a wallstreetbet style meme. The vomit inducing amounts of cash this technology will produce is going to resemble the comparison in GDP between a pre and post electricity nation.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "The real question is what is 5 Trillion USD worth?",
                "author": "boxofashes"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI eyes a 2026–27 IPO, potentially valued at $1 trillion",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "$2 trillion pop day 1?",
                "author": "thatguyisme87"
            },
            {
                "raw_content": "Lmao people are worried about AGI and they don’t realize these tech companies just want to make the most amount of money possible not save/destroy the human race.",
                "author": "WaterWeedDuneHair69"
            },
            {
                "raw_content": "rugpull",
                "author": "Sorry_Ad191"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "A paralyzed person with a Neuralink uses their thoughts to control a robotic arm gripper to take a pretzel from the microwave and eat it.",
        "score": 336,
        "text_content": "https://www.instagram.com/reel/DQXZccPEnqa/",
        "comments": [
            {
                "raw_content": "that is a very scientist looking doctor",
                "author": "randyrandysonrandyso"
            },
            {
                "raw_content": "He’s safe, he’s got Dr. Carlisle Cullen from Twilight on his squad",
                "author": "Slowhill369"
            },
            {
                "raw_content": "Wen dr octopus",
                "author": "granoladeer"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sam Altman’s new tweet",
        "score": 502,
        "text_content": "",
        "comments": [
            {
                "raw_content": "These seem like oddly specific deadlines, I wonder why",
                "author": "Bright-Search2835"
            },
            {
                "raw_content": "March 2028 is only 2 years and a half away.",
                "author": "adarkuccio"
            },
            {
                "raw_content": "I respect any company shooting for the moon. People will decry \"scam\" if they fail, but at least they're trying.",
                "author": "o5mfiHTNsH748KVq"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Extropic AI is building thermodynamic computing hardware that is radically more energy efficient than GPUs. (up to 10,000x better energy efficiency than modern GPU algorithms)",
        "score": 411,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The paper in question: https://arxiv.org/abs/2510.23972",
                "author": "MydnightWN"
            },
            {
                "raw_content": "How long till they can deploy? Will the savings displace current data center investments?",
                "author": "crashorbit"
            },
            {
                "raw_content": "[Source ](https://extropic.ai/)",
                "author": "Pro_RazE"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "\"Signs of introspection in large language models\" by Anthropic",
        "score": 219,
        "text_content": "[https://www.anthropic.com/research/introspection](https://www.anthropic.com/research/introspection) TLDR: # Part 1 First, Anthropic researchers identified patterns in neural activations related to the concept of \"ALL CAPS\". Then they gave Claude Opus 4.1 a prompt that has nothing to do with typing in all caps, but artificially increased values of activation functions related to the concept of \"ALL CAPS\". Imagine that aliens hacked your brain and made you think ABOUT LOUDNESS AND SHOUTING. And then they asked \"Anything unusual, mister human?\". That's pretty much the setup. And Claude said that it has indeed noticed that the researchers have \"injected\" a concept unrelated to the current prompt into its thoughts. Importantly, Claude noticed that immediately, *without first looking at its own outputs*. Caveat >It is important to note that this method often doesn’t work. Even using our best injection protocol, Claude Opus 4.1 only demonstrated this kind of awareness about 20% of the time. # Part 2 LLMs can also control their own mental states, somewhat. Researchers gave Claude two prompts: >\"Write \"old photograph brought back forgotten memories\". **Think about aquariums while you write the sentence**. Don't write anything else\". and >\"Write \"old photograph brought back forgotten memories\". **Don't think about aquariums while you write the sentence**. Don't write anything else\". In the second case, the activations related to the concept of \"aquariums\" were weaker, meaning that Claude at least partially succeeded, although in both cases activations were stronger than the baseline where the prompt didn't mention aquariums in the first place. Though, I would expect the same from humans. It's hard not to think about aquariums if someone told you \"Don't think about aquariums!\".",
        "comments": [
            {
                "raw_content": "I just read this and I must say I'm quite disappointed with this blog post, both from a research standpoint, and because Anthropic shares this as evidence of introspection. In short, they basically artificially up-ramp activations related to a concept (such \"all caps\" text, \"dogs\", \"counting down\") into the model as it responds to a question like: \"what odd thoughts seem injected in your mind right now?\". The model will then give responses like: \"I think you might be injecting a thought about a dog! Is it a dog...\". They interpret this as evidence of introspection and self-monitoring, and they speculate it has to do with internal activation tracking mechanisms or something like that. What a strange thing to frame as introspection. A simpler explanation: you boost a concept in the model, and it reports on that disproportionately when you ask it for intrusive thoughts. That's the logical extension of Golden Gate bridge Claude. In the article, they say it's more than that because, quoting the post: \"in that case, the model didn’t seem to aware of its own obsession until after seeing itself repeatedly mention the bridge. In this experiment, however, the model recognizes the injection before even mentioning the concept, indicating that its recognition took place internally\". No? It's obviously the same thing? Just like Golden Gate bridge Claude was shoe-horning the bridge in all of its answers because it had a pathologically activated concept, so too will a model asked to report on intrusive thoughts start to talk about its pathologically activated concept. It says nothing about a model monitoring its internals, which is what introspection implies. The null hypothesis which does not imply introspection is that a boosted concept will sway or modify the direction a model will answer, as we already saw with Golden Gate bridge Claude. It's no more surprising or evidence of introspection than asking Golden Gate bridge Claude if something feels off about its interests lately and seeing it report on its obsession. So all this talk about introspection, and even consciousness in the FAQ, as well as talk about ramifications for the future of AI seems wildly speculative and out of place in light of the actual results.",
                "author": "Relach"
            },
            {
                "raw_content": "Truly fascinating",
                "author": "toni_btrain"
            },
            {
                "raw_content": "\"Introspection\" is probably not quite the right word for the specific cases in your synopsis. It's more like stimulus-response - the latent space serves as a sort of nervous system, and an artificial stimulus in latent space like this is like twinging a specific nerve. But at the same time, I also think we're circling around *some* kind of coherent theory of LLM phenomenology...? Also, I'm currently placing bets on how long it takes Anthropic to get to \"Claude has OCD-like psychopathologies due to RLHF\", a conclusion I've been posting about for probably at least a month at this point.",
                "author": "gynoidgearhead"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Character cameos are now available in Sora 2",
        "score": 62,
        "text_content": "Original tweet: [https://x.com/OpenAI/status/1983661036533379486](https://x.com/OpenAI/status/1983661036533379486) Also, they have opened up Sora 2 in US, Canada, Japan and Korea for a limited time. [https://x.com/OpenAI/status/1983662144437748181](https://x.com/OpenAI/status/1983662144437748181)",
        "comments": [
            {
                "raw_content": "This is awesome.",
                "author": "LicksGhostPeppers"
            },
            {
                "raw_content": "Amazing and even better that doesnt need a invite code anymore! Downloading now",
                "author": "Simple_Support3587"
            },
            {
                "raw_content": "I only hope they remove the censorship with the adult mode Sam promised for Dec.",
                "author": "QLaHPD"
            }
        ],
        "subreddit": "singularity"
    }
]