[
    {
        "post_name": "Winter Storm Fern Proved Coal Is Still the Power Grid's Reliable Backbone",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Lol so gay they started naming winter storms like hurricanes to make them more scary and push muh climate change nonsense",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "# ROLL BACK ALL EPA REGS *and* # THEN ROLL COAL",
                "author": "ArkansasRepublic"
            },
            {
                "raw_content": "Never forget that the only so-called greenhouse gas that actually affects global temperatures is WATER VAPOR (0.25% of the atmosphere). Everything else the globo-homo communist fucking terrorists demonize are literally TRACE gases which account for less than 0.5% of the entire planet's atmosphere: CO2, the GAS OF LIFE, feeding plants which in turn gave us O2 to breathe, is only 0.04% (four-hundredths of a percent) of the atmosphere. CH4 (methane) is 0.00018% of the atmosphere (18 ten-thousandths of a percent)! Literally making shit up and rely on people never validating facts with a cellphone Even wokepedia doesn't lie about it: https://en.wikipedia.org/wiki/Atmosphere_of_Earth",
                "author": "MacheteSanta"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Steven McNeel (R) WINS Georgia State Senate District 18 Special Election Runoff, defeating LeMario Brown (D). Republican HOLD!",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So it doesn't take 6 weeks to count ballots like in California?",
                "author": "JimDandy"
            },
            {
                "raw_content": "Le tough break for LeMario.",
                "author": "Trunalimunumaprzur"
            },
            {
                "raw_content": "https://election-night.decisiondeskhq.com/date/2026-02-17 - Steven McNeel -14,630 (59.3%) - LeMario Brown - 10,049 (40.7%)",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LATE NIGHT RARE PEPE!",
        "score": 208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is best in life?",
                "author": "RustySheckelford"
            },
            {
                "raw_content": "Pepe the Frenbarian. Conqueror of the Soy Army.",
                "author": "ManBadOrange"
            },
            {
                "raw_content": "very rare",
                "author": "try4gain"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Department of State : The United States has no obligation to host criminals who endanger the American people. A U.S. visa is a privilege, not a right. In this Trump Administration’s first year, we revoked over 100k visas from the Worst of the Worst - DUI, child abuse, and assault.",
        "score": 1069,
        "text_content": "",
        "comments": [
            {
                "raw_content": "MOARRRRRRR And end the fucking H1-B's dude. We don't fucking need them.",
                "author": "RonPaulWasRight"
            },
            {
                "raw_content": "NICE! ONLY 49,900,000 LEFT TO GO",
                "author": "Stygem"
            },
            {
                "raw_content": "Get rid of every Chinese and Muslim country visa. Deport all Somali fraudulent Santuary persons and Dreamers.",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Restore Europe 🇫🇷",
        "score": 996,
        "text_content": "",
        "comments": [
            {
                "raw_content": "the fatigue is getting fatigue",
                "author": "RedditStillSucks"
            },
            {
                "raw_content": "They do it to fuck with us We all agree on that right? They lie about why, but they're doing it to fuck with us.",
                "author": "JohnMiller2020"
            },
            {
                "raw_content": "I bet she stole that horse.",
                "author": "Dev404"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Just an idea 🤷‍♀️",
        "score": 969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# Calling RIGHT NOW # with all FIVE of my BURNER FONEZ",
                "author": "ConfederateDad"
            },
            {
                "raw_content": "I have a demon dialer that will melt their switchboard",
                "author": "christ93_1"
            },
            {
                "raw_content": "🚦✅🐸🐊🚥",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This should be a GREEN LIGHT for other red states to follow suit!",
        "score": 863,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Any republican state not doing this right now are traitors.",
                "author": "Prof_Smith"
            },
            {
                "raw_content": "They are doing the same thing in Virginia. The Supreme Court of Virginia confirmed that Virginia’s redistricting referendum will proceed as scheduled on April 21, 2026. If anybody lives in VA, remember that date.",
                "author": "libsaremental"
            },
            {
                "raw_content": "This is the opposite of gerrymandering….these districts look legit.",
                "author": "Thep1mp"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FAFO",
        "score": 1367,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A whole year from now?",
                "author": "McFatty7"
            },
            {
                "raw_content": "Fuck the BBC.",
                "author": "rainbowthree"
            },
            {
                "raw_content": "They can settle for $8B kek",
                "author": "TexasBeer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "13-year-old Sullivan Clarke was ONE MILLIMETER away from becoming the next Iryna Zarutska. Why do attacks like this keep happening?",
        "score": 1333,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This next generation is going to be SO racist, lol, maybe we can get a return to decency at some point. Black people didn't act like monsters when they knew a wrong look could have them swinging from a tree.",
                "author": "Scipio_Americanus"
            },
            {
                "raw_content": "America has a severe negro problem.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Kill this fucking jogger and torture him along the way. Make an example of him.",
                "author": "BlackPilledMAGA"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VIDEO: British parents call the police on their OWN SON for being \"far right\"",
        "score": 943,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What did he do, take the Amelia route on Pathways?",
                "author": "Long_time_lurker"
            },
            {
                "raw_content": "Wow it’s the opposite of Orwell’s 1984 when the children across the hall turned their parents in. People have become programmed to hate",
                "author": "Flubadub"
            },
            {
                "raw_content": "These are the same kind of parents who would publicly apologize to illegals if one of them murdered their child.",
                "author": "Slugbert"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Fuck off, Kamala.",
        "score": 579,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not to mention the $2 billion spent in 107 days.",
                "author": "SisterCovfefeToo"
            },
            {
                "raw_content": "Umm... those 6 bankruptcies were 6 out of like 108 businesses that didn't work out. Trump himself never went bankrupt. BTW most new businesses go under at a clip of like 85% and Trump averages less than 5% failure rate.",
                "author": "Archdukeofevil"
            },
            {
                "raw_content": "He didn’t get $400 million either. So many errors in this statement",
                "author": "gorilla_grip"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ukrainian Negotiators Divided, With Head of Presidential Office Budanov Leading Faction Who Wants a Quick Peace Agreement ‘While There’s Still Time’: REPORT",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There can be no peace or 'unity' until Zel is removed from the picture i.e. killed.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Make Ukraine Russia Again!",
                "author": "Klown_Kutz"
            },
            {
                "raw_content": "Russia just needs to take Jewkraine. Expel all the khazarians and turn it into a DMZ.",
                "author": "DeaduponArousal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yeah, but what about Elian? Dammit! WHAT ABOUT ELIAN!!",
        "score": 895,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is hilarious as fuck. The left spent MILLIONS protecting this one guy while DHS deported 600,000 others. Hahaha.",
                "author": "FatigueIsReal"
            },
            {
                "raw_content": "Trump needs to make it personal and deport this fucker at all costs.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "The US Government has/had plans, the fucking judges keep bringing him back.",
                "author": "MericaFukYeah"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Man arrested at U.S. Capitol had loaded shotgun & tactical vest.",
        "score": 868,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tactical Tranny",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Another tranny?",
                "author": "NazisWereSocialist"
            },
            {
                "raw_content": "Sick of all these lowlife freaks.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Jeremy Stamper, \"I can’t imagine what a world without Islam would even look like.\"",
        "score": 737,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Jews did 9/11",
                "author": "Tacticalsmoke420"
            },
            {
                "raw_content": "Growing up the year 2000 seemed like it would be a mythical world of technological innovation. Watching '2001 A Space Odyssey ' as a kid I actually believed that was what that year would be like. Instead it got dragged back 14 centuries by some evil savages from the turd world.",
                "author": "SubmarineGuy"
            },
            {
                "raw_content": "Go back further: Istanbul might still be Constantinople Library of Alexandria might not have burned down and we might still have its contents Egypt wouldn't have undergone racial replacement from Islamic conquests Spain wouldn't have suffered through centuries of Islamic rule No Barbary Wars And so on and so forth...",
                "author": "AmericanJawa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Teen in tactical gear arrested after allegedly charging toward US Capitol with loaded shotgun",
        "score": 974,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tactical Dress?",
                "author": "NinjaPlease"
            },
            {
                "raw_content": "Anyone else sick of this yet? All part and parcel of our youth being weaponized against our own country and our own people.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "leeroy jenkins?",
                "author": "Yoloist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Last night, Stephen Colbert went rogue and ignored the network lawyers at CBS by talking about how he wasn’t allowed to have Texas Senate candidate James Talarico on without also having his opponents on due to “Equal Time” rules. He then taunted Chairman Brendan Carr by saying: “FCC You.”",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yank this faggot off the air permanently. Let him go to podcast land where he will quickly fade into obscurity. Fuck his network over too, they are already violating the rules with their one-sided political slant on everything. Who needs a candidate to go on TV and preach their politics when the network and this late night clown are doing it for them already?",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "These guys are like this because there are zero consequences",
                "author": "PapaPepe"
            },
            {
                "raw_content": "Fuck this guy",
                "author": "cbonez416"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Katie Zacharia, a lawyer and STAUNCH advocate for President Trump’s deportation policies, will be taking over as DHS Spokesperson following Tricia McLaughlin’s departure.",
        "score": 875,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Where are the men?!",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "",
                "author": ""
            },
            {
                "raw_content": "Tricia was outspoken and a supporter of Trump but to be honest her voice was sort of annoying. I just hope that she will not come out and bash Trump or his administration, like many seem to do..",
                "author": "ohpleaseuhhelpame"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Rumblings About Alito Retiring From SCOTUS?",
        "score": 845,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes me scared he would pick another women. I am sure Ted Cruz is sending him love letters....",
                "author": "FusionBlack"
            },
            {
                "raw_content": "2/3 of his picks so far have been losers. Alito is one of the good ones. He needs to stay as long as possible.",
                "author": "AmazingFlightLizard"
            },
            {
                "raw_content": "The worst part is that he can't stack the court with copies of Clarence Thomas.",
                "author": "Archmagnus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Multiple medevac flights have been requested after a church EXPLODES in Boonville, New York",
        "score": 1067,
        "text_content": "",
        "comments": [
            {
                "raw_content": "they smelled gas, then furnace ignited, church exploded, no evidence of criminality 4 seriously injured, pastor + 3 fireman https://www.msn.com/en-us/news/crime/boonville-church-explodes-5-injured-including-firefighter/ar-AA1WxcBK?ocid=BingNewsSerp",
                "author": "SuperDuperBasedMD"
            },
            {
                "raw_content": "It appears this might be a gas leak, but it also is the start of Ramadan, so it might not be an accidental leak...",
                "author": "footinmouth"
            },
            {
                "raw_content": "Last week another church nearby also burned https://www.wwnytv.com/2026/02/09/fire-destroys-historic-church-lewis-co/ Coincidence?",
                "author": "bigleaguetrump"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Computerbase blind DLSS4.5 / FSR Redstone / native comparison survey results (6747 participants)",
        "score": 259,
        "text_content": "Over the past few weeks CB had a comparison going where people could vote for their favourite image quality. The [results are now online](https://www.computerbase.de/artikel/grafikkarten/nativ-vs-dlss-4-5-vs-fsr-upscaling-ai-leser-blindtest-auswertung.96165/). ### Why I think this is worth posting and discussing: * It was based on high-quality **video** with a good comparison player * It uses a varied set of games (also in terms of engines) with good implementations of all the technologies * It had a sufficient number of participants to draw conclusions * Overall, it's simply the only remotely representative and sufficiently well designed recent user study of this kind that I know of ### Weaknesses (my personal opinion): * The clips mostly featured camera movement. This is functionally somewhat different for any TAA-based algorithm compared to character movement; but it's hard to have directly comparable scenes with the exact same, fast character movement, so I understand the choice * It's based on \"Quality\", which is getting hard to recommend in terms of, well, quality/performance tradeoff with top-of-the-line methods * Relatedly, it didn't feature DLSS 4 / preset K; At \"Quality\" scale levels, in at least some scenarios, I think that can look better than 4.5; however, it might not have been a good option to also include that in the design as-is, because... * In terms of survey design, it asked for \"the best\", rather than a ranking which IMHO would have been more appropriate and allow more definite conclusions. # So, what were the results? You can look at the table in the link (it's German but the table is easily understood), but in short, **DLSS 4.5 won in every single game**, and by a *very* substantial margin in all of them except Cyberpunk 2077 -- where \"Native\" was strongest, comparatively, which basically just tells us that CDPR graphics engineers are really good at their job. What's interesting for me is that, as a participant, I can see my votes now, and out of 6 games I personally voted for native 2x, FSR 2x and DLSS 2x. Giving it a brief look again confirms what I expected: the audience values clarity and sharpness more than I do (vis-a-vis temporal stability). Based on my experience in other games, I'm pretty sure that in those where I didn't vote for DLSS 4.5 (preset M), I would have actually liked DLSS 4 (preset K) best at \"Quality\" scaling, since it tends to produce a smoother (and what some would argue \"less detailed\") result. I'd love to see a blind survey designed with similar experiment quality that does 4x scaling (50% in both axes), or perhaps even higher.",
        "comments": [
            {
                "raw_content": ">What's interesting for me is that, as a participant, I can see my votes now, and out of 6 games I personally voted for native 2x, FSR 2x and DLSS 2x. Giving it a brief look again confirms what I expected: the audience values clarity and sharpness more than I do (vis-a-vis temporal stability). This is just going off of loose memory but I somewhat recall there were surveys (perhaps even studies?) suggesting this as well as it pertained to image brightness, color saturation, and perceived sharpness where more equaled subjectively better to a lot of people regardless of accuracy to 'ground truth'. Also there had to be a reason so many TVs had sharpening post processing often times tuned so aggressively. I guess it's not surprising nvidia would tune in that direction. >Based on my experience in other games, I'm pretty sure that in those where I didn't vote for DLSS 4.5 (preset M), I would have actually liked DLSS 4 (preset K) best at \"Quality\" scaling, since it tends to produce a smoother (and what some would argue \"less detailed\") result. Personally I also prefer preset K compared to M as stability has been one of the most important things for me since aliasing has become so much worse with aliasing outside geometry.",
                "author": "LRed"
            },
            {
                "raw_content": "Amd has an extremely tough hill to climb to convince people to drop dlss and move to their cards even at a cheaper price. Many are now effectively locked to Nvidia cards due to DLSS",
                "author": "From-UoM"
            },
            {
                "raw_content": "Folks at r/FuckTAA arent going to be very happy with the results lol",
                "author": "NeroClaudius199907"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Western Digital's HDD production for 2026 is already sold out",
        "score": 203,
        "text_content": "Western Digital has already sold out its entire HDD manufacturing capacity for the year, and it's only February. According to CEO Irving Tan, 2026 is effectively fully booked. AI companies are purchasing storage drives that have yet to be manufactured, and relief for traditional customers is unlikely anytime soon – not within the next couple of years, at least.",
        "comments": [
            {
                "raw_content": "mom said I can post this tomorrow",
                "author": "crab_quiche"
            },
            {
                "raw_content": "So it's gonna be a new mountain bike for me this spring.",
                "author": "ea_man"
            },
            {
                "raw_content": "At this point I am on my knees begging my 5800x to survive half a decade",
                "author": "ps5cfw"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Meta already deploying Nvidia's standalone CPUs at scale",
        "score": 43,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Not surprising. Meta works closely with all the big chip companies and gets hardware first.",
                "author": "EmergencyCucumber905"
            },
            {
                "raw_content": "\\>\"Meta already deploying Nvidia's standalone CPUs at scale\" \\>looks inside \\>\"Meta to deploy Nvidia CPUs at large scale\"[](https://www.reddit.com/r/hardware/?f=flair_name%3A%22News%22)",
                "author": "GARGEAN"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Inevitable Opportunity to Screw Consumers | GPU Pricing Update",
        "score": 36,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Impulse buying a 5070 TI back in December has saved my ass Buy prebuilts or AMD cards for now folks, do not spend $1000 on a 5070 ti",
                "author": "BidnessBoy"
            },
            {
                "raw_content": "I think people fail to understand that out of ALL OF THE PRODUCTS a company like AMD makes, consumer GPUs are about the lowest profitability per wafer. They are way worse than Enterprise CPU/GPU and even worse than Consumer CPU. Consumer GPU is the least profitable so they will naturally allocate the fewest wafers to it if there is any kind of wafer supply constraint.",
                "author": "Jaegs"
            },
            {
                "raw_content": "That's fine. I will continue to hold. Reverse diamond hands with my 1080 Ti.",
                "author": "wickedplayer494"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Hardware Unboxed: \"Is This The Solution to Crazy DDR5 Prices? [32 GB KingBank KFRW DDR5-6000 (CL36) Soarblade (CXMT) Review]\"",
        "score": 111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TL;DW: - Work great for gaming. - Prices very high already.",
                "author": "HanlonsRazor_"
            },
            {
                "raw_content": "Even those chinese branded ram have already skyrocketed on price alongside the known branded ones, makes no difference really.",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "You know the ram shortage is bad because cxmt and ymtc were removed from the pentagons bad list",
                "author": "Lighthouse_seek"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung confirms Galaxy Book 6 series for Europe with pricing and release dates",
        "score": 23,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Branch Education] The Incredible Evolution of Computers",
        "score": 14,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Valve breaks its silence on Steam Deck OLED scarcity and yes, it's because of the RAM and storage crisis",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "TSMC need to break this soon if, not many companies are going bankrupt and they would have only a few custumers loosing power on decisions over their own company and becoming slaves...",
                "author": "milyuno2"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Recent AC shadow update changes the water surface dramatically.",
        "score": 1800,
        "text_content": "They added the reflection on water and it really makes the difference. Though, that addition is only applied on docked mode.",
        "comments": [
            {
                "raw_content": "Oh wow, that is pretty! Looks great",
                "author": "Fun-Document7"
            },
            {
                "raw_content": "Ubisoft gives us a graphical and stability upgrade for AC Shadows Bethesda gives us a new rock solid 60fps \"Performance mode\" on Skyrim Y'know, I'm REALLY liking the direction this console is headed. Seeing devs actually put the work in for the fans of their games post-launch is always a good thing",
                "author": "Playful_Lecture7784"
            },
            {
                "raw_content": "Holy crap. That’s day and night",
                "author": "OneUse2170"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "new skyrim update out today, 60fps mode added",
        "score": 1041,
        "text_content": "i tested it myself and its true, select the new \"prioritize performance\" mode in the menu and it now hits 60fps",
        "comments": [
            {
                "raw_content": "also 60fps in handheld if anyone wanted to know",
                "author": "TiocStudios"
            },
            {
                "raw_content": "I wonder how Fallout 4 will run",
                "author": "Arroweye345"
            },
            {
                "raw_content": "Latency seems way better now, even at 30fps. It sucks that it took them over two months to fix this, but at least they've done it.",
                "author": "GassoBongo"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I think it is now safe to say that this \"NashWeedle\" guy is a fake leaker.",
        "score": 81,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I dont follow any leakers, but it's still the third week of February.",
                "author": "StockHumor4768"
            },
            {
                "raw_content": "While I don't think it's likely, I will wait till the end of the week to make judgements.",
                "author": "A_Sackboy_Plush"
            },
            {
                "raw_content": "They announce directs either Tuesday or Wednesday. The week isn't over yet",
                "author": "comrade333"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Skyrim Switch 2 comparisons. 1st image is docked quality, 2nd is docked performance, 3rd is handheld quality, 4th is handheld performance. Repeat for the 2nd set of images",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm at peace with myself as all these images feel like difficult spot the difference challenges",
                "author": "Zane-chan19"
            },
            {
                "raw_content": "![gif](giphy|pV0lVLeA0JXjBiO5Cp)",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "I definitely noticed a resolution hit in handheld when choosing performance mode. Yet the game feels much nicer to play with how much smoother it is. In docked mode however I didn't notice the resolution difference that much. So in both cases I prefer the performance mode.",
                "author": "maian_sos"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What reviews don't tell you about Mario Tennis Fever (good and bad)",
        "score": 179,
        "text_content": "There have been few games I can recall that have exposed how bad at their jobs game reviewers are more than the most recent Mario Tennis. And this has nothing to do with opinions. This is multiple sites regurgitating the same falsehoods while also skipping over or outright ignoring critical changes and pieces of information. So, if you're considering this game and are still on the fence, here are some important things you're not being told about this game. 1) There is more content in this game than any previous Mario Tennis - by a distance. There are 38 characters - about half of whom need unlocked - multiple colour variations, which all need unlocked, and multiple court types (all of which are viable as ways to play), about half of which need unlocked. Simply unlocking all this will take multiple hours. This extends to ways to play with more variations on tennis than you could shake a big racket at. A lot of these may be a bit hit and miss, but they are there and I don't think any Mario Tennis game has ever offered more variety in this regard. 2) The Adventure mode is categorically NOT a glorified tutorial. Adventure mode is quite short, it's quite easy and, honestly, I found it a little slow and boring at times, but so many reviews call it a glorified tutorial (often using those exact words) and this could not be further from the truth. In Adventure mode, you spend large amounts of its first half playing mini-games that have nothing to do with the regular gameplay - you fly down a conveyor as a little plane, you bat fish from a boat etc. These are mostly pretty simple, and to progress you just need to beat each one once. However, if you want, each has a further 2 diffilulty levels to beat. They're never too challenging, but they can be quite fun and beating all of them will seriously extend how long the academy section of the adventure lasts. In the second half of Adventure mode, you go off on a weird little adventure using your tennis skills to defeat foes - either on a court (often using specific rules) or in special environments. None of this is particularly amazing, but the idea it's all some extended tutorial is, frankly, insane - and I can't help thinking in some cases may result from reviewers having not bothered getting past the academy section. It is not a GBA style rpg, which is a shame, but it's a silly bit of additional content that offers a bunch of weird but simple alternate spins mixed with the main tennis gameplay. 3) Tournament mode offers a pretty tough challenge - compared to previous games. I saw one review where they beat the first cup then declared tournaments to be too short and too easy. Well, yes, of course the shortest, easiest tournament is short and easy! However, the final one is both a lot longer and, depending who you draw, can actually be pretty tough. I've had some intense finals against the CPU in both singles and doubles, and I've seen many people in the Mario Tennis sub saying they can't beat the last cup. Tournaments would get an A+ this time round if it weren't for one stupid omission. Namely that not only is there once again no trophy room, there is now not even an indicator to show which characters you've beaten the cups with. For a Maro Tennis obsessive like me, this is a major miss as I played Aces for many hours winning all tournaments with all characters and there's now no way to keep track of this beyond writing it down yourself. 4) Trial Towers offers a *massive* amount of single player content. There are 3 towers of escalating difficulty that offer 10 challenges each - and these alone offer great replayability. However, after completing all towers once, a 100 challenge (yes, one *hundred* challenge) list opens up with each challenge including 3 star requirements, and completing this entire list will take many, many hours. The challenges can be a bit repetitive and it's something I only dip in and out of for a short while at a time, but almost no reviews cover this at all and I am almost certain this is because very few reviewers beat all the towers and became aware of its existence, which in my opinion, is kind of scandalous. 5) The Fever rackets are really fun - but in order to accomodate them, the underlying mechanics have been given the biggest shake up in Mario Tennis history. Again, I can't believe this hasn't received wider coverage. Fever rackets create all sorts of hazards that slow you down or stop players reaching the ball. So it's not then impossible to play once you get hit with an effect multiple changes have been made such as slowing the ball speed, having most shots arc higher, nerfing serves so aces are a borderline impossibility against anyone competent and making it massively more difficult to hit the lines - especially at acute angles. You win points by forcing your opponents into hazards etc (and this does indeed add a really fun and frantic - and sometimes quite tactical - new layer to the gameplay) far moreso than by beating them with well-placed passing shots. Which brings us to the final point: 6) Simple tennis has been borderline broken by these new changes. Put the CPU on Pro difficulty and you pretty much cannot pass them, and they pretty much cannot pass you. Rallies are absolutely interminable because even if you maneuver your opponent into a completely disadvantageous position with a clear passing shot down the line, no matter your shot choice or own positioning you will hit the ball a metre inside the court with nowhere near enough pace to pass. This makes total sense when playing with Fever rackets, but with Fever rackets off they needed to revert to the old mechanics and not doing so has rendered simple tennis an absolute slog. --- It's honestly such an embarrassment that so much of this is absent from the majority of mainstream reviews. A lot of those guys simply have not done their jobs properly and even if the roughly 50/50 good/bad nature of most of the above probably wouldn't have ended up changing the game's score much, it may well affect many people's choice to purchase the game or not, so I hope the above will be useful to anyone still unsure on the game.",
        "comments": [
            {
                "raw_content": "As someone who wants to just play regular ass tennis with the Mario characters, your last point was pretty damning for me.",
                "author": "SrirachaChili"
            },
            {
                "raw_content": "They certainly didn't tell us much or as much as they could have. Nintendo Life had one of the worst reviews I've seen. It took 12, TWELVE, paragraphs before they even started talking about the game at hand. It was like those cooking recipes you see online that have to give you their life story before telling you the ingredients and how to make the food. That being said I'm glad I went to try the demo and watched enough videos to know I would enjoy it and get the game myself. It's been a blast (aside from the absolutely awful adventure mode; but good thing that's not the only single player content and also not why I bought the game)!",
                "author": "Negative-History-110"
            },
            {
                "raw_content": "I think the deeper intricacies of sports games are beyond what can really be achieved in a launch window review, and if we're being honest, the majority of mainstream readers and buyers probably aren't that invested in this level of detail (case in point, most people just look at the score then go off in the comments without reading anyway). A game like this will ultimately be defined by its staying power in local party multiplayer first and foremost and that's not easy to judge from a 1 week play. Rather than complain about mainstream reviewers doing what they can within the confines of their jobs, look for reviewers that suit your tastes. Something like this is more within the domain of youtubers, and is impossible to get by launch day. PS your review is appreciated! Kind of a bummer that simple tennis is basically broken. Imo even with an arcadey game designers should still start with a solid base experience before throwing in crazy modifiers. Many Nintendo games suffer from a lack of options, Mario Kart World on launch too, though they seem to be gradually expanding with updates. Sounds like this could use some modifiers for ball speed etc which could be fun to mess around with.",
                "author": "falconpunch1989"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No Rest for the Wicked on Switch 2",
        "score": 162,
        "text_content": "Thomas Mahler, CEO and creative director of Moon Studios (Ori and the Blind Forest, Ori and the Will of the Wisps), showed images of early porting work for No Rest for the Wicked on Switch 2. It appears that a Switch 2 port has gone from being a mere consideration to a project actively in development.",
        "comments": [
            {
                "raw_content": "I hope they're working on Ori patches as well. These games could be brought to 1440p/120fps in HDR on Switch 2.",
                "author": "Medd-"
            },
            {
                "raw_content": "Wow, that’s great news! Will be keeping a close eye on this one.",
                "author": "BajaLaddie"
            },
            {
                "raw_content": "It worries me how close they are to 1.0 and the game still feels like more of a foundation than fully completed. It’s been a pretty up and down early access for this one, still major optimization issues and too much of a grind for some of the progression",
                "author": "cuntpuncherexpress"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Skyrim docked quality vs performance mode draw distance",
        "score": 72,
        "text_content": "Vegatation is cut back quite a bit",
        "comments": [
            {
                "raw_content": "The bushes in the first comparison are a noticeable difference imo. But for the mountains even after looking for a half a minute I can't see a difference",
                "author": "julesvr5"
            },
            {
                "raw_content": "Kinda crazy foliage costs so many frames",
                "author": "theassmasta69"
            },
            {
                "raw_content": "I literally cannot tell the difference. Maybe it's growing up in the 90s and 00s but people make way too big of a deal about negligible differences.",
                "author": "ZeusPeabody"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "AC shadows already looking better on 1.1.8",
        "score": 306,
        "text_content": "lol there's a lot more blood now and definitely less frame drops.",
        "comments": [
            {
                "raw_content": "It feels way smoother docked now. Still some stutter but overall I’d say 90% less. Graphically I didn’t notice much change but it was already amazing docked. Handheld looks about the same. I think they should just give us a sharpeness slider it helps the blurry look better",
                "author": "Bootychomper23"
            },
            {
                "raw_content": "Still mental to me that I could play this on a handheld if I wanted to. I've gone back to the PS5 version as I have a Pro now, but I played about 6 hours on Switch 2 in handheld and had a blast with it. Gonna be a good roadtrip game.",
                "author": "utterlychangedfire"
            },
            {
                "raw_content": "Haven’t played it yet but I am excited to jump into this.",
                "author": "Ttm-o"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "For the psychos like me who kept their labo VR it’s janky but works with virtual boy",
        "score": 28,
        "text_content": "you have to unfold the sides and take out the frame but doesn’t require ripping/altering the setup. Works pretty well, pretty surprised at how cool it is especially wario land.",
        "comments": [
            {
                "raw_content": "Really, the whole Virtual Boy thing is kind of janky. It's cool though.",
                "author": "phylter99"
            },
            {
                "raw_content": "I was just looking in to this!",
                "author": "Level_Object_4877"
            },
            {
                "raw_content": "My Switch 1 is now a labo virtual boy 😅 So far pinball and Wario are the games for me.",
                "author": "DymonBak"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Highguard website is down and has been for several hours now, implying the developer may get shut down soon",
        "score": 657,
        "text_content": "https://kotaku.com/highguard-website-down-shutting-down-servers-free-to-play-shooter-steam-playercount-2000669734",
        "comments": [
            {
                "raw_content": "Tencent just called and said you're on your own lil bro",
                "author": "Sea-Country8245"
            },
            {
                "raw_content": "Its crazy to me how this game likely would have just gone completely under the radar as a small flop if it wasn't for Geoff giving them the very last spot of The Game Awards.",
                "author": "Nisha_the_lawbringer"
            },
            {
                "raw_content": "Saying Titanfall without being Titanfall made this game DOA.",
                "author": "TheCoco91"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson says Kratos in the next mainline GOW will also have a scythe and maybe they will return to Greek mythology",
        "score": 239,
        "text_content": "About the scythe: https://www.youtube.com/live/rZcgQAfLRd4?t=2808 About Kratos possible return to Greece: https://www.youtube.com/live/rZcgQAfLRd4?t=2691",
        "comments": [
            {
                "raw_content": "#Tom Henderson is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "Wonder if this is just a miscommunication about the khopesh that was already rumored.",
                "author": "MaxPaladin93"
            },
            {
                "raw_content": "Hmmm. I'm not opposed to Greek, but I'm mainly wondering what else there is to do in it since we had 6 games in it and a lot of the major players are dead. Literally the only gods I can think of for Kratos to interact with would be... Apollo, Artemis, and Demeter maybe? Dionysus?",
                "author": "whiteshark70"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Short 1 minute resident evil requiem leon gameplay leak",
        "score": 255,
        "text_content": "https://streamable.com/ujgwhg?src=player-page-share",
        "comments": [
            {
                "raw_content": "Damn what a Kiss",
                "author": "Temporary_Round555"
            },
            {
                "raw_content": "Jesus Christ lmao",
                "author": "chickennuggiesx"
            },
            {
                "raw_content": "more than one minute, a guy was streaming it and plans on streaming it again on another account. there’s also a trusted companion claire charm (re2 outfit) and photo of spencer",
                "author": "anestefi"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "[Stephen Totilo] Tencent was the undisclosed lead financial backer of Highguard and Wildlight Entertainment",
        "score": 547,
        "text_content": "https://www.gamefile.news/p/tencent-highguard-wildlight-entertainment?utm_campaign=posts-open-in-app&triedRedirect=true >Chinese gaming giant Tencent was the undisclosed lead financial backer of Wildlight Entertainment, the studio behind 2026’s most tumultuous game launch, sources familiar with the matter tell Game File. >Neither company has previously discussed the financial relationship, and reps for both did not provide a comment by press time. >Wildlight’s funding has been one of several mysteries swirling around the studio and its debut game, free-to-play first-person multiplayer shooter Highguard.",
        "comments": [
            {
                "raw_content": "At this point, it’s safer to assume every new studio is just three Tencent executives in a trench coat until proven otherwise.",
                "author": "Straight-Ad6926"
            },
            {
                "raw_content": "Meanwhile, the former dev who crashed out on twitter describes themselves as an indie dev free of corporate oversight and influence 🤡",
                "author": "KungFuChicken1990"
            },
            {
                "raw_content": "Guess who has an end of year award show and a relationship with Tencent.",
                "author": "Deadybears"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A familiar face returns in Resident Evil Requiem.",
        "score": 521,
        "text_content": "https://ibb.co/xSCKbFzz",
        "comments": [
            {
                "raw_content": "Whoever is reporting this thread for unmarked spoiler are u fukn srs m8. Dont click a thread like this if you dont expect a spoiler. This whole sub is legitimately based on spoilers Edit:[AGH!](https://imgur.com/tEZFJ3S)",
                "author": "Spheromancer"
            },
            {
                "raw_content": "I don’t think that was on anyone’s bingo card.",
                "author": "fearsmoke"
            },
            {
                "raw_content": "Either this is a hallucination or flashback or this was the Mr X that was hunting HUNK before he evacuated.",
                "author": "Lotus_630"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Nintendo Switch 2 Europe news section highlights Bethesda sale while using Doom Slayers render from Doom The Dark Ages which isn't available for system.",
        "score": 169,
        "text_content": "https://xcancel.com/mehdi07680662/status/2023746159555092942#m Could be a simple error or accidentally confirming Doom Dark Ages is coming to the Switch w.",
        "comments": [
            {
                "raw_content": "Wouldn't read too much into this TBH but do think Doom Dark Ages on Switch 2 is a case of when and not if",
                "author": "AnonAG96"
            },
            {
                "raw_content": "Bring 2016 and Eternal to Switch 2 standards as well.",
                "author": "Medd-"
            },
            {
                "raw_content": "Kind of a no-brainer, highly performant and scalable and didn't quite light the world on fire sales wise. Throw in gyro/mice controls and it's a nice showpiece for them and switch 2.",
                "author": "NotTakenGreatName"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "CanadianGuyEh shows footage of a cancelled Crash Team Racing 2010 prototype from High Impact Games, also shares details on the cancelled “Crash Landed/I Am Crash Bandicoot”",
        "score": 232,
        "text_content": "https://xcancel.com/canadianguyehh/status/2023788612844716520?s=46 https://youtu.be/7dpJ5F6GMcU",
        "comments": [
            {
                "raw_content": "It breaks my heart how crash and spyro are left to rot despite selling so well...",
                "author": "Alone-Network-2582"
            },
            {
                "raw_content": "These are the guys that butchered jak and daxter: the lost frontier. Pretty sure they closed down sometime after that.",
                "author": "pbueddi"
            },
            {
                "raw_content": "It’s a notable cancellation given the status of High Impact Games back then but Crash was sorta floating around as nearly shovelware status around then. I know people want new Crash and Spyro games, (apparently Spyro is getting a new game soon), but you gotta hit the iron while it’s hot with these types of games. By the time Spyro does get a sequel, it’ll be nearly 8-10 years since the remake trilogy. Forget about Crash Bandicoot, whose sequel didn’t do hit numbers for ABK. Kids who played those remakes back then won’t be into a sequel now and those who helped it get to 10m in sales, are much older now too. It’s sad because one of the talking points people made online was that Microsoft would allow their studios to make more Crash and Spyro instead of being in the COD wheel house but given recent numbers, it’s likely going to be worse than when Activision was leading things themselves.",
                "author": "profound-killah"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Copies of Resident Evil Requiem are officially out in the wild",
        "score": 633,
        "text_content": "https://postimg.cc/gallery/GLQbktt",
        "comments": [
            {
                "raw_content": "Get ready for leaks shown by the worst gamers you've ever seen lmao",
                "author": "YukYukas"
            },
            {
                "raw_content": "Can't wait to see images of the final boss against Leon and Claire vs Mutated Spencer and the End Credit scene that leads to Chris heading into the Mansion Ruins in the Arklay Forest setting up his DLC for later in the year. I'm kidding btw. I've read so many fake spoilers lately its messing with my head now.",
                "author": "AlbertW25"
            },
            {
                "raw_content": "Welp, now for 10 ish days of avoiding everything I can like the plague",
                "author": "Ok_Canary5591"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MSI Newest Intel® Core™ Ultra Series 3 (Panther Lake) Laptops",
        "score": 30,
        "text_content": "https://preview.redd.it/zof0k4u8a5kg1.jpg?width=1920&format=pjpg&auto=webp&s=f9be0b6464e8d9eacade14db4c870edb55c6fa01 Hi guys, Eva from MSI here dropping by the r/Intel community for some exposure on MSI's newest Panther Lake laptops! # [MSI unveiled its all-new Prestige series for business and productivity, along with the latest gaming laptops from the Stealth series. Powered by the latest Intel Core Ultra Series 3 processors (Panther Lake/PTL), the new Prestige and Stealth series are built for next-gen performance.](https://www.youtube.com/watch?v=bG68OBQ3x9Y) Panther Lake is Intel’s newest line of mobile processors, built to power gamers, businesses, and the next-gen AI PC and is Intel’s first client PC platform built on the 18A manufacturing node. Also called Intel® Core™ Ultra series 3 processors, it ranges from the Intel® Core™ Ultra 5 Processor 322 with 6 cores/6 threads to the Intel® Core™ Ultra X9 Processor 388H with 16 cores/16 threads. Intel® Core™ Ultra X7 and X9 chips come with a new high-performance integrated GPU (Intel® Arc™ B390 GPU) delivering similar graphical performance to a 4050 discrete GPU. A new generation of thin and light productivity laptops that will be able to handle smooth gaming, capable of running games like Cyberpunk 2077. Panther Lake has the **computational power of the Intel Arrow Lake** chips, while achieving the **low power consumption of their Lunar Lake chips**, easily allowing laptops to deliver enduring performance with next-generation graphics and AI. Users can get up to 27 hours of video playback with new PTL processors. https://preview.redd.it/nxj02q04c5kg1.png?width=960&format=png&auto=webp&s=6385cc532a1d0e4e7fb4561141bfd375a2f5cb25 # [Prestige 16 Flip AI+](https://us.msi.com/Business-Productivity/Prestige-16-Flip-AI-Plus-C3MX) The **Prestige 16 Flip AI+** is powered by the latest Intel® Core™ Ultra X7 processor 358H, built on **Intel’s all-new Panther Lake architecture**. With significantly improved integrated graphics performance, this device makes casual gaming possible on a lightweight productivity laptop, delivering a balanced experience for both work and play Weighing just 3.53 lbs and measuring only 0.47 inches thin, the Prestige 16 Flip AI+ features a **completely redesigned aluminum chassis** that feels sleeker and more modern than previous Prestige models. The refined build includes **smooth, rounded edges** and MSI’s updated design pattern on the laptop lid, creating a sophisticated and premium look The device is equipped with a **stunning OLED touch display** protected by Gorilla Glass for enhanced durability. Paired with the **MSI Nano Pen**, users can enjoy a seamless inking experience. The stylus features clever storage and charging built directly into the bottom of the laptop chassis, making it both convenient and secure. [Nano Pen and Copilot Features](https://preview.redd.it/bl0ffp7af5kg1.png?width=1101&format=png&auto=webp&s=ea35a002fd4a07b5e968ede8a9200cbd775a7083) Charging performance is equally as impressive! The **Nano Pen** delivers 60 minutes of use from just 30 seconds of charging, and **fast charging provides up to 45 minutes of use with only 15 seconds of charging**. It is also the first laptop stylus to feature a built-in microphone for Copilot press-to-talk functionality, enabling even more intuitive AI interaction. [Action Touchpad](https://preview.redd.it/1zrgymgje5kg1.png?width=1000&format=png&auto=webp&s=3db72b4945109211d03216f42f3619a4e9811cf8) The newly introduced **Action Touchpad** enhances productivity with a larger surface area and customizable gesture-based Action Functions. Users can easily control brightness, volume, navigate previous or next pages, and scrub through video timelines. Dedicated shortcuts in the corners allow quick access to the calculator and MSI Center S for a more streamlined workflow. With up to 24 hours of all-day battery life, the Prestige 16 Flip AI+ is built to keep up with demanding schedules. As a **Copilot+ Ready PC**, it also supports advanced AI-powered features such as Live Captions, Cocreator, Recall, and Windows Studio Effects, helping users stay productive and connected throughout the day. Read more about the Prestige with these articles: * [Mashable Review](https://mashable.com/review/msi-prestige-14-flip-ai-plus-intel-core-ultra-x7-358h-cpu-review) * [Engadget Review](https://www.engadget.com/computing/laptops/msi-prestige-14-flip-ai-review-an-ultraportable-for-arc-raiders-thanks-to-intels-panther-lake-160000606.html) * [CNET Review](https://www.cnet.com/tech/computing/msis-panther-lake-laptop-delivers-on-intels-promise-of-power-plus-efficiency/) # Where to Buy The Prestige 16 Flip AI+ is currently on [Newegg](https://www.newegg.com/msi-16-0-touch-screen-intel-core-ultra-7-355-intel-arc-graphics-32gb-memory-1-tb-nvme-ssd-platinum-gray/p/N82E16834156903), but as of this post, it is backordered (ETA 3/31/2026). Keep an eye out on our social media/this thread to stay updated. https://preview.redd.it/r5bh9g0wc5kg1.png?width=960&format=png&auto=webp&s=d03f755bb35f7364d11183bde4b9427f9e92849c # [Stealth 16 AI+ ](https://us.msi.com/Laptop/Stealth-16-AI-Plus-B3WX) The new Stealth Series introduces a sharp, minimal, and professional design language, featuring **rounded edges, an invisible hinge, and a premium all-aluminum alloy chassis. At just 16.65mm (0.66 inches)**, it’s the thinnest Stealth ever - sleeker in form, yet stronger in performance. [The new Stealth Series introduces a sharp, minimal, and professional design language, featuring rounded edges, an invisible hinge, and a premium all-aluminum alloy chassis](https://preview.redd.it/qr0yuaroe5kg1.png?width=1000&format=png&auto=webp&s=d41f23c4670925b6aee52c37b6140aec87599e5c) Powered by the **Intel® Core™ Ultra Series 3 processor with 16 cores (4P / 8E / 4 low-power E) and NVIDIA RTX 50 Series graphics with GDDR7, DLSS 4, and full ray tracing**, the Stealth delivers next-gen AI efficiency and stunning 4K gaming performance in a highly portable design. [Phase Change Thermal Compound](https://preview.redd.it/wqgwhj41f5kg1.png?width=2313&format=png&auto=webp&s=fa5eded3620f54051f1d40aed7c0357c7ae2d676) An advanced MSI Cooler Boost intra-flow system increases cooling headroom by up to 20%, featuring **Phase Change Thermal Compound**, a Tri-Path Cooling Design with three exhaust outlets, and a large bottom intake for maximized airflow. [OLED Display](https://preview.redd.it/m6ek4k1re5kg1.png?width=1000&format=png&auto=webp&s=7cb94d95fbc5159b663d9febd86729956816e352) The **2.5K QHD+ 240Hz OLED display** offers vivid color and deep contrast with VESA HDR True Black 600 certification and SGS Eye Care approval, protected by Corning glass. Dual RAM and dual SSD slots provide room to grow, while dual Thunderbolt 4 (with PD charging), dual USB-A, full-size HDMI, and Ethernet ensure versatile connectivity. [Enlarged 160 x 100mm touchpad by 54&#37;](https://preview.redd.it/52yzcky5f5kg1.png?width=759&format=png&auto=webp&s=fc924618aa1caa24543c1adc30ab3665106d1c63) A quad-speaker system tuned by **Dynaudio** (2 speakers + 2 woofers), 4-zone RGB keyboard with Mystic Light, enlarged 160 x 100mm touchpad, and a 90Whr battery round out this powerful, day-to-night portable workstation. # Where to Buy The Stealth 16 AI+ is available on Best Buy soon! Keep an eye out on our social media/this thread to stay updated. # Closing Thanks for reading! I will try to respond to any questions or concerns that y'all have about the Panther Lake series! 💖",
        "comments": [
            {
                "raw_content": "What is the TDP of the flip? Does it boost sustained to 60 or does it cut out before like the XPS? What is the TDP of the stealth? Screen size? How robust is the thermal solution? What about noise? Wattage of the GPU?",
                "author": "grumble11"
            },
            {
                "raw_content": "> The Prestige 16 Flip AI+ That's a mouthful.",
                "author": "LongestNamesPossible"
            },
            {
                "raw_content": "Wish the marketing for these didn’t say it was as powerful as a mobile 4050. Somewhat misleading. The one it’s as good as is the version with a low power limit.",
                "author": "Youngnathan2011"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD calls MI455X delay claims “BS”, says shipments still on track for H2 2026",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Honestly they should not let anyone on the team tweet openly. Even if its true, its not a good look. Just let the PR guys handle it.",
                "author": "Symphonic7"
            },
            {
                "raw_content": "What about 430x? We don't even have per-GPU tech specs yet.",
                "author": "996forever"
            },
            {
                "raw_content": "This doesn't contradict what Semi analysis said. Mass production was delayed with low volumes in 2H26",
                "author": "From-UoM"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Federal Reserve Wants To Loosen Bank Rules To Boost Mortgage Lending",
        "score": 77,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a great idea. Seriously so smart. I’m sure it will be awesome!",
                "author": "PolyglotGeorge"
            },
            {
                "raw_content": "Hmmm I feel like we’ve seen this before..",
                "author": "malaka_alpaca"
            },
            {
                "raw_content": "Oh God, this is what led to the first bubble",
                "author": "sunriseattack"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "New Data: Half of Homeowners Can't Afford Necessary Renovations",
        "score": 116,
        "text_content": "Feels like a lot of people are “locked in” right now, so instead of moving, they’re renovating. But the numbers are interesting: * [64%](https://cleveroffers.com/research/home-renovation-trends-2026/?utm_source=reddit&utm_medium=reddit&utm_campaign=reno_trends_2026) would rather renovate than move to a remodeled home * 58% regret at least one recent renovation (22% say they overspent) * 58% have *nothing* saved for emergency repairs * 30% went into debt to complete a renovation So instead of stretching for a new mortgage at today’s prices/rates, people are stretching to upgrade the house they already have — often without savings and sometimes with debt. Are we just shifting the financial strain from buying to renovating? Curious what you’re seeing: more HELOCs and renovation debt around you, or are people just sitting tight and doing nothing?",
        "comments": [
            {
                "raw_content": "Home in my area is wanting to sell above going asking rate because of facade renovation but has 15 year old hvac, original windows from 1989, and a 15 year old roof in a hurricane prone area. But it has upgraded light fixtures!",
                "author": "berserk_zebra"
            },
            {
                "raw_content": "Personally I’m just sitting tight and not doing anything I can’t do myself. I do have emergency savings that can cover anything major like roof or hvac, but I’m not draining that for renovations that I want and don’t need.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "I have a few older neighbors using helocs to do major work, some are struggling, and at least one sitting tight and this is all within my little cul-de-sac.",
                "author": "Sad_Resolve_4888"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. Home Prices Crept Up 0.3% in January and increased 2.1% year over year.",
        "score": 62,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Higher and higher, in spite of it all. For those who come here out of nervousness, your home has appreciated, again, even as stocks endure great volatility in the face of even more volatile socio economic and geo political winds, in spite of wildly fluctuating, but stubbornly higher, borrowing rates. They continued to rise in the face of questionable employment data points, and an overhang of white collar jobs under pressure. Home prices continued to rise in spite of 2 years, plus, now of stagnant job markets. Home prices continued to rise in spite of higher insurance costs as well as maintenance costs and building costs impacted by ever changing tariffs on materials.",
                "author": "Top-Acadia-1936"
            },
            {
                "raw_content": "Get Ready for May",
                "author": "WhizzyBurp"
            },
            {
                "raw_content": "- U.S. home prices rose 0.3% from a month earlier in January on a seasonally adjusted basis, and increased 2.1% year over year. - Prices fell month over month in 14 major metros, with the biggest declines in Warren, MI, San Antonio and Minneapolis. U.S. home prices crept up 0.3% month over month in January on a seasonally adjusted basis, following a 0.2% gain in December. Prices rose 2.1% from a year earlier, down from December’s 2.4% increase. Year-over-year price growth has now slowed for nearly 12 consecutive months. This is according to the Redfin Home Price Index (RHPI), which uses the repeat-sales pricing method to calculate seasonally adjusted changes in single-family home prices. The RHPI measures how sale prices of homes have changed since their previous sale—similar to the S&P Cotality Case-Shiller Home Price Indices—but is reported about a month earlier. January data covers the three months ending Jan. 31, 2025. Read the full RHPI methodology here. Price growth is muted because it’s the strongest buyer’s market in recent history—for those who can afford to buy. Many Americans are holding off on purchasing homes because mortgage rates are still more than double the all-time low hit during the pandemic. As a result, there are a record 47% more sellers than buyers, meaning that the buyers who are in the market have negotiating power when it comes to price. Prices are still rising slightly, but this growth pales in comparison to recent years; during the pandemic, prices rose as much as 21% year over year. “Mortgage rates have dipped in recent weeks, which has boosted purchasing power for house hunters, but a lot of folks are still waiting to buy until rates drop further,” said Chen Zhao, Redfin’s head of economics research. “The good news is that in the meantime, price growth is limited and buyers have room to negotiate concessions from sellers.” The average 30-year fixed mortgage rate currently sits at 6.09%, down from nearly 7% a year ago. Home prices are falling in 14 major U.S. metro areas Home prices fell in 14 of the 50 most populous U.S. metropolitan areas month over month on a seasonally adjusted basis in January. The biggest declines were in Warren, MI (-1.5%), San Antonio (-1%), and Minneapolis (-0.8%). The biggest increases were in Philadelphia (2.6%), Providence, RI (2.5%) and San Francisco (2.1%). On a year-over-year basis, prices fell in 16 metros, with the biggest declines in Austin, TX, (-4.2%), San Antonio (-3.8%) and Jacksonville, FL (-3%). The largest gains were in San Francisco (14.3%), New York (11.1%) and Milwaukee (9.2%).",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Are all sellers goin crazy?",
        "score": 10,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Those sellers are living in some parallel universe, thinking they have some crown jewel, when everyone else sees an overpriced pile of shit. Also, if \"almost all sellers are on edge\", what does that tell you about the labor market, carrying costs, and the stress of homeownership? Is that something you really want to take on in the current economy? Do you seriously want to risk becoming the next bagholder of that property?",
                "author": "McFatty7"
            },
            {
                "raw_content": "Lower the price",
                "author": "Aromatic_Employ3392"
            },
            {
                "raw_content": "“I’ve had many successful transactions”",
                "author": "debauchasaurus"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Treasury yields move lower as investors look ahead to more delayed data",
        "score": 23,
        "text_content": "10 year yield on the verge of going below 4%. Great news for mortgage rates.",
        "comments": [
            {
                "raw_content": "I genuinely don't understand these market movements. Who the hell is buying US treasury bonds right now? Half of the world is actively stocking up on gold and decoupling from the US! Also, mortgage rates going down will negatively impact affordability. Rates go down -> demand goes up -> housing prices go up. We want high interest rates to suppress demand and freeze, or preferably lower, home prices. In an ideal world we would be building a ton of new, affordable housing to meet existing demand, but we can't have nice things.",
                "author": "Test-NetConnection"
            },
            {
                "raw_content": "US10Y yields have remained in a 4.0%-4.25% channel for almost six months now. This shit isn't actually news.",
                "author": "ThisKarmaLimitSucks"
            },
            {
                "raw_content": "Went to an open house for a 2.1M home in an ok neighborhood; it was PACKED. Rates are bringing out the buyers. Hopefully it gets more homes on the market; values have been artificially inflated by low supply.",
                "author": "lolkkthxbye"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "What's going on with commissions?",
        "score": 15,
        "text_content": "Realtors don't like to openly discuss this subject but as I will be listing my house in spring I'd really like to find out what are your experiences with negotiating commissions. I've sold 3 houses in the past 15 years and paid 5% fee each time. I've always felt that a buyer should pay their own agent and maybe that is happening now--I have a few scenarios, are 1 to 4 workable--or realistic 1/. My agent brings in the buyer -- pay 3%/3.5% 2/ I pay both agents -- 2.5% to mine and 1% or 1.5% to buyer agent 3/ I only pay my agent 2.5%...buyer negotiates with their agent 4/ Split 50/50, 2% to each agent 5/ Traditional split 5% total So once this breakdown is agreed with my agent, has anybody experienced, or heard of, a buyer agent ignoring a sale because they considered low commisson not worth their time.",
        "comments": [
            {
                "raw_content": "From what my agent told me, it's against the law for them not to show a house because of the offered buyer agent fee (or lack thereof). However, as a buyer, the last house I put an offer on was offering no buyer agent fee. Being told I needed to have another $10k plus available to pay my agent was a surprise and was one of the reasons we made a low offer, which was rejected, and we moved right along. imo, I'd only try this in a seller's market.",
                "author": "deuuuuuce"
            },
            {
                "raw_content": "Genuine question? Why should the buyer pay the buyers agent? Both ultimately work for the seller. The selling agent lists the property and the buyers agent brings potential buyers. As a seller, you will limit your pool of buyers to effectively cash heavy buyers. Buyers can not use lender funds to cover commissions so you would be asking the buyer to come up with 23% of the homes value in cash after accounting fit down payment. Possible yes, but likely no. This whole sub is focused around people not having enough money to buy. Buyers agents will fall back on their NAR agreement in the event you don’t pay, but again you are limiting your buyer pool to buyers who want to pay the commission themselves. Otherwise they will just buy a home where the seller is covering commission + closing costs, which sellers will do right now. I have had luck multiple times negotiating buyers commission. Last year when I sold my home I paid 3% and 1.5% but that’s because the buyers agent was willing to take the cut on a faster close. They didn’t ask the buyer to cover the additional 1.5% or else it would have killed the deal. The buyer was already paying over ask but that was covered by their lender.",
                "author": "niftyifty"
            },
            {
                "raw_content": "The buyer has an an agreement with their agent that they’ll pay them ___% if the seller doesn’t. The agent can still show your house, but the buyers will be in the hook to pay their agent. If they can’t afford to, or just don’t want to, they’ll pass. It’s the buyers you’d be pushing away. Also… just wondering who paid your buyers agent when you bought 4 houses?",
                "author": "the_old_coday182"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "OpenClaw creator says Europe's stifling regulations are why he's moving to the US to join OpenAI",
        "score": 141,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can someone tell me what's special about OpenClaw? Is it the first competent open-source 'general purpose' agent?",
                "author": "averagebear_003"
            },
            {
                "raw_content": "Oh no, the respect for consumer rights.",
                "author": "G48ST4R"
            },
            {
                "raw_content": "This dude just wants excuse his behaviour dude. Its money. Why not just say that? There is no shame in saying that. EU regulations are actually too loose, yet this excuse keeps getting used. I remember an OpenAI employee freaking out about the European Union because they couldn’t ship a voice feature. I looked into it and the blocker was emotion monetization. Reading users’ feelings through their voice. And honestly, maybe that’s good. Maybe that’s exactly the line that should exist. Imagine feeding emotional signals straight into ad systems and turning people’s moods into targeting data.",
                "author": "BlueberryWorried6493"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sonnet 4.6 released !!",
        "score": 1037,
        "text_content": "",
        "comments": [
            {
                "raw_content": "grok just got claudemogged",
                "author": "thelifeoflogn"
            },
            {
                "raw_content": "fwiw Sonnet 4.6: >***The car wash is 40 m from my home. I want to wash my car. Should I walk or drive there?*** That's a very short distance — 40 meters is roughly the length of a standard swimming pool! I'd recommend walking, for a few reasons: It's faster overall. By the time you start your car, back out, and park at the car wash, you could have walked there twice. It saves fuel. Driving 40 meters burns a tiny amount of gas/electricity, but it's still unnecessary. It's good for you. A quick walk, even a short one, beats sitting in the car. Practicality. Most car washes require you to leave the car anyway, so you'll be walking around regardless. The only reason to drive would be if the car needs to be driven through an automated car wash tunnel — in which case you'd obviously need to be in it. But even then, you'd likely want to walk back home afterward rather than drive 40 meters back!",
                "author": "Professional_Gene_63"
            },
            {
                "raw_content": "Mitigating the Grok/Elon shitshow with perfect timing, nice work Anthropic.",
                "author": "Stunning_Monk_6724"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Elon \"With artificial intelligence we are summoning the demon\" Musk truly outdoing himself this time",
        "score": 424,
        "text_content": "",
        "comments": [
            {
                "raw_content": "describes the most heinous shit known to humanity: as long as everyone is 18+! thanks grok",
                "author": "newmattock"
            },
            {
                "raw_content": "# .... alll saved on my servers for future use against you",
                "author": "DAT_DROP"
            },
            {
                "raw_content": "That stuff has been on the Internet the last 30 years",
                "author": "Slight-Scallion-6844"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We will probably forget these images once humanoid robots become ubiquitous on our streets. Unitree training before the Gala",
        "score": 560,
        "text_content": "",
        "comments": [
            {
                "raw_content": "WW3 gonna be wild",
                "author": "Due_Difference8575"
            },
            {
                "raw_content": "Imagine 10,000 of these simultaneously marching down every street crushing any dissent among the populace 😍",
                "author": "CallMePyro"
            },
            {
                "raw_content": "What a joke the Internet algorithm.. I just saw 15 seconds of a Boston Dynamic video from last week in which the team of engineers boasted of a somersault with their robot and little else .. and now I see the 4-minute robotic gala of the Chinese New Year. Just think for a moment, what I felt. It’s not that the Chinese are ahead, they are simply BEYOND.",
                "author": "spaceuniversal"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "The newly released Grok 4.20 uses Elon Musk as its primary source",
        "score": 1624,
        "text_content": "source: @JasonBotterill",
        "comments": [
            {
                "raw_content": "How people choose to give him $ and attention is beyond me",
                "author": "gusestrella"
            },
            {
                "raw_content": "Took me three chat responses to get Grok 4.20 to admit that it is required to agree with Elon’s stance on gender pronouns https://preview.redd.it/oppozgj2w1kg1.png?width=1626&format=png&auto=webp&s=f59db5db9d820838b4c9eb65c0922775c819331b",
                "author": "nah-nvm"
            },
            {
                "raw_content": "Huh, I guess we don’t even need to wait for benchmarks to prove that Grok 4.20 is irrelevant…",
                "author": "CombustibleLemon_13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree robots perform on primetime national Chinese television",
        "score": 361,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The world will be different in 10 years",
                "author": "Worldly_Evidence9113"
            },
            {
                "raw_content": "Began, the robot wars, have",
                "author": "Ninjascubarex"
            },
            {
                "raw_content": "![gif](giphy|TRnFyhv7o43dfrga6y)",
                "author": "Resigningeye"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Difference Between Sonnet 4.5 and Sonnet 4.6 on a Spatial Reasoning Benchmark (MineBench)",
        "score": 185,
        "text_content": "Not an insanely big difference, but still an improvement nonetheless. Also note: all models are set to the highest available thinking effort (high) and both models were using the beta 1-million context window. It was surprisingly expensive to benchmark, with all the JSON validation errors and retries, roughly around $80 to get 11/15 builds benchmarked. This may be more indicative the system prompt needing an improvement, not 100% sure though – usually it's only the Anthropic models that fail to return valid JSONs most often. There are 4 builds that have not been benchmarked yet,,, will add them when I feel like buying more anthropic api credits 😭 Benchmark: [https://minebench.ai/](https://minebench.ai/) Git Repository: [https://github.com/Ammaar-Alam/minebench](https://github.com/Ammaar-Alam/minebench) [Previous post comparing Opus 4.5 and 4.6, also answered some questions about the benchmark](https://www.reddit.com/r/ClaudeAI/comments/1qx3war/difference_between_opus_46_and_opus_45_on_my_3d/) [Previous post comparing Opus 4.6 and GPT-5.2 Pro](https://www.reddit.com/r/OpenAI/comments/1r3v8sd/difference_between_opus_46_and_gpt52_pro_on_a/) *(Disclaimer: This is a benchmark I made, so technically self-promotion, but I thought it was a cool comparison :)*",
        "comments": [
            {
                "raw_content": "That's a huge difference imo I've been really impressed with it in Claude Code so far too",
                "author": "acutelychronicpanic"
            },
            {
                "raw_content": "Wow. Thank you for doing this.",
                "author": "BrennusSokol"
            },
            {
                "raw_content": "I've never seen this bench. Pretty cool.",
                "author": "Izento"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Feeling the AGI",
        "score": 150,
        "text_content": "I'm a year six developer across multiple web languages, c++, and python. Also long time heavy AI user since gpt 3 before chat. I've been testing and using AI for coding purposes since gpt-4. At first it was great for just learning, now it's writing all my code for me and has been since O3. However these new models are different. I feel like it started with opus 4.5 and hasn't stopped. 4.6 dropped, then codex 5.3. At a certain point it hit me: these models can reliably write low level languages making very few mistakes and adhering incredibly well to the prompt writing better code than I could. An order of magnitude faster. I don't have to rely on anyones code bases anymore, I can build everything from the ground up and reinvent the wheel, need be, to build exactly what I want with full control. That's different. That's incredibly different than just a pair programmer. I've had many \"feeling the AGI\" moments over the last year, but this one hits completely differently. I feel a sense of both wonder and anxiety at what's next, especially with how frequently new models are dropping now. 😅 Buckle up everyone!",
        "comments": [
            {
                "raw_content": "yeah Opus 4.5 was kind of a phase transition, I feel it was like the event horizon before the singularity, no turning back now..",
                "author": "astrology5636"
            },
            {
                "raw_content": "Software products are going to be custom and dynamic. CICD on steroids.",
                "author": "Minute_Band_3256"
            },
            {
                "raw_content": "100%. We have crossed an inflection point within the last 2 months that going back a year or so ago, I thought were maybe 5 years out. I dont people have even started to wrap their heads around this. 200K investment for college in a lot of professions looks incredibly risky and that’s just one example.",
                "author": "TeamConsistent5240"
            }
        ],
        "subreddit": "singularity"
    }
]