[
    {
        "post_name": "“When you tell a socialist the truth, they cry, claiming it’s hate speech. No, it’s not hate speech. It’s that you’re useless people who have ruined the planet.” — Javier Milei",
        "score": 516,
        "text_content": "",
        "comments": [
            {
                "raw_content": "YOU CAN'T GIVE SHIT LEFTARDS AN INCH!",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "When a crooked and corrupt government of European people promises you free stuff, it’s generally a scam. In Europe there are 2 elements to the scam: ridiculously high taxes and using the free stuff as a magnet for an immigration invasion. UAE gives away free stuff to Arabs only based on oil profits. Government benefits can be done but they need to be restricted to natives and based off something other than taxation. They work with the concept that the nations oil belongs to the people and not an oil company.",
                "author": "ViagraFalls"
            },
            {
                "raw_content": "He needs to create a task force to eliminate commies from the gene pool.",
                "author": "BeauHD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump, you regulate interstate travel. Do not allow these states access to the interstate if they’re putting diesel filled missiles on the highway and aiming them straight through a family’s heart like this. Get Sean Duffy to fix this genocide of humanity NOW!!! ❤️",
        "score": 508,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sheesh. This is infuriating. This administration has to start making actual moves.",
                "author": "Spawnlingman"
            },
            {
                "raw_content": "They are committing a felony by licensing and employing these people. When someone dies as a result that should be a felony murder charge for every person involved in putting this third world retard in a semi truck.",
                "author": "CocaineShark"
            },
            {
                "raw_content": "This only starts to end when you find your balls take a flight down their and give the owner Texas Justice. It's only a problem when you hangem high for all to see for doing you and your family dirty knowing they are sending out illegals who dont pay for upkeep on their 16 wheelers because they eats in the profits they rather drive around on bald tires worn down brake pads like they do back in their 3rd world and if they mow you down whos gonna do anything? Americans are pussy these days and lawsuits dont mean shit when the illegal doesn't have a dollar to his name you can trace...",
                "author": "EvilGreed209"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "House to vote next week to require citizenship check and photo ID for voting, upping Senate pressure",
        "score": 432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hell yeah!",
                "author": "GodBlessColombia"
            },
            {
                "raw_content": "What's more likely: GOP is \"too busy\" to make this law or they want to lose the midterms?",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "But muh VOTER ID WACIST! WE WAZ KANGZ N SHIT!",
                "author": "BidenHatesFreedom"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Epstein's Fortnite account just found active in Israel, then made private upon discovery.",
        "score": 410,
        "text_content": "<p>Reddit <a rel=\"nofollow\" href=\"https://www.reddit.com/r/conspiracy/\" target=\"_blank\">r/conspiracy</a> sub user finds active fortnite account with same name as Epstein's youtube as per file dump - <strong>littlestjeff1</strong></p> <p>Israel geolocation on profile</p> <p>Account was active prior to arrest as per seasonal history, inactive during arrest/death, active again after death</p> <p>Account made private within 2 hours of post to try to hide activity described above, but is found and confirmed later in archives</p> <p>E-mail in Epstein file dump discusses purchase of v-bucks, confirming he did play fortnite ( <a rel=\"nofollow\" href=\"https://www.justice.gov/epstein/files/DataSet%2011/EFTA02286126.pdf\" target=\"_blank\">https://www.justice.gov/epstein/files/DataSet%2011/EFTA02286126.pdf</a> ) (fixed)</p> <p>He faked his death and immediately started playing fortnite. Fortnite Chapter 1, Season 10 ran from August 1, 2019, to October 13, 2019</p> <p>The profile that is now private is - <a rel=\"nofollow\" href=\"https://fortnitetracker.com/profile/all/littlestjeff1/seasons\" target=\"_blank\">https://fortnitetracker.com/profile/all/littlestjeff1/seasons</a></p> <p>I found this which can't be private</p> <p><a rel=\"nofollow\" href=\"https://fortnite.gg/wrapped?player=Littlestjeff1\" target=\"_blank\">https://fortnite.gg/wrapped?player=Littlestjeff1</a></p> <p>(The link is goofy but search Littlestjeff1 on the site if it doesn't work)</p> <p>Original post with PICTURES of account <a rel=\"nofollow\" href=\"https://www.reddit.com/r/conspiracy/comments/1qwukr0/epsteins_fortnite_account_active_in_israel/\" target=\"_blank\">https://www.reddit.com/r/conspiracy/comments/1qwukr0/epsteins_fortnite_account_active_in_israel/</a></p> <p>Tons of other screenshots and discussion happening here.</p> <p>He's alive boys and Israel (our greatest ally 😂) is hiding him.</p>",
        "comments": [
            {
                "raw_content": "Yup. He’s alive.",
                "author": "Mungo"
            },
            {
                "raw_content": "The HWNDU capture-the-flag operation was merely a training run, this one is the real deal. We have the best autists.",
                "author": "impera"
            },
            {
                "raw_content": "Good. Now lets hunt him down and hang him publicly. Add in Bill KFC Barr and any others in on it. Many knew he is alive. There's no way they get rid of an asset that connected.",
                "author": "Mulletgunning"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Report that National Security Director Tulsi Gabbard CONFIRMS they have evidence Electronic Voting Machines are rigging elections: “Voting machines contain evidence of voter fraud and manipulation according to several national security sources who briefed me on the issue.\"",
        "score": 949,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now…. Do something with it. Save America, please!!! Fuck optics or anything else.",
                "author": "-f-b-i-"
            },
            {
                "raw_content": "Less talk. More action.",
                "author": "Bearing51"
            },
            {
                "raw_content": "We have had CONFIRMED proof for over 5 years now! When do we ACT ON IT!?",
                "author": "patrioticwinning3"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nike, Accused of Bias Against White Workers, Is Under Federal Investigation",
        "score": 984,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just do it! Arrest someone.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "DEI is discrimination and racism at its very core.",
                "author": "RiolindasReturn"
            },
            {
                "raw_content": "The federal agency that safeguards hiring practices said on Wednesday that it was investigating Nike, the sportswear giant, for diversity efforts that it said amounted to discrimination against white workers. The Equal Employment Opportunity Commission, born of the Civil Rights Act, said it was investigating “systemic allegations of D.E.I.-related intentional race discrimination” against white employees and job applicants at Nike. It appears to be the first time that the commission has said diversity, equity and inclusion practices in workplaces can amount to discrimination against white people, and Nike is a high-profile target. The company has sponsorship partnerships with world-famous athletes including LeBron James and Caitlin Clark. It also drew criticism from President Trump during his first term for running advertisements featuring Colin Kaepernick, the football star who knelt during the national anthem to protest racism and police brutality. The move positions the E.E.O.C. at the vanguard of the Trump administration’s broad assault on D.E.I. practices. Mr. Trump won re-election in 2024 in part by harnessing backlash to such practices, and in office he has given voice to claims of “reverse racism” against white people.",
                "author": "laredditarmy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "America’s Elections are Rigged, Stolen, and a Laughingstock all over the World.",
        "score": 1405,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They won't listen to him. They know it means the end of their jobs.",
                "author": "Awakened"
            },
            {
                "raw_content": "The Democrats are becoming so brazen that I give it another couple of years before they openly brag about cheating.",
                "author": "Klown_Kutz"
            },
            {
                "raw_content": "Wasn't it the Indiana GOP who decided not to redistrict? They really screwed us good since California will be killing off five districts (including mine) *before* midterms. Losers keep losing for us.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE moving into WA? I keep seeing these posts in various WA state Facebook groups.",
        "score": 858,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I didn't realize ICE had its own vehicles. Hang on... OK wow. ICE does have its own vehicles and yes, they look like that: https://deepnewz.com/us-domestic-policy/dhs-unveils-ice-vehicles-bearing-defend-the-homeland-slogan-dd75673e",
                "author": "billybaldwin2"
            },
            {
                "raw_content": "God I've seen what you do for others and I want that for me. Go ice! WA. OR. CA. Take the coast back",
                "author": "DeportFixesEverythin"
            },
            {
                "raw_content": "Toss the illegals in to the vans like a FLYING FISH!",
                "author": "MAGAguitar"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Yup",
        "score": 1542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Epic burn 😂🔥🔥🔥🔥",
                "author": "YaharaRiver"
            },
            {
                "raw_content": "kek",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The Bee has more viewership.",
                "author": "everylastjuan"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Treasury Sec. Bessent says Iranian leadership is wiring money out like crazy ☎️💸⚡💰✅ (っ'-')╮=͟͟͞💰",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In on a pallet, out on a wire.",
                "author": "TDAF"
            },
            {
                "raw_content": "No more wars for jizzreal",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "No they are not. The is another attempt to sell \"the Iran leadership is failing and panicking...\" bullshit. Iran is not part of the SWIFT system - so no - they are not wiring money out like crazy. They use Russia's system - and no - our government and deep state are not privy to Russia's system - and therefore what the daily transactions are between Russia and Iran.",
                "author": "Wascally"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Prince George County spent $43,000 on a 3-night hotel stay during a snow storm to film THIS:",
        "score": 682,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ooga booga go back to Africa, and have a great... Well, you know the rest. ~ The Moon Man ~",
                "author": "CzechRepublic"
            },
            {
                "raw_content": "Dear Pedes: After watching this video. I got AIDS because of this video. If I don't make it please don't let my corpse start to vote democrat. And why always Blacks especially the ghetto kind always do these stupid dances. Can a pede help me why they always do it because I am leaning on It they are lazy and it the easiest thing that they can do.",
                "author": "DT170x"
            },
            {
                "raw_content": "Yall wypipo aint even season yo blizzard warnin's. Blizzards be huwite supremacisms and dey had 2 finna fight it wif dey black gurl magic.",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Deporting Illegal Aliens Isn’t Complicated. Don’t Let Democrats Complicate It",
        "score": 1086,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You came here illegally? You are to be deported. It does not get much simpler than that.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "We need like 10X the number of current deportations minimum!",
                "author": "RogueLeaderX"
            },
            {
                "raw_content": "will ICE raise the self-deportation stipend again? are illegals waiting for it to go from $2.6k to $6.9k?",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chuck Schumer balks when told 71% of Dems support national voter ID, claims its 'Jim Crow 2.0'",
        "score": 1218,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chuck's brain: I'm certain of it. Non whites are too dumb to get an lD.",
                "author": "Tim_Berframer"
            },
            {
                "raw_content": "chuck is on the epstein list. what did he do to those kids?",
                "author": "one_cool"
            },
            {
                "raw_content": "fuck jews",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "LIVE: President Trump Makes an Announcement from the White House - 02/05/26",
        "score": 811,
        "text_content": "",
        "comments": [
            {
                "raw_content": "SAVE Act or nothing. Fixing everything get easier after that.",
                "author": "ciaramella_is_gay"
            },
            {
                "raw_content": "It's about TrumpRx. Cheaper medicine. Great thing to talk about.",
                "author": "possibletower"
            },
            {
                "raw_content": "Liberal white women will continue paying high prices for their SSRI's simply out of spite",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "MS-13 and army of bums take over Maryland condos; officials target the owners for eviction -report",
        "score": 975,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is by design. Who do you think is going to buy up that property after the city takes it over by running out the current owners? They don't even care about the optics anymore they are so desperate to free up housing space for as many illegals as possible. I think they know they lost national power so they are trying to fort up in the states they still control. Good. This means that red states automatically get drained of illegals as they flee to the blue states that still welcome them. That's a YUGE help to ICE.",
                "author": "SquiggyMcPepe"
            },
            {
                "raw_content": "Red states need to start bussing homeless to that part of the country, specifically Delaware, Mass, Connecticut and Rhode Island. Flood those places with human filth and make them live with the consequences of their emotional decisions.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "86% Democrat, found the problem now I can go back to not caring. You get what you fucking deserve.",
                "author": "JimmyRussler"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well?",
        "score": 1298,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# SHE’S A FUCKEN MUD SHARK",
                "author": "AfrikaanerBoer"
            },
            {
                "raw_content": "We like to laugh, but take a look at what's happening in Canada with \"First Nations\" land-rights claims. This just may be a commie setup.",
                "author": "KangBang"
            },
            {
                "raw_content": "The amount of focus on things that don’t matter here is crazy m. She’s a random musician how about we spend time pushing congress to do their jobs.",
                "author": "WhatTheActualFuckS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Justice Jackson faces questions about impartiality after appearing at anti-ICE themed Grammys",
        "score": 1330,
        "text_content": "",
        "comments": [
            {
                "raw_content": "that baboon is nothing more than a communist plant/activist there for one specific reason, to destroy America, she's fucking illiterate",
                "author": "South_Florida_Guy"
            },
            {
                "raw_content": "She must recuse herself from all immigration case for the rest of her life.",
                "author": "Scatter-Shot"
            },
            {
                "raw_content": "\"Faces questions\" Meaning she isn't facing jack fucking shit.",
                "author": "booblitchutz"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "42-year-old \"relationship anarchist\" arrested after she allegedly rammed her vehicle into a federal agent's vehicle, according to the Star Tribune. Rose previously went viral for showing off her protesting outfit while her cat watched in the background.",
        "score": 888,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Rough looking for 42. Hatred ages a person.",
                "author": "Get_Off_Big_Tech"
            },
            {
                "raw_content": "Oh, yeah. Those Harbor Freight paint googles will do the job.",
                "author": "TEXinLA"
            },
            {
                "raw_content": "Imagine the smell",
                "author": "EDDIT_IS_CUCKED"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Our forefathers would be fucking pissed.",
        "score": 719,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the cherry on the sundae - the government pays for that shit by borrowing that money from the Chinese Communists, with interest, as well as printing new money which makes the money you worked so hard to save worthless! But, if it makes you feel any better, most of the money isn't actually spent on transgender animal experiments, it's stolen and used to finance commie faggot street protests and the election campaigns of retards like AOC and Maxine Waters.",
                "author": "edxzxz"
            },
            {
                "raw_content": "Source X Post https://x.com/GuntherEagleman/status/2019040257577296300 Grok context: >No, the claim in the post is not true. It misattributes historical NIH spending on animal research grants—totaling around $241 million over multiple years, primarily under previous administrations—to a new authorization by the GOP-led Congress in 2025. In reality, the Republican-controlled Congress in 2025 held oversight hearings to expose and criticize such expenditures as wasteful, attributing them to the Biden-Harris era, and even introduced bills to prohibit future funding for similar experiments. > >The $250 million figure appears to originate from reports by the White Coat Waste Project (a conservative-leaning watchdog group opposed to animal testing), which calculated cumulative NIH grants involving hormone therapies, surgeries, or other interventions on animals like mice, rats, and monkeys to study health effects related to gender-affirming care or sex hormones. These grants span decades, not a single 2025 authorization, and focus on medical research for conditions like HIV susceptibility, asthma, fertility, and cancer risks in humans—often using \"transgenic\" (genetically modified) models rather than literally \"transgender\" animals. President Trump highlighted smaller subsets of this spending (e.g., $8 million) in early 2025 speeches to criticize prior waste, but no evidence shows the GOP Congress approved new funds for it.",
                "author": "ListenJack"
            },
            {
                "raw_content": "What the fuck? America is done and a pointless further venture if these fucking pervert thief degenerates can't be stopped.",
                "author": "Diversity_Fire"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well he's 90 so guillotine away and watch the dust puff",
        "score": 592,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That is pretty good...🤣",
                "author": "airborne3502"
            },
            {
                "raw_content": "KEK",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "Woody Allen was born Allan Stewart Konigsberg on December 1, 1935, in the Bronx, New York, to an Ashkenazi Jewish family.",
                "author": "RationalThought"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Memory Prices Surge Up to 90% From Q4 2025",
        "score": 446,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Insane stuff, legitimately biggest threat / hinderance to personal computing I have seen in decades.",
                "author": "Zatoichi80"
            },
            {
                "raw_content": "Going back a year to February last year and the 32g of DDR5-6000 I bought for $99 is now $480 from the same retailer.",
                "author": "HookLeg"
            },
            {
                "raw_content": "Man and I thought I waited to long building my pc in October. Wow",
                "author": "None"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel Arc B390 Graphics Performance On Linux With Panther Lake",
        "score": 27,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a continuation of [the CPU-focused article from a couple of days ago](https://www.reddit.com/r/hardware/comments/1qv0bxv/intel_panther_lake_shows_strong_linux_cpu/), reviewing the integrated graphics now. Bit disappointing compared to Windows (down ~31% in Cyberpunk), but it is Intel after all - there had to be _some_ flaw. Hopefully drivers will improve over time.",
                "author": "the__storm"
            },
            {
                "raw_content": "Seems like Xe drivers are still horrible, but Panther Lake brute forces its way to a win.",
                "author": "steve09089"
            },
            {
                "raw_content": "> At first I was told between the balanced mode on Microsoft Windows and balanced mode on Linux there can be up to a 15 Watt difference in the PL1 state. Then I was told the power limits were the same under Windows and Linux for this laptop, but that MSI programmed their balanced defaults lower than Intel recommends. Intel expects their OEMs to have higher PL1 minimum values for balanced mode but MSI set it lower at 15 Watts min and 30 Watts max for at least this laptop model. Wait what, why did MSI set the power so low on the Prestige 14.... I really wanted the Prestige 16 Flip, hope that one has a higher power limit",
                "author": "LastChancellor"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Copper Price Surge - PC Hardware Gets Even More Expensive",
        "score": 109,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Thank fuck I already bought all the wiring I need for my house.",
                "author": "ClickClick_Boom"
            },
            {
                "raw_content": "The video points out that this might be caused by hoarding in the US--cleaning out global copper warehouses--in advance of new tariffs, so there's some hope it could stabilize. The longer term issue remains AI-driven loss of new PC builds, directly affecting the sales of PC component manufacturers like his own Thermal Grizzly.",
                "author": "TerriersAreAdorable"
            },
            {
                "raw_content": "PSU, cabling, heat pipes in your heatsink/radiator. There is a few oz of copper in the motherboard. \"2-oz copper\" PCB has 2 oz of cooper/square feet. At most, you would have 1/2 lb of copper in the PC. Copper is around $6/lb. Go do the math instead of meth. https://tradingeconomics.com/commodity/copper",
                "author": "Wait_for_BM"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Galaxy S26 Ultra benchmark leak: Snapdragon 8 Elite Gen 5 beats Apple A19 Pro by 6%",
        "score": 96,
        "text_content": "",
        "comments": [
            {
                "raw_content": "An 8 core cpu using more power beating a 6 core in multithreaded workloads? Damn that’s crazy.",
                "author": "Myrang3r"
            },
            {
                "raw_content": "\\*in GB6 multi-core FWIW, the 8 Elite for Galaxy (last gen) matched the A19 Pro (current gen), on an older node. Per Notebookcheck's own test data: |Phone|Release Year|GB6 nT| |:-|:-|:-| |iPhone 17 Pro (A19 Pro)|late 2025|10,097 points| |S25+ (8E for Galaxy)|early 2025|10,029 points| |S25 Ultra (8E for Galaxy)|early 2025|10,020 points| |iPhone 17 Pro Max (A19 Pro)|late 2025|10,017 points| [Qualcomm Snapdragon 8 Elite for Galaxy Processor - Benchmarks and Specs - NotebookCheck.net Tech](https://www.notebookcheck.net/Qualcomm-Snapdragon-8-Elite-for-Galaxy-Processor-Benchmarks-and-Specs.961308.0.html) [Apple A19 Pro Processor - Benchmarks and Specs - NotebookCheck.net Tech](https://www.notebookcheck.net/Apple-A19-Pro-Processor-Benchmarks-and-Specs.1126974.0.html) Of course, the 8 Elite needed a bit more power (I suspect the 8E for Galaxy even more), even as it has more cores: Geekerwan estimated [15.1W for the 8 Elite](https://youtu.be/Y9SwluJ9qPI?t=118), but [only 12W](https://youtu.be/Y9SwluJ9qPI?t=118) for the A19 Pro. On equal nodes, the 8 Elite Gen 5 has scored as high as **11,634** [per NBC](https://www.notebookcheck.net/Qualcomm-Snapdragon-8-Elite-Gen-5-Processor-Benchmarks-and-Specs.1123169.0.html); Geekerwan estimated its power draw [at 20W](https://youtu.be/YJaHi-gZESo?t=425), however. With Geekerwan's likely active cooling, their results are higher (now on the same node): D9500 / N3P: \\~18W for 10,716 points A19 Pro / N3P: \\~12W for 11,054 points 8EG5 / N3P: \\~20W for 12,352 points Yeah, I think Apple still has a dominant perf / W lead in multi-core and a marginal loss in total perf, even with fewer cores.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Ya but its not the whole story. It beats them in Multi-core, not Single-core where it counts, plus the A19 uses less power. Its still cool too see Snapdragon getting better, but its is not the same. Plus at like 20w on the 8EG5 imagine how quickly that will thermal throttle down. Can't wait to see a stress test between the two.",
                "author": "PersonSuitTV"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung to ramp up HBM4 DRAM output capacity by 70% to meet rising Nvidia, AMD demand",
        "score": 82,
        "text_content": "",
        "comments": [
            {
                "raw_content": "120,000 wafers per month is massive. Wonder if the AI boom will still be going on by the time this comes on line though.",
                "author": "Competitive_Towel811"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "System integrator claims that SSD and other parts prices are going up again",
        "score": 33,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Our Dell account rep told us that next week the prices on most of their stuff will be going up.",
                "author": "Roseking"
            },
            {
                "raw_content": "PC builders: *Haha! I'm in more danger!\"*",
                "author": "Hothacon"
            },
            {
                "raw_content": "Time to move onto a new hobby",
                "author": "HopelessPilot39"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "PC vendor warns of upcoming price hikes due to SSD and memory volatility — PowerGPU to pass costs to customers once existing inventory depletes",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello PaiDuck! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "BuildCores PC Part Hardware Survey Jan 2026 (similar to pc part picker but 3D)",
        "score": 14,
        "text_content": "Note: the data is skewed towards products that have 3D models since they appear on top of the product browser pages.",
        "comments": [
            {
                "raw_content": "5090 being twice more popular than 5060 shows how niche this survey is. I don't even know what kind of user group should this data be representative for",
                "author": "FitCress7497"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Bethesda confirms “Indiana Jones and the Great Circle” will be on a game card and not a game key card",
        "score": 2340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Having Fallout 4 and Oblivion Remastered as codes but Indiana Jones as a physical cart is strange",
                "author": "No_Humor506"
            },
            {
                "raw_content": "Indiana Jones fans are feasting. First they get one of the best action adventure games this generation, and then they get the full port physical release on Switch 2, it’s the best possible scenario for them. So happy for them.",
                "author": "natayaway"
            },
            {
                "raw_content": "Very rare for Microsoft, they are going away from physical media.",
                "author": "twovles31"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Can't believe FF7 Remake looks this good on the Switch 2",
        "score": 507,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And we just got Rebirth announced today!",
                "author": "gothamz77"
            },
            {
                "raw_content": "And rebirth looked just as good!!! My copy of FF7 Remake comes tomorrow exited to play it",
                "author": "davis609"
            },
            {
                "raw_content": "Yes. This subreddit has covered this probably over 100 times or more at this point 😅",
                "author": "Ottawa_gamer"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It's really funny how nintendo had to show poor gameplay of requiem to keep their show PG.",
        "score": 727,
        "text_content": "Like they couldn't show Leon attacking anything or else the direct would be marked as T for teen or whatever. It's pretty hilarious when you realize it.",
        "comments": [
            {
                "raw_content": "I was wondering why he kept missing, lol. Makes sense now.",
                "author": "GodzillaMinus83"
            },
            {
                "raw_content": "is that the reason? lol i was like why this this guy so bad",
                "author": "PhaseSlow1913"
            },
            {
                "raw_content": "Places like Japan and Germany are quite strict on blood and gore, so it's easier, and funnier, to just do it this way.",
                "author": "Redred1717"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "being real here, that was the most nothing direct i've seen in a while",
        "score": 1754,
        "text_content": "probably 2nd or 3rd worst to the 8 minute one back in 2020",
        "comments": [
            {
                "raw_content": "I’m happy for FF7 rebirth coming soon that’s about it. But what happened to Elden Ring ?",
                "author": "davis609"
            },
            {
                "raw_content": "Definitely felt like stuff they just had to get out of the way.",
                "author": "InternationalCream30"
            },
            {
                "raw_content": "Turok was the most out of nowhere epic announcement I didn’t know this game was coming 😂 looks kinda cool",
                "author": "Aeonyyx"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I didnt really notice significant frame drops in the demo",
        "score": 154,
        "text_content": "Im sure there are some but unless you are obsessed with frame data videos i don't think most people will notice. Bonus: Diana draws different art based on how long you take to beat the demo. Anyone know how many there are? Ive seen 3",
        "comments": [
            {
                "raw_content": "Yeah I realized a long time ago that I’m bad at judging frame rate. I thought this was super smooth and then I saw a frame rate test video and was just ohhh I guess it’s not super smooth. Played it again and still didn’t notice the drops haha.",
                "author": "PumasUNAM7"
            },
            {
                "raw_content": "Frames weren’t that big of an issue to me but the in and out blurriness was a big detractor.",
                "author": "23_Pepper_PhD"
            },
            {
                "raw_content": "The problem is what people think of as significant is so broad. I know people that will be content with a game that chugs under 20fps as long as they are having fun. I also know people that will seethe if a game drops below 120fps. No one is ever going to change their mind either 🤷. I personally am fine with the compromises in both docked and handheld, but would never try to convince someone that isn't happy that it's fine. Just not worth the effort",
                "author": "Redred1717"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Rebirth Releases June 3, 2026",
        "score": 1113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, way earlier than expected. Building quickly from FF7: Remake.",
                "author": "ollielite"
            },
            {
                "raw_content": "Holy crap thats so soon. Part 3 really might be early 27",
                "author": "Urd-ong_Shadong47"
            },
            {
                "raw_content": "Dang....I was not expecting this so soon after the first game....but I'm not complaining one bit.",
                "author": "Thegoodgamer32"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy 7 Rebirth is $50 and 102GB",
        "score": 767,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cheaper than fallout 4 is crazy",
                "author": "infinitejester88"
            },
            {
                "raw_content": "Starting to regret cheaping out and getting a 256gb sd card lol",
                "author": "CSBreak"
            },
            {
                "raw_content": "102 gb 😭 I know it’s expected, but fuck me running still.",
                "author": "Fantastic_Bug1028"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Most of this Partner Direct",
        "score": 782,
        "text_content": "",
        "comments": [
            {
                "raw_content": "My favorite anime: Indiana Jones.",
                "author": "DiamondEater13"
            },
            {
                "raw_content": "The 80s anime co-op space game was easily the highlight for me.",
                "author": "ProShyGuy"
            },
            {
                "raw_content": "When the Japanese company has Japanese style products",
                "author": "SABBATAGE29"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "[MEGATHREAD] Nintendo Direct: Partner Showcase 2.5.2026",
        "score": 208,
        "text_content": "[Howdy Partner](https://i.kym-cdn.com/photos/images/newsfeed/000/636/500/b31.jpg) |Nintendo Direct| |:-| |**Date/Time:** February 5, 2026, 6AM P.T. ([See in your timezone](https://dateful.com/eventlink/8352341248))| |**Where to Watch:** [Nintendo YT](https://www.youtube.com/watch?v=BJ5lNP7cJHA)| |[What to Expect](https://xcancel.com/NintendoAmerica/status/2019048301518115090?ref_src=twsrc%5Egoogle%7Ctwcamp%5Eserp%7Ctwgr%5Etweet)|",
        "comments": [
            {
                "raw_content": "Extremely dramatic, self-serious tone: \"Your monster allies, called *monsties*...\"",
                "author": "AfraidoftheLark"
            },
            {
                "raw_content": "Not them missing every shot and playing like absolute shit on purpose to avoid blood / gore for a family friendly direct lmao",
                "author": "Sirca_Curvive"
            },
            {
                "raw_content": "The control-sharing multiplayer design for Tokyo Scramble is straight up a psychotic feature to ship lmao",
                "author": "KevinT_XY"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New HLX (HL3) mentions in Deadlock new update datamine.",
        "score": 405,
        "text_content": "https://xcancel.com/gabefollower/status/2019536782279557428 Is this the worst kept secret?",
        "comments": [
            {
                "raw_content": "I’m afraid to check the half life sub now",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "It's probably the worst kept secret today, yes. I'm still gonna be hyped when it gets announced, but at this point it's like. Fuck man just announce it already, I've been reading leaks for two years and already waited well over a decade to get here.",
                "author": "ToothlessFTW"
            },
            {
                "raw_content": "![gif](giphy|QBd2kLB5qDmysEXre9)",
                "author": "Connect_Base_217"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Two more trademarks have been published for February 17th by Nintendo. Those being Mario & Wario, and the upcoming Rhythm Heaven Groove",
        "score": 110,
        "text_content": "https://xcancel.com/mikeodysseyyt/status/2019607091695235373?s=46 Figured I’d share this here. I definitely don’t think it means much, but I do think it’s odd this is the third time they’ve published a trademark for February 17th, and two of the 3 games they’ve put out trademarks for are seemingly coming this year.",
        "comments": [
            {
                "raw_content": "Mario coming to Nintendo? Hopefully",
                "author": "Jammyyyyyyyyyyyyy"
            },
            {
                "raw_content": "Mario & Wario sounds like it could be a Mario & Luigi type game that swaps Luigi with Wario and I'm going to be mad when that ends up not being what it is",
                "author": "Totheendofsin"
            },
            {
                "raw_content": ">I do think it’s odd this is the third time they’ve published a trademark for February 17th, It's not odd, at all. It just means they were likely reviewed by an examiner at the same time--this is normal USPTO behaviour. Publication date means that the USPTO has accepted a filed trademark and it will soon be published, which will be immediately followed by a 30-day opposition period. During the opposition period, other trademark holders are entitled to file a complaint on the grounds that the trademark in question infringes on their rights. Consequently, the publication date of a trademark **does not** mean 'this product needs to be revealed by \\[date\\]'. If the games *were* shown on this date, that's just a weird coincidence, as a 'publication date' is just a milestone towards the formal registration of a trademark and has no bearing on the marketing of a product, lol.",
                "author": "taychoo"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "\"Nintendo Switch 2: Wii Remote\" website appears for Nintendo Support",
        "score": 289,
        "text_content": "Edit: don’t get your hopes up, this is 99% a glitch, almost certainly a whole lotta nothing [https://en-americas-support.nintendo.com/app/topics/detail/p/1095/c/113](https://en-americas-support.nintendo.com/app/topics/detail/p/1095/c/113) Someone in a server I'm in discovered a Nintendo Support website for \"Nintendo Switch 2: Wii Remote.\" This could likely mean Wii games could be added to the Nintendo Classics lineup in the future. Edit: [https://en-americas-support.nintendo.com/app/topics/detail/p/605/c/113](https://en-americas-support.nintendo.com/app/topics/detail/p/605/c/113) [https://en-americas-support.nintendo.com/app/topics/detail/p/1094/c/111](https://en-americas-support.nintendo.com/app/topics/detail/p/1094/c/111) Nintendo's support website seems to be freaking out, mislabeling a few articles. This is likely another case of that happening.",
        "comments": [
            {
                "raw_content": "!debunked considering other Nintendo Support articles are being labeled strangely, this is likely another case of that",
                "author": "sad__toad"
            },
            {
                "raw_content": "Would be cool for Wii games to be on NSO :,).",
                "author": "hushpolocaps69"
            },
            {
                "raw_content": "I think a Wii NSO app is inevitable, even if it’s not soon",
                "author": "Evanpik64"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "NateTheHate on RDR2 next-gen: “As far as I know, its this year”",
        "score": 693,
        "text_content": "https://xcancel.com/NateTheHate2/status/2019452498805752008",
        "comments": [
            {
                "raw_content": "#NateTheHate is a Tier 1 - Very Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "I swear this has been talked about coming out for like 3 years",
                "author": "EngineeringReal2563"
            },
            {
                "raw_content": "We’re now 6 years into “next gen”",
                "author": "ShadyWolf"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Origami: Ubisoft has cancelled Project League, a multiplayer Assassin’s Creed game developed by Ubisoft Annecy",
        "score": 297,
        "text_content": "[source](https://www.origami.ng/ubisoft-vantage-cancel-league-assassins-creed-multiplayer/) According to Origami, Ubisoft recently cancelled a multiplayer AC game internally named \"Project League\". It was a 4-player co-op game with the same setting as AC Shadows, since it originally started as a DLC for Shadows.",
        "comments": [
            {
                "raw_content": "at this point idk what won’t be cancelled",
                "author": "Swimming-Discount-41"
            },
            {
                "raw_content": ">\\> cancel the 4 player AC Shadows co-op spinoff >\\> continue development on the fall guys AC clone that all the developers say sucks shit Yves Guillemot Century of Humiliation",
                "author": "MrEpicFerret"
            },
            {
                "raw_content": "The amount of cancelled live service games in the industry would make you think companies have learned their lessons but looks like that’s never the case",
                "author": "Loose_Society9485"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tom Henderson/Insider Gaming: Ubisoft’s Internal Town Hall Meeting Fails to Reassure Employees on Its Future",
        "score": 419,
        "text_content": "Ubisoft held an internal Town Hall Q&A meeting with employees yesterday to instill confidence in the company’s upcoming changes, but, according to over a dozen employees who spoke to Insider Gaming anonymously, it appears to have had the opposite effect. The Town Hall featured a host to read out the questions, along with Ubisoft CEO Yves Guillemot, Executive Vice President Cécile Russeil, Chief People Officer Sébastien Froidefond, CFO Frederik Duguet, and Chief Studios & Portfolio Officer Marie-Sophie de Waubert, in a roundtable format. According to those who spoke to Insider Gaming, employees described the Town Hall as an expert class in avoiding questions, with executives repeatedly sidestepping or recycling earlier statements. The host said that more than 300 questions were submitted for the Q&A, with sources noting that some had 700-800 upvotes, 3-4 times the number from past Q&A calls. When asked why they thought this was, many said it was due to the frustration, anger, and betrayal employees felt from the current announcements. Insider Gaming was sent a recording of the Town Hall under the condition that it would not be made public. **Full Story:** [https://insider-gaming.com/ubisofts-internal-town-hall-fails-to-reassure-employees-on-its-future/](https://insider-gaming.com/ubisofts-internal-town-hall-fails-to-reassure-employees-on-its-future/)",
        "comments": [
            {
                "raw_content": "#Insider-Gaming is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "*\"We've listened to your concerns and we've decided that nothing will change\"* - Yyes Guilmont",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "I think there are planks of wood that could've given more confidence to the employees of Ubisoft than Yves Guillemot. At least wood can fucking support something, such as your failing business ***Yves.***",
                "author": "SoldierDelta46"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The Verge: Xbox plans for 2026 (Halo, Gears, Kiln, etc.)",
        "score": 447,
        "text_content": "[https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad](https://www.theverge.com/tech/874303/microsoft-xbox-roadmap-2026-notepad) Highlights from Wario64: [https://bsky.app/profile/wario64.bsky.social/post/3me4uroa5es2p](https://bsky.app/profile/wario64.bsky.social/post/3me4uroa5es2p) \\- Halo: Campaign Evolved tentatively targeting Summer 2026 \\- Gears of War: E-Day in 2nd half 2026. Fable is Fall 2026. \\- Kiln in April \\- Fallout 3 remaster in active development \\- New Starfield content soon \\- Xbox Elite Controller Series 3 debut in 2026 \\- Automatic Super Resolution (Auto SR) and highlight reel feature that uses AI models to automatically capture gameplay coming to Xbox Ally devices. \\- New Xbox controller this year (with Wi-Fi to reduce cloud latency)",
        "comments": [
            {
                "raw_content": "Need to see that Starfield update",
                "author": "KushSouffle"
            },
            {
                "raw_content": "Dude where the fuck is state of decay 3 its been like 5 or 6 years",
                "author": "dailydabber024"
            },
            {
                "raw_content": "Fable was slated for Autumn already, but interesting Halo is for summer hopefully",
                "author": "KingMan753"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Indiana jones, Fallout 4 and Oblivion Remastered coming to Nintendo Switch 2",
        "score": 408,
        "text_content": "Confirmed: https://www.youtube.com/watch?v=iXtETV759ro&pp=0gcJCZEKAYcqIYzv Previous Rumor: https://www.reddit.com/r/GamingLeaksAndRumours/comments/1qwi4d8/dealabs_switch_2_boxed_versions_of_fallout_4/",
        "comments": [
            {
                "raw_content": "Interesting that the leaked date for fallout 4 was wrong but Indiana jones was correct Edit: Nintendo says the “physical” version of Fallout 4 releases in April",
                "author": "clownbaby4_"
            },
            {
                "raw_content": "Very curious how Oblivion Remastered will run... this not even runs very well on my 3070",
                "author": "riap0526"
            },
            {
                "raw_content": "According to the announcer, \"rocks and sweetrolls\" are back. He sounded deeply awed. Big news. I think.",
                "author": "AfraidoftheLark"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Layoffs hit their worst January levels since 2009, Challenger says",
        "score": 643,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a Depression level job market but with added high cost of living. Absolutely nuts.",
                "author": "None"
            },
            {
                "raw_content": ">U.S. employers announced 108,435 layoffs for the month, up 118% from the same period a year ago and 205% from December 2025. The total marked the highest for any January since 2009. >At the same time, companies announced just 5,306 new hires, also the lowest January since 2009, which is when Challenger, Gray & Christmas began tracking such data.",
                "author": "sifl1202"
            },
            {
                "raw_content": "But, guys, AI's gonna be great for everyone! It lets companies operate way leaner and more efficiently - wait why are sales dropping? What do you mean thanks to the roll out of AI Agents customer service scores have plummeted? The AI Agent told the customer they were getting a credit when that's not even policy?!? What do you mean that unemployment has reached a point where there's literally no one left to actually purchase our products?",
                "author": "Alexandratta"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Austin, TX—Once Among the Nation’s Hottest Housing Markets—Is Now the Slowest",
        "score": 121,
        "text_content": "* Austin is now the slowest major housing market in the U.S., with homes taking 106 days to go under contract, its slowest December since 2012. * The slowdown stems from pandemic-era price overheating and a homebuilding boom, leaving 128% more sellers than buyers. * Buyers now have significant leverage, routinely making below‑list offers that sellers are often accepting. * Austin’s median sale price fell 4.2% year-over-year, one of the steepest drops among large metros, and many sellers are taking losses. * Despite buyer-friendly conditions, many renters are waiting for mortgage rates to fall, as ownership costs remain far higher than renting. Lmfao, and they just had to throw in the interest rate strawman. Everyone knows it's the **home prices that have to go down**, but the industry can't accept the truth. Only sweet comforting lies.",
        "comments": [
            {
                "raw_content": "Ok... but this seems to be the big take-away, \"*Redfin reports unsustainable price growth in recent years along with a homebuilding boom have left Austin with more sellers than buyers. That means the buyers who are in the market can take their time and negotiate.*\" Isn't this what everyone wants? I'm not trying to be antagonistic... but this seems to be like the ideal scenario. Austin saw a problem, the market stepped in and built a ton of new homes, and prices have gone down. Seems like people should be happy.",
                "author": "73VW-Todd"
            },
            {
                "raw_content": "A lot of Austin area homebuyers work in the tech industries that have seen lots of layoffs and declining stock/crypto prices. The Ai bubble eventually bursting will hurt Austin home prices even more in my opinion.",
                "author": "socialtrends93"
            },
            {
                "raw_content": "I hate these headlines. Alternative: \"Cool prosperous city is surprisingly affordable\"",
                "author": "TeacherFrequent"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "2025 House Price Index Seasonally Adjusted - Real Growth",
        "score": 25,
        "text_content": "The 2026 dot assumes 3% CPI and 0.1% growth so far in Jan 2026. A 12% drop (real) is required to get back to long term average by end of 2026. OR if the nominal price stays flat in 2026, '27, and '28 with a 3% CPI we will return to the long term average price line. The other thing of note is that the mean real return since 1970 is 1.15%. [https://go.princetonasset.com/portfolio/be50eba7-7bc0-49bd-8ac4-2becbd5d0038](https://go.princetonasset.com/portfolio/be50eba7-7bc0-49bd-8ac4-2becbd5d0038)",
        "comments": [
            {
                "raw_content": "Timmmbbbbeeerrrr",
                "author": "Beginning_Abrocoma86"
            },
            {
                "raw_content": "so you are saying housing in 1971 and 2004-2005 was more expensive than now? Tell it to gen-Z!",
                "author": "OGS_7619"
            },
            {
                "raw_content": "so based on the cycles, it nearly always oscillates down to the lower end after a higher end touch and looks like its just getting started. So, if its 12% real drop to nominal, its probably 2x that to the lower. So probably 12% drop of actual prices to translate into a 24% real drop.",
                "author": "mlody11"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "2026 Housing Market Mood: Buyers Are Cautious, Sellers Are Showing Up, and Agents See Signs of Busier Spring Ahead",
        "score": 44,
        "text_content": "",
        "comments": [
            {
                "raw_content": "More hopium. They really have no choice at this time but to *will into existence*, good vibes. So, we get pieces like this.",
                "author": "Nuvuser2025"
            },
            {
                "raw_content": "lol of course sellers are",
                "author": "gthroway3483"
            },
            {
                "raw_content": "Hahaha, real estate websites are purposely living under a rock (and hoping you are as well), pretending as if they didn’t see the same layoff headlines we all saw. Layoffs hit a new high, so that somehow translates into buyers planning to buy homes? 🤡 What all these real estate websites intentionally fail to mention, is who is going to buy the home from you after **you** buy the home? If there are no future buyers for your home, you’re stuck with that home for life. #Bagholder",
                "author": "McFatty7"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "SG New Launched Ghaziabad – A Dedicated Platform for Tracking New Property Launches",
        "score": 1,
        "text_content": "https://preview.redd.it/m3zj6gpu7uhg1.jpg?width=1920&format=pjpg&auto=webp&s=c23c0be7a1d80374677ba6240cf8fce1ce891e3a Found a platform called [SG New Launched Ghaziabad](https://newlaunch247.com/sg-new-launch-ghaziabad/) that tracks **newly launched projects across Ghaziabad NCR**. Sharing it here to start a discussion—what areas or upcoming launches are you personally watching in Ghaziabad? Explore More - [https://newlaunch247.com/sg-new-launch-ghaziabad/](https://newlaunch247.com/sg-new-launch-ghaziabad/)",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "GPT-5.3-Codex was used to create itself",
        "score": 324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I hope everyone remembers how good a mid level manager I was before the machines came.",
                "author": "Sea_Raccoon_5365"
            },
            {
                "raw_content": "I'm not ready to be homeless :/",
                "author": "spnoraci"
            },
            {
                "raw_content": "So it begins. They are going to keep their word on AI research interns by September this year.",
                "author": "Maleficent_Care_7044"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Opus 4.6 is out",
        "score": 723,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mine says 4.6 is for \"ambitious work\", which is unfortunate because my work is fairly mundane.",
                "author": "NewConfusion9480"
            },
            {
                "raw_content": "Sama going live in 2 hours to drop a major Codex update forced Anthropic's hand I see.",
                "author": "thatguyisme87"
            },
            {
                "raw_content": "68.8% on ARC-AGI 2 is crazy. [https://www.anthropic.com/news/claude-opus-4-6](https://www.anthropic.com/news/claude-opus-4-6)",
                "author": "SerdarCS"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Anthropic releases Claude Opus 4.6 model, same pricing as 4.5",
        "score": 646,
        "text_content": "Most capable for Ambitious work, **Source:** Anthropic [Full Blog](https://www.anthropic.com/news/claude-opus-4-6)",
        "comments": [
            {
                "raw_content": "that arc agi 2 score is insanity. gonna be saturated in months",
                "author": "ShreckAndDonkey123"
            },
            {
                "raw_content": "Dang no progress in swe bench",
                "author": "mrdsol16"
            },
            {
                "raw_content": "Opus has more of an all round feel with this update it seems. ARC-AGI score is nuts",
                "author": "MC897"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI released GPT 5.3 Codex",
        "score": 542,
        "text_content": "",
        "comments": [
            {
                "raw_content": "**Benchmarks** https://preview.redd.it/vkx6mbvkvphg1.png?width=1080&format=png&auto=webp&s=8df201ebde3aef3e9fb33bbc6e9d108c84de7b93",
                "author": "BuildwithVignesh"
            },
            {
                "raw_content": "literally minutes away apart from opus 4.6 lol on paper the improvements of 5.3 look a lot better than the improvements of 4.6 but 4.6 has a 1m context window (api only) which is pretty significant",
                "author": "dot90zoom"
            },
            {
                "raw_content": "> GPT‑5.3‑Codex is our first model that was instrumental in creating itself. The Codex team used early versions to debug its own training, manage its own deployment, and diagnose test results and evaluations—our team was blown away by how much Codex was able to accelerate its own development. Interesting.",
                "author": "3ntrope"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "C'mon...",
        "score": 340,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Genie 3 *just* dropped but it feels like nothing because they demo'd it 6 months ago and only made it available to the $250/mo plan, with no pay as you go API option otherwise, so they've excluded every single ordinary person unfortunately. I can kinda understand why, I can't imagine the server load of dropping something like Genie publicly, but I'm still salty about it.",
                "author": "Gubzs"
            },
            {
                "raw_content": "They'll perform RL magic on 3 Pro, similar to what they did to 3 Flash.",
                "author": "RedOneMonster"
            },
            {
                "raw_content": "It’s hilarious the speed of progress expected from companies these days in this space. Man, if these multimodal LLM-based models really do plateau at some point, this sub is going to riot",
                "author": "i-love-small-tits-47"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Will AI make jobs disappear? Francois Chollet's take",
        "score": 80,
        "text_content": "[https://x.com/fchollet/status/2019571942148472899](https://x.com/fchollet/status/2019571942148472899)",
        "comments": [
            {
                "raw_content": "My friend is a professional translator, and they have been for almost two decades. Still employed as an AI proof reader, but they now earn a third of their previous salary. Their freelance work also fell off a cliff.",
                "author": "Calm-Limit-37"
            },
            {
                "raw_content": "Summary of people experience based on r/TranslationStudies Lower Pay: You have to work 3x harder to make the same money. Lower Quality: You are forced to approve \"okay\" work instead of \"great\" work. Entry Barrier: New, young translators can't find work because AI has taken the \"easy\" jobs they used to use for training.",
                "author": "DesignerTruth9054"
            },
            {
                "raw_content": "I don’t see there bring more swe jobs. Just like I don’t see there being more translator jobs",
                "author": "Inevitable_Tea_5841"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "We tasked Opus 4.6 using agent teams to build a C compiler. Then we (mostly) walked away. Two weeks later, it worked on the Linux kernel.",
        "score": 318,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> Over nearly 2,000 Claude Code sessions and $20,000 in API costs I find it hard to assess currently in the era of scaling up agents and reasoning, but does anyone have a good handle on how per-token efficiency developed in the recent year? For example, if progress mostly came from throwing more tokens at a problem, that would obviously still be good, but we'd likely run into massive inference bottlenecks soon. I guess to half-way answer my own question, at least the [Codex 5.3 release notes](https://openai.com/index/introducing-gpt-5-3-codex/) seemed to note that it achieved equal performance to earlier models on SWE-bench at half the token count, which seems good. Will be very interesting to see if this will cost a magnitude less or so in a year.",
                "author": "Fusifufu"
            },
            {
                "raw_content": "I like it. It seems honest, and at least for someone who has even a sense of what a compiler does can see what the limitations are, what the successes are, and what are the unique challenges of getting agenic models to do these long, complex tasks.",
                "author": "vhu9644"
            },
            {
                "raw_content": "> Most of my effort went into designing the environment around Claude—the tests, the environment, the feedback—so that it could orient itself without me. > > ... > > Claude will work autonomously to solve whatever problem I give it. So it’s important that the task verifier is nearly perfect, otherwise Claude will solve the wrong problem. Improving the testing harness required finding high-quality compiler test suites, writing verifiers and build scripts for open-source software packages, and watching for mistakes Claude was making, then designing new tests as I identified those failure modes. This is critically important, and something that most other real world projects won't have ahead of time. Something like a high quality test suite just won't exist for most projects. In the real world you might not even know what to test for, because designing the program will be an iterative process requiring testing and feedback as you go. The waterfall model where you know ahead of time not only what the end result should be but also what to test for and how to test it is the only way long-running mostly autonomous agentic programming like this is going to work, and that's only going to be achievable for a relatively small percentage of projects.",
                "author": "trimorphic"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Letting Genie 3 Out Of Its Bottle",
        "score": 225,
        "text_content": "This video is a cut together compilation of my first day so far with genie 3! It seems so far to be an incredible tool. Of course in its infancy but I always think to myself this is the worst this will be. Once they add more intractability it will be truly wild, at the moment it’s kind of a crapshoot you can include elements in your prompt to trigger or activate but it’s always like a 50/50 as to whether what you put in will work or not. I hope you enjoy! If you do be sure to leave a prompt suggestion for it, I would love to try any and all ideas.",
        "comments": [
            {
                "raw_content": "i just realized that the future of youtube will be you doing the thing inside of the youtube video instead of watching passively",
                "author": "oneblackfly"
            },
            {
                "raw_content": "Mind blowing",
                "author": "Altruistic-Skill8667"
            },
            {
                "raw_content": "Incredible, impressive",
                "author": "Josaton"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude Opus 4.6 achieves highest ARC-AGI scores for non-refined models so far.",
        "score": 190,
        "text_content": "[https://arcprize.org/leaderboard](https://arcprize.org/leaderboard) ARC-AGI-1 score only 0.5% lower but less than eighth of the cost of the refined GPT 5.2. ARC-AGI-2 score less than 4% lower but less than tenth of the cost of the refined GPT 5.2. Surprising that \"max\" variant actually scored slightly less than \"high\" variant.",
        "comments": [
            {
                "raw_content": "Wow. To think we've basically completed ARC-AGI-1. Being at almost %70 on ARC-AGI-2 is also hype as fuck. Imagine if a refined version of Opus 4.6 reaches the saturation point of ARC-AGI-2. If Opus 4.6 is this high, I'm wondering if Sonnet 5 will be equal (or higher)? Sonnet is way cheaper, so I'd assume if it was a little close, it'd likely be both better and cheaper than GPT-5.2 at this.",
                "author": "KaroYadgar"
            },
            {
                "raw_content": "Now do refinement again but with opus 4.6",
                "author": "DesignerTruth9054"
            },
            {
                "raw_content": "What about 5.3",
                "author": "3Dmooncats"
            }
        ],
        "subreddit": "singularity"
    }
]