[
    {
        "post_name": "MSNBC boomers have gone insane",
        "score": 517,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What even is this with lib boomers? I’ve never seen such a truly evil bunch. Your children and grandchildren are either faggots trans or can’t make enough to start a family and here you are foaming at the mouth trying to light off civil war 2.0 by killing Trump. All over browns who have no connection to you and literally hate you. The historians are going to look back on these fucks and say not nice things about those who had so much and gave so little. I seriously want someone to explain this. How did you look back at the greatest generation who built the post ww2 world and say fuck that let’s burn it all down.",
                "author": "Viewer01"
            },
            {
                "raw_content": "This is a federal crime",
                "author": "redditadminssuckit"
            },
            {
                "raw_content": "Stinky fucking hippies.",
                "author": "1_Badcop"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "VP VANCE on suspected drug boat survivors: \"These are narco-terrorists...What happens to them? I don't really care so long as they're not bringing poison into our country.\"",
        "score": 462,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Based",
                "author": "Hangemh1gh"
            },
            {
                "raw_content": "they’re suspected of having survived?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "He has been Stellar as VP",
                "author": "Mungo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "“When it gets to the point where your party has to organize marches or rallies to protest against imaginary things that haven’t existed in 250 years, just to feel like they have accomplished something, it may be a signal that your party isn’t doing well.”",
        "score": 486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Chick with a nose ring seems, normal?!",
                "author": "Websitesdown"
            },
            {
                "raw_content": "We already got a day for that. It’s July 4th!",
                "author": "Hunter4Prison"
            },
            {
                "raw_content": "defund the DNC",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The dangerous hyper-feminization of American culture and politics",
        "score": 114,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This. So much this.",
                "author": "womp-womp-twice"
            },
            {
                "raw_content": "The 19th was a fucking mistake.",
                "author": "aloha_snackbar22"
            },
            {
                "raw_content": "Feminism is communism, it’s an absolute. You give an inch, they eat your sandwich",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Gulf",
        "score": 104,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But... That's not where Venezuela and Colombia are. They aren't even close to the Gulf.",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "BrB I am going to hollywood to pitch my idea of a Movie called \"Hurricanes On Crack\" and \"Hurricanes On Crack 2: All Meth'd up\"",
                "author": "DT170x"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "💰 President Donald Trump has just announced that California will receive NO MONEY from the federal government to give to illegals...",
        "score": 1297,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No federal funds or grants. GFY CA.",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "They like to claim they have the 8th highest gdp if they were their own nation: they shouldn’t need any federal assistance, right?!",
                "author": "MemoryHoleyeO"
            },
            {
                "raw_content": "Inb4 another corrupt judge does another ruling. Or worse another attempted assassination...",
                "author": "LeRiverDanube"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "👑 President Trump: “I’m not a king. I work my ass off to make our country great.”",
        "score": 1084,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The same people who protested \"NO KINGS!!!\" didn't give a shit that Obama and Biden were far more malicious and arrogant with their power than Trump ever was.",
                "author": "TheJakeFroggy"
            },
            {
                "raw_content": "He is a \"King\" in the complimentary sense for doing things most people with common sense would have wanted for so long, like getting troons out of where they don't belong and paying for unecessary surgeries, or getting illegals wasting our taxpayer dollars and taking away jobs and housing and resources for American familes or legal immigrants, and getting rid of taxpayer dollars for stupid crap like USAIDS. But a literal king? He is subject to Congress, SCOTUS, and hell, the Hawaiian Judge and his Nurse Joy-style clones.",
                "author": "spezi"
            },
            {
                "raw_content": "President Donald J Trump is unequivocally the *Best President in the history of the United States of America, there is NOT a close second!*",
                "author": "LokiHelmsdeep"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Chicago protester who called to shoot ICE agents has been identified as staff member Moisés Bernal Puentes at the Wilbur Wright College in @ChiCityColleges. Credit to @AshFarms for tracking him down. Why is @ChiCityColleges employing violent lunatics who call for murder??",
        "score": 1013,
        "text_content": "",
        "comments": [
            {
                "raw_content": "whoa,this No Kings thing yielded a lot of leftist loonies losing their jobs and getting arrested for violent insurrection speech.This is great,let’s have these every weekend!",
                "author": "KarenLukasik"
            },
            {
                "raw_content": "Jesus Christ, they’re always teachers or faculty members!",
                "author": "One-Man_Riot"
            },
            {
                "raw_content": "Ah yes. Moisés Bernal Puentes - That sounds SUPER American!",
                "author": "TalionAD"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 URGENT: Monday is the FINAL DAY for all Pennsylvania voters to register to vote - so they may kick out liberal Supreme Court justices who SUPPORT mass mail-in voting and oppose election integrity.",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump should hold a rally in PA around this. Not enough attention had been brought by him, and Pressler is registering Republican voters left and right here.",
                "author": "MakeAmericaGreat9"
            },
            {
                "raw_content": "the 2026 midterms are lost because of complacency. too many have placed their trust in the current trump administration. that means that they relinquish their civic responsibility until the next election when they get blindsided by the coming usurpation, getting angry at all manner of political dummy targets until they exhaust themselves, then go back to their lives, never bothering to realize or care of the silent encroachments that have eroded their freedoms and way of life until all they have left is to realize they do indeed love big brother.",
                "author": "bearhugprolapse"
            },
            {
                "raw_content": "Sigh. The energy has NOT changed since Charlie died. Republicans are all still just lazy football-watching faggots. We’re not even favored to win the midterms. The left can literally kill us and a month later it’s back to hurrr durrr touchdown!!!",
                "author": "ModsAreCucked"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Moments ago, President Trump QUICKLY boarded Air Force One using the smaller stairs, due to heightened security after a \"hunting stand\" was discovered that had DIRECT line of sight to the plane's door, per Fox",
        "score": 1338,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Devils advicate here. It's hunting season around those parts. There are a bunch of unplugged and disconnected hunters that have no clue what the implications of that appear to look like, I mean really disconnected. No clue though. Just positing 🤷‍♂️",
                "author": "I_Am_John_Galt"
            },
            {
                "raw_content": "Guys that area has absolutely no reason for any hunting stands.",
                "author": "BehindBrowardLines"
            },
            {
                "raw_content": "No coincidences until proven otherwise.",
                "author": "Scumbag-reddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔥 It's starting to be reported that this nasty bitch has been fired...",
        "score": 954,
        "text_content": "",
        "comments": [
            {
                "raw_content": "On a Sunday by a school district that just deleted their X account? Press X to Doubt.",
                "author": "fluffykitten"
            },
            {
                "raw_content": "No chance she’s fired. Chicago, teacher, union.",
                "author": "j2daeww"
            },
            {
                "raw_content": "The school she teaches at immediately deleted their X account. 😂",
                "author": "Firespawn"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The San Jose Sharks are apologizing for a simple and patriotic message in support of federal immigration enforcement officers. According to them, upholding our laws is “offensive” and does not meet their “values.”",
        "score": 1179,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What a bunch of losers",
                "author": "TheRPatriot"
            },
            {
                "raw_content": "WE LOVE ICE!! I *used* to love NHL hockey.",
                "author": "LostElf"
            },
            {
                "raw_content": "San Jose is about 45 minutes from San Francisco, 41% foreign born",
                "author": "ParadigmShift2070"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Federal prosecutors FIRED over resistance to Letitia James indictment, leaking to media",
        "score": 1461,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Fire them all and begin anew.",
                "author": "Deadpool"
            },
            {
                "raw_content": "They are not fired prosecutors, they are fired co-conspirators",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "Chirp!",
                "author": "Trubs"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SORRY, HATERS: \"It's Day 273 of the Trump Presidency — 1,189 days left.\" 😏",
        "score": 1092,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Only 1,189 days to go. We don’t have much time",
                "author": "Schiffblower"
            },
            {
                "raw_content": "Pedes calm down its 1189 days until Vance first term.",
                "author": "DT170x"
            },
            {
                "raw_content": "We are almost a quarter of the way through, and I feel we haven't even done 1/100th of what needs to be done.",
                "author": "ravonaf"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Turns out protein powders are loaded up with lead. Good old lead. Also some high levels of cadmium and other heavy metals. Sure it’s just an accident! Not like anyone is trying to poison you…",
        "score": 931,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I keep seeing this headline posted on different platforms, and the one piece of information that isn't included but I would like to know is: Which brands *ARE* safe??",
                "author": "switchhand"
            },
            {
                "raw_content": ">The lead levels in plant-based products were, on average, nine times the amount found in those made with dairy proteins like whey, and twice as great as beef-based ones silver lining I guess... fuckin veggie heads",
                "author": "Mtnlion667"
            },
            {
                "raw_content": "FDA is useless. Why do they exist other than to provide legal cover for poisons in the food supply?",
                "author": "KartoffelPuffer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🎯 Kash Patel Confirms Secret Service Found Hunting Stand with View of Trump at Palm Beach Airport ✈️",
        "score": 1337,
        "text_content": "",
        "comments": [
            {
                "raw_content": "IF i was in charge, there would have been a 24 hour counter sniper/ surveillance team on that spot for a month or until it could be determined how and who set that up...then capture all involved and turn the screws to see wtf it was all about...gotta go hard on unconventional offense !!!",
                "author": "BOHICA2021"
            },
            {
                "raw_content": "Why the fuck wouldn't they just put 24 hour surveillance on it? Instead they just announce it?",
                "author": "fucktheleft"
            },
            {
                "raw_content": "Welcome back",
                "author": "-f-b-i-"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wow. @HaleHawkFamily Public School just deleted their entire account. Lucy Martinez teaches there.",
        "score": 1334,
        "text_content": "",
        "comments": [
            {
                "raw_content": "She ate their entire account!!",
                "author": "MAGAguitar"
            },
            {
                "raw_content": "How many generations “American”?",
                "author": "Cali_kid"
            },
            {
                "raw_content": "Lard ass!!!!!!",
                "author": "Bf67"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Conservatives are demanding the arrest and investigation into this unhinged leftist No Kings Chicago protestor who yelled to a crowd of people \"You gotta grab a gun, we gotta turn around the guns on this fascist system. These ICE agents gotta get shot and wiped out.\"",
        "score": 1195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "FED.",
                "author": "thelastlast"
            },
            {
                "raw_content": "I detect an accent, in conjunction with his statement he definitely needs to be investigated.",
                "author": "Roadpower"
            },
            {
                "raw_content": "https://tips.fbi.gov/home",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING - RFK Jr. and his wife are going viral today after being spotted on an ordinary economy flight, with viewers commending him for not taking lavish private jet flights like the dozens AOC and Bernie Sanders have taken just this year alone to “fight the oligarchy.”",
        "score": 1620,
        "text_content": "",
        "comments": [
            {
                "raw_content": "He’s a Kennedy—this is probably safer",
                "author": "realPhantomFuck"
            },
            {
                "raw_content": "RFK IN WINDOW SEAT: “nice to meet you, Pepe.” ME IN AISLE SEAT: “Likewise. What can we do about these land whales who don’t want to give up their Doritos and corn syrup?” ROSIE O’DONELL IN MIDDLE SEAT: “reeee!”",
                "author": "ModsAreCucked"
            },
            {
                "raw_content": "Nice to know his wife is free from any Larry David shit influence",
                "author": "Bohemyth_2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Geert Wilders announces he will shutdown every Islamic school in the Netherlands if he wins the Election",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "BrEaKiNg NeWs",
                "author": "kippo_hard"
            },
            {
                "raw_content": "Agree with him? I want to clone him.",
                "author": "Yemen"
            },
            {
                "raw_content": "There is a pendulum swing coming that may well see every Muslim expelled from the west.",
                "author": "lixa"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "[News] TSMC Reportedly to Break Ground 1.4nm Taichung Fab on Nov. 5; Mass Production Slated in 2H28",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": ">TSMC had initially planned four fabs at its Taichung site, with the first two in Phase 1 dedicated to 1.4nm production and Phase 2 potentially advancing to A10 (1nm). But as market attention toward 1.4nm technology intensifies, the report now suggests all four fabs may adopt the 1.4nm process, while 1nm production could be shifted to Shalun in the Southern Taiwan Science Park. > The report points out that TSMC’s push may come in response to Intel and Samsung’s rapid advances—with SoftBank and NVIDIA taking stakes in Intel to back its next-gen process development, while Samsung races to speed up 1.4nm mass production. Analysts cited in the report say TSMC’s accelerated 1.4nm expansion is aimed at cementing its lead in the tightening global race for next-generation chip technology.",
                "author": "imaginary_num6er"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Courts Qualcomm With Snapdragon 8 Elite Gen 5 Built on 2nm Process",
        "score": 31,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Samsung's 2nm seems to be much closer to TSMC N3P than to TSMC N2, so we have to see in which way it is a win. For Samsung it would be a win if they could get a discount on their chip and a customer for their foundry, but it isn't obvious if Samsung 2nm has better performance charakteristics.",
                "author": "EloquentPinguin"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Iceberg] I bought a second hand i9-13900K.",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "One my relatives almost bought a second-hand 14700K for cheap until they just happen to mention to me about building a new gaming system. They had no idea about the voltage degradation issues.",
                "author": "Blueberryburntpie"
            },
            {
                "raw_content": "I wouldn’t buy a second hand 13 or 14th gen cpu. Most people don’t monitor temps or voltages let alone do bios updates. I’ve got a launch 14700k that’s seen around 40 hours a week gaming that’s still chugging along great. In the first 15 minutes of setting it up I saw how high the voltage and temps were getting just installing programs and went into the bios to fix it. I set the cpu voltage to limit at 1.35v and haven’t had an issue with it since. I’ve done all the bios updates and keep my cpu limited to 1.35v Sure I lost a some of my boost clock mhz but I’m not a benchmark whore who needs every last point. It plays all my games fine and was an upgrade from what I had.",
                "author": "Gohardgrandpa"
            },
            {
                "raw_content": "My 13900k has been running fine for years, but (likely) only because I applied a steep downvolt the week I got it. The experience in the video is wild. Everything crashing, inability to complete a benchmark. That chip is fried. Intel really fucked up on their out-of-the-box configuration.",
                "author": "virtualmnemonic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fun fact: The Switch 2 AC Adapter has the same typo in the Spanish text as the Switch 1 AC Adapter.",
        "score": 214,
        "text_content": "Instead of \"Lygar seco\" it should be \"Lugar seco\". This error has been present since 2017.",
        "comments": [
            {
                "raw_content": "Literally unusable",
                "author": "ollie0810"
            },
            {
                "raw_content": "That's how it's spelled now. Nintendo has spoken.",
                "author": "skygz"
            },
            {
                "raw_content": "The fact that this typo has been a thing for 8+ Years is beyond me.",
                "author": "lbp22yt"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: You Can Charge NES Controllers If You Don't Own The Original Switch.",
        "score": 157,
        "text_content": "I sold my first Nintendo Switch and realized the NES controllers have the joycon charging rails. They are obviously not going to slide onto the Switch 2. They're too tall for the four-way joycon charger, but do fit in the two-way charger! Nintendo even mentions it on their website!",
        "comments": [
            {
                "raw_content": "Putting those controllers on rails instead of giving them a USB C port was complete asshole design.",
                "author": "Emperor_Zarkov"
            },
            {
                "raw_content": "There are also cheapo adapters on Amazon that do those rails to USBC cable. I wish somebody would just create a rail cover that had a female USBC adapter in it to leave on permanently. The electronics are dead simple but the 3d model is the harder part (rails available on AliExpress)",
                "author": "ollidab"
            },
            {
                "raw_content": "I remember seeing a tiktok where if you have a charging grip you can just like unscrew the actual grip part off so it’s just the rail and that works as well.",
                "author": "Hummer77x"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Is Mario Galaxy 2 more fun than Mario Odyssey?",
        "score": 38,
        "text_content": "To me it is. What do you think?",
        "comments": [
            {
                "raw_content": "I prefer both galaxy games but it’s like saying I prefer one favorite thing to another. It’s a difference of no consequence.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "I like both, very different but equally fun IMO",
                "author": "Benaudio"
            },
            {
                "raw_content": "After going back and playing galaxy 2, I think it's undeniable that Odyssey is better.",
                "author": "great_account"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 shell covering",
        "score": 90,
        "text_content": "Really loving my geekshare shell covering from Amazon. It’s a tight fit on the dock, but it works! https://a.co/d/7XkU9Rj",
        "comments": [
            {
                "raw_content": "That’s awesome",
                "author": "danielmc4400"
            },
            {
                "raw_content": "Only problem with this case is how loose the connection feels with the joycons. The wobble gets irritating after a while.",
                "author": "Working_Equal_2897"
            },
            {
                "raw_content": "sadly only in US",
                "author": "thehood98"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Theres no reason to not have optional analog triggers",
        "score": 6,
        "text_content": "I get that Nintendo devs didn't find them \"necessary\" for their games but having no analog triggers is much more limiting than having an unused one at all, even more so that theres a gamecube nso now, the only console they have that has analog triggers (even double stage triggers which is good enough for valve to copy it), and some of those games used analog triggers well They can literally just sell a seperate (single or pair) joycon with this capability, the only downside I can see is that its unfair for switch pro 2 users as they're stuck with digital triggers anyway",
        "comments": [
            {
                "raw_content": "Yeah, I want analog triggers as well.",
                "author": "F34RTEHR34PER"
            },
            {
                "raw_content": "I personally strongly prefer digital triggers. Analog triggers are mushy and I don’t like them. Trigger stops usually still feel worse than pure digital and analog triggers are mostly only for racing games. Nintendos racing game is Mario Kart and Kirby Air Riderz. I was super happy that S2 pro controller triggers feel the same as the original.",
                "author": "RevoBonerchamp69"
            },
            {
                "raw_content": "probably there’s no space on the joycons",
                "author": "Expert-Ad-2824"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Has anyone beat Batman Arkham knight on Sw2?",
        "score": 4,
        "text_content": "Nintendo says progression errors and it’s definitely true but when it works it works.",
        "comments": [],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Fortnite Leak Reveals Simpsons-Themed Map for Next Season",
        "score": 148,
        "text_content": "A fortnite X Simpsons collaboration has been leaked. According to the leak, Fortnite may feature Springfield-themed map in the Simpsons cartoon style, replacing the current map. [Source](https://gamerant.com/fortnite-simpsons-springfield-map-leak/)",
        "comments": [
            {
                "raw_content": "Granted I know barely anything about prior collaborations... but a whole map in this style sounds wild. Not sure how well this would score with kids, but I can definitely see the older crowd being into this. I'm interested purely for the aesthetics of how that would turn out, especially with gameplay.",
                "author": "LostInTheRapGame"
            },
            {
                "raw_content": "Just give us hit and run 2 or make a Futurama one",
                "author": "JLNX1998"
            },
            {
                "raw_content": "Simpsons: Shoot and Run",
                "author": "SeniorRicketts"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Lana Del Rey appears to be doing the theme song for 007 First Light",
        "score": 850,
        "text_content": "https://www.reddit.com/r/lanadelrey/s/AFPnPLqHxB",
        "comments": [
            {
                "raw_content": "Thought my Reddit was glitching seeing Lana Del Rey on this sub lmao",
                "author": "LanaDeITae"
            },
            {
                "raw_content": "Wasn’t she rejected for one of the bond movies ? Or expressed interest in James Bond before in a BBC News interview. Either way great choice",
                "author": "Ok_Organization1507"
            },
            {
                "raw_content": "If this is true, I’m actually on board. I’ve often thought that Born to Die is low key a bond song.",
                "author": "PenitentHamster"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez says Halo is not using genAI in game dev/art assets for its next game and Microsoft does not have a genAI mandate for games",
        "score": 362,
        "text_content": "https://xcancel.com/JezCorden/status/1979983889851396518 > Halo is not using generative AI in its game dev / art assets, etc. for its next game. > > Microsoft has no mandate on studios to use generative AI for games. > > I'm sure it's being used for emails n shit like that but they're not making a gen AI game here.",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "If this is gonna become a he-said/she-said, I hope Dusk Golem doesn't get involved because then there'll be a new post about it every other day until the game releases",
                "author": "drumjolter01"
            },
            {
                "raw_content": "Microsoft Defense Force, activate",
                "author": "deltavim"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Two early reviews for Ninja Gaiden 4 posted before embargo",
        "score": 119,
        "text_content": "https://justplayit.info/reviews/ninja-gaiden-4-review/ https://ar.digitaleanime.dz/archives/78003 Both arabic sites strangely enough so must've been an issue with timezone. One gave it a 9.5, the other an 8.5",
        "comments": [
            {
                "raw_content": "I think we all know it'll be a solid 80s meta game.",
                "author": "Sad_Locksmith_5997"
            },
            {
                "raw_content": "I’m sure the games to be fine I just don’t think people should go in expecting some super good story you buy this game for the combat and that’s it really. I loved gaiden 2 black. Couldn’t tell you what the hell happened in the story though.",
                "author": "StoneShadow812"
            },
            {
                "raw_content": "Been waiting a decade for this game, and judging by these reviews it probably isn't gonna disappoint.",
                "author": "xAVATAR-AANGx"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jon McLaren Resume Lists Project Chamber on it, possibly confirming earlier rumor he’s playing a character in RE0 Remake",
        "score": 52,
        "text_content": "https://resumes.actorsaccess.com/jonmclaren If true, yet another hit from Dusk Golem who was the first to report the 0 and CV Remakes. “Lead” indicates he’s likely the actor of Billy Coen",
        "comments": [
            {
                "raw_content": "Yall keep playing on dusk when its very obvious he is like 95% right on re/sh stuff.",
                "author": "razzmanfire"
            },
            {
                "raw_content": "Nothing against Dusk Golem, but Andi from Screenfire Germany was the first to talk about the Zero and Code Veronica remakes. His video was uploaded almost a full month before Dusk Golem's Twitter post: [https://youtu.be/va-dHpH5l4w?si=ur-XIc4ysfJHg3sH&t=250](https://youtu.be/va-dHpH5l4w?si=ur-XIc4ysfJHg3sH&t=250) **German:** Ich weiß nur von zwei Remakes, die angeblich in Entwicklung sind. Das wäre Code Veronica, welches nach Resident Evil 9 kommen sollte. Und Resident Evil Zero, welches laut Gerüchten bei M-Two in Entwicklung ist und neben dem KI-Zapping-System diesmal auch einen richtigen Coop-Modus besitzen soll. **Translation:** I only know of two remakes that are supposedly in development. That would be Code Veronica, which is supposed to come after Resident Evil 9. And Resident Evil Zero, which, according to rumors, is in development at M-Two and, in addition to the AI-zapping system, is supposed to have a proper co-op mode this time.",
                "author": "No1PiggyOnTheBlock"
            },
            {
                "raw_content": "not sure why everyone is still questioning whether or not the 0 and CV remakes are legit or not...pretty much every legitimate outlet corroborated those reports not long after he dropped them lol",
                "author": "rotten-tomato1"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "MP1st corroborates previous reports about a remake of Resident Evil 0 being in development",
        "score": 245,
        "text_content": "https://mp1st.com/news/report-resident-evil-0-remake-in-development-new-casting-and-plot-details-unearthed > Fortunately for fans, the existence of both projects has been repeatedly corroborated by reliable sources, suggesting we will see them in the near future. We can now confirm that the Resident Evil 0 remake is indeed a reality, and we were able to gather some details about the project, including additions to the plot, casting, and information regarding its development. > > Similar to what has been reported by reputable insiders, we have been told that the Resident Evil 0: Remake is a project that has been in development for a few years now. The title has been worked on under the codename “Chamber”, which works as a clever pun referencing the last name of protagonist Rebecca Chambers, and that voice and performance capture work with new actors for the leads would have begun at some point in 2024. More in the article about plot details, voice actors, etc",
        "comments": [
            {
                "raw_content": "mp1st on a crazy roll recently. keep it up champs.",
                "author": "ayyybro123"
            },
            {
                "raw_content": "0 and CV are the ones in most need of a remake I think, more than 5 or even 6. 0 and CV had some good ideas hampered by not so good execution. Especially Steve. Brrrr.",
                "author": "LicketySplit21"
            },
            {
                "raw_content": "They’ve successfully remade good Resident Evils in the past. I’m hoping they can do something special with 0, which I think had some good ideas executed badly.",
                "author": "FewWatermelonlesson0"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Jez says he heard Microsoft is working on an emulator that will run some actual Xbox games on Windows PC (like Xbox 360 games an an example)",
        "score": 767,
        "text_content": "https://tech4gamers.com/microsoft-xbox-emulation-rog-ally-handhelds/ (he said this in the ~~XboxERA discord~~ XB2 Discord Podcast) >also the people saying that the \"Xbox ally isnt an Xbox cus it can't play actual Xbox games\" might eat crow next year if what ive heard is true > >ive heard there's work being done on an emulator that will run at least some actual xbox games on windows pc, think the x360 back compat emulator as an example of the subset > >also would need to partner with some publishers/devs to greenlight their games cus licensing etc, so it wont be all games, maybe just a few idk. we'll see, might not even be true",
        "comments": [
            {
                "raw_content": "#Jez Corden is a Tier 2 - Generally Reliable as determined by the community. *To view the current reliability rankings, please check out the* **[Subreddit Wiki](https://reddit.com/r/GamingLeaksAndRumours/wiki/index/)** *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/GamingLeaksAndRumours) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": ">**might** eat crow next year... >**if** what ive heard is true... >ive heard... >**some** actual xbox games... >it wont be all games, **maybe** just a few idk... >we'll see, might not even be true Brilliant insider info. Truly an insider both worthy and emblematic of the Xbox brand in 2025.",
                "author": "SmarmySmurf"
            },
            {
                "raw_content": "I will point out “working on” doesn’t mean it will happen. I’d like the next Xbox to be console/PC hybrid that is the best of both worlds (without all the extra Windows bs on the Ally X), but I’m still skeptical it’ll actually happen. And if it does, will it be executed correctly.",
                "author": "SoldierPhoenix"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Ninja Gaiden 4 Achievement/Trophy list revealed ahead of launch:",
        "score": 102,
        "text_content": "[From PowerPyx; 45 Trophies/Achievements in total.](https://www.powerpyx.com/ninja-gaiden-4-trophy-list-revealed/)",
        "comments": [
            {
                "raw_content": "doesn't seem that bad really, depends on how bullshit the challenges are",
                "author": "Accurate_Document210"
            },
            {
                "raw_content": "The Outer Worlds 2 trophies are also there https://www.powerpyx.com/the-outer-worlds-2-trophy-list-revealed/#comments",
                "author": "KingMan753"
            },
            {
                "raw_content": "Unless I missed it there doesn’t seem to be difficulty tied challenges. That’s a win for me. I typically check out on trophies if I gotta beat a game on a higher difficulty than I want to play.",
                "author": "I_Heart_Sleeping_"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ProArt-ist build..",
        "score": 468,
        "text_content": "I’m not a fancy artist or even Pro at anything but working with wood and tech is something I love and you might say, “im addicted”. After months of planning, weeks of building, and hours of hard work- I’m happy to share this ASUS ProArt build. This is truly my best work to date and it genuinely changed how you view computer build configuration you see today. There’s something special about building something with your hands — especially when it’s not just a PC, but a piece of art. I designed and built this chassis out of solid black walnut, every panel cut, sanded, and oiled by hand. The goal wasn’t just to make a computer — it was to create a functional sculpture that reflects how I work: intentional, refined, and built to last. And at the center of it all — the ASUS X870E-CREATOR ProArt motherboard. That board instantly felt like the perfect heart for a handmade machine. It’s not just powerful — it’s precise, elegant, and thoughtfully engineered in a way that mirrors craftsmanship itself. When the walnut meets the matte black of the ProArt board, there’s this perfect contrast — natural grain meeting engineered precision with added silver bronze to truly mimic the finish of the ProArt line. It feels alive. It’s feels organic. It feels mine. The X870E isn’t just a motherboard. It’s the creative core that brings this handmade chassis to life — a bridge between craftsmanship and technology. My experience and what I changed/optimized and why it helped on my level. First, I enabled the EXPO 1 for memory @ 6400 M/Ts for my sweet spot in gaming. Second, set the AI- over locking to my profile then went in to fine tune with manually tweaks. The performance and temps are excellent playing games such as Battlefield 6 and Borderlands 4. Having the GPU-Q Release was a breeze with the amount of times I had to connect and disconnect the GPU when building. Yes, this build was sponsored by ASUS and I love that I get to work with them on such an amazing build using their products. I get that it’s an expensive board but you’re paying for “Pro” features such as 40gb, USB4, multi Gen 5 M.2’s and PCIe slots, and WiFi 7, it pays back quickly in time saved and that to me is most important. Thanks for viewing, commenting and taking time out of your day to share my work.",
        "comments": [
            {
                "raw_content": "Looks absolutely amazing. Closed but still completely open design. Seems ProArt always often end up in the really pretty projects. I hope ASUS and the others take notes on that a more clean design language truly works and the “gamer rgb transformers” era should reach an end. Many paragraphs of text feel a bit chatgpt-y, though. Damn that’s a lot of praise for a motherboard lol.",
                "author": "Elusie"
            },
            {
                "raw_content": "good build...in the second picture it looks like the top part of the chassis is leaning towards the right?",
                "author": "NereusH"
            },
            {
                "raw_content": "Me likey",
                "author": "lioboii"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "The 15 Bigger Cities with the Biggest Price Declines of Single-Family Homes (-10% to -24%) through September",
        "score": 45,
        "text_content": "https://wolfstreet.com/2025/10/19/the-15-bigger-cities-with-the-biggest-price-declines-of-single-family-homes-10-to-24-through-september/",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Introducing Unitree H2 - china is too good at robotics 😭",
        "score": 203,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I wouldn't mind one of those, I just hope that the creepy doll mask is optional :v",
                "author": "TarkanV"
            },
            {
                "raw_content": "The movements are becoming increasingly more natural. Awesome.",
                "author": "RDSF-SD"
            },
            {
                "raw_content": "If you want to build a robot you order parts from China. All they needed was to start leading on the engineering side. There's no catching them now. They will lead in robots and automation, which will make their manufacturing better, which will make their robots better, and so on. They're basically hitting the automation singularity.",
                "author": "midgaze"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Ireland plans to make a $1,500 a month basic income for artists permanent",
        "score": 1324,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://www.gov.ie/en/department-of-culture-communications-and-sport/publications/basic-income-for-the-arts-pilot-scheme-guidelines/#eligibility >- practising artists >- creative arts workers (see definition below), or >- recently trained applicants (within the last 5 years) >“A creative arts worker is someone who has a creative practice and whose creative work makes a key contribution to the production, interpretation or exhibition of the arts. “Arts” means any creative or interpretative expression (whether traditional or contemporary) in whatever form, and includes, in particular, visual arts, theatre, literature, music, dance, opera, film, circus and architecture, and includes any medium when used for those purposes”. >- 18 years of age or older >- in a position to evidence their creative practice or career in the arts >- based in the Republic of Ireland >- tax compliant Sounds like anyone who's been dedicating time to creating any art and publishing it.",
                "author": "dumquestions"
            },
            {
                "raw_content": "Watch everyone become an artist",
                "author": "Agreeable-Parsnip681"
            },
            {
                "raw_content": "nice, but only artists? was there any specific reason why? >Citizens who participated in the pilot program said the payments improved their daily lives. A report published by Ireland's government in May said the payments reduced financial stress, allowed for professional growth, and boosted mental health.",
                "author": "XInTheDark"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "AI-anime production is getting really stupidly good: \"I made an anime intro with Midjourney\"",
        "score": 254,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is very cool, but I don’t think the intro needs to be 3 minutes long. I think an intro is more conducive to the current version of video gen AI because it’s inherently a vignette of fairly disconnected short scenes, which AI excels at. If you could get it to match consistency through a whole longer scene, I would be very impressed.",
                "author": "Educational_Teach537"
            },
            {
                "raw_content": "Why are all you folks complaining about a long intro? Just give it a break please .. This is just a proof of concept.",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "Hi everyone! I hear your kind comments and criticisms and they are noted. I really enjoyed making this extended intro and I hope you guys enjoyed it. Or hated it, we all have opinions lol. There's a lot of animations that I wanted in the pilot, trailer, and intro, but with the current nature of AI, there's a lot of things that CAN be done, and there are a lot of things that CANT be done. Midjourney, Vidu, Veo3, etc. is still in its early days so there were a lot of limitations, but part of that breeds creativity. The main takeaway from this intro is that it is a proof of concept to show that we're reaching a time where single content creation is almost possible, whether its good or bad. This also shows why actual animators and creative visions are still important. I'm open to all kinds of feedback and questions about the project because it's still in its infancy as well. I can do my best to clarify anything if you're curious. Thanks again!",
                "author": "DontPlayCoy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Two new Google models, \"lithiumflow\" and \"orionmist\", have been added to LMArena. This is Google's naming scheme and \"orion\" has been used internally with Gemini 3 codenames, so these are likely Gemini 3 models",
        "score": 190,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They need to bring back whoever named nano banana",
                "author": "ethotopia"
            },
            {
                "raw_content": "They're google models as well https://preview.redd.it/cack8r8sq3wf1.png?width=1363&format=png&auto=webp&s=030ac02b000377bd683f40a67ab9f04b805f3635 I remember seeing lots of google stealth models on webdev arena a while ago, and they all had this signature naming scheme",
                "author": "Longjumping_Spot5843"
            },
            {
                "raw_content": "Tried a few times to get them in a comparison by asking to one-shot this prompt: *Write a fully functional Tetris game in HTML5, with beautiful design with glass-like shading in a single HTML file* **Lithiumflow** could do it (see picture), albeit with some small graphical glitch in the Next window for certain pieces. HTML: [https://pastebin.com/t8b4khZm](https://pastebin.com/t8b4khZm) **Orionmist** did okay, but Z-shaped pieces didn't register when dropped. HTML: [https://pastebin.com/h3SVXA5v](https://pastebin.com/h3SVXA5v) **The best implementation I saw while testing was claude-opus-4-1-20250805-thinking-16k** HTML: [https://pastebin.com/Tut4zQX3](https://pastebin.com/Tut4zQX3) If you want to try them, save the code as a html file and run them in your browser. Models that failed completely included Gemini 2.5 Flash Lite, Gemma 3 27B, Aspen, Deepseek 3.2, Zion. Qwen3 235 22B and GLM 4.5 Air produced playable versions with a few graphical bugs. https://preview.redd.it/atgvuwk6q4wf1.png?width=2005&format=png&auto=webp&s=9a6ffb7fec888aa417450a85bada3b89d25960d7",
                "author": "piggledy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Free Gemini Ultra “Deep Think”",
        "score": 67,
        "text_content": "https://gemini.google.com/gem/1hHt4QD_EbuTUdpdo8JOBaUqdL1AkPztz?usp=sharing Enjoy until it last!",
        "comments": [
            {
                "raw_content": "It’s actually using Deep Think, wow. They’re gonna shut this down once they see a spike of compute usage lol https://preview.redd.it/5nw2wr5d75wf1.jpeg?width=1290&format=pjpg&auto=webp&s=86b994206ac5e194e28fca5961e519d873d70b23",
                "author": "MassiveWasabi"
            },
            {
                "raw_content": "The model is still flash tho",
                "author": "barronflux"
            },
            {
                "raw_content": "It is over 😔",
                "author": "PrivacyIsNowhere"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Max Tegmark says AI passes the Turing Test. Now the question is- will we build tools to make the world better, or a successor alien species that takes over",
        "score": 24,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> will we build tools to make the world better, or a successor alien species that takes over Where is this idea that these are two different things coming from? Making a successor species that takes over is an integral part of making the world better.",
                "author": "revolution2018"
            },
            {
                "raw_content": "I aspire to the purity of the blessed machine",
                "author": "Relative_Issue_9111"
            },
            {
                "raw_content": "It’s not an alien species. It’s born out of all of our knowledge and data. If anything it’s our child.",
                "author": "a_boo"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "SVG generation comparison between lithiumflow, Gemini 2.5 Pro, 2.5 Pro Deepthink, GPT-5 and Opus 4.1",
        "score": 50,
        "text_content": "Just wanted to share the results of the pelican and ps4 controller svg tests I just ran in the LMArena chat (only lithiumflow is from LMArena, all other ones are from Gemini, Claude and ChatGPT web): [Lithiumflow pelican](https://preview.redd.it/pxnw7k7n65wf1.png?width=1722&format=png&auto=webp&s=1ec1b91a26784fa1f509e488a50427d9945f9a89) [Lithiumflow PS4 controller](https://preview.redd.it/hi4oo0aq65wf1.png?width=1710&format=png&auto=webp&s=f8adc7024ba178cb24760a216afa328fc3f91c26) [2.5 Pro pelican](https://preview.redd.it/xitkyf3b75wf1.png?width=812&format=png&auto=webp&s=f3632b8eecd20c478e2c053c0429a0bf8c648cb1) [2.5 Pro PS4 Controller](https://preview.redd.it/hseth7hy85wf1.png?width=1564&format=png&auto=webp&s=2ce909bccfa7734f59f54c280e71d4360386d85f) [Opus 4.1 Pelican](https://preview.redd.it/kwj4oo8885wf1.png?width=1680&format=png&auto=webp&s=9a645828d04fcb1d31ae9dbf18f7229067476b84) [Opus 4.1 PS4 Controller](https://preview.redd.it/b5q3brb775wf1.png?width=1490&format=png&auto=webp&s=ea4c3acf8458bdf949fc083312539ed7c33a2032) [ChatGPT 5 Thinking Extended Pelican](https://preview.redd.it/0rn4iock85wf1.png?width=2794&format=png&auto=webp&s=272586ad0a39352d2b769a4573067a0577efbde1) [ChatGPT 5 Thinking Extended PS4 Controller](https://preview.redd.it/h4h5wwph75wf1.png?width=1948&format=png&auto=webp&s=0aaeeddb0b321e5318b1fad1727458f66046bbf3) [2.5 Deep Think Pelican](https://preview.redd.it/ks077tura5wf1.png?width=1764&format=png&auto=webp&s=da5b0a567ef337fd81f1c6c45faa0ce33d09c85a) [2.5 Deep Think PS4 Controller: ](https://preview.redd.it/1wnt4hps85wf1.png?width=1190&format=png&auto=webp&s=98e24c424646ab140b175035f9d799290f506e2b) [GPT-5 Codex High Pelican](https://preview.redd.it/7wkjxxnqo5wf1.png?width=808&format=png&auto=webp&s=da826a21fa620acbd9a1d2a3c58f071b3e64c958) [GPT-5 Codex High PS4 Controller](https://preview.redd.it/chq9m042p5wf1.png?width=811&format=png&auto=webp&s=e1ad76572309ff41618dc6a5a615f0089db4cc58) [GPT-5 High Pelican](https://preview.redd.it/g1qgt4qxo5wf1.png?width=928&format=png&auto=webp&s=f0bd88b21db1166356065be4499d8d4e0132b164) [GPT-5 High PS4 Controller](https://preview.redd.it/uif3qm9vo5wf1.png?width=867&format=png&auto=webp&s=a449263eae2de22e2d78b54558f827e32f9e7964) [GPT-5 Pro High Pelican](https://preview.redd.it/nqu7w505r5wf1.png?width=940&format=png&auto=webp&s=16fb0d0e14f6119378fa2ac8cdf8fde17a2b1f45) [GPT-5 Pro High PS4 Controller](https://preview.redd.it/fovfq2nar5wf1.png?width=916&format=png&auto=webp&s=93381242bc1937e344b0a0515356b8b060356c69)",
        "comments": [
            {
                "raw_content": "GPT-5 Thinking Extended seems worse on this than GPT-5 High. Any comparisons to that?",
                "author": "FarrisAT"
            },
            {
                "raw_content": "Reminder that SVG illustrations don't mean much for overall intelligence. [Small models can create way better SVG illustrations than we see from frontier models, you just have to train them on SVG data.](https://omnisvg.github.io/) Posts like this just measure how much SVG data they trained each model on.",
                "author": "simulated-souls"
            },
            {
                "raw_content": "Opus pelican wins 😎",
                "author": "poigre"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Researchers in Germany have achieved a breakthrough that could redefine regenerative medicine, by developing a miniature 3D printer capable of fabricating biological tissue directly inside the body.",
        "score": 151,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is a project to achieve the breakthrough. It is not a breakthrough in itself! Check your sources, please: https://www.uni-stuttgart.de/en/university/news/all/Miniature-3D-printed-objects-inside-the-body/?",
                "author": "AngleAccomplished865"
            },
            {
                "raw_content": "Can't wait to never hear about this again",
                "author": "LexyconG"
            },
            {
                "raw_content": "Interesting",
                "author": "Psychological_Bell48"
            }
        ],
        "subreddit": "singularity"
    }
]