[
    {
        "post_name": "Make Chicago Great Again!",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Invoke the insurrection act, send in the troops, and clean the place up",
                "author": "henri_derelicte"
            },
            {
                "raw_content": "Chicago wasn't MAGA country when Juicy Smoliet shoved a Subway sandwich up his own ass but by golly it will be MAGA country by the end of Trump's term",
                "author": "staroframphansbhole"
            },
            {
                "raw_content": "just make the guns illegal, duh",
                "author": "Hanging_Chad"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Illinois Governor J.B. Pritzker Signs New Law Mandating Abortion Pills on Campus at All Public Universities in the State",
        "score": 443,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Moloch is the god of the Democratic Party",
                "author": "OrthodoxTemplar"
            },
            {
                "raw_content": "What is it with non-Christians and their mad, crazy love for making sure women can quickly annihilate their kids?",
                "author": "bleeje"
            },
            {
                "raw_content": "Margaret Sanger would be so proud.",
                "author": "LetFreedomReign"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JB Pritzker says he's a \"champion\" for women, when he told men to invade women's bathrooms in protest of Trump being against child mutilation. Retard Finder points out that it's because JB has a trans cousin.",
        "score": 432,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It looks like him in a dress.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "Have we ever seen pritzker and his cousin in the same room together at the same time? I think not...hmmm",
                "author": "brewser724"
            },
            {
                "raw_content": "Cousin?? That's him!",
                "author": "Prandogolio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "JOAN OF AXE..",
        "score": 256,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I am hoping this gal will light a fire for a UK revolution.",
                "author": "Stars-n-Stripes"
            },
            {
                "raw_content": "Is there a way to contribute to her legal defense? I find redditards hilarious: “she went out with a weapon looking for trouble!” As though it wasn’t a response to trouble that already existed, thanks to lax borders and the whole replacement plan. The UK government would rather have young native women raped than have them defend themselves.",
                "author": "MAGATHREAD"
            },
            {
                "raw_content": "UK men have failed their women and girls.",
                "author": "TrumpMe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Republicans just LOST their supermajority in the Iowa State Senate. The Democrat has flipped Senate District 1 from red to blue in a special election",
        "score": 899,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’ll wager the Rs didn’t turn out. They still lack the spirit to win that the commies have.",
                "author": "Lincoln6ech0"
            },
            {
                "raw_content": "**Current House/Senate Seats in Iowa** Iowa House of Representatives (67 Republicans, 33 Democrats) Iowa Senate (33 Republicans, 16 Democrats, 1 Vacant) So now it'd be 32 Republicans, 17 Democrats, 1 Vacant.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "It’s not like Republicans are getting anything done anyway",
                "author": "reeseangle"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Chinese nationals are required by law in China to gather and provide intelligence to the CCP when coming to the United States on a student visa We currently have an organized CCP spy ring across our country",
        "score": 808,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So why do we allow them to come here?",
                "author": "Bearing51"
            },
            {
                "raw_content": "600k.",
                "author": "Neonentity"
            },
            {
                "raw_content": "We let Chinese spies drive our cars before it was cool in Congress",
                "author": "FaustyArchaeus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Cracker Barrel says they will drop their new logo & bring back the old one: \"We said we would listen, and we have. Our new logo is going away and our 'Old Timer' will remain.\"",
        "score": 1355,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now fire the shitheads that came up with the original idea.",
                "author": "explodejoystick"
            },
            {
                "raw_content": "No-one ever learns. Never go full retard aka woke.",
                "author": "Liberals_R_Idiots"
            },
            {
                "raw_content": "Small win, but it’s still woke. Do you see the announcement where they fired every level of person involved in this? No? Okay maybe call me when they do.",
                "author": "ThisTrainHasNoBrakes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Donald J. Trump:",
        "score": 1072,
        "text_content": "",
        "comments": [
            {
                "raw_content": "America has still a very long way to go for being back.",
                "author": "NotMyGovernor"
            },
            {
                "raw_content": "This is really a good one!",
                "author": "CasuallyObservant"
            },
            {
                "raw_content": "# Drill, baby, drill! 🛢️",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Don’t Tread On Me",
        "score": 552,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Painting this shit on the street and expecting people not to drive over it is peak retardation.",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "There are so many conservative cartoons/articles/videos these days hyperventilating about the hypocrisy of the Left, as if hypocrisy is the trump card that shuts down everything. IT'S NOT HYPOCRISY - it's just warfare. It's one side seeing everything that allows it to win as good, and everything that keeps it from winning as bad. That's not hypocrisy - that's just ruthless war strategy. \"Waaah - every time their soldiers surrender to us, we put them in nice accommodations, but every time our soldiers surrender to them, they kill us. What hypocrites!\"",
                "author": "TheOneWhoKnocks"
            },
            {
                "raw_content": "All that hair dye they use must be pretty unhealthy",
                "author": "38WendysHamSquare79"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump meets Cracker Barrel's Uncle Herschel",
        "score": 883,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This has got me **Cracking** up!",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I love this. MAGA!",
                "author": "SavingPrivateGrace"
            },
            {
                "raw_content": "Backtracked bigly.",
                "author": "utfanx2"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "@bennyjohnson: Left-wing Illinois Governor says he lives “rent free” in Trump’s head. Then the camera man does something incredible...",
        "score": 1274,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The cameraman knew the assignment!",
                "author": "vegaspatriot1776"
            },
            {
                "raw_content": "Big mistake to speak in front of a TRUMP building, Dumbo",
                "author": "LightBeacons"
            },
            {
                "raw_content": "He meant to say “I live rent free in his hotel, I broke in last month and am squatting there because my wife and her boyfriend kicked me out of the governors mansion.”",
                "author": "lifeisahologram"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Deficit down 26% from Biden’s last year in office.",
        "score": 1244,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, I guess. Not sure its really doing shit all. Really tired of pinned comments talking about how great everything is yet its the same as yesterday and the day before minus some fucking igits getting deported like they should.",
                "author": "IForgotToAddAnEmail"
            },
            {
                "raw_content": "Not even remotely enough. There should be NO deficit spending. \"Hooray! We overspent a little less!\"",
                "author": "ThorsonTT"
            },
            {
                "raw_content": "ya'll need to post actual fucking sources instead of gay screenshots.",
                "author": "LawyersPlayDota"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "HAHA Cracker Barrel still has their \"new\" logo in their media kit downloads. Failure on their technology team.",
        "score": 939,
        "text_content": "",
        "comments": [
            {
                "raw_content": "- Check for yourself: https://www.crackerbarrel.com/newsroom - Same page above, but archived before the big reveal: https://archive.is/Nfow3 - And here: https://www.crackerbarrel.com/newsroom/photos/logos - Direct Link: https://www.crackerbarrel.com/-/media/Project/cb-brandsite/brandsite/images/Newsroom/Media-Downloads/Logos/barrel_logo.png?rev=1c639c41a183452492c68923c9aa2e3c - Their leadership team, the CEO is a joke: https://www.crackerbarrel.com/newsroom/photos/leadership - \"Hey unpaid intern, update the navigation back to *logo-v1.png* and that will chill them all out.\"",
                "author": "CerebralPimp"
            },
            {
                "raw_content": "They will be keep the old logo but will still be installing all the woke shit.",
                "author": "pedespeed"
            },
            {
                "raw_content": "Liars",
                "author": "bleeje"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump just reminded the press they should be GRATEFUL for the amount of access he gives them He just allowed them to stay in the cabinet room for over THREE HOURS with him. \"You've not had this happen for FOUR YEARS.\"",
        "score": 1105,
        "text_content": "",
        "comments": [
            {
                "raw_content": "GEOTUS is a generous god. if he were still working at McDonald’s, then he’d be putting 24 nuggies in 20-pc boxes",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "THE GOAT",
                "author": "Conspiracytheorist"
            },
            {
                "raw_content": "Theyre not going to call... Illinois, NY, cali... they WANT CRIME, THEY WANT HOMELESSNESS... Its big money to all the nonprofits that get money to stop such things. Tax payers pay... but get no security, get no peace get no protection for the money they get taxed.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Blah / BREAKING: Bill Gates met President Trump today at the White House - reports",
        "score": 887,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gross. I hope Trump took a shower right after.",
                "author": "YouAreIgnorant"
            },
            {
                "raw_content": "Trump indicated he was going to pull the covid shots... Gates is there to try to stop that?",
                "author": "BahamaDon"
            },
            {
                "raw_content": "Don't ruin your legacy, Trump.",
                "author": "ToxicAvengerOhio"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Iris Tao, a White House Correspondent, THANKS President Trump for cracking down on D.C. crime after revealing she'd been robbed and pistol-whipped outside her apartment.",
        "score": 1510,
        "text_content": "",
        "comments": [
            {
                "raw_content": "> young man with a gun Wonder what color that scholar was..",
                "author": "ragnarokrobo"
            },
            {
                "raw_content": "It’s crazy that a press comment that’s positive towards President Trump is a stickied post. That’s how much they all hate him I guess.",
                "author": "MikesDong"
            },
            {
                "raw_content": "It was reported as a personal injury and mis-placed property on the DC Crime Statistics.",
                "author": "Stolen"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Read every word of this brutal, behind-the-scenes account of Cracker Barrel’s rapid descent. The company’s incompetent, woke execs and board were warned repeatedly, at every step, that they were destroying the company.",
        "score": 1259,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Twatter post with screenshot but no link, posted to patriots.win, still with no link to the article. You're a trash person and I hope you step on legos barefoot.",
                "author": "VonArman"
            },
            {
                "raw_content": "It’s a color Revolution. They want to erase anything American, and replace it with something drab and unremarkable. They want a white wash everything while taking the whites away.",
                "author": "ThisIsHowItStarts"
            },
            {
                "raw_content": "I have a wonderful investment strategy that has paid dividends for me. Every time a woman, black, indian or gay has a celebratory announcement about them being placed in a position of power; I do a 12 month short. I'm up 24% this year",
                "author": "Formerlurker92"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Everyday is a disco dance party at the White House now 🤣",
        "score": 902,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I love the WH gives 0 fucks and will have a blast with making the lamestream media wonder \"OH HES PLAYING THAT SONG?!?! WHAT DOES IT MEAN!?!?\" it'll be front page news for a day and in the end it's just that Trump wanted to blare that song cause he could.",
                "author": "SparkleMTN"
            },
            {
                "raw_content": "Enjoy these days lads, we will never have another president like this.",
                "author": "Bedminster"
            },
            {
                "raw_content": "Trump v2.0 has lots of added features!",
                "author": "vegaspatriot1776"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Why the fuck are people crying about the Scottish lass having blades? She either got them specifically for the situation at hand, or she carries them for protection as standard. The rage should be at the fact she felt she needed them.\"",
        "score": 574,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Amen.",
                "author": "Mestroisfils"
            },
            {
                "raw_content": "Agreed. Said this yesterday- where is her dad? Where are the cops? Where are the men of Scotland. William Wallace is rolling in his grave",
                "author": "1ValhallaJack"
            },
            {
                "raw_content": "Exactly that poor child was so scared and abused she felt - out of sisterly love she had to arm up to protect her lil sister. What a hell must be her life to risk carrying weapons like that, such a shame they let this be an issue.",
                "author": "MAGALADON9"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump just revealed that Tulsi Gabbard has “found many bags of information… having to do with how corrupt the 2020 election was…”",
        "score": 1775,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Many usb's",
                "author": "JesusisLordofAll777"
            },
            {
                "raw_content": "Nullify the past election. Remove Jumanji Jackson from the Supreme Court. Replace with someone Clarence Thomas recommends.",
                "author": "RedCapNation"
            },
            {
                "raw_content": "\"Bags\"?? WTF? like those other burn bags? Some hero left those to be found. This hero needs to be given medal of freedom or something",
                "author": "Colorado-Living"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Framework is now selling the first gaming laptop that lets you easily upgrade its GPU — with Nvidia’s blessing",
        "score": 688,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow I wonder how did they get nvidia to agree to anything like that",
                "author": "mach1alfa"
            },
            {
                "raw_content": "Just link directly to framework. https://frame.work/laptop16",
                "author": "pellets"
            },
            {
                "raw_content": "Starting from which gpus can we start swapping with?",
                "author": "konsoru-paysan"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Japan launches its first homegrown quantum computer",
        "score": 40,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Bye-bye barrel jack: Framework brings 240W USB-C charging to laptops",
        "score": 281,
        "text_content": "",
        "comments": [
            {
                "raw_content": "afaik the thing with the 240 watt type c chargers is that they supply 5 amps at 48 volts. normally the standart barrel chargers as well as batteries are at around 19 volts so the laptop requires extra circuitry and some level of inefficieny leading to extra power consumption and heat so i'd like to know how they handled that.",
                "author": "ComputerUpgrader"
            },
            {
                "raw_content": "The fundamental limitation of 5A set by the USB standards forum will be an issue since this forces power to be delivered at 48V which creates higher step down losses. Going beyond 240W (many laptops are in the 280W-300W range now) will be even harder. I can see why they did it though, especially given that many cheap cables can barely handle 5A to begin with. That's the issue of trying to create a one-size-fits-all charging standard. Charging phones which use no more than 15-30W and laptops which can easily pull 300W is not easy to handle under the same standard. Thus I view USB-C at 240W little more than a novelty. I personally liked Lenovo's custom 20V/7A USB-C solution and only wish they made it open. While the upgradable GPU is a great idea and I really support it, I think the primary issue of sustainability isn't being able to upgrade the CPU/GPU but rather the durability of overall system components. A big reason why powerful laptops are often discarded is because of failures to the fans (bearings are a big failure point as the fans are much faster yet cheaper than desktop fans) or cooling solution or power delivery, as they suck down power and generate huge amounts of heat. The next biggest reason is running out of memory (so upgradability there is key)",
                "author": "fastheadcrab"
            },
            {
                "raw_content": "Just Josh talked about how the USB-C charging/power causes laptops to be warmer than if they used the barrel jack, no clue why that could be, anyone know?",
                "author": "pomyuo"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD RDNA 4 GPU Architecture at Hot Chips 2025 in-Depth",
        "score": 115,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Ryan Smith. Now that’s a name I haven’t 'seen' in a long time! Anyhow, >As mentioned previously, RDNA 4 has new memory compression/decompression features. This is entirely transparent to software; it is all handled in hardware. AMD has seen a \\~25% reduction in fabric bandwidth usage. That should explain why AMD chose to stick with GDDR6, or perhaps how the 9070XT manages to compete with the 5070 Ti, despite the latter having a massive 40% raw bandwidth advantage. Of course, the 9070XT also has 33% more SRAM (64MB vs. 48MB), so it’s not exactly a 1:1 comparison, but still… quite impressive. In any case, I have a feeling things will really heat up on the Radeon side next generation thanks to GDDR7, N3, and the shift to a brand-new architecture (hopefully). The stars certainly seem to be aligned. That’s not to say Nvidia will be sitting on its hands, of course, but regardless, fingers crossed.",
                "author": "GenZia"
            },
            {
                "raw_content": "A dedicated hardware transfermer. Now that's something even Nvidia don't have!",
                "author": "thelastasslord"
            },
            {
                "raw_content": "Does Ryan write for STH now? Very cool write up.",
                "author": "UltraSPARC"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Framework Laptop 16 Upgrade Announced With Ryzen AI 300 Series, GeForce RTX 5070",
        "score": 49,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I really wish I could justify the price tag for one of these things, they are super cool, and upgrade-ability is so unique in the laptop space",
                "author": "deefop"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Lightmatter Passage M1000 at Hot Chips 2025",
        "score": 9,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Fabric8Labs ECAM Enabled Thermal Solutions at Hot Chips 2025",
        "score": 6,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "NVIDIA GeForce RTX 5090 and the Age of Neural Rendering in-Depth at Hot Chips 2025",
        "score": 30,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turing has been the base requirement for most newer games as well as consumer AI/ML uses. I wonder what the next performance floor will be since its mostly iteration since.",
                "author": "capybooya"
            },
            {
                "raw_content": "There is literally no mention of a RTX 5090 except in the title of the article",
                "author": "imaginary_num6er"
            },
            {
                "raw_content": "if fake frames weren't enough, you can now have ai-induced hallucinations too!",
                "author": "angry_RL_player"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Bruh, QVC pls",
        "score": 940,
        "text_content": "Tell your grandma's guys that DK Bonanza only works on Switch 2. Imagine getting this bundle on christmas... smh",
        "comments": [
            {
                "raw_content": "Oh shit that is just straight up cruel by qvc",
                "author": "krstphr"
            },
            {
                "raw_content": "This should be illegal",
                "author": "TheEquinox20"
            },
            {
                "raw_content": "Switch 2 OLED confirmed",
                "author": "masterz13"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "My experience attending the official Nintendo Switch 2 demo booth at Fan Expo Canada",
        "score": 132,
        "text_content": "So, as Nintendo announced, they had a pretty large demo booth at Fan Expo Canada in Toronto, reminiscent to the invited Switch 2 demo experiences they’ve had before. These are the games they had to demo: - Mario Kart World - Donkey Kong Bananza - Kirby and the Lost Dreamland (Nintendo Switch 2 edition with new story DLC) - Hades II - Elden Ring: Tarnished Edition - Borderlands 4 - Metroid Prime 4 (with 120 fps and specially set up tables to try out mouse mode) Was quite surprised they set up such a big demo, though this is one of the largest cons in Canada - we still usually don’t get big demo booths like this for non released games - seems they are really pushing the marketing for the Switch 2. Line was long but when we got in we had about 45 minutes in the booth. Also got a Switch 2 tote and a lanyard if we tried three games lol. What I got to try: - Donkey Kong Bananza: They were running the demo that exists already on the eshop already, but I had never tried it. I’m sure everyone already knows it’s fun, but I DID feel the performance quality issues that were officially described. It was more than I expected. Totally playable and fun though. - Kirby and the Lost Dreamland (Nintendo Switch 2 edition with new DLC story): The FPS and resolution improvement is extremely noticeable, and the new DLC is very pretty with the new icey sparkly areas! If you already liked this game, you’ll love the new DLC. - Hades II: As someone who loved Hades I, I was most excited to demo this (I haven’t gotten it on other platforms yet). It’s insanely good. Very reminiscent of the first game, just better!! - Metroid Prime 4: I did not try this out myself as there was a separate line for it, but I did watch people playing it. You could DEFINITELY see that it was 120 FPS, and it was quite stable. I did not notice any frame drops when moving the camera around or shooting. Resolution looks good too. Seems promising. - Elden Ring: Tarnished Edition: Also did not try this out myself but watched people playing it while I was waiting in live. The graphics actually look pretty good for what it is - but it was definitely running at between 30-40 fps. With it not in my hand I can’t talk about the feel of the controls, but if you’re used to playing it at higher FPS - I can see people easily getting frustrated. This is definitely probably a “you really want it in handheld or don’t own any other console” type of port.",
        "comments": [
            {
                "raw_content": "I'm surprised you noticed unstable framerates in DK Bananza demo, playing the full game I hardly ever notice dropped frames, though I can't say I have the best eye for it. Gamescom previous of Elden Ring have sounded much worse than 30-40fps, so if that's what its hitting that's very encouraging to me.",
                "author": "The-student-"
            },
            {
                "raw_content": "The lineup was so long but worth it!",
                "author": "complex_personas"
            },
            {
                "raw_content": "Pokemon Legends Z-A wasn't there? That's really weird.",
                "author": "DocWhovian1"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo is reportedly telling would-be Switch 2 devs to release on Switch instead",
        "score": 674,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't know why they have made this article just now, but this has been a thing that's been reported on for multiple weeks now. Basically from the various reports, if your game does not have a feature or anything like that that only works on switch 2, you won't get a switch 2 dev kit. Be that the camera, GameChat/share, mouse mode, HDR or high refresh rate.",
                "author": "Sinomsinom"
            },
            {
                "raw_content": "Wild the absolutely flooded markets with consoles, but seem to have made like 4 dev kits. And one of those 4 made the campfire game…",
                "author": "Cultural-Action5961"
            },
            {
                "raw_content": "The issue also seems to be the Devs not wanting to use any of the \"forced\" features Nintendo mentioned. Guardians of Azuma used the mouse mode, so did Cyberpunk and Hogwarts Legacy. Imho, a lot of devs don't want to bother with these features and just want a quick direct port, something that goes against what Nintendo wishes for the system at the current time.",
                "author": "Skelletonike"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby in 2 days",
        "score": 399,
        "text_content": "Most of the Kirby talk since the direct has been about Air Riders, but I haven't played a Kirby game in nearly a decade so I'm really excited for Forgotten Land + Star-Crossed World. From what I've seen the standard Switch version was a great game so I have high expectations!",
        "comments": [
            {
                "raw_content": "I was holding out for this version, hope star crossed world is really cool, can't wait.",
                "author": "doctorhino"
            },
            {
                "raw_content": "Forgotten land is really good. I've never vibed with the side-scrolling Kirby games but loved this one",
                "author": "froot_loop_dingus_"
            },
            {
                "raw_content": "Forgotten land is incredible, I hope you enjoy your first playthrough. I’m super excited for star crossed world as well, it looks so cool and I’m honestly just happy we get more 3D Kirby.",
                "author": "Affectionate-Emu6609"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Final Fantasy VII Remake is looking pretty good on the Nintendo Switch 2",
        "score": 486,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I bought a PS4 Pro just so I could play Final Fantasy VII Remake back when it was released in 2020. The graphics still blow me away. And the sequel, Rebirth, is even better. I am jealous of anyone who gets the chance to jump into this completely blind.",
                "author": "brainfreeze91"
            },
            {
                "raw_content": "It really does look great. Square has clearly done an amazing job optimizing it for the new hardware based on what we've seen so far. I hope competitors are paying attention. I'll never forget playing through this one during the early pandemic in 2020 with the jet engine esque background noise that my PS4 Pro was dishing out. Good times.",
                "author": "J_Square83"
            },
            {
                "raw_content": "Crazy that this game was made for the big ass PS4 and five years later we’ll be playing a better version of it on a tiny ass tablet. Technology moves quick.",
                "author": "lattjeful"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Kirby Star-Crossed World DLC Release TIME",
        "score": 58,
        "text_content": "Edit: Thank you everyone. The general consensus: around midnight YOUR timezone. I can't wait! By now we all know that the Kirby DLC will be released on the 28th of August. But I was wondering, WHEN exactly. Are we talking about midnight, so the moment the clock passes and it shows it's the 28th, or are we able to play it only from 7 am in the morning. Or the 28th, when it strikes midnight in Japan, so that other people around the world will be able to play it at the same time. But unless Nintendo said anything, we can't know except.. There has been 1 game that had this before: Jamboree. So my question is, if you do have Jamboree Switch 2 edition, when did it unlock for you, and if you do say so, perhaps which timezone you are from. I myself never got Jamboree S2 edition, so I am not of much help here. Or of course if someone has an official nintendo statement about the time, that would be very helpful too.",
        "comments": [
            {
                "raw_content": "It should be exactly the same as every other Nintendo new game release in North America. 12am ET.",
                "author": "The-student-"
            },
            {
                "raw_content": "I’m assuming midnight depending on your time zone. Back when tears of the kingdom came out I believe I had access at 9 pm. So if your est id say midnight if your in the North America region.",
                "author": "Ordinary-Rope7037"
            },
            {
                "raw_content": "First party stuff is usually midnight",
                "author": "Death_Metalhead101"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Official Fan Expo Canada 2025 Attendee Exclusive Wallpaper - Metroid Prime 4!",
        "score": 32,
        "text_content": "On request, I got the email from Nintendo asking for a survey about the booth I attended at Fan Expo Canada 2025 (since they had QR code check in), and this was the exclusive wallpaper! Link has all available resolutions. Enjoy!",
        "comments": [
            {
                "raw_content": "You are a gentleman and a scholar.",
                "author": "ManualSearch"
            },
            {
                "raw_content": "Absolute legend",
                "author": "Ihatenickstreltsov"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "What has been your top 3 played games on the switch 2 so far?",
        "score": 105,
        "text_content": "Personally it’s been : 1. Donkey Kong Bananza with 15-20 hours 2. Super Mario party Jamboree with around 10 hours 3. Discounty with also around 10 hours I’m also personally looking forward to hollow knight silksong,hades 2 and Pokemon legends z-a for the rest of 2025",
        "comments": [
            {
                "raw_content": "1. Cyberpunk with 95 hours 2.MK World with 35 hours 3. DK bananza with 8 hours",
                "author": "Anxious_Profit7036"
            },
            {
                "raw_content": "Totk - 75 hours DK Bonanza - 25 hours Mario Kart - 5 hours I waited for switch 2 to play TotK. I’m glad I did!",
                "author": "NotARobotInHumanSuit"
            },
            {
                "raw_content": "Persona 5 Royal. i am still playing switch 1 games on switch 2 hahah",
                "author": "dongnugget"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Microsoft is reportedly mandating that every single employee at King (Candy Crush) has to use AI on a daily basis",
        "score": 1076,
        "text_content": "https://mobilegamer.biz/inside-king-layoff-lawsuits-toxic-leaders-toothless-ethics-teams-low-morale-and-mandatory-ai-use/ > As we’ve reported before, some of the 200 King staffers let go are to be replaced by the same AI-based narrative, level design and testing tools they had helped build. > > “AI was being introduced by Microsoft as mandatory a while ago,” says one source. “The goal for last year, if I recall correctly, was having a 70 or 80% daily usage of AI on general tasks. And the goal for this year was to get up to 100%, so that every artist, designer, developer, even managers have to use it on a daily basis.” > > But another source suggested that the mandate isn’t working: “AI adoption is very low apart from ChatGPT,” they said. “King leadership is in general quite AI sceptic.”",
        "comments": [
            {
                "raw_content": "The stupidest thing is that it's likely just creating more work for them.",
                "author": "DemonLordDiablos"
            },
            {
                "raw_content": "Microsoft is doing the good old Meta tactic of trying to force it until it works, a clear sign that it's a bubble, meta failed so badly at this they have mostly abandoned the thing they switched their name to.",
                "author": "garmonthenightmare"
            },
            {
                "raw_content": "I'm so interested to see what happens to the tech industry (and the global economy) when this AI bubble pops.",
                "author": "Spider-Fan77"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Apparently, Yuri Lowenthal accidentally confirmed Deadpool was in Marvel Rivals already, but backtracked after being reminded he wasn’t",
        "score": 206,
        "text_content": "https://xcancel.com/capitalspidey/status/1960363550783803470?s=46 Take it with a grain of salt, as this is just heresy, but after yesterday’s Deadpool voice leaks, it’s just further evidence that Deadpool is probably one of the next heroes being added",
        "comments": [
            {
                "raw_content": "If i had a nickel for every time Yuri Lowenthal leaked something gaming related.",
                "author": "jeshtheafroman"
            },
            {
                "raw_content": "Yuri S tier leaker",
                "author": "Gabrielhrd"
            },
            {
                "raw_content": "Voice actor leaks are the funniest leaks",
                "author": "robertman21"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Nintendo rumors from NashWeedle/AttacktheBacklog recent podcast",
        "score": 207,
        "text_content": "I know people see \"NashWeedle\" and roll their eyes or ask \"who?\", but the guy has gotten a few things right this year, mainly about Direct timings and games that would be featured in those directs. He came onto AttacktheBacklog's podcast to chat about what he currently hears around future Nintendo happenings. Here is what he has heard: \\-DLSS implementation for Switch 2 games will begin to show up more next year because the dev kits received a DLSS update just this year in March \\-Day 4 Night Studio (David Soliani/Mario+Rabbids guy's new studio) has met with Nintendo \\- Beginning in January, a marketing campaign will kickoff with multiple dates related to Legend of Zelda projects. He does not know what the campaign is about, but he was told it would last all year, with Zelda announcements dropping throughout. \\-Nintendo is planning on returning to the horror genre (Luigi's Mansion not included lol) \\-The next general Direct will be 2nd week of September, as other sources have stated. It will have the release date for MP4 but also announce an MP4 Direct coming later. Hyrule Warriors: Age of Imprisonment will also get it's release date. \\-Elden Ring Tarnished Edition and Final Fantasy 7 Remake dates will also be featured in the general Direct \\-There is a possibility of the Mario 40th Anniversary Direct being next week, but he isn't certain \\-He has heard nothing about Animal Crossing, his previous rumor was that it was a 2026 game \\-Doom the Dark Ages is coming (surprising nobody) \\- He believes that Wii NSO is closer than DS NSO Source (interview is in Spanish with subs): [https://www.youtube.com/watch?v=ul-BbCWcSsU](https://www.youtube.com/watch?v=ul-BbCWcSsU)",
        "comments": [
            {
                "raw_content": "all of this is very good news which means its fake as hell",
                "author": "TiocStudios"
            },
            {
                "raw_content": ">SwitchForce might be credible >NashWeedle again This is the darkest timeline",
                "author": "ArcWardenScrub"
            },
            {
                "raw_content": ">I know people see “NashWeedle” and roll their eyes or ask “who?”, but the guy has gotten quite a few things right this year, mainly about Direct timings and games that would be featured in those directs. Specifically, what has this guy gotten right?",
                "author": "Simmers429"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "New Sony Santa Monica job ad further hints that another 3rd-person God of War game is likely in development",
        "score": 326,
        "text_content": "[Source](https://thegamepost.com/new-third-person-god-of-war-game-development-job-ad/)",
        "comments": [
            {
                "raw_content": "Fork found in kitchen",
                "author": "GoldenTriforceLink"
            },
            {
                "raw_content": "they're all third person?",
                "author": "cellphone_blanket"
            },
            {
                "raw_content": "59-89$ hour pay... damn",
                "author": "ComplexHighway9081"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "The next Stronghold game will titled \"The Dark Age\". (Firefly Studios, creators of Stronghold franchise and Space Colony",
        "score": 30,
        "text_content": "The title has been registered on september 2024 on Uk Intellectual property Office https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00004036211 More info: https://fireflyworlds.com/ They recent releases are: Stronghold Definitive edition (over 1 milion sold copies since its launch on november 2023) https://store.steampowered.com/app/2140020/Stronghold_Definitive_Edition/ Stronghold Crusader Definitive edition (over 250 thousand of copies in two weeks). https://store.steampowered.com/app/3024040/Stronghold_Crusader_Definitive_Edition/ Firefly Studios announced they were working on a new main title of Stronghold in 2022. New Stronghold Is developing with Unreal Engine 5 and It Will offer to developers the possibility to reach the highest level of details that many Stronghold fans wanna see. Here some videos about Stronghold Next https://youtu.be/_8IEZyeK-8U?si=4jEWXSRycgyTvmKg https://youtu.be/VBTyVgTS3Nk?si=nQoFfZ5n3_JwViMC https://youtu.be/x7cyVfFVJKc?si=6BDGzfrmDRDIsov8 https://youtu.be/fOV-nlgYeNs?si=ynUmn-WeYUqiuDdU It think they will share some new info at the end of the year with a full reveal next year. My Hope is that the new Stronghold Will have the same graphic details of Manor Lords (a big commerciale success).",
        "comments": [
            {
                "raw_content": "Didn't we get a Dark Age just this year?",
                "author": "Unfair-Rutabaga8719"
            },
            {
                "raw_content": "More Stronghold? Our granary is full, M'lord",
                "author": "iChatShit"
            },
            {
                "raw_content": "Dark age, so a stronghold game set in the early middle ages??? Seems like an odd choice wooden walls and the lack of advanced weapons like crossbows or trebuchets, seem like a pretty big downsides for this franchise.",
                "author": "Dodo1610"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Tomb Raider's official X account may be hinting at a Tomb Raider Legend Trilogy remaster again",
        "score": 274,
        "text_content": "Last week the Tomb Raider X account was hinting at a Tomb Raider Legend Trilogy remaster, as I mentioned here. [https://www.reddit.com/r/GamingLeaksAndRumours/comments/1munr0e/tomb\\_raiders\\_official\\_x\\_account\\_could\\_be\\_hinting/](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1munr0e/tomb_raiders_official_x_account_could_be_hinting/) Today she retweeted again, saying that from 7,000 polygons in Legend to over 32,000 in Underworld, Lara Croft's dramatic change earned her a Guinness World Record in 2010 for 'Most Detailed Video Game Character'. [https://xcancel.com/tombraider/status/1960371730309894655#m](https://xcancel.com/tombraider/status/1960371730309894655#m) He's also tweeting about a Tomb Raider UnderWorld figure that will be arriving very soon and pre-orders are now open. [https://xcancel.com/tombraider/status/1960379219067666818#m](https://xcancel.com/tombraider/status/1960379219067666818#m) [https://www.tombraider.com/news/collaborations/crafting-lara-croft-weta-workshops-creative-journey-with-quest-for-avalon](https://www.tombraider.com/news/collaborations/crafting-lara-croft-weta-workshops-creative-journey-with-quest-for-avalon) This sounds like we're getting the Legend Trilogy Remastered by 2026, as half of the tweet comments also believe this is most likely being planned for the arrival of the Tomb Raider Legend Trilogy Remastered port.",
        "comments": [
            {
                "raw_content": "Will this mean that every mainline Tomb Raider is available on modern systems?",
                "author": "RollingDownTheHills"
            },
            {
                "raw_content": "where new tomb raider",
                "author": "Elden_Born"
            },
            {
                "raw_content": "I hope we get official confirmation of the Tomb Raider Legend trilogy remaster soon. ![gif](giphy|kcVkpl4ORfXB6)",
                "author": "Jasonvsfreddyvs"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "SwitchForce states the direct he has been teasing for Friday, September 12th, is a general/\"the big one\".",
        "score": 476,
        "text_content": "Source: [https://youtu.be/WGoHoDpp8LQ?si=X2cVU3x0iKiGkDnZ&t=239](https://youtu.be/WGoHoDpp8LQ?si=X2cVU3x0iKiGkDnZ&t=239) He also clarifies that the reason he previously stated the direct was going to be earlier than expected, was because he saw many people online expect a late-September direct. If he's right on this... that's big. Friday generals are very very rare.",
        "comments": [
            {
                "raw_content": "All his credit is on the line here I picture",
                "author": "LuigiWarrior"
            },
            {
                "raw_content": "oh switchforce is playing all or nothing with his recently improved reputation, spicy now we wait and see if he was right",
                "author": "Follows-Jesus"
            },
            {
                "raw_content": "So what's expected of a big nintendo direct ?",
                "author": "DarahOG"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "ACER finally launches Radeon RX 9060 XT NITRO",
        "score": 103,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Man my first computer was an Acer. I think it was 3000 years ago Gandalf.",
                "author": "jedimindtriks"
            },
            {
                "raw_content": "I saw it show up in my local store a couple days ago and was baffled by how expensive it was lol, not sure if this is just the local price or if it's the same in other countries but it was by far the most expensive AIB model, like 50 euros more expensive that Sapphire Nitro which already overpriced",
                "author": "BasedBalkaner"
            },
            {
                "raw_content": "I wonder what Sapphire has to say about that naming scheme",
                "author": "HotConfusion1003"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD RDNA 4’s Modular SoC Nature & Flexible Configurability Helps Spawn Smaller & Diverse GPUs Such as Navi 44, Highlights Features To Reduce Memory & Bandwidth Needs",
        "score": 61,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So... bring the High-end RDNA 4 to life :)",
                "author": "Dante_77A"
            },
            {
                "raw_content": "So, in fact, RDNA 4 only has one SKU?",
                "author": "SceneNo1367"
            },
            {
                "raw_content": "So what’s the holdup to bringing it to mobile?",
                "author": "996forever"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "‘Extraordinarily weak’ demand blamed as home prices grow at slowest pace in two years",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "lol, I'd totally move my family of 5 + dog out of my 3br 1ba 980sq ft house if I was confident that the next house didn't have the potential to financially ruin me",
                "author": "admiralgeary"
            },
            {
                "raw_content": "but they still grow? wtf is going on…",
                "author": "gk_instakilogram"
            },
            {
                "raw_content": "*home prices grow* Found the problem",
                "author": "ckkl"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Millennials and Gen Z are gambling on a big mortgage-rate drop, using ARMs and refinancing. But that could be a 'financial ticking time bomb'",
        "score": 378,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The realtors and mortgage brokers encouraging them to do this are criminal.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "I still don’t see anybody mentioning the MO of the current admin, doing things on a whim without any concern for whether it helps or hurts the people. I don’t believe we should expect a major rate drop. And even if it does happen, there are other critical factors at play like the job market, which is being manufactured for collapse. Rates going down won’t matter if people are stuck in a market already on the brink of collapse.",
                "author": "Anderson822"
            },
            {
                "raw_content": "sad. these people should just refuse to buy. not buy something unaffordable and overpriced, hoping and praying for rate drops that will never come",
                "author": "HormoneDemon"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Free App like Re:Venture for all you Bubblehead's enjoyment",
        "score": 32,
        "text_content": "I know Re:Venture's content is posted here a lot, it kinda bothered me that I had to pay for it so I open sourced the same data he uses for your enjoyment. Totally free, no credit card, nada. Just home price gore bubble-nomics for your enjoyment.",
        "comments": [
            {
                "raw_content": "Not all heros wear capes. Thank you friend.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Great work op. I have a bit of experience with maps and would love to help out in small ways if you need it. At work I use a mixture of deck gl and mapbox",
                "author": "Funkyyyyyyyy"
            },
            {
                "raw_content": "🤌🏿🤘🏿",
                "author": "MrGuyTheStampede"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Prices Are Losing Steam and Mortgage Rates Are Down.",
        "score": 129,
        "text_content": "The housing market had a slow spring and sleepy summer. For buyers who want to house-hunt without much competition, the end of the summer could be an opportune time. There are plenty of would-be house buyers waiting to purchase at the right price. “We’ve got three years’ worth of pent-up demand, which has been on the sidelines since 2022,” says Raymond James analyst Buck Horne, who covers home builders. straight month in June, according to national S&P CoreLogic Case-Shiller home price index data released Tuesday. Prices nationally rose at their slowest pace since July 2023. A less comprehensive measure of home prices released by the National Association of Realtors showed the median existing-home sale price was about flat in July at $422,400. “For the first time in years, home prices are failing to keep pace with broader inflation,” Nicholas Godec, S&P Dow Jones Indices’ head of fixed income tradables and commodities, said in a statement. American housing wealth has declined over the past year when adjusted for inflation, he said. “Unless rates come down in a meaningful way, and demand starts to snap back, you’re hard pressed to see home prices start to recover any time soon,” says Rick Palacios, Jr., director of research at John Burns Research and Consulting. Buying a home remains expensive. Both home prices and financing costs exceed the prepandemic norm. However, conditions have quietly been brightening for would-be buyers as more sellers list their homes. Home prices nationally could fall as much as 5% from here, Lawrence Yun, the National Association of Realtors’ chief economist, said last week. Lower mortgage rates could help with financing costs. The 30-year fixed rate recently dropped to its lowest level of the year, around 6.52%, following Federal Reserve Chair Jerome Powell’s speech in Jackson Hole on Friday, according to Mortgage News Daily. “A lot of times, this sort of stuff with the Fed doesn’t really hit the mainstream, everyday home buyer for a little bit of time,” says Michael Read, the owner of New Jersey-based Bridgeway Mortgage and Real Estate Services, who says he hasn’t seen a notable change in demand since Friday’s decline. Would-be buyers could find “some prime opportunities” this season, says Realtor.com senior economist Joel Berner. “Inventory is high, prices are steady, and we expect mortgage rates to fall to 6.4% by the end of the year,” he says. “A weak summer homebuying season has many sellers in a position where they’re willing to cut prices.” (Move, which operates Realtor.com, and Barron’s are both owned by News Corp.)",
        "comments": [
            {
                "raw_content": "take a step back and realize how desperate it is to be praying for rate cuts to save the housing market. this is not normal. and it's not going to work out well for any recent FOMO buyer.",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "These realtors and column writers are just desperate to make sales. The fact of the matter is this. Homes have increased 50% in 5 years and it's made them unaffordable for the majority of people. 600k on average almost 7% in my area is roughly a 5k mortgage. And that's with a huge down payment. Nobody can afford that without being house poor. And if they could afford it they bought already.",
                "author": "shyvananana"
            },
            {
                "raw_content": "It's all smoke and mirrors to try and get people to buy the boomers overpriced shit holes.",
                "author": "ShivonQ"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Avocado Toast No More: Struggling Young Renters Forego Restaurants, Skip Meals to Afford Rent",
        "score": 118,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Also the decrease in quality and increase in price at a lot of restaurants makes it pretty easy to eat out way less",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "Towns and counties are losing tax revenue due to High Rent. High rents prevent renters from spending money in the local economy. This causes empty strip malls and hurting local businesses.",
                "author": "locationson2"
            },
            {
                "raw_content": "“Millennials kills restaurants”",
                "author": "TransitionalAhab"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "U.S. single-family rent prices increased 2.9% year over year in June 2025.",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When they say single family are they including 2-4 unit as well or only actual single family? Bc when reports refer to multi family they are usually referring to apartment buildings",
                "author": "RJ5R"
            },
            {
                "raw_content": "Exactly why I bit the bullet and finally bought last January. Renting a comparable house in my area is $400+ more than my mortgage currently.",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "U.S. single-family rent prices increased 2.9% year over year in June 2025. * Single-family rent growth appears to have found its new level at just shy of 3% growth in 2025. ‍ * Rent growth weakened in most large metros in June compared with year-ago growth. New York, Philadelphia, and Los Angeles are exceptions to this trend. ‍ * Monthly growth rates have been above the seasonal trend for nearly every month in 2025. Cotality, a leading global property information, analytics, and data-enabled solutions provider, released its latest Single-Family Rent Index (SFRI) for June 2025, which analyzes single-family rent price changes nationally and across major metropolitan areas. Single-family rent prices in June 2025 increased 2.9% from June 2024, slightly less than the 3.1% average increase a year ago. Single-family rent growth appears to have stabilized slightly under the pre-pandemic average. “Annual single-family rent growth appears to have stabilized just shy of 3% in 2025, approaching the long-run average of 3.4% seen before the pandemic. The monthly growth rate in June was close to the historical average for that month and has been above the seasonal trend for nearly every month of 2025,” said Molly Boesel, Cotality senior principal economist. “While rent growth weakened in most large metropolitan areas in June, exceptions included New York, Philadelphia, and Los Angeles. In Los Angeles, increased rent growth is likely due to the dissipating effects of the January wildfires. The rising rent growth in Northeast markets like New York and Philadelphia could be a spillover effect from the home sales market, where strengthening home prices may be pricing out potential buyers.” Rent prices for high-end properties increased 3.7% year over year in June 2025, a pickup from the year-over-year gain of 3.2% in June 2024. Low-end rent prices increased 1.7% year over year in June 2025, a drop off from the 3% gain in June 2024. Rent for detached rentals grew by 2.6%, and attached rental rates rose by 2.4% in June 2025. Chicago saw the highest rent growth, moving to the top of the SFRI at 5.7% in June 2025. New York-New Jersey-White Plains, NY-NJ dropped to the second spot with rent growth at 5.5%. Philadelphia, Los Angeles, and Detroit round out the top five locations with rent growth. Miami had the lowest rent growth recorded in June 2025 at -0.5%. Dallas moved out of the bottom spot, but only saw rent growth of 0.5%. The next Cotality Single-Family Rent Index will be released on September 18, featuring data for July 2025. For ongoing housing trends and data, visit the Cotality Insights blog: www.cotality.com/insights. (Formerly CoreLogic)",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Overdue mortgage payments by property type",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The FRED Blog has discussed the dwindling supply of multifamily dwellings with 2 to 4 units. This trend even has its own name: the “missing middle.” Today, we tap into newly added data from the Federal Reserve Bank of Philadelphia to offer additional insights into this segment of the housing market. Our FRED graph above shows the share of mortgage balances that are 60 or more days past due, broken down by property type: * single family (solid blue line) * condo/co-op (dotted light blue line) * 2 to 4 units (dashed orange line) * townhouse/planned (dashed-dotted purple line). Quarterly data are available since 2013. Between then and the time of this writing, overdue mortgage payments for multi-family housing with 2 to 4 units have consistently been more frequent than for any other type of residential property. What could explain this pattern? Research coauthored by Raphael Bostic from the Atlanta Fed notes that small and medium multifamily properties are the majority of rental units across the country and also house the largest percentage of the lowest-income households. Disruptions to the flow of rental income—whether from vacancy, nonpayment, or broad economic downturns—are likely to increase the risk of mortgage delinquency.",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Nano Banana is live",
        "score": 789,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ibnaoyrkhdlf1.png?width=640&format=png&auto=webp&s=9d399114be0f588533d46c748bfcbe3153652cde 1# in Lmarena by far 🏆",
                "author": "SnooMaps8212"
            },
            {
                "raw_content": "Sincerely impressed. No other editing model I've tried can do anything remotely like this, especially with this level of quality. https://preview.redd.it/da5jnvykndlf1.png?width=1033&format=png&auto=webp&s=095225a050fb5f8a333ee99025b70d84f1dd9b81",
                "author": "Hopeful-Brief6634"
            },
            {
                "raw_content": "The generation speed is insane. Instant high quality images might not be far off after all.",
                "author": "orderinthefort"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Restoring the first photograph ever taken w/ Nano Banana",
        "score": 994,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Restoring lol. This is a recreation",
                "author": "Weekly-Trash-272"
            },
            {
                "raw_content": "Looks like the rain gutters were recently replaced.",
                "author": "auslake"
            },
            {
                "raw_content": "Enhance",
                "author": "hold_me_beer_m8"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Using nano banana to put Emma Stone in all movies…",
        "score": 121,
        "text_content": "Keep in mind that this all took less than 20 minutes",
        "comments": [
            {
                "raw_content": "Mild boob on the Indiana jones poster. Nice",
                "author": "DarnIGotBannedAgain"
            },
            {
                "raw_content": "You killed two birds with one Stone",
                "author": "Federal_Necessary186"
            },
            {
                "raw_content": "I would definitely watch the Pulp Fiction version.",
                "author": "Drogon__"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google really raised the bar with nano banana, scary how good and accurate it is.",
        "score": 344,
        "text_content": "It even sees and enhances things that most people don’t notice in a picture, like the ‘03’ in the last image. I thought it had just made it up, but in the original picture it’s there but poorly lit 🤯.",
        "comments": [
            {
                "raw_content": "Y’all remember when ai “couldn’t even draw hands”",
                "author": "rafark"
            },
            {
                "raw_content": "I won't mince words: this thing has given me wood. It's the real deal.",
                "author": "Appropriate-Peak6561"
            },
            {
                "raw_content": "The red room!",
                "author": "PokemonTrainerSilver"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Wired: Researchers Are Already Leaving Meta’s New Superintelligence Lab",
        "score": 655,
        "text_content": "https://www.wired.com/story/researchers-leave-meta-superintelligence-labs-openai/",
        "comments": [
            {
                "raw_content": "It’s called “checking out what the competition has and learning they got nothing”.",
                "author": "magicmulder"
            },
            {
                "raw_content": "![gif](giphy|cw77HnPhtnViUFsnWA|downsized)",
                "author": "awesomedan24"
            },
            {
                "raw_content": "So they dont want to work on Russian girl and Step mom.",
                "author": "ProfessionalOwn9435"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Unitree A2 is doing endurance tests w 250kg in this international dog day",
        "score": 695,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's impressive...a lot more than my dog could do!",
                "author": "zorrick44"
            },
            {
                "raw_content": "This is lowkey the GPT4 moment for me. Up to now robots have always been ''oh wow look its almost doing what humans do, its like a clumsy human, we are getting there'' This is the first time i see a robot do something i just couldnt do. Like going from GPT3 being coherent for a few minutes to GPT4 reading 10 scientific papers and condensing the information for you. (The analogy might not be perfect idk, but you know what i mean)",
                "author": "CitronMamon"
            },
            {
                "raw_content": "I like how the humanoid robots are having a rave in the background",
                "author": "talkyape"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Forgive the (AI) Haters",
        "score": 478,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I’m a designer for my own online biz and it’s hard not to be a hater when my old competitors had to at least put in the time to study and learn how to copy me. Now, the low effort dirt bags can rip me off within a day. And those same ppl that would have previously never put in that starting effort and don’t have the originality to come up with their own thing do not have any morals when choosing to compete with you. They just steal. That sucks. Good news like the music video is I do have the originality and taste to stay ahead. The bad news is that I can only be ahead for the amount of time my competitor takes to see my new designs and create a clone of them using AI, lol Oh well, I take it as a sign to aim higher than ever before. I stayed in my lane. What I was educated/self educated to do. Now, I realize I could use AI to do things I have no business being able to do.",
                "author": "elbowpastadust"
            },
            {
                "raw_content": "Id love to hate this, but damn this was good. Kudos. How long did it take and what did cost?",
                "author": "pandi85"
            },
            {
                "raw_content": "Excellent work, OP",
                "author": "Mapkon"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is actually mind blowing, nano banana is incredible.",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "even the bike got its light on Shits amazing",
                "author": "ANTYLINUXPOLONIA"
            },
            {
                "raw_content": "Interesting that it just.. created new people in the background. And the guy on the bike isn’t the same either, his head is tilted. Looking for details obviously so take this with a grain of salt",
                "author": "ArchManningGOAT"
            },
            {
                "raw_content": "Is this free?",
                "author": "Felixon16"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Google's new Gemini 2.5 Flash Image model can do some very impressive high-level image edits",
        "score": 167,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Can someone try to get it to to add another hexagon on top of the third colum in this pattern? I've tried it multiple times now but it can't do it for some reason. It also has trouble rotating it but changing color works very well https://preview.redd.it/sozg88sgwflf1.png?width=484&format=png&auto=webp&s=563ba15f4153e100f9ec21ea4d2142cf3a20a8e7",
                "author": "stopthecope"
            }
        ],
        "subreddit": "singularity"
    }
]