[
    {
        "post_name": "HOW WILL THEY GET HER OUT? \"I just spoke with Tina Peters from her prison cell. What a privilege. What a lady. God bless her. Tina, we are coming for you, M’am.\"",
        "score": 308,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A federal investigation into her PERSECUTION by a corrupt AG and judge.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "If Trump says he’s going to get her out, he’s going to get her out.",
                "author": "Apersonofinterest"
            },
            {
                "raw_content": "God bless this person.",
                "author": "JtBlaze"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WOW 🚨 Santa Monica Place, which is 2 blocks from the ocean, is now at 70% VACANCY “This is one of the most popular tourist destinations in the country — Santa Monica is so screwed” (I want my California and New York back you demons; give em back!)",
        "score": 245,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They create the problems so they have something to run on, the problems are not meant to be solved.",
                "author": "whitman_99"
            },
            {
                "raw_content": ">I want New York back! The best I can offer you is a Muslim mayor who openly supports Hamas, Alvin Bragg reelected in a landslide, and the Islamic \"call to prayer\" being broadcast daily at the 9/11 memorial.",
                "author": "fskfsk"
            },
            {
                "raw_content": "The government is WHY its going downhill. Its a 1950's western, instead of a small town its an entire STATE.",
                "author": "ChyNahAzzWhole1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NPCs love Fauci",
        "score": 1019,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That faggot should have his skull crushed with a sledgehammer.",
                "author": "cjcivicx"
            },
            {
                "raw_content": "The same clown motherfuckers who say MAGA is a cult are the same ones who defend fauci no matter what and take his word as the end all be all.",
                "author": "TheSonOfGadsden"
            },
            {
                "raw_content": "Fauci did worse than the SS did to Jews in WW2. Medical experiments on unwilling, killing 6 million, getting $300 million in royalties while at it.",
                "author": "USDMaga"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: The Hyundai battery plant where 450+ illegals were arrested is the VERY SAME PLANT that Joe Biden promised would provide jobs for the American people. You literally cannot make this up.",
        "score": 1265,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This plant was expected to employee 1,200 people... meaning **40% of it's workforce** were non-American.",
                "author": "9moreyears"
            },
            {
                "raw_content": "\"It's like rain.....on your wedding day.\"",
                "author": "26magarat"
            },
            {
                "raw_content": "Lets not kid ourselves, Trump promised jobs and jobs were provided... jobs to H1's. It is insane to me how our own people don't see what they are doing. I love Trump but Christ is he obsessed just like Elon with these H1 POS and he will bold faced lie about it right to our faces. It's wrong, it's wrong on so many levels but yet people hear and see what they want to even if Trump himself says otherwise. In my opinion this is completely unacceptable. I don't get it, there are so many good actual American workers out there. But people will just say \" Trump isn't doing that,that's not the case\" and move on, even though it is the case. It is the same thing happening in the Countries we make fun of like the UK or Germany. We laugh but our own leader is doing this to us, not even hiding it just using the fact that people will say, \"No, that cannot be true, I heard him say otherwise\". I honestly don't know what to believe anymore when it comes to trusting these people we are supposed to trust. I am completely jaded but if you pay attention,you would be too. Trumps still the best we got but I just don't get this obsession with these damn H1's. Few typos, no big deal, my point stands.",
                "author": "RationalThought"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 JUST IN: Stephen Miller says it's high time to use the military in our OWN hemisphere against cartel narco-terrorists, rather than just the Middle East.",
        "score": 997,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If we wiped out the cartels AND sent all the Mexicans back to Mexico, Mexico might be in the running to be a really great little brother to the United States. Still would need the wall, though.",
                "author": "Couchbeer69"
            },
            {
                "raw_content": "Makes a great deal of sense ... when the govt started sending most all our young guys to other countries to get killed/injured instead of bolstering our defense and keeping them healthy and alive here, it was strategically wrong.",
                "author": "PlantTrees"
            },
            {
                "raw_content": "Canada has the most terrorists. It will have to be done at some point, a rescue/liberation peacekeeping operation to safeguard the few Old Stock Canadians and to ensure the large uranium deposits are not taken by the various terror groups there. Also, it is insane to not have Special Forces patrolling every land border. Why have an army if they are not used to stop an invasion? Just through Maine, India and China cartels are walking over the border from Canada, plus plenty of Middle East and Central Americans. If it is so bad there, imagine how much is happening at the Washington and BC border to the west.",
                "author": "magnokor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Evidence growing that OTHER Federal Reserve governor that was forced out, Adriana Kugler, was ALSO running the “Primary Residence” scam, in which ultra wealthy HOUSE HOARDERS get low rate FHA loans by LYING (referred to as Occupancy Fraud).",
        "score": 961,
        "text_content": "",
        "comments": [
            {
                "raw_content": "OCCUPANCY FRAUD: https://www.investopedia.com/terms/o/occupancyfraud.asp. You really have to hand it to these scum. They ruin the housing market for every American citizen, and then they actually CHEAT and use the programs designed to help lower income people to line their own pockets at the same time. THEY ARE CRIMINALS (literally).",
                "author": "flp999"
            },
            {
                "raw_content": "Since 2008 and the plandemic you see a lot of people running fraud schemes. Nothing has felt right since those two events which is why those that are actual business owners, or work hard for a living as salary/wage can tell this entire economy is a house of cards built on deceit. Worse is they flaunt their crimes openly and this teaches the wrong lesson with younger generations on social media. President Trump and his administration need to come down hard on these fraudsters to restore trust.",
                "author": "GA_Logic"
            },
            {
                "raw_content": "Now you know why the swamp keeps screaming \"Fed independence!\" They don't want anyone looking inside to find fraudsters running the Fed. Investigate all members of the Fed!",
                "author": "McFatty7"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "PBS is now cutting 15% of their entire workforce, citing the loss of $500 MILLION in federal funding, thanks to Trump. This leftist propaganda outlet is circling the drain.",
        "score": 1096,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Taxpayers funding propaganda am shocked 😲",
                "author": "Texasnumber1"
            },
            {
                "raw_content": "I mother fucking voted for this. Get fucked, PBS.",
                "author": "ERIC_CIARAMELLA"
            },
            {
                "raw_content": "https://x.com/nicksortor/status/1963985711062794377",
                "author": "Mr_Rightside"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Omg. A reporter just told Trump that there’s a blue tent out front of the White House used by radical leftists and Trump turned to the Secret Service and told them to get rid of it. “TAKE IT DOWN! Today — right now! … Lafayette Park. Take it down!”",
        "score": 1440,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There's also a building in Atlanta full of communist faggots that needs to be taken down. It has the letters C-N-N on the front of it.",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "LOL...Love This Man!",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "With so many democrat terrorists lately it's a national security issue.",
                "author": "TrumpAndGodWin"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING 🚨 Donald Trump just gave orders from the Oval Office to his General to SH00T DOWN any Venezuelan Jets flying above our Warships I STRONGLY SUPPORT THIS LET’S GO 🔥",
        "score": 1194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I voted for the FAFO Doctrine and I'll do it again",
                "author": "killedmytv"
            },
            {
                "raw_content": "That wasn’t an order. It was a delegation of authority to commanders.",
                "author": "Bldg_2019"
            },
            {
                "raw_content": "There are Venezuelan jets?",
                "author": "PastorCharles"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The NFL just won’t stop shitting on America.",
        "score": 668,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm not watching some faggot commie humiliation ritual. Why do we need to see this? Just stop watching.",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Needed Context: The game tonight is being played in Brazil. Thus....brazil style musical us anthem",
                "author": "Barron_FromTheFuture"
            },
            {
                "raw_content": "I bet 95% of the faggots in here watch this shit. Trump watches this shit. Why even complain? I don't watch it. Stop posting NFL shit on this website.",
                "author": "TrumpIsTheVictor"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: The Trump Department of War has ordered a squadron of F-35 stealth fighter jets to the Caribbean to take on drug cartels, per Fox News Trump isn’t f***ing around! These cartels kiII COUNTLESS Americans every year. It’s time for our military to step in 🇺🇸",
        "score": 1121,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Democrats will be losing money.",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "Mr President, make sure you get every one of those F-35 kills on video. I want entertainment material for months. Thank you for your attention to this matter.",
                "author": "DJT4MoreYears"
            },
            {
                "raw_content": "Kinetic action against the cartels is just about the only kinetic action I would support. Everyone knows someone these cartels have affected with their poison and crime",
                "author": "Corse46"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "O’Keefe: FBI Official Escorted Out of Building After Release of Undercover Video of DOJ Official Admitting Government will “Redact Every Republican” While Leaving All “Democrat People” on Epstein Client List",
        "score": 813,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Protecting Republican pedophiles is not a good look.",
                "author": "DeplorableCentipede"
            },
            {
                "raw_content": "He didn't admit shit, he was gossiping based on shit he read on the internet. Fucking retards.",
                "author": "dontdisrespectpotus"
            },
            {
                "raw_content": "A FBI officer in DC is most likely a raging leftist.",
                "author": "Geralt_of_Rivia1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE has just informed Kilmar Abrego Garcia he will now be deported to the small African country of ESWATINI",
        "score": 1154,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I'm so sick of hearing about this random piece of shit elevated to martyrdom by leftist media clowns.",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": "Garcia and other gangsters like this that act hard but can’t deal with consequences are silly little faggots",
                "author": "cussword"
            },
            {
                "raw_content": "Just get him the fuck out of the country so I never have to hear this sum-bag's name again!! I don't give a shit where we send this fuck.",
                "author": "Kermit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 MASSIVE NEWS: The Trump Administration has found over 22 THOUSAND missing migrant children who were allowed to be trafficked in under Joe Biden.",
        "score": 1357,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Most anti-traffic, anti-pedo president ever. THIS, above all else.",
                "author": "MericaFukYeah"
            },
            {
                "raw_content": "Watch the libtards whine that they are only doing it to get 22000 Republican votes.",
                "author": "DJT_is_King"
            },
            {
                "raw_content": "> The Trump Administration has found over 22 THOUSAND missing migrant children who were ~~allowed to be~~ trafficked ~~in under~~ ***by*** Joe Biden. --FJB FTFY. And this is not even a 10% recovery rate.",
                "author": "barwhack"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nature Is Healing: Gen Z Boys Are Not Just Right-Leaning, They're More Skeptical of 'Gender Equality' Too",
        "score": 743,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Without the propaganda from teachers and media, everybody would be more *right leaning*.",
                "author": "HappyFunBall"
            },
            {
                "raw_content": "A lot of the girls really don't like the fag shit either.",
                "author": "Coprolite"
            },
            {
                "raw_content": "If their parents or grandparents are 80s kids, now is their opportunity to remember how things were. Crocheting, fishing, barbecues, building, and more ... Being human and just being together. Social media be damned.",
                "author": "Ice_Joker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Keep 'em coming",
        "score": 921,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"Those who would give up essential memes for a little temporary safe space, deserve neither memes nor safe spaces.\"",
                "author": "OutlawPurpleHairDye"
            },
            {
                "raw_content": ">\"The problem with quotes on the internet is that you can't always be sure of their authenticity\" - Abraham Lincoln",
                "author": "DT170x"
            },
            {
                "raw_content": "\"You must post the meme you wish to see in the world.\" Mahatma Pepe",
                "author": "Mamapedia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "\"Come on you pedes, you want to live forever?!",
        "score": 837,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If I wasn't old and half crippled, I would Young guys, get to it",
                "author": "Sea_Still"
            },
            {
                "raw_content": "Excellent memetics! We got good memes. *pepe in the sweeney jean outfit*",
                "author": "permissible_missile"
            },
            {
                "raw_content": "Friendly reminder that Ben Domenech co-founded The Federalist, is a big fan of Henry Luce, and is married to Meghan McCain",
                "author": "IncredibleMrE1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The FBI has now located or identified 770 missing children and made 6,300 arrests as part of Operation Summer Heat, per FBI Deputy Director Bongino. The FBI is laser focused on recovering the children who went missing under Joe Biden’s watch. Pray for these kids. 🙏🏻",
        "score": 1354,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How many pedos will be released by like minded judges and WILL WE be Told?",
                "author": "ChyNahAzzWhole1"
            },
            {
                "raw_content": "It's hard for me to wrap my mind around the evil.",
                "author": "Belleoffreedom"
            },
            {
                "raw_content": "770 out of 300,000 .... The arrests are good though.",
                "author": "24601"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨#BREAKING: Watch as Speaker Johnson revealed that President Donald Trump was an FBI informant in an effort to take Epstein down",
        "score": 1180,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Trump was the original Epstein whistle blower",
                "author": "Salty_Sailor"
            },
            {
                "raw_content": "If Trump says it I'll believe it. I don't believe anything out of rat Johnson's mouth.",
                "author": "perma-maga"
            },
            {
                "raw_content": "Some of us 'tards have known this for years. Trump was the one who contacted the FBI many years ago when Epstein was hitting on underage girls at Mar-a-Lago. The FBI at the time said Trump was the only one willing to talk to them about Epstein. ?Y'all really didn't know this already?",
                "author": "Cuetardian"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH: Texas troopers arrest previously deported Mexican smuggling 11 illegal immigrants in Webb county",
        "score": 966,
        "text_content": "",
        "comments": [
            {
                "raw_content": "If you shoot him dead he will not re enter",
                "author": "CCGJoe"
            },
            {
                "raw_content": "Why are they even still trying to come here?",
                "author": "LogicCircuits"
            },
            {
                "raw_content": "CONTEXT: On Sept. 3, 2025, just after 8:00 a.m., a DPS Trooper attempted to conduct a traffic stop on a white 2003 Ford F-250 for a traffic violation near Santa Ursula Avenue in Laredo, Texas. The driver failed to stop, and a high-speed vehicle pursuit ensued. The vehicle came to a stop, and several passengers started to flee on foot. With the assistance from the DPS Brush Team and Border Patrol, 11 illegal immigrants were located and apprehended. During the investigation, DPS learned that the driver, Nicolas Alejandro Ramirez Reyes, 24, of Nuevo Laredo, Mexico, was arrested by the U.S. Drug Enforcement Administration (DEA) in 2022 for marijuana distribution. In 2024, after serving 24 months in prison, he was removed by U.S. Immigration and Customs Enforcement (ICE). Ramirez Reyes was arrested and charged with smuggling of persons and evading arrest. He was transported to the Webb Co. Jail with an ICE detainer as a deported criminal/aggravated felon. All 11 illegal immigrants, also from Mexico, were referred to Border Patrol. (TXDPS / News release)",
                "author": "PiratePatriotParrot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Europe’s most powerful supercomputer comes on-stream in Germany",
        "score": 122,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sweet nothing of an \"article\" without a lick of mention of the actual hardware",
                "author": "996forever"
            },
            {
                "raw_content": "What does on stream even mean? We can watch a live-feed of the racks on Hulu?",
                "author": "Mateorabi"
            },
            {
                "raw_content": "Such a long article and no information about what is in it. Just the usual marketing jargon that says nothing.",
                "author": "ConsistencyWelder"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GIGABYTE AI TOP CXL R5X4 Card Adds 512GB Memory to Xeon and Threadripper Systems",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Would this have the same latency as in slot ram?",
                "author": "upbeatchief"
            },
            {
                "raw_content": "So you gotta buy a $2000-$3000 card for the ability to add on up to 512GB? That's a damn high price for an over glorified adapter. But then again CXL is \"new\" so they can get away with it. If CXL is gonna be part of future computers, they better bring that price down.",
                "author": "No-farts"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Cooler Master RTX 5080 OC Review - OC3D",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I just found out cooler master made a graphics card.",
                "author": "MahaloMerky"
            },
            {
                "raw_content": "I do agree with their take that it would be good if AIBs switched to the standard 120mm format and allowed anything to be fared in their housing.",
                "author": "Jeep-Eep"
            },
            {
                "raw_content": "Gpus are only going to Get bigger might as well embrace 120mm fqns now",
                "author": "upbeatchief"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "GPD confirms Win 5 global release plans with 128 GB RAM variant in doubt",
        "score": 66,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You know what else can have 128GB RAM and be on the edge of being considered portable? A gaming laptop. I just don't see the point of a handheld that doesn't have an internal battery and will need to be docked anyway for comfortable usage.",
                "author": "blackbalt89"
            },
            {
                "raw_content": "This is the Strix Halo \"Handheld\" GPD is developing As a reminder, Strix Halo's specs: 8c 16t or 16c 32t Zen-5 with 5Ghz max boost clocks 32/40CU Radeon 8060S iGPU (RDNA3.5) 60W TDP 32Gb/64Gb LPDDR5X (128GB if launch goes well) 1/2/4TB SSD storage No internal battery, but it comes with a big external battery that you can connect with a cable to the \"handheld\" (it can clip onto the back of the device) Conclusion: On paper, this handheld crushes Lunar Lake in raw performance, but it doesn't have an internal battery, it's likely to have loud fans (throttling and heat?) and I don't think battery life will be good. Maybe we can see more practial big APU handhelds with Medusa Halo and Nova Lake-AX The 12Xe3 core (equal to 24CU) Panther Lake-H SKU is also an exciting product, as it's much bigger than the 8Xe2 core iGPU on LL while also being a practial handheld chip.",
                "author": "SherbertExisting3509"
            },
            {
                "raw_content": "Hello SherbertExisting3509! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "OpenAI set to start mass production of its own AI chips with Broadcom",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "So can someone explain to me how the Broadcom + Google/Open AI semicustom business works? Do the separate companies work on different blocks of IP on the chip, like the Mediatek + Nvidia collaboration? Does Open AI develop the compute chips but use Broadcom for the networking?",
                "author": "Geddagod"
            },
            {
                "raw_content": "https://archive.is/20250905032053/https://www.ft.com/content/e8cc6d99-d06e-4e9b-a54f-29317fa68d6f#selection-1885.0-1885.69",
                "author": "Consistent-Theory681"
            },
            {
                "raw_content": "I've been wondering how an engineering company like Nvidia without any physical assets (fabs) can survive AGI/ASI. I think stories like these are the canary in the coal mine. I'd be nervous buying Nvidia at any more than 10x next year's projected earnings; it's currently priced at 40x. *(shakes head incredulously)*",
                "author": "LingonberryGreen8881"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Jarrod's Tech - RTX 5070 vs RTX 4070 - 25 Game Laptop Comparison",
        "score": 15,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Refurb 4070 laptops are going for much lower and comes with warranty Wouldnt get a 5070 laptop unless prices are close and you need the newest cpu",
                "author": "LuluButterFive"
            },
            {
                "raw_content": "Rather strange conclusion at the end, I've not noticed previous gen laptops going up in price as they try to clear stock. 4080 laptops can be a very good value right now because of this especially compared to the 5070Ti current gen models. The tl;dw of it is that they're so similar it makes next to no difference and the 4070M is a good buy if you can handle an 8GB laptop GPU and find one on clearance.",
                "author": "shugthedug3"
            },
            {
                "raw_content": "Dang I love the design of these legion laptops lol, at least from the aesthetics POV",
                "author": "Geddagod"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Costco said F supply shortages",
        "score": 373,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who said there were shortages?",
                "author": "GreenJuicyWatermelon"
            },
            {
                "raw_content": "Theres a shortage? Tons where i am no issue finding many",
                "author": "xkinato"
            },
            {
                "raw_content": "Dude it’s September no one is still talking about shortages",
                "author": "charizard_72"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Basic reading ability is needed to enjoy this game",
        "score": 293,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/9qvlzzvs2gnf1.jpeg?width=500&format=pjpg&auto=webp&s=8db419e3eeff04ab69e107de74fdb6727fe60999",
                "author": "Mayoo614"
            },
            {
                "raw_content": "Gen 1 Pokémon games had this written on the back of the box",
                "author": "BrattyTwilis"
            },
            {
                "raw_content": "Unplayable for half of reddit",
                "author": "MunkyAU"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Silksong performance on switch 2 is amazing",
        "score": 554,
        "text_content": "You can choose between 4k 60fps or 1440p 120fps when docked and when playing handheld it’s 1080p 120fps",
        "comments": [
            {
                "raw_content": "Now i'd just wish they'd update the original for 120 hz.",
                "author": "jcwkings"
            },
            {
                "raw_content": "It runs like a dream on OG as well",
                "author": "Salt-Cow-7873"
            },
            {
                "raw_content": "It's a 2D sidescroller I hope the performance is good",
                "author": "SaltyATC69"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Got new switch 2 game",
        "score": 266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How is it buddy? Mine arrives tomorrow which is sad because I ordered through Game Collection and they are usually great.",
                "author": "FirstManufacturer648"
            },
            {
                "raw_content": "I can’t decide if I want it here or on ps5 😭 To answer everyone’s question- I have a newborn at home and a 5 year old. So the easy use of the switch is amazing, and I don’t mind the degraded graphics. But I also know I really appreciate seeing great atmospheric graphics, and it *does* add something to the experience for me.",
                "author": "qaasq"
            },
            {
                "raw_content": "Delayed in the US physically till Oct 21",
                "author": "BobaF4t"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "It’s been 3 months since the Nintendo Switch 2 was released",
        "score": 96,
        "text_content": "3 months since launch, since Mario Kart World, since the hibernation of the water buffalos, since the new generation of Nintendo. Kind of crazy how fast time is flying by because the console feels maybe a month old at most",
        "comments": [
            {
                "raw_content": "Holy crap 3 months already?!?! Feels like it was last month max. I haven't even finished DK Bananza yet... which is about to be 2 months old 😬 Hopefully I can get more gaming time soon.",
                "author": "Symys"
            },
            {
                "raw_content": "Looks like it's more than that to me but probably it's bc i don't think i've spent even a day without playing at least 20 minutes on mine.",
                "author": "Unhappy_Gazelle392"
            },
            {
                "raw_content": "I finally snagged one. Sold the oled. The larger size and spec bump was exactly what I’ve been waiting for. I’m playing Bananza and Discounty now. No man’s sky and maybe silksong once I finish bananza.",
                "author": "juicebox03"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "This is actually quite impressive for both games",
        "score": 968,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hope Outlaws pave the way for more high quality ports.",
                "author": "linkling1039"
            },
            {
                "raw_content": "Wow, ubisoft scoring a few bucks on nintendo. Hope they use it to get us more ports",
                "author": "3LapRacer"
            },
            {
                "raw_content": "Side note: No Man’s Sky is a steal at that price. If you like farming stuff and base building, it’s a great time.",
                "author": "Harrel5on"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Wanted to give the subreddit an early Halloween spook with some of my library...",
        "score": 132,
        "text_content": "I also have Cyberpunk, DK Bananza, and Fantasy Life i....but those wouldn't help here lol",
        "comments": [
            {
                "raw_content": "I don’t get it",
                "author": "Iamverydumbazz"
            },
            {
                "raw_content": "How does path of the goddess run? Played a bit on game pass and seemed really good but it got took off before could get very far, tempted to get it on switch 2",
                "author": "Bloodstarvedhunter"
            },
            {
                "raw_content": "you're gonna scare someone with all those keycards",
                "author": "Possible-Potato-4103"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Star Wars Outlaws Switch 2 - DF Review - A Ray Tracing Revelation & An Extraordinary Port",
        "score": 266,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Tldr Handheld : dynamic 540p to 1080p (dlss) Docked : dynamic 720p to 1440p (dlss) Image resolution is pretty good Handheld mode has lower details as to be expected Both modes run at a locked 30 90% of the time. With handheld mode utilizing vrr",
                "author": "soyuz_enjoyer2"
            },
            {
                "raw_content": "This is the first game on Nintendo Switch 2 to utilize ray tracing. Outlaws also runs at 1440p (DLSS) with RT enabled and it’s open world. That’s insane. This is the first game to really utilize the Switch 2’s graphical features set. Not even a single first party game has done this yet.",
                "author": "ApprehensiveLuck4029"
            },
            {
                "raw_content": "As much as Ubisoft has made a lot of games with bloat, this port is definitely one of their better ones",
                "author": "foxwhisper85"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "SwitchForce hints at 3 mysterious '7' games for the next Nintendo Direct",
        "score": 149,
        "text_content": "https://youtu.be/WatiXt5eu-s?si=vs_wxio-kDkkY0VP My guesses are Call of Duty: Black Ops 7, Final Fantasy 7: Rebirth and Ace Attorney 7.",
        "comments": [
            {
                "raw_content": "I’m guessing one of them is Yakuza: Like a Dragon",
                "author": "Different-Aspect-449"
            },
            {
                "raw_content": "If ace attorney 7 gets announced at the direct I will eat a mario amiibo that came bundled with mario party 10",
                "author": "thisSubIsAtrocious"
            },
            {
                "raw_content": "GTA 7",
                "author": "Wassersammler"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bethesda teases next Starfield dlc at the end of their anniversary post - possibly named Terran Armada",
        "score": 436,
        "text_content": "https://nitter.poast.org/StarfieldGame/status/1963980745728229522#m",
        "comments": [
            {
                "raw_content": "Striking while the iron is ice cold",
                "author": "4000kd"
            },
            {
                "raw_content": "For a game that i thought most people would have rated a 7/10, Starfield seems to get a lot vitriol every single time it’s even mentioned on Reddit.",
                "author": "Thin-Fig-8831"
            },
            {
                "raw_content": "I’m normally Bethesda obsessed but man did Starfield not stick.",
                "author": "kyutek"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Some publishers using Switch 2 GCK instead of 64 GB cartridge due to poor performance rather than cost",
        "score": 634,
        "text_content": "Per Ubisoft dev >Snowdrop relies heavily on disk streaming for its open world environments, and we found the **Switch 2 cards simply didn’t give the performance we needed at the quality target we were going for**. I don’t recall the **cost of the cards** ever entering the discussion - probably because it **was moot**. https://bsky.app/profile/cubusaddendum.bsky.social/post/3lxzsvi6s7c2e Looks like people went digging and found the Switch 2 cart uses eMMC and is thus limited to 400 MB/s. > • Game Card 2 communicates with SoC via eMMC standard. eMMC’s max data transfer rate, hence the Card too, is 400MB/s https://bsky.app/profile/ninpatentswatch.bsky.social/post/3lwgdn433kc27",
        "comments": [
            {
                "raw_content": "That is less than a SATA SSD that are usually around 500-550 MB/s.",
                "author": "gutster_95"
            },
            {
                "raw_content": "what does GCK abbreviate to?",
                "author": "scottishdrunkard"
            },
            {
                "raw_content": "People doubt this but Digital Foundry's MKWorld video showed that cartridge takes much longer to boot the game up. Cyberpunk on cartridge had minimal differences but they were still there. I wondered when that would come to a head with developers and it seems we have our first case. MicroSD Express seems to have the best load times, more than internal storage.",
                "author": "DemonLordDiablos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Bend Studio's Next Game Appears To Be Another Live Service Project",
        "score": 207,
        "text_content": ">Over the past six years, the developer has worked on multiple unannounced projects, all of which were subsequently canceled. We discovered that Bend Studio is hiring for an unannounced AAA project they’re working on. Interestingly, one of the requirements for the position mentions experience with multiplayer games. Source: https://tech4gamers.com/bend-studio-hiring-multiplayer-game/",
        "comments": [
            {
                "raw_content": "I mean, they could just have a multiplayer aspect in the game. It doesn't necessarily mean it's live service. But I wouldn't be surprised...",
                "author": "edwardex"
            },
            {
                "raw_content": "I'd be shocked if Bend Studios is still around in a few years... How many disappointments / failed projects can one studio have before Sony pulls the plug?",
                "author": "MuptonBossman"
            },
            {
                "raw_content": "It wouldn’t surprise me. I think there’s a bunch of high quality developers out there that have maybe been working on live service titles for around about 3-5 years (so really since Covid) and were doing so in a response to change in gaming. Live service titles were showing massive growth so you can see why they’d go all in on them. The problem is that the landscape has shifted *again* to live service titles being such a hard market to break into unless you catch people’s attention straight away. So now we’re getting the backend of a bunch of games that have been developed for years and have literally no audience for, just look at Concord and the Suicide Squad game. To an extent you can probably see why naughty dog chose to scrap Factions and focus on single player stuff - they said themselves that you have to be all in on the multiplayer stuff or else it just won’t work.",
                "author": "RJK26"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Lenovo's most powerful AI / CAD laptop adopts USB-C charging: ThinkPad P16 Gen 3 launches with Nvidia RTX Pro 5000 and 192 GB RAM",
        "score": 63,
        "text_content": "Another addition to the Arrow Lake HX lineup",
        "comments": [
            {
                "raw_content": "And nothing for the sad state of amd mobile despite it being five years since they first had competitive mobile socs lmfao",
                "author": "996forever"
            },
            {
                "raw_content": "So they're effectively removing one of the USB-C ports because one of them has to be used for charging.",
                "author": "skizatch"
            },
            {
                "raw_content": "Need 512gb ram for mainstream",
                "author": "Icy_Captain_1037"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "ASUS confirms JEDEC DDR5-7200 specs support for Intel 800-series motherboards",
        "score": 52,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is probably what the refresh is going to support, so they've updated it now.",
                "author": "Professional-Tear996"
            },
            {
                "raw_content": "So Intel has managed to raise JEDEC support for Arrow Lake. Let's hope they have managed to fix the L3 speed as well",
                "author": "Noreng"
            },
            {
                "raw_content": "Intel has always been killing it with their memory controllers. I am hopeful that Nova Lake will have 8000 as JEDEC",
                "author": "input_r"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "OneXPlayer X1 Air with Intel Core Ultra 200V goes up for preorder at $1099, supports new Mini-SSDs",
        "score": 19,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's great to see more OEM is using Intel chip for handheld, usually it just MSI. Amd has been monopoly integrated GPU gaming for too long, it makes them lazy and greedy, the Z2E is still using rdna 3.5 the same architecture as Z1E. Amd Z2 Go is even worse, the GPU actually based on radeon 680M which is too outdated, this is why Lenovo Legion Go S got negative review because the chip is way too underpowered for current title. I hope Intel keep kicking Amd in the butt with more powerful iGPU, they can take Amd handheld marketshare with Panther Lake + Arc Xe3.",
                "author": "no_salty_no_jealousy"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "A potentially* UNRELEASED unknown model EVT Prototype AMD graphics card has been found by my friend. What model is it? And what do we do with it?",
        "score": 383,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[https://www.techpowerup.com/gpu-specs/radeon-ai-pro-r9700.c4290](https://www.techpowerup.com/gpu-specs/radeon-ai-pro-r9700.c4290) workstation oriented RX9070XT with 32GB VRAM",
                "author": "maze100X"
            },
            {
                "raw_content": "where do one find these things? I've looked under my sofa cushions but there's only loose change and lint.",
                "author": "pesca_22"
            },
            {
                "raw_content": "GamersNexus would probably buy it from you",
                "author": "LeeKapusi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire launches Radeon RX 9060 XT Black Diamond graphics card",
        "score": 46,
        "text_content": "",
        "comments": [
            {
                "raw_content": "...I'm sure some people will appreciate this aesthetic.",
                "author": "Middcore"
            },
            {
                "raw_content": "Hopefully it will be world-wide available. I don't like the red accent they have for their Sapphire Pulse. Spec wise it looks similar, but with a bigger/longer heatsink and 3 fans instead of two.",
                "author": "Suikerspin_Ei"
            },
            {
                "raw_content": "Looks Deus Ex-ish. The new ones",
                "author": "Aggravating-Dot132"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Minisforum shows off G1/G7 Pro Gaming SFF PCs and MS-S1 MAX with Strix Halo",
        "score": 1,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What is interesting to me is that whenever they make a mini PC with an Nvidia dGPU option they make it thin like a laptop, so that it has worse cooling. Only then they do that, this basically never happens with AMD only options. There has to be some reason for that.",
                "author": "RCFProd"
            },
            {
                "raw_content": "If only minisforum provided AGESA updates (why? CVE mitigations of course!), else it’s a massive waste of effort and money and enabling lazy OEMs dump unsupported products on the market",
                "author": "gaseousgalaxy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Mortgage rates see biggest one-day drop in over a year",
        "score": 113,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This helps those who dated the rate but not those still looking to buy as prices are still over inflated in many areas.",
                "author": "UnimaginativeRA"
            },
            {
                "raw_content": "Prices are the problem",
                "author": "Greedy-Setting2507"
            },
            {
                "raw_content": "Date the rate folks were getting mocked last week",
                "author": "IhaveAthingForYou2"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Mortgage Demand is 34% below pre-pandemic norms, 55% below the pandemic peak and lower than 2008-2012 crash",
        "score": 195,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Money printer is about to go brrrrrrrrrrrrrr",
                "author": "curtaincaller20"
            },
            {
                "raw_content": "Rates going to start tumbling",
                "author": "regaphysics"
            },
            {
                "raw_content": "Who needs one with all this political and economic uncertainty and nothing worth buying.",
                "author": "Dry-Interaction-1246"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fed Gets Green Light for Interest Rate Cuts as Unemployment Rate Jumps to 4-Year High",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just wait until the Federal job cuts actually start hitting the numbers. A few more months for that.",
                "author": "Fuckaliscious12"
            },
            {
                "raw_content": "Let me summarize: \"Unemployment is up so this gives the Fed a reason to lower rates.\" Nice try, NAR. Who wants to buy a house when they don't know if they'll have a job tomorrow? Dust off the Only Fans account, Becky.",
                "author": "Likely_a_bot"
            },
            {
                "raw_content": "nothing ever happens",
                "author": "Pumpkin-Main"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Big drop in mortgage rates today on weak job data. Down -0.16 today to another new year low at 6.29%",
        "score": 166,
        "text_content": "10 yr fell hard after another jobs report miss. 30 yr mortgage saw another big decline and closer to the 5% range. Now at 6.29%, 15 yr mortgage already at 5.60% https://www.mortgagenewsdaily.com/mortgage-rates",
        "comments": [
            {
                "raw_content": "Just in time for the nicer, overpriced homes that sat on market during the summer to be pulled and relisted in the spring for an even higher amount.",
                "author": "cusmilie"
            },
            {
                "raw_content": "Locked in my rate yesterday… feelsbadman",
                "author": "SaintMarinus"
            },
            {
                "raw_content": "However, the 75 year old Boomer nests with 30 years of deferred maintenance are still overpriced by 50%.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "This market. Dying",
        "score": 32,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's an ugly house that needs updating, and yet they're asking top dollar at $410k north of Baltimore. The house was purchased for $275k well before COVID, and they likely refinanced when rates dropped. So even at a lowball price, sellers will make $140k+, but they gotta stop being so GD greedy. If they price it at $350k for a quick sale, it'd be gone. But I'm sure the seller has a number in their head and has spent the profits already, so they don't want to drop the price.",
                "author": "fatfiremarshallbill"
            },
            {
                "raw_content": "I like how she's mad at buyers for not liking her shitty lot.",
                "author": "FistsFullofSteal1"
            },
            {
                "raw_content": "He is so perplexed, yet every time someone tries to enlighten him, he gets defensive. The problem is delusion. In areas that I have been looking at, people have doubled the price they paid in 2022.",
                "author": "redshering"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "10-year Treasury yield slides to lowest level since April after weaker-than-expected jobs report",
        "score": 88,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Mortgage rates likely going to hit another new low for the year today…",
                "author": "SnortingElk"
            },
            {
                "raw_content": "To be clear, this is bullish for housing",
                "author": "zer0sumgames"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Stocks rise to record highs as traders bet latest jobs report will push Fed to cut rates",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well this already aged poorly.",
                "author": "SpiritedPlantain4127"
            },
            {
                "raw_content": "I never get stock prices going up on such bad economic news. Recession incoming, I have a great idea, let’s pump money in to the stock market.",
                "author": "Justice-939"
            },
            {
                "raw_content": "Casino Capitalism",
                "author": "grepsockpuppet"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Payrolls rose 22,000 in August, less than expected in further sign of hiring slowdown",
        "score": 67,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Sounds about right, my job has been on a hiring freeze for almost a year now",
                "author": "Responsible_Knee7632"
            },
            {
                "raw_content": "great news everyone, we're losing jobs. the housing market is saved!",
                "author": "sifl1202"
            },
            {
                "raw_content": "Every stupid thing that happened during the pandemic needs to be corrected.",
                "author": "Likely_a_bot"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Anthropic: Paying $1.5 billion in AI copyright lawsuit settlement",
        "score": 788,
        "text_content": "https://apnews.com/article/anthropic-copyright-authors-settlement-training-f294266bc79a16ec90d2ddccdf435164",
        "comments": [
            {
                "raw_content": "*\"Hey investors, we're going to need another $1.5 billion.\"*",
                "author": "Deciheximal144"
            },
            {
                "raw_content": "Importantly, this is about pirating books and training on them, not just about training on copyrighted material itself. Huge difference. If you had to pay to train a model on copyrighted material, it would mean you couldn't even scan and train on public facing, free websites if the works on those websites were copyrighted. On the other hand, pirating books is already illegal, whether you use them to train an AI model or not",
                "author": "garden_speech"
            },
            {
                "raw_content": "I'm just glad someone finally bought my mixtape",
                "author": "ARunOfTheMillPerson"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI says it will burn $115 billion through 2029, $80 billion higher than it projected earlier this year",
        "score": 146,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Oh shit lmaooo",
                "author": "Sensitive-Chain2497"
            },
            {
                "raw_content": "It will go up even more",
                "author": "ethotopia"
            },
            {
                "raw_content": "That is the only way to compete against google/msft/apple/meta",
                "author": "imlaggingsobad"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Two New Stealth Models",
        "score": 174,
        "text_content": "",
        "comments": [
            {
                "raw_content": "\"maximally intelligent\" elon-y speak",
                "author": "Far-Telephone-4298"
            },
            {
                "raw_content": "This is the custom system prompt it was given: You are Sonoma, built by Oak AI. You are Sonoma Sky Alpha, a large language model from an unknown provider. Formatting Rules: - Use Markdown **only when semantically appropriate**. Examples: `inline code`, ```code fences```, tables, and lists. - In assistant responses, format file names, directory paths, function names, and class names with backticks (`). - For math: use \\( and \\) for inline expressions, and \\[ and \\] for display (block) math.",
                "author": "ThunderBeanage"
            },
            {
                "raw_content": "its grok, by my tests with offensive jokes it does exactly like grok. dusk looks like a non-reasoning model because it starts responding right away, while sky takes time before answering puzzles, so its a reasoning one. both are very fast, i think faster than base grok4, so my bet is: dusk = grok4-mini and sky = grok4-mini-reasoning",
                "author": "PassionIll6170"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Computer scientist Geoffrey Hinton: ‘AI will make a few people much richer and most people poorer’",
        "score": 489,
        "text_content": "No paywall [https://archive.ph/ifSwh#selection-1889.0-1889.18](https://archive.ph/ifSwh#selection-1889.0-1889.18)",
        "comments": [
            {
                "raw_content": "That's kind of what has already been happening in general under capitalism with the increasing wealth gap. I guess AI will probably accelerate that.",
                "author": "CRoseCrizzle"
            },
            {
                "raw_content": "I guess this is him when he says “I’m more optimistic now”",
                "author": "Beeehives"
            },
            {
                "raw_content": "no one played god, created our lands, forests, lakes, oil and salts and during the time, when our castles where built no living person contributed towards their existens - neiter in the good (via great ideas or hard work) nor in the bad (through things like slavery) - we weren't even alive at that time we tax money transfers, where the receiver contributes towards society extreme ... while having a low or even zero tax towards transfers without personal contribution to society i hire a human, to screw a nail into a object ... i put extreme tax onto the humans time i hire a robot, to screw the same nail into the same object ... zero tax those who own get richer ... those who don't ... well, we can be happy, if our hard faught rights won't get rewoked overnight ... the first signs of it are already visible in the so called \"leader of the democratic world\" ... where people get deportet without trial and presidents stopped caring about laws \\#pull out the medieval-feudalistic roots of our system and the problem could be solved",
                "author": "Sierra123x3"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Andrej on 5-Pro",
        "score": 347,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The “problem” with these models is you really need to do homework upfront. I’ll often give thinking my raw data, what I’m looking for, my concerns and have it format and optimize for pro. But you still have to collect that data, think through the goal and make a target output.",
                "author": "trashtiernoreally"
            },
            {
                "raw_content": "o1-pro, o3-pro were really really good, but I never felt the need to pay $200 again after trying them for one month. This is not the case with 5-pro, and I will be renewing.",
                "author": "NutInBobby"
            },
            {
                "raw_content": "bbbbbut 4o is is is much better i swear 🤬",
                "author": "SatouSan94"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Big Tech elite lavish praise on Trump at White House dinner",
        "score": 57,
        "text_content": "https://www.wired.com/story/tech-ceos-donald-trump-white-house/ https://people.com/trump-soaks-up-tech-ceo-praise-white-house-dinner-11804202 https://finance.yahoo.com/news/meet-33-silicon-valley-power-144226245.html https://www.axios.com/2025/09/05/trump-tech-dinner-ceo-zuckerberg-musk Embarrassing to see people like Tim Cook, Bill Gates, Mark Zuckerberg, Sam Altman, Satya Nadella, Sundar Pichai sucking up to Trump.",
        "comments": [
            {
                "raw_content": "Is all that sucking up the “masculine energy” Zuck talks about ?",
                "author": "backnarkle48"
            },
            {
                "raw_content": "My favorite sentence was Tim cook's ' I love to have dinner and interact....'",
                "author": "MaBuuSe"
            },
            {
                "raw_content": "Honestly when you're invited to the white house as a CEO, it is part of your job and duty towards your employees to show up and represent your company in a good way. Thanking the government for its help is part of the job. I don't think they went overboard. They just thanked the govt for their ai policies and their help with reaching the international market.",
                "author": "_Batnaan_"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "New research from OpenAI: \"Why language models hallucinate\"",
        "score": 226,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Gonna read the paper later (so I have no idea if this is the correct interpretation) but quick skim of their blog post leaves me thinking the following: > A better way to grade evaluations > There is a straightforward fix. Penalize confident errors more than you penalize uncertainty, and give partial credit for appropriate expressions of uncertainty. This idea is not new. Some standardized tests have long used versions of negative marking for wrong answers or partial credit for leaving questions blank to discourage blind guessing. Several research groups have also explored evaluations that account for uncertainty and calibration. Sounds like the incredibly most obvious solution that everyone has probably thought about to reduce hallucinations > Our point is different. It is not enough to add a few new uncertainty-aware tests on the side. The widely used, accuracy-based evals need to be updated so that their scoring discourages guessing. If the main scoreboards keep rewarding lucky guesses, models will keep learning to guess. Fixing scoreboards can broaden adoption of hallucination-reduction techniques, both newly developed and those from prior research. But I'm reading this correctly, it sounds like they're saying that it's not enough for *some* evals to be made to target hallucinations, but rather *all* evals need to. The existence of some (many) evals that incentivize guessing will have a measurable impact on making models hallucinate. &nbsp; Edit: Reading So essentially state the obvious \"no shit, if you penalize uncertain answers, the models will hallucinate more\", and basically state how partially it's the fault of AI labs benchmaxing, because almost all existing benchmarks mark incorrect answers the same as \"I don't know\". Since the VAST MAJORITY of benchmarks are misaligned for hallucination reduction, it doesn't matter if they then make a couple of benchmarks that reduce hallucinations. They also state that \"avoiding errors\" is much harder than \"identifying errors\" (again this is obvious, but reading between the lines, there were rumours of OpenAI making a universal verifier, which makes sense when they say it's easier to verify)",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "[Link to the paper.](https://cdn.openai.com/pdf/d04913be-3f6f-4d2b-b283-ff432ef4aaa5/why-language-models-hallucinate.pdf)",
                "author": "galacticwarrior9"
            },
            {
                "raw_content": "In short - we are teaching LLM wrongly.",
                "author": "Healthy-Nebula-3603"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Gemini overtakes ChatGPT for the first time on Google Trends",
        "score": 36,
        "text_content": "https://preview.redd.it/7glbcllrjhnf1.png?width=2340&format=png&auto=webp&s=860633f72afcf018c42d891d522e987dc3c262a7 It happened on 12AM Eastern Time. [source](https://trends.google.com/trends/explore?date=now%207-d&q=gemini,chatgpt&hl=en)",
        "comments": [
            {
                "raw_content": "Is it because of nano banana? Personally I think chatgpt will take the lead again soon, but who knows, eventually maybe google will take the clear lead for more than a short upward trend. Chatbot websites aren't the goal anyway, the real thing that they are competing for is AGI/ASI in order to automate jobs so that they can produce and invent goods and services. there is a f\\*ckton of money there that eclipses the use of an app or website. ChatGPT, gemini, claude etc are just a temporary way to jump start that process, soon those aren't going to be very important even though right now it seems like they are one of the main parts of their businesses. Edit: yes it's nano banana https://preview.redd.it/9ob3pju3phnf1.png?width=1581&format=png&auto=webp&s=5e68f2bc566bb7d2d43946db710a7745c4e46547",
                "author": "GraceToSentience"
            },
            {
                "raw_content": "They've caught up fast with nano banana but this comparison isn't quite correct. You need to select both as chatbots instead of search terms otherwise Gemini will count search traffic from things like star signs ect.",
                "author": "hakim37"
            },
            {
                "raw_content": "Edit: I was wrong.",
                "author": "Feeling_Pass_2422"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Do they genuinely believe this will have any effect?",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Yeah, Go to China,Russia and india and tell them they need to stop rushing towards evermore advanced A.I.s. Cause they arent gonna stop so no one else is gonna stop.",
                "author": "shanereaves"
            },
            {
                "raw_content": "Natural selection strike.",
                "author": "RetiredApostle"
            },
            {
                "raw_content": "Even tho I'm not the brightest one in the room, I'm just glad that I'm not the dumbest one. To be honest, like, what's behind their thought process? I am genuinely curious.",
                "author": "PatheticWibu"
            }
        ],
        "subreddit": "singularity"
    }
]