[
    {
        "post_name": "Tesla CEO Elon Musk recovers $55 billion pay package in Delaware court ruling",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Some leftist activist judge decided he was going to nullify a pre-standing contract, which musk had already fulfilled his end of, just because he personally thought the terms of the contract both parties willingly agreed to were too beneficial to someone he didn't like. So basically the precedent they were trying to set is that all agreements are null and void unless a leftist judge approves of them, after the fact.",
                "author": "XxxRDTPRNxxX"
            },
            {
                "raw_content": "TL;DR - Delaware Supreme Court ruled UNANIMOUSLY in favor of Elon Musk's pay package. The activist Democrat judge has done almost immeasurable damage to Delaware. In case anyone wants to know, Delaware, being the tiny nothing that it is in the United States, decided that they could make a name for themselves in this country by basically having the best place to setup a corporation in the country. It has been the standard practice for decades to incorporate your business in Delaware, even if you exist in another state, because of the favorable tax laws. While they were not 100% tax free, they were predictable and reasonable, and there was an understanding in Delaware that some tax money is better than no tax money. So, Delaware became the go-to de-facto corporate tax strategy to open your company... All of that was undone when a leftist Democrat activist judge overruled the shareholders because she personally felt it was too generous to one person. The shareholders re-iterated their support of the pay package by voting again to reaffirm it, at that point in time, many years after the original vote, showing the shareholders had not changed, and Musk secured like 75% of all shareholder vote. What did the judge do? She said she didn't care and reinforced throwing out the pay package. Musk appealed, 1.5 years later we FINALLY get the supreme court of Delaware overthrowing the McCormick decision for being extremely flawed. Tesla, one of the top 10 most valuable corporations on the planet, has since left Delaware, depriving the state of all the potential tax revenue as a result, and piled on tons and tons of negative press all for them to gain literally nothing as a result, other than for this activist lefty judge to give Musk and Tesla a huge headache. Who knows how many other companies decided Delaware wasn't worth the risk anymore and went elsewhere? Who knows how many others choose to never incorporate in Delaware as a result of this. It is so damaging to the state. Get woke, go broke, never fails to be fulfilled.",
                "author": "GeneticsGuy"
            },
            {
                "raw_content": "Excellent",
                "author": "GuerillaYourDreams"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "I can say with confidence that President Trump won Georgia in 2020.",
        "score": 170,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Raffenfucker is a deep state agent who conspired and overturned a legal election in the United States of America and thus deserves the fitting punishment for said crime.",
                "author": "UsernameChexOut"
            },
            {
                "raw_content": "And no arrests",
                "author": "WheresMyStimmy"
            },
            {
                "raw_content": "If it’s proven the election was stolen then there should be a special session of congress and Trump should get another 4 years. Not just able to run again because he already ran and won and his term was stolen. The only remedy is a 4 year extension of his current term.",
                "author": "kekranger"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A British man dressed in a full burqa and walked past police officers to prove his claims of a loophole in facial recognition and stop-and-search enforcement The man says anyone wearing a burqa in the UK gets the “Infinite Freedom Glitch” He’s right",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We saw after the islamic shootout in Australia that government officials are institutionally petrified of enforcing laws against muslims",
                "author": "IlhansBrother"
            },
            {
                "raw_content": "\"Protect muslims more than ctiziens.\" - uk",
                "author": "guywholikesDjtof2024"
            },
            {
                "raw_content": "Burqa concealed carry!",
                "author": "SaltyAv8er"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Biden White House Coordinated Mar-A-Lago Raid Before Taking Conversations 'Offline'",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Let's hear the names and see prison time for all involved. Quit flapping your gums.",
                "author": "Speedgraphic69"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "oh no.. say it ain't so!",
        "score": 860,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Madonna has a pretty large mansion in Portugal, they can pile over there and have a scissoring party.",
                "author": "MythArcana"
            },
            {
                "raw_content": "If only this were true. Please flee, pedos!",
                "author": "ImYourHuckleberry24"
            },
            {
                "raw_content": "leave them kids alone",
                "author": "YodaBannon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump’s Deputy Chief of Staff Stephen Miller just called TIM WALZ an “INCOMPETENT LOSER” after SOMALIS STOLE $9 BILLION from HIS STATE",
        "score": 809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Wow, he really ROASTED him from ORBIT!!! Now that that's taken care of, what are next?",
                "author": "chickeninoven"
            },
            {
                "raw_content": "It's not incompetence. It was intentionally",
                "author": "PapaPepe"
            },
            {
                "raw_content": "9 billion wtf. They should be working it off with hard labor their entire life",
                "author": "MagainCalifornia"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Nine Billion Dollars was STOLEN FROM THE STATE OF MINNESOTA by Illegal Somalian Criminals. They must pay a big price, NOW!!! President DJT",
        "score": 1360,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But they won't. Because nobody gets arrested and goes to jail.",
                "author": "LampshadeDisco"
            },
            {
                "raw_content": "Walz needs charged and locked up. We do lock up retards, right?",
                "author": "Rock9Head"
            },
            {
                "raw_content": "Isn't like 30% of Somalia's economy based on families sending money from America?",
                "author": "HappyFunBall"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "NY Daily News Completely IGNORES The Bill Clinton Pics in The Epstein Files",
        "score": 908,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's all so tiresome.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Nobody is above the law except democrats.",
                "author": "MythArcana"
            },
            {
                "raw_content": "Michael Jackson? No way!",
                "author": "Nate_Higgersalot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "When are we going to put Bill Clinton on the stand?",
        "score": 608,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Arrest him today. There is no way he comes back from these files",
                "author": "Navypilot100"
            },
            {
                "raw_content": "Never. Hope this helps",
                "author": "For_All_Mankind"
            },
            {
                "raw_content": "Looks like their harem just walked into the room.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "A second illustration of Clinton at Epstein’s 71st St townhouse",
        "score": 847,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Clintons will go completely untouched, and Trump will be locked up. Easiest prediction of all time.",
                "author": "EgregiousPhilbin"
            },
            {
                "raw_content": "Jeff and Bubba probably jerked off into the toilet together.",
                "author": "mass55th"
            },
            {
                "raw_content": "Who is walking up the plane ramp? Obama or Holder? And is that Schiff on the ramp with that black dude?",
                "author": "KennyKetchem"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Brad Raff For Prison",
        "score": 809,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Well, it’s time to throw plausible deniability out the window and assume all actions were malicious until proven otherwise.",
                "author": "Viewer01"
            },
            {
                "raw_content": "I can. It was Trump.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Ratburger for prison. Won't happen, but would be nice.",
                "author": "Hamilton_Miller"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mods are tryin fix image hosting, hurry post pepes.",
        "score": 488,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I posted so many blank pages here today that I'm turning in early. My index finger is aching from hitting the delete button 500 times. :P",
                "author": "MythArcana"
            },
            {
                "raw_content": "You blew it. You fucked the meme up.",
                "author": "Schiffblower"
            },
            {
                "raw_content": "If you don’t want the missile toad, I’ll gladly take it!",
                "author": "AliceCooperBiden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Wyoming Republican Cynthia Lummis announces she will not be seeking re-election. New York Republican Elise Stefanik also announced she won't be seeking re-election, and is suspending her campaign for Governor of New York.",
        "score": 663,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It is likely that Rep. Harriet Hageman, the Liz Chaney slayer, will run and would be the overwhelming favorite to be the next U.S. Senator from Wyoming. She would probably be unopposed as well.",
                "author": "TrUmP2o24"
            },
            {
                "raw_content": "Probably sees the writing on the wall with NYC (which basically controls the state) and figures she can't win with all of those Muslim communist voters. When the twin towers fell who could have imagined that giving away the City to the culture that carried out the attack was going to happen.",
                "author": "BlackPilledMAGA"
            },
            {
                "raw_content": "Why are dedicated MAGA congresspeople and Senators resigning? Are they being threatened?",
                "author": "NecturusMaculosus"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They're eating the cats!! 🙀",
        "score": 781,
        "text_content": "",
        "comments": [
            {
                "raw_content": "# CAT LIVES MATTER",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "Remember that most Amazon drivers are not actually Amazon employees - they are contractors or working for a contractor.",
                "author": "RedStoneDeepState"
            },
            {
                "raw_content": "Sick fucking savages!! They need to be put down.",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: New photo of Bill Clinton swimming with Ghislaine Maxwell and a potential victim and/or minor. Per the Epstein Files Transparency Act, DOJ was specifically instructed only to redact the faces of victims and/or minors! This is pretty damning for Bill Clinton.",
        "score": 1208,
        "text_content": "",
        "comments": [
            {
                "raw_content": "again, it's unbelievable that this even got released to begin with. i thought we'd never see this stuff, and it's probably because of extreme public pressure.",
                "author": "SnowflakeScorcher"
            },
            {
                "raw_content": "Why is Hillary in the hospital?",
                "author": "FusionBlack"
            },
            {
                "raw_content": "Anyone still believe that picture of Clinton getting a massage in a hotel is fake? https://cdn.ebaumsworld.com/2020/08/18/040405/86355495/bill_clinton_7.jpg",
                "author": "Whoopies_tds"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "SecWar Pete Hegseth confirms MASSIVE U.S. STRIKES in Syria on Islamic terrorists under OPERATION HAWKEYE STRIKE, after US troops were ambushed by Islamists. \"This is not the beginning of a war — it is a declaration of VENGEANCE.\"",
        "score": 940,
        "text_content": "",
        "comments": [
            {
                "raw_content": "why are we even there",
                "author": "magaspif"
            },
            {
                "raw_content": "Leave the region entirely. Sand wars are ghey",
                "author": "Viewer01"
            },
            {
                "raw_content": "Maybe we shouldn't have contributed to overthrowig Assad and putting radical islamists in charge of what was one of the most Christian countries in the region",
                "author": "Classygasoline"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🚨 BREAKING: President Trump's Department of Justice just RELEASED a load of Epstein Files",
        "score": 1328,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Happening!!! Can’t wait to see all those juicy redaction bars.",
                "author": "PUNCHSPLOSION"
            },
            {
                "raw_content": "“So after Senator REDACTED fucked REDACTED in the asshole, we realized he was being paid off by REDACTED as bribery for REDACTED.”",
                "author": "medicpatriot"
            },
            {
                "raw_content": "https://www.justice.gov/epstein",
                "author": "hocuspocusfocusjeep"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "All terrorists who are evil enough to attack Americans are hereby warned — YOU WILL BE HIT HARDER THAN YOU HAVE EVER BEEN HIT BEFORE IF YOU, IN ANY WAY, ATTACK OR THREATEN THE U.S.A.",
        "score": 902,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now do the domestic terrorists in our government.",
                "author": "MemeWarsVet"
            },
            {
                "raw_content": "Thank you for your attention to this matter.",
                "author": "boreal_storm"
            },
            {
                "raw_content": "Good thing there are no Muslims in this country, amirite???",
                "author": "Filo76"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "WATCH LIVE: President Trump Delivers Remarks on the Economy in Rocky Mount, North Carolina – 9 PM ET",
        "score": 522,
        "text_content": "",
        "comments": [
            {
                "raw_content": "During AMFest? Really? He should be speaking on the big stage now and in NC in a week.",
                "author": "TrumpWonByALandslide"
            },
            {
                "raw_content": "He's going to say prices are down. I just returned to the store, already high prices have increased even more in the last two weeks.",
                "author": "conservativefrank"
            },
            {
                "raw_content": "I also have some remarks about the economy. I believe the encapsulating phrase I'm looking for is it fucking sucks.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DEI D.C. Police Chief Pam Smith just went BERSERK during her resignation- \"I'm going to the Bible when I say this, to my haters: F YOU!\"",
        "score": 1028,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Angry black woman",
                "author": "Freedomnuggs"
            },
            {
                "raw_content": "held accountable and mad about it",
                "author": "catnip"
            },
            {
                "raw_content": "This is why nobody takes black people seriously, they're clowns",
                "author": "SurrenderFreeman"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Taiwan considers TSMC export ban that would prevent manufacturing its newest chip nodes in U.S. — limit exports to two generations behind leading-edge nodes, could slow down U.S. expansion",
        "score": 737,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don't think this is that unreasonable for Taiwan. From their perspective the US has two worries that *may* incentive them to defend Taiwan. 1. China gaining access to leading nodes. 2. USA losing access to leading nodes. If China eventually get to the first part without TSMC, then the only thing the US will care about is not losing access to leading nodes themselvs. If they have that in the USA, then they have less incentive to go to war over Taiwan.",
                "author": "dantheflyingman"
            },
            {
                "raw_content": "As a Taiwanese I approve. A silicon shield is only good if you use it. Also the US is already dictating that TSMC can't compete for first dibs on new ASML EUV machines so...",
                "author": "puffz0r"
            },
            {
                "raw_content": "Ahhhh yes totally a hardware discussion. Will probably involve some extremely technical conversation about the hardware involved.",
                "author": "beneficiarioinss"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[RTINGS] TV Failure Breakdown After 3 Years of Longevity Testing",
        "score": 64,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Article format: https://www.rtings.com/tv/learn/longevity-failures",
                "author": "iDontSeedMyTorrents"
            },
            {
                "raw_content": "That WOLED failure to other panel types is interesting.",
                "author": "allthebaseareeee"
            },
            {
                "raw_content": "Really interesting to see how little burn in the G3 has compared to the B series. Maybe next time I’ll splurge some more, I can justify it better if I can tell myself it will last longer",
                "author": "ivandagiant"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Samsung Investigating Whether Employees Accepted Kickbacks for Memory Orders",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Being the largest Korean chaebol, I'd be shocked if there wasn't any kick back shenanigans going on",
                "author": "rebelSun25"
            },
            {
                "raw_content": "Company whose chairman was caught red-handed with a closet full of briefcases filled with treasury notes tagged to the sitting President wonders if potentially its employees may also follow his example.",
                "author": "Talon-ACS"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD's legacy Ryzen 7 5800X3D chips now sell for up to $800, more than a new 9800X3D — AM4 chip costs twice as much as MSRP, as enthusiasts flock to old DDR4 memory",
        "score": 169,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No one is buying this for 800 Stop the sensational headlines You can get a 9800x3d and 32gb ddr5 cl30 kit at MARKET PRICE for under 800",
                "author": "LuluButterFive"
            },
            {
                "raw_content": "Another clickbait article, yeah no shit if you order by highest price sales on ebay it'll look like this. If you instead look at recent sales this month they're all around $390-530.",
                "author": "vegetable__lasagne"
            },
            {
                "raw_content": "This is more sad than anything",
                "author": "crownvics"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD officially confirms fresh next-gen Zen 6 CPU details",
        "score": 378,
        "text_content": "",
        "comments": [
            {
                "raw_content": "7ghz is a pipe dream, leakers saying that should be instantly discredited, OC3D really shouldn’t be mixing dubious leaks (7ghz nonsense) with legit sources (GCC code base changes) in the same article",
                "author": "Touma_Kazusa"
            },
            {
                "raw_content": ">AMD plans to release Zen 6 Ryzen CPUs in late 2026. Based on prior “Medusa” leaks, these CPUs will feature up to 24 CPU cores with two 12-core CCX/CCD chiplets. This increases the maximum core count per chiplet from 8 to 12. Furthermore, it increases the L3 cache per CCX/CCD from 32 MB to 48 MB. That's good news, I suppose. AMD could've gone the cheapskate route (that Intel took with Skylake) and just stuffed more CCDs per wafer by sticking with eight cores. Profits! After all, the i7-6700 (\\~120 sq-mm) was almost half the size of i7-2600 (\\~220 sq-mm). Even the hexa-core i7-8700 was just around \\~150 sq-mm. Of course, it remains to be seen whether the core count will actually get bumped across the SKUs. I'm cautiously optimistic since N2 reportedly has excellent yields so it doesn't look like AMD is trying to compensate for poor yields with the 'extra' four cores.",
                "author": "GenZia"
            },
            {
                "raw_content": ">AMD has shared new information on its Zen 6 CPU architecture, confirming several new features for the next-generation processors. This information comes through two sources: a Zen 6 compiler update for GCC 16 (via Phoronix) and a new Zen 6 document from AMD. >With AMD’s new GCC compiler update, the company confirmed several new ISA capabilities for Zen 6. This includes AVX512_BMM, AVX_NE_CONVERT, AVX_IFMA, AVX_VNNI_INT8, and AVX512_FP16. This aligns well with AMD’s comments about “new AI data type support” and “more AI pipelines” when discussing Zen 6 at their 2025 financial analysts day. >In AMD’s Zen 6 performance document, FP16 support has been confirmed, as have changes to the memory profiler and to Zen 6’s integer schedulers. If this document is accurate, AMD is moving away from one unified scheduler with Zen 6 to six separate schedulers with Zen 6. It is currently unknown why AMD is making this architectural change. Regardless, it appears some significant changes are being made to Zen 6’s design. Has AMD moved to move, smaller integer schedulers in an effort to boost Zen 6’s clock speeds or efficiency? >With FP16 support, AMD’s Zen 6 CPUs will be much more capable of calculating certain vector and mathematical calculations at an accelerated rate. This could be part of AMD’s AI push with Zen 6, though it will be useful for other tasks. >AMD plans to release Zen 6 Ryzen CPUs in late 2026. Based on prior “Medusa” leaks, these CPUs will feature up to 24 CPU cores with two 12-core CCX/CCD chiplets. This increases the maximum core count per chiplet from 8 to 12. Furthermore, it increases the L3 cache per CCX/CCD from 32 MB to 48 MB.",
                "author": "No-Explanation-46"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "CNBC | We Went To Intel’s Arizona Chip Fab To See If It Can Regain Its Edge [16:50]",
        "score": 17,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I forgot the marketing focuses on Intel 18A being 15% higher perf / W than Intel 3. That has been the target [for a while](https://www.intel.com/content/www/us/en/foundry/process/18a.html). Perf / W can be hard to parse. For example, **all** of these yield just a 15% higher perf / W: Assuming **10.0 perf @ 10W** is the Intel 3 baseline … * Intel 18A could be 10.0 perf @ 8.7 W = +15% perf / W * Intel 18A could be 11.0 perf @ 9.6 W = +15% perf / W * Intel 18A could be 11.5 perf @ 10 W = +15% perf / W * Intel 18A could be 12.7 perf @ 11 W = +15% perf /W If it was actually notably higher than 15%, they probably would’ve said that. Of course, recent consumer Intel CPUs are on Intel 7, Intel 4, or TSMC N3B (for the most part) and not on Intel 3. ***Has*** Intel shared 18A perf / W compared to TSMC N3B, Intel 4, or Intel 7? Intel should have all the silicon.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "[**Timestamp 8:20:**](https://youtu.be/YFE0zNMqQyg?t=499) >**CNBC host: \"Do you think you've now surpassed TSMC?\"** >***Intel Client Computing Group Head:*** \"***I think that's a really tough question to answer.*** *I would say TSMC, of course, is a very good supplier of us. But 18A has taken a slightly different approach, probably a more aggressive approach, by separating power and signal gates. I think in that way, it's leadership.\"* Is it really *that* tough to answer? PPACT: performance, power, area, cost, time to market. You could pick any. Unfortunate that 18A has zero major external customers, but answers like these do not inspire confidence. I guess \\^\\^ is why all major design wins went to TSMC or Samsung for this generation. Intel 18A was qualified for Arm's 2024 and even now 2025 smartphone IP, but nobody took them up. // At least he has good things to say about TSMC, compared to say, oh, Pat Gelsinger. [Morris Chang did **not** like Pat](https://www.electronicsweekly.com/news/business/morris-chang-on-intel-gelsinger-and-samsung-2024-12/): >Chang said he found Pat Gelsinger’s attitude to TSMC “**hostile**”, adding he had been friends with Bob Noyce and Gordon Moore and been close to many Intel CEOs but not to Gelsinger. >Previously Chang has described Gelsinger as “**discourteous**” and “**a bit cocky**”.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "Defect densities are improving \"each month\", though no Intel 18A defect density updates in 15 months & counting. [Intel says defect density at 18A is 'healthy,' **potential clients are lining up**](https://www.tomshardware.com/tech-industry/intel-says-defect-density-at-18a-is-healthy-potential-clients-are-lining-up) Sept 2024: 0.4 D0 on 18A Dec 2025: ***??*** D0 on 18A We've seen the numberless charts and the commentary, but no hard numbers. Surely, with yields improving, sharing an updated number publicly may entice smaller customers to consider Intel Foundry, improve Intel Foundry’s image, and at least be consistent in their communications, etc. Intel will need to be more transparent and more forthcoming than TSMC.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "[Jeff Geerling] 1.5 TB of VRAM on Mac Studio - RDMA over Thunderbolt 5",
        "score": 60,
        "text_content": "",
        "comments": [
            {
                "raw_content": "[All test results here for those wanting to wiz by the numbers](https://github.com/geerlingguy/sbc-reviews/issues/95) A great first look of RDMA over TB5 covered by Jeff. There are more [discussions ](https://www.reddit.com/r/LocalLLaMA/comments/1pq2ry0/kimi_k2_thinking_at_283_ts_on_4x_mac_studio/)over at r/LocalLLaMA. I'd really love to see more dense models tested rather than MoEs. Also, unsure of the sort of benchmarking depth you can do with Exo but I'd love to see if there were tests like concurrent requests, as I can see this would be a strong use case for. Also, while I know Jeff have the llamacpp data at hand, I'd like to see vLLM tests especially for the GB10 instead of using RPC. There's also been some [fiddling around that can be applied to Strix Halo](https://www.reddit.com/r/LocalLLaMA/comments/1p8nped/strix_halo_batching_with_tensor_parallel_and/) to support RCCL. Also, IIRC the [Minisforum MS-S1 MAX](https://store.minisforum.com/en-ca/pages/s1_max) is the only Strix Halo miniPC/SBC that has 'USB4 V2', I wonder if the same logic can be applied with RDMA over TB5 [if supported](https://www.reddit.com/r/LocalLLaMA/comments/1ot3lxv/comment/no2naol/?utm_source=share&utm_medium=web3x&utm_name=web3xcss&utm_term=1&utm_content=share_button).",
                "author": "Noble00_"
            },
            {
                "raw_content": "Interesting tech, I just saw the video today. Daisy (matrix?) chaining macs over thunderbolt sure is a novel idea",
                "author": "ImmortalArchonV"
            },
            {
                "raw_content": "Did anyone ever find out why they taped out a second M3 max on N3E instead of using the M4 max?",
                "author": "VastTension6022"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Exynos 2600 SoC Could Power Galaxy Z Flip 8, Report Suggests Considerable NPU Performance",
        "score": 13,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "The Switch 2 controller really is that good",
        "score": 146,
        "text_content": "Visiting South Korea and they had a winter sale giving 20% off all S2 accessories and most games. This was at one of the electronic stores similar to Best Buy. Normal price: 109,800 KRW (74.40 USD) Sales price: 87,840 KRW (59.52 USD) The controller feels really nice and the analog sticks are the smoothest in any controller I've ever used. The only thing I can even think of changing is having the handles angled a bit more outward, kind of like the Xbox controller. Just a couple of degrees, but I think it would make it even better. Still easily an A+ controller and I'm very happy to add it to the S2 collection.",
        "comments": [
            {
                "raw_content": "Wats the difference between the 1 and 2? Is the grip that better?",
                "author": "LaylaCamper"
            },
            {
                "raw_content": "On the pro controller, what did you do to make the analog sticks that color? Replace the default ones with colored ones?",
                "author": "shrek3onDVDandBluray"
            },
            {
                "raw_content": "The nicest controller I’ve ever used, the sticks feel so satisfying. Just wish the triggers were analogue.",
                "author": "tman2damax11"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Publisher claims Nintendo is now offering smaller card sizes for Switch 2, which could mean less game-key cards",
        "score": 1253,
        "text_content": "Great news for physical collectors and all consumers in general!",
        "comments": [
            {
                "raw_content": "Figured it would have taken at least a full year before meaningful movement was made in regards to cart sizes, good to see it sooner.",
                "author": "KelvinBelmont"
            },
            {
                "raw_content": "as games are getting bigger don’t we need bigger size too",
                "author": "PhaseSlow1913"
            },
            {
                "raw_content": "Excellent!",
                "author": "SwashNBuckle"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "I may be weird, but for some reason i like to look at the Switch 2 back",
        "score": 350,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Perv",
                "author": "Nashkou"
            },
            {
                "raw_content": "Because its smiling to ya",
                "author": "maickd88"
            },
            {
                "raw_content": "Don’t worry. You’re normal compared to the people who sniff the Steam Deck vents.",
                "author": "thebohster"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin's Creed Shadows on Switch 2 started life as a \"very slow\" port that almost cut a key feature, but the game's devs detail how they brought the full experience to Nintendo's handheld",
        "score": 246,
        "text_content": "",
        "comments": [
            {
                "raw_content": "For what it is, it's a super impressive port. More impressive than Outlaws imo. Sure you don't get raytracing, but there's way more going on in this game and it's a fully open world VS Outlaws being split into planets. Despite concerns about the CPU, Switch 2 is still running a game with weather simulation, a Nanite-like virtualized geometry system, season changes, and physics. There's a lot going on and I think it's a shame that people are hyperfixated on the negatives (i.e. the water) when it's such an impressive port as a whole.",
                "author": "lattjeful"
            },
            {
                "raw_content": "ITT: People who know literally nothing about software development complaining about the cuts made and insisting it should have been different/better",
                "author": "Oops_I_Cracked"
            },
            {
                "raw_content": "The latest update has improved handheld somewhat and after a few hours, it’s impressing me just how full-featured the game is. When you’re standing in a horizon-deep field of grass, wildflowers, bushes, trees and wild animals with the rain lashing around you, with a crazy thunderstorm going on, you can forget the slight graphical downgrade, especially if played at arms length. Interesting bit from the interview on this specifically: “When asked if there is any possibility of handheld mode getting a patch for a higher resolution, the team explained why that likely isn’t possible. “In handheld mode, the game is already pushing both the GPU and CPU very hard,” they explained, “and there isn’t much headroom left without taking significant risks. The GPU in particular is heavily filled with compute workloads, so we feel we’ve reached a good overall balance between resolution and fluidity. That said, if additional optimisations are found over time, they would naturally result in higher dynamic resolution.””",
                "author": "Alasdair91"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Publisher confirms a new smaller size Game Carts are now available to publishers.",
        "score": 269,
        "text_content": "ININ gaming, the publisher for R Type Dimensions, made a statement post regarding a change in their physical release of R Type. **EDIT** - ININ has made clarifications and had omitted the details about the new smaller size carts. Probably due to Nintendo talking them out of this in private.",
        "comments": [
            {
                "raw_content": "Two smaller sizes they say, 32 and 16GB?",
                "author": "timeghost23"
            },
            {
                "raw_content": "I love hearing this. The smaller games should absolutely be on cart. I’d love for shadow gens to get a full physical rerelease.",
                "author": "Pokeguy211"
            },
            {
                "raw_content": "you think some key cards will gradually be replaced by physicals? most of them, didn't sell compared to switch 1 versions and it looks like people didn't if they couldn't upgrade to a switch 2 build. for example, spike chunksoft released no sleep for kaname date. it clearly didn't sell on switch 2 because the price was slashed months after its release, usually, spike's games remain full price for a while. the next game they announced (i think it's shuten order or something) is mysteriously, completely by hazard, not a key card on switch 2. hmmm. hopefully, we see releases like octopath zero get a physical, same for bravely default",
                "author": "BurnedOutCollector87"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "End-of-year Switch 2 photoshoot",
        "score": 107,
        "text_content": "",
        "comments": [
            {
                "raw_content": "A lot of cool games and the amiibos too. I've been loving Kirby air riders. So much fun and I've only done air ride so far haha",
                "author": "gothamz77"
            },
            {
                "raw_content": "Ohhh didn’t know there was physical of Yooka :0",
                "author": "Diligent-Coat8096"
            },
            {
                "raw_content": "Makes my 2 game collection look a bit pathetic.",
                "author": "Alternative-Group505"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Skyrim Switch 2 update",
        "score": 177,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just tested. It’s significantly better.",
                "author": "darkmoon_faire"
            },
            {
                "raw_content": "It just bums me out that the file size is over 50gb now, that's like three times the size of the ps5 file, it makes NO sense lol",
                "author": "TyleNightwisp"
            },
            {
                "raw_content": "I eagerly await the Digital Foundry analysis of the changes. I still don’t understand how a 60fps mode has not been implemented, but it’s looking like it’ll be stuck at 30 forever.",
                "author": "davidrevilla311"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Nintendo Switch 2 RGB MOD",
        "score": 230,
        "text_content": "So I decided to add RGB lighting to the Switch 2. Why? Because. A dozen colors or so, rainbow effect, control on/off, brightness and colors via a FSR sensor in the shell. Full functionality of the controllers. I used extremerate transparent side strips and white nail polish inside to act as a diffuser. Not perfect at all but it gets the job done. Edit: battery life. Full white, 100% brightness would drain the battery in 1h if the joycons were detached from the console. I coded a brightness limiter at 50% and I never use white. Realistically, it would drain around 10% of the joycons and between 3% and 5% when connected to the Switch.",
        "comments": [
            {
                "raw_content": "Battery goes brrrr 😆",
                "author": "ProfessionalCat88"
            },
            {
                "raw_content": "Mind to show us how it looks from the back?",
                "author": "Tastee92"
            },
            {
                "raw_content": "I hate it, but I appreciate it. Cool! It’s fun to tinker and looks like a clean mod.",
                "author": "cockyjames"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Before Perfect Dark cancellation, it \"delivered several milestones the client was happy with\" and Joanna Dark actress had recorded \"entire chapters\"",
        "score": 660,
        "text_content": "[Source](https://www.thegamer.com/joanna-dark-perfect-dark-reboot-cancellation-details/)",
        "comments": [
            {
                "raw_content": "The studio opened in 2018 and the game was announced I believe in 2020. Hitting milestones recently is great but when your studio is based in one of the most expensive locations in the country with very high paying staff I imagine, couldn’t deliver milestones until hiring another expensive studio like CD as a contractor to get the ball rolling and you had no income coming in for upwards of 7 years, I can see why they pulled the plug if the game needed another 2-3 years to come out. Sunk cost fallacy versus opportunity cost I guess. I really wanted to see this game in its final shape and the vertical slice they showed looked like it had neat ideas so I was definitely disappointed with the cancellation but not surprised.",
                "author": "profound-killah"
            },
            {
                "raw_content": "There must’ve been something else that Microsoft didn’t like about the game. This seemed like it would’ve been a huge deal for them. Maybe playtests didn’t go well a few times in a row and they were looking for a game to cut and save money on? I say this as someone who knows very little about game development",
                "author": "computerCoptor"
            },
            {
                "raw_content": "I loved Percect Dark as a kid but I think most of its success was due to it being a follow up to Goldeneye. Is it really an IP that anyone is particularly interested in apart from a little name value and nostalgia? Like does anyone even really remember the characters or story at this point? I just don't think it would sell very well after all these years",
                "author": "RobIreland"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Publisher ININ Games apparently corroborates recent rumor of Nintendo producing lower-capacity Switch 2 cartridges with new update on R-Type Dimensions III's physical Switch 2 release",
        "score": 246,
        "text_content": "[https://xcancel.com/ININ\\_Games/status/2002022817768890422](https://xcancel.com/ININ_Games/status/2002022817768890422) \"There is no better timing: Two days ago Nintendo announced two new smaller cartridge sizes for Nintendo Switch 2. This allows us to recalculate production in a way that wasn’t possible before. As a result, we’ve made the following decision: The entire European and US production of R-Type Dimensions III for Nintendo Switch 2 will be released on a full physical cartridge.\" [previous rumors](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1pp14rf/nintendeal_nintendo_making_smaller_capacity/) from nintendeal and others were never officially confirmed, but this statement from a switch 2 publisher heavily implies that they were true ININ games added a disclaimer in the same post saying that as a result of cartridge prices still being relatively expensive, the physical version would be priced €10 higher than digital, though less than their initial projection of €15 higher using previously available switch 2 carts \"A little downside to this positive news: The price for the retail and the special edition of the NSW2 version will increase by €10 due to the still higher productions costs.\" R-Type Dimensions III, at least its digital version, is set to be released by May 2026 UPDATE: ININ Games has removed the original post as well as their blog post where they mentioned Nintendo \"announcing\" smaller cart sizes, [they were clearly not allowed to say that](https://xcancel.com/i/status/2002062731646779802)",
        "comments": [
            {
                "raw_content": "UPDATE: [ININ games has removed the original post and edited their blogpost to remove all mentions of Nintendo \"announcing\" smaller capacity carts](https://xcancel.com/i/status/2002062731646779802) they definitely weren't supposed to confirm this lol",
                "author": "TiocStudios"
            },
            {
                "raw_content": "I wonder if this can be considered an NDA breach by Nintendo or not. I don't think we ever had any \"official\" publisher comments regarding available card sizes and their prices (even vague mentions of that)",
                "author": "s7ealth"
            },
            {
                "raw_content": ">the physical version would be priced €10 higher than digital, though less than their initial projection of €15 higher using previously available switch 2 carts well yeah, this is the 'Tax' that collectors (are sometimes okay with) paying. You need to pay Nintendo 13 dollars for the cart in the first place (and you pay upfront with a minimum order on a certain number of copies) Then there's the publisher split (if there is one), but that comes after the retailer's split (if there is one) and then the dev needs to actually make the money, which is why 22 dollars is the bare minimum in most cases, otherwise it won't even get stocked. That's not even considering the adittional cost of regional packaging, different country certification costs, the game's base price, the logistics, warehouse storage costs, the cost it takes to design the packaging, (the cost of fonts too now lmao), the fact you need 2-3 months ahead of time to do all of this (which is time the devs can spend working on a game and all of that work isnt going to end up on the cart but will be on a day 1 patch). it gets expensive fast and you can see why digital is cheaper premium physical publishers that actually do a good job of having reasonable pricing and no day 1 patches should be supported more",
                "author": "Cabrakan"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Storyboards from cancelled Dark Knight movie tie-in game",
        "score": 299,
        "text_content": "Not to be confused with Monolith Productions' Project Apollo from 2010, this game was being made by Pandemic Studios Brisbane around 2006-2008 and would have been published by EA. This game was supposed to include a huge open world and stealth elements with a couple of storylines and villains that weren't in the movie, it was planned to be released around the same time of the movie in July 2008. To put it short: it probably would have been the Batman equivalent to the 2004 Spider-Man 2 movie tie-in game. However, the game engine that was chosen by Pandemic caused a lot of technical issues and glitches, basically rendering it unplayable. Despite EA and Pandemic's best efforts to save the game by delaying it to December to coincide with the release of the DVD and Blu-Ray editions of the movie and increasing Pandemic Brisbane's workforce to 100 developers, it wasn't enough, and EA decided to cancel it 2 months before its planned December release date. Pandemic Brisbane was later shut down on Christmas day. Here are some storyboards that were made for the game: [Storyboard 1](https://vimeo.com/160686452) [Storyboard 2](https://vimeo.com/160686445) [Storyboard 3](https://vimeo.com/160686442) [Storyboard 4](https://vimeo.com/160686458) [Storyboard 5](https://vimeo.com/160686457) [Action set pieces](http://www.lach-land.com/lach-land_new/lach-land_animation_storyboards.html) [Boss fights](http://www.lach-land.com/lach-land_new/lach-land_animation_actionandframes.html)",
        "comments": [
            {
                "raw_content": "It’s so crazy seeing more about games like this. You’d imagine, as is the case with the the sister to leaks, lost media, that some stuff would be lost forever. An Arkham Knight level game based on the movie being made at the same time as the first Arkham game is just so insane to me. I can’t believe we get to see a deeper glimpse into it. Reminds me of the Ratchet & Clank mobile game that was entirely recovered. There’s just always more wonderful stuff to be found.",
                "author": "EclipseSun"
            },
            {
                "raw_content": "Since it was canceled only 2 months before supposed release, I really hope there's some small possibility that a somewhat complete build of the game is floating around somewhere. Most likely a broken mess, but I will take whatever I can get to see more about this game. I remember for the longest time it was just Gary Oldman talking about how the game is sick and seeing the grey mannequin Batman dive off a building.",
                "author": "nadnerb811"
            },
            {
                "raw_content": "While this sounded cool, I would never trade it for the Arkham series but it was insanely ambitious for its time. It was basically trying to be Arkham Knight for the 360 and PS3.",
                "author": "PettyTeen253"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Intel Core Ultra 400K “Nova Lake-S” CPUs with Big Cache (bLLC) to have four configurations up to 52 cores",
        "score": 116,
        "text_content": "",
        "comments": [
            {
                "raw_content": "nice can we get more than 1 generation for this socket now since motherboards cost too f\\*\\*\\*\\*\\*g much as it is.",
                "author": "Zeraora807"
            },
            {
                "raw_content": "I really have no reason to upgrade from my 13700K but I’d like to grab a 465K some day. Doubt I’d see really any improvement at 4K gaming tho",
                "author": "mountainyoo"
            },
            {
                "raw_content": "The 265k to 285k was such a disappointing upgrade considering how expensive it was. In my country it was double the price for an extra 4 e cores. Bizarre. This time going from 28 to 52 cores ultra 7 to 9 actually seems worth it. 52 cores is crazy.",
                "author": "Universal-Cereal-Bus"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Modder gets Redstone ML-powered FSR Frame Generation running on RDNA 3 GPUs",
        "score": 153,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Still happy about selling my 7800xt and going for the 9070xt. Because of discounts both times I bought, $40 well spent.",
                "author": "Swineservant"
            },
            {
                "raw_content": "Something about this article reads like a AI summary of some reddit posts...",
                "author": "hemidemisemitruck"
            },
            {
                "raw_content": "As 7900 XTX user makes no sense to upgrade to rdna4 at all and they try compensate that by looks of it by giving us nothing even tho i am waiting for rdna5, maybe i should just go back NVIDIA next generation.",
                "author": "Melodias3"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Zen6 support has been added to GCC 16, preparing for next-gen EPYC and Ryzen CPUs",
        "score": 342,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Going back to individual integer schedulers makes me think the 88 entry unified scheduler in Zen 5 might be suspected as a root bottleneck for why Zen 5 didn't do better against Zen 4 despite being so dramatically wider.",
                "author": "looncraz"
            },
            {
                "raw_content": "Looking forward to building an EPYC Zen6 with 8GB of RAM in 2026",
                "author": "sob727"
            },
            {
                "raw_content": "Original article: https://www.phoronix.com/news/AMD-Zen-6-znver6-GCC-16",
                "author": "iruoy"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Sapphire launches PURE X870A motherboard, its first X870-based high-end board",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "kinda funny seeing a mere two PCIE slots on a 2025 board",
                "author": "Firepal64"
            },
            {
                "raw_content": "Sad that they put ALC897 instead of ALC1220 onboard",
                "author": "Monnqer"
            },
            {
                "raw_content": "Realtek networking.. let me guess wifi from Mediatek too.",
                "author": "RayneYoruka"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "‘This is a wacky number’: economists cry foul as new government data assumes zero housing inflation in 'surprising' November drop",
        "score": 238,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Deflation is what it should be but… who knows anymore they make this shit up",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "When the cpi definition discludes like 18/21 metrics is it real? This shit is a joke, reality tv thats what it is reality TV with our lives.",
                "author": "Feisty-Hope4640"
            },
            {
                "raw_content": "I read on here all the time how housing prices are dropping, that would equal zero housing inflation right?",
                "author": "Capital-Giraffe-4122"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Affordability Slowly Improves in Encouraging Signs for the Housing Market",
        "score": 7,
        "text_content": "",
        "comments": [
            {
                "raw_content": "In my metro, prices are going down. And we recently had a huge building boom where supply has increased drastically. And modified our zoning to allow for more housing to enable the increase in supply. Coincidence?!?!",
                "author": "jiggajawn"
            },
            {
                "raw_content": "the very beginning of a very very long multi-year downturn",
                "author": "HormoneDemon"
            },
            {
                "raw_content": "I'll take it",
                "author": "HappinessFactory"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "November home sales struggle as supply stalls",
        "score": 59,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Spring will be interesting.",
                "author": "SidFinch99"
            },
            {
                "raw_content": "“We’re all going to list in the spring as the market will be “better””.",
                "author": "Bigdaddyblackdick"
            },
            {
                "raw_content": "they're trying to insinuate that lack of supply is causing a lack of sales. meanwhile monthly supply is 25% higher than 2019 and going higher all the time.",
                "author": "sifl1202"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Opendoor Settled $39M With Investors Over Its Pricing Algorithm Issues",
        "score": 13,
        "text_content": "Hey guys, if you missed it, Opendoor just settled $39 million with investors over issues they had a few years ago related to its pricing algorithm, profit margins, and its ability to operate during a housing downturn. Long story short, back in 2022, Opendoor was accused of misleading investors about how its iBuying algorithm worked, overstating profit margins, and hiding that much of its pricing relied on manual adjustments. After a series of disclosures, $OPEN fell nearly 90%, and investors filed a lawsuit for their losses. The good news is that the company finally agreed to settle with them. So, if you invested in $OPEN when all of this happened, you can already check the details and file your claim [here](https://11th.com/cases/opendoor-investor-settlement). Anyway, has anyone here invested in $OPEN at that time? How much were your losses, if so?",
        "comments": [
            {
                "raw_content": "In case we missed it? This gets posted like 2 or 3 times a week for the last few months lol",
                "author": "Creative_Ad_8338"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Home Sales Edge Up Slightly, But Sellers Are Hunkering Down",
        "score": 3,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Existing-home sales nudged up in November as mortgage rates dipped, continuing a three-month rebound in the housing market. But heading into the colder months, many homeowners appear to be in no hurry to list and may even be waiting for a more lively housing market to take root in the months to come. “Inventory growth is beginning to stall,” says Lawrence Yun, chief economist at the National Association of REALTORS. “With distressed property sales at historic lows and housing wealth at an all-time high, homeowners are in no rush to list their properties during the winter months,” Yun says. NAR’s data shows that housing inventories fell 6% from October. Still, inventory has improved over the last year, about 8% higher than a year ago, giving buyers more options than they’ve had in years. Seasonal changes are common this time of year; yet realtor.com® recently reported a record-high number of delistings, with about 6% of listings having been pulled from the market by home sellers. But this could reflect sellers’ flexibility and preference to wait rather than having to reduce their price, says Danielle Hale, chief economist at realtor.com. Nationally, home sales did improve last month, although at a slower pace. Existing-home sales—including single-family homes, townhomes, condos and co-ops—rose 0.5% in November, though they remain 1% below last year, NAR reported Friday. Meanwhile, home prices continue to climb, up 1.2% compared to a year ago, reaching a median existing-home price of $409,200 in November, NAR’s latest data shows. Opportunities Open Up for Buyers Lower mortgage rates may be drawing some once-priced-out home buyers off the sidelines. Mortgage rates averaged 6.24% in November, down from roughly 7% at the start of 2025 and helping to reduce buyers’ borrowing costs. “Once you get rates just below six-and-a-half percent, that unlocks a lot of buyers,” says Brad O’Connor, chief economist at Florida REALTORS. “Whenever mortgage rates fall, we see a response in the data—sales rise. And as rates dipped below about six-and-a-half percent this fall, the number of homes going under contract jumped—for the first time in quite a while.” For example, Florida’s pending sales for single-family homes surged 23% in October compared to the prior year, coinciding this fall’s rate drop. NAR predicts that a one-percentage drop in mortgage rates, from 7% to 6%—forecasted for 2026—could add about 5.5 million households, including 1.6 million renters, to the pool of potential home buyers. Further, “wage growth is outpacing home price gains, which improves housing affordability,” says Yun. He cautions though that if housing supply continues to tighten combined with strong buyer demand, upward pressure on home prices could once again hamper improvements to affordability. For now, home buyers are having more time to decide, with homes lingering on the market longer: The median time on the market for properties in November rose to 36 days, up from 32 days a year ago, according to the REALTORS Confidence Index. First-time home buyers are gradually re-entering the market, accounting for 30% of sales last month, but competition remains fierce from all-cash buyers, who made 27% of transactions in November. Regional differences are becoming more pronounced: Some areas are seeing falling list prices, while others are still experiencing bidding wars. Nationally, 18% of homes sold above the asking price in November, with an average of 2.2 offers per listing, according to the REALTORS Confidence Index, which reflects responses from more than 1,500 agents about their latest transactions. “We’re seeing more negotiation on pricing, especially on resale homes,” Christine Belin, a real estate pro with Coldwell Banker Pacesetter Steel, says about her market in Corpus Christi, Texas. “Buyers are finding better deals and more incentives” than they’ve had in the past, Belin adds, who is also the 2025 board president of The Corpus Christi Association of REALTORS. “This is a sweeter deal for buyers who just a few years ago may have felt like everything was stacked in the seller’s favor.” **Home Sales Breakdown by Region** Here’s a closer look at how existing-home sales fared across the country in November, according to NAR’s latest housing data: - **Northeast:** Existing-home sales rose 4.1% in November compared to October, the highest increase last month compared to the four major regions of the U.S. Sales reached an annual rate of 510,000, although that is unchanged from a year ago. Median price: $480,800, up 1.1% from a year ago. - **Midwest:** Sales fell 2% in November compared to October, settling in at an annual rate of 970,000. Sales are down 3% compared to a year earlier. Median price: $319,400, up 5.8% from a year ago. - **South:** Existing-home sales increased 1.1% in November from a month ago, reaching an annual rate of 1.89 million, which is unchanged from levels a year ago. Median price: $361,000, up 0.8% from a year earlier. - **West:** Sales held steady in November compared to October at an annual rate of 760,000, although that is down 1.3% compared to a year ago. Median price: $618,900, down 0.9% from November 2024. https://www.nar.realtor/research-and-statistics/housing-statistics/existing-home-sales https://www.nar.realtor/sites/default/files/2025-12/ehs-11-2025-summary-2025-12-19.pdf",
                "author": "SnortingElk"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "deleted post from a research scientist @ GoogleDeepMind",
        "score": 973,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Holy shit that means they're going to be upgrading pro again.",
                "author": "ColdWeatherLion"
            },
            {
                "raw_content": "Is Gemini 3 Flash available in API already?",
                "author": "Singularity-42"
            },
            {
                "raw_content": "Doesn't that just mean its ability is more jagged?",
                "author": "averagebear_003"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "OpenAI’s not done yet 👀",
        "score": 223,
        "text_content": "Any guesses?",
        "comments": [
            {
                "raw_content": "![gif](giphy|fCtaS8rQDRF9C|downsized)",
                "author": "OptimalBarnacle7633"
            },
            {
                "raw_content": "Try sending a 🎁 to chatgpt and see what happens.",
                "author": "Waiting4AniHaremFDVR"
            },
            {
                "raw_content": "the gift of porn",
                "author": "derfw"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Claude 4.5 opus achieves metr time horizon of 4 hours 49 mins",
        "score": 202,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's so interesting and weird that Opus 4.5 scores so much higher than 5.1 codex max on 50%, but it scores lower on 80%",
                "author": "FateOfMuffins"
            },
            {
                "raw_content": "So, buy land, solar panels, and hoard compute?",
                "author": "nobodyperson"
            },
            {
                "raw_content": "https://preview.redd.it/ovthjtchq98g1.jpeg?width=1290&format=pjpg&auto=webp&s=ab318f3ed2374ed9b630509959b493877bfddd36 We may be between red and gray",
                "author": "gbomb13"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Even Google is compute constrained and that matters for the AI race",
        "score": 257,
        "text_content": "Highlights from the Information article: [https://www.theinformation.com/articles/inside-balancing-act-googles-compute-crunch](https://www.theinformation.com/articles/inside-balancing-act-googles-compute-crunch) \\--------------- *Google’s formation of a compute allocation council reveals a structural truth about the AI race: even the most resource-rich competitors face genuine scarcity, and internal politics around chip allocation may matter as much as external competition in determining who wins.* *∙ The council composition tells the story: Cloud CEO Kurian, DeepMind’s Hassabis, Search/Ads head Fox, and CFO Ashkenazi represent the three competing claims on compute—revenue generation, frontier research, and cash-cow products—with finance as arbiter.* *∙ 50% to Cloud signals priorities: Ashkenazi’s disclosure that Cloud receives roughly half of Google’s capacity reveals the growth-over-research bet, potentially constraining DeepMind’s ability to match OpenAI’s training scale.* *∙ Capex lag creates present constraints: Despite $91-93B planned spend this year (nearly double 2024), current capacity reflects 2023’s “puny” $32B investment—today’s shortage was baked in two years ago.* *∙ 2026 remains tight: Google explicitly warns demand/supply imbalance continues through next year, meaning the compute crunch affects strategic decisions for at least another 12-18 months.* *∙ Internal workarounds emerge: Researchers trading compute access, borrowing across teams, and star contributors accumulating multiple pools suggests the formal allocation process doesn’t fully control actual resource distribution.* *This dynamic explains Google’s “code red” vulnerability to OpenAI despite vastly greater resources. On a worldwide basis, ChatGPT’s daily reach is several times larger than Gemini’s, giving it a much bigger customer base and default habit position even if model quality is debated. Alphabet has the capital but faces coordination costs a startup doesn’t: every chip sent to Cloud is one DeepMind can’t use for training, while OpenAI’s singular focus lets it optimize for one objective.​​​​​​​​​​​​​​​​* \\-------------- Source: [https://www.linkedin.com/posts/gennarocuofano\\_inside-the-balancing-act-over-googles-compute-activity-7407795540287016962-apEJ/](https://www.linkedin.com/posts/gennarocuofano_inside-the-balancing-act-over-googles-compute-activity-7407795540287016962-apEJ/)",
        "comments": [
            {
                "raw_content": "Everyone is compute constrained, which is why they are building out as fast as they can, but they are also constrained by electricity, which is constrained by red tape, and logistics. Every AI sub complains constantly about rate limits or usage limits, and then reads articles about everyone trying to buy compute, or build our compute, and says this has to be a bubble.",
                "author": "MaybeLiterally"
            },
            {
                "raw_content": "It was pretty obvious from Logan's response to someone who asked why they'd reduced the 2.5 Flash quota, and probably also why it took them a month to release Flash version 3.0. And they still have to reveal Flash Lite 3.0 and Nano Banana Flash, the latter of which will certainly be the one to handle the demand from the current Nano Banana 2.5.",
                "author": "sammoga123"
            },
            {
                "raw_content": "Why don't they just... get more compute? https://i.redd.it/hbliwl6lx88g1.gif",
                "author": "HeirOfTheSurvivor"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I updated the famous “I’ll need a research team and five years” xkcd comic from 2014 for 2024 and 2034:",
        "score": 275,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Maybe it doesn't matter for the purpose of this meme, but the 2024 and 2034 versions are missing the joke. In the original, it was a play on the fact that to a lamen, the difference between identifying a location and a bird was much smaller than the reality - that it was a gulf of technological capability.",
                "author": "NoCard1571"
            },
            {
                "raw_content": "If they can spin up a world sim in a few minutes, why would they need five years for genetic modification sim?",
                "author": "NekoNiiFlame"
            },
            {
                "raw_content": "Missed the opportunity to make it spaced five years as is the lady's request: 2014: \"Check whether the photo is of a bird.\" \"Ok, five years.\" 2019: \"Ok, got the image recognition model.\" \"Now make an app where you can talk to the sparrow.\" \"Ok boss, another five years.\"",
                "author": "pavelkomin"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "NitroGen: NVIDIA's new image-to-action model",
        "score": 36,
        "text_content": "Model: [https://huggingface.co/nvidia/NitroGen](https://huggingface.co/nvidia/NitroGen) Website: [https://nitrogen.minedojo.org/](https://nitrogen.minedojo.org/) Dataset: [https://huggingface.co/datasets/nvidia/NitroGen](https://huggingface.co/datasets/nvidia/NitroGen) Paper: [https://nitrogen.minedojo.org/assets/documents/nitrogen.pdf](https://nitrogen.minedojo.org/assets/documents/nitrogen.pdf) NitroGen is a unified vision-to-action model designed to play video games directly from raw frames. It takes video game footage as input and outputs gamepad actions. Unlike models trained with rewards or task objectives, NitroGen is trained purely through large-scale imitation learning on videos of human gameplay. NitroGen works best on games designed for gamepad controls (e.g., action, platformer, and racing games) and is less effective on games that rely heavily on mouse and keyboard (e.g., RTS, MOBA).",
        "comments": [
            {
                "raw_content": "Awesome, I can finally go through my backlog of games without wasting time on something as stupid as videogames. I'd say this is prime time to start spamming twitch account with AI vtubers and link them and NitroGen together for that sweet sweet passive income and achieve financial independence while the normies continue rejecting the tech, but I can't buy RAM and I feel nauseous from typing all of that anyway, so best close the door on that for now.",
                "author": "DonSombrero"
            },
            {
                "raw_content": "Is the point to put every beta tester out of business, or to get really lazy people to feel like they are playing? I'm not sure I get it, but it's pretty impressive nonetheless.",
                "author": "zamzibar"
            },
            {
                "raw_content": "finally AI can play games and I can work 20h a day, what a time to be alive",
                "author": "NewsFromHell"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "METR finds Opus 4.5 has a 50% time horizon of 4 hours 49 minutes",
        "score": 105,
        "text_content": "[Tweet](https://x.com/METR_Evals/status/2002203627377574113?s=20)",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/4ucsunwgx98g1.png?width=2378&format=png&auto=webp&s=568dc5c08d213231d48dd4f57d5a8799c9a48c7d (Clearer axes for those unfamiliar with METR)",
                "author": "WavierLays"
            },
            {
                "raw_content": "This beats out Epoch's estimate prediction of [3.8 hours](https://x.com/EpochAIResearch/status/1999585243003781413?s=20) and alleviates a lot of AI2027 criticisms a few weeks ago https://preview.redd.it/a6kzqhtdu98g1.png?width=743&format=png&auto=webp&s=61f6e222cea5d6be1a51cae585b231a1599cdd80",
                "author": "SrafeZ"
            },
            {
                "raw_content": "We are so back.",
                "author": "Setsuiii"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "DeepMind Co-founder, Shane Legg, predicted AGI by 2028 way back in a 2009 blog post",
        "score": 168,
        "text_content": "\"so my prediction for the last 10 years has been for roughly human level AGI in the year 2025 (though I also predict that sceptics will deny that it’s happened when it does!) This year I’ve tried to come up with something a bit more precise. In doing so what I’ve found is that while my mode is about 2025, my expected value is actually a bit higher at 2028. \" - Shane Legg",
        "comments": [
            {
                "raw_content": "He is the OG.",
                "author": "Own_Training_4321"
            },
            {
                "raw_content": "He's got a Legg up on his competition.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "The technical definition of AGI is a moving target. The broad “human level intelligence” definition has arguably been surpassed in some cases. I doubt we will ever realize a single moment as the singularity like all fiction has suggested.",
                "author": "Candid_Koala_3602"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Opus 4.5 blows past AI 2027's trend in METR benchmark",
        "score": 13,
        "text_content": "https://preview.redd.it/uw1a8qip6b8g1.png?width=1950&format=png&auto=webp&s=6b6c1c208bec060b0377f49df3cc14818eed2c66 Sources: [https://ai-2027.com/research/timelines-forecast](https://ai-2027.com/research/timelines-forecast) [https://x.com/METR\\_Evals/status/2002203627377574113](https://x.com/METR_Evals/status/2002203627377574113)",
        "comments": [
            {
                "raw_content": "No it doesn't, the AI 2027 uses a 80% threshold and this METR benchmark uses a 50% threshold",
                "author": "Elctsuptb"
            }
        ],
        "subreddit": "singularity"
    }
]