[
    {
        "post_name": "California is holding a special election costing $300 million dollars to steal 10 congressional seats and almost nobody is saying anything.",
        "score": 627,
        "text_content": "",
        "comments": [
            {
                "raw_content": "CA patriots are on our fucking own out here. We’ve been raising hell on this bullshit ass prop 50. Not a fucking word from the GOP or from Trump admin.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "Because everyone knows Cali is going to cheat and do it anyway.",
                "author": "ak83"
            },
            {
                "raw_content": "And they did that in about 60 days. Thinking that the opposition is stupid is a major mistake.",
                "author": "breadbaker"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Antifa terrorlsts BEAT UP a black man outside of the ICE facility in Portland.. Liberals are raclst af.",
        "score": 492,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Proud Boys were the solution to this shit. These fuckers would be picking up their teeth.",
                "author": "JoeMcCarthyWasRight"
            },
            {
                "raw_content": "The only reason the bike pansies even showed up is because he was black. If he'd been white, they would've arrested him for upsetting the Antifards.",
                "author": "FreedomFromGovt"
            },
            {
                "raw_content": "The police are Antifa members as well Portland citizens need to go Paul Kersey style on them.",
                "author": "MADASHELLNEWS"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🤢 TRANSGENDER PERVERT ALERT: The dude pretending to be a woman who went into the women’s locker room on @RacineUnified’s campus, is reportedly a Sex Offender and has been arrested previously for masturbating on school grounds by the women’s locker room...",
        "score": 483,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Imagine everybodies shock",
                "author": "Nibba2"
            },
            {
                "raw_content": "So when is this tranny/fad excuse for rapists going to end?",
                "author": "ColonelKlink"
            },
            {
                "raw_content": "“Transgender pervert” is redundant.",
                "author": "BahamaDon"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Bad Bunny, who’s set to perform at the biggest American sporting event, shows zero respect for the national anthem—choosing to sit through it instead.",
        "score": 460,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The NFL is gay. It said so itself. Literally just stop watching it.",
                "author": "IncredibleMrE1"
            },
            {
                "raw_content": "People still watch the NFL?",
                "author": "Patriot283"
            },
            {
                "raw_content": "DEAR NFL… THIS IS YOUR JUDGEMENT YEAR. You will fail and be brought to nothing…just like the “Nobel” faggot prize…a new world is birthing… enjoy",
                "author": "Jakylangelo"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "To my British brothers and sisters.. This is bullshit. You need to take your country back.",
        "score": 996,
        "text_content": "",
        "comments": [
            {
                "raw_content": "But if I took a can of spraypaint down to the local mosque and painted \"how does worshipping a PEDOPHILE give you moral authority?\", I'd be charged with a hate crime",
                "author": "magapatriot_pa"
            },
            {
                "raw_content": "Is this Canterbury??? Thomas Becket was martyred inside that cathedral for standing up to royal overreach and proclaiming that God's law superceded a king's wishes. Henry VIII desecrated it in the 16th century. The Church of England is a mistake and now they're desecrating one of the many churches they stole.",
                "author": "MinnieWhittaker"
            },
            {
                "raw_content": "I read earlier they are decals. Still fucked up.",
                "author": "mastermeatlock"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "White House OMB Director Russ Vought's office just said in court he might fire \"OVER 4,000 federal employees\" during the Democrats' shutdown.",
        "score": 1279,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I was hoping for 1 million.",
                "author": "Pikes985"
            },
            {
                "raw_content": "\"Might\"....",
                "author": "Chickensaurus"
            },
            {
                "raw_content": "Only 4,000, Russ? I was expecting 400,000 firings!",
                "author": "16BeatsAOne"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is CNN.",
        "score": 732,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And Scam Blondi tried to stop her prosecution. The BLM bitch loves Letitia James. It took a new Trump bulldog to bring the case against her. https://patriots.win/p/1ARJYGwzrs/it-wasnt-scam-blondi-that-brough/c Scam Blondie is NOT MAGA. Look at what she did to Zimmerman and how she helped to start BLM. She is a snake.",
                "author": "MissingTrump"
            },
            {
                "raw_content": "Imagine thinking that you should be immune to prosecution for real crimes because you can prove that the person in charge of the prosecution doesn’t like you. If that were our standard, Trump never would have been arrested.",
                "author": "current_horror"
            },
            {
                "raw_content": "# ᴄᴏᴍᴍᴜɴɪꜱᴛ ɴᴇᴡꜱ ɴᴇᴛᴡᴏʀᴋ",
                "author": "TheRedPilledArtist"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "The ‘GeNoCiDe’ in Gaza is over and the left is EERILY quiet about it. Strange.",
        "score": 829,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We all know why that is. President Trump can't be given credit for anything by those vermin.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Not sure why genocide is in quotations and Amiri King is a Zionist faggot",
                "author": "BidenSniffsLittleKid"
            },
            {
                "raw_content": "You're a fool if you think this is over. This is a good cop bad cop routine.",
                "author": "DITTOPatriot"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Woman that spit on Ed Martin will not serve any prison time sentenced by Biden appointed judge Jia Cobb",
        "score": 675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hang the traitor judges",
                "author": "Fuck_commies_2024"
            },
            {
                "raw_content": "Reminder, federal judges.... - Have no term limits. - Don't answer to anybody and can't be fired. - Aren't elected and can never be voted out of office. - Have legal immunity for anything said or done on the bench. - Realistically, can not be impeached and removed. There is no legal solution.",
                "author": "berserkerbarrage"
            },
            {
                "raw_content": "She’s also overseeing the Lisa Cook case and has halted numerous other Trump administration actions.",
                "author": "Quiznos585"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Mamdani is NOT having a fun time tonight 🤣 They're going to run this commie out of NYC!!!",
        "score": 1046,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Muzzies guards think they can touch people cause they got a black suv? 🤣🤣🤣",
                "author": "PatriotSkorzeny"
            },
            {
                "raw_content": "Someone needs to hit home in the face with a bacon cream pie.",
                "author": "DiamondDroid"
            },
            {
                "raw_content": "I heard a lot about antisemitism and a little bit about sharia law. I didn't hear anything about bullshit socialist policies or monkey-loving. These protesters need to expand their horizon. Mamdani can be criticized on a number of fronts.",
                "author": "cereal_killer"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Kaitlin Bennett is back in business and fast becoming a national treasure",
        "score": 701,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Kaitlin does a great job staying composed in the face of extreme cuntism",
                "author": "SALTYinSeattle"
            },
            {
                "raw_content": "I like a stand up girl like her.",
                "author": "MagaMom69"
            },
            {
                "raw_content": "Liberal white women, most women, arent critical thinkers, don't understand history and do no research. Its all about the feeeels and fitting into whatever group they aspire to be involved with. The media takes it from there.",
                "author": "makersmarx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Macron Appoints AGAIN The SAME French Prime Minister Who Resigned After Less Than a Month in Office!",
        "score": 970,
        "text_content": "",
        "comments": [
            {
                "raw_content": "What's that saying about doing the same thing hoping for different results?",
                "author": "RoninIV"
            },
            {
                "raw_content": "Wtf is the point of a prime minister? Isn't marcon president?",
                "author": "RudeFrog"
            },
            {
                "raw_content": "Rearranging deck chairs on the Titanic until the muslim iceberg sinks the ship.",
                "author": "drattastic1"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "They've already made a cartoon about it",
        "score": 947,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except they forgot to include the exposed butt cheeks in the back and the woman's big nose. See: https://x.com/HeartlandSignal/status/1976704790148071812",
                "author": "CasuallyObservant"
            },
            {
                "raw_content": "For the uninitiated????",
                "author": "MAGABOND"
            },
            {
                "raw_content": "So fat she needed the double cuff!",
                "author": "DeaduponArousal"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "President Trump: Starting November 1st, 2025 (or sooner, depending on any further actions or changes taken by China), the United States of America will impose a Tariff of 100% on China, over and above any Tariff that they are currently paying.",
        "score": 1584,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Makes me wonder what china's strategy is here.",
                "author": "linthat22"
            },
            {
                "raw_content": "We need to \" de-couple\" from China anyway. We are NOT friends. The sooner America re-develops its manufacturing base, the better. America has all the resources and talent it needs right within its own borders. China can keep its cheap-ass products. Fuck'em!",
                "author": "BenDoverAssho"
            },
            {
                "raw_content": "Juuust pull the plug on China already. Be done with it. Rip the band aid off.",
                "author": "Siteless_Vagrant"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Looks like Shifty is in some hot water of his own. Who’s ready to see Adam Schiff be the next one indicted?",
        "score": 1363,
        "text_content": "",
        "comments": [
            {
                "raw_content": "To be honest that smug motherfucker is the one I would like to see indicted the most lol. We need a damn conviction though, not just an indictment",
                "author": "DickTick"
            },
            {
                "raw_content": "Im wondering how many congress members arent guilty of mortgage fraud.",
                "author": "WarriorRock"
            },
            {
                "raw_content": "Pencil neck won’t mind doing time. He loves getting his shit pushed.",
                "author": "awsure"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Melania Trump reveals she has been talking to Putin through ‘back channels’ about kidnapped Ukrainian children, as 8 are reunited with families",
        "score": 1280,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Russian collusion confirmed. /s",
                "author": "RiffFantastic"
            },
            {
                "raw_content": "Best First Lady ever 🇺🇸 and actually… a WOMAN! Unlike someone…",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "CNN: “The First Lady’s shocking secret affair with Vladimir Putin”",
                "author": "PatGarrett"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "New Complaint Calls for Investigation Into Southern Poverty Law Center’s Tax Exempt Status",
        "score": 1624,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They should be Shut Down.",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Sounds like a terrorist organization.",
                "author": "terribletwos"
            },
            {
                "raw_content": "Just shut it down",
                "author": "MedicallyReddit"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Well done, Mr. President.",
        "score": 1562,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Looks like we'll have to keep electing MAGA candidates, otherwise they'll have it melted down...",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "I love this, we need more plain ol' American patriotism. Our kids are being taught about every history but their own, something things like this can help correct.",
                "author": "splink"
            },
            {
                "raw_content": "Is this the beginning of the \"American Heroes\" garden?",
                "author": "TwoArizonaPedes"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "DE: 🚨WOW ICE arrested a Kenyan national who is a convicted sex offender & had been hired as a Director with the Minnesota Department of Education. (VIDEO)",
        "score": 1258,
        "text_content": "",
        "comments": [
            {
                "raw_content": "They finally got Obama??",
                "author": "Prandogolio"
            },
            {
                "raw_content": "Kind of odd how the convicted sex offenders always try to go for jobs revolving around kids... Like every time",
                "author": "Wrexxis780"
            },
            {
                "raw_content": "They invaded Minnesota and the people said OK. You get what you get you stupid fucks!",
                "author": "TrumpLandslide20201"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Democrats plan on keeping the government shut down until after the DC No Kings protest on the 18th, its all political theater, while workers suffer.",
        "score": 1262,
        "text_content": "",
        "comments": [
            {
                "raw_content": "We should keep it shut down after that then.",
                "author": "darkmodeforgotpass"
            },
            {
                "raw_content": "Muh Kangz",
                "author": "BallsackPaneer"
            },
            {
                "raw_content": "This isn't going as well as they thought, so they have one more retarded ass play, a millionth protest! That'll surely bring people over to their side this time. LMAO!",
                "author": "cjcivicx"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Intel Talks Thread Director Changes In Panther Lake",
        "score": 22,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Just for my curiosity for **consumer** laptops & desktops: five years after M1 (2020), about five years after Alder Lake (2021), and nearly a decade since SD 835 / 850 for WoA (2018), most have switched to hybrid, sans AMD ([with good execution](https://www.techpowerup.com/review/amd-ryzen-interview-ai-zen-4-strategy/4.html)). Heterogeneous or hybrid with two uArches per package: 1. Intel 2. Apple 3. Arm (Chromebooks w/ mobile CPUs) 4. Qualcomm (X2 Elite, 8cx Gen3, etc.) Homogeneous with one uArch per package: 1. AMD 2. Qualcomm (X1 Elite) That is, OSes on all laptops & desktops will need to deal with this problem and AMD has similar work for dual-chiplet X3Ds with only one die having X3D cache.",
                "author": "-protonsandneutrons-"
            },
            {
                "raw_content": "50% higher MT over LNL and ARL at the same power consumption is *very* impressive... perhaps a bit too impressive, even? I'm no semiconductor expert (to put it mildly), but both LNL and ARL have N3B compute tiles so the fact that 18A is able to leave the older TSMC node in the dust (per Intel's own claims) by a margin of \\~50% in terms of performance-per-watt (architectural efficiencies aside) is an amazing feat. ... Am I missing something here?!",
                "author": "GenZia"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Microsoft deploys world's first 'supercomputer-scale' GB300 NVL72 Azure cluster — 4,608 GB300 GPUs linked together to form a single, unified accelerator capable of 1.44 PFLOPS of inference",
        "score": 132,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It should be 1.4 EFLOPS (exaflops) not petaflops. Notably ChatGPT says 1.4 PFLOPS so I guess that's who wrote the title. Edit: Nvidia link: https://www.nvidia.com/en-us/data-center/gb300-nvl72/ The total compute in the cluster 1.44 * 72 = 104 EFLOPS if it scaled linearly, article says 92 which is 88%. Note this is INT4, low precision for inference. For mixed precision training, assuming a mix of PF32/FP16, it would be in the ballpark of 250-300 PFLOPS * 72 or 15-20 EFLOPS.",
                "author": "john0201"
            },
            {
                "raw_content": "If my calculations are correct this cluster has 94,371,840 CUDA cores.",
                "author": "rioed"
            },
            {
                "raw_content": "92 EFlop machine: What is my purpose? Researcher: You suggest email templates for 100,000 outlook accounts per second 92 Eflop machine: Oh my god",
                "author": "puffz0r"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Intel’s Big Bet: Inside the Chipmaker’s Make-or-Break Factory",
        "score": 69,
        "text_content": "",
        "comments": [
            {
                "raw_content": "It's funny how in the thread the other day you had some people claiming Intel was using TSMC because they were capacity constrained with 18A. Turns out they haven't even fully equipped the fabs they built, much less the ones they cancelled, and they *still* think that's more than sufficient for demand.",
                "author": "Exist50"
            },
            {
                "raw_content": "These articles really sounding bad for Intel. We already knew several fabs had been canceled, but hearing Fab 52 is only built to half capacity (which implies Fab 62 probably isn't feeling tools installed at all) is really sad.",
                "author": "Visible-Advice-5109"
            },
            {
                "raw_content": "Intel is in a make it or go bankrupt moment. They either solve their foundry issues in the next 6 months to a year, or they will be forced to sell it off. Simple as that. Once a company starts selling its assets they rarely recover. People are in denial about how bad of a situation Intel is currently in. They are burning cash and still have no viable product being made on their foundry.",
                "author": "Simulated-Crayon"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China launches customs crackdown on Nvidia AI chips",
        "score": 311,
        "text_content": "China has stepped up the enforcement of its controls on chip imports, as Beijing seeks to wean the country’s technology companies away from US products such as Nvidia’s artificial intelligence processors. Teams of customs officers have been mobilised at major ports across the country in the past few weeks to carry out stringent checks on semiconductor shipments, according to three people with knowledge of the matter. The inspections started with the goal of ensuring that local companies stop ordering Nvidia’s China-specific chips following guidance from Chinese regulators to discourage their purchase, said the people. The targeted processors — Nvidia’s H20 and RTX Pro 6000D — are designed to adhere to US export controls and maintain the Silicon Valley chipmaker’s market share in China.",
        "comments": [
            {
                "raw_content": "In other news they are restricting rare minerals. So there is less GPUs going into China, which means more for the rest of the world. But making them will be more expensive. Curious how that will balance out.",
                "author": "bubblesort33"
            },
            {
                "raw_content": "US official openly boasted that they are keeping China AI developers hooked to US ecosystem by feeding them inferior versions of NV chips. That set off alarm bells in China.",
                "author": "Aggrokid"
            },
            {
                "raw_content": "You can't sanction me, I quit.",
                "author": "Bvllish"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Think PC Prices Are Bad Now? You Better Buckle Up. | Tariffs have already raised PC prices, but there’s even more signs PC parts will cost more.",
        "score": 68,
        "text_content": "",
        "comments": [
            {
                "raw_content": "As far as i know they were exempted from tariff, hence there were no increase on msrp with most of Nvidia RTX 50 series GPUs, does this news mean that they now apply to PC parts as well?",
                "author": "ShadowRomeo"
            },
            {
                "raw_content": "PC prices aren't bad now though? I mean for the last year pretty much every part except GPUs have been at pretty normal prices; and in the last month or two GPU prices have cooled down & started to hit MSRP or less regularly.",
                "author": "GenericUser1983"
            },
            {
                "raw_content": "No, I don’t think they are bad now.",
                "author": "SirMaster"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China blacklists major chip research firm TechInsights following report on Huawei",
        "score": 43,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "Minisforum MS S1 Max AI Review, Benchmarks, and Comfy UI Setup Guide",
        "score": 11,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Waiting for the eventual video about the eGPU setup, because dang.",
                "author": "oderi"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "AMD Strix Halo Mini Workstation - Minisforum MS-S1 Max",
        "score": 12,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That section on setting up AI environments, PREACH BROTHER! The state of things could not be described better than the wild west. It's a complete shitshow. Imagine the day when you get an executable, the app installs, and you use it. There is a clear update procedure in the app for new models, LoRas, and clip/VAE/what have you. ComfyUI has the steepest learning curve possible. Even Forge is shit because of the HIGH likelihood of running into an error that is unsolved or buried. Keep in mind, I am a tech. I have set up comfy/forge/framepack/JoyCaption/OneTrainer and many MANY more in tons of different hardware environments. It is NOT fun. Been in the industry for many decades. IT work is my trade. It's my theory that this is all being kept down in order to keep the non-tech peeps to paid services where you just open a web page and pay monthly. Haters gonna say git gud, but you just seem like boot lickers to me. Someone out there needs to step up and build a real app that runs local.",
                "author": "poursoul"
            },
            {
                "raw_content": "Boy does guy have an annoying voice.. can't say if video any good, couldn't take that voice",
                "author": "FrogNoPants"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "China issues port crackdown on all Nvidia AI chip imports, says report — enforcement teams deployed to quash smuggling and investigate data center hardware, targeting H20 and RTX 6000D shipments",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello nohup_me! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "I beat the original 7 FNaF games on my Switch 2! NO CHEATS!",
        "score": 127,
        "text_content": "",
        "comments": [
            {
                "raw_content": "The deodorant LMAO. I’m dead.",
                "author": "Ploosse"
            },
            {
                "raw_content": "Lol how many joy cons did you buy already?",
                "author": "Bripinoy"
            },
            {
                "raw_content": "Ok",
                "author": "FineNefariousness191"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Assassin's Creed Shadow Switch 2 Edition listed at retalier",
        "score": 134,
        "text_content": "[https://x.com/Wario64/status/1976762547958423703](https://x.com/Wario64/status/1976762547958423703)",
        "comments": [
            {
                "raw_content": "If it runs as good as Outlaws it's a day one purchase for me! Looking forward for this and Mirage hopefully",
                "author": "yripdo"
            },
            {
                "raw_content": "Weird this wasn’t at the partner showcase or the Sept. Direct",
                "author": "JL990"
            },
            {
                "raw_content": "I'm excited to see this. Hopefully its running as well as Star Wars Outlaws!",
                "author": "Mucrush"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Trails In The Sky 1st Chapter Update Adding \"Image Quality / Performance Settings\" On Switch 2",
        "score": 83,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Nice they’re adding this after I finished the game 😅 Maybe I’ll do a new game plus run.",
                "author": "lingering-will-6"
            },
            {
                "raw_content": "Hopefully that means more stability. I just want locked 60 on docked and handheld",
                "author": "Quick_Hit"
            },
            {
                "raw_content": "Meanwhile Atlus: We are sure that our graphics quality has definitely matched the standards.",
                "author": "Longjumping-Mud-3203"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Switch 2 Launch Title Bravely Default: Flying Fairy HD Remaster Updated (Version 1.0.2), Here Are The Patch Notes",
        "score": 48,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Saved you a click: ■ Improvements regarding connecting to the internet: An issue that caused the software to disconnect from the internet when loading or waking from sleep has been resolved. A “Communication in process” dialog will display and the software will wait to connect when changing maps after waking from sleep. A “Communication in process” dialog will now also display when a connection is not yet completed after loading, and the software will wait to connect and check the status of friends and guests. Friends and guests will now be restored when possible without waiting for a change of maps. The behavior for automatically disabling internet connections after a communication error has been changed, and error details will now be displayed. An Internet Connection Test option has been added to the Config menu, and the current connection status may be checked. ■ Adjustments to the Exchange Shop: The number of tokens needed to exchange for all prizes has been lowered. ■ Achievement corrections: An issue wherein dealing 9,999 damage or more to Orthros would not award the “9,999” achievement has been resolved ■ Tutorial improvements: A “Press and hold” explanation now accompanies the button icon with initial job tutorials. A tutorial now accompanies notes appearing for the first time when playing Luxencheer Rhythm Catch in the game corner. ■ Miscellaneous: Other minor bugs have been addressed.",
                "author": "Raging_Pwnr"
            },
            {
                "raw_content": "One of those games where I wish I enjoyed it but I just couldn’t deal. All the pieces are there, as I love turn based combat and the job system, but it was just so damn tedious at around chapter 5 that I just quickly lost interest and couldn’t continue. Maybe one day I’ll get back into it. But for now, FFT is keeping me plenty busy.",
                "author": "lilmitchell545"
            },
            {
                "raw_content": "Unlocking everything with tokens was the last thing I needed. I gave up because I didn't want to keep playing those mini games. I'll probably go back and collect the rest of those things.",
                "author": "Legion_Lavoie"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Madden 26 runs *night and day* better in arcade mode vs simulation",
        "score": 5,
        "text_content": "Try it out if you haven’t already I think you’ll be impressed. The cut scenes are quick and snapping into a play is too a lot less stutter and caching feeling. No loading the crowd without heads and that sorta odd stuff in sim. Simulation (the default option for quick play) seems chonky and all over the place. Sometimes it’s fine sometimes it’s honestly super distracting and irritating Battery life seems quite a bit better by it as well but ymmv there",
        "comments": [
            {
                "raw_content": "I got to try that out. How to play arcade?",
                "author": "GronWarface"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Dock or undock?",
        "score": 16,
        "text_content": "I broke my wrist so wont be playing for at least another 6 weeks. Should I remove my switch and s2 off the docks and shut them down or are they ok leaving docked with such long time not playing?",
        "comments": [
            {
                "raw_content": "Put your Switch 2 to the 90% charge mode.",
                "author": "TripleS82"
            },
            {
                "raw_content": "No problem for either don’t worry ! I broke my wrist too this summer, may the force be with you",
                "author": "Lussarc"
            },
            {
                "raw_content": "Could always look into any game which can be played with one hand haha",
                "author": "Serafita"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "A complete build of Ratchet & Clank: Clone Home has been found (cancelled J2ME game from 2006)",
        "score": 445,
        "text_content": "Source: https://www.youtube.com/watch?v=tZx2Exgd8TI > Nearly 20 years after its cancellation, and after 6 years of community searching, 2006's cancelled Ratchet & Clank: Clone Home has been recovered.",
        "comments": [
            {
                "raw_content": "And here I thought God of War: Betrayal was the only phone game Sony made from that time.",
                "author": "Coolman_Rosso"
            },
            {
                "raw_content": "That's fucking crazy. I'm glad their efforts paid off and they were able to clone the game and bring it home to the Rachet & Clank franchise.",
                "author": "doyouevennoscope"
            },
            {
                "raw_content": "The best videos about this series come from this channel.",
                "author": "TerrorOfTalos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Assassin's Creed Shadows NS2 Game Key Card",
        "score": 254,
        "text_content": "Appeared on Auchan website (French retailer/supermarket chain) No price though https://auchan.fr/assassin-s-creed-shadows-nintendo-switch-2/pr-C1851867",
        "comments": [
            {
                "raw_content": "c'mon Ubisoft, just announce this thing already. Feel like the Switch 2 version's been leaked by various retailers like half a dozen times since launch",
                "author": "blackthorn_orion"
            },
            {
                "raw_content": "Given how Outlaws ran on Switch 2, this is probably going to be somewhat popular if it performs as well technically.",
                "author": "KingBroly"
            },
            {
                "raw_content": "The red/white art is probably gonna look really clean with the red switch boxes",
                "author": "TrickBeginning9104"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Xe media and display engine now sits in compute tile?",
        "score": 34,
        "text_content": "Credits to Techpowerup for full HD slides This is quite surprising as previously it sits on SoC tile (Meteor Lake, Arrow Lake) but also hardly surprising as this is pretty much Lunar Lake layout, which the media engine also has access to 6MB side cache. If this compute tile is inherited by Nova Lake, this begs the question if we will get real F SKU, as in no IGP but still has display and media acceleration. Lost 1 media engine though, like Lunar Lake. I'm curious with that Sony codec though, is the userbase that high to license it from Sony?",
        "comments": [
            {
                "raw_content": "It always did and is only enabled when a iGPU version is bought. On Arrow Lake the media engines are also in this config. Edit: I was mistaken, the media engine on arrow resides in the SOC tile. Both new and old still keep the split between media and graphics, allowing independent iteration.",
                "author": "necromage09"
            },
            {
                "raw_content": "To clear a few things up: It's on the compute tile because Intel essentially made the SoC tile redundant for Lunar and Panther Lake. What would be its job is now done on the compute and maybe I/O tiles. Memory controllers for example are now on the compute tile. This compute tile is likely not inherited by NVL. Nova Lake uses different cores as far as we know. Panther Lake uses Cougar Cove P-cores and Darkmont E-cores. Nova Lake is currently reported to use Coyote Cove P-cores and Artic Wolf E-cores. Diamond Rapids is reportedly using Panther Cove. This is probably a Golden/Raptor/Redwood Cove situation again, but those cores are in fact different architectures. You can't make a 14600K out of a 185H or a 13700K out of a 12900K for example. So no, I don't think this will be a problem for Nova Lake, since it probably can't use this compute tile. Also, having the media engine on a separate tile from the GPU doesn't really matter. The operating system will still see them as one thing so to speak. It's been fine since Meteor Lake and continues to have the advantage of being able to only run the bulk GPU for short bursts during playback. As for how that works with an F SKU, they would likely simply disable the media engines as well, just like disabling a selection of cores or cache for segmentation.",
                "author": "Affectionate-Memory4"
            },
            {
                "raw_content": "My guess is that they are wherever the LPE cores are for Intel. So in arrowlake, NovaLake, that's IO tile. In Lunarlake and Pantherlake that's the compute tile",
                "author": "ResponsibleJudge3172"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel promises to support XeSS3 Multi Frame Generation in all XeSS2 games",
        "score": 39,
        "text_content": "",
        "comments": [
            {
                "raw_content": "🖖",
                "author": "ProjectPhysX"
            },
            {
                "raw_content": "should've put XMX on MTL-H, kinda felt left out. PTL-H with 12Xe seems to be LPCAMM only so I guess I'll be holding my SO-DIMM sticks with cheap ARL-H laptop that I can find within the next two year",
                "author": "h_1995"
            },
            {
                "raw_content": "\"Promise\"",
                "author": "Creative-Expert8086"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel's Tom Petersen confirms Xe3P will be Arc C-Series",
        "score": 74,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I loved how Tom Peterson did the circuit of tech blogs, tubers, and related last Fall to announce and advocate for ARC Battlemage. Looking forward to seeing alot of him over the next few months for Xe3 and ARC C-series",
                "author": "WarEagleGo"
            },
            {
                "raw_content": "\"we are tending to prefer e cores now when gaming\" That's very surprising",
                "author": "grahaman27"
            },
            {
                "raw_content": "I’m guessing Xe3P will be on Intel 3-PT.",
                "author": "Invest0rnoob1"
            }
        ],
        "subreddit": "intel"
    },
    {
        "post_name": "Intel confirms Xe3P will mark Arc naming switch to C-Series",
        "score": 31,
        "text_content": "",
        "comments": [],
        "subreddit": "intel"
    },
    {
        "post_name": "AMD Software: Adrenalin Edition 25.10.1 Battlefield™ 6 Preview Driver Release Notes",
        "score": 280,
        "text_content": "# Highlights * **New Game Support** * Battlefield**™** 6 (DX12) # Package Contents * AMD Software: Adrenalin Edition 25.10.1 Battlefield**™** 6 Preview Driver Version 25.10.25.25 for Windows® 10 and Windows® 11 (Windows Driver Store Version 32.0.21025.25005). * Ryzen™ AI NPU MCDM Driver version 32.00.0203.297 (Date: 2025-08-25)",
        "comments": [
            {
                "raw_content": "It was quickly removed due to a leftover bug, expect a re-release in 15-20 minutes.",
                "author": "user74947"
            },
            {
                "raw_content": "30 mins before launch, got to be some kind of record.",
                "author": "WayDownUnder91"
            },
            {
                "raw_content": "Link will work once the driver has been posted live to the AMD.com domain",
                "author": "AMD_RetroB"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AMD Radeon Software Adrenalin 25.10.1",
        "score": 91,
        "text_content": "",
        "comments": [
            {
                "raw_content": "hope the AMD noise suppression bug introduced in 25.9.2 is fixed.",
                "author": "jezevec93"
            },
            {
                "raw_content": "The game runs amazing on my 9070XT without this driver. Wonder if the upgrade is worth it.",
                "author": "IcarusV2"
            },
            {
                "raw_content": "Will there ever be a fix for rdr2 vulkan memory leak? Vulkan crashes, dx12 stutters",
                "author": "Soapstarboi"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Here’s why the housing slowdown isn’t lowering home prices",
        "score": 95,
        "text_content": "",
        "comments": [
            {
                "raw_content": "I don’t think the idea that someone with a low mortgage rate can just stay in their house is a new conclusion. This is all the sub has been talking about for years.",
                "author": "meechmeechmeecho"
            },
            {
                "raw_content": "I've said this before and will say it once more... Higher interest rates deflate the bubble... Higher unemployment pops the bubble. People as long as they work will have income and cut costs to pay... When income goes to 0 you cannot cut enough costs to make the mortgage payments.",
                "author": "AverageIndependent20"
            },
            {
                "raw_content": "Because people can't afford to cover the gap if they sell for less than they bought for. Duh.",
                "author": "Less-Fondant-3054"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Is there a tool to see if my town has more houses for sale than historically there were?",
        "score": 4,
        "text_content": "When I look at Zillow, there are so many houses in my town for sale. So many. But I’ve only been here since 2020. So is there a way to use a tool to see what the average amount of listings are?",
        "comments": [
            {
                "raw_content": "This will get you to county level: [https://www.redfin.com/news/data-center/](https://www.redfin.com/news/data-center/)",
                "author": "PresidentAdolphMusk"
            },
            {
                "raw_content": "Prop-metrics.com might have that info",
                "author": "telmnstr"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Metros where homes are selling for most over list price",
        "score": 5,
        "text_content": "Metros where homes are selling for most over list price Metro State Median sale price % over list US rank Rochester NY $289,900 12.38% 1 Buffalo NY $305,000 6.51% 2 San Francisco CA $1,749,500 5.48% 3 Syracuse NY $285,550 4.59% 4 Hartford CT $428,000 4.38% 5 Newark NJ $649,900 3.91% 6 Bridgeport CT $850,000 2.75% 7 Lancaster PA $415,000 2.51% 8 Albany NY $388,500 2.33% 9 San Jose CA $1,841,250 1.97% 10 Nassau County NY $775,000 1.89% 11 New Haven CT $430,000 1.83% 12 Oakland CA $1,050,000 1.76% 13 Springfield MA $380,000 1.72% 14 Sheboygan WI $324,700 1.40% 15 Norwich CT $400,500 1.39% 16 Manchester NH $590,000 1.38% 17 Pocatello ID $369,900 1.37% 18 Camden NJ $416,648 1.30% 19 Green Bay WI $363,000 1.30% 20 Oshkosh WI $313,250 1.23% 21 Milwaukee WI $400,000 1.22% 22 Boston MA $810,000 1.20% 23 Wausau WI $285,000 1.18% 24 New York NY $882,250 1.17% 25",
        "comments": [
            {
                "raw_content": "The jurisdiction type here isn't consistent. Some are cities others are counties. 3 of these are combined for the New York-Newark-Jersey City, NY-NJ Metropolitan Statistical Area, which also includes Nassau county. 2 of them are the San Francisco-Oakland-Fremont, CA Metropolitan Statistical Area. The important thing about metros is it should be broad enough to keep moving from a downtown to a suburb without changing jobs from impacting ranks on these lists. This isn't the case if you separate out Newark, NYC and Nassau, Oakland and San Fransisco, and Camden to Philly, and most of these boarder each other, or at least aren't a bad commute from one another. A metro usually is named for the core city and it's two largest suburbs. Here is an actual list of the 50 largest metro areas. [https://www.bls.gov/web/metro/laulrgma.htm](https://www.bls.gov/web/metro/laulrgma.htm)",
                "author": "benskieast"
            },
            {
                "raw_content": "WI so hot right now",
                "author": "Defiant_melon"
            },
            {
                "raw_content": "Here in Buffalo and yes , people are still having price wars",
                "author": "mjsillligitimateson"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Fisher Island Dethrones Atherton as U.S. Price Leader After 8 Years of Dominance",
        "score": 4,
        "text_content": "* Miami Beach’s Fisher Island (33109) became the country’s most expensive zip in 2025 with a $9.5 million median sale price, marking Florida’s first #1 finish. * At $8.33M, Atherton, Calif. (94027) was the #2 priciest zip, ending its eight-year run as the country’s leading zip, followed by $5.93M Sagaponack, NY at #3 * Ten zips recorded medians above $5 million, twice as many as last year.",
        "comments": [
            {
                "raw_content": "Living on top of my neighbors in a tourist fishbowl only accessible by boat? Sounds more like a prison to me.",
                "author": "SevereAccident"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Hyperspace and Beyond",
        "score": 1003,
        "text_content": "",
        "comments": [
            {
                "raw_content": "![gif](giphy|uDwKGxTFrADvO) This guy comments with this gif on posts about papers he doesn't read nor understand",
                "author": "Kazaan"
            },
            {
                "raw_content": "That's literally how I speak to people.",
                "author": "Leather_Science_7911"
            },
            {
                "raw_content": "*According to the internet historians your deceased grand-grandfather got around 100 karma points for posting such pictures rather than building generational wealth or supporting the progress...*",
                "author": "ecnecn"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Epoch: OpenAI spent ~$7B on compute last year, mostly R&D; final training runs got a small slice",
        "score": 194,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That’s crazy, they can really make a good model if they went all out. They aren’t even spending 1b on training yet and they have tens of billions to play around with.",
                "author": "Setsuiii"
            },
            {
                "raw_content": "Crazy how relatively cheap 4o was. Just shows you the crazy cost of 4.5 and Opus sized models. Makes me think they will go the way of the dodo",
                "author": "jaundiced_baboon"
            },
            {
                "raw_content": "Another example of how the only way to believe AI has plateaued is willful ignorance.",
                "author": "nomorebuttsplz"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "ALLEX pouring milk",
        "score": 129,
        "text_content": "https://youtube.com/shorts/tvjPjGPFM6g?si=37ORvAX-M-qox8HB",
        "comments": [
            {
                "raw_content": "We are so far from anything useful",
                "author": "adarkuccio"
            },
            {
                "raw_content": "Why so sultry",
                "author": "ProperColon"
            },
            {
                "raw_content": "Breakfast will be tomorrow.",
                "author": "BrewAllTheThings"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "GPT-5 Pro Tops FrontierMath Tier 4, Beating Gemini 2.5 Deep Think",
        "score": 208,
        "text_content": "GPT-5 Pro scored a new record of 13%, solving 6 out of 48 problems and solved a problem no other model has cracked yet(they ran it twice and got a combined pass@2 of 17%). Gemini 2.5 Deep Think was close behind at about 12% (one problem less, not a big stats difference). Grok 4 Heavy lagged with a much lower score (around 2-3% based on the chart). Full thread here for more details: [https://x.com/EpochAIResearch/status/1976685685349441826](/EpochAIResearch/status/1976685685349441826)",
        "comments": [
            {
                "raw_content": "It's a statistical tie, no?",
                "author": "94746382926"
            },
            {
                "raw_content": "Gemini 3 deep think is going to be insane",
                "author": "AverageUnited3237"
            },
            {
                "raw_content": "GPT-5 seems to be really apt, it's a shame I dont like its tone and personality. Damn bullet points everywhere",
                "author": "FeathersOfTheArrow"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "There is no AI problem on social media. There's a social media problem, that AI makes more obvious.",
        "score": 134,
        "text_content": "I watched a video about the current state of AI recently, by kurzgesagt if your curious. And I realized something as soon as I heard a specific quote from it. I realized that I think the entire way were thinking about AI's effect on the internet, is wrong. It was a warning about what AI will do to social media. \"Stuff just good enough, will soak up the majority of human attention. It could make us dumber, less informed, our attention spans even worse, increase political divides, and make us neglect real human attention.\" This is talking about AI's effect on social media, even though you could apply everything here to current social media. And it would fit perfectly. AI is not causing any of this, it's just making it more obvious. So I would like in this post to address all these issues, point out how they're affected by AI, and really, how social media is already causing them. \"Stuff just good enough, will soak up the majority of human intention.\": This is exclusively the fault of social media. The algorithms that sort what is shown to us, do not care about quality. They care about what we will watch, and how long we will watch it. A hundred shitty but long videos or posts, is far better for the algorithm than one very well made video or post, because the goal of every social media company is to keep people on their site, so they can sell ads. AI only makes this worse because it makes it easier to make low effort content, but if low effort content wasn't prioritized in the first place, then that wouldn't be an issue in the first place. \"It could make us dumber, and less informed.\": This is partly the fault of AI and its current design. The video by kurzgesagt goes into a lot of detail about this, AI is not good at being factual, and is very good at making shit up that sounds about right. But, again, this issue would be heavily mitigated if social media was designed to prioritize truth, which it doesn't. Social media is the most incredible misinformation machine imaginable, that even if AI dedicated itself to exclusively create misinformation, they couldn't hold a candle to what social media already does on a daily basis. Social media is optimized for attention, and one of the best ways to keep someone's attention is a story, especially when it confirms their beliefs. And especially when you pretend it actually happened. You don't need AI to do this, only an algorithm that makes doing it profitable. Because why automate when you can crowdsource? \"it could make our attention spans even worse.\": This one, I'm not sure about. There's conflicting data on whether social media, AI, TV, games, even books if you go way back, lower our attention spans or if we just get better at quickly absorbing information. This is mostly outside of the scope of this post though, so I'm just going to leave it at I don't know. \"It could increase political divides.\": Oh man does AI have nothing on social media here. I could talk about this for hours, so I'll try to be brief. There is nothing that has had a worse effect on American politics, than social media. Social media has annihilated American politics, and created two opposed cults that we call political sides. Social media is an echo chamber machine, and that plus the misinformation machine, is quite the nasty combo. It brings people together who all believe the same thing, encourages those beliefs, correct or not, with false information and emotionally manipulative propaganda, and allows them to only engage in the other side when they want to mock them or scream at them. Because of how the internet works, every chat board, every subreddit, every discord server is like an island that only you and the people you agree with live on. You don't have to be around people that challenge your beliefs, you don't have to deal with information that goes against your beliefs, because the algorithm will simply filter those out. Or just give you the worst of the other side to piss you off. AI makes this worse by allowing sides to create propaganda easier, much easier for sure, but again, this wouldn't be nearly as much of a problem if the algorithm didn't optimize for it. \"It could make us neglect human attention.\": While this one is diffidently made worse by social media, really, I think this is a problem we all have a responsibility for. The world is horrible, and people are horrible, and we do not make it easy to want to be around each other. Many people are lonely, and don't have deep connections. AI is a very tempting solution to people who are lonely. AI will not judge you, not talk over you, not burden you. This is incredibly valuable for lonely broken people, and I don't want to discount the healing effect this can have, but it can't be a final solution. AI does not care about you, and can't really connect to you, and that matters. Real meaningful connection involves someone choosing to spend time with you, out of love, and that will always be more valuable. I don't know how to solve this really, but I do know that social media in its current form, is making the problem worse. There's a theory called the dead internet theory, that most seemingly human interaction on the internet, is really generated by bots. I believe this is actually quite correct, but the bots aren't AI, there us. We are given points by doing what the algorithm wants us to do, attention, likes, comments, love. This trains us to do what the algorithm wants. To say what it wants us to say. To keep feeding into it, to pull others deeper. This is strikingly similar to how machine learning works, reinforcement learning isn't bound to silicon. AI is just learning to play the game as we are, and now the next bots are here, and we're afraid they'll replace us? I'd say that instead of fighting AI for premium access into the meat grinder, we fight the current system. If this is what social media is, then let it die, and build anew. Hold social media companies accountable for what they've been doing to us for years. Stop letting algorithms optimized for profit control our communication, and build systems that are optimized for truth and compassion. The rise of AI in social media should be a wake up call for us all, that the internet now is not what it was promised to be, that it has been taken by massive companies and used to profit off us all. But we still have hope, to build an internet, that truly raises us up, and pushes us forward as a species.",
        "comments": [
            {
                "raw_content": "Yup, well said. A feed of AI-generated Sora videos or a feed of human-created TikTok videos both aim to just hook you on a steady supply of dopamine; neither will help you accomplish a goal, better yourself, or build genuine human connection. Nobody is legally required to be on social media. And even among social media, there are much less addictive alternatives like Mastodon (which is precisely the reason they're a fraction of the size), or you can just read blogs on an RSS reader. AI is a very powerful technology, so it can make bad things worse. But we can also use it to make good things better.",
                "author": "xirzon"
            },
            {
                "raw_content": "Sound reasoning but I don't agree with just blaming the social media platforms and holding them accountable *as a solution*. We may succeed at taking some platforms down through that process but many more would flood in to take their place. In my view the much deeper issue is how our brains work and more importantly, how easily they can be hacked and our thought processes disrupted. YouTube shorts for example are likely a kind of junk food which is actively harming us. We need stronger education around critical thinking and mental health, otherwise we'll continue to be harmed.",
                "author": "Ignate"
            },
            {
                "raw_content": "Here are my thoughts in the ballpark of the post. Not necessarily addressing you, OP, just thinking out loud. In my view, an entertainment app or social media platform that makes hours fly by is simply better than one that doesn’t. It does a better job of giving people what they want. By the same token, manufacturers shouldn’t make food less tasty just because there’s an obesity problem. You wouldn’t make a couch less comfortable because someone spends too much time on it. Responsibility for use belongs to the individual, not anyone else. If your kid is spending too much time on an app, that’s on you, not the company. It’s a parent’s job to teach self-regulation - that’s how we raise responsible adults, not adult children. If you're spending too much time on social media - that's on you. If you get rage bated by the algorithm, or doom-scrolling - that's on you! \"Build systems optimized for truth and compassion\" - sure, no problem, if that's what people truly wanted. The market has figured out what people want, and algorithms optimize for that. No one is stopping anyone to create whatever social media platform they want. You can create one! I can understand moderation in certain contexts, such as, for example, gambling algorithms in games for underage children. But for adults... You do whatever you want - don't like social media, don't go there. Don't like shorts - don't watch them. Want to see a different platform? Make one! Is the Internet making you lonely? Go socialize in real life! It's alien to me that people are so eager to shift responsibility away from themselves. Evil companies, evil social media, evil AI. It's supply and demand. And personal responsibility. Exorcize the victim mentality out of oneself and evolve.",
                "author": "arty0mk"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Your plumber has a new favorite tool: ChatGPT",
        "score": 41,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Now put Chatgpt in a figure 3 so we can skip the human part",
                "author": "TinySmolCat"
            },
            {
                "raw_content": "Good. I like it when professionals use things to make their jobs faster and easier. It’s not like they are following it blindly like a layman might. And if they do, they are legally liable for the damages caused.",
                "author": "GatePorters"
            },
            {
                "raw_content": "Time to replace them.",
                "author": "FarrisAT"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Sora for Android is currently on the app store, but still in 'coming soon' mode.",
        "score": 19,
        "text_content": "No idea when it will release, but through this link you can have it auto install when it is.",
        "comments": [
            {
                "raw_content": "Can such an app be installed in the EU using a VPN? I am using one, but it is stated that this app is not available in my country.",
                "author": "Due-Conversation-692"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Reasoning Models Show 2.2× Performance Jump and 37% Faster Capability Scaling [METR Analysis]",
        "score": 48,
        "text_content": "**What this benchmark measures:** METR-Horizon evaluates how long tasks AI agents can complete autonomously without human help. The metric is simple: if a task takes a human expert 30 minutes, can the AI do it on its own with 50% reliability? This directly measures real-world usefulness, not just test scores. For example, Claude Sonnet 4.5 can now handle tasks that take humans nearly 2 hours. **My Analysis:** I analyzed METR-Horizon data comparing pre-reasoning models (GPT-4, Claude 3.5, etc.) versus reasoning models (o1, o3, Claude 4, etc.) and found two distinct scaling regimes: **Non-Reasoning Era (pre-Sep 2024):** * Doubling time: 8 months * Steady exponential progress on long-horizon tasks **Reasoning Era (Sep 2024 onward):** * Doubling time: 5 months (37% faster) * 2.2× baseline performance jump from shift to reinforcement training on reasoning tasks * Inference-time compute appears to provide immediate capability gains **Key Insight:** The shift to reasoning models didn't just add a one-time boost. The faster doubling time means these models extract more value from scale, training, and algorithmic improvements. What would take 24 months in the non-reasoning paradigm now takes \\~15 months. Fitted exponentials using RANSAC to ensure robust fitting with outliers. Both eras show clear exponential trends (straight lines on semi-log plot). Data source: METR-Horizon-v1 benchmark (30 models, Feb 2019 to Sep 2025) https://preview.redd.it/g0wpem02pcuf1.png?width=1400&format=png&auto=webp&s=990306dc7863b1f465d0311ebf56bf9c5bb4e808 Thoughts on where this trajectory leads in the next 12-18 months?",
        "comments": [
            {
                "raw_content": "What I don't get about the METR benchmark is why there's so much focus on 50% success That percentage of reliability does not seem anywhere near enough to begin having economic impact in the form of replacing workers",
                "author": "Mindrust"
            },
            {
                "raw_content": "Would it still be exponential/accelerating, of they didn't throw exponentially more money at it?",
                "author": "mmo8000"
            }
        ],
        "subreddit": "singularity"
    }
]