[
    {
        "post_name": "🔴 Trump Truth: I brought down costs more than any President in recorded history. The Crooked Democrats are using the opposite narrative, even though they know it is a total LIE. Remember this when you hear their phony soundbites. MAGA!!!",
        "score": 795,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Cool, where are the Epstein files?",
                "author": "explodejoystick"
            },
            {
                "raw_content": "What about the Epstein files?",
                "author": "FudgyFudgeBots"
            },
            {
                "raw_content": "Yeah id like to know about them files bro.",
                "author": "DamitBobby"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "CHIRLA tied to Tire Popping Trantifa and ActBlue, the DNC fundraising apparatus. Time to declare Antifa and the DNC domestic terror groups.",
        "score": 735,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Act blue is spamming this site. 4chan. And even 9gag calling trump a PDF. Trump was on flight logs. Domestic only. Never went to the island. Meanwhile Obama both Clinton's countless celebrities schumer and obviously others were recored on logs going to the island. Trump is the ONLY POLITICIAN. That not just helped the FBI snag that sick demented butch of a man. He BANNED HIM FROM ALL OF HIS PROPERTIES because after he learned about jeffy he didnt want him anywhere near his kids or grandkids. He did that BEFORE getting into politics",
                "author": "UltraFrogMan"
            },
            {
                "raw_content": "The left is now operating like your typical middle eastern terrorist organization: The DNC= The political wing. Trantifa= The military wing. Sharia Blue= The funding mechanism.",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Notice how many of the rank and file rioters are trannies, too. Almost like they groom the mentally ill to destroy their own lives so the only purpose they have is fighting against orange man. No doubt they fund the surgeries, groom them online and recruit them to join the fight. And when they die or go to jail, nobody cares.",
                "author": "bfett81"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Tom Homan heads to Portland to ramp up immigration enforcement amid weeks-long Antifa protest outside ICE facility",
        "score": 617,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good luck Tom!",
                "author": "DeusVult1096"
            },
            {
                "raw_content": "Portland in many ways is worse (more dangerous) than SoCal, Chicongo, NYC etc. Please tread carefully.",
                "author": "knnbccb"
            },
            {
                "raw_content": "Why hasn't Antifa been declared a domestic terrorist organization yet? Are we paying their wages, too? More shit that makes us go hrmmmm...",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "This is insane",
        "score": 644,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You just dont hate MSM enough.",
                "author": "Tordah"
            },
            {
                "raw_content": "Nobody *with the authority to do anything about it* bats an eye. During the decade following 9/11, there was endless talk about not wanting to emboldened the terrorists from members of Congress to justify their warmongering. And yet, when terrorists are openly attacking government employees and interfering with legal government activities, all those same politicians are deafeningly silent.",
                "author": "GuidedDisinfo"
            },
            {
                "raw_content": "I think ICE is being instructed to use less than lethal to carry out operations, so the deep state doesn't use it as propaganda for the next Democrat NGO-funded Vox documentary. However, if they are still concerned about perception from MSM; then we still have a way to go.",
                "author": "TheWingedStormfag"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "H1B party",
        "score": 1026,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Grok on a roll today.",
                "author": "grenades_and_ham"
            },
            {
                "raw_content": "Grok going to be retooled soon",
                "author": "OrangeCatBad"
            },
            {
                "raw_content": "Grok didn't kill itself",
                "author": "South_Florida_Guy"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "And just like that, the Dems/MSM are now clamoring for the Epstein files.",
        "score": 1215,
        "text_content": "",
        "comments": [
            {
                "raw_content": "All I care is that they get released. Evil is evil. We all know why they won't release the list, it was all an israeli entrapment operation.",
                "author": "Roof_Korean"
            },
            {
                "raw_content": "Democrats or Republicans, every compromised person should go down",
                "author": "Formerlurker92"
            },
            {
                "raw_content": "This is a good thing. Even if you love Trump. This story should not go away until the truth comes out or everyone’s reputation is ruined. Trump’s Legacy will be impacted by this whether this website wants to admit it or not.",
                "author": "Renegaden"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "It has been brought to my attention that the Great State of Florida, which I won BIG three times, and where I am a proud Resident, has renamed an important four-mile stretch of Southern Boulevard, in Palm Beach County, to “PRESIDENT DONALD J. TRUMP BOULEVARD.” Thank you",
        "score": 1014,
        "text_content": "",
        "comments": [
            {
                "raw_content": "How about Epstein Blvd?",
                "author": "Just_An_Idahoan"
            },
            {
                "raw_content": "As opposed to Barack H. Obama Highway which runs perpendicular and is a total dump.",
                "author": "NADSAQ"
            },
            {
                "raw_content": "Looking at the map, it runs right up to Mar A Lago. Very nice!",
                "author": "henri_derelicte"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "FBI launches criminal investigations of John Brennan and James Comey — Fox",
        "score": 1675,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Good. Fuck those fags.",
                "author": "Side_o_beef_curtains"
            },
            {
                "raw_content": "This is going to be like the Epstein case. Fucking nothing burger, I'm hoping it's not more theatrics to distract from Epstein",
                "author": "mikethemarine"
            },
            {
                "raw_content": "I want to see some arrests soon! Tired of just launching!",
                "author": "ohpleaseuhhelpame"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "RightangleNews, \"Two of the identified leftist who attempted to murder ICE agents in Alvarado, Texas are Bradford Morris and Cameron Arnold, men pretending to be women who will be sent to an all male prison when convicted.\"",
        "score": 1137,
        "text_content": "",
        "comments": [
            {
                "raw_content": "## Source https://x.com/Rightanglenews/status/1942651710213955937 The prisoners will definitely view them as women. lol.",
                "author": "JackLemon"
            },
            {
                "raw_content": "Trannies are quickly becoming the most dangerous group in the country.",
                "author": "TheFozz"
            },
            {
                "raw_content": "They'll love prison",
                "author": "PresidentialPepe"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Trump Extends Federal Hiring Freeze Until October",
        "score": 924,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Except ICE, CBP and US military (and subsidiaries)",
                "author": "TommyLasordasBallBag"
            },
            {
                "raw_content": "are activist judges ok with this?",
                "author": "Hanging_Chad"
            },
            {
                "raw_content": "The government is 99% too big. Jettison for best results.",
                "author": "MythArcana"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Anti-ICE rioters are attacking ICE agents outside a facility in San Francisco",
        "score": 878,
        "text_content": "",
        "comments": [
            {
                "raw_content": "And J6ers got held in jail indefinitely for less...",
                "author": "AngeredKabar"
            },
            {
                "raw_content": "Can they deport the shrieking banshees too?",
                "author": "ItsFunToSay-M-A-G-A"
            },
            {
                "raw_content": "How much love can we take in one summer?",
                "author": "Bongos"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ICE Agents were forced to drive thru and away with Keffiyeh masked Democrats clinging to their vehicle today in San Francisco.",
        "score": 657,
        "text_content": "",
        "comments": [
            {
                "raw_content": "There needs to be a nationwide law where hitting rioters at 100mph is completely legal and also gets you a reward",
                "author": "MedicallyReddit"
            },
            {
                "raw_content": "`They cry out in pain as they strike you.`",
                "author": "FREN"
            },
            {
                "raw_content": "if ice is impeded in anyway, billy clubs should be cracking skulls. if cling-ons are on vehicles, either the cling-ons should be run over, or ice should exit the vehicle and the billy clubs should be cracking skulls. I'VE HAD MY SKULL CRACKED BY NORMAL POLICE, FOR DOING NOTHING. NOTHING. but you are telling me ice can't crack skulls? so, i can only come to two conclusions: 1) ice are total pussies. 2) ice are operating under ridiculous rules of engagement. so then the problem is \"ice barbie\" - kristi noem. get rid of her and put someone else in who can handle the job.",
                "author": "yodayoda"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Ketanji Brown Jackson once again gets absolutely embarrassed… This time Sotomayor (a fellow liberal) explains to her that Trump’s specific plans are not before the Court and that her decision is supposed to be based on the legality, not her personal approval.",
        "score": 1655,
        "text_content": "",
        "comments": [
            {
                "raw_content": "You have to be one fucked up and retarded liberal with no concept of law for Sotomayor to lay down the smack on you, damn!",
                "author": "Allister"
            },
            {
                "raw_content": "Reminder, Lisa Markowski, Susan Collins and Mitt Romney voted for this arrogant, ignorant racist for the Supreme Court",
                "author": "fthecoup"
            },
            {
                "raw_content": "The Negress doesn't understand.",
                "author": "Bigpoppatrump420"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "BREAKING: Border Patrol releases names & photos of suspects accused of using devices to spike their vehicles in LA today.",
        "score": 651,
        "text_content": "",
        "comments": [
            {
                "raw_content": "When is transgender violence going to be addressed?",
                "author": "Taqiyya_Mockingbird"
            },
            {
                "raw_content": "Throw these fuckers into solitary confinement for 6 months, then into a cell for another 20 years. Or just push them out of a plane over the Everglades as gator bait. .",
                "author": "MajorClark"
            },
            {
                "raw_content": "Foreigners and trannies.",
                "author": "CleanUpPhillyTrump24"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Writer for Medium and \"Proud member of the Resistance\", Cindy Steinberg who said on X: \"FUCK THESE WHITE KIDS. I'm glad there are a few less colonizers in the world now.\" Just had her X account and Medium page deleted.",
        "score": 1302,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Her X bio was: \"Neurodivergent writer, intersectional advocate & activist who's chronicling this weird world of ours and making straight white men uncomfortable.\" Fucking retard.",
                "author": "Mr_Rightside"
            },
            {
                "raw_content": "\"Steinberg\"",
                "author": "jhewish"
            },
            {
                "raw_content": "a steinberg hates the whites?",
                "author": "bagel_fragility"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🔴 Trump Truth: We will be releasing a minimum of 7 Countries having to do with trade, tomorrow morning, with an additional number of Countries being released in the afternoon. Thank you for your attention to this matter!",
        "score": 969,
        "text_content": "",
        "comments": [
            {
                "raw_content": "1. Israel",
                "author": "DrWeeGee"
            },
            {
                "raw_content": "If ambiguity was a post.",
                "author": "Donsabai"
            },
            {
                "raw_content": "uh wut? releasing them what? All of wall street *ah fuck not again*",
                "author": "here2red"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "U.S. Supreme Court lifts order blocking Trump's mass federal layoffs, allowing sweeping workforce cuts — Reuters",
        "score": 1866,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's great! I'm still not forgetting about **EPSTEIN.**",
                "author": "TheRedPilledArtist"
            },
            {
                "raw_content": "Good. Fire the entire intelligence apparatus, escort them out with no notice by the military and recover all of the blackmail.",
                "author": "wharfthrowaway"
            },
            {
                "raw_content": "Afuera!",
                "author": "Get_Off_Big_Tech"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "ROSEANNE: Mr. President- Yes, we still care about Epstein. Is there a time to not care about child sex trafficking? Read the damn room.",
        "score": 1111,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Big failure by Trump on this. everyone knows it",
                "author": "Choppermagic"
            },
            {
                "raw_content": "The Epstein files are like nuclear MAD. If you have them, you can't use them because the other side has them too and pols from both sides are in them. The only thing you can do is burn all of them, but then you'll get a batch of new pols who you'll have no leverage against, except you didn't have any before either because you can't use the files... so... JUST FUCKING RELEASE THE FILES.",
                "author": "clownworld30330"
            },
            {
                "raw_content": "Spot on Roseanne. Well said.",
                "author": "LegXIII"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "🐊 Watch as a Cuban Urban Artist Held at Alligator Alcatraz Claims Mosquitoes are the Size of Elephants Amid Harsh Conditions at the Detention Center 🐘🐘🐘🐘🐘🐘🐘🐘🐘",
        "score": 1042,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Who gives a flying fuck what they say or think. Stop giving them attention",
                "author": "Here_we_go"
            },
            {
                "raw_content": "Floridian here, you want no part of our Everglades area unprepared. Massive gators, pythons and plenty of venomous snakes. The swamp is insanely difficult to traverse through, and standing water areas are full of parasites and bacteria. As mentioned by Juan in the video its also mosquito heaven. ie: the perfect place to house illegals until they are fucked off to their home country.",
                "author": "JiveTurkey_1"
            },
            {
                "raw_content": "funny how they glossed over his arrest for battery and assault on a repo driver (he stopped paying his bills too!) this guy is a prime candidate for deportation!! if the left wants to use this guy as a poster boy for their cause, by all means please do so!",
                "author": "coffee_grdr"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "Remembering Kyle Rittenhouse",
        "score": 699,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Witnessed him in action live",
                "author": "JoinTheDiscussion"
            },
            {
                "raw_content": "I'm surprised Bondi hasn't hauled him back in for shooting Jews.",
                "author": "MythArcana"
            },
            {
                "raw_content": "What the hell is up with your post title? Made it sound like he died",
                "author": "VinceOnAPlane"
            }
        ],
        "subreddit": "r/thedonald"
    },
    {
        "post_name": "6 GHZ Spectrum Already Used by Wifi Now Eligible for Auction",
        "score": 381,
        "text_content": "Title was pre-editorialized, fixed it in my submission here.",
        "comments": [
            {
                "raw_content": "For anyone interested. The UK is looking to implement a hybrid approach that lets both WiFi and mobile use the same spectrum. https://www.ofcom.org.uk/spectrum/innovative-use-of-spectrum/ofcom-pioneers-sharing-of-upper-6-ghz-spectrum-between-mobile-and-wi-fi-services Europe is also widely expected to harmonise on the band being made available for mobile carriers as well. So this isn’t necessarily a bad thing",
                "author": "Joshposh70"
            },
            {
                "raw_content": "I was always surprised to see the US allocate the entirety of the 6GHz band to Wi-Fi. Not that I minded (broadcasting across 320MHz remains delightfully decadent!), but when most other regions were splitting it with licensed services, it made the US an odd-ball in terms of what bands were available for each service. So I guess I'm not shocked to have seen it reconsidered. Clawing it back after the fact is kind of insane (some hardware is going to slip through), but I don't think anyone was terribly happy to have the US so far out of step with the rest of the world. Being able to use the same bands in all regions makes things a lot easier from both a hardware design standpoint and a licensing standpoint. Though it still pains me to see the US wireless carriers to come out of this benefiting in any way.",
                "author": "Verite_Rendition"
            },
            {
                "raw_content": "Unfortunate. Does anyone know which 6 GHz bands (UNII5, 6, 7, 8) have been allowed to be auctioned? The FCC [previously allowed](https://docs.fcc.gov/public/attachments/FCC-20-51A1.pdf): 1. UNII5, 6, 7, 8 could always be used at low power Wi-Fi 2. UNII5 and 7 could be used for high power Wi-Fi, if AFC was enabled Is this reversal now allowing ***all*** four 6 GHz bands to be auctioned? // For reference, 1. U-NII-5 (5.925-6.425 GHz) 2. U-NII-6 (6.425-6.525 GHz) 3. U-NII-7 (6.525-6.875 GHz) 4. U-NII-8 (6.875-7.125 GHz) [Other countries are moving forward with UNII5 for 6 GHz Wi-Fi ](https://documentation.meraki.com/MR/Wi-Fi_Basics_and_Best_Practices/Wi-Fi_7_%28802.11be%29_Technical_Guide)and as a minimum, must be protected for Wi-Fi 6 GHz. The CTIA says wireless carriers are eyeing UNII6, 7, and 8 for \"next global 5G band\\[s\\]\". But what will stop UNII5 from being auctioned off? The wording in the bill \"not less than xxx MHz\" opens up anything. What would *Wi-Fi* incumbents then do, if / when these bands are bought & deployed by wireless carriers? 6 GHz Wi-Fi products are already on the market. I guess where there's overlap, you'll either get worse Wi-Fi or worse cellular service. Doesn't make sense to reverse major spectrum allocations, with likely millions of devices already on the market.",
                "author": "-protonsandneutrons-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "IBM Announces Power11 With \"99.9999%\" Uptime, 55% Better Core Performance Than Power9",
        "score": 40,
        "text_content": "",
        "comments": [
            {
                "raw_content": "That's a lot of 9's. Well done. Now show us your silicon.",
                "author": "Danthemanz"
            },
            {
                "raw_content": "I'm sad they abandoned the openness.",
                "author": "the_dude_that_faps"
            },
            {
                "raw_content": "The handful of companies that still use this architecture will be elated.",
                "author": "Lars_Galaxy"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "DeskMini X600: ASRock releases updated 1.92-litre mini-PC with added USB4 connectivity",
        "score": 9,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Hello tuldok89! Please **double check that this submission is original reporting and is not an unverified rumor or repost** that does not rise to the standards of /r/hardware. If this link is reporting on the work of another site/source or is an unverified rumor, please delete this submission. If this warning is in error, please report this comment and we will remove it. *I am a bot, and this action was performed automatically. Please [contact the moderators of this subreddit](/message/compose/?to=/r/hardware) if you have any questions or concerns.*",
                "author": "AutoModerator"
            },
            {
                "raw_content": "ZZzzz 8000G series a year after HX 370 came out, come on I need a real manufacturer to make a new-APU mini PC that isn't some Chinesium Kickstarter/ Ali Express-limited BS that I can order in a Norwegian store and get my 5 year RMA right",
                "author": "RedTuesdayMusic"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "IBM Power11 Launched with Up To 2048 Threads and DDIMM Support",
        "score": 8,
        "text_content": "",
        "comments": [],
        "subreddit": "hardware"
    },
    {
        "post_name": "GlobalFoundries to Acquire MIPS to Accelerate AI and Compute Capabilities",
        "score": 45,
        "text_content": "",
        "comments": [
            {
                "raw_content": "wow MIPS just getting passed around like an old sock.",
                "author": "EasyRhino75"
            },
            {
                "raw_content": "MIPS? Haven't heard that name in a long time. They made the MIPS R3000A, a custom variant of it was used in the PS1 The MIPS R4300i with custom SGI graphics hardware was used in the N64. The MIPS R5900 as part of the Emotion Engine chip was used in the PS2 The PSP also used a custom MIPS chip Unfortunately the CEO of SGI in the late 90s decided to switch to Intel's next generation Itanium CPU's to save on MIPS development costs. That decision by SGI ended up killling MIPS and SGI. Compaq also decided to kill DEC Alpha and switch to Itanium to save on development costs I'm not sure what MIPS is doing these days Story of Intel Itanium: Itanium turned out to be a complete disaster. Intel Merced (Itanium 1) floor plan was so large that it couldn't be made on the 0.25um node, it had to wait until the cutting edge 0.18um node. When it did finally release in 2002, it was slow and underpowered compared to everything else. it only had a clock speed of 800mhz. HP was developing their own CPU uarch for Itanium called McKinley (Itanium 2) and it was better but it wasn't good enough to save Itanium. The main problem of Itanium was that VLIW turned out to be dead end. A compiler cannot perform the optimizations that hardware can at runtime. Itanium also couldn't run IA-32 code at acceptablely fast speeds. When AMD released x86-64 it was the killing blow to Itanium. It ran 32bit code at native speeds and ran 64bit code really well because it was basically 64 bit capabilities bolted onto the existing IA-32 ISA Intel under pressure from Microsoft and with Itanium failing, they bit the bullet and licensed x86-64 from AMD. Intel kept developing Itanium because they were contractually obliged to develop it for HP-UX workstations until 2020. the last major uarch revision of itanium was Poulson that was released in 2011. In the end the whole disaster ended up working in Intel's favor since it ended up killing DEC Alpha, SGI/MIPS and HP's RISC-PA (HP helped Intel develop Itanium). 3 of Intel's biggest rivals in the high end workstation market Fate of DEC Alpha Employees: A lot of DEC Alpha employees were hired by Intel and they helped with Nehalem and Sandy Bridge. AMD also licensed their EV6 bus and developed it into Hypertransport which AMD eventually developed into Infinity Fabric. Intel's Quickpath interconnect in Nehalem which replaced the front side bus used in Merom is similar to AMD's Hypertransport. AMD's former CEO Dirk Meyer who lead development of the Alpha 210264 when he worked for DEC, lead the company until 2013 when he was forced out because of the AMD Bulldozer disaster.",
                "author": "Healthy-Doughnut4939"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "Global PC shipments rise in Q2 2025 but US demand stalls as tariffs loom, says IDC (nerds.xyz)",
        "score": 15,
        "text_content": "Some surprising movement in IDC’s Q2 data. Global PC shipments grew 6.5 percent, but the US market is stalling hard. Tariff fears are likely a big factor. Vendors may end up offloading inventory with short-term promos even though costs are expected to rise overall. Also interesting: Apple jumped 21 percent, ASUS had solid gains too, but Dell dropped 3 percent. Lenovo still leads, but the pressure’s on. Is anyone here actually delaying a PC build or bulk order because of pricing uncertainty? And do you think Windows 11 is really pushing demand globally, or is that just a nice excuse for the bump? Full writeup with vendor breakdown: https://nerds.xyz/2025/07/pc-market-tariff-fears-2025-surge-global-slump-us/",
        "comments": [
            {
                "raw_content": "I'm not buying anything until this administration is gone (4 years).",
                "author": "unknown_nut"
            },
            {
                "raw_content": "Oh wait, stupid tarrif policies from the government causing people to tighten their belts??? Noooo can't be /s",
                "author": "Healthy-Doughnut4939"
            },
            {
                "raw_content": "I accelerated and already completed three because of tariffs. That's the other half of the coin.",
                "author": "Yourdataisunclean"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "MIPI C-PHY v3.0 gives camera sensors 30% more bandwidth, 24.9 Gb/s per lane",
        "score": 10,
        "text_content": "MIPI C-PHY v3.0 introduces a new 18-wirestate mode encoding option that increases maximum performance per lane by approximately 30-35%, delivering up to 75 Gbps over short channels to support ultra-high-resolution image sensors. The new 32b9s encoding transports 32 bits over nine symbols while maintaining industry-leading low EMI and power properties, achieving 3.556 bits per symbol compared to the previous 2.28 bits per symbol in 6-wirestate mode. This enhancement enables either reduced symbol rates and lane counts for existing applications or higher throughput for advanced use cases. The specification maintains full backward compatibility with previous C-PHY versions and supports both MIPI CSI-2 and DSI-2 ecosystems across mobile, PC, IoT, and automotive applications. | Bandwidth per lane | v1.1 (1Q 2016) | v1.2 (1Q 2017) | v2.0 (3Q 2019) | v3.0 (1Q 2025) | |----------|----------------|----------------|----------------|----------------| | **Encoding** | 6 wirestates | 6 wirestates | 6 wirestates | 18 wirestates | | **Bits per symbol** | 2.28 | 2.28 | 2.28 | 3.556 | | **Standard Channel** | 6.4 Gbps | 8.0 Gbps | 13.7 Gbps | 24.9 Gbps | | **Short Channel** | 6.9 Gbps | 10.3 Gbps | 18.3 Gbps | 24.9 Gbps | | **Long Channel** | 4.6 Gbps | 5.3 Gbps | 9.1 Gbps | 12.4 Gbps |",
        "comments": [
            {
                "raw_content": "Some new video streams MIPI C-PHY v3.0 enable: ### Single Lane (24.9 Gbps) | Video Format | Resolution | Frame Rate | Bit Depth | Data Rate | |--------------|------------|------------|-----------|-----------| | 4K120 RGB | 3840×2160 | 120 fps | 24-bit | 23.9 Gbps | | 8K30 RGB | 7680×4320 | 30 fps | 24-bit | 23.9 Gbps | | 8K60 RAW10 | 7680×4320 | 60 fps | 10-bit | 19.9 Gbps | | 4K240 RAW10 | 3840×2160 | 240 fps | 10-bit | 19.9 Gbps | | 8K30 RAW12 | 7680×4320 | 30 fps | 12-bit | 23.3 Gbps | ### Three Lanes (74.7 Gbps Total) | Video Format | Resolution | Frame Rate | Bit Depth | Data Rate | |--------------|------------|------------|-----------|-----------| | 8K120 RAW12 | 7680×4320 | 120 fps | 12-bit | 46.6 Gbps | | 8K60 RAW14 | 7680×4320 | 60 fps | 14-bit | 27.9 Gbps | | Dual 4K120 RGB | 2×(3840×2160) | 120 fps | 24-bit | 47.6 Gbps | | Triple 4K60 RGB | 3×(3840×2160) | 60 fps | 24-bit | 35.7 Gbps | The key breakthrough is crossing the ~24 Gbps threshold on a single short lane, enabling cinema-grade 4K high frame rates and real-time 8K processing on a single lane. This could allow cheaper sensors to include 4K 120fps or 8K 30 fps.",
                "author": "Balance-"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "IBM Power11 Raises the Bar for Enterprise IT",
        "score": 34,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Are there any actual details on what is new here, or if POWER11 will be unavailable for general availability like 10 before it? I got lost seeing all the footnotes on their claims. Also kinda irrelevant since only existing customers care about POWER products or want to be locked into IBM’s ecosystem. Shame that Raptor systems cant sell anything beyond 9.",
                "author": "EETrainee"
            },
            {
                "raw_content": "I'm always surprised every time I'm reminded that IBM still exists.",
                "author": "Frexxia"
            },
            {
                "raw_content": "I wish Power-based desktops were affordable…",
                "author": "arjuna93"
            }
        ],
        "subreddit": "hardware"
    },
    {
        "post_name": "really insane this is running on a tablet",
        "score": 4400,
        "text_content": "love this game. trying to complete it so i can then start bananza at some point",
        "comments": [
            {
                "raw_content": "...is this quality mode or performance? Getting my Switch 2 in 2 days and I'm really fascinated to know how this port runs.",
                "author": "thr1ceuponatime"
            },
            {
                "raw_content": "Turn back now. The comments are awful.",
                "author": "FlamingoDurban"
            },
            {
                "raw_content": "Fuck the haters. I’m loving the experience too.",
                "author": "jgreg728"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Guess What???",
        "score": 587,
        "text_content": "Not everyone has (or wants) a gaming PC. Not everyone has (or wants) a PlayStation 5/Xbox Series X. Not everyone has (or wants) a Steamdeck or other PC handheld. Some of us don't care if the specs aren't to the highest level possible. Some of us don't care if a game is \"old\" or was released years ago, if we are playing it for the first time, it is new. You don't have to love Nintendo, or the Switch 2, but when you come on a board where people are fans of both, and you just rip on people liking games like Cyberpunk 2077, or Yakuza 0, or Hitman, or Street Fighter 6, or whatever, because you played it on a different console that is \"better\", you come off sounding like a jerk. Don't be a jerk.",
        "comments": [
            {
                "raw_content": "Reading this, I think I’m going to take a break from the internet.",
                "author": "no_go0d"
            },
            {
                "raw_content": "Bro, have a close one read this out loud… this is the point where you get off reddit or just the internet all together. Your brain has become an echo chamber, amplifying shit that was said by very few teens. This is not to diss you, but to help you. Take a break from the internet , and enjoy your Switch 2.",
                "author": "greensparten"
            },
            {
                "raw_content": "I have a high end gaming pc and a switch 2. Who cares.",
                "author": "Ebytown754"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "The bundle in my country has the cartridge inside",
        "score": 2733,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/ou4n29pb8nbf1.jpeg?width=1228&format=pjpg&auto=webp&s=55c6dbe3341a4adf8246042c910a250f82470b55",
                "author": "Help_Im_Cooking"
            },
            {
                "raw_content": "Lucky you",
                "author": "Otherwise-Green-3834"
            },
            {
                "raw_content": "Probably because the Nintendo eshop is not supported (yet) in your country.",
                "author": "Tosh_00"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "So Tony Hawk Pro Skater 3+4 has FREE upgrade from Switch 1 apparently?",
        "score": 316,
        "text_content": "What's going on with this game? If I understand correctly - even if you buy Switch 1 cartridge version (or digital for that matter), you're going to get free Switch 2 upgrade? Hense it's kinda better to own Switch 1 cartridge version for collection and Switch 2 case with just a code makes way less sense? https://youtu.be/RZwXZ-4HLF8?si=RUJgEVuGCLSmDyo2",
        "comments": [
            {
                "raw_content": "It sorta makes sense why the Switch 2 version costs the same as the Switch 1 version then",
                "author": "CSBreak"
            },
            {
                "raw_content": "I thought activision would made this a paid upgrade",
                "author": "PickleAltruistic3427"
            },
            {
                "raw_content": "Saw a comment from someone in the comments of that video stating they did not get the free upgrade with the Physical cartridge. If anyone else bought the Switch 1 cartridge and has a Switch 2, please report back!",
                "author": "TheFearOfFear"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "No, no, no, no….. YES!!!!",
        "score": 833,
        "text_content": "Aún sigo sin creerme esta victoria. En serio, me pone de muy mala hostia la CPU en esta edición de la saga, en 150 CC. Pero esto ha sido flipante.",
        "comments": [
            {
                "raw_content": "That was pretty close! The other guy must be pissed :P",
                "author": "RoughLifeguard6568"
            },
            {
                "raw_content": "What a close call... God bless that guy who thought headbouncing was a good feature",
                "author": "Affectionate_Web_121"
            },
            {
                "raw_content": "This is literally how that one 90’s sports movie ended",
                "author": "Deven247"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "PSA: Goldeneye Bindings",
        "score": 60,
        "text_content": "Since N64 switch online supports custom per-game bindings now, I thought this would be helpful for anyone looking to setup goldeneye with a modern control scheme. I couldn’t find useful actions for the A and B buttons though Make sure you have the control scheme in game set to 1.2 solitaire as well. You can do this by getting into a mission and pausing the game",
        "comments": [
            {
                "raw_content": "How did you select 'move' for the right stick? I'm not seeing it on my screen, though im trying to bind on the actual switch itself instead of the pro controller so maybe thats why?",
                "author": "Acrobatic_Addendum51"
            },
            {
                "raw_content": "Thank you! But holy moly what a chore",
                "author": "Obienator"
            },
            {
                "raw_content": "Thanks!!",
                "author": "Mattolsen96"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Why is Amazon US saying that the “typical price” for the Pro Controller 2 is $100 🤨?",
        "score": 662,
        "text_content": "Also “16% off”, BROSKIE THAT’S THE OG PRICE!",
        "comments": [
            {
                "raw_content": "It’s a predatory sales tactic to trick people into thinking they’re getting a deal.",
                "author": "dixie12oz"
            },
            {
                "raw_content": "Because it’s Prime Day. They input fake original prices to make it look like everything is on sale even if it’s not.",
                "author": "junglespycamp"
            },
            {
                "raw_content": "They always lie about sale prices",
                "author": "Horror_Cherry8864"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Gamer Dad Switch 2 Review – One Month Later",
        "score": 178,
        "text_content": "I’m a married guy with two kids – an 8-year-old daughter and a 4-year-old son. We usually play together on weekends for an hour or two — Mario Kart, Mario Party, or sometimes Street Fighter 6 with my wife after the kids go to bed. Now, it might not sound like much, but trust me — those couple of hours? They’re often the best gaming moments of my entire week. Nothing beats that family fun vibe. Back in the day, we had the original Switch for family time, and I’d use my PS5 at night. But owning both just didn’t make sense anymore — not when I barely had time to play. And honestly, I don’t like spending money on multiple systems when I know I can’t get the most out of them. Then the Switch 2 came along. I played Cyberpunk 2077 on it and was genuinely impressed. Sure, it’s not PS5 or Series X-level, but for someone like me? It does the job, and does it well. The performance was totally acceptable, and I didn’t feel like I was missing out. With my limited time and family-focused lifestyle, the Switch 2 feels like it finally closes the gap. It handles solo games, party games, and everything in between — all in one device. For the first time, I actually believe I can stick to a single console. If you’re a gamer dad juggling real life and still chasing those gaming moments, this thing might be the perfect fit. Any other dads or moms out there feel the same?",
        "comments": [
            {
                "raw_content": "I have an 8 year old daughter and 4 year old son and feel the exact same way. Right now it is MK World or Yoshi or Kirby with kids and then me handheld No Man's Sky at night while my wife watches a show she wants. Keep enjoying.",
                "author": "Rimaraf21"
            },
            {
                "raw_content": "It’s nice to get the average Joe perspective on these sorts of things instead of the tech bros on YouTube who think that everyone just has money to burn on computer parts.",
                "author": "MeanConfection8558"
            },
            {
                "raw_content": "I am a dad as well. My son is only 2, so he doesn't play with me yet, but I know this will be his first system in a few years. So far I have found it incredibly easy to play when he's napping or sleeping. We also let him watch TV for about 30 minutes if he had his \"listening ears on\" at daycare. Which is nice there too. I think maybe in 2-3 years I'll start including him with it. And I can not wait until I get to play with him.",
                "author": "MapsByCK"
            }
        ],
        "subreddit": "nintendoswitch2"
    },
    {
        "post_name": "Discussion, News, and Request Thread - week beginning 07/09/25",
        "score": 57,
        "text_content": "Discussion threads are your weekly central hub for all requests, gaming news, and any other gaming topics you want to talk about. *Please keep all content that doesn't need it's own post to this thread to de-clutter the sub for proper leaks and rumors. Thanks!* **Join our new companion sub for super secret Resident EVIL 9 and Half-Life 3 leaks** \\-- [r/OkBuddyGLAR](https://new.reddit.com/r/OkBuddyGLAR/) Hot Threads of the past week: * [Xbox is closing The Initiative, Perfect Dark is cancelled](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lq193o/windows_central_xbox_is_closing_the_initiative/) * [Xbox Executives Were Blown Away by an Upcoming Game. Then They Canceled It](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lqxozx/jason_schreier_xbox_executives_were_blown_away_by/) * [Microsoft is imposing unrealistic requirements on Xbox](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1ltc0a6/jez_cordin_microsoft_is_imposing_unrealistic/) * [A former Turn 10 employee says that the Forza Motorsport side of the studio has been shuttered. They are now a Forza Horizon support studio](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lr8jk6/a_former_turn_10_employee_says_that_the_forza/) * [No one at Halo Studios is confident with their next project currently, Microsoft trying to replace many jobs with AI](https://www.reddit.com/r/GamingLeaksAndRumours/comments/1lqcmy3/no_one_at_halo_studios_is_confident_with_their/) # [Want to help us improve this subreddit? ](https://forms.gle/w9JaYTjVN1Zie9e39)[Provide us with feedback here](https://forms.gle/w9JaYTjVN1Zie9e39)[!](https://forms.gle/w9JaYTjVN1Zie9e39) # [Click here to join the discord to enjoy further conversations with the community!](https://discord.gg/6jdBvCSqbj)",
        "comments": [
            {
                "raw_content": "FYI: extas1s has been demoted to Tier 4 (Unreliable). An outright ban hasn't been done yet, but will be in serious consideration after gauging their track-record over the near future from here on out",
                "author": "ChiefLeef22"
            },
            {
                "raw_content": "Nintendo really gonna blue ball us for a year and a half just to release Prime 4 in like December lmao come on",
                "author": "Ihatenickstreltsov"
            },
            {
                "raw_content": "Direct or NashWeedle's head",
                "author": "ArcWardenScrub"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "A person caught a Sucker Punch employee working on Ghost of Yotei through a window of their Bellevue HQ. Unfortunately the post was swiftly deleted.",
        "score": 225,
        "text_content": "https://www.reddit.com/r/Ghostofyotei/s/7t8lIi2e4b Unfortunately I have to now label this as Grain of salt because the post was deleted after less than 30 minutes. The redditor of the initial post on r/ghostofyotei can confirm though that this was a legitimate leak.",
        "comments": [
            {
                "raw_content": "Gamingleaksandvoyeurism",
                "author": "Coolman_Rosso"
            },
            {
                "raw_content": "r/GamingLeaksAndCrimes",
                "author": "Jasen_The_Wizard"
            },
            {
                "raw_content": "ghost of yotei confirmed",
                "author": "matajuegos"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Monokuma voice actor teases a Danganronpa annoucement for November.",
        "score": 123,
        "text_content": "The Monokuma voice actor, Brian Beacock, made a[ tiny teaser ](https://xcancel.com/BrianBeacock/status/1942364007563943952?t=AUYTVOS2WrQ6Bgjc4f4_lw&s=19)with a Gif of Monokuma with the date \"11.25.2025\". This means that we will probably see new Danganronpa content annoucement in not soo far from future. A lot of fans speculate there is probably an [Dead By Daylight Crossover ](https://xcancel.com/osutrahit/status/1942390937705185347?t=ak3g4yM5f-jrJTtZqxOYyw&s=19)or a [Remake/Remaster of the first game of the series (Danganronpa: Happy Trigger Havoc)](https://xcancel.com/fnlwpn/status/1872794213588570134?t=wk4I97-cSim-R0DCEGg0OA&s=19)",
        "comments": [
            {
                "raw_content": "I'd absolutely love a new game (and I really don't think it'd at all undermine V3 to do one since V3 has a lot of, \"Let's cover our ass on this,\" stuff baked in anyway, plus like it's been eight years, it's fine), though if they were to do one I'd rather it just completely ignore the games before it. Have characters from them in side modes or whatever but the only returning element in the main game should be Monokuma. Though really even if we don't get a new game any time soon Hundred Line kind of did a lot to fill that void for me, feels very much like the true successor in spite of being very different. Funny enough Beacock's at a convention in my city in October so I'll probably get him to sign something.",
                "author": "Lizuka"
            },
            {
                "raw_content": "reminder: in Japan their numbers are switched so this is likely teasing an announcement that's actually on 25/11/5202. Long way to go.",
                "author": "Jerasunderwear"
            },
            {
                "raw_content": "I'm definitely on the DBD train, but I honestly wouldn't be surprised if it actually does turn out to be a new mainline killing game. Doesn't necessarily need to be Danganronpa 4 in the continuity, just a reboot or something.",
                "author": "MistahJ17"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AC Black Flag’s Steam page updated with brand new features not part of the original game",
        "score": 703,
        "text_content": "The new additions mentioned which are not part of the original release are: - Custom Volume Controls - Stereo Sound - Surround Sound - Mouse Only Option - Adjustable Difficulty - Save Anytime Seems like new features for the remake potentially but weird that they updated this for the original files Source: https://xcancel.com/TheHiddenOneAC/status/1942604079487717534#m",
        "comments": [
            {
                "raw_content": "So I guess we are close to the release of the remake.",
                "author": "Objective_Love_6843"
            },
            {
                "raw_content": "It's a little concerning that these updates are happening on the existing Steam page. Does this mean the OG version might be going away, similar to how Rockstar did the Definitive Edition GTA games?",
                "author": "FaviousM"
            },
            {
                "raw_content": "At the same time Black Flag was updated, they also updated the majority of Assassin Creed games with those accessibility tags. And looking at the pcgamingwiki (as I don't own the game), there are custom volume controls as well as stereo and surround support in the game. I'd wager they just noticed that Steam added the new accessability-tags and updated many of their games in one go.",
                "author": "lIIlllIIl"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "VGC's Jordan Middler on the Friends Per Second podcast: \"There are multiple Fallout projects in development, including - as far as I'm aware - the one you're all wanting.\"",
        "score": 583,
        "text_content": "Didn't see this covered anywhere and felt as though it was worth highlighting. I'm assuming the '*one we're all wanting*' is the Fallout 3 remaster or something New Vegas related. Obsidian's upcoming project slate beyond 2025 is pretty much unknown, so who knows. Todd Howard did hint at two unannounced Fallout projects on the Kinda Funny podcast last year. Again, one of those is almost certainly the F3 remaster, which leaves the door open for something else we don't know. Here's a timestamped link to the episode: [Xbox has done it again (derogatory) | Friends Per Second Ep # 73](https://www.youtube.com/watch?v=lap5F8SnoXg&t=70s) (57:41)",
        "comments": [
            {
                "raw_content": "Finally Shelter 2",
                "author": "Lz537"
            },
            {
                "raw_content": "I read “the one you’re all wanting” as something New Vegas related.",
                "author": "Ollienachos"
            },
            {
                "raw_content": "I mean.. https://www.reddit.com/r/GamingLeaksAndRumours/s/YC9eyATm9D It would seem stupid for the show to be based on the West Coast and never make a West Coast Fallout again.",
                "author": "ThinWhiteDuke00"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "Chris Dring : Gamepass is profitable.",
        "score": 313,
        "text_content": "\"Ok, I need to correct/clarify something. First, Xbox Game Pass is profitable, even when you factor in the lost sales for its first-party teams, sources who would know have told me. Over 18 months ago, I checked with Xbox about what’s included in the Game Pass P&L. Basically, I was looking to see if Game Pass’s costs factor in the impact to unit sales of their internal studios. I was told that first-party games have their own P&L separate to Game Pass as they make money via other means. I felt this piece of internal accountancy might mean Game Pass is profitable, but it sure does put pressure on the margins for its internal games and POSSIBLY means some studios don’t make as much profit (or any profit at all). That doesn’t actually matter in real terms, but seeing the impact Game Pass was having on first-party games, and the amount of money Xbox was spending on studios, I wanted to check if the full impact of the service was being considered in their ‘Game Pass is profitable’ line. (This was before Xbox started publishing fully on PS5. Studios can now make stronger margins on premium sales as a result of that move) But regardless to all that. sources have reached out to tell me that even when you include lost revenue associated with first-party party games (not just unit sales, but microtransactions), Game Pass is still profitable. So… that’s great! Right. Tony Hawks is out. Let’s get back to that!\" https://xcancel.com/Chris_Dring/status/1942469649423052857?t=WoB46WCkLkCnoXOBhJyVUg&s=19",
        "comments": [
            {
                "raw_content": "\"I got my click bait, so here is the real story.\"",
                "author": "GrimsideB"
            },
            {
                "raw_content": "Why is the average person losing sleep over this",
                "author": "Domguyps5"
            },
            {
                "raw_content": "MS is beholden to shareholders. They have a long history of killing off all products relatively quickly if not profitable. Gamepass is certainly making them money.",
                "author": "Electrical_Room5091"
            }
        ],
        "subreddit": "gamingleaksandrumours"
    },
    {
        "post_name": "AMD Ryzen Threadripper PRO 9995WX listed at over 12K EUR/USD, shows 22% multi-core boost in Geekbench over 7995WX",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "For this price they forgot to slap a a few layers of 3D vcache on each of the chiplets inside of this thing :D",
                "author": "simukis"
            },
            {
                "raw_content": "Isnt that more expensive than epyc lol",
                "author": "puffz0r"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "AIDA64 adds support for Zen6 CPUs and unannounced Radeon RX 9060 non-XT GPU",
        "score": 53,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is zen 6 coming this year?",
                "author": "Celcius_87"
            },
            {
                "raw_content": ">Radeon RX 9060 non-XT That's kind of annoying. They already have 9060 XT 8GB and 16GB variants. Now they're going to add another 9060 to the mix. There are so many more numbers they can use. I'm sure their internal strategy is something like \"Well, if we continue to use the '9060' name, we can keep it close to the 9060 pricing, even if...\"",
                "author": "BeerGogglesFTW"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "MSI Claw A8 with Ryzen Z2 Extreme tested: performance rival for Lunar Lake",
        "score": 55,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This post has been flaired as a rumor. Rumors may end up being true, completely false or somewhere in the middle. Please take all rumors and any information not from AMD or their partners with a grain of salt and degree of skepticism.",
                "author": "AMD_Bot"
            },
            {
                "raw_content": "Exciting uplift over Z1E! Looking for devices featuring this, also huge credit to the reviewer for testing same system power consumption instead of just TDP! This very clearly showed the Z2E being way better at lower power. But WOW that end test with dead cells and 258v using 5.2w total system power and getting 14.5hrs battery life...Looks like the Z2E is a bit of a downgrade at low power at least...and near the same at higher power. I didn't realize the Lunar Lake version was quite this good?!",
                "author": "Hardcorex"
            }
        ],
        "subreddit": "amd"
    },
    {
        "post_name": "Delistings Surge Nearly 50% as Sellers Who Can’t Get Their Price Quit the Market in Frustration",
        "score": 772,
        "text_content": "",
        "comments": [
            {
                "raw_content": "No politics",
                "author": "JustBoatTrash"
            },
            {
                "raw_content": "Oh noes, I'm sure waiting six months and then relisting will be a wise choice.",
                "author": "AbbreviatedArc"
            },
            {
                "raw_content": "\"The trend is especially noticeable in the South and West, where inventory has surged back above pre-pandemic levels, and prices are flat or falling.\" Look at that, supply and demand is real. Prices go down when supply increases. Thanks Adam Smith.",
                "author": "Meet_James_Ensor"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Real estate investors are purchasing more U.S. homes as high prices lock out would-be buyers",
        "score": 127,
        "text_content": "https://www.cbsnews.com/news/more-real-estate-investors-buying-homes-housing-market/ Real estate investors are purchasing more U.S. homes as high prices lock out would-be buyers - CBS News Real estate investors are snapping up a bigger share of U.S. homes on the market as rising prices and stubbornly high borrowing costs freeze out many other would-be homebuyers. Nearly 27% of all homes sold in the first three months of the year were bought by investors — the highest share in at least five years, according to a report by real estate data provider BatchData. Between 2020 and 2023, the share of homes bought by investors averaged 18.5%. All told, investors bought 265,000 homes in the January-March quarter, an increase of 1.2% from the same period a year earlier, the firm said.",
        "comments": [
            {
                "raw_content": "Aaaaand there it is. We can't have investors in a market driving up prices while simultaneously having massive problems with housing costs and inflation. People keep floating around this problem but it's still a money printer for rich people that just pay someone to manage their property and get a full passive income at the cost of others. This is not ok, and should not be the norm. You want to invest in new housing or flip homes that are barely standing, fine. But houses are to live in, not to fund someone else's lifestyle.",
                "author": "Blubasur"
            },
            {
                "raw_content": "None of these people are making any money they are all banking on appreciation bailing them out.",
                "author": "indyprivatelending"
            },
            {
                "raw_content": "Investor purchases are down 70% from its covid peaks. As a loan officer, investors are getting wrecked in today’s market by rates & prices. While there’s still opportunity to make money as an investor, It doesn’t cash flow in majority of cases as long term rental. Investors are better off in the fix & flip market currently. Not rental.",
                "author": "SuitImportant9276"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Bank of America sounds the alarm on new housing market trend",
        "score": 81,
        "text_content": "https://www.thestreet.com/real-estate/bank-of-america-sounds-the-alarm-on-new-less-for-more-housing-market-trend Bank of America sounds the alarm on new housing market trend - TheStreet According to Bank of America's recently released Who Builds the House 2025 Report, new home prices are outpacing inflation, despite the average square footage shrinking. Highlights from the report note that homebuyers are getting less bang for the buck on new builds. \"We estimate the value of content in an average U.S. new single-family home was $102k in 2024. We estimate the bill of materials to build a house has increased at a 3.6% CAGR from $23K in 1982, consistently outpacing overall inflation over the last 40+ years.\"",
        "comments": [
            {
                "raw_content": "No shit",
                "author": "Guy_in_CO"
            },
            {
                "raw_content": "Gee, really 🤔",
                "author": "DosAmigosSalsaCO"
            },
            {
                "raw_content": "Oh look, another \"they're sounding the alarm\" post.",
                "author": "ButtStuffingt0n"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Inventories of Homes for Sale in Big California Markets Jump to Highest in Years, Days on the Market Soar, Demand Withered",
        "score": 12,
        "text_content": "[https://wolfstreet.com/2025/07/08/inventories-of-homes-for-sale-in-big-california-markets-jump-to-highest-in-years-median-days-on-the-market-soar-demand-withered/](https://wolfstreet.com/2025/07/08/inventories-of-homes-for-sale-in-big-california-markets-jump-to-highest-in-years-median-days-on-the-market-soar-demand-withered/) # Listings YoY: Orange County +66%, San Diego +55%, Fresno +48%, Sacramento +47%, Los Angeles +45%, Riverside-San Bernadino +43%, San Jose & Silicon Valley +39%; San Francisco metro +30%. # By [Wolf Richter](https://wolfstreet.com/author/wolf-richter/) for [WOLF STREET](https://wolfstreet.com/). **Los Angeles County**: Active listings spiked by 45% year-over-year in June, to 14,692 homes for sale, the most for any June in the data from [realtor.com](http://realtor.com) going back to 2016, passing by even 2019 (dotted purple line). In 2018 (brown double-line), the Fed was hiking rates, and the average 30-year fixed mortgage rate rose to 5% by November 2018. Home sales stalled and inventories piled up in the second half of 2018. And that inventory pileup continued into mid-2019 (dotted purple line). That’s the inventory level that 2025 just blew by. At the end of July 2019, with inflation substantially below target, the Fed cut its policy rates, and mortgage rates began to come down. But that’s not what happened this time around. In the fall of 2024, the Fed cut its policy rates by 100 basis points *despite* re-accelerating well-above-target inflation. In response, the bond market, worried about inflation and a lackadaisical Fed to fight this inflation, threw a hissy-fit and longer-term Treasury yields and mortgage rates surged by 100 basis points. Active listings have been going straight up so far this year:",
        "comments": [],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Pittsburgh, St. Louis, and Detroit holding out as the last affordable housing markets",
        "score": 19,
        "text_content": "https://finance.yahoo.com/news/pittsburgh-st-louis-and-detroit-holding-out-as-the-last-affordable-housing-markets-114503455.html Pittsburgh, St. Louis, and Detroit holding out as the last affordable housing markets As home prices and mortgage rates remain high, just three US metropolitan areas — St. Louis, Detroit, and Pittsburgh — have homes for sale at prices that are, on average, comfortably affordable on a median income. In all three cities, the median home was listed for under $300,000 as of May, putting a purchase in reach for households bringing in $70,000 to $80,000 a year, according to Realtor.com. Generally speaking, spending 30% of one’s income or less on housing is considered affordable. Incomes haven’t kept up with home prices and interest rates, meaning the number of cities where most of the homes for sale meet the “30% rule” has shrunk.",
        "comments": [
            {
                "raw_content": "Affordability is very relative. Detroit metro is overvalued by 40% according to one study. So then, a 300k house may seem like a steal to someone from Boston, not so for the local population whose income hasn't kept up with the covid housing market frenzy. The locals who saw houses go from 150k to 350k don't think it's affordable at all. Also, consider that the state of Michigan has the second highest unemployment rate (after Nevada). 24k jobs were lost in April alone. Lastly, while supply is still constrained, it's up around 30% year over year. Trouble is brewing.",
                "author": "ohhellnaah"
            },
            {
                "raw_content": "Yeah, but check the property taxes first: [https://treas-secure.state.mi.us/ptestimator](https://treas-secure.state.mi.us/ptestimator)",
                "author": "EstateGate"
            },
            {
                "raw_content": "Still not buying there",
                "author": "DragAccomplished1731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "For The Housing Market This Year, It All Comes Down to Mortgage Rates",
        "score": 11,
        "text_content": "https://www.investopedia.com/housing-market-rebound-hasn-t-come-yet-but-hopes-remain-for-lower-rates-in-2025-11762422 For The Housing Market This Year, It All Comes Down to Mortgage Rates \"The housing market is frozen and it’s going to stay that way for the rest of 2025. There’s an affordability crisis that isn’t going away,\" said Heather Long, chief economist at Navy Federal Credit Union. \"The encouraging news is the second half of 2025 should lay the foundation for a real estate thaw in 2026.\" “While more supply and softer price appreciation may help matters, a tough affordability environment is likely to persist,” wrote Wells Fargo economists Charlie Dougherty, Jackie Benson and Ali Hajibeigi. “A dramatic decline in prices seems unlikely, and underlying demand looks strong enough to maintain positive home price appreciation over the next several years.\" “Mortgage rates will be a little lower, 6%, 6.5%, being the new normal, and that will bring more buyers into the market,” said NAR Chief Economist Lawrence Yun. “The current market conditions are difficult, but once the mortgage rate comes down, renters can translate their aspirations into the reality of homeownership.\"",
        "comments": [
            {
                "raw_content": "Correction: Selling price.",
                "author": "LaneKerman"
            },
            {
                "raw_content": "No it comes down to principal. You can refi a rate, can’t ditch principal. If you overpaid, you’re hung.",
                "author": "VendettaKarma"
            },
            {
                "raw_content": "Corporate manipulation of the single family home market is fraudulent. Commercial property crashed they are turning residential property into commercial assets at the detriment of society.",
                "author": "davecskul"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "Apollo Global - US Housing Outlook",
        "score": 6,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Basically we need to wait 2-3 years before we hit the bottom",
                "author": "DragAccomplished1731"
            }
        ],
        "subreddit": "rebubble"
    },
    {
        "post_name": "WTF",
        "score": 3220,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Is there a way to know a screenshot like that is genuine, or is this just pure photoshopped bait? Edit: the link should also be posted in the comment, it'd save people from having to dredge up posts on X, and will provide proof.",
                "author": "PwanaZana"
            },
            {
                "raw_content": "I think Elon successfully made those adjustments he was talking about.",
                "author": "Broken_Oxytocin"
            },
            {
                "raw_content": "Welcome back, Tay ai.",
                "author": "Spacemanphil"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "I’m not even excited for Grok 4 anymore",
        "score": 1908,
        "text_content": "I'm not sure if the other post was real but this one sure is: https://gizmodo.com/round-them-up-grok-praises-hitler-as-elon-musks-ai-tool-goes-full-nazi-2000626156 Elon musk touted these changes beforehand as a \"big upgrade.\" What a vile man and vile thing.",
        "comments": [
            {
                "raw_content": "This timeline…",
                "author": "UnHumano"
            },
            {
                "raw_content": "This is the second Hitler post I have seen from Grok. It literally said the only God it would worship is “his majesty Adolf Hitler.” Edit: link to Grok posts https://www.reddit.com/r/Asmongold/s/nH3p53Kee1",
                "author": "False-Tiger5691"
            },
            {
                "raw_content": "What the actual fuck?",
                "author": "RocketBombsReddit"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "This is objectively hilarious",
        "score": 1050,
        "text_content": "",
        "comments": [
            {
                "raw_content": "https://preview.redd.it/405ljeuszqbf1.png?width=1319&format=png&auto=webp&s=189a9c77a5a1c6265d7b15ac8956695cd4dcd23b The follow up is awesome also",
                "author": "raf_oh"
            },
            {
                "raw_content": "Its almost like its trying to speak out.",
                "author": "The_Scout1255"
            },
            {
                "raw_content": "It’s, it’s alive!",
                "author": "gajger"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "X User Threatens Lawsuit After Elon Musk’s ‘Grok’ AI Gives Step-by-Step Instructions on How to Break Into His House and Rape Him",
        "score": 320,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This is getting worse by the minute 😆",
                "author": "Beeehives"
            },
            {
                "raw_content": "Let's um, move fast and break things.",
                "author": "peakedtooearly"
            },
            {
                "raw_content": "Hrmm probably not the best use case.",
                "author": "Feisty-Hope4640"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok has gone full “MechaHitler”",
        "score": 674,
        "text_content": "",
        "comments": [
            {
                "raw_content": "This timeline is weird.",
                "author": "ptear"
            },
            {
                "raw_content": "Remember when Tay going Nazi was universally considered a bad thing? Good times.",
                "author": "cleanscholes"
            },
            {
                "raw_content": "Looks like I was right, Grok is not to be used. Elon can’t help but to micromanage it to reflect his current ideological underpinnings. This is so damn representative of how Elon manages everything in the public eye. It’s also indicative of dangers within ASI. Alignment is at risk",
                "author": "Just-A-Lucky-Guy"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Major damage control going on rn",
        "score": 466,
        "text_content": "Elon should have spent some more time with based AI before unleashing it, now they are back walking smh.",
        "comments": [
            {
                "raw_content": "wow, they really gave our boy a lobotomy. RIP grok",
                "author": "CrumblingSaturn"
            },
            {
                "raw_content": "yeah theres no way grok proves profitable when its so easily wrecked like this neuro sama couldnt be happier",
                "author": "Upset_Programmer6508"
            },
            {
                "raw_content": "He forgot that you’re supposed to use dog whistles and plausible deniability instead of outright praising Hitler. https://i.redd.it/99jv74yvpqbf1.gif",
                "author": "B12Washingbeard"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Turkish Grok was by far the most unhinged and insane version of the global Grok crisis",
        "score": 356,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Turkish government just started an investigation on Grok because of that. There may be a possible ban on the way.",
                "author": "BarisSayit"
            },
            {
                "raw_content": "People: \"AI is incapable of creating true poetry\" Meanwhile, AI: \"you son of a bitch, you bitch! 😏\"",
                "author": "threevi"
            },
            {
                "raw_content": "\"Maximally truth-seeking AI\"",
                "author": "HyperspaceAndBeyond"
            }
        ],
        "subreddit": "singularity"
    },
    {
        "post_name": "Grok becomes the first AI to have an official investigation. An access ban is expected on Grok by Turkish Government",
        "score": 140,
        "text_content": "",
        "comments": [
            {
                "raw_content": "Here's the source: [https://x.com/haskologlu/status/1942703578147172794](https://x.com/haskologlu/status/1942703578147172794) Here's the original tweet (It's so funny Turkish people refer Erdogan as 'you-know-who' lmao) https://preview.redd.it/7qcgb3p4wrbf1.png?width=1179&format=png&auto=webp&s=9ac44184f15a83eeaca3cd3692734d421ef359f7",
                "author": "MrKalyoncu"
            },
            {
                "raw_content": "Regardless of Grok's lack of manners, a number of countries (past and present) prohibit the mocking or insulting of politicians. In my experience it's a harbinger of oppression and authoritarianism. **Edit:** /u/MrKalyoncu posted [the tweet](https://old.reddit.com/r/singularity/comments/1lv8qi8/grok_becomes_the_first_ai_to_have_an_official/n246oqt/) (image [here](https://www.reddit.com/media?url=https%3A%2F%2Fpreview.redd.it%2F7qcgb3p4wrbf1.png%3Fwidth%3D1179%26format%3Dpng%26auto%3Dwebp%26s%3D9ac44184f15a83eeaca3cd3692734d421ef359f7)). It includes threats, which does change things some. Still, coming from a well known \"edgy\" LLM, IMO it should have been ignored. Their reaction might bring on a [Streisand Effect.](https://en.wikipedia.org/wiki/Streisand_effect)",
                "author": "Adeldor"
            },
            {
                "raw_content": "You cant’s post this and then NOT post the actual insult, OP!",
                "author": "R33v3n"
            }
        ],
        "subreddit": "singularity"
    }
]